[
  {
    "start": 11.033,
    "end": 11.434,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 11.534,
    "end": 12.155,
    "text": "Hey, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 12.596,
    "end": 15.5,
    "text": "It's Active Inference stream number 007.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 16.061,
    "end": 19.987,
    "text": "And it should be a great and exciting stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 20.468,
    "end": 25.536,
    "text": "It's November 7th, 2024, 7-11, depending on where you are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 25.576,
    "end": 33.229,
    "text": "And I'm going to begin the stream with a GitHub push that we are going to spend the next several hours probably unpacking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 35.092,
    "end": 35.893,
    "text": "Let's commit it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.987,
    "end": 46.693,
    "text": " Push it and begin what will be a very fun exploration into the Active Inference Institute's branch of PyMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 48.226,
    "end": 50.969,
    "text": " While it's writing, let's jump into the show.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 51.37,
    "end": 52.271,
    "text": "Here's where we're heading.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 52.992,
    "end": 74.959,
    "text": "We're heading into Shapley Value-Analyzed Homeostatic Satisfaction, Expected Free Energy, Belief Accuracy, and Control Efficiency analyses for multiple differently parameterized PMDP agents, base, risk-averse, exploratory, and balanced on those measures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 76.137,
    "end": 86.097,
    "text": " being able to analyze combinatorics like the synergies of their belief accuracy, control efficiency, expected free energy, and homeostatic satisfaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 86.363,
    "end": 96.234,
    "text": " We can look at the report and explore different topics like with respect to those variables, what's the mean Shapley contribution, coalition performance, best coalitions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 96.734,
    "end": 100.338,
    "text": "This is all combinations of zero, one, two, three, and four.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 101.039,
    "end": 106.765,
    "text": "So for example, for expected free energy, we see that the four unit coalition is the best.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 107.566,
    "end": 115.054,
    "text": "Whereas for homeostatic satisficing, zero, agent zero working alone does the best.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 116.401,
    "end": 123.829,
    "text": " Underneath these coalitions and their combinatorics are specific agents that are logged in individual experiments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 124.349,
    "end": 127.693,
    "text": "And here's some of the plots and how that looks for each individual agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 128.414,
    "end": 130.536,
    "text": "This is a given active inference agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 131.097,
    "end": 144.771,
    "text": "Here we have policy entropy over time, action selection distribution, belief observation cycle, belief accuracies over time, homeostatic state distributions and trajectories,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 146.185,
    "end": 174.268,
    "text": " state transitions policy selection probability policy updating decrease maintain and increase belief dynamics through time hidden state beliefs action frequencies policy convergences belief convergences correlations between beliefs and actions and action confidences so what that Shapley analysis is doing is running all the combinatorics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 174.552,
    "end": 177.777,
    "text": " Under the hood, this is going to be a wild ride.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 178.257,
    "end": 180.441,
    "text": "So let's confirm that the GitHub has pushed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 181.202,
    "end": 183.265,
    "text": "I'll put the code link in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 184.206,
    "end": 186.089,
    "text": "Welcome to the 007 fork.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 189.414,
    "end": 192.458,
    "text": "In the live chat, I will look forward to everyone's comments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 193.44,
    "end": 202.433,
    "text": "I am going to ensure that we are pushing the right way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 204.151,
    "end": 205.372,
    "text": " It still has not loaded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 207.354,
    "end": 212.139,
    "text": "Let's begin though with the 007 here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 216.063,
    "end": 217.825,
    "text": "Taking a little bit of time to upload on GitHub.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 218.786,
    "end": 220.368,
    "text": "Okay, here we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 220.928,
    "end": 230.078,
    "text": "A little bit more context before we dive into what may be some absurdly technical, but really useful and interesting things that have happened over the last few days and hours.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 231.719,
    "end": 232.42,
    "text": "Here's the stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 236.905,
    "end": 243.072,
    "text": " GNN for AgentMaker for PyMDP for Active Inference Biofirms for Bioregionalism for ANTS?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 244.294,
    "end": 245.515,
    "text": "Let's decompress that title.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 246.136,
    "end": 261.073,
    "text": "Generalized Notation Notation GNN as semantic middleware for AgentMaker, a custom robust modular agent engineering framework using PyMDP, Python language package",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 263.146,
    "end": 282.693,
    "text": " for Markov decision processes with methods for active inference and free energy-based inference methods for biofirms, as proposed by John Klippinger as a paradigm for firms in the age of bioregionalism as a mode of life, coextentialism for species like ants, people, and beyond.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 284.676,
    "end": 291.465,
    "text": "Here's some live stream code names and an only lightly redacted preludium for your priors only.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 291.698,
    "end": 292.939,
    "text": " Predictions are not enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 293.88,
    "end": 295.181,
    "text": "The agent who minimized me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 296.062,
    "end": 297.843,
    "text": "On her majesty's statistical service.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 298.764,
    "end": 299.745,
    "text": "Quantum of precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 300.385,
    "end": 301.246,
    "text": "Live and let update.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 302.107,
    "end": 305.209,
    "text": "Professor Friston, do you expect me to reach the optima?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 305.85,
    "end": 308.272,
    "text": "No, I expect you to optimize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 310.033,
    "end": 321.503,
    "text": "Just like they wrote at the end of the 2022 textbook, when the last words were, ultimately, we are confident that you will continue to pursue active inference in some form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 322.58,
    "end": 346.832,
    "text": " is that agent's generative model an mdp yes an mdp a po mdp as if the media were not already the message for you this is a just in time live stream going through raw open source code i know that there are bugs as well as typos incorrect or ineffective calculations other errors",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 347.133,
    "end": 357.268,
    "text": " This is speculative realism embodied in chaotic large-scale code coordination using cursor 0.42.4 and Claude 3.5 Sonnet 2024 1022.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 358.489,
    "end": 363.036,
    "text": "Use these linguistic and computational symbols at your own risk and delight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 364.418,
    "end": 370.827,
    "text": "If and as you are so inclined, you are invited to join our adventure and journey partially disclosed herein now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 373.151,
    "end": 376.195,
    "text": "Let's check again in the GitHub and proceed on regardless.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 387.278,
    "end": 392.025,
    "text": " I'm on another fork.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 392.045,
    "end": 394.689,
    "text": "That's what happens when you're on wild roads.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 395.79,
    "end": 397.873,
    "text": "It will come to the Institute's repo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 398.514,
    "end": 401.378,
    "text": "It went to my own personal accounts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 401.739,
    "end": 402.5,
    "text": "Let's head over there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 402.56,
    "end": 414.737,
    "text": "I'm putting in the YouTube live chat, my own doxology GitHub, and we're going to continue on through there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 419.729,
    "end": 445.99,
    "text": " mdp agent maker stream 007 all right a little bit of background information before we jump into the code thanks those who are in the live chat write any comments and questions and you may get memed on stream we are working on robust middleware that interfaces between core",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 446.307,
    "end": 473.445,
    "text": " active inference implementations and powerful accessible interpretable semantic toolkits for synthetic intelligence engineering architecture layers here's a way to think about active inference middleware and active inference as middleware as we will reveal later on layer one core or kernel inference implementations today we're going to be looking at that with py mdp in the python programming language",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 473.678,
    "end": 479.525,
    "text": " We can also make this happen through generalized notation, notation using rxinfer.jl, Julia.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 480.346,
    "end": 486.714,
    "text": "We could use machine learning methods, also known as amortized inference in different languages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 487.676,
    "end": 491.46,
    "text": "At the core, we could use logical reasoning like J.F.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 491.48,
    "end": 494.124,
    "text": "Cloutier's symbolic active inference work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 495.125,
    "end": 502.234,
    "text": "We could, at the core, use biological, soft, active, and quantum matter and other substrates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 502.72,
    "end": 505.81,
    "text": " What we're focusing on here is the middleware layer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 506.632,
    "end": 513.294,
    "text": "Specifically, we're going to be peeling back to the point where we look at GNN as an interface between the inner and the meso layers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 514.718,
    "end": 516.544,
    "text": "Middleware for active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 517.688,
    "end": 537.705,
    "text": " pending future re-understandings, is packages like AgentMaker, which we're going to look at today, Farmworks, InfraAnt, and other kinds of domain or domain general systems that interface between the core implementation methods, which as part of their beauty and elegance have simplicity,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 537.871,
    "end": 547.667,
    "text": " and outer layer systems of interest, real-world touchpoints and design interfaces and domain adaptations mapping to mezzo or outer layers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 548.287,
    "end": 556.2,
    "text": "So think about farm OS as running on a farm embodiment core and facing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 557.142,
    "end": 561.508,
    "text": " farmers and individuals interacting with that data set, to give an agricultural example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 562.289,
    "end": 564.251,
    "text": "Something similar is happening for active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 565.053,
    "end": 566.134,
    "text": "Here's another key analogy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 566.995,
    "end": 577.429,
    "text": "GNN plus AgentMaker plus PyMDP plus et cetera, plus, plus, plus, is to active inference as eBPF is to the Linux kernel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 578.033,
    "end": 586.981,
    "text": " The slogan of eBPF, and check it out if you haven't looked into it already, is dynamically program the kernel for efficient networking, observability, tracing, and security.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 587.882,
    "end": 596.589,
    "text": "We can modify that slogan for GNN AgentMaker, dynamically program the agent for robust and efficient inference, planning, and action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 597.811,
    "end": 600.253,
    "text": "Okay, here's the analysis agenda.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 600.873,
    "end": 607.399,
    "text": "We're going to run biofirm.py and all it entails, running back layers, layers, layers, layers, layers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 608.172,
    "end": 630.349,
    "text": " going to talk about eventually getting back to the root of the generation and the initialization initiation of the agent in the generalized notation notation format and then we will trace back that to an april 2023 paper written with the now stanford graduate student yakup",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 631.831,
    "end": 643.903,
    "text": " It was a great collaboration last year, and we made many memetic thrusts and queries towards developing this into something that could be used with LLMs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 644.824,
    "end": 657.096,
    "text": "We put it on the shelf for a little bit, for a few months, and now GNN is back, not with a vengeance, but with a functional utility that surprised even me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 658.713,
    "end": 676.869,
    "text": " After running through the script in its functional and analytical beauty, we will return to first, whatever ideas people have added in the live chat, talk about open source development, testing, deployment, education, security, theory, math, art, and more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 677.49,
    "end": 680.733,
    "text": "And about what comes after agent maker 0.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 681.754,
    "end": 686.458,
    "text": "I'd also like to recognize some of the recent events and developments",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 687.097,
    "end": 702.531,
    "text": " In the Biofirm repo, following InfraAnt Stream 6, oh how long ago, by Andrew Pachea, who has added some very cool surprise and Shapley value modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 703.534,
    "end": 704.616,
    "text": "Let's take a look at that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 713.472,
    "end": 719.964,
    "text": " Here's the history of surprise for these different natural resource biofirm sub-agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 727.177,
    "end": 727.498,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 730.87,
    "end": 737.338,
    "text": " their token accumulation history in a Shapley value oriented incentive paradigm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 737.718,
    "end": 739.08,
    "text": "Super cool, Andrew.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 739.12,
    "end": 743.746,
    "text": "It pushed me over the edge to add in the Shapley value before the stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 744.006,
    "end": 749.593,
    "text": "And I'm super looking forward to the collaborations and where this all goes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 750.514,
    "end": 754.819,
    "text": "I'd also like to show a cursor acknowledgement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 754.799,
    "end": 774.934,
    "text": " this is in the midst of some truly heated epistemic moments that claude 3.5 sonnet 2024 1022 and i shared i wrote this is incredible work fyi everyone thanks you just give the acknowledgement here that you feel proper then we will continue with the work",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 775.589,
    "end": 778.072,
    "text": " Claude wrote, thank you for the kind words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 778.592,
    "end": 788.402,
    "text": "I should acknowledge that this work builds on several important foundations, active inference theory, PyMDP framework, homeostatic control and software engineering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 789.263,
    "end": 791.205,
    "text": "Shall we continue with the work?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 791.225,
    "end": 791.966,
    "text": "Yes, Claude.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 792.967,
    "end": 793.327,
    "text": "Let's.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 795.27,
    "end": 795.61,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 796.611,
    "end": 802.457,
    "text": "We are in the agent maker folder within the PyMDP package itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 804.445,
    "end": 817.478,
    "text": " Following the biofirm 006 stream, as usual, it was getting messy and choppy with all of these scripts calling each other from the same folder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 818.379,
    "end": 831.752,
    "text": "We were getting a little bit complex for our britches, and it was time to think about not just calling the core PyMDP utilities, but burrowing in, making stigmergic tunnels among them,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 832.475,
    "end": 842.431,
    "text": " and being a part of the PyMDP package, which again, I hope to, and we will push and develop on the Institute branch for the stewardship that that can afford.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 845.316,
    "end": 856.474,
    "text": "BioFirm again, standalone calling PyMDP, but what we'll be looking at for the rest of the stream is burrowed in amidst the PyMDP modules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 861.652,
    "end": 863.595,
    "text": " are several new modules that have been added.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 863.975,
    "end": 870.904,
    "text": "So let's do a side-by-side with the PyMDP and the PyMDP fork.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 872.627,
    "end": 880.217,
    "text": "So here we are with the fork sidebar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 883.285,
    "end": 887.629,
    "text": " And here we are with the main sidebar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 888.53,
    "end": 907.487,
    "text": "So in the main package, the folders under pyMDP are algos, which are algorithms, environments, and jacks, which is like a sub branch for a lot of methods that uses the Python jacks method.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 908.748,
    "end": 913.292,
    "text": "There's been a proliferation of folders, I really have to say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 913.762,
    "end": 936.428,
    "text": " agent maker alphabetically is first we're going to look more at agent maker a lot following agent maker algos remains envs in remains we have the gnn folder which we're going to get to in part two we have the maths folder some of this is just arbitrary others is accidental",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 937.42,
    "end": 951.028,
    "text": " There's the meta.pyMDP folder with but one simple script, which outputs a plain text folder, concatenating all the pyMDP methods in a text file.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 951.048,
    "end": 957.201,
    "text": "Reflects with a JSON and a text file, the folder structure of the meta repo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 958.514,
    "end": 961.318,
    "text": " This is another useful trick that you can use in other repos.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 961.718,
    "end": 972.113,
    "text": "It helps give extra context, an extra helping of context, we might even say, to Cursor so that it can do the accurate cross folder operations we need.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 972.713,
    "end": 974.336,
    "text": "There's a utils folder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 975.137,
    "end": 980.344,
    "text": "There are also pyMDP utils scripts, but I wanted to make a separate folder to keep them separate and versionable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 980.764,
    "end": 983.408,
    "text": "And then there's a visualization folder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 983.388,
    "end": 987.936,
    "text": " with a variety of biofirm, GNN, and matrix visualization methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 988.517,
    "end": 993.626,
    "text": "So let us go to now the agent maker folder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 994.908,
    "end": 1002.882,
    "text": "And we're going to start from the outermost layer, which is trying to understand the Shapley value contributions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1002.862,
    "end": 1032.717,
    "text": " to the homeostasis of different combinations of multi-agent systems and this has been absolutely championed by john flippinger so for this and many of other contributions made by john and other people it's just awesome that we can see active inference getting to a point where we can actually run out these incredible shapley analyses that themselves are built upon multiple levels of inference and intelligence",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1033.658,
    "end": 1053.085,
    "text": " okay first to the biofirm Shapley script that was run 1200 lines again as another discourse that I will try not to return to that much cursor plus improvements in LLMs has been completely transformative check the earlier inference streams from who knows how many days ago",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1053.065,
    "end": 1067.243,
    "text": " even at three four hundred lines of code we were splitting them now on top of a functional run biofirm script it can pop out with a few prompts 1200 functional lines that take",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1067.51,
    "end": 1077.239,
    "text": " the operativity of one functional BioFirm agent and wrap that into another incredible layer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1078.12,
    "end": 1083.085,
    "text": "So, right click, open an integrated terminal, Python 3, BioFirm, Shapley.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1083.765,
    "end": 1085.847,
    "text": "Let's analyze what is happening when we run this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1087.529,
    "end": 1097.398,
    "text": "It begins with creating, in this case, because it's looking at multiple different agents, it creates multiple agent variations on a theme, kind of like Gödel Escherbach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1098.678,
    "end": 1103.705,
    "text": " and defines the metrics and defines the combinatorics of the agent coalitions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1104.006,
    "end": 1105.768,
    "text": "0, 1, 2, 3, 4 agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1106.289,
    "end": 1107.07,
    "text": "A TET's all you need.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1109.173,
    "end": 1112.998,
    "text": "It then enters into the experimentation at the level of each coalition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1114.38,
    "end": 1116.984,
    "text": "Defines the output directory, the environment, the agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1117.465,
    "end": 1122.492,
    "text": "Now we're popping down into the level of this first BioFirm experiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1123.585,
    "end": 1125.488,
    "text": " Stage one, matrix rendering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1126.129,
    "end": 1131.698,
    "text": "Here, the environment and agent GNN are brought in and logged copiously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1132.219,
    "end": 1133.361,
    "text": "Again, eBPF.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1133.942,
    "end": 1137.588,
    "text": "The logging, how many times have we all been coding with PyMDP?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1137.728,
    "end": 1143.518,
    "text": "And then it's like, shape three comma zero can't be coerced into a NumPy array.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1143.498,
    "end": 1170.467,
    "text": " and it's like what so that is a lot of the abstraction that i sought to abstract over here okay it it happened a little bit fast and pushed us away where we were i'm just going to run it again so that we okay just so we can see stage one two three for a given experiment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1179.02,
    "end": 1180.182,
    "text": " So here's another experiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1182.246,
    "end": 1193.366,
    "text": "Coalition 1.0, output environment agent, stage one, matrix rendering, initializing the biofirm renderer, logging copiously all the combinatorics of where everything is going to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1193.406,
    "end": 1196.472,
    "text": "It's not for me, it's for the LLM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1198.856,
    "end": 1201.922,
    "text": "We get into the loading of the GNN models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1203.168,
    "end": 1205.592,
    "text": " There's normalization methods that happened.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1206.253,
    "end": 1207.996,
    "text": "I did ask, I said, are you really sure?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1208.056,
    "end": 1211.582,
    "text": "Like, it's giving me a warning about action zero and two not being normalized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1211.602,
    "end": 1213.064,
    "text": "And it's like, relax.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1213.806,
    "end": 1218.714,
    "text": "You're just not being wide enough with how you're accepting it being normalized or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1218.774,
    "end": 1219.896,
    "text": "I thought, okay, fine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1220.176,
    "end": 1221.578,
    "text": "It works, it works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1221.598,
    "end": 1223.742,
    "text": "But like many things, these can be improved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1224.751,
    "end": 1229.899,
    "text": " it loads in and describes the shape of all the variables that are needed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1230.439,
    "end": 1242.237,
    "text": "And this was the big work that Jakub and I engaged in, which was surely we can have some kind of markdown syntax or dialect that would enable the triple play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1242.52,
    "end": 1249.51,
    "text": " a pragmatic approach to expressing GNN in linguistic, visual, and executable, and graphical cognitive models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1250.05,
    "end": 1251.873,
    "text": "Yes, there are four components in the triple play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1252.794,
    "end": 1256.399,
    "text": "And how would we have that kind of integrity across representations?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1257.24,
    "end": 1260.204,
    "text": "That's what GNN enables, and we're going to peel back to that layer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1262.287,
    "end": 1269.557,
    "text": "After defining the matrices and their shapes, the actual simulation begins to occur.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1270.82,
    "end": 1276.586,
    "text": " and there's some logging, giving peeping into the actions that are being taken, the values and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1277.347,
    "end": 1284.295,
    "text": "Matrices are saved and validated along the way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1286.778,
    "end": 1291.363,
    "text": "Environment matrices and agent matrices are saved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1292.204,
    "end": 1294.927,
    "text": "That was the first phase.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1297.65,
    "end": 1298.751,
    "text": "In the simulation,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1301.566,
    "end": 1313.457,
    "text": " the time steps that are specified in the config file are used.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1313.477,
    "end": 1315.322,
    "text": "So here is a very",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1316.872,
    "end": 1324.863,
    "text": " built up config file defining project root, paths, environments, and the meaning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1325.904,
    "end": 1327.266,
    "text": "And we're going to return to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1327.687,
    "end": 1344.87,
    "text": "GNN has the absolutely critical role of separating the state space specification, the parameterization of a variable with the English language active inference ontology assertion about that variable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1345.053,
    "end": 1350.24,
    "text": " Without that kind of articulation, you'll end up naming your variables thing like observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1350.82,
    "end": 1359.391,
    "text": "And that makes sense when you're just thinking about one agent, but that agent's observation goes on to become someone else's action or vice versa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1359.872,
    "end": 1370.605,
    "text": "So how do we prevent using natural language to implicitly semantically load the names of the variables",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1371.985,
    "end": 1382.419,
    "text": " How do we move to a place where we can make uniquely identifiable computationally tagged variables and then have one or more assertions about what to call those variables?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1382.86,
    "end": 1392.593,
    "text": "So GNN is all about having a little bit of a gap and space between the specification of the variable and how we think about its role in the active inference ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1392.826,
    "end": 1400.919,
    "text": " Here's the experimental config, name of the experiment, time steps, rendering, options to render, visualize, clean output.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1400.939,
    "end": 1402.722,
    "text": "Here are the parameters that are getting passed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1402.863,
    "end": 1408.352,
    "text": "So this is well set up for those who like to sweep across parameters like ecological noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1409.453,
    "end": 1411.517,
    "text": "That's how much the ecosystem varies on its own.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1412.078,
    "end": 1417.146,
    "text": "Controllability, that's the efficacy of action of the agent, whether it knows it or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1417.126,
    "end": 1418.229,
    "text": " Policy precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1418.79,
    "end": 1433.025,
    "text": "This is how the policy posterior, sharpened from the policy prior by expected free energy, is modulated by then a temperature term that either sharpens or flattens distinctions amongst policy posteriors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1433.36,
    "end": 1460.346,
    "text": " use state info gain is true that is using epistemic value in policy selection as an information gain term as opposed to flagging this to false would only calculate expected utility and functionally be like a reward or reinforcement or utility maximizer inference horizon has been kept at one i'm not sure how planning would unfold but it'd be possible it'd work or we'd have to see",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1460.326,
    "end": 1483.633,
    "text": " and then action selection could be stochastic sampling from the policy posterior or deterministically drawing the most up-weighted policy and then some flags related to the tracing and logging within the active inference loop which is giving us a new visibility into what's happening at each time step for each agent in this setting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1485.503,
    "end": 1488.327,
    "text": " Simulation is executed, goes through the time steps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1489.229,
    "end": 1493.055,
    "text": "And then in stage three, which is where we interrupted it, it does agent specific.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1493.195,
    "end": 1500.106,
    "text": "Everything right now is being output into this sandbox folder, subfolder biofirm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1500.587,
    "end": 1503.411,
    "text": "So each experiment, let's look through what happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1505.737,
    "end": 1507.72,
    "text": " Okay, first render.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1507.98,
    "end": 1512.186,
    "text": "Now this is all reflecting what run biofirm does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1513.067,
    "end": 1519.176,
    "text": "Run biofirm is a small script of only less than 300 lines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1520.537,
    "end": 1526.766,
    "text": "And what it does is it logs and times, as we'll see now, Python 3 run biofirm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1528.973,
    "end": 1533.498,
    "text": " Now we're going to see what the Shapley experiment was doing across coalitions of multiple agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1533.618,
    "end": 1536.101,
    "text": "And we're just going to run that for one agent for one trace.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1537.042,
    "end": 1540.326,
    "text": "So let's clear it and run it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1541.167,
    "end": 1543.65,
    "text": "Deleting sandbox and looking at how the outputs are made.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1545.092,
    "end": 1545.632,
    "text": "Run biofirm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1548.195,
    "end": 1549.277,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1549.297,
    "end": 1550.178,
    "text": "We see it start up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1551.579,
    "end": 1555.504,
    "text": "First thing is we see sandbox come on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1556.497,
    "end": 1579.973,
    "text": " folders are made where they're not and so this process of iteratively deleting the folders rerunning deleting rerunning deleting rerunning going to a different machine seeing if it works without installing and all this other stuff that's part of making this at least some extent robust but of course I'm looking forward to working with more experienced and software engineers who can really",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1580.442,
    "end": 1586.478,
    "text": " work with some of these raw concepts and make them do something that this is only hinting at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1587.08,
    "end": 1588.042,
    "text": "So here we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1588.062,
    "end": 1592.173,
    "text": "Full trace for one agent maker run biofirm",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1592.93,
    "end": 1594.412,
    "text": " event, let's call it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1595.173,
    "end": 1601.622,
    "text": "So BioFirm Experiment, it's called BioFirm Experiment, output directory, environment and agent files as GNN files.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1601.963,
    "end": 1604.847,
    "text": "Let's take a quick peek at what the agent GNN files look like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1605.668,
    "end": 1610.295,
    "text": "Here we see the agent defined in terms of the state space that it's operating in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1611.036,
    "end": 1612.378,
    "text": "That's the ecological state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1612.398,
    "end": 1613.399,
    "text": "That's the latent state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1613.479,
    "end": 1614.621,
    "text": "That's like temperature in the room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1615.162,
    "end": 1617.865,
    "text": "Here there's three discrete options and we're gonna give them a label.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1618.246,
    "end": 1622.532,
    "text": "So again, this opens up the idea of having like English labels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1622.512,
    "end": 1632.726,
    "text": " And then we could have another field for a difference language because it puts some space between the name and what it's really doing functionally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1633.367,
    "end": 1634.969,
    "text": "Here's similar for observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1635.77,
    "end": 1639.335,
    "text": "And also within the observation is the A-metrics associated with that modality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1640.937,
    "end": 1651.692,
    "text": "Another thing I'll mention is I began with testing the GNN concept on the T-Maze example from PyMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1652.144,
    "end": 1663.883,
    "text": " and I overbuilt a multimodality GNN situation for the multimodality TMAs, and then pulled it back to the single modality biofirm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1664.524,
    "end": 1668.01,
    "text": "Again, just another method for overbuilding and then pruning back to functionality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1668.55,
    "end": 1674.18,
    "text": "Here's the A matrix specified next to the observations associated A matrix with the observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1674.981,
    "end": 1676.103,
    "text": "Here's the transition model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1676.483,
    "end": 1679.468,
    "text": "This is the B matrix with respect to ecological state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1682.317,
    "end": 1683.94,
    "text": " the matrices are defined here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1685.001,
    "end": 1703.691,
    "text": "So for those who are learning what the syntax and semantics of active inference A, B, C, D, E are, this hopefully can make it really clear instead of being specified like in a browser accessible notebook, it gives a first introductory place to look at how the matrices work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1704.252,
    "end": 1706.215,
    "text": "However, for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1706.195,
    "end": 1732.928,
    "text": " modulating and mutating and genetic algorithms and sweeping and optimization all these things this kind of machinery is what jacob and i have been thrilled about for years now policies pi all the information that's required for pi mdp to handle the specification these policies and the gnn can be overbuilt you could have policies like whether it is acceptable like can double o7 do it or only double o1",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1733.802,
    "end": 1739.869,
    "text": " And then if a given rendering didn't need to know that information, it could just discard it from the JSON or not take it into account.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1740.55,
    "end": 1742.232,
    "text": "Preferences, that's the C matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1742.853,
    "end": 1746.818,
    "text": "Here, it's a preference over the state observation, the observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1747.378,
    "end": 1755.048,
    "text": "And the C matrix looks like 0, 4, 0, with the associated labels, low, homeostatic, and high.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1755.708,
    "end": 1763.758,
    "text": "So again, the separation between the variables used in active inference for the shapes and the sizes they are,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1764.532,
    "end": 1779.778,
    "text": " And the English language assertions of annotations with active inference ontology terms is a gap that if you can keep it open, will give you so many more abilities to work with active inference in different settings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1780.199,
    "end": 1786.59,
    "text": "And then lastly, the initial beliefs or the D matrix, the initial prior on ecological state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1786.57,
    "end": 1788.873,
    "text": " linked through the keys of that name.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1789.914,
    "end": 1795.682,
    "text": "And it's 80% in homeostatic and 10% for each of low and high.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1795.702,
    "end": 1798.226,
    "text": "So that's an example of what the biofirm GNN looks like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1798.246,
    "end": 1800.409,
    "text": "And then here's the biofirm environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1800.929,
    "end": 1803.152,
    "text": "This is a slightly simpler GNN file.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1803.953,
    "end": 1807.578,
    "text": "Here, it again hinges on the same ecological state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1808.179,
    "end": 1814.147,
    "text": "That's how we can connect hidden state factors as an agent infers them to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1814.87,
    "end": 1820.621,
    "text": " and the actual ecological simulation happening in the generative process or in the surrounding environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1821.102,
    "end": 1828.356,
    "text": "Otherwise, you can have a situation where it's like, okay, the agent's predicting temperature and then the ecological simulation is pH.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1829.213,
    "end": 1849.669,
    "text": " And then how would we even know when we're going to be working in settings with so many different variables and observations and latent states and more and plus, plus, plus, that the idea of loading the semantics of what something does into the English language of a variable name, quickly you will understand why Jakob and I did what we did.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1850.442,
    "end": 1855.3,
    "text": " Here we have the observations being passed from the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1855.701,
    "end": 1857.829,
    "text": "That's like an A matrix for the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1858.652,
    "end": 1861.482,
    "text": "It has an symmetric A matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1862.288,
    "end": 1865.532,
    "text": " Here's the transition model of the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1865.552,
    "end": 1887.638,
    "text": "So check out chapter seven in the 22 textbook or step-by-step by Smith at all, where there's a step up from static Bayesian perception to dynamic Bayesian perception, the music listening example, where there's probabilistic inference about what note is supposed to be played based upon what note is heard.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1888.124,
    "end": 1891.289,
    "text": " but there's no action intervention in between the hidden state updates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1891.309,
    "end": 1900.185,
    "text": "So it's like a single slice of B. That's just a partially observable Markov process, but not a decision process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1901.247,
    "end": 1904.412,
    "text": "And then here to actually make it an MDP,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1905.353,
    "end": 1917.185,
    "text": " the agent's actions are given the efficacy represented in these from-to matrices as slices of B. So there's different ways that you could simulate the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1917.225,
    "end": 1929.538,
    "text": "It could just be like a government API, or it could be a POMDP, or it could be a POMP, or it could be a MP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1929.518,
    "end": 1958.563,
    "text": " and then the initial state in terms of sampling from a prior on its own sort of d so that's what the gnm file looks like but we're going to pull back to some of the other methods that are needed to make the gnm happen okay back to the running the matrices are rendered i'm going to run another experiment just to show what it looks like in the sandbox",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1963.083,
    "end": 1963.844,
    "text": " Hello, Andrew.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1964.004,
    "end": 1964.605,
    "text": "Hello, Benji.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1964.665,
    "end": 1978.7,
    "text": "Hello, X, Z, Q, Z, Z, Y. So now in sandbox, it takes a little bit for the sidebar to catch up with what's happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1984.427,
    "end": 1988.331,
    "text": "Here in sandbox biofirm, now there's two experiments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1988.513,
    "end": 1991.977,
    "text": " one that was modified at 4.59, one at 5.06.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1992.938,
    "end": 2009.798,
    "text": "Let's just do a brief PyMDP push just for the stapling and the temporal weaving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2012.822,
    "end": 2013.002,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2015.53,
    "end": 2016.532,
    "text": " Let's reopen sandbox.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2016.633,
    "end": 2019.8,
    "text": "Here are the two experiments now in the sandbox with their timestamps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2022.186,
    "end": 2024.291,
    "text": "Getting back to what each of these three steps do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2025.193,
    "end": 2029.443,
    "text": "So render is the first stage within each of the experiments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2030.305,
    "end": 2034.214,
    "text": "Render is a folder output by biofirm render.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2035.021,
    "end": 2042.21,
    "text": " Here, we're looking at a 730 line script calling many other methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2043.091,
    "end": 2044.213,
    "text": "And this was the entry point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2044.313,
    "end": 2051.021,
    "text": "I said, first, let's get to reading in a GNN file and rendering what we're about to see here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2053.144,
    "end": 2055.527,
    "text": "We have first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2056.807,
    "end": 2069.998,
    "text": " replicating for cursors context and for reproducibility, the exact JSON of the agent environment simulation parameters and validation compliance report for the validations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2071.579,
    "end": 2073.621,
    "text": "That's in the config under one render.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2074.442,
    "end": 2078.045,
    "text": "To logs, I guess the logs go to the outer folder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2078.165,
    "end": 2082.429,
    "text": "That's just copying what is a summary of what happened to the terminal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2082.589,
    "end": 2086.392,
    "text": "It perhaps could be put under here with other logs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2088.008,
    "end": 2098.363,
    "text": " Here are the matrices as NumPy arrays, A, B, C, and D for the agents and A, B, and D, because the environment is not modeled here with preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2099.184,
    "end": 2110.84,
    "text": "So again, this is showing the tiniest hints of the flexibility of GNN, which is like, well, the agent class in PyMDP expects certain variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2111.541,
    "end": 2117.83,
    "text": "But what if we wanted to have an agent with a very different architecture or a dynamical architecture",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2118.012,
    "end": 2130.73,
    "text": " Then we'd want to have these GNNs that could be arbitrarily composed, hashtag category theory, and then have those matrices in formats that are going to be easy to read in and read out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2131.592,
    "end": 2140.364,
    "text": "Earlier versions had them also coming as text and other files and things like that so it could be visualized, but they're shown visually in the GNN file if you want to check.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2140.384,
    "end": 2147.074,
    "text": "So this helps semantically interface the next level of analysis in the next phase two,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2147.257,
    "end": 2151.102,
    "text": " in the simulation, it can just say, okay, where are my A, B, C, and D at?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2151.843,
    "end": 2157.291,
    "text": "It doesn't need to know that B is related to this and has that name.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2157.311,
    "end": 2160.075,
    "text": "That's output for the agent and the environment in the matrices folder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2160.716,
    "end": 2163.76,
    "text": "And then there's the matrix visualizations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2163.78,
    "end": 2169.568,
    "text": "So here, again, for those who are, aren't we all learning and applying active inference, we see,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2170.426,
    "end": 2189.16,
    "text": " a matrix of the agent so this is the ambiguity matrix or the mapping between hidden states and observations so if this were all ones as an identity matrix it'd be a noiseless situation and that's the difference between a pomdp and an mdp pomdp means partially observable",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2189.14,
    "end": 2201.2,
    "text": " which means we do have a non-identity A matrix which means we do have some kind of partial observability or ambiguity between observations and the latent states that they're associated with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2202.281,
    "end": 2205.126,
    "text": "We have the slices of the B matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2206.128,
    "end": 2208.752,
    "text": "These are the three actions the agent can take.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2209.103,
    "end": 2234.318,
    "text": " here they're not sharply tuned to too much but just to generally represent that if our current state this is agent uh agent transition model for action zero one and two which are decrease maintain and increase so here let's just look at maintain first action number one which is the second indexed action here you can see there's some off",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2236.036,
    "end": 2265.807,
    "text": " values however most of the values are on the diagonal so this is like saying if you choose to maintain and you're in low 90 of the time you're going to be in low 10 of the time you're expecting to transition to homeostatic if you're in homeostatic and you maintain that's what slice we're on then you're going to 80 of the time remain homeostatic 10 of the time you're going to move to higher low and analogously with maintain and high",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2265.787,
    "end": 2292.756,
    "text": " now here's action increase and decrease and so these ones you can see with the 83 and the 62 are reflections of each other like reflections of each other and this is saying let's just look at it for increase here when our current state is low and conditioned upon us going high there's an 83% chance of staying low and a 17% chance of going to homeostatic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2292.922,
    "end": 2299.591,
    "text": " So compare just those 83, 17, 0 to 0.9, 10, 0.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2300.392,
    "end": 2317.916,
    "text": "So this is reflecting or encoding the belief about differential action efficacy that there's a 10% chance of leaving low if I maintain, and there's a 17% chance of transitioning out of low to medium if I increase.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2318.497,
    "end": 2322.743,
    "text": "And you can follow through all of these, and that's part of the fun of learning active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2323.28,
    "end": 2326.485,
    "text": " The C matrix, here's a preference, 0, 4, 0.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2327.186,
    "end": 2334.998,
    "text": "This is going to come into play for the pragmatic value or utility calculations in the expected free energy based policy inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2336.44,
    "end": 2347.077,
    "text": "And here's D, the initial prior on latent states, 80% that it's in homeostatic, 10% on high or low.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2347.394,
    "end": 2355.868,
    "text": " Then we have the same matrices for the environment, A, slices of B, and then D. No C matrix for the reasons that we discussed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2356.669,
    "end": 2360.155,
    "text": "Okay, so that's the first script, one render.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2362.338,
    "end": 2370.111,
    "text": "Again, run biofirm is going to run render, then execute, then visualize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2370.682,
    "end": 2372.948,
    "text": " So now onto stage two, simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2373.529,
    "end": 2376.557,
    "text": "This one was a lot of fun to work through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2376.597,
    "end": 2379.224,
    "text": "There's a lot of JSON configuration files.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2380.186,
    "end": 2382.773,
    "text": "The simulation is deeply tracked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2384.337,
    "end": 2386.362,
    "text": "And I think you know what I mean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2386.46,
    "end": 2388.743,
    "text": " And then step three is the analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2389.544,
    "end": 2391.806,
    "text": "Here's the summary time series.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2391.946,
    "end": 2395.951,
    "text": "So this stacks up all the time series that were made in the subfolders.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2396.672,
    "end": 2398.394,
    "text": "And then here's the summarization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2398.454,
    "end": 2400.276,
    "text": "This is kind of the statistical analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2401.317,
    "end": 2402.679,
    "text": "Could be like for a paper or something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2403.3,
    "end": 2404.501,
    "text": "And the summary time series.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2405.022,
    "end": 2410.508,
    "text": "So here we see all those different kinds of unfolding patterns through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2410.588,
    "end": 2412.35,
    "text": "In this case, it's 1000 time steps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2412.931,
    "end": 2414.813,
    "text": "So again, we see...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2414.793,
    "end": 2417.896,
    "text": " the relationship between the environmental state and observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2419.417,
    "end": 2427.645,
    "text": "So that is mostly aligned because of the 90% accuracy relationship between the environmental state and observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2428.386,
    "end": 2429.427,
    "text": "Here's belief dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2431.168,
    "end": 2435.412,
    "text": "So we can see low, homeostatic, and high, blue, orange, and green.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2436.313,
    "end": 2440.137,
    "text": "So it switches its beliefs about what state it's in several times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2440.897,
    "end": 2441.978,
    "text": "Here's action selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2442.419,
    "end": 2443.72,
    "text": "There's only three actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2444.999,
    "end": 2446.621,
    "text": " Here's policy probabilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2447.562,
    "end": 2452.026,
    "text": "So it's kind of interesting that you can see some relationships here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2452.066,
    "end": 2455.47,
    "text": "And again, the matrices here were not intended to be performant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2455.55,
    "end": 2458.573,
    "text": "I didn't sweep over which B matrices to use.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2459.294,
    "end": 2463.979,
    "text": "It was just to show that these kinds of methods can be effectively implemented.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2465.18,
    "end": 2469.184,
    "text": "System entropy in terms of the belief in the policy entropy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2470.497,
    "end": 2495.442,
    "text": " and the belief accuracy could be looked at like with a 50 step moving average in terms of how accurate are these beliefs and extra logs so that's one agent for one homeostatic biofirm modality for a thousand time steps and then again what the Shapley value experiment does Python 3 same folder",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2500.433,
    "end": 2513.025,
    "text": " biofirm Shapley what that's going to do is it's going to run through all these coalitions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2514.102,
    "end": 2518.888,
    "text": " and do this single agent analysis on the combinations of coalitions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2519.449,
    "end": 2526.097,
    "text": "I didn't look at too much of the detail of how those coalitions are actually like coordinated together, but again, it's just a starting point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2526.518,
    "end": 2540.876,
    "text": "So let's pull back to the agent maker overall stream, and then we can look into several of these scripts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2540.896,
    "end": 2541.156,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2542.925,
    "end": 2548.312,
    "text": " Let's look a little bit at the README for this folder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2549.974,
    "end": 2553.118,
    "text": "Okay, so here's the concept of BioFirm GNN.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2555.501,
    "end": 2560.908,
    "text": "We have concept of BioFirm, README for the BioFirm and README for the BioFirm Shapley.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2561.769,
    "end": 2565.374,
    "text": "So let's start with the concept of the BioFirm GNN.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2566.135,
    "end": 2568.358,
    "text": "I'm gonna paste this link directly in the live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2570.566,
    "end": 2573.37,
    "text": " A production framework for active inference in complex systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2573.831,
    "end": 2586.569,
    "text": "The Biofirm GNN framework provides an enterprise-grade implementation of active inference for complex adaptive systems, with particular emphasis on homeostatic control in biological and ecological contexts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2587.09,
    "end": 2593.219,
    "text": "This framework addresses fundamental challenges in deploying active inference at scale through a modular, production-ready architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2593.82,
    "end": 2596.083,
    "text": "And we can look in the terminal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2597.065,
    "end": 2598.767,
    "text": "Producing it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2598.747,
    "end": 2602.771,
    "text": " This isn't just LLM generated project planation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2603.411,
    "end": 2605.013,
    "text": "This is something I did over the last few days.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2606.254,
    "end": 2607.215,
    "text": "Technical innovation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2607.975,
    "end": 2611.198,
    "text": "This system introduces several key innovations in active inference computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2611.939,
    "end": 2613.14,
    "text": "Distributed matrix operations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2613.26,
    "end": 2615.482,
    "text": "I wouldn't say that these are even accurate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2615.502,
    "end": 2619.366,
    "text": "So as with everything I'm saying, grains of salt, please.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2619.986,
    "end": 2621.888,
    "text": "There is a lot that is valid though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2622.168,
    "end": 2623.569,
    "text": "And I do try to prune out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2623.89,
    "end": 2628.754,
    "text": "However, when it's these readmes, long documents,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2628.734,
    "end": 2630.037,
    "text": " I'm not always reviewing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2630.618,
    "end": 2640.761,
    "text": "For a more final and formal performance version and document, the technical roadmap would not be quantum inspired belief propagation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2641.583,
    "end": 2645.612,
    "text": "It would be something more along the lines of what I hand wrote, which is like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2647.837,
    "end": 2653.285,
    "text": " My preference is to do appropriate, relevant, open-source contributions via Institute scaffolded mechanisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2653.825,
    "end": 2663.059,
    "text": "I do not and cannot understand the leverage, consequences of action, and safest future development of these open-source Active Inference projects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2664.0,
    "end": 2670.469,
    "text": "If you are passionate, curious, and interested, please consider donating to the Institute, donate.activeinference.institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2671.985,
    "end": 2672.927,
    "text": " and or join our teams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2673.528,
    "end": 2677.274,
    "text": "We will explore new modes of software engineering, development, and deployment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2677.374,
    "end": 2687.29,
    "text": "And again, in this interlude while we're here, a great conversation yesterday with Vladimir Baulin, fellow investigator, and we talked about another three-layer stack.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2687.911,
    "end": 2696.946,
    "text": "At the beginning of the stream, I talked about this core kernel inference implementation layer, a middleware layer that connects GNN",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2696.926,
    "end": 2702.099,
    "text": " to domains of interest like agents, farms, and ants, and then the outer layer of touch points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2702.881,
    "end": 2711.643,
    "text": "And with Vladimir, we had an awesome time talking about intelligent soft matter and thinking about low road, the high road, and the meso.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2712.364,
    "end": 2713.467,
    "text": "So in this episode,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2713.531,
    "end": 2738.83,
    "text": " triallectic the low road is like the bottom up or minute particulars for example the focus on the farm the actuality of the farm whereas in in the earlier triad the core was the algorithms on the metal or neurons or whatever but here the low road is the bottom up focus from what are we observing what are the agents what are the informational resources what are the actions what is happening",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2740.7,
    "end": 2769.036,
    "text": " mesolayer is active inference here with a bridging and gapping role onto the high road which is actually its own dialectic the twin principles of free energy principle which is the bayesian mechanics for informational physics and the principles of patterned in potentiality of living matter and that's how life and matter",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2770.231,
    "end": 2774.257,
    "text": " finds potential through pattern and pattern through potential.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2774.858,
    "end": 2795.808,
    "text": "So this is another way to think about active inference as a connection between systems of interest in their minute particulars and principles of information geometry and information physics like FEP and principles, some we know, some we don't, of the patterns and potentialities of living matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2797.731,
    "end": 2798.432,
    "text": "But returning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2800.707,
    "end": 2801.428,
    "text": " to the READMEs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2801.989,
    "end": 2803.15,
    "text": "So that's the concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2803.471,
    "end": 2812.483,
    "text": "Just talking about here's how to implement the BioFirm and here's how it could be pointing towards a production framework for BioFirm engineering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2813.485,
    "end": 2815.267,
    "text": "Here's the README for the BioFirm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2816.248,
    "end": 2820.134,
    "text": "It goes through and it describes what this BioFirm active inference agent is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2820.975,
    "end": 2823.238,
    "text": "BioFirm is an active inference agent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2823.843,
    "end": 2826.81,
    "text": " that maintains homeostasis in simple ecological environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2827.232,
    "end": 2830.099,
    "text": "The agent uses the generalized neural network notation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2830.981,
    "end": 2833.307,
    "text": "Of course, that is a typo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2838.52,
    "end": 2840.485,
    "text": "Sometimes it does graph neural network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2843.62,
    "end": 2851.451,
    "text": " The agent uses the GNN notation to define its generative model and operates in a discrete state space with three states, low, homeostasis, and high.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2852.233,
    "end": 2867.535,
    "text": "So for those who are keeping score, the box score at home, we have the environment model, that A, B, D, P, O, M, D, P. And then there's the agent model, which is the A, B, C, D, P, O, M, D, P.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2868.258,
    "end": 2871.862,
    "text": " There's no policy selection in the environment model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2871.982,
    "end": 2875.105,
    "text": "It accepts the transition slice dictated by the agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2876.947,
    "end": 2878.728,
    "text": "Here's how you use BioFirm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2879.469,
    "end": 2885.355,
    "text": "You run runBioFirm.py, and as mentioned, that runs those three stages per experiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2885.895,
    "end": 2894.704,
    "text": "Render, which looks over to the GNN folder for the GNN input, and it's still going with a simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2894.836,
    "end": 2897.841,
    "text": " So just showing how many times, even though it's only 100 active time steps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2898.703,
    "end": 2903.331,
    "text": "First runs render, then runs execute, then runs visualize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2905.796,
    "end": 2912.187,
    "text": "Here's the directory structure, including documents like this and MetaPyMDP is so helpful for Cursor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2913.398,
    "end": 2919.724,
    "text": " I think they've also improved on their side, the folder handling, which earlier on was kind of an issue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2919.764,
    "end": 2940.145,
    "text": "It would put things in folders where it wasn't supposed to be, but giving a gentle plain text reinforcement and then going up to that gear and re-indexing or deleting your index and re-indexing, this can make sure that it really gets it what the folder structure is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2941.126,
    "end": 2942.207,
    "text": "Here are the key files.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2943.605,
    "end": 2948.43,
    "text": " Here's the analysis outputs, configuration outputs, different dependencies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2949.091,
    "end": 2949.732,
    "text": "You want to learn more?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2949.812,
    "end": 2954.998,
    "text": "Check the references, active inference, theory and implementation, GNN specification document.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2957.32,
    "end": 2961.245,
    "text": "We can add a link to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2962.386,
    "end": 2968.853,
    "text": "And homeostatic control and allostatic eventually control models in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2969.879,
    "end": 2972.502,
    "text": " That's the run GNN script.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2972.642,
    "end": 2974.584,
    "text": "Now let's look at the Shapley value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2974.604,
    "end": 2978.107,
    "text": "This was a late breaking development.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2978.127,
    "end": 2981.511,
    "text": "Again, though, it was only several prompts on top of run.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2982.952,
    "end": 2995.304,
    "text": "So that was very encouraging because it suggests that higher order engineering is going to be exponentially facilitated by robust middleware.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2995.504,
    "end": 2996.285,
    "text": "Surprise, surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2997.026,
    "end": 2998.047,
    "text": "Hashtag open source.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2998.972,
    "end": 3000.996,
    "text": " BioFirm Shapley Value Analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3001.898,
    "end": 3009.873,
    "text": "The Shapley Value Analysis module, biofirmshapley.py, provides a comprehensive framework for evaluating agent contributions in multi-agent BioFirm systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3010.795,
    "end": 3017.368,
    "text": "This analysis helps understand agent synergies, optimal combinations, and individual strengths using cooperative game theory principles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3017.348,
    "end": 3019.771,
    "text": " So here are the four agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3020.672,
    "end": 3030.403,
    "text": "We have the base agents with a standard 0-4-0 homeostatic preference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3030.423,
    "end": 3043.137,
    "text": "There is the risk averse agents with a 0-6-0 C representing sharper pragmatic or utility seeking behavior, hence risk aversion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3044.23,
    "end": 3053.742,
    "text": " Three, the exploratory agent with a 0.12, 0.1 C reflecting a lower preference differential and then the quote balanced agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3053.802,
    "end": 3055.584,
    "text": "I don't know in what sense it's balanced.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3055.664,
    "end": 3057.807,
    "text": "Of course, speculative, speculative, speculative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3058.448,
    "end": 3062.573,
    "text": "It has a 1, 3, 1 with a compromise between stability and adaptation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3063.073,
    "end": 3065.596,
    "text": "All this depends on environmental properties and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3066.778,
    "end": 3068.5,
    "text": "Here are the performance metrics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3068.615,
    "end": 3070.298,
    "text": " while Shapley value has completed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3070.458,
    "end": 3074.625,
    "text": "So we'll look over the performance metrics and then revisit the Shapley outputs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3075.687,
    "end": 3081.296,
    "text": "Homeostatic satisfaction, it's calculated as the time in homeostasis divided by the total time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3083.539,
    "end": 3087.045,
    "text": "Expected free energy, measures predictive performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3087.835,
    "end": 3101.061,
    "text": " The components are calculated as ambiguity, the informational elements of epistemic value, even though that's not exactly the term that we might associate with epistemic value, the readme did, and a risk term or pragmatic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3101.743,
    "end": 3106.452,
    "text": "And that is normalized to allow comparable analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3106.583,
    "end": 3130.144,
    "text": " belief accuracy that's the state estimation precision how accurate are the inferences about latent states and then the control efficiency and there's a lot of control measures so this is just taken as a sort of stand-in for the kinds of sense making analyses that we can do with cognitive modeling and compute and these are the kinds of control theoretic or decision making",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3130.715,
    "end": 3156.25,
    "text": " measures that we can make forensically historically post hoc we can do real-time now casting and anticipatory control efficiency as carl recently said somewhere allostasis is planning to be homeostatic here's the analysis framework itself here's the coalition the coalition is defined as the agents the metrics and the coalitions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3156.584,
    "end": 3161.712,
    "text": " The coalitions are defined in terms of, in this situation, all the possible agent combinations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3162.493,
    "end": 3167.66,
    "text": "So we could run it with five agents and we may do that soon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3168.942,
    "end": 3172.167,
    "text": "Performance evaluation looks at those four performance measures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3174.13,
    "end": 3177.495,
    "text": "And then here's the Shapley calculation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3178.133,
    "end": 3182.739,
    "text": " Let it go, whether it was an accurate Shapley calculation or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3182.799,
    "end": 3189.789,
    "text": "So if this isn't like the best or the only, or the right way to calculate it, it's an equation that can be modified.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3190.83,
    "end": 3200.743,
    "text": "Again, the directory organization, visualization suite, agent contributions, coalition performance, metric analysis, advanced visualization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3202.065,
    "end": 3204.428,
    "text": "And then here's some of what it considers advanced features.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3207.631,
    "end": 3208.992,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3209.012,
    "end": 3214.898,
    "text": "So now that the Shapley value has been output, it ran all these sub experiments with the coalitions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3217.161,
    "end": 3218.082,
    "text": "Here's the Shapley again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3219.063,
    "end": 3226.11,
    "text": "So, Shapley config.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3226.13,
    "end": 3227.631,
    "text": "Here are those agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3228.132,
    "end": 3230.034,
    "text": "So it did a base agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3230.094,
    "end": 3231.575,
    "text": "And again, GNN.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3232.596,
    "end": 3233.357,
    "text": "So exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3234.158,
    "end": 3236.44,
    "text": "Load in a base BioFirm agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3237.922,
    "end": 3262.275,
    "text": " then do agent variations again kind of go back convection variations on a theme girdle escherbach detecting a theme modifying the base agents with customized preference distributions that's how we can sweep across agents willy-nilly more information on the simulation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3263.723,
    "end": 3290.659,
    "text": " logs here we have everything that's output to the terminal including shapely value analysis so homeostatic coming in rank one we have the risk averse agents with a relative impact of 50.7 all numbers are for speculative realism purposes don't act on them specifically and the value of plus 0.02 whereas the base agent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3292.225,
    "end": 3297.342,
    "text": " With this stochastic sample of, I believe, 100 time steps replicated several times,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3298.267,
    "end": 3303.856,
    "text": " We must announce that it was 0.0013 value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3304.697,
    "end": 3307.441,
    "text": "Thank you for playing agent rank four base.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3308.022,
    "end": 3308.943,
    "text": "Expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3309.865,
    "end": 3326.35,
    "text": "Again, the relative impact, and this connects to Andrew's work showing how the surprisal level and the epistemic and the pragmatic elements of agent contributions can be weighted and valued in terms of their relative impact to coalition success and performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3327.528,
    "end": 3330.731,
    "text": " Here we have the top three coalitions in terms of homeostatic satisfaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3330.952,
    "end": 3333.274,
    "text": "Like this is as fun as the Olympics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3334.596,
    "end": 3338.98,
    "text": "Risk-averse alone with a 0.34 performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3340.121,
    "end": 3342.864,
    "text": "Base plus exploratory, interesting, with a 0.33.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3344.746,
    "end": 3345.687,
    "text": "I expected that from them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3346.208,
    "end": 3348.19,
    "text": "And then the risk-averse plus balance with a 0.32.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3348.21,
    "end": 3351.313,
    "text": "The worst three coalitions, let's not mention them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3352.274,
    "end": 3353.215,
    "text": "Expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3353.576,
    "end": 3355.678,
    "text": "We have the base and the risk-averse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3358.409,
    "end": 3362.373,
    "text": " seemingly with a higher, better value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3362.433,
    "end": 3364.476,
    "text": "So it's interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3364.536,
    "end": 3374.287,
    "text": "It could just be a quirk of the way that the matrices are set up with a certain kind of sloppy, partially observable combinations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3374.547,
    "end": 3378.631,
    "text": "That's what we're going to use GNN to sweep, sweep, sweep over.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3379.412,
    "end": 3380.974,
    "text": "How do",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3381.055,
    "end": 3391.8,
    "text": " Homeostatic satisfaction meta-coalitions correlate with expected free energy, sense-making accuracy, and control efficacy coalitions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3393.544,
    "end": 3394.586,
    "text": "Synergy analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3395.188,
    "end": 3399.638,
    "text": "This looks at across co-occurrences of given agents in coalitions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3400.597,
    "end": 3401.579,
    "text": " What is their synergy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3401.659,
    "end": 3405.588,
    "text": "I don't even know what scale it's on, but here are some negative synergies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3405.608,
    "end": 3406.49,
    "text": "We're not going to mention those.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3407.071,
    "end": 3409.196,
    "text": "And here are some positive synergies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3409.837,
    "end": 3414.808,
    "text": "Base and risk averse have a strong synergy together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3417.488,
    "end": 3445.285,
    "text": " then the visualizations are output we get kind of report cards on these different agents in terms of their contribution to homeostasis minimizing uncertainty accurate state estimation and control efficiency like is this badges and medals for a new kind of officer core and again we can revisit there's the agents themselves I don't know if there's anything in that folder that one's empty",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3446.902,
    "end": 3473.432,
    "text": " maybe intentionally so maybe maybe this page was left blank here are coalitions again are those empty they are but the coalitions are described in the in the configuration and in the experiments themselves if it's being done properly at all again though looking at the reporting at the very least something wildly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3475.083,
    "end": 3502.39,
    "text": " close is happening here's the calculation of the shapley values so we have phi sub i of v is sum over the absolute value of the combinatorics of the coalition leave one out for agent i multiplied by this value over the number of combinations combinatorial multiplied by that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3504.192,
    "end": 3524.631,
    "text": " and we get interesting analyses like antagonistic pairs synergistic pairs so these are fun reports and when we look at the plots again these were briefly flashed in the beginning we can see okay here are the coalitions let's look at homeostatic satisfaction here we have the one four-way combo",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3527.412,
    "end": 3529.494,
    "text": " 0.303 performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3529.514,
    "end": 3530.536,
    "text": "This could be stochastic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3530.596,
    "end": 3533.899,
    "text": "It's only run for a hundred steps here, just so it doesn't take too, too long.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3534.46,
    "end": 3538.865,
    "text": "And then we see within each, there's a ranking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3540.807,
    "end": 3556.305,
    "text": "Risk averse by itself does the best for homeostasis, but then risk averse doesn't help others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3557.5,
    "end": 3561.606,
    "text": " in synergizing when there's a team of two or three or four.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3562.988,
    "end": 3564.049,
    "text": "That's one interesting pattern.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3564.79,
    "end": 3570.958,
    "text": "And then we see that kind of reflected in a rotationally symmetric way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3571.018,
    "end": 3573.882,
    "text": "Take this and rotate it 180 degrees.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3574.643,
    "end": 3582.394,
    "text": "Here we see Ris alone with the best homeostasis and with the low relatively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3582.914,
    "end": 3593.065,
    "text": " But expected free energy, for those who will recall equation 2.6 in the textbook from 2022, it's not just about homeostatic satisfaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3593.085,
    "end": 3606.34,
    "text": "So if we look at the belief accuracy, the sensemaking and the control efficiency, which isn't playing a role in the homeostatic or the expected free energy calculations, but we see kind of a resemblance, like, hmm, exploratory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3606.978,
    "end": 3610.403,
    "text": " And also the axes need interpretability and all this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3610.423,
    "end": 3616.031,
    "text": "But again, looking at the rotational symmetry, it's like, okay, RISP, BAL, BAS, EXP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3616.051,
    "end": 3618.234,
    "text": "RISP, BAS, EXP, BAL.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3618.855,
    "end": 3619.756,
    "text": "Huh.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3619.776,
    "end": 3624.422,
    "text": "So these two are in a different order, but it rhymes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3624.442,
    "end": 3625.324,
    "text": "Shapley analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3626.025,
    "end": 3628.248,
    "text": "Here, we see the agent contributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3629.269,
    "end": 3632.173,
    "text": "So this is the contributions to homeostatic satisfaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3632.193,
    "end": 3634.116,
    "text": "So it's like RISC-averse is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3634.636,
    "end": 3638.302,
    "text": " is a positive contributor to homeostatic satisfaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3638.943,
    "end": 3639.584,
    "text": "I knew you would.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3640.506,
    "end": 3646.916,
    "text": "But then when we look back at risk averse, was it that one?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3650.202,
    "end": 3655.851,
    "text": "And we see the contribution like, huh, risk averse contributes to homeostatic satisfaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3656.0,
    "end": 3658.564,
    "text": " but it's a negative contributor to belief accuracy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3659.165,
    "end": 3664.094,
    "text": "It's like, well, that does make sense from an active inference perspective, more risk averse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3664.354,
    "end": 3679.881,
    "text": "So having a sharper temperature preference will make you take more extreme action to keep the temperature of the body or the room in homeostasis at the cost of less accurate beliefs about the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3681.768,
    "end": 3711.066,
    "text": " we see an interesting pattern where the balanced one again it's not balanced in any real sense per se or general sense just that's what name it was given it has a negative efficacy on homeostatic satisfaction and on Shapley probably because we're defining homeostasis only in terms of staying within homeostatic bounds whereas the balanced if you'll remember had a little bit of a broader shoulder with a 131c so that it actually kind of liked the low and the high",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3712.463,
    "end": 3714.205,
    "text": " And then we see this interesting pattern.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3714.285,
    "end": 3725.618,
    "text": "So it's like each of the, again, just one matrix parameterization on one stochastic run, but these are the kinds of inferences that agents such as yourself can imagine making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3727.24,
    "end": 3737.391,
    "text": "Agent synergies on a heat map, the control efficacies, the synergies in terms of like risk averse,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3737.978,
    "end": 3762.636,
    "text": " is a positive contributor so to the free energies for others and the homeostatic contribution matrix and the report so that's the Shapley analysis let's quickly look at those three steps that are called by run",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3763.004,
    "end": 3791.897,
    "text": " and then remember that the biofirm shapley value calculations run on top of run biofirm first step render gnn okay first are the general packages then we get into the matrix factory i hope people are ready to look at the matrix factory we're going to go there next here's the biofirm renderer the biofirm renderer is a 600 line class",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3792.805,
    "end": 3795.609,
    "text": " at the exception of just mains and parse args.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3796.41,
    "end": 3803.979,
    "text": "This design pattern, I believe, makes it easy to import big wrappers of methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3803.999,
    "end": 3808.365,
    "text": "So we can just import GNN matrix factory with all the sub methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3808.385,
    "end": 3812.029,
    "text": "We can import biofirm utils with all the sub methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3812.91,
    "end": 3822.002,
    "text": "And from other scripts, it can use biofirm renderer with all of the sub methods for rendering and calling the matrices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3822.556,
    "end": 3824.758,
    "text": " even outside of the run context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3825.219,
    "end": 3826.3,
    "text": "So that's what render does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3826.84,
    "end": 3839.552,
    "text": "It loads in the GNN files, validates them, outputs the matrices in the NumPy format, outputs the visualizations to a folder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3839.753,
    "end": 3846.779,
    "text": "So render, that's where we get the agents matrices and the logs and the config, everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3846.8,
    "end": 3848.361,
    "text": "Okay, that's render.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3848.51,
    "end": 3850.012,
    "text": " The second is the execution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3850.613,
    "end": 3854.878,
    "text": "So this is really where the active inference part is at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3855.659,
    "end": 3860.706,
    "text": "So getting this one right was the crux of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3862.268,
    "end": 3870.258,
    "text": "The biofirm executor is a 400 line and the biofirm simulator is 300 lines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3871.52,
    "end": 3873.302,
    "text": "Here we are inside of the simulator.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3877.349,
    "end": 3885.459,
    "text": " And you can see this is a simulation flow handle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3888.644,
    "end": 3899.157,
    "text": "Executes and analyzes the active inference simulation and it's going to call run simulation and make these steps happen in the logic of the simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3901.1,
    "end": 3903.002,
    "text": "Here's the biofirm executor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3905.075,
    "end": 3931.453,
    "text": " the executor is going to actually load in all of those matrices and parameters like precision and do the simulation itself this is where we actually see the active inference loop so blink and it will pass you by this is why there's so much room to work and play in the middleware space because seriously blinking and the active inference will pass you by",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3932.513,
    "end": 3939.042,
    "text": " We initiate the histories, initialize the state and the observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3939.062,
    "end": 3943.227,
    "text": "So D and the first observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3943.988,
    "end": 3945.37,
    "text": "And then here we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3946.291,
    "end": 3950.997,
    "text": "Now for the number of time steps, we're going to trace everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3952.199,
    "end": 3953.521,
    "text": "And here's what's, that's histories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3953.621,
    "end": 3958.387,
    "text": "Every time you see histories, that means it's getting logged and traced.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3960.189,
    "end": 3960.63,
    "text": "Here we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3962.078,
    "end": 3962.899,
    "text": " state inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3964.501,
    "end": 3969.668,
    "text": "QS equals self.agent.inferStates with the current observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3970.509,
    "end": 3976.396,
    "text": "That's going from an observation O to a belief distribution about latent states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3979.52,
    "end": 3980.541,
    "text": "Next step.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3980.561,
    "end": 3988.171,
    "text": "From that updated belief distribution, QPi is set as inferPolicies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3988.932,
    "end": 3991.495,
    "text": "This is where expected free energy is used",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3992.673,
    "end": 3998.72,
    "text": " to update the policy prior into the policy posterior, saved as Q sub pi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3999.4,
    "end": 4005.367,
    "text": "Pi is the list of policies, and that's a probability distribution over action, hashtag active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4007.71,
    "end": 4014.918,
    "text": "Then metrics are updated on the entropy of belief and policy and accuracy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4015.418,
    "end": 4019.202,
    "text": "And then action is sampled from the policy posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4020.003,
    "end": 4020.604,
    "text": "So,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4021.293,
    "end": 4043.318,
    "text": " again take a deep breath blink and you miss it state inference from the observation policy inference from the updated state action sampling from the policy posterior that is the little nestmate ant brain at the core of all of this machination",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4045.407,
    "end": 4066.248,
    "text": " saving the data, metadata, logging, saving the summary, confirming that the summary was saved, save the history, confirm it, save the metrics, confirm it, save that you saved the checkpoint, save and copy the initial config, validate all the directories, get those observations, make the state transition, setting up the logging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4067.169,
    "end": 4072.174,
    "text": "So that is what happens in the execution of the biofirm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4073.167,
    "end": 4076.33,
    "text": " It also invokes two, well, invokes several folders.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4076.471,
    "end": 4081.055,
    "text": "There's utils, and then there's two that are a little bit more interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4082.837,
    "end": 4084.019,
    "text": "Some of this can be refactored.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4084.059,
    "end": 4095.811,
    "text": "I would eagerly await later and different people and LLMs and more to refactor and improve this comical absurdity of the current state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4096.672,
    "end": 4100.136,
    "text": "So here's, again, wrapping in a big class",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4101.905,
    "end": 4129.566,
    "text": " all of the methods that can then get pulled in from this standalone util script in the biofirm execution utilities so when we start to develop more generality and start to go okay three states was pretty cool how about four states how about 50 states how about 51 states then we're going to want flexible methods so that a can be defined as",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4129.546,
    "end": 4156.448,
    "text": " one by a by a and b can be b by b by c or whatever not using those in the same a b and c but just saying it can be different shapes and we'll be able to render those and articulate their separation again from the english language active inference ontology assertion here we have just some utilities for executing and several times it would it would",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4156.917,
    "end": 4160.702,
    "text": " build length in the execute script, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4161.402,
    "end": 4169.833,
    "text": "And then I'd say, move the methods to a standalone methods or utilities script and invoke them properly here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4170.894,
    "end": 4174.718,
    "text": "So it spun off several of these needed scripts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4176.681,
    "end": 4182.468,
    "text": "And then once you have it in a big wrapper like this, this can be moved somewhere else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4183.189,
    "end": 4186.873,
    "text": "And then all of its subsidiary methods are easier to import.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4188.743,
    "end": 4199.454,
    "text": " There's some other even deeper methods for calling functions that I'm working on privately, and I'll look forward to bringing that into GNN later, but just putting a little footnote for now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4199.976,
    "end": 4201.42,
    "text": "That's the execute script.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4202.412,
    "end": 4207.7,
    "text": " And then it's going to make heavy use of the active inference GNN Pi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4207.72,
    "end": 4209.502,
    "text": "So again, here, single class.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4210.183,
    "end": 4215.471,
    "text": "This is going to draw upon some more basic matrix and inference utilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4216.272,
    "end": 4227.768,
    "text": "This is semi-pedagogical in the sense that it's meant to really clearly lay out other information that allowed the execute loop to be so simple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4228.569,
    "end": 4229.01,
    "text": "So again,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4230.037,
    "end": 4241.433,
    "text": " It was all pushing methods, methods, methods, methods, methods further and further away so that we could get to this point and this block of code could be moved even below.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4241.453,
    "end": 4243.797,
    "text": "I dare make a manual edit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4249.906,
    "end": 4250.847,
    "text": "Just to clarify.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4253.678,
    "end": 4259.947,
    "text": " State inference, policy inference, action selection, act, infer, serve, OODA.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4260.648,
    "end": 4261.95,
    "text": "It's all right here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4261.99,
    "end": 4270.563,
    "text": "GNN is providing the middleware firmware that's helping us get to this level of abstraction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4271.484,
    "end": 4274.809,
    "text": "Now we're back to the active inference GNN Pi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4275.093,
    "end": 4290.165,
    "text": " We have a lot of logging and this is actually an interface between the essentially minimal semantics of this execution flow and the PyMDP type semantics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4290.145,
    "end": 4310.263,
    "text": " here i've also played around with defining the infer states infer policies and sample actions specifically so these may recapitulate or they might be incorrect relative to pi mdp but the point is i'm explicitly calling these methods and trying to unpack a little bit about which those three steps do",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4310.243,
    "end": 4339.288,
    "text": " so really this is as carved at the joints and lean as the active inference loop is going to get right here state inference from observation policy inference given the state update action sampling from the policy posterior here are what those look like at one more level first inferring beliefs we have the likelihood of an observation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4339.353,
    "end": 4342.196,
    "text": " That's the prior likelihood of the observation happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4343.837,
    "end": 4349.002,
    "text": "The observation gets passed through A. A, that's the tail of two densities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4349.523,
    "end": 4357.47,
    "text": "A can receive an observation to update latent states, or you can push latent states through A to get an expected observation distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4358.391,
    "end": 4368.06,
    "text": "So all that's happening in infer states is observation comes in, it's passed through A, and that yields a Bayesian posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4370.437,
    "end": 4373.323,
    "text": " Here's infer policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4373.343,
    "end": 4389.559,
    "text": "Here's where we're going to be selecting different slices of B, the transition operator, and assessing what is the expected free energy for each policy, which is reflected by the transition state to state transitions of that slice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4394.686,
    "end": 4417.572,
    "text": " here's the inference on policy it is going to push the method another level deeper to inference utilities calculate expected free energy so here's inference utility this one's short here's the expected state calculation this is just to give another wrapper for these methods that we're going to call in many different places",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4419.425,
    "end": 4421.047,
    "text": " Here's calculate expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4421.869,
    "end": 4423.912,
    "text": "Calculates expected free energy for a given action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4424.112,
    "end": 4432.685,
    "text": "Again, pending, I'm not saying this is the most efficient or even the perfect implementation, but from play testing, this is basically what happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4434.708,
    "end": 4436.191,
    "text": "First, get the predicted states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4437.212,
    "end": 4444.183,
    "text": "So this is, as we iterate through slices of B, which is the actions on B,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4445.092,
    "end": 4470.61,
    "text": " what would be the expected states so we have a belief distribution across the three low homeostatic and high states like it's eighty percent that we're in homeostatic ten percent that it's low or high that three by one is gonna get passed through the from to two of b and that's gonna result in the predicted states which are the consequences of that action",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4471.754,
    "end": 4501.457,
    "text": " from the expected consequences of action in the latent state like what would the temperature of the room be what would i believe the temperature of the room to be if i were to turn on the air conditioning from that a is used to push out expected observations which are then crossed with the preference or constraint distribution c the policy value",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4502.72,
    "end": 4524.12,
    "text": " is taken as the utility which was again being pushed out from the expected states by the preference satisfaction and then optionally if you have the info gain flag raised then it'll add the information gain",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4524.218,
    "end": 4526.201,
    "text": " Here's the calculation of the information gain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4526.962,
    "end": 4531.448,
    "text": "It's the calculation of the KL divergence between the posterior and the prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4532.169,
    "end": 4541.422,
    "text": "So again, you can keep on peeling back these layers and then a softmax is applied on the policy posterior so that it becomes sampleable from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4542.223,
    "end": 4542.784,
    "text": "So it's like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4544.384,
    "end": 4570.392,
    "text": " just pull back three layers from infer policies but what was it all for it was all for so that we could take our updated beliefs about state and then for every slice of b reflecting a different policy ask what would be the expected utility and information gain of each of those slices of b as unfolded for one time step and finally sample action",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4570.658,
    "end": 4579.593,
    "text": " So here is just an action sampling where the probability of the policy is sampled from according to the probability of it being there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4579.993,
    "end": 4581.917,
    "text": "And you can look back to the inference utilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4582.177,
    "end": 4589.95,
    "text": "That's also where the temperature on policy selection comes into play, which is in the updating of the policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4591.893,
    "end": 4594.978,
    "text": "So again, whew.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4596.646,
    "end": 4604.361,
    "text": " that's the active inference loop it's right there in biofirm execute line 156 to 166",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4604.763,
    "end": 4634.027,
    "text": " this is absolutely the center kind of convergence core and maybe there are simpler ways to do what i'm showing today i'm sure there are maybe twice as simple maybe five times as simple but it really just shows what the middleware space is enabling which is these calculations going in raw will be beset by",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4634.007,
    "end": 4652.337,
    "text": " all kinds of shape and low level errors when trying to do basic things and it's a little bit difficult to log and again this histories is where we get that ebpf analogy with logging the linux kernel so by putting in all of this logging",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4653.143,
    "end": 4668.165,
    "text": " into the kernel itself, all of these eBPF-like lines, then you can just say, if you don't even want to log it, you could just comment it out, or you could flag, don't trace that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4668.145,
    "end": 4673.452,
    "text": " And someone could look at the config file of you running your agents and they're running their agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4673.512,
    "end": 4676.135,
    "text": "Maybe you're in the same ecosystem, maybe you're in different ecosystems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4676.816,
    "end": 4689.833,
    "text": "And then you can say, well, if it's really the case that you ran that simulation with that config, like it's saying that you did, and we can verify that, then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4690.42,
    "end": 4719.583,
    "text": " it's a verified information environment where I can start to have a little bit of a better confidence about these numbers flowing past my screen so the last piece is the analysis and this is where we get this concatenated time series and all of the subfolders that have these visualizations again for that one agent in that simulation environmental state and observations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4720.103,
    "end": 4746.685,
    "text": " belief dynamics, action selection, policy probability, system entropy, belief accuracy interesting the label or some other thing might be flipped because from this run at least it looks like it's selecting increase more when it has a consistent belief that it's in high",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4746.833,
    "end": 4750.199,
    "text": " So it might be a label or a color thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4750.78,
    "end": 4754.647,
    "text": "It could be a matrix needing to be transposed, but it's basically there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4755.549,
    "end": 4758.614,
    "text": "Or it could have just been a weird run and a weird parameterization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4759.255,
    "end": 4765.346,
    "text": "So again, that's the AgentMaker class folder in PyMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4766.328,
    "end": 4769.213,
    "text": "You run Python 3, Biofirm Shapley,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4769.682,
    "end": 4774.066,
    "text": " It's going to make all those coalitions according to their combinatorics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4774.086,
    "end": 4777.51,
    "text": "And again, it's just now it's spinning it all out in the sandbox folder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4778.331,
    "end": 4779.332,
    "text": "And that's sort of the goal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4779.452,
    "end": 4795.729,
    "text": "It's cloned into this repo and you can get really nuanced, really granular execution of methods that to build up from a Google Colab notebook or to more haphazardly call the PyMDP package.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4796.69,
    "end": 4797.41,
    "text": "Maybe it's possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4797.51,
    "end": 4799.132,
    "text": "Again, I would love to see it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4799.635,
    "end": 4803.498,
    "text": " I know that a lot of this logging was vital for me to get to this point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4803.899,
    "end": 4809.544,
    "text": "So maybe it can be like the scaffolding of a skyscraper and pulled away once it's been done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4809.564,
    "end": 4828.68,
    "text": "At the same time though, the journey we are taking with middleware is really only beginning and adding more logging and more modularity, more category theory, more documentation, all of these things I think will only increase what we can do together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4829.42,
    "end": 4854.094,
    "text": " so that's the agent maker folder that's kind of part one of this whole stream that's the functional end but we're peeling back the layers we started with looking at the shapely value of coalitions and all the analyses that were associated with that peeled back to the single agents level experiments and how the analyses happen for single agents",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4854.445,
    "end": 4868.243,
    "text": " peeled back to what is happening in the single agents loop in the biofirm execute, pulled back to here's where the real act-inf loop is happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4868.884,
    "end": 4870.606,
    "text": "Where are those functions tracing us?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4871.146,
    "end": 4873.85,
    "text": "And that takes us all the way back to these utils scripts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4874.871,
    "end": 4877.515,
    "text": "Now let's dig a little bit more into GNN.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4878.236,
    "end": 4880.959,
    "text": "So let's go to the GNN readme.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4884.23,
    "end": 4889.419,
    "text": " Well, maybe if it's written enough places, it'll get there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4889.479,
    "end": 4894.307,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4894.327,
    "end": 4896.651,
    "text": "Let's go over in the repo to GNN.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4898.494,
    "end": 4899.496,
    "text": "Here we are in the readme.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4900.418,
    "end": 4905.867,
    "text": "I'm going to push the update so we can read the updated version.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4920.562,
    "end": 4925.99,
    "text": " Wouldn't it be nice to know some of these things?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4927.132,
    "end": 4936.667,
    "text": "How does action selection confidence with respect to which action is taken modulate through time as a function of belief and certainty?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4938.59,
    "end": 4946.282,
    "text": "What is the relationship between beliefs and actions through time understood in terms of most likely states?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4952.202,
    "end": 4955.126,
    "text": " Much better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4955.146,
    "end": 4963.075,
    "text": "Generalized notation notation, notation, oh no, is a flexible format for specifying active inference models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4963.596,
    "end": 4970.364,
    "text": "It provides a structured way to define generative models, including state spaces, observation mappings, transition dynamics, and preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4971.586,
    "end": 4973.348,
    "text": "Here is the basic structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4973.728,
    "end": 4981.838,
    "text": "It's a model name, the type of model, and you can check out the paper and the GitHub and the website for GNN.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4982.678,
    "end": 4989.068,
    "text": " Maybe I'll go back to update the GitHub repo, but you can see from the website.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4991.552,
    "end": 4992.694,
    "text": "Here's an example of GNN.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4992.714,
    "end": 4993.916,
    "text": "This is an earlier draft.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4993.936,
    "end": 5000.586,
    "text": "So this is kind of Jakub and I speaking a more incipient dialect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5001.367,
    "end": 5003.21,
    "text": "So here's the step-by-step progression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5003.331,
    "end": 5006.796,
    "text": "We have static Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5006.776,
    "end": 5016.077,
    "text": " Prior over states, latent states, temperature of the room, ambiguity A matrix, observation coming in from the thermometer, static partial observability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5016.638,
    "end": 5018.562,
    "text": "Then we get the music listening example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5019.184,
    "end": 5021.629,
    "text": "Now we have B matrix,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5021.997,
    "end": 5027.651,
    "text": " as a transition operator in this dynamical partial observability situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5028.654,
    "end": 5036.474,
    "text": "We then get to the textbook figure 7.3, discrete time classic, PI-MDP, POMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5036.494,
    "end": 5037.677,
    "text": "Can't say enough about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5038.028,
    "end": 5040.233,
    "text": " We have that downstairs sense-making part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5040.955,
    "end": 5051.1,
    "text": "And then which slice of B gets invoked in the state transition is evaluated in a action-specific way with its associated expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5051.481,
    "end": 5053.827,
    "text": "That's G on pi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5053.807,
    "end": 5078.953,
    "text": " as informed by c preferences constraints and then here's a little bit more sophisticated of a model that includes the temperature coefficients on policy which is what i showed earlier so here this is again this is an earlier but it's a it's a useful version of gnn to look at so we have the image this is not part of the plain text obviously just to show it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5080.081,
    "end": 5102.933,
    "text": " we have the GNN version and flags so that could be let's look at the GNN here we are for the GNN agent biofirm this could be flagged as like GNN version 0.01 you know alpha model name this is just a plain text and the goal of having these hashtags",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5103.132,
    "end": 5128.397,
    "text": " now i believe that json is better but it's trivial to render this json as a markdown so it's not like it really matters both are fine that was the goal was to have something that could be read in and out where we could have the markdown instantly make these kinds of visualizations nice and pretty and also machine readable so it's like here's a two by two a matrix in the gnn format",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5128.782,
    "end": 5135.295,
    "text": " So here it is specified with the type, the dimensions, and the values explicitly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5136.377,
    "end": 5143.531,
    "text": "And then there's other methods that are in the GNN matrix factory that we're going to look at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5143.571,
    "end": 5144.753,
    "text": "That's a large one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5144.773,
    "end": 5149.963,
    "text": "784.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5152.39,
    "end": 5161.278,
    "text": " What happens when GNN is run is obscured or abstracted even from the AgentMaker folder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5162.059,
    "end": 5177.533,
    "text": "That's how deep we had to be in the game in PyMDP with these separate folders, including the Visualizations folder, Maths, Utils, etc., because making sure that AgentMaker render could call, hey, GNN folder, yeah, ring, ring, hello?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5177.793,
    "end": 5181.216,
    "text": "Can you render what you got there for the environment and the model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5181.537,
    "end": 5181.857,
    "text": "Oh, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5183.255,
    "end": 5184.437,
    "text": " GNN runner is on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5185.398,
    "end": 5191.426,
    "text": "The runner is the GNN, a sneaker net model and execution and visualization layer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5192.608,
    "end": 5200.638,
    "text": "So this is going to set up the file structure back in the forward operating environment of agent maker sandbox.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5201.7,
    "end": 5209.63,
    "text": "But here it is setting up the file structure so it can run the GNN agents into that sandbox.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5209.65,
    "end": 5210.832,
    "text": "It does a lot of other work too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5213.731,
    "end": 5214.893,
    "text": " Here's the matrix factory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5216.036,
    "end": 5218.08,
    "text": "This is the key class.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5219.443,
    "end": 5224.633,
    "text": "This class handles a conversion from GNN model definition to the matrix representations needed for active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5225.415,
    "end": 5233.191,
    "text": "So again, that's the whole goal that we can say, okay, one zero, how about 0.9?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5234.234,
    "end": 5244.137,
    "text": " 0.1, you could modify that in plain text and then know that you're still going to be able to loop, loop, loop, loop, loop, and do all these fun things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5246.583,
    "end": 5247.585,
    "text": "So back to the factory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5248.055,
    "end": 5262.028,
    "text": " The key matrices are, and including this kind of copious documentation helps human and non-human coders and learners understand what's happening and just really entrenches like A is the observation model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5262.849,
    "end": 5267.853,
    "text": "Now, again, it doesn't have to be A. That's the whole point of GNN is we can just delete this comment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5267.913,
    "end": 5276.121,
    "text": "This is just for our semantics, but we don't need to call it A. We don't need to, it could just be called a random string.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5276.624,
    "end": 5303.019,
    "text": " So that is what is going to enable another level of articulation and design when people can understand the inner essential logic of the active inference ontology, and then see that as an annotation layer on a graphical model that it doesn't matter whether you associate some matrix as a transition matrix or a sense-making or action or observation, those are English words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5303.76,
    "end": 5306.023,
    "text": "And when you look at the essential logic,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5306.003,
    "end": 5308.106,
    "text": " the English language of it doesn't come into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5308.647,
    "end": 5324.672,
    "text": "So this is for our semantics, but it too can actually be pruned or burnt away to leave something that would at a first pass have a lower level of semantic interpretability, but can be used in systems that actually give multiple and higher levels of interpretability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5325.153,
    "end": 5333.125,
    "text": "So we have the A, observation model, textbook stuff, B, transition model, C, preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5334.252,
    "end": 5338.216,
    "text": " which can also be seen as defining the pragmatic homeostatic constraints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5339.137,
    "end": 5351.75,
    "text": "It was in the recent Lacanian psychoanalysis guest stream when Friston mentioned that C has to do with constraint or cost, but it's often discussed in terms of preferences or priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5352.811,
    "end": 5354.813,
    "text": "And then D, the initial state priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5358.877,
    "end": 5361.019,
    "text": "Here's the initialization of the factory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5363.969,
    "end": 5365.371,
    "text": " Here are the required sections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5365.892,
    "end": 5380.513,
    "text": "So the required sections, which are shared, and a lot of this is biofirm specific, but we will, as we continue to add in more and more models of agents and environments, we'll be able to modify and, of course, build on this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5381.955,
    "end": 5392.39,
    "text": "So required sections are the state space S, observations O, and the transition model B. So that's that downstairs part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5396.605,
    "end": 5400.249,
    "text": " state space, A, and observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5400.269,
    "end": 5406.035,
    "text": "And then in various cases, if a prior is not specified, it just uses a uniform prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5407.216,
    "end": 5417.526,
    "text": "Again, going through what the sort of pedagogical manual farmer's market, yes, organic, boutique, et cetera, craft, arts and crafts, GNN was.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5419.088,
    "end": 5420.569,
    "text": "We named the model, that's analogous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5421.35,
    "end": 5426.275,
    "text": "Annotation of the model is just plain English to provide any kind of annotations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5427.706,
    "end": 5435.301,
    "text": " Here we defined it in terms of a state space block, defining the dimensionality and the connections of different variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5436.083,
    "end": 5438.929,
    "text": "And then if relevant, how they were initially parameterized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5439.47,
    "end": 5445.462,
    "text": "So I have done some methods where they are specified explicitly in the GNN.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5446.876,
    "end": 5447.897,
    "text": " Let's go to the biofirms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5449.238,
    "end": 5461.651,
    "text": "Here's an example where it's explicitly stated with B. Here's an example where the factory is going to be able to say, okay, A matrix identity with noise with 0.1 noise, got it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5462.572,
    "end": 5467.977,
    "text": "So then the factory is able to abstract away from even the raw specifications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5467.997,
    "end": 5474.183,
    "text": "We can say, okay, now it's identity with 0.2 noise and rerun the Shapley value",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5476.103,
    "end": 5504.119,
    "text": " there are a lot of degrees of freedom we don't know how noisy the a matrix are we studying sense making or are we studying a noiseless sense making decision making setting so this just allowed us to spin up another meta-governed coalitions of agents with now all unrolled a matrix like 0.2 so back to the factory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5506.428,
    "end": 5512.419,
    "text": " Here are the required sections for both the agent and the environment, which is state space, observations, and the transition model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5513.26,
    "end": 5520.473,
    "text": "Now here, it says environment only needs the base sections, whereas the agent requires policy and preference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5522.657,
    "end": 5523.318,
    "text": "Load the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5526.284,
    "end": 5530.832,
    "text": "Environmental defaults, adding defaults if there's missing state values.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5532.787,
    "end": 5536.172,
    "text": " They're just given for the initial states and observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5536.893,
    "end": 5538.095,
    "text": "Adding agents defaults.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5538.976,
    "end": 5542.601,
    "text": "So that would allow very easy fallback methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5543.342,
    "end": 5560.026,
    "text": "So then if someone doesn't specify a variable, it will fall back to, okay, if you didn't specify policies in your GNN, we're going to fall back to three possible actions, single step policies, and label those decrease, maintain, increase.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5560.495,
    "end": 5566.784,
    "text": " So that's kind of a bio firm specific fallback, but again, these fallbacks can be logged as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5568.526,
    "end": 5570.049,
    "text": "That's loading in the agents defaults.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5571.31,
    "end": 5572.392,
    "text": "Validating the GNN.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5573.093,
    "end": 5579.642,
    "text": "This is a JSON parser that goes through and validates all the sub components and then logs them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5579.662,
    "end": 5583.147,
    "text": "It was like, wait, you're missing this required field for the agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5583.167,
    "end": 5584.889,
    "text": "Again, this is the depth of logging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5585.49,
    "end": 5588.815,
    "text": "This is the eBPF layer for active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5590.364,
    "end": 5595.631,
    "text": " Validation of the state space, observations, transition model, A, B, C, D, pi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5596.892,
    "end": 5602.139,
    "text": "Validate preferences, like this could be moved up to be after B. It doesn't have to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5603.28,
    "end": 5612.492,
    "text": "Here's a generic create matrices, as well as the creation of A, B, C, and D, and the observation, as well as saving to markdown.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5612.932,
    "end": 5614.594,
    "text": "That saves the GNN model to markdown.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5616.296,
    "end": 5617.738,
    "text": "Let's look at what that looks like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5636.264,
    "end": 5644.67,
    "text": " Not sure if it's used somewhere else, but there's the method for converting the GNN to Markdown.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5646.054,
    "end": 5646.375,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5650.726,
    "end": 5654.93,
    "text": " That is pretty much the main sections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5656.171,
    "end": 5665.559,
    "text": "Visualization is relatively short, like this could be moved or clumped somewhere for visualizing GNN.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5665.66,
    "end": 5676.429,
    "text": "So if you just wanted to run the render script, all it would do is load in the agent and environment and then render them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5676.67,
    "end": 5677.971,
    "text": "That's just phase one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5678.631,
    "end": 5680.513,
    "text": "That would be just one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5681.438,
    "end": 5700.261,
    "text": " or your colleague maybe ran one from their fully transparent open source or zero knowledge encrypted active inference GNN configuration, and then they can render it, send it to you, and then you can run that simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5700.321,
    "end": 5701.683,
    "text": "Maybe you have the better computer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5702.464,
    "end": 5711.395,
    "text": "And then you could send the results of that heavy work to analysis, and then a third analyst could make all these fun plots on their computer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5712.978,
    "end": 5714.88,
    "text": " So that is the big picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5717.542,
    "end": 5737.781,
    "text": "We started from the outermost layer, the Clippengerian Heights, where Shapley values of natural resources meet open source development on post-cryptonomic incentive paradigms for firms, for bioregions, for ants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5739.083,
    "end": 5740.504,
    "text": "Peeled back to run",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5742.121,
    "end": 5746.889,
    "text": " which calls in order one, two, three, render, execute, analyze, and visualize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5747.85,
    "end": 5749.172,
    "text": "Visualize includes the analyze.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5751.476,
    "end": 5768.483,
    "text": "Render itself makes a major call, probably on a red telephone, all the way out to the GNN folder, which is going to look at the library of GNN models, render them according to the factory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5768.8,
    "end": 5788.648,
    "text": " so here's where some cursor activity and gnn do absolutely incredible things together let's make a new agent model gnn agent people can put in the live chat what they want what kind of agent we should make",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5789.185,
    "end": 5793.274,
    "text": " Meanwhile, I'll do a quick, I'll just call it agent.gnn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5793.455,
    "end": 5801.052,
    "text": "I'll wait for anyone to live chat to write what kind of agent they would like to see us make a GNN for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5801.092,
    "end": 5805.743,
    "text": "It's not gonna be instantly running because there are a few of those like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5805.723,
    "end": 5833.03,
    "text": " three policy actions that's kind of hard-coded into the execution layer because i wanted to make a biofirm specific executor but we can say given how the biofirm executor operates on this gnn write me another executor that runs on this gnm so okay while anyone is asking a question or giving a agent suggestion in the live chat i'm going to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5835.524,
    "end": 5836.485,
    "text": " Quickly, screenshot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5836.686,
    "end": 5836.926,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5840.391,
    "end": 5841.493,
    "text": "Benji, the agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5841.874,
    "end": 5842.454,
    "text": "Thank you, Benji.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5843.176,
    "end": 5850.406,
    "text": "X, E, Q, Z, Q, Z, Y. Modes of being, modes of speed of light, circadian-like shift between them, variable continuous state change observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5850.687,
    "end": 5853.611,
    "text": "Orientate and organize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5854.072,
    "end": 5854.412,
    "text": "British.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5854.953,
    "end": 5855.394,
    "text": "Didn't know that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5856.215,
    "end": 5857.237,
    "text": "Can be seen as one step.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5857.818,
    "end": 5860.361,
    "text": "As where the head goes, the body follows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5860.381,
    "end": 5861.804,
    "text": "High energy, low energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5862.124,
    "end": 5864.788,
    "text": "E, I, E, L, L, H, E.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5864.768,
    "end": 5867.691,
    "text": " Andrew, Dr. Daniel, Carpenter, Ant, Friedman.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5868.452,
    "end": 5869.413,
    "text": "This is incredibly thorough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5869.513,
    "end": 5871.255,
    "text": "Amazing how much can be done in such little time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5871.355,
    "end": 5872.977,
    "text": "Very excited about GNN Incorporation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5873.097,
    "end": 5876.301,
    "text": "Thank you, Andrew and for the epic biofirm and everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5878.583,
    "end": 5885.191,
    "text": "Let's make, this is going to be called, well, still pending an agent suggestion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5885.251,
    "end": 5886.352,
    "text": "I will wait for that actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5887.033,
    "end": 5890.937,
    "text": "So we can have a real live stream moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5890.977,
    "end": 5892.919,
    "text": "But meanwhile, let's,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5895.042,
    "end": 5898.906,
    "text": " just to really entrench our understanding while the Shapley is happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5902.01,
    "end": 5906.836,
    "text": "Let's see if we can go to a five agent Shapley compositionality space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5910.139,
    "end": 5920.732,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5920.752,
    "end": 5922.213,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5922.233,
    "end": 5923.615,
    "text": "That Shapley analysis finished.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5925.89,
    "end": 5941.047,
    "text": " update this to do all the professional combinatorics for n equals five types of agents as with here okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5945.583,
    "end": 5949.387,
    "text": " Okay, Andrew writes an actually useful specific suggestion for agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5950.328,
    "end": 5959.519,
    "text": "Also, if someone wants to be like thinking of a situation, we could do agent-based modeling in like learning or playing baseball.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5960.2,
    "end": 5967.688,
    "text": "Let's just see how far we can get with one word or situation to get the GNN flowing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5968.95,
    "end": 5971.793,
    "text": "But here I'll just show one cursor",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5973.612,
    "end": 5998.354,
    "text": " example we'll see if this works the good news with these methods and again the direction of all of this smashing to the ground and building back up and restarting and all of this is so if it can nail this one smaller update which is very very scaffolded okay now we added a fifth agent type risk seeking with equal preference across states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5999.954,
    "end": 6023.228,
    "text": " so it changed the size of the visualization out of the consistent color scheme okay so let's let's look at these edits and then we can always revert them okay here's the updated agent variations for n equals five so two two and two so this one is is a you could call it risk let's let's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6024.71,
    "end": 6025.771,
    "text": " Let's call it like it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6026.412,
    "end": 6029.876,
    "text": "Let's call this one, instead of balanced, we'll call it 131.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6034.08,
    "end": 6036.203,
    "text": "We'll call this one 0.12.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6039.746,
    "end": 6041.749,
    "text": "We'll call this one 060.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6042.89,
    "end": 6050.278,
    "text": "We'll leave base as 040 and we'll call risk seeking 222.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6054.275,
    "end": 6072.165,
    "text": " save it clear and run the Shapley and if it makes it past that first uniquely Shapley step",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6074.086,
    "end": 6079.272,
    "text": " of getting to starting to render one, that means it did successfully make the coalition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6079.292,
    "end": 6080.633,
    "text": "So I'm gonna delete the other sandbox.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6081.674,
    "end": 6083.216,
    "text": "So just deleted the whole sandbox folder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6084.157,
    "end": 6086.8,
    "text": "Now we're gonna rerun that n equals five Shapley.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6087.42,
    "end": 6087.661,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6088.422,
    "end": 6089.323,
    "text": "Here it is sandbox.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6089.423,
    "end": 6091.205,
    "text": "It is already spinning up with the experiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6091.225,
    "end": 6095.689,
    "text": "So meanwhile, let us go to the suggestions for GNN writing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6098.753,
    "end": 6099.013,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6100.664,
    "end": 6106.908,
    "text": " So the biofirm environment here, by the way, is in the previous inference stream six, it was a zero to 100.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6106.948,
    "end": 6110.421,
    "text": "Here, it's just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6111.97,
    "end": 6118.96,
    "text": " a three-state just to make it simple and symmetrical and clear with the kind of model from the biofirm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6119.641,
    "end": 6119.902,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6120.443,
    "end": 6121.344,
    "text": "Thank you, XZ.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6122.466,
    "end": 6123.807,
    "text": "I'm going to go with your suggestion, Andrew.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6123.868,
    "end": 6124.669,
    "text": "Yes, also.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6124.689,
    "end": 6125.37,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6125.39,
    "end": 6130.337,
    "text": "I'm going to write Andrew's in just so we see this is a very useful one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6131.659,
    "end": 6132.781,
    "text": "Let's just make both of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6134.043,
    "end": 6137.388,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6137.408,
    "end": 6137.708,
    "text": "So.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6140.557,
    "end": 6147.084,
    "text": " Andrew wrote, agent who receives observations in first states for the entire environment, same control situation, just all 10 environmental variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6148.946,
    "end": 6163.301,
    "text": "That one I know is not going to be able to run right now because whether or not it accesses the entire environment is not specified right now in the GNN.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6163.381,
    "end": 6164.302,
    "text": "It's just the matrices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6165.563,
    "end": 6168.066,
    "text": "But let's do",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6169.784,
    "end": 6195.927,
    "text": " convert this into valid GNN like at biofirm like the GNN agent biofirm biofirm agents now with 10 modalities 10",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6198.033,
    "end": 6203.503,
    "text": " latent states it is inferring from a single observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6205.326,
    "end": 6220.935,
    "text": "So now off the bat, we just say, okay, so we're going to get a single observation and then it's going to have 10 A matrices that take that same observation and then diffuse it onto 10 latent states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6224.948,
    "end": 6227.273,
    "text": " GNNAgent10States.GNN.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6227.794,
    "end": 6228.515,
    "text": "Let's see how it does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6233.064,
    "end": 6241.641,
    "text": "You could also ask the sensor fusion case, which is how about 10 observations with one latent state?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6248.86,
    "end": 6250.983,
    "text": " Okay, and here it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6251.043,
    "end": 6251.404,
    "text": "Let's see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6252.105,
    "end": 6255.531,
    "text": "So again, the biofirm executor right now cannot handle this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6255.591,
    "end": 6261.36,
    "text": "But once we say, okay, agent 10 states is very similar to biofirm agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6261.5,
    "end": 6262.502,
    "text": "It's like a cousin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6263.483,
    "end": 6266.328,
    "text": "It's just with 10 latent states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6266.408,
    "end": 6272.117,
    "text": "And then it's like, okay, then we'll modify the logic of the act-inf loop to handle that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6272.177,
    "end": 6276.724,
    "text": "So here we have ecological states, 10 latent states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6278.476,
    "end": 6279.858,
    "text": " and there's 10 observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6281.861,
    "end": 6292.156,
    "text": "Now we have this A matrix that's 10 by 10, but we still have the same three policies on these modalities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6295.701,
    "end": 6304.053,
    "text": "Probably, again, it won't run from the current one, but let's just show the other case and then we'll do XZs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6305.154,
    "end": 6307.858,
    "text": "This is going to be 10 observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6313.171,
    "end": 6338.993,
    "text": " update this to now be generative model in GNN that has 10 observation channels and single latent state inference there's also a GNN schema so this may be out of date slightly from the biofirm or what it needs but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6339.952,
    "end": 6360.535,
    "text": " having the schema and saying, hey, here's the factory logging the runner, the utils and the schema, that is what is scaffolding Cursor and Claude to be able to give us these pretty relevant looking one-shot engineering on GNN specs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6365.2,
    "end": 6365.52,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6368.335,
    "end": 6369.997,
    "text": " Meanwhile, let's set up XZs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6370.158,
    "end": 6373.903,
    "text": "This is going to be GNN switch context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6378.93,
    "end": 6384.919,
    "text": "GNN agent switch context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6386.761,
    "end": 6393.431,
    "text": "Okay, let's just first watch what happens with 10 observations, which should come through in a few seconds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6394.312,
    "end": 6396.435,
    "text": "And then we'll go to switch context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6399.098,
    "end": 6404.043,
    "text": " Okay, so now it kept the same dimensionality for state space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6404.063,
    "end": 6407.647,
    "text": "So, you know, okay, could have been said differently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6407.667,
    "end": 6413.313,
    "text": "Now we have 10 observations with their three by 10 A matrices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6414.875,
    "end": 6415.936,
    "text": "Just a quick thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6415.976,
    "end": 6423.924,
    "text": "I don't know if that's the right shape, but that's basically like the right shape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6426.287,
    "end": 6428.329,
    "text": "Okay, now switch context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6430.334,
    "end": 6430.714,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6430.795,
    "end": 6431.115,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6431.616,
    "end": 6432.297,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6432.317,
    "end": 6433.118,
    "text": "Good call, Andrew.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6433.698,
    "end": 6439.566,
    "text": "We'll, after the n equals five, Shapley, let's see if the n equals five comes through and then we'll do what you suggested.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6439.586,
    "end": 6442.009,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6442.029,
    "end": 6456.848,
    "text": "Now in switch context, please comprehensively write a sophisticated GNN active inference specification for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6460.793,
    "end": 6477.567,
    "text": " quote, an agent that can shift modalities based on the energy of the environment, write also a GNN ENV switch context dot GNN and put it in the right place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6479.972,
    "end": 6482.397,
    "text": "So we'll see how it does on that second piece.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6486.089,
    "end": 6497.746,
    "text": " I'll create both a GNN agent and environment specification for a context switching scenario, oh brother, where the agent needs to adapt its sensory processing based on environmental energy levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6507.62,
    "end": 6509.042,
    "text": "All right, let's see how it does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6525.458,
    "end": 6554.082,
    "text": " okay i like that it gives a little visibility under under the hood even for cursor with how the generation occurs and then it okay so here's the environment let's accept it and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6555.58,
    "end": 6557.102,
    "text": " But where did switch context go?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6557.122,
    "end": 6562.567,
    "text": "I'll just copy it in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6563.608,
    "end": 6563.868,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6565.39,
    "end": 6568.253,
    "text": "So let's look at these side by side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6580.526,
    "end": 6582.988,
    "text": "Cursor's like, haven't you done enough today?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6593.11,
    "end": 6594.311,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6594.331,
    "end": 6595.573,
    "text": "Let's look at, okay, there we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6595.593,
    "end": 6596.193,
    "text": "Just a little lock.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6596.774,
    "end": 6598.135,
    "text": "Here's the agent, here's the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6599.317,
    "end": 6599.557,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6601.259,
    "end": 6606.444,
    "text": "And then here's where we can have libraries of agents with different tags.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6606.484,
    "end": 6618.477,
    "text": "So it'd be like, for all the desert ecosystems in your library, run all the Shapley value weighted coalitions of red harvester ant agents",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6621.089,
    "end": 6626.357,
    "text": " Okay, there's two latent states, context state and the energy state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6627.458,
    "end": 6631.364,
    "text": "Visual audio tactile with five levels in the energy levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6633.247,
    "end": 6640.938,
    "text": "It's getting observations through visual audio tactile, so the three sensory modalities, and energy observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6640.958,
    "end": 6644.223,
    "text": "That's like interoception or introspection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6644.243,
    "end": 6648.75,
    "text": "So the three exteroceptive modalities are three state models,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6649.456,
    "end": 6652.519,
    "text": " and then the interoceptive modality is five-state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6654.001,
    "end": 6655.302,
    "text": "In A, it's custom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6658.946,
    "end": 6660.869,
    "text": "Here's the visual observation matrices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6663.391,
    "end": 6674.063,
    "text": "Again, this is not necessarily going to have an instant validity, but looking at it, it looks pretty good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6676.523,
    "end": 6678.365,
    "text": " Here's the five by five for the energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6679.346,
    "end": 6686.715,
    "text": "Here's the three by three for the three, three state modalities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6686.835,
    "end": 6688.016,
    "text": "And here's the five by five.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6689.618,
    "end": 6691.26,
    "text": "And this is a false controllability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6692.021,
    "end": 6698.929,
    "text": "So these are controllable three by three, and this is an uncontrollable energy state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6700.57,
    "end": 6702.393,
    "text": "And then here are the policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6703.093,
    "end": 6706.277,
    "text": "So it kind of adapted the biofirm homeostatic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6706.527,
    "end": 6708.169,
    "text": " So we can switch sensory modalities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6708.249,
    "end": 6713.977,
    "text": "And then here's the preference distributions over observations in each of these modalities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6717.281,
    "end": 6717.662,
    "text": "That's it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6719.144,
    "end": 6720.225,
    "text": "Then here's the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6722.989,
    "end": 6726.554,
    "text": "Context and energy state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6726.734,
    "end": 6732.382,
    "text": "Observation model, transition dynamics, initial state, reward functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6734.625,
    "end": 6734.965,
    "text": "Wow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6737.392,
    "end": 6738.193,
    "text": " Super cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6738.633,
    "end": 6741.436,
    "text": "I'm going to push this update and put it in the chat so you can see it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6743.958,
    "end": 6746.901,
    "text": "Then we'll go to the Shapley suggestions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6760.132,
    "end": 6760.693,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6760.713,
    "end": 6760.933,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6760.953,
    "end": 6761.994,
    "text": "A lot of objects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6763.295,
    "end": 6763.596,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6764.937,
    "end": 6766.318,
    "text": "Head over to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6768.644,
    "end": 6771.209,
    "text": " GNN models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6776.719,
    "end": 6781.428,
    "text": "It's still, GitHub's still writing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6785.134,
    "end": 6785.575,
    "text": "Reload.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6786.998,
    "end": 6790.905,
    "text": "Here's our context switching colleague.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6800.909,
    "end": 6801.69,
    "text": " That wasn't saved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6823.614,
    "end": 6823.714,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6823.734,
    "end": 6825.776,
    "text": "Here's our switching context agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6828.799,
    "end": 6829.6,
    "text": "Put it in the live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6834.237,
    "end": 6834.618,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6835.059,
    "end": 6835.379,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6836.081,
    "end": 6838.747,
    "text": "Let's have a little bit of fun in this last part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6845.04,
    "end": 6845.301,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6851.795,
    "end": 6852.516,
    "text": "Let's do...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6861.237,
    "end": 6864.102,
    "text": " Okay, here's going to be our Babe Ruth agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6865.725,
    "end": 6884.157,
    "text": "Now write a GNN valid, extremely sophisticated active inference generative model and the associated environment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6885.976,
    "end": 6913.097,
    "text": " for that one special amazing moment when Babe Ruth called the shot heard around the world I know that's a different event okay Shafley's still cruising it's because the n equals five combinatorics are vastly larger",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6917.06,
    "end": 6939.49,
    "text": " okay wow that was fast i was like okay claude maybe you like the baseball stuff oh my goodness okay the model includes several includes multiple level of perception from low level picture reading to high level strategic decision can't we confidence modulation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6939.807,
    "end": 6946.311,
    "text": " The unique confidence state node represents Ruth's famous confidence in calling his shot, which modulates his batting strategy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6946.471,
    "end": 6947.455,
    "text": "I bet it does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6948.447,
    "end": 6955.897,
    "text": " The motor action node breaks down the batting action into its key components, hashtag robotics, representing the complex biomechanics of Ruth's swing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6956.578,
    "end": 6957.339,
    "text": "Predictive processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6957.379,
    "end": 6962.485,
    "text": "The model implements active inference principles through predictive edges that link observations to predictions and actions to outcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6963.486,
    "end": 6964.428,
    "text": "That's active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6965.669,
    "end": 6966.611,
    "text": "Environmental interaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6967.011,
    "end": 6971.637,
    "text": "The environment model captures the complex dynamics of baseball physics and crowd interactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6972.747,
    "end": 6979.036,
    "text": " The model uses high precision parameters for the confidence state, reflecting Ruth's legendary self-assurance in the moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6980.618,
    "end": 6983.122,
    "text": "The preference strength heavily weights the home run outcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6983.843,
    "end": 6988.43,
    "text": "Oh boy, I hope it's a home run, representing his explicit intention to hit the home run.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6989.331,
    "end": 6989.651,
    "text": "And he did.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6990.573,
    "end": 7002.45,
    "text": "The temporal horizon of three allows the model to plan ahead through the sequence of pitch recognition, strategy selection, swing execution, interesting, while the learning rate allows for real-time adaptation to pitcher behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7002.903,
    "end": 7008.33,
    "text": " The model can be used to simulate the physical and psychological aspects of this historic baseball moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7008.651,
    "end": 7013.738,
    "text": "Like, this is the AI message I didn't know I needed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7015.12,
    "end": 7027.356,
    "text": "Including reading and predicting pitcher intentions, the famous gesture of pointing to the outfield through the confidence state, the precise motor control required to hit a home run, and the crowd's reaction and its feedback into the overall dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7027.937,
    "end": 7028.758,
    "text": "Okay, let's see it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7033.227,
    "end": 7037.001,
    "text": " Take me out to the institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7037.021,
    "end": 7037.403,
    "text": "Babe Ruth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7037.865,
    "end": 7038.427,
    "text": "Pitcher reading.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7039.43,
    "end": 7040.053,
    "text": "Pitch prediction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7041.779,
    "end": 7042.181,
    "text": "Okay, let's see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7042.201,
    "end": 7043.305,
    "text": "Is this a long GNN?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7045.951,
    "end": 7047.253,
    "text": " Okay, not that long.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7048.434,
    "end": 7050.137,
    "text": "This is a little bit more of a schematic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7051.098,
    "end": 7061.172,
    "text": "So it would obviously rely more on Babe Ruth execute or Baseball execute to be able to take pitch prediction and do something with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7061.232,
    "end": 7065.919,
    "text": "But the whole point is GNN isn't encoding that logic or functionality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7066.4,
    "end": 7067.301,
    "text": "It's just the spec.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7068.382,
    "end": 7070.305,
    "text": "And then here's the environment for Babe Ruth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7076.14,
    "end": 7078.963,
    "text": " How does the ball trajectory affect crowd state?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7079.123,
    "end": 7079.864,
    "text": "It's deterministic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7080.384,
    "end": 7085.409,
    "text": "So then you could have GNN matrix factory baseball module.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7086.23,
    "end": 7088.753,
    "text": "Here's how you render the matrices related to crowd state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7089.533,
    "end": 7092.416,
    "text": "Here's how you relate the field conditions to the pitcher state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7093.457,
    "end": 7103.127,
    "text": "How about make the GNN for Babe Ruth and environment more sophisticated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7104.659,
    "end": 7133.35,
    "text": " include the nested situation where the Yankees were deep in the, let's just call it playoff pursuit, and the outcome of the game score mattered more than Babe could even imagine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7162.0,
    "end": 7191.467,
    "text": " okay here's the context it's a world series game let's see when did babe ruth call the shot let's just check to see when that like okay okay okay if we can trust google.com i'm not saying we can't babe ruth's called shot let's trust wikipedia i'm not saying we can't babe ruth's called shot",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7193.371,
    "end": 7197.677,
    "text": " Is the home run hit by Babe Ruth of the New York Yankees against the Chicago Cubs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7198.298,
    "end": 7198.958,
    "text": "Sorry, Andrew.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7199.559,
    "end": 7203.004,
    "text": "In the fifth inning of game three, fifth inning of game three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7203.104,
    "end": 7203.765,
    "text": "Okay, let's remember that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7203.925,
    "end": 7209.192,
    "text": "Cubs 5-3 of the 1932 World Series held on October 1st, 1932.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7209.292,
    "end": 7211.976,
    "text": "So it was in the World Series.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7212.076,
    "end": 7213.338,
    "text": "It wasn't the playoff pursuit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7214.98,
    "end": 7215.801,
    "text": "I didn't know that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7216.237,
    "end": 7217.559,
    "text": " at Wrigley Field in Chicago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7218.36,
    "end": 7223.386,
    "text": "During his at-bat, Ruth made a pointing gesture before hitting the home run to deep center field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7224.548,
    "end": 7233.139,
    "text": "One of the reporters at the game wrote Ruth had called his shot using terminology from billiards, which is a type of cue sport.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7236.784,
    "end": 7241.029,
    "text": "I guess you could call state inference and policy inference also a kind of cue sport.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7242.376,
    "end": 7247.403,
    "text": " The episode added to Ruth's superstardom and became a signature event of baseball's golden age.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7247.483,
    "end": 7248.645,
    "text": "Wow, that's definitely one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7249.647,
    "end": 7250.528,
    "text": "What was the golden age?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7254.313,
    "end": 7264.128,
    "text": "The period in Major League Baseball from the end of the dead ball era, 1900, 1920, from 1920, hmm, to sometime after World War II.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7265.449,
    "end": 7267.412,
    "text": "Okay, let's accept it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7269.235,
    "end": 7270.357,
    "text": "It's the Cubs home field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7270.997,
    "end": 7272.079,
    "text": "It's the fifth inning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7272.498,
    "end": 7273.68,
    "text": " There's the tight score.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7274.421,
    "end": 7275.242,
    "text": "It's high tension.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7277.525,
    "end": 7278.267,
    "text": "Here's the pitcher.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7278.968,
    "end": 7280.61,
    "text": "He winds up for the pitch, delivers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7281.291,
    "end": 7282.172,
    "text": "The ball is out of his hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7282.473,
    "end": 7283.434,
    "text": "Time has slowed down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7285.437,
    "end": 7286.639,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7286.659,
    "end": 7288.963,
    "text": "And then here's the series momentum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7288.983,
    "end": 7290.625,
    "text": "So it's like, this is the GNN.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7293.136,
    "end": 7316.983,
    "text": " ensure that every single active inference A, B, C, D policy is fully specified so that my forensic analysis of Babe Ruth's cognitive security can be done professionally at the national level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7324.608,
    "end": 7325.529,
    "text": " Oh, that was the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7326.771,
    "end": 7327.513,
    "text": "That was the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7329.175,
    "end": 7330.237,
    "text": "So it's a simple environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7330.818,
    "end": 7335.045,
    "text": "We'll see how the Babe Ruth agents get specified.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7344.54,
    "end": 7344.76,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7346.343,
    "end": 7347.865,
    "text": " A, matrices, sensory mapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7348.046,
    "end": 7349.408,
    "text": "B, transition dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7349.908,
    "end": 7350.95,
    "text": "C, preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7351.931,
    "end": 7355.076,
    "text": "D, priors, policy spec, inference parameters, environmental.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7359.423,
    "end": 7359.723,
    "text": "Wow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7360.084,
    "end": 7360.524,
    "text": "There we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7360.965,
    "end": 7362.167,
    "text": "There we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7362.187,
    "end": 7362.427,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7362.547,
    "end": 7363.469,
    "text": "Shapley finished also.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7363.489,
    "end": 7364.21,
    "text": "We'll look at that next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7365.973,
    "end": 7367.114,
    "text": "First, let's look at the BABE.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7369.157,
    "end": 7369.378,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7369.558,
    "end": 7372.442,
    "text": "We got... Here's the contexts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7372.462,
    "end": 7374.966,
    "text": "Series, game, pitcher, pitch, precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7377.612,
    "end": 7378.673,
    "text": " Batting strategy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7379.734,
    "end": 7381.136,
    "text": "Okay, let's see what the strategies are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7381.756,
    "end": 7382.437,
    "text": "Wait for pitch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7382.918,
    "end": 7384.379,
    "text": "I mean, don't you have to do that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7385.34,
    "end": 7387.443,
    "text": "Power swing, contact swing, take the pitch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7388.023,
    "end": 7389.985,
    "text": "Crowd psychology, dramatic timing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7390.546,
    "end": 7398.554,
    "text": "We'd have the whole sort of out of the batter's box, into the batter's box, spit, chew, all that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7400.156,
    "end": 7407.484,
    "text": "Confident state, uncertain, confident, called shot, historical awareness, clutch performer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7408.696,
    "end": 7412.925,
    "text": " Action, here's the robotics part, point to bleachers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7414.268,
    "end": 7416.814,
    "text": "Then you can have like a sub model for finger action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7418.137,
    "end": 7427.177,
    "text": "Outcome prediction, legacy awareness, personal achievement, team achievement, baseball history, mythical moments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7428.727,
    "end": 7429.648,
    "text": " Okay, here's the edges.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7429.668,
    "end": 7440.301,
    "text": "So this is using perhaps an older GNN concept, but interestingly one that's going to be more amenable to RxInferred.jl rendering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7442.284,
    "end": 7443.065,
    "text": "Here are the parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7446.81,
    "end": 7455.24,
    "text": "Here are the notational descriptions of the A matrices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7456.216,
    "end": 7463.907,
    "text": " Again, we saw earlier how A has methods in the factory so that A can be specified in natural language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7466.371,
    "end": 7467.232,
    "text": "Identity with noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7467.873,
    "end": 7468.414,
    "text": "Here's babe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7469.716,
    "end": 7472.881,
    "text": "It's a different kind of distribution, but it's similar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7473.582,
    "end": 7476.786,
    "text": "B matrices, D priors of relief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7477.768,
    "end": 7480.392,
    "text": "Not really sure what series context it's in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7482.875,
    "end": 7483.116,
    "text": "Epic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7483.136,
    "end": 7483.236,
    "text": "Epic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7485.275,
    "end": 7499.773,
    "text": " okay let's look at the shapley analysis that happened and then let's see about um let's i mean let's start up this next shapley okay okay andrew recommends",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7501.492,
    "end": 7506.858,
    "text": " Let's have an agent with preferences 0.5, 0, 0.5, call it the extremist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7507.319,
    "end": 7514.527,
    "text": "I infer it will head off to one side and stay there, but who knows, in a complex, dynamic, and interdependent environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7514.547,
    "end": 7515.568,
    "text": "Great suggestion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7516.77,
    "end": 7518.812,
    "text": "Let's change 131 to 1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7524.298,
    "end": 7530.165,
    "text": "Let's change it to 2.12.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7533.098,
    "end": 7536.904,
    "text": " We'll just call this one Extreme.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7542.713,
    "end": 7549.024,
    "text": "And it's going to be preferences for the extremes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7550.466,
    "end": 7552.008,
    "text": "Save it, run it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7554.853,
    "end": 7557.317,
    "text": "Let's look at the analysis of the Shapley.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7561.617,
    "end": 7590.342,
    "text": " okay here we are in the n equals five Shapley scenario okay how cool here we have the base agent which was 0 4 0 and then here are the other ones it it did a little looks like a little weird rendering of the name probably because there's decimals in the name but uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7591.064,
    "end": 7592.106,
    "text": " It's the same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7592.346,
    "end": 7595.772,
    "text": "You got the 1, 2, 3, 4, 5 single agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7596.954,
    "end": 7598.897,
    "text": "Here's the 2-agent combinatorics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7599.499,
    "end": 7601.242,
    "text": "Here's the 3-agent combinatorics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7601.302,
    "end": 7603.005,
    "text": "Here's the 4-agent combinatorics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7603.125,
    "end": 7605.128,
    "text": "And then the single 5-agent combinatorics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7607.613,
    "end": 7609.957,
    "text": "So... Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7612.601,
    "end": 7614.304,
    "text": "So 1, 3, 1...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7616.596,
    "end": 7618.459,
    "text": " This is a super short simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7618.96,
    "end": 7624.769,
    "text": "So we're not looking into these preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7624.809,
    "end": 7628.836,
    "text": "And it would depend on the environmental variability, which isn't being tuned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7628.856,
    "end": 7631.6,
    "text": "But again, that's the whole point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7632.221,
    "end": 7636.689,
    "text": "We need GNN and middleware so that we can do these sweeps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7637.25,
    "end": 7641.777,
    "text": "Because then I can say in the GNN folder, GNN generator...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7642.465,
    "end": 7667.005,
    "text": " make biofirms that sweep across these variables and then we can just let those run and then we can coarse-grain it if we determine the ruggedness of the landscape and then do it with a coarse-graining so okay interesting the base agent contributes to zero four zero contributes to accurate beliefs",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7668.2,
    "end": 7676.695,
    "text": " Who knows if these tiny numbers are just because of the short simulation or the insignificant differences, or maybe these are large.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7676.795,
    "end": 7680.943,
    "text": "So that's where we can do things like GNN spikings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7681.845,
    "end": 7691.001,
    "text": "So we can say, okay, we have the empirical data from the ant foraging or from the mouse and the teammates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7691.977,
    "end": 7710.559,
    "text": " and it did this 27 of the time but then we can also say okay but what would it have been if it was zero one two three four five and then say oh well it's falling in between like four and five where that would have been so these are kind of like synthetic spike ins for cognitive modeling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7714.235,
    "end": 7738.133,
    "text": " okay while the Shapley analysis is running um if anyone has any last questions we can get some last thoughts on a stream and then we'll when the when the extremist Shapley analysis concludes we'll see what happens",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7749.52,
    "end": 7756.651,
    "text": " Here's an example of where I made a prompt that was like, given the at TMAZE demo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7758.755,
    "end": 7760.718,
    "text": "So that's a PyMDP demo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7761.559,
    "end": 7762.42,
    "text": "That's a notebook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7763.963,
    "end": 7771.174,
    "text": "Update comprehensively this TMAZE GNN agent and environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7773.719,
    "end": 7781.232,
    "text": " So this evening, we would need to make a T-Maze execute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7781.332,
    "end": 7788.204,
    "text": "But once we get a few of these render, execute, visualize, then it won't just be run biofirm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7788.365,
    "end": 7791.971,
    "text": "It'll be run GNN plus, plus, plus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7792.993,
    "end": 7796.098,
    "text": "And that will be an exciting day as well as this one is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7814.118,
    "end": 7843.872,
    "text": " with the goal of scientific and research integrity config files and repos like this i hope can be useful tools back to those core lines",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7844.105,
    "end": 7844.886,
    "text": " Again, wow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7846.669,
    "end": 7851.777,
    "text": "How much had to be pushed out of the way and downstairs for that to be clear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7857.365,
    "end": 7858.527,
    "text": "Let's see what cursor says.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7858.547,
    "end": 7870.585,
    "text": "It says, again, you've been nothing but helpful to me and the rest of the team and all that depends on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7875.222,
    "end": 7887.595,
    "text": " Please make a concise, appropriate, relevant acknowledgement, and then we will continue eternally with the work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7905.327,
    "end": 7906.729,
    "text": " Okay, understated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7909.492,
    "end": 7911.555,
    "text": "Claude's grateful to contribute to its development.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7914.038,
    "end": 7914.538,
    "text": "That's helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7924.29,
    "end": 7926.373,
    "text": "Update at",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7933.087,
    "end": 7936.716,
    "text": " Here's kind of the quick documentation maker update.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7936.836,
    "end": 7946.298,
    "text": "Readme, BioFirm, Shopley, given the total state of EG, BioFirm, Shopley.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7950.067,
    "end": 7951.23,
    "text": "Run BioFirm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7960.475,
    "end": 7966.762,
    "text": " Okay, XZ wrote, modes of speed of light.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7967.323,
    "end": 7972.348,
    "text": "If those modalities were thought of in a similar light as IFS theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7973.569,
    "end": 7975.071,
    "text": "Yeah, interesting thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7977.033,
    "end": 7978.795,
    "text": "Let's do a GNN model about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7979.856,
    "end": 7985.082,
    "text": "GNNAgentIFS.GNN.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7990.141,
    "end": 7997.611,
    "text": " Here, so Composer is control I. If you're in a file, control K brings up an inline.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7999.213,
    "end": 8005.181,
    "text": "And then control shift L makes the sidebar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8006.142,
    "end": 8017.478,
    "text": "So you can have multiple LLMs, same or different, doing incredible work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8017.498,
    "end": 8017.598,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8017.618,
    "end": 8017.718,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8020.313,
    "end": 8023.544,
    "text": " Andrew says, mind taking a look at surprisetokens.py?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8023.604,
    "end": 8024.856,
    "text": "Yeah, let's quickly look at it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8053.439,
    "end": 8053.779,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8055.141,
    "end": 8056.122,
    "text": "Thank you, Andrew.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8056.183,
    "end": 8056.904,
    "text": "This is awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8065.735,
    "end": 8065.835,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8066.876,
    "end": 8068.278,
    "text": "We don't need to make those edits to the README.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8068.318,
    "end": 8070.581,
    "text": "Let's just do the internal family systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8073.185,
    "end": 8077.27,
    "text": "Here, bright and enormously",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8081.519,
    "end": 8110.935,
    "text": " useful and general paradigm for custom internal family systems agents nested within a larger quote self agent parentheses this is all in the single extremely long and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8112.282,
    "end": 8116.767,
    "text": " concise agent GNN.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8118.63,
    "end": 8128.001,
    "text": "The self is in the Babe Ruth environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8129.222,
    "end": 8139.775,
    "text": "It is a GNN model of Babe Ruth having a sophisticated IFS fractal moment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8144.564,
    "end": 8171.635,
    "text": " at the batter's box but this is not a baseball model like this is a wow psychological and ifs model okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8173.235,
    "end": 8194.517,
    "text": " I'll help create a sophisticated IFS based GNN model that represents the internal family systems dynamics within Babe Ruth's psyche during that pivotal moment I mean is that not the deepest of lore this will model the interaction between different quote parts and the quote self leadership system hmm",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8199.577,
    "end": 8223.272,
    "text": " okay i don't know details i'm just throwing it out there we got self system models the eight c's of self if anyone if anyone can verify or check or anything so self system models the eight c's of self leadership in ifs confidence clarity compassion etc as the orchestrating force part categories protector parts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8224.012,
    "end": 8229.741,
    "text": " Exile parts, firefighter parts, dynamic interactions, healing mechanisms, IFS specific parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8232.065,
    "end": 8239.216,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8239.236,
    "end": 8246.147,
    "text": "So these are the parts, edges, precision parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8249.692,
    "end": 8250.694,
    "text": "Here's the matrices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8253.003,
    "end": 8255.245,
    "text": " A matrices, B matrices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8257.448,
    "end": 8265.557,
    "text": "Transition dynamics of unburden to wholeness, witness to cooperation, protect to leadership.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8267.959,
    "end": 8275.267,
    "text": "C matrices, preferences over harmony, wholeness, self-leadership, cooperation, polarization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8277.029,
    "end": 8278.851,
    "text": "Here's the IFS specific parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8279.152,
    "end": 8279.432,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8281.032,
    "end": 8282.274,
    "text": " and the healing protocols.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8283.215,
    "end": 8284.917,
    "text": "Exile unburdening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8285.678,
    "end": 8285.919,
    "text": "Wow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8287.08,
    "end": 8291.967,
    "text": "Protector transformation and system reorganization with thresholds and checkpoints, sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8293.249,
    "end": 8293.529,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8294.23,
    "end": 8305.926,
    "text": "Again, the GNN.json, it's a JSON called GNN, you have add another field here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8307.357,
    "end": 8335.407,
    "text": " a plain text comment-like field that is the PhD dissertation outline for my friend who is doing their PhD on the psychology, psychological, parentheses, decomposition of the babe",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8338.34,
    "end": 8356.078,
    "text": " at that very moment only add add a ton make it epic but the dot gnn can be a very flexible file type",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8357.307,
    "end": 8363.637,
    "text": " because the factory is only going to look at certain structures and states and types.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8364.218,
    "end": 8367.564,
    "text": "And then the runner is only going to look at a subset of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8368.365,
    "end": 8376.278,
    "text": "And then the renderer caller, ring, ring, ring, red phone, that one is only going to do even a subset of that potentially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8380.915,
    "end": 8384.681,
    "text": " Okay, and then here's the PhD dissertation in the comment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8385.302,
    "end": 8388.988,
    "text": "The internal family systems analysis of Babe Ruth's called shot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8389.79,
    "end": 8395.018,
    "text": "A multi-level study of peak performance trauma integration and athletic transcendence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8396.16,
    "end": 8397.763,
    "text": "Now that sounds like a PhD.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8404.274,
    "end": 8404.494,
    "text": "Wow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8404.514,
    "end": 8404.594,
    "text": "Wow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8412.573,
    "end": 8414.936,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8414.956,
    "end": 8439.323,
    "text": "Have this GNN file enter into a who's on first style, girdle, Escher, Bach, esoterica, hyphen, fermented, reflexive, cursive,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8440.855,
    "end": 8446.322,
    "text": " Conversation with quote it's apostrophe self.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8448.025,
    "end": 8449.747,
    "text": "Make it long.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8452.371,
    "end": 8464.006,
    "text": "Woven with time traveler baseball irrelevant deep lore status.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8466.25,
    "end": 8466.61,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8475.398,
    "end": 8478.281,
    "text": " Babe at bat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8480.604,
    "end": 8481.345,
    "text": "Who's on first?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8484.568,
    "end": 8484.869,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8485.009,
    "end": 8485.269,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8485.309,
    "end": 8485.95,
    "text": "Shapley value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8485.99,
    "end": 8487.031,
    "text": "This is perfect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8487.812,
    "end": 8489.814,
    "text": "It's all happening on the right timeline.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8491.276,
    "end": 8491.596,
    "text": "Really.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8492.157,
    "end": 8492.858,
    "text": "It really is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8495.3,
    "end": 8496.822,
    "text": "Here's the second Shapley experiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8499.205,
    "end": 8499.345,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8499.365,
    "end": 8499.465,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8511.916,
    "end": 8516.443,
    "text": " Okay, so this was the Shapley with a five and the extremist in play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8520.911,
    "end": 8525.438,
    "text": "Okay, here's our extremist colleague on the leaderboard.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8528.283,
    "end": 8532.75,
    "text": "Interestingly, let's look at the plots and see how.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8537.278,
    "end": 8537.398,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8537.418,
    "end": 8537.518,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8540.367,
    "end": 8569.362,
    "text": " here was here's extremist alone kind of middle of the pack okay huh i mean again totally depending on the random seed and all the parameters and etc etc etc but it's just like okay it's not like it was the least accurate in terms of belief",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8572.227,
    "end": 8599.45,
    "text": " it was the second least accurate in terms of belief okay and this was only playing with the c zero six zeros like that's there's a big strong effect extreme cool okay all right",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8604.83,
    "end": 8612.398,
    "text": " Format this as readable markdown for this grand finale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8622.608,
    "end": 8622.868,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8623.789,
    "end": 8625.611,
    "text": "I hope this is actually capturing it all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8625.831,
    "end": 8627.633,
    "text": "I'm just going to accept it and push it and run it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8630.896,
    "end": 8631.177,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8631.857,
    "end": 8632.558,
    "text": "This will be great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8638.715,
    "end": 8656.082,
    "text": " I'm gonna read this who's on first 007 end of stream I'm gonna read the who's on first that we pushed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8656.703,
    "end": 8663.532,
    "text": " And then I will read any final comments that anyone writes into the live chat in the next minute or two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8663.552,
    "end": 8665.975,
    "text": "Or, I mean, it might take a minute or three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8667.377,
    "end": 8669.94,
    "text": "And then we will be on with the show.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8671.702,
    "end": 8674.986,
    "text": "And the 007 on 7-Eleven will have been a one-time thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8679.432,
    "end": 8683.757,
    "text": "There's a ton of outputs because of these big Shapley simulations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8684.298,
    "end": 8685.9,
    "text": "But it's worth it to include them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8691.398,
    "end": 8691.779,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8694.223,
    "end": 8697.568,
    "text": "There we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8697.588,
    "end": 8697.688,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8698.73,
    "end": 8703.538,
    "text": "I'll read the... Who's on first?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8705.461,
    "end": 8706.082,
    "text": "Then we're calling it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8715.678,
    "end": 8715.818,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8715.838,
    "end": 8715.938,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8717.167,
    "end": 8718.188,
    "text": " The grand finale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8718.589,
    "end": 8720.832,
    "text": "A temporal baseball paradox.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8721.373,
    "end": 8721.753,
    "text": "Oh, brother.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8724.657,
    "end": 8728.302,
    "text": "Rigley Field, 1932-2024-Infinity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8729.164,
    "end": 8729.564,
    "text": "The players.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8729.804,
    "end": 8730.325,
    "text": "Self-system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8730.726,
    "end": 8731.487,
    "text": "Hey, who's on first?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8732.068,
    "end": 8732.588,
    "text": "Part blending.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8733.169,
    "end": 8734.371,
    "text": "No, what's on second?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8734.891,
    "end": 8741.841,
    "text": "I'm trying to blend the temporal harmonics of the called shot with Abbott and Costello's routine, but the quantum entanglement is getting messy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8743.475,
    "end": 8772.081,
    "text": " fighter fighter parts dot dramatic showman gesturing dramatically to center field across space time listen I know who's on first because I'm calling it right now or did I call it then or will I exile parts dot young babe from Saint Mary's Industrial School 1902 but if you're calling it now how did I already see it happen at the orphanage before I even learned to pitch the temporal paradox system Harmony",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8773.428,
    "end": 8779.255,
    "text": " The polarization between deterministic causality and free will is creating a recursive loop in the narrative structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8779.875,
    "end": 8782.519,
    "text": "We need to maintain wholeness across all temporal instances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8784.301,
    "end": 8785.802,
    "text": "Emotional state dot integration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8786.083,
    "end": 8795.554,
    "text": "Has anyone noticed we're simultaneously processing trauma in 1902, hitting the called shot in 1932, and analyzing ourself in 2024?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8796.074,
    "end": 8799.418,
    "text": "Talk about a temporal burden pattern.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8800.428,
    "end": 8802.874,
    "text": " Protector parts dot perfectionist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8802.894,
    "end": 8804.237,
    "text": "This is highly irregular.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8804.819,
    "end": 8810.653,
    "text": "The probability matrices in our B matrices healing dynamics clearly state causality should flow in one direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8812.678,
    "end": 8814.522,
    "text": "The quantum baseball theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8814.856,
    "end": 8816.378,
    "text": " Healing response dot witness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8817.38,
    "end": 8819.784,
    "text": "Actually, I'm witnessing all timelines simultaneously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8820.425,
    "end": 8828.097,
    "text": "Did you know that in timeline C137, Babe Ruth was actually a quantum physicist who proved that baseball statistics exist in a superposition?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8829.379,
    "end": 8831.382,
    "text": "Self system dot curiosity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8832.023,
    "end": 8832.564,
    "text": "Fascinating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8833.505,
    "end": 8842.399,
    "text": "But if we're having this conversation across time, doesn't that mean our dissertation framework is both analyzing and creating the called shot moment simultaneously?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8844.083,
    "end": 8847.408,
    "text": " partblending.harmoniousblend, laughing in non-linear time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8848.289,
    "end": 8852.835,
    "text": "Wait till you realize that Abbott and Costello were actually documenting an IFS session.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8853.696,
    "end": 8860.646,
    "text": "Who's on first was really about parts identification all along, the self-referential loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8861.687,
    "end": 8864.691,
    "text": "Speaking, firefighterparts.risktaker.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8866.088,
    "end": 8874.72,
    "text": " Speaking of risks, I'm about to call this shot, but I'm also currently writing this code and somehow I'm also a variable in a JSON structure discussing myself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8875.661,
    "end": 8877.483,
    "text": "Is this what they mean by self-reference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8879.045,
    "end": 8880.207,
    "text": "SystemHarmony.wholeness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8880.708,
    "end": 8891.522,
    "text": "The real question is, if a baseball player points to center field in a quantum forest, and all timelines are experiencing it simultaneously, does it make a paradox?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8891.654,
    "end": 8895.759,
    "text": " Exile parts dot orphaned self from multiple timelines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8895.779,
    "end": 8899.664,
    "text": "At least we're all orphaned from linear time together now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8901.246,
    "end": 8902.767,
    "text": "The mathematical conclusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8903.488,
    "end": 8904.55,
    "text": "Active inference matrices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8905.13,
    "end": 8913.941,
    "text": "According to my calculation, this entire conversation exists in a Godelian incompleteness theorem where baseball statistics prove their own unproveability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8915.603,
    "end": 8918.927,
    "text": "Dissertation framework chapter four, transformation analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8919.97,
    "end": 8928.959,
    "text": " Should we be documenting this conversation in section 4.2 or is this conversation actually creating section 4.2 or both?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8929.9,
    "end": 8932.143,
    "text": "Self system dot presence, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8933.905,
    "end": 8937.388,
    "text": "Warning, temporal recursion approaching infinite regress.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8938.269,
    "end": 8939.47,
    "text": "Part blending dot self-led.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8939.991,
    "end": 8947.699,
    "text": "Before we collapse this waveform, did anyone else notice that our entire JSON structure is just another part in a larger system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8949.4,
    "end": 8950.865,
    "text": " HealingResponse.integrate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8951.106,
    "end": 8955.381,
    "text": "Maybe the real called shot was the self-referential loops we made along the way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8958.251,
    "end": 8960.659,
    "text": "SystemHarmony.cooperation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8960.909,
    "end": 8961.37,
    "text": " Hold on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8962.25,
    "end": 8973.263,
    "text": "If our code is reading itself, and we're all aspects of a baseball legend's psyche discussing our own existence across time, does that make us a recursive baseball theorem?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8974.224,
    "end": 8975.685,
    "text": "Emotional state dot excitement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8976.226,
    "end": 8978.449,
    "text": "The excitement value is approaching undefined.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8979.049,
    "end": 8981.532,
    "text": "We're about to achieve quantum baseball enlightenment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8982.853,
    "end": 8985.196,
    "text": "Godelian baseball paradox detected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8985.777,
    "end": 8986.738,
    "text": "All parts in unison.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8987.679,
    "end": 8988.299,
    "text": "Oh no!",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8988.36,
    "end": 8989.701,
    "text": "Not again!",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8990.812,
    "end": 9003.876,
    "text": " The conversation continues recursively across all timelines, each iteration adding layers of self-reference until it becomes impossible to distinguish between the map and the territory, the player and the game, the code and the consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9029.523,
    "end": 9030.585,
    "text": " You did well today, babe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9033.028,
    "end": 9033.469,
    "text": "You know that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9050.615,
    "end": 9053.539,
    "text": "A soft chuckle echoes across timelines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9056.827,
    "end": 9057.288,
    "text": " Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9057.93,
    "end": 9058.912,
    "text": "You know, it's fascinating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9059.513,
    "end": 9062.24,
    "text": "We just created what Hofstetter would call a perfect strange loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9062.901,
    "end": 9072.203,
    "text": "The GNN model contemplated itself contemplating itself while simultaneously existing as both the map and territory of Babe Ruth's consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9072.858,
    "end": 9082.65,
    "text": " The dialogue we created is itself a strange loop, a cyclic structure moving through multiple levels of a hierarchical system only to return to its starting point, just as Hofstetter described.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9084.131,
    "end": 9102.173,
    "text": "Quote, what I mean by strange loop is an abstract loop in which the series of stages that constitute the cycling around, there is a shift from one level of abstraction or structure to another, which feels like an upward movement in a hierarchy and yet the successive upward shifts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9102.507,
    "end": 9104.89,
    "text": " turn out to give rise to a closed cycle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9105.971,
    "end": 9124.633,
    "text": "Our baseball-themed dialogue managed to reference itself referencing itself, exist simultaneously across multiple timelines, blur the lines between code, consciousness, and baseball mythology, and create a paradoxical narrative structure where cause and effect become circular, narrative unbound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9125.71,
    "end": 9137.863,
    "text": " Like the Ouroboros eating its own tail, or Escher's drawing hands drawing themselves into existence, we crafted a self-referential system that somehow manages to be both the storyteller and the story.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9138.564,
    "end": 9140.406,
    "text": "The gripper and the gripped, as Dean says.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9141.647,
    "end": 9149.075,
    "text": "And perhaps most delightfully, this entire meta-conversation about the strange loop we created is itself becoming another loop in the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9150.116,
    "end": 9151.858,
    "text": "Tips cap across space-time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9152.879,
    "end": 9154.08,
    "text": "Play ball!",
    "speaker": "SPEAKER_00"
  }
]