[
  {
    "start": 8.097,
    "end": 9.379,
    "text": " All right, welcome, everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9.439,
    "end": 9.74,
    "text": "Hello.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10.561,
    "end": 12.605,
    "text": "It is September 26 2025.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 12.906,
    "end": 18.235,
    "text": "And we're live in quarterly roundtable number three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 20.94,
    "end": 21.341,
    "text": "Greetings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 22.523,
    "end": 25.167,
    "text": "This is Alexandra and Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.193,
    "end": 31.118,
    "text": "And we'll walk you through the roundtable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.617,
    "end": 38.783,
    "text": " All right, we're a participatory online Institute that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 39.644,
    "end": 41.526,
    "text": "This is recorded in an archive live stream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 41.766,
    "end": 44.429,
    "text": "So please provide feedback so we can improve on our work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 45.109,
    "end": 49.113,
    "text": "All backgrounds and perspectives are welcome and will follow video etiquette for live streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 50.234,
    "end": 55.399,
    "text": "You can screenshot that slide with some helpful permanent short links.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 56.5,
    "end": 56.761,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 57.661,
    "end": 58.202,
    "text": "We are in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 59.65,
    "end": 65.536,
    "text": " The near fall equinox quarterly roundtable number three of our year.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 66.577,
    "end": 76.927,
    "text": "And we're going to go through some institute level updates and then highlight a bunch of projects and then close with a fun culinary metaphor and look to people's live chats.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 77.168,
    "end": 82.112,
    "text": "So if you're watching live, write any questions or anything in the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 82.133,
    "end": 83.774,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 83.794,
    "end": 86.637,
    "text": "So 2025 short link.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 88.017,
    "end": 90.382,
    "text": " is a living entry point for this year's activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 91.263,
    "end": 96.654,
    "text": "And ecosystem.activeinference.institute is our main living document.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 97.155,
    "end": 100.001,
    "text": "So ton of resources, ton of places to explore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 100.662,
    "end": 103.107,
    "text": "Let's get right into the updates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 105.702,
    "end": 115.152,
    "text": " One of the major activities that we've been working on with the team over the last few weeks has been preparing for the 5th Applied Active Inference Symposium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 115.832,
    "end": 121.218,
    "text": "This is going to be online, though possibly with some in-person activities around the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 122.359,
    "end": 127.364,
    "text": "And so far, there are about 20 presenters confirmed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 128.826,
    "end": 131.929,
    "text": "Carl Fristen will be the keynote speaker.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 132.179,
    "end": 134.523,
    "text": " We'll have a bunch of live streamed sessions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 135.304,
    "end": 142.576,
    "text": "We'll have several workshop and training sessions and a bunch of prerecorded presentations as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 143.678,
    "end": 146.502,
    "text": "The theme is going to be industry and all that it means.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 147.704,
    "end": 159.503,
    "text": "So if you go to the symposium short link right now, you can register as a participant and also presenter registration will be open through the end of October.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 160.057,
    "end": 169.772,
    "text": " And we're looking for any sponsoring organizations who would like to have that visibility and make that contribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 169.792,
    "end": 170.072,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 172.596,
    "end": 172.877,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 174.039,
    "end": 175.18,
    "text": "Research fellows programs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 175.721,
    "end": 180.208,
    "text": "So research fellows are affiliated colleagues at the Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 180.442,
    "end": 183.986,
    "text": " We now have six research fellows, J.F.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 184.006,
    "end": 202.467,
    "text": "Cloutier, Anna Pereira, John Boyk, David Blumen, Robert Warden, and over the last few months, we have accepted a new research fellow, a colleague of multiple projects here at the Institute, Shahi Rahman.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 202.582,
    "end": 206.626,
    "text": " whose project is the myth of objectivity hypothesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 206.887,
    "end": 215.216,
    "text": "And there's a page in the documentation about Shaggy's work and link to his paper and previous live stream at the Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 216.377,
    "end": 222.003,
    "text": "And we are currently in the midst of another round of reviews for research fellows.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 223.164,
    "end": 230.192,
    "text": "So check out their work, check out the program and let us know if you have any questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 231.151,
    "end": 240.672,
    "text": " And we welcome future applications for research fellows, which will be reviewed on a rolling basis in the coming quarters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 243.503,
    "end": 245.125,
    "text": " All right, onto partnerships.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 245.325,
    "end": 259.504,
    "text": "These are structured relationships between the Institute and other organizations who are looking to have that kind of a container slash vehicle for their learning, upskilling, contributing, however they want to help.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 260.506,
    "end": 271.3,
    "text": "And some board of director colleagues have been working on this program and taking a lot of learnings over the last year and a half or so that we've been operating it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 271.432,
    "end": 275.125,
    "text": " and we'll be updating and releasing more information on that soon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 275.788,
    "end": 279.18,
    "text": "We just wanted to here acknowledge our current",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 279.481,
    "end": 295.5,
    "text": " partners who are all in different ways involved and will be helping out with the symposium, organizing sessions, First Principles First, Newman Games and Lazy Dynamics, and one other soon to be announced partner organization as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 296.061,
    "end": 303.97,
    "text": "So if you would like to be an advocate at your own organization or you have any other feedback on the way that this kind of program",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 303.95,
    "end": 311.724,
    "text": " can lead to synergistic and sustainable development in our ecosystem, absolutely go for it and let us know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 314.008,
    "end": 314.269,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 315.952,
    "end": 324.286,
    "text": "In the third quarter, we continue to have excellent input and participation from our very broad scientific advisory board.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 324.868,
    "end": 327.392,
    "text": "So these are informal guidance",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 328.553,
    "end": 340.185,
    "text": " participants and one of the highlights of this last quarter was the previous cycle of reviews of research fellows and the ongoing reviews.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 340.625,
    "end": 353.818,
    "text": "It really demonstrated an excellent level of expertise and care by many of the individuals here and starts to help reduce our uncertainty and walk towards",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 353.798,
    "end": 373.495,
    "text": " a model that's like a iterated or improved articulation of how we almost thought it could be when we set out to be the institute in 2022 where the board of directors provide formal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 373.475,
    "end": 390.572,
    "text": " guidance and strategy the scientific advisory board plays the role of expert and input and then we the officers are just boring behind the scenes administrators",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 390.552,
    "end": 398.16,
    "text": " who help coordinate all that and are like the editor for the reviewer type role that the SAB members can play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 398.861,
    "end": 407.891,
    "text": "So at this time, we will be sharing more information about next year's SAB in the coming weeks and months through the newsletter and everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 408.332,
    "end": 413.838,
    "text": "But right now, you could go to the SAB short link.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 413.858,
    "end": 419.344,
    "text": "You could explore any of the cool projects and contributions that these individuals are making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 419.729,
    "end": 437.293,
    "text": " And if you are interested or if you have a recommendation in somebody who you think could be good for that type of a scientific education, research, nonprofit area contributor, then the SAB is a great place to get involved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 439.396,
    "end": 440.858,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 440.878,
    "end": 448.048,
    "text": "To our formal roles on the left side are Alexandra and I as officers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 448.366,
    "end": 458.336,
    "text": " And on the right side, we wanted to acknowledge the board of directors, John Klippinger, Blue Knight, Alex Vyotkin, Daniel Friedman, Mike Smith, and Vladimir Baulin.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 459.117,
    "end": 466.905,
    "text": "We had a very good BOD meeting several weeks ago, and there's a few good threads cooking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 467.566,
    "end": 475.234,
    "text": "So it's been really awesome to see, again, all those developments on the formal, the informal, the research, all these different things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 476.395,
    "end": 506.2,
    "text": " and we will share more in the coming weeks but you can always email blanket and see what's up and then just lastly in this section the institute is a 501c3 tax exempt non-profit you can always go to the donate short link or get in contact if you have any other way that you'd like to support us with your attention and care and contribution is priceless as well so keep that in mind and now on to the projects",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 507.935,
    "end": 513.143,
    "text": " Okay, starting with some of the education-oriented projects that are happening at the Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 514.445,
    "end": 525.741,
    "text": "We slowly iterate and maintain the ontology, audiovisual production, textbook group, and journal projects, so reviewing a few of those and a few of the other projects that are happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 527.358,
    "end": 531.442,
    "text": " All right, first we have the AI Capabilities and Alignment Project.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 531.763,
    "end": 533.725,
    "text": "This is AICACP.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 534.686,
    "end": 554.327,
    "text": "And from the previous round table, you may remember that through the Survival and Flourishing Fund, this team with Adam Saffron, Amelia Thomley, Michael Garfield, Victoria Clamage, Tyler Mongan, Zan Huang, Hatim El-Jazuli, Amelia Thomley, Nick Hay, and myself,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 554.915,
    "end": 565.465,
    "text": " That project was funded for $270,000 and they reported, our team has been meeting weekly to make progress towards multiple goals for AICACP.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 566.238,
    "end": 585.448,
    "text": " We are currently finalizing the first special issue related to our project focused on world modeling, planning the second world modeling special issue, planning a special issue focused on agency, developing a podcast involving authors of the paper that are included in the special issues, organizing the first of multiple workshops focused on AI capabilities and later alignment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 586.109,
    "end": 589.815,
    "text": "We have a webpage here that further describes our project.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 590.572,
    "end": 595.867,
    "text": " and are currently working on developing a standalone website, which we hope to develop and launch in the next few weeks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 596.228,
    "end": 597.17,
    "text": "And the short link is there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 599.036,
    "end": 600.219,
    "text": "Great work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 600.239,
    "end": 600.44,
    "text": "Fun.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 602.485,
    "end": 602.746,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 603.729,
    "end": 605.273,
    "text": "In the textbook group,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 606.586,
    "end": 615.399,
    "text": " We, as we have been doing since around May of 2022, have been reading through the 2022 textbook in groups.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 616.38,
    "end": 621.228,
    "text": "And over the last couple of weeks, we have been closing out this current interval of activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 621.849,
    "end": 624.853,
    "text": "Cohort eight is finishing the second half of the textbook.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 625.414,
    "end": 629.38,
    "text": "Cohort nine has been working through the first half of the textbook.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 630.642,
    "end": 636.39,
    "text": "We would like to acknowledge Andrew Pashea for his excellent and dedicated facilitation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 636.59,
    "end": 650.345,
    "text": " And as we look to the future of textbook groups and the educational opportunities in the ecosystem, we point to the expected release date of Sanjeev Namjoshi's book in March, 2026.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 651.546,
    "end": 660.376,
    "text": "That book is going to be called Fundamentals of Active Inference Principles, Algorithms and Applications of the Free Energy Principle for Engineers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 661.217,
    "end": 664.42,
    "text": "Never really looked at it this way, but it's funny that it's the principles",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 665.21,
    "end": 666.702,
    "text": " of the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 667.912,
    "end": 668.436,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 669.074,
    "end": 677.361,
    "text": " And we did the sort of alpha slash beta working through this book with Sanjeev and group at the Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 678.122,
    "end": 690.193,
    "text": "And we expect to have a textbook group ready to roll out as soon as that PDF hits your inbox or physical paper hits the mailbox, whichever's first.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 690.493,
    "end": 699.081,
    "text": "So we may still have this 2022 book around, and it's definitely a core artifact in our literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 699.061,
    "end": 724.748,
    "text": " in our corpus but as we start to look to the end of 2025 and what's on the radar for 2026 we are quite excited for this comprehensive textbook to be coming out and we'll be doing a lot around making this accessible and applicable and there's code associated with this book sanjeev's a great researcher and developer so very exciting for textbooks in general",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 725.2,
    "end": 732.108,
    "text": " I'll just add that as an active member of the Cohort 9 textbook group, it's just a lot of fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 732.428,
    "end": 740.757,
    "text": "And it's really never too late to join a textbook group and learn more and just see it from another person's perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 741.418,
    "end": 748.626,
    "text": "And yeah, join the coming cohorts and see what you might find out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 749.517,
    "end": 752.02,
    "text": " That helps me see the cover as like a Ferris wheel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 752.581,
    "end": 756.686,
    "text": "It's just, it's always going around, people popping in, popping off.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 757.827,
    "end": 759.85,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 759.87,
    "end": 769.922,
    "text": "The theoretical neurobiology group, which is Carl Friston's research open discussion group, has been continuing to meet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 769.987,
    "end": 796.568,
    "text": " and the tnb short link has all the information that you'd like about how do you participate in these live historical proceedings and where you can look at the videos that are uploaded for most of the presentations as well so if you want to see what's happening week by week in a different format and a different curation than the institute live streams",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 796.666,
    "end": 809.62,
    "text": " And if you'd like to engage in a very small group, special setting with Carl Fristen and other researchers, then we cannot recommend highly enough that you participate in the TNB.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 809.94,
    "end": 811.502,
    "text": "It's really awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 811.522,
    "end": 815.346,
    "text": "And they are out there one to two times per week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 815.366,
    "end": 821.172,
    "text": "So there will be a few more meetings in this year, and then I'm sure things will continue next year.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 823.254,
    "end": 826.217,
    "text": "All right, in audio visual production,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 827.463,
    "end": 832.389,
    "text": " We have had a somewhat quiet, calm, chill quarter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 833.07,
    "end": 835.633,
    "text": "There were nine streams in the last quarter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 836.674,
    "end": 844.644,
    "text": "At the video short link, you can find all the 600 plus streams overall, but let's see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 845.025,
    "end": 857.2,
    "text": "We had mainly guest streams this past quarter, guest streams related to the inner screen, quantum active inference and consciousness, energy-based transformers,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 857.821,
    "end": 860.204,
    "text": " Compute crisis and physics-based ASICs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 861.286,
    "end": 863.068,
    "text": "That was an interesting kind of pairing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 863.409,
    "end": 865.371,
    "text": "Both of them were very energy-based modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 866.533,
    "end": 869.077,
    "text": "Then active inference and artificial spin ice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 869.377,
    "end": 870.779,
    "text": "That was sort of metamaterials.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 872.081,
    "end": 876.066,
    "text": "Co-creative learning via metropolis hasting between humans and AI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 877.128,
    "end": 881.454,
    "text": "Co-creation and a third way that's neither supervised nor unsupervised learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 882.876,
    "end": 884.638,
    "text": "Thermal macroeconomics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 885.175,
    "end": 888.741,
    "text": " temporal cognition and conscious active inference too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 889.623,
    "end": 894.732,
    "text": "And then I did a stream on the start repo called start slash here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 895.614,
    "end": 901.665,
    "text": "And that was about using generative AI for customized active inference curriculum and a variety of other things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 902.827,
    "end": 906.373,
    "text": "So it was a fun quarter in production.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 906.995,
    "end": 931.735,
    "text": " And there is a clear checklist and a way, if you want to contribute in front or behind the microphone, to making available and accessible high-quality videos, audios, podcasts, all kinds of things, English language, other language, formats we've done, formats we haven't done, guests we've had, guests we haven't had.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 931.775,
    "end": 933.137,
    "text": "There's...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 933.117,
    "end": 935.22,
    "text": " More to do than not here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 935.42,
    "end": 947.718,
    "text": "So whether you are already working in audiovisual production as a hobbyist or professional, or if you kind of want to explore those skills, this is an awesome way to build your open source portfolio, make a huge permanent difference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 950.322,
    "end": 954.327,
    "text": "Okay, going into the research space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 956.33,
    "end": 959.074,
    "text": "In the RxInfer project,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 959.307,
    "end": 961.896,
    "text": " We have continued to have weekly meetings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 962.036,
    "end": 972.051,
    "text": "These have been facilitated by Fraser Patterson, a PhD student who's working on RxInfer and other things in his dissertation research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 972.554,
    "end": 978.5,
    "text": " We have continued the weekly meetings, which are sort of this open space to check in on how has the package been developing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 978.68,
    "end": 982.284,
    "text": "What experiments and examples have people been working on?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 983.085,
    "end": 993.435,
    "text": "Personally, I've been working on a fork of the Rx infer examples repo, keeping it close and trying to make some of the examples more modular.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 994.076,
    "end": 999.321,
    "text": "So on the right top side here is a mountain car example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1000.043,
    "end": 1004.692,
    "text": " And on the bottom is a streaming data, kind of like a live streaming situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1005.293,
    "end": 1012.746,
    "text": "So if you're curious about RxInfer or just applied active inference, this is a great place to check out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1013.628,
    "end": 1020.06,
    "text": "And there will be sessions related to RxInfer as well as other application frameworks at the symposium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1023.286,
    "end": 1023.486,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1026.554,
    "end": 1029.818,
    "text": " Going into the ecosystem projects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1030.178,
    "end": 1038.008,
    "text": "So these are projects that are out in the periphery or even closer up against to the Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1038.188,
    "end": 1052.865,
    "text": "People doing their own thing, learning and applying Active Inference in their own way, on their own timeline, and filling out the measure form at that measure short link when they have a piece of information that they want to share publicly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1053.284,
    "end": 1056.645,
    "text": " that we can put into these quarterly round tables and into the newsletter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1057.249,
    "end": 1058.215,
    "text": "So pretty much",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1058.853,
    "end": 1071.712,
    "text": " when we're curating that monthly newsletter, or when we're curating the materials for this quarterly round table, we submit our own internal measurements, what we're doing in all these different projects that we want to share.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1072.433,
    "end": 1079.463,
    "text": "And then we look to the submissions of this form that other people put in, and then we go from there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1079.483,
    "end": 1087.375,
    "text": "So again, if you see something cool, if you see a bird, if you made a bird, if you did whatever,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1087.945,
    "end": 1094.002,
    "text": " put it in here and if it's relevant and reasonable, we would love to share that work out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1094.805,
    "end": 1101.263,
    "text": "So okay, let us review some of these projects and their updates over the last quarter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1102.829,
    "end": 1120.745,
    "text": " Avel reports, significant effort was invested in the ACT-INF for archaeology paper as part of the Xscape project, applying the framework that they developed in a 2024 paper by Genin, Carlut, and Duborg.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1122.287,
    "end": 1131.655,
    "text": "Power, ritual, and identity, a cognitive study of conversion to the unification church, to the study of material culture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1131.635,
    "end": 1135.64,
    "text": " And also they're providing mentorship and support for a Ph.D.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1135.68,
    "end": 1138.684,
    "text": "application of a fellow community member.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1139.945,
    "end": 1140.186,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1140.786,
    "end": 1154.103,
    "text": "And I would just add this is kind of like a classic SAB scientific advisory board participation, like advancing one's own research, helping out in a professional way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1154.243,
    "end": 1155.324,
    "text": "So thanks, Abel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1156.125,
    "end": 1158.288,
    "text": "And, you know, all these projects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1159.77,
    "end": 1159.87,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1161.25,
    "end": 1172.05,
    "text": " Jesse Gardner and Vladimir Balan report, we published a perspective preprint together, evaluating directions and advances regarding the prospects of AI with regard to agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1172.891,
    "end": 1181.908,
    "text": "The papers on archive and the title is, is the agent paradigm a limiting framework for next generation intelligence systems?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1186.141,
    "end": 1188.584,
    "text": " Okay, then J.F.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1188.644,
    "end": 1200.019,
    "text": "Cloutier from the Symbolic Cognitive Robotics Project reports, I am making constant progress designing and coding a single agent distributed robotic cognitive architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1200.8,
    "end": 1208.57,
    "text": "The static sensor and effector cognition actors, the priory bottom layer of a society mind, are now coded and tested.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1209.351,
    "end": 1211.794,
    "text": "Work has begun coding the dynamic cognition",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1211.96,
    "end": 1240.465,
    "text": " actors all other abstraction layers i have updated detailed accounts of belief acquisition and policy construction and execution by cognition actors all updates are on the github and the hashtag simcog robotics discord channel thank you to research fellow jf it's it's a very fun format to see these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1242.014,
    "end": 1248.103,
    "text": " concepts woven through the GitHub, through the Discord discussion, people popping in, asking questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1248.203,
    "end": 1249.105,
    "text": "It's really fun.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1249.125,
    "end": 1251.929,
    "text": "It's a great project, and it's really getting there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1254.052,
    "end": 1265.329,
    "text": "From the project Active Inference for Built Environments and Cooperative Systems Project, Yvonne Matelken reports, the white paper has been released on GitHub.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1266.851,
    "end": 1270.857,
    "text": "The first three blog posts as part of the research have been published on Substack.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1271.765,
    "end": 1291.14,
    "text": " are on the first phase of the research which is a problematization okay thank you yvonne um and here we have an update from interns harshil shah and satyaki mitra um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1292.757,
    "end": 1319.575,
    "text": " very fun uh drone related work we developed a hierarchical active inference model for autonomous drone navigation based on affordance theory the architecture uses an action policy filtering mechanism based on a latent suitability state the system was applied to waypoint based navigation and is now transitioning to real hardware with lidar and depth camera",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1319.555,
    "end": 1327.302,
    "text": " Preliminary tests in May showed positive results and we plan for more extensive testing with the finalized model and hardware integration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1328.183,
    "end": 1335.589,
    "text": "Complete hierarchical active inference implementation with affordance-based action filtering involves JuliaRxInfer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1336.81,
    "end": 1347.84,
    "text": "Complete implementation in Microsoft AirSim and positive preliminary tests and significant progress towards more extensive testing in AirSim and hardware.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1349.508,
    "end": 1353.953,
    "text": " Significant progress in transition to real quadcopter hardware.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1354.693,
    "end": 1360.259,
    "text": "And excitingly, poster presentation accepted for IY 2025.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1361.46,
    "end": 1362.081,
    "text": "Quite an update.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1362.842,
    "end": 1363.142,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1363.282,
    "end": 1376.916,
    "text": "And we'll just use that to highlight that in just about two, three weeks in Montreal, Canada, will be the sixth International Workshop on Active Inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1378.617,
    "end": 1407.595,
    "text": " not involved in the organizing there but just wanted to shout that out and many uh of our colleagues will be joining there so enjoy everybody who who goes there hope that there's a lot to learn and to do and looking forward to some after action there and the last of these project measurements researchers ryan buchanan and kyle flynn reported",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1407.963,
    "end": 1429.988,
    "text": " provided publication for a theory half a decade in the making made progress on ontological questions and published an interdisciplinary artifact multi-modality and its relation to construct object theory okay so now we are completed with the project level measurements um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1431.824,
    "end": 1437.197,
    "text": " If you are watching live, write some comments or questions in the live chat and we'll read them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1437.357,
    "end": 1448.905,
    "text": "Otherwise, we'll just have kind of two, three slides just talking a little bit about what could be and a few ways that we're thinking about all that is happening",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1449.121,
    "end": 1462.296,
    "text": " Just trying to expose a little bit of it and use that as our sense making and our communication out to you all at this time for your updating and engagement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1462.316,
    "end": 1464.178,
    "text": "So what do you see on this slide?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1465.019,
    "end": 1472.428,
    "text": "Well, this is our classic ant foraging metaphor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1473.809,
    "end": 1493.258,
    "text": " We're forging through space and time and acknowledging what we've seen and found and what we're looking for and blazing a trail for anyone else to join us and co-create the pheromone trail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1494.72,
    "end": 1501.15,
    "text": "And speculative directions is always what we're sort of cooking in the background.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1501.13,
    "end": 1521.872,
    "text": " we're looking for exciting opportunities and keeping an open mind and open contact for people to suggest, propose funding or projects and other co-creative opportunities for the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1522.696,
    "end": 1546.898,
    "text": " yes and the equation 2.6 expected free energy epistemic and pragmatic value this is really the question for you what what are you reducing uncertainty about what are your known unknowns what and how are you open to the unknown unknown what's useful for you what aligns with your utility or preferences",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1547.131,
    "end": 1553.228,
    "text": " And you could be reducing uncertainty to achieve pragmatic ends, you could prefer to learn.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1554.211,
    "end": 1557.36,
    "text": "So all these different combinations and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1557.931,
    "end": 1566.728,
    "text": " Hopefully we are there to support that and help the ecosystem flourish so that you can find what's epistemic and pragmatic for you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1566.788,
    "end": 1577.409,
    "text": "We get to see and engage a lot of windows into the range of people who are out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1577.91,
    "end": 1579.112,
    "text": "Some very",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1580.493,
    "end": 1606.095,
    "text": " quiet and in the background some very loud in discord or through other channels and some in academia and research institutions others that are not so many different life stages and locations so we try to keep it really broad at the top level and also want to have those capacities to to zoom in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1606.7,
    "end": 1612.387,
    "text": " Okay, and then here's one kind of cooking-related slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1613.408,
    "end": 1627.746,
    "text": "So, chapter six in the textbook, as those who have read will know, is a recipe for designing active inference models, and year after year, it dawns",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1628.266,
    "end": 1640.845,
    "text": " in the kitchen and in the classroom, how big the difference is between reading a recipe or writing one of your own and actually putting that cooked dish or menu on the table.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1641.686,
    "end": 1655.927,
    "text": "So as we're kind of hanging out and thinking about all this and what's the Institute's role, here's just a few of the threads that we follow is like, even if we have a recipe book or really the recipe for the recipe,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1656.835,
    "end": 1663.043,
    "text": " there is distance to travel that could be a implausible distance to travel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1663.523,
    "end": 1664.785,
    "text": "It could be right there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1665.045,
    "end": 1683.248,
    "text": "And we think that with tech and infrastructure development, we will facilitate these travels, but that doesn't get rid of the distance itself to travel from creating a recipe or getting one off the shelf, a open source or proprietary recipe,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1683.498,
    "end": 1704.156,
    "text": " to making that dish in your home kitchen or maybe you're doing recipe development or you're writing speculative culinary fiction you're writing recipes that aren't intended to be cooked or they're not able to be prepared by you at this time and there's all these different useful things that cooking can do as well",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1704.355,
    "end": 1710.443,
    "text": " So that helps us think like, okay, we are akin to a culinary training institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1711.144,
    "end": 1724.342,
    "text": "We are training and raising awareness around various epistemic and pragmatic delights, giving you a accessible, rigorous, applicable, honest, authentic understanding of what are those delights?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1725.563,
    "end": 1726.545,
    "text": "What do we like about them?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1727.766,
    "end": 1728.467,
    "text": "How are they made?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1728.968,
    "end": 1729.629,
    "text": "What's in them?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1729.909,
    "end": 1731.932,
    "text": "What's cool or different about them?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1732.267,
    "end": 1742.753,
    "text": " And the Institute then is this place for convening, for connecting, learning, advancing, and upskilling in this culinary culture of service.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1743.896,
    "end": 1749.33,
    "text": "So to serve Active Inference, it's a cookbook.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1749.648,
    "end": 1775.503,
    "text": " this brings together a sort of to serve active inference cookbook cookbook cookbook and also of course let them cook because you are the ones who will be cooking we also cook we want to help all be fed and cook and if you want to do dishes that's great too and act in first serve that could be insert your own",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1775.737,
    "end": 1801.44,
    "text": " what is the point of all of this learning how to cook and for what so that you can serve what that's what it's about for you and if that journey leads you to be a board of directors member or some other contributor at the institute fantastic if it's just a glancing interaction that helps you do your thing whatever that is also fantastic that's what we're here for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1802.062,
    "end": 1805.896,
    "text": " Then there's serving our professional community and our niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1806.779,
    "end": 1808.967,
    "text": "So these are the epistemic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1809.52,
    "end": 1838.329,
    "text": " paths and garden beds that are upstream of making that high reliability or that critical infrastructure or that educational material for active inference, the upstream contributions that relate to attention and resourcing, to stepping in, to volunteering for peer review, to mentoring a student or somebody entering, saying yes, saying no, knowing where you want to and how you want to say yes and no.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1838.714,
    "end": 1854.495,
    "text": " to reaching out to people and connecting and having there be a dense fabric and richness to our actual community of colleagues and peers, to review others' work,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1855.083,
    "end": 1869.743,
    "text": " Some people produce a lot, some people read a lot, and it's not that every single comment needs to get thrown into the same potluck, but it's awesome when people feel like their work is being seen, being recognized and acknowledged, even with an emoji.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1871.365,
    "end": 1876.112,
    "text": "And holding all that in this spirit of professionalism and respect,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1876.244,
    "end": 1895.248,
    "text": " so that we can have these different dialogues, these different multimedia, transmedia interactions, and be reviewing what we have done, what others have done, curating and gardening the past and making the present something that moves into the future in a healthy way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1895.929,
    "end": 1905.441,
    "text": "And then in the sort of most technical sense of serving API requests, for those who really want to see it get down to brass tacks,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1905.421,
    "end": 1931.749,
    "text": " and what does it mean to apply active inference at some point there's going to be something that serves up some service to your um recipients so that's just one fun way that that we try to think about what we do as sort of like restaurant",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1934.412,
    "end": 1963.305,
    "text": " administrator hosts also sometimes the prep chef and all of that but all these different roles are it's just one metaphorical frame to transpose what we really do into it's a fun one though so um we will dwell on this last slide for just a few minutes in case anyone else has any live chats i'll read these and then we'll read the um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1963.69,
    "end": 1970.239,
    "text": " live chats that we have, then we'll see if there's any other comments or any other reflections to make, and that will be it for today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1970.84,
    "end": 1991.487,
    "text": "Okay, so this slide has been copied over possibly even since the very first pre-Active Inference Lab livestream, the team comm streams back in 2020, and they are, what might a good understanding enable?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1991.602,
    "end": 1993.445,
    "text": " What are the unique predictions and implications?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1994.306,
    "end": 1997.11,
    "text": "What are the next steps for free energy principle and active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1997.37,
    "end": 1998.712,
    "text": "What are the preferences of this work?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2000.054,
    "end": 2001.276,
    "text": "What are you still curious about?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2002.398,
    "end": 2002.658,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2004.641,
    "end": 2008.887,
    "text": "I'll read some of the live chats, then add anything you want, and then we'll see if there's anything else to add.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2009.548,
    "end": 2009.829,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2010.71,
    "end": 2012.833,
    "text": "Love Evolve says, Hey,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2014.67,
    "end": 2020.018,
    "text": " Yin Yang Symbol, Spiral, Chili Pep, Sun, Shooting Star, Tastemasters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2020.679,
    "end": 2021.139,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2021.98,
    "end": 2023.763,
    "text": "To Love Evolve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2023.783,
    "end": 2027.168,
    "text": "Morgan wrote, really appreciate the quarterly updates as well as the newsletter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2027.829,
    "end": 2028.289,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2028.39,
    "end": 2031.634,
    "text": "It's definitely appreciated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2031.674,
    "end": 2034.518,
    "text": "It's a great learning experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2036.041,
    "end": 2041.268,
    "text": "It gives a rhythmic seasonality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2041.501,
    "end": 2050.072,
    "text": " There's months and there's quarters where more and less and different happen, but we have done this every month and we've done it every quarter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2051.053,
    "end": 2064.69,
    "text": "So we always get something together and, um, it, this quarter had a very comical and, uh, frantic, but, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2065.801,
    "end": 2079.855,
    "text": " enjoyable feel of us in our in our PhD days, preparing for a qualifying exam in the in the hours in the minutes before the committee presentation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2080.636,
    "end": 2091.707,
    "text": "Except, of course, presenting permanently, publicly, in this fashion, but nonetheless, very fun and reminiscent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2093.56,
    "end": 2103.992,
    "text": " I'll flip briefly for our vision model colleagues through all the slides from the beginning, and then we'll look if there's any comments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2138.954,
    "end": 2142.018,
    "text": " So if you're here, you're in it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2142.879,
    "end": 2144.822,
    "text": "If you heard this, you know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2144.862,
    "end": 2147.525,
    "text": "You can send in a measurement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2148.066,
    "end": 2151.871,
    "text": "If you want something shared publicly, you can send an email to Blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2152.331,
    "end": 2160.602,
    "text": "If you want to just enter into a communication, you can engage with any of the people or projects listed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2160.662,
    "end": 2166.97,
    "text": "You can search them independently or you can follow the trails from the links and documentation we have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2167.743,
    "end": 2173.749,
    "text": " You can step in, you can step out, you can do your own thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2174.65,
    "end": 2179.195,
    "text": "You can learn and apply and weave and zigzag within all of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2180.176,
    "end": 2192.088,
    "text": "You can stay updated and bring in your own ways of working and thinking about the situations that you find yourself in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2192.889,
    "end": 2196.653,
    "text": "So Sasha, any last comments and then I'll read the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2197.274,
    "end": 2206.168,
    "text": " Um, well, to echo the earlier analogy, it is like preparing a committee meeting update.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2208.712,
    "end": 2210.595,
    "text": "So it's fun, fun to do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2211.556,
    "end": 2220.35,
    "text": "But it's more important than that, because we're curating and presenting and combining everyone else's work at the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2220.51,
    "end": 2223.214,
    "text": "And so it's an honor and a privilege",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2223.194,
    "end": 2234.368,
    "text": " just share all the work that people are doing and can't wait to do it again next quarter frantically as ever",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2235.057,
    "end": 2244.648,
    "text": " Okay, I'll read some of the comments in the chat and we'll just see if there's any fun topics that come up from there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2244.748,
    "end": 2254.72,
    "text": "All right, Jim Freda wrote, I'm always surprised not to see the application of active inference to the big problems of life like mismatch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2254.98,
    "end": 2256.662,
    "text": "And then I asked, what do you mean mismatch?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2257.283,
    "end": 2261.368,
    "text": "And Jim wrote, evolutionary mismatch, environmental mismatch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2263.306,
    "end": 2291.254,
    "text": " know if you expect it to be there put it out there definitely mismatch in terms of prediction error or discrepancy or fitness is a major topic not always discussed in terms of mismatch but often in terms of surprise predictive error error signal um fitness so maybe you can add any other comments you have but but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2292.449,
    "end": 2298.058,
    "text": " If you feel like it's a syntactic or a semantic opening, amazing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2298.559,
    "end": 2303.668,
    "text": "Write that paper, put in the measurement, and we will be right here in just a few months sharing that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2305.25,
    "end": 2307.554,
    "text": "Michael Lennon wrote, beautiful work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2307.634,
    "end": 2309.598,
    "text": "Your stigmatic example sparks action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2309.658,
    "end": 2311.561,
    "text": "Thank you for holding up light for others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2312.162,
    "end": 2312.583,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2312.603,
    "end": 2317.09,
    "text": "I raise a mason jar of dilute coffee to you, Michael.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2319.297,
    "end": 2320.719,
    "text": " Jim laughs will do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2320.899,
    "end": 2321.66,
    "text": "Okay, great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2321.781,
    "end": 2322.001,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2322.281,
    "end": 2325.566,
    "text": "Well, we'll just wait a few more seconds if anyone else has a comment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2325.646,
    "end": 2332.716,
    "text": "But um, yeah, we're three quarters through the year.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2333.577,
    "end": 2334.559,
    "text": "It's going fast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2336.201,
    "end": 2341.288,
    "text": "Let's look at the symposium website just to show its current state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2348.609,
    "end": 2350.171,
    "text": " I'm going to fix the cropping.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2358.062,
    "end": 2361.046,
    "text": "Okay, so if you go to the symposium short link, it'll look like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2362.528,
    "end": 2365.032,
    "text": "Here's the link to register for the symposium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2366.494,
    "end": 2369.178,
    "text": "And here's the program.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2370.62,
    "end": 2374.465,
    "text": "So the registration link right there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2376.368,
    "end": 2380.475,
    "text": " That'll take you to a Coda form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2382.198,
    "end": 2386.705,
    "text": "If you select no, you don't want it shared publicly, then we're not going to share it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2386.725,
    "end": 2395.239,
    "text": "If you do want to share it publicly, we will include it in a open source GitHub repo slash symposium that we started last year.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2395.259,
    "end": 2403.152,
    "text": "So it will develop like a personalized curriculum for you and maybe make some connections, maybe form some research teams and also just help",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2404.246,
    "end": 2406.79,
    "text": " connect you with others who might be curious about your background.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2406.83,
    "end": 2407.992,
    "text": "It asks fun questions here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2410.556,
    "end": 2422.954,
    "text": "These are things that we seek to know, whether you want to share it publicly or not, but these are fun things to reduce your own uncertainty about and to see what other people wrote.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2423.495,
    "end": 2430.085,
    "text": "The responses that people put in these fields are incredible and it's a whole symposium",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2430.352,
    "end": 2444.788,
    "text": " Even without the Fristen keynote and 20 presentations and trainings, just reading what people write to this following set of questions that I'll read is its own education.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2445.049,
    "end": 2449.934,
    "text": "So the questions are, what would help you learn and apply active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2449.954,
    "end": 2452.417,
    "text": "For example, a resource tool or community development.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2453.238,
    "end": 2455.34,
    "text": "What would be useful for you in the symposium?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2455.621,
    "end": 2456.882,
    "text": "Pragmatic value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2457.149,
    "end": 2460.473,
    "text": " What would be interesting or informative for you to learn from the symposium?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2460.873,
    "end": 2461.614,
    "text": "Epistemic value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2462.575,
    "end": 2464.578,
    "text": "What is your background and prior works?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2464.858,
    "end": 2467.641,
    "text": "Feel free to provide as much information and links as you like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2468.462,
    "end": 2472.547,
    "text": "What are the biggest hurdles or challenges facing active inference research and application?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2473.188,
    "end": 2474.509,
    "text": "How did you hear about the symposium?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2475.551,
    "end": 2478.474,
    "text": "How could active inference applications make impact in 2026?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2479.475,
    "end": 2480.136,
    "text": "Think big.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2481.635,
    "end": 2483.457,
    "text": " How are you applying Active Inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2483.617,
    "end": 2484.838,
    "text": "What domain and stage?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2485.359,
    "end": 2486.901,
    "text": "Any other comments or questions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2488.522,
    "end": 2495.57,
    "text": "So if you want to be participating in this, the proceedings will all be available.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2496.891,
    "end": 2502.497,
    "text": "If you want to be part of the interactive sessions though, and there's a ton here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2502.757,
    "end": 2507.963,
    "text": "So that's the symposium, which hopefully between now and one month from now,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2508.365,
    "end": 2535.587,
    "text": " will also see a few new presenters submit um yeah i think we've said what we needed to say so thank you upcycle thank you for the gifts wrote i'm looking forward to this symposium thank you for your generosity upcycle",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2537.103,
    "end": 2537.865,
    "text": " It's been awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2538.628,
    "end": 2541.838,
    "text": "So, everybody, see you next time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2542.159,
    "end": 2544.687,
    "text": "See you in the inbox.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2544.707,
    "end": 2545.349,
    "text": "See you in the kitchen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2546.132,
    "end": 2546.493,
    "text": "See you later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2547.336,
    "end": 2547.737,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  }
]