[
  {
    "start": 33.015,
    "end": 34.096,
    "text": " Hello and welcome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 34.516,
    "end": 38.037,
    "text": "This is ActInf live stream number 50.2.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 38.798,
    "end": 44.1,
    "text": "It's November 3rd, 2022, and it's our third discussion on this paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 45.681,
    "end": 47.942,
    "text": "Welcome to the Active Inference Institute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 48.522,
    "end": 55.025,
    "text": "We're a participatory online institute that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 55.785,
    "end": 57.826,
    "text": "This is a recorded and archived live stream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 58.347,
    "end": 60.508,
    "text": "Please provide feedback so we can improve our work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 61.548,
    "end": 75.924,
    "text": " all backgrounds and perspectives are welcome and will follow video etiquette for live streams head over to active inference.org to find out more about participating in projects and learning groups",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 77.725,
    "end": 100.836,
    "text": " all right we are in live stream 50.2 in our third discussion on interoception as modeling allostasis as control and we had a dot zero background in context video and two weeks ago now we had a great number zero fifty point one discussion",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 101.756,
    "end": 115.343,
    "text": " So we're just going to have introductions of people who were here last week, and then Ian will share something for a few minutes, and then we'll be discussing whatever people want.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 115.423,
    "end": 124.888,
    "text": "So we can each just say hello and anything that we want to explore today or some reflection from the last two weeks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 125.629,
    "end": 126.689,
    "text": "So I'm Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 126.789,
    "end": 129.891,
    "text": "I'm a researcher in California, and I'll pass to Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 131.653,
    "end": 132.433,
    "text": " Thanks, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 132.453,
    "end": 134.274,
    "text": "I'm Dean here in Calgary in Canada.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 135.274,
    "end": 148.116,
    "text": "And not much to say other than I'm looking forward to getting past the content, which was the zero, the context, which was the one, and figuring out what we can conceptualize into in this too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 148.736,
    "end": 149.757,
    "text": "I'll pass it over to Jordan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 151.037,
    "end": 151.337,
    "text": "Sure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 151.397,
    "end": 152.297,
    "text": "So I'm Jordan.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 152.417,
    "end": 156.818,
    "text": "I'm a postdoc working with Lisa Feldman Barrett and Karen Quigley at Northeastern.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 157.817,
    "end": 163.16,
    "text": " And I think I said the last time that we've done this, this paper sort of emerged out of the energetics reading group that we've done.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 163.18,
    "end": 166.261,
    "text": "So I'm broadly interested in brain energy metabolism.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 166.281,
    "end": 176.886,
    "text": "I've been doing some other work on that and was not here last week in the week between these sessions, because I was at the international conference on brain energy metabolism, which was very fun.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 178.467,
    "end": 185.73,
    "text": "And yeah, I think I'm excited to get into the conceptual details of this paper here too, and interested in thinking about what a control theory model of a",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 186.812,
    "end": 188.593,
    "text": " of the brain and of the terraception looks like.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 192.416,
    "end": 193.857,
    "text": "Pass it over to Eli, maybe?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 193.877,
    "end": 196.639,
    "text": "Hi, I'm Eli.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 196.9,
    "end": 206.507,
    "text": "I'm the first author on the paper, grad student with Jan Willem van der Meent, who is sort of our undermentioned co-author, and with Lisa Felton Barrett and Taryn Quigley.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 207.728,
    "end": 215.914,
    "text": "I would say that I just got away from a conversation with Maxwell Ramstead, so I'm actually a bit excited about active inference as a",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 217.133,
    "end": 219.456,
    "text": " He really clarified for me what it is and what it means.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 222.701,
    "end": 226.285,
    "text": "Yeah, and I think I could pass to, is that all of us?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 226.946,
    "end": 227.147,
    "text": "Yep.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 227.828,
    "end": 229.149,
    "text": "Or Ian, do you still need to go?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 231.537,
    "end": 232.558,
    "text": " Hi, yes, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 233.719,
    "end": 236.282,
    "text": "So I'm Ian, I'm based in England, UK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 236.762,
    "end": 253.518,
    "text": "And so my background many years ago was in kind of undergraduate of biochemistry and then PhD in molecular biology applied to immunology and how white blood cells can determine between molecular signals of safety and threat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 254.739,
    "end": 256.821,
    "text": "I didn't stay very long with that, moved on to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 257.862,
    "end": 274.14,
    "text": " working on environmental management projects and um therapy so manual therapy health mentoring and related things and in that world um a common kind of um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 275.385,
    "end": 281.887,
    "text": " theme I noticed was paying attention to bodily signals and sensing and interpreting bodily signals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 282.428,
    "end": 296.713,
    "text": "But I didn't have a way to talk about that confidently that made sense with the versions of homeostasis and the autonomic nervous system that I was taught in the 90s.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 297.073,
    "end": 301.435,
    "text": "So when I, a few years ago, discovered there was a small group of researchers",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 302.435,
    "end": 315.126,
    "text": " Studying interoception, I got very excited very quickly and I've been involved recently in a little bit of research on interest training for improved interoceptive awareness with a university nearby here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 316.536,
    "end": 325.82,
    "text": " And when Daniel shared this paper and said it was going to be on the Active Insurance Institute, I got diddly excited and wasn't quite sure why that was.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 326.041,
    "end": 342.969,
    "text": "So I said, when I was trying to figure it out and watching 55.0, I asked if I could share a few pictures, which maybe I'll do now if I can share screen to... Oh, is that going to be possible?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 342.989,
    "end": 345.85,
    "text": "Sure, and I'll crop it so that it's the whole screen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 347.23,
    "end": 347.551,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 348.291,
    "end": 352.997,
    "text": "So I thought, why was I so excited to see this paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 353.217,
    "end": 364.971,
    "text": "I hope it might be able to help people in the therapeutic world, because I know that you've sort of talked about physiology meeting engineering, but then this is a slightly different, maybe a slightly different take.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 367.553,
    "end": 369.654,
    "text": " Go full screen or just give me one second.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 369.694,
    "end": 370.715,
    "text": "Oh, there we go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 370.955,
    "end": 372.215,
    "text": "Give me one second.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 373.596,
    "end": 374.296,
    "text": "Can you see that now?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 374.736,
    "end": 376.237,
    "text": "Yep, I'm just going to make it big.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 376.257,
    "end": 378.498,
    "text": "Just give me one second to get it finished.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 379.719,
    "end": 380.399,
    "text": "All right, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 381.371,
    "end": 395.839,
    "text": " So in the .Zero, I heard people talking about baked-in reflexes, and it made me think of these pictures which have been going around on the internet of why are cats scared of cucumbers?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 397.019,
    "end": 401.082,
    "text": "Is it because they're born to be scared of snakes?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 401.622,
    "end": 406.564,
    "text": "So some kind of genetic... Cucumbers look like snakes, so they go from feeding mode into...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 407.725,
    "end": 408.266,
    "text": " fear mode?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 409.007,
    "end": 417.696,
    "text": "Or is it that their cruel owners have just put something surprising behind them, so it's just stimulating a startle reflex?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 418.216,
    "end": 427.286,
    "text": "Either way, I don't know what the cat's interceptive experience is, but there certainly seems to be something that is automatic, is happening there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 428.146,
    "end": 442.992,
    "text": " So thinking about in the therapeutic world, what we're often trying to achieve is if a behaviour has become maladaptive and starts to feel like it's reflexive for a person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 443.252,
    "end": 450.476,
    "text": "So let's say a phobia against spiders or a phobia against public speaking or a phobia, you know, a fear of going into public...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 452.489,
    "end": 458.115,
    "text": " public spaces, then the person may feel like, I know I'm going to suffer in this situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 458.175,
    "end": 459.496,
    "text": "It's just a reflex reaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 460.597,
    "end": 472.128,
    "text": "But with interoceptive exposure therapy, what I find is interesting is that people are able to, in a safe space, able to say, okay, when this thing happens to me, I feel maybe",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 473.189,
    "end": 495.476,
    "text": " short of breath tightness in my chest so if we can recreate that sensation in a safe environment can gradually they learn to change whatever their predictions or their beliefs are about what that sensation means and it seems to work and you know one method of doing that for if breathing is an issue for people and that with anxiety is to recreate it by breathing through a straw",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 497.778,
    "end": 509.374,
    "text": " so the you know the the aim really is to turn something maladaptive into a more adaptive behavior or a vicious cycle into a virtuous circle so instead of triggering this kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 510.686,
    "end": 523.17,
    "text": " or a reaction which feels unpleasant and is involved, you know, reflexes or supposed reflexes are being triggered that are linked to shortness of breath or increased heart rate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 523.21,
    "end": 535.113,
    "text": "Instead, they can learn to create some changes in the body that might be associated with something more pleasurable, such as, you know, relaxing with family on a beach or some kind of pleasant situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 535.173,
    "end": 537.354,
    "text": "So different changes in their autonomic nervous system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 538.582,
    "end": 549.592,
    "text": " And in general, what we are sort of interested in doing is using interception as an access point to be able to untangle the story, the thoughts that people have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 550.552,
    "end": 556.377,
    "text": " from the situation they're in and the bodily sensations that they're sensing or that are arising.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 556.897,
    "end": 559.86,
    "text": "So, Dean, you mentioned about packing your parachute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 559.9,
    "end": 563.202,
    "text": "This was another kind of image that came to mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 563.863,
    "end": 579.655,
    "text": "Most babies are probably born with some kind of reaction that stops them throwing themselves out of high places, but it does seem to be possible to override any interoceptive fear and for some people even to enjoy throwing themselves off high places.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 580.616,
    "end": 603.719,
    "text": " um likewise we can learn you know we can learn to that situations such as maybe sitting in front of a laptop with an email box full of emails for some people can lead to an interoceptive sensation it's like a sinking feeling or a cramping or you know a heavy feeling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 604.62,
    "end": 613.044,
    "text": " So then they've learned, they weren't born with that, but they've learned to associate these situations with something really, you know, stressful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 616.626,
    "end": 624.33,
    "text": "This was from the paper, I think, Jordan or Eli, you referred to last year, sorry, last week, the dot one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 625.051,
    "end": 626.992,
    "text": "I haven't digested it fully, but it, you know, it's,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 628.149,
    "end": 636.998,
    "text": " really becomes apparent that the direction of these circles and the loops within loops are quite complex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 637.838,
    "end": 647.488,
    "text": "But I really liked the way that you described, these are my reflections now from where you ended in dot one, which was this idea of kind of cooperative control or optimal control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 650.505,
    "end": 661.467,
    "text": " And I was sort of taught about feedback loops as being like thermostats and maybe fat levels in a person's body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 662.93,
    "end": 666.653,
    "text": " being influenced just by the hormone leptin, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 667.293,
    "end": 675.839,
    "text": "But it seems that the set points in the settling ranges are much more mobile than once was thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 676.339,
    "end": 680.762,
    "text": "And we see that now with, you know, and involve a lot more crosstalk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 681.883,
    "end": 703.474,
    "text": " rather than just targeting something like leptin as the problem for the obesity crisis, then this is just a stat taken from UK government office, which created an obesity systems map that identified 108 interconnected variables that determine people's energy balance in relation to obesity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 703.594,
    "end": 707.116,
    "text": "And some of those things might include marketing and advertising, social pressures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 708.337,
    "end": 708.917,
    "text": "So how do we...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 711.238,
    "end": 715.681,
    "text": " bring all of those things in to these types of models that are being created.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 718.362,
    "end": 720.123,
    "text": "And then there's epigenetic factors as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 720.203,
    "end": 730.529,
    "text": "So, you know, people can inherit their exposome through epigenetic changes, and can that change their interceptive predictions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 732.371,
    "end": 735.773,
    "text": "And, you know, how I think about this from a kind of health mentoring or coaching,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 737.527,
    "end": 762.126,
    "text": " I'm not quite sure if I've wrapped my head around the concept of time averaging completely, but if someone comes to me and they say we're talking about their health and they want to be healthy enough in 20 years' time to be able to support their grandchildren and play with their grandchildren, then if that's a strong enough interceptive signal of pleasure into the future,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 762.987,
    "end": 785.567,
    "text": " know or strong enough desire can that override the short-term interceptive prediction of um bliss which is maybe achieved from some you know very predictably produced junk food that's been designed to create a prediction of you know an interceptive anticipatory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 786.708,
    "end": 806.445,
    "text": " um pleasurable sensation how do those over time how do those two different kind of competing desires work with each other is it a battle of will or what you know some of them seem really deeply reflex they both seem deeply reflexive but they are often at odds with each other um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 807.955,
    "end": 817.998,
    "text": " And again, with this kind of time averaging, I was thinking about in the allotment, this isn't from my allotment, but plants, when they're stressed, they bolt early and flower early.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 818.038,
    "end": 826.32,
    "text": "If they think their environment is dry or haven't got enough root nutrients or enough space for the roots, then they will flower early, go to seed early.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 826.58,
    "end": 829.461,
    "text": "So is that what...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 831.141,
    "end": 832.743,
    "text": " time averaging is related to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 833.783,
    "end": 845.533,
    "text": "And the other thought was about this idea of someone mentioned about exercise being good for you because it's a short term stressor and it helps your heartbeat slower over the long term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 845.894,
    "end": 846.754,
    "text": "I see lots of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 847.535,
    "end": 861.994,
    "text": " sort of people talking about hormesis in the health and fitness and hormetic stressors in the health and fitness kind of arena, but we don't seem to have a good model of it or a way of telling what the sweet spot is for a hormetic stressor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 864.858,
    "end": 871.262,
    "text": " Yes, and there's lots of, you know, people doing hormetic stresses at the moment, Wim Hof and hot and cold therapy and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 871.822,
    "end": 882.748,
    "text": "And the last thing, nearly done, the last thing that interested me after was this idea of ergodicity and the distinction you made in this paper between ergodic and non-ergodic, sort of ergodic systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 883.268,
    "end": 888.351,
    "text": "And I was at a park run last Saturday and talking to some of the people, my friends at the finish,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 890.072,
    "end": 898.498,
    "text": " about how difficult it is to, you know, you can feel like you're, interceptively feel like you're running really bad one day, but then your time is actually quicker than what you expect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 898.918,
    "end": 904.782,
    "text": "Another day you can be really up for it and excited and feel buzzing and you get to the finish line and realise you've gone slower.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 905.883,
    "end": 909.385,
    "text": "This picture is from someone who broke the world record.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 910.686,
    "end": 912.408,
    "text": " achieved a marathon in under two hours.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 913.108,
    "end": 921.877,
    "text": "And part of the tools in their toolbox was to have a laser to keep their speed constant throughout the marathon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 922.017,
    "end": 929.604,
    "text": "So, you know, the both at any point, either in one instance or throughout the whole marathon, they, their time was constant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 929.864,
    "end": 934.228,
    "text": "So I guess my question is, is technology, if we've, if we're trying to,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 935.109,
    "end": 943.079,
    "text": " design systems based on the idea of ergodicity, are we reverse engineering that into our lives maybe?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 945.221,
    "end": 953.051,
    "text": "And where would that lead if you've seen the film Don't Look Up and it's all about prediction and modelling?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 955.484,
    "end": 964.707,
    "text": " what will we be evolving into if we don't have, you know, the right systems that are truly matching biological, what's actually happening with our biology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 965.367,
    "end": 967.608,
    "text": "And yeah, that was, they're my reflections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 969.489,
    "end": 970.049,
    "text": "That's great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 973.03,
    "end": 973.63,
    "text": "Awesome, Ian.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 974.35,
    "end": 975.671,
    "text": "Thanks for bringing all of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 975.731,
    "end": 977.171,
    "text": "That's really insightful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 977.311,
    "end": 980.753,
    "text": "So I think we have more than enough to just begin.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 981.053,
    "end": 983.894,
    "text": "So let's just start with whoever wants to reflect, please.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 983.954,
    "end": 984.554,
    "text": "Jordan first.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 985.649,
    "end": 996.631,
    "text": " I mean, yeah, I guess I can, this will be going a little bit off of the paper here, but I think just what you were bringing up is interesting to some of the other work that I've been doing as well too.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 996.871,
    "end": 1004.012,
    "text": "And what we can think of, what we can think of sort of extending the systems that we're talking about in this paper outside of the body, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1004.172,
    "end": 1014.214,
    "text": "So some of what you were bringing up was you were talking about some of the sort of social feedback that you get for maintaining allostasis.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1015.825,
    "end": 1025.751,
    "text": " You were bringing up the example of email and the sort of interoceptive response that you can get from anticipating stress from email, from communication, these sorts of things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1026.471,
    "end": 1037.617,
    "text": "And you're talking about how external references, and you were giving the example of technology and a laser to keep pace on a marathon can help",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1039.943,
    "end": 1043.484,
    "text": " can basically act as an external, you can use external reference signals, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1043.524,
    "end": 1052.086,
    "text": "And I think one way to think about social influence or some of the social forces on interoceptive experience is also as like external reference signals, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1052.106,
    "end": 1053.706,
    "text": "Or at least as external factors.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1054.407,
    "end": 1065.869,
    "text": "And so the, I think one thing, so you could think about the example of the email that you were giving is, it's an interesting case, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1065.909,
    "end": 1067.23,
    "text": "Because you basically have,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1070.14,
    "end": 1090.056,
    "text": " in some ways you're kind of opening yourself up to this portal of potential interoceptive disruption that can arrive at any moment and that's not going to be, it's not gonna have some of the usual contingencies that would allow you to predict it like you would in other cases.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1090.076,
    "end": 1095.3,
    "text": "Like if you're going to a meeting, you're gonna go meet with your boss, it's at four o'clock",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1096.636,
    "end": 1112.363,
    "text": " You know that none of the sort of social signals from that that could potentially be something you have to react to, something that you have to adapt in an interoceptive state to, something that's going to cause you to have to lever or basically mobilize your body to respond to that situation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1113.123,
    "end": 1115.825,
    "text": "Those aren't going to happen until about four o'clock when you go to that meeting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1117.645,
    "end": 1119.026,
    "text": "If you're open to email,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1120.168,
    "end": 1128.392,
    "text": " You're basically going to be able to be prompted within any sort of work hour, so you need to be prepared for that potential mobilization at any point, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1129.372,
    "end": 1135.174,
    "text": "If your boss is really awful, then maybe you're going to get emails in the middle of the night.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1135.334,
    "end": 1142.918,
    "text": "And if that's the case, then you need to be prepared for some sort of allostatic mobilization at literally any point of the day.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1143.874,
    "end": 1154.879,
    "text": " which is going to bring with itself some sort of consequences of needing to have this system in a state of preparedness because disruptions could come at any point, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1155.699,
    "end": 1171.426,
    "text": "And so I think the, if one of the principles that's in Eli's paper here, right, is that we're defining putting together an allostatic response as being,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1173.783,
    "end": 1192.406,
    "text": " keeping variables at multiple levels of this control system in a state where they can be maximally responsive to the sorts of threats that could emerge, then that's gonna look very different if you're constantly in a state where you need to be prepared for a lot of different disruptions that could come in from social sources.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1193.288,
    "end": 1200.336,
    "text": " versus if you're in a state where you could rule some of those things out, you know it's the weekend, you know your boss or colleagues aren't going to call you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1200.356,
    "end": 1207.465,
    "text": "And so you can not have to have some of these variables in a state of preparedness to immediately react to those sorts of things, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1208.946,
    "end": 1211.127,
    "text": " But that's what that made me immediately think of.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1211.167,
    "end": 1221.332,
    "text": "And I think I could go on and on because I have some other work that's on sort of social allostasis or social influence and how we can impact people through that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1221.352,
    "end": 1228.975,
    "text": "But maybe I should pass over to Eli because I feel like I've set you up to think about how maybe this is relevant to what we're doing, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1229.015,
    "end": 1235.238,
    "text": "In terms of being prepared for an adaptive response and how different contexts can change that, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1235.258,
    "end": 1235.438,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1238.908,
    "end": 1239.308,
    "text": " Thank you.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1246.352,
    "end": 1248.032,
    "text": "Yep, Eli, want to go for it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1251.874,
    "end": 1252.895,
    "text": "I think you're muted, sorry.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1255.416,
    "end": 1259.378,
    "text": "I found really interesting the thing with the laser actually, and I'm sort of wondering,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1260.572,
    "end": 1264.594,
    "text": " how those metabolic trade-offs are taking place in the brain of a runner.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1264.655,
    "end": 1277.162,
    "text": "Because normally the evidence shows that people will adjust their gait or their running speed to sort of optimize their allostatic challenge and therefore their energy efficiency.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1279.063,
    "end": 1289.93,
    "text": "And here it looks as though the point of the laser is that you keep the actual speed constant, which means you're letting the level of allostatic challenge of the interoceptive sensations vary a lot.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1291.451,
    "end": 1297.475,
    "text": " or at least a lot more in order to keep the actual speed constant.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1297.535,
    "end": 1318.611,
    "text": "And I'm wondering how this can, like how this can happen in the brain, like that you construct this alternative sensory variable that you control instead of the interoceptive sensations and what sort of where, how motivation can be grounded in interoception",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1319.844,
    "end": 1323.226,
    "text": " to spend this extended time undergoing interoceptive challenge.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1328.088,
    "end": 1346.917,
    "text": "But could it also be too that you're, because part of this, right, is that we talk about, and this was Ian, you were talking a bit about with interoceptive feedback or the sorts of therapies that you can do with this, that we...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1348.194,
    "end": 1360.877,
    "text": " you can try to train people to have some more interoceptive awareness on the sensory end of it than they typically are, you know, to basically attune people to having some interoceptive awareness.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1360.917,
    "end": 1374.86,
    "text": "And then Eli, do you think with the laser, maybe are you giving people, you're basically, you're giving people something that might be a more high fidelity, like sensory signal, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1375.697,
    "end": 1388.949,
    "text": " Like if they're going to try to keep this laser at sort of center of eye fixation, they need to move at a certain speed and there's other variables that can follow from something that's more easily tracked in the external environment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1389.81,
    "end": 1397.517,
    "text": "Whereas it might be more difficult to keep tight, tight, like sensory control over some of the interoceptive signals.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1398.318,
    "end": 1401.381,
    "text": "You can structure that for people, so it's a little bit easier maybe.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1403.783,
    "end": 1429.07,
    "text": " But I mean, sorry, I was just thinking that the laser is teaching them to ignore their interoceptive signals, actually, to place more emphasis on a constant speed required to win than it is on, you know, oh, my legs are feeling a bit heavy or I'm feeling a bit dehydrated or, you know, I'm feeling a bit hot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1430.305,
    "end": 1434.607,
    "text": " So they're ignoring those and focusing more on the outside world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1439.528,
    "end": 1440.649,
    "text": "Can I just ask a question?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1440.669,
    "end": 1444.51,
    "text": "Because I know I always take it from the, I'm the real novice here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1444.53,
    "end": 1448.211,
    "text": "And I think sometimes that that can add something to this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1448.691,
    "end": 1453.733,
    "text": "What if the laser is as an offloading?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1455.334,
    "end": 1458.495,
    "text": "So the top down, bottom up, that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1459.209,
    "end": 1468.092,
    "text": " that back and forth that you guys with your paper really clearly said there's two directions here in this interoception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1468.833,
    "end": 1476.676,
    "text": "What if the offloading interrupts that back and forth?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1477.236,
    "end": 1482.138,
    "text": "And simply because you're offloading it now, you aren't creating that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1484.629,
    "end": 1486.331,
    "text": " It's not external.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1486.351,
    "end": 1494.041,
    "text": "It's added not even as a move to that center point on the sigmoid curve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1494.601,
    "end": 1497.485,
    "text": "It's simply acting as a proxy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1500.325,
    "end": 1507.629,
    "text": " And in approximating for you, that's taking less energy for yourself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1507.689,
    "end": 1514.732,
    "text": "Now, you can consume the calories in running, or you can consume the calories in trying to keep things within a range.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1515.592,
    "end": 1522.896,
    "text": "And if you're not burning up calories to try to keep things within a range, you can now apply those calories to the running.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1526.713,
    "end": 1530.838,
    "text": " If I could give a thought on just that, there's so much to add to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1531.338,
    "end": 1536.164,
    "text": "I'm thinking of where else are there lasers in tasks like running?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1537.466,
    "end": 1542.112,
    "text": "And it makes me think about the task as the offloading.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1543.649,
    "end": 1550.831,
    "text": " that principle of a small task expanding to the amount of time that you have, that's more in the cognitive domain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1550.871,
    "end": 1553.232,
    "text": "Like if you have five minutes to write the email, you have five minutes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1553.712,
    "end": 1555.073,
    "text": "If you have an hour, you have an hour.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1555.093,
    "end": 1565.016,
    "text": "And then similarly with moving a pile of dirt or doing some physical task, when the only thing that's being considered",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1565.996,
    "end": 1587.257,
    "text": " is the decision to do it somebody might surprise themselves with backpacking or undertaking allostatic challenge under the task structure of something that's external so like the laser it's already set versus uh without that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1588.82,
    "end": 1596.502,
    "text": " desire or capacity to undertake that allostatic challenge, it doesn't present itself as an affordance at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1599.382,
    "end": 1616.346,
    "text": "So there's just, and then also really interesting was the note about, Ian, you added about how some days you feel very good, but your speed or amount lifted might be lower and vice versa.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1617.944,
    "end": 1642.505,
    "text": " so in the models as presented does the entity have a true interoception so what is that difference with the experience and performance and valence of a given allostatic load",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1647.557,
    "end": 1670.934,
    "text": " Well, I'm not sure if I can answer that question, but I think that thinking about one thing that's going to happen if you're going to continue to run for a long time, right, is that there's going to be certain motor signals you're going to have to give, and there's going to be certain sensory feedbacks that are going to come from that, partly in interceptive information.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1671.735,
    "end": 1676.699,
    "text": "And the problem is that if you're wearing yourself out over the course of a marathon, those are going to be moving targets, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1677.588,
    "end": 1681.61,
    "text": " there's not going to be some consistent amount of force that you're going to need to apply.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1681.651,
    "end": 1687.494,
    "text": "And as your muscle weakens, as you're running for longer and longer, the amount of force is potentially going to have to change.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1687.554,
    "end": 1696.44,
    "text": "So it's going to become difficult to keep even a consistent speed, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1696.48,
    "end": 1701.903,
    "text": "You're going to have to actually vary the amount of force and the actual motor commands are going to have to be given.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1704.685,
    "end": 1705.805,
    "text": "And if you don't get...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1708.911,
    "end": 1721.117,
    "text": " If a lot of the feedback that you're getting from that isn't especially precise, right, because you're moving along the road, the environment's moving around you, it's difficult to get some consistent reference point for it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1721.157,
    "end": 1730.421,
    "text": "And so what the laser is doing, right, is it's basically giving you some sort of constant that you can...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1733.379,
    "end": 1742.221,
    "text": " that you can regulate in lieu of having to perform the calculations to regulate a lot of other stuff that's changing in your body over the entire period of it, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1742.961,
    "end": 1747.703,
    "text": "And I'm thinking about it in terms of you do a similar thing with like a metronome or something like that as well, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1747.723,
    "end": 1761.146,
    "text": "Where if you're trying to coordinate a lot of different people to perform musical notes in time, you'd want to have a conductor, you'd want to have... There's a real use in having external reference points for managing those things because...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1762.313,
    "end": 1772.023,
    "text": " literally everything in your body's changing as you're performing this stuff and commands need to be given to regulate in the face of all of that change.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1772.263,
    "end": 1774.065,
    "text": "Eli's pointing, so I think Eli's got a point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1775.563,
    "end": 1783.709,
    "text": " Yes, I mean, I was just going to say, like, we know that as you move, a bunch of your sensory and interoceptive signals change.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1783.909,
    "end": 1787.311,
    "text": "So they're basically never actually constant in the first place.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1788.112,
    "end": 1801.041,
    "text": "If there's something you want to hold constant, then yeah, you need something like the laser that effectively gives you an artificial source of constancy, a source of constancy outside the body, because you don't have one internally.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1801.061,
    "end": 1801.601,
    "text": "Right.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1804.858,
    "end": 1805.338,
    "text": " Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1806.379,
    "end": 1806.599,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1806.859,
    "end": 1819.766,
    "text": "And it's what's also occurring to me as you're saying that is as well as the internal conditions changing, you know, the external conditions are changing and, you know, it may be getting windier at various points of the course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1821.167,
    "end": 1831.153,
    "text": "And there may be, you know, Daniel, you talked about when we spoke a while ago about ants, if they, when is it appropriate for them to react to weather changes?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1831.693,
    "end": 1832.293,
    "text": "And there may be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1833.614,
    "end": 1840.219,
    "text": " We want a marathon runner to essentially ignore all the weather changes and just keep running at the desired speed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1840.48,
    "end": 1846.704,
    "text": "So it's almost... Yeah, maybe the last slide I put there was a bit of a distraction, really.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1846.724,
    "end": 1855.691,
    "text": "I don't think it's a distraction at all, though, because I think that the... No, I think it's super, super useful because part of, again, this whole idea of...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1856.852,
    "end": 1859.653,
    "text": " multiple variables in the body changing all at once.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1859.713,
    "end": 1862.573,
    "text": "That's kind of core to what we mean when we're saying allostasis, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1863.053,
    "end": 1866.834,
    "text": "We're saying that there aren't any particular constants that are there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1866.934,
    "end": 1869.134,
    "text": "There's a lot of variables that are moving and changing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1869.194,
    "end": 1882.917,
    "text": "And what Eli's making the point in this paper is that in lieu of set points in a lot of those cases, what you want is some variables to try to occupy a zone of maximal flexibility to changing circumstances.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1886.072,
    "end": 1902.056,
    "text": " But at some point, like there might be some variables deep, deep down in turn, like very, very central to regulating the body that are going to need to be kept at some close to homeostatic level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1902.236,
    "end": 1912.159,
    "text": "And so one of the things that was coming up for me in working with the Brain Energy Metabolism Conference is that variables like blood oxygenation might be one of those, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1912.95,
    "end": 1915.312,
    "text": " Those are very tightly regulated.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1915.372,
    "end": 1919.497,
    "text": "If that strays outside of some very narrow parameters, you're going to have really serious problems.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1920.398,
    "end": 1930.728,
    "text": "But if you think about your runner running the marathon, that blood oxygenation level is going to be fluctuating.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1930.768,
    "end": 1931.689,
    "text": "It's going to be challenged.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1931.709,
    "end": 1936.594,
    "text": "There's going to have to be responses or other compromises made in the body to maintain that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1937.864,
    "end": 1944.675,
    "text": " And if that's one variable that's being tightly regulated at the core of interoceptive information,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1946.218,
    "end": 1958.686,
    "text": " Other compromises that are going to happen to regulate that down the line might be changes in muscle force delivered, changes in speed, a lot of fluctuations that are happening in terms of how they're moving their body through this race.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1959.427,
    "end": 1970.154,
    "text": "And so if you're giving them some external sensory signal to couple to basically at the other end of this control hierarchy that Eli's describing, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1971.001,
    "end": 1977.566,
    "text": " then you're giving them something at the other end of it to couple to, to make their movement through the environment a bit more regulated and predictable.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1977.646,
    "end": 1983.811,
    "text": "So you can think of it as the entire control hierarchy that Eli's describing in this paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1984.612,
    "end": 1989.576,
    "text": "We have some very closely regulated and pteroceptive values far to the left.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1990.577,
    "end": 1997.442,
    "text": "We have a deep net of predictions and prediction error throughout the entire cortex that's performing some regulation, um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1999.665,
    "end": 2000.985,
    "text": " across the entire network.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2001.605,
    "end": 2004.806,
    "text": "And then we have exteroceptive information at the other end of it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2005.506,
    "end": 2021.529,
    "text": "And what you're doing with the lasers, you're basically giving the organism, the goal of fixing some of those values at the exteroceptive layer to give some more structure as they move throughout this entire deep, deep, deep network in all of the space between them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2021.609,
    "end": 2021.85,
    "text": "Right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2023.65,
    "end": 2023.85,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2026.943,
    "end": 2031.065,
    "text": " And what I'm thinking also that, you know, what the marathon runner did before that marathon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2031.105,
    "end": 2033.145,
    "text": "So the marathon was made predictive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2033.786,
    "end": 2056.174,
    "text": "His work, his breaking that record was made easier for him by the laser, but also, you know, maybe he influenced his blood, his blood oxygenation, the upper and lower limits of the acceptable settling range by doing, um, altitude training to stimulate more, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2057.495,
    "end": 2065.862,
    "text": " red blood cells, he might have done hyperbaric therapy to all those things, which will make it easier for him just to follow that later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2066.443,
    "end": 2066.663,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2067.203,
    "end": 2083.136,
    "text": "And I guess in Eli's framework, right, that would be, that's not necessarily changing the settling point of blood oxygenation, but what it is doing is at variables that are just slightly levels down from that, Eli, would this be right to say you're basically widening out that sigmoid function?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2084.197,
    "end": 2090.761,
    "text": " So that there's more adaptability from that additional training for increasing red blood cells, that sort of thing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2090.821,
    "end": 2091.322,
    "text": "Is that right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2092.562,
    "end": 2093.263,
    "text": "Yeah, definitely.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2093.283,
    "end": 2102.368,
    "text": "I'd also sort of add that some physiological variables are very tightly regulated.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2103.389,
    "end": 2112.395,
    "text": "But one of the open questions is sort of how many removes are they from a disturbance?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2113.462,
    "end": 2121.409,
    "text": " So like blood oxygenation or the pH in the brain that you mentioned, what does it actually take to disturb those?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2124.352,
    "end": 2124.632,
    "text": "Right.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2126.053,
    "end": 2132.018,
    "text": "Like blood oxygenation, you can probably disturb by just having greater or lesser uptake of oxygen from the blood.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2132.759,
    "end": 2140.206,
    "text": "Brain pH, I'd imagine that, honestly, I'd imagine that you have to disturb a lot of things sort of",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2142.082,
    "end": 2151.525,
    "text": " Disturb your way through the outer several layers of control systems before you can actually perturb that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2152.225,
    "end": 2159.748,
    "text": "But you can think about things like the fact that you have a blood-brain barrier in the first place is one thing that might help keep that sort of thing tightly regulated, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2160.388,
    "end": 2160.968,
    "text": "Exactly.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2161.168,
    "end": 2168.671,
    "text": "That's what I mean is that living systems tend to be sort of homeostatic or allostatic at every level.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2170.39,
    "end": 2179.112,
    "text": " Like a cell maintains its own internal homeostasis in some sense, or allostasis by interchange with its environment.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2179.672,
    "end": 2195.956,
    "text": "Then an organ system may also have, such as the brain may have the blood-brain barrier, and sort of other levels of protection that insulate it from its environment, because it has to be in cooperation with other organ systems.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2196.684,
    "end": 2225.172,
    "text": " For sure, and I guess the thing that I'm saying is just that for some of those parameters that do need to be really tightly regulated like that, you might see some naturally developing physiological structures like the blood-brain barrier that are there to help keep those values tightly regulated.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2226.218,
    "end": 2236.643,
    "text": " as opposed to having it be more under behavioral control, in which case there's some flexibility, there's some allostatic flexibility in those, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2237.044,
    "end": 2250.03,
    "text": "What you want is if there's something that really, really, really has to be kept at a certain level, you would ideally have some of the evolved biology work to fix some of those parameters in the physiology itself, maybe.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2250.37,
    "end": 2250.851,
    "text": "What do you think?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2251.771,
    "end": 2252.932,
    "text": "I'm sorry, actually, could I...",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2254.164,
    "end": 2255.966,
    "text": " Just take my dog out for five minutes.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2257.447,
    "end": 2259.528,
    "text": "Sorry, she's really begging me quite a lot.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2260.129,
    "end": 2262.131,
    "text": "And like the smell is getting to me.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2266.414,
    "end": 2267.495,
    "text": "I was thinking earlier.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2267.815,
    "end": 2268.095,
    "text": "Oh, sorry.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2268.115,
    "end": 2268.736,
    "text": "No, go ahead.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2268.776,
    "end": 2269.036,
    "text": "Go ahead.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2269.056,
    "end": 2269.737,
    "text": "Go ahead, Jordan.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2270.774,
    "end": 2274.997,
    "text": " I was just going to joke about I want to go find a cucumber and try that out on my cat too.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2275.317,
    "end": 2278.959,
    "text": "Yeah, actually, Terry in the chat wrote, Irish cats don't do this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2279.18,
    "end": 2280.56,
    "text": "There are no snakes in Ireland.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2280.761,
    "end": 2282.262,
    "text": "Seriously, I've tried it with our cat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2284.703,
    "end": 2285.664,
    "text": "So not all cats.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2286.524,
    "end": 2292.728,
    "text": "Well, and our cats lived indoors for her entire life except for the first six weeks or so, which was probably blind for half of that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2292.768,
    "end": 2298.873,
    "text": "So I should try it out on her too and see if there was some learning component to it or if she has it innate.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2301.812,
    "end": 2302.273,
    "text": " Sorry, Dean.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2303.114,
    "end": 2304.797,
    "text": "Go ahead, Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2305.398,
    "end": 2313.551,
    "text": "I just wanted to kind of throw this in here and I don't know, I'm feeling kind of bad because Eli's walking his dog, but I'm sure he'll pick up the thread here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2314.349,
    "end": 2320.591,
    "text": " So in the dot one, I brought up this idea, and I'm not sure how often it's, it's not ubiquitous yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2321.172,
    "end": 2325.053,
    "text": "But I think that the focus in this paper is about perspective swaps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2325.253,
    "end": 2326.514,
    "text": "So what do I mean by that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2327.254,
    "end": 2334.017,
    "text": "I kind of wanted to do a quick lap around that ergotically, and then see what you guys think about this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2334.733,
    "end": 2350.04,
    "text": " So uploading to a laser as a perspective in the dot zero, Daniel saying, staying within the connection space as he was talking about CDF to PDF as being another type of perspective taken.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2352.052,
    "end": 2368.838,
    "text": " The idea of bringing psychologists and their perspectives and engineers and their perspectives together in an institute or a lab setting as a different type of that, different perspectives colliding or at least paralleling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2370.839,
    "end": 2379.123,
    "text": "Dance, dodgeball, opposing teams, each having a different perspective because they're wearing a different pinny, colored pinny.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2380.183,
    "end": 2395.803,
    "text": " um instrumental that one of the things we talk about a lot in active inference is instrumentalism and and inaction or the idea of um sort of the embodied space versus the theoretical the map yeah perspective and the territory",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2396.397,
    "end": 2397.038,
    "text": " perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2397.819,
    "end": 2404.968,
    "text": "And in this paper's case, the specific feedback control focus as a perspective, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2405.648,
    "end": 2415.26,
    "text": "What I'd like to do is take that idea that there's all these perspectives that one can be swapped in and swapped out within the idea of regulation, within ranges, yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2416.081,
    "end": 2423.243,
    "text": " But I'd like to talk a little bit about what Ian brought up, which I think is a really critical point and maybe quite complimentary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2423.483,
    "end": 2426.984,
    "text": "Not corollary, but complimentary to what the paper was talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2427.604,
    "end": 2431.825,
    "text": "You said, if we do something in a safe space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2432.705,
    "end": 2434.606,
    "text": "Now, to me, I'm going to ask you this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2435.666,
    "end": 2438.467,
    "text": "To me, safe sometimes means controlled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2439.587,
    "end": 2440.167,
    "text": "Meaning controlled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2440.649,
    "end": 2447.39,
    "text": " the agents set the condition, or at least they perceive they have some control over that condition, okay?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2447.41,
    "end": 2448.571,
    "text": "So that's a perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2449.651,
    "end": 2454.512,
    "text": "That's sometimes perceived as ergodic because it's predictable, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2455.052,
    "end": 2464.414,
    "text": "Then we have a sense of how do we strategize from that set condition, one that's variability reduced,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2465.322,
    "end": 2468.704,
    "text": " to one that's condition set or variability retained.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2468.724,
    "end": 2476.489,
    "text": "And I use the example that you had on one of your slides, which is 108 interconnected variables that determine dot, dot, dot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2477.83,
    "end": 2481.873,
    "text": "Because to me, that's what this paper is trying to focus on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2481.913,
    "end": 2491.259,
    "text": "That specific feedback control is that shift in perspective, that swap between the variability reduced",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2492.776,
    "end": 2494.297,
    "text": " Because that's what I said.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2495.018,
    "end": 2499.421,
    "text": "Variability retained for me as a skier was I've got an open field.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2499.461,
    "end": 2500.281,
    "text": "It's pristine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2500.841,
    "end": 2503.243,
    "text": "It's 12 inches deep and away I go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2503.583,
    "end": 2513.13,
    "text": "But as more trees start amassing, my ability to be free because of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2514.656,
    "end": 2517.919,
    "text": " variability, my variability factor changes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2518.439,
    "end": 2527.727,
    "text": "And now the condition set is my perspective swap has to be, can I continue or am I just going to end up bashing into a bunch of limbs?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2528.548,
    "end": 2528.788,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2529.328,
    "end": 2529.568,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2529.709,
    "end": 2534.693,
    "text": "So the bringing up the two together to me, I want to kind of make clear what I mean by perspective swap.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2535.193,
    "end": 2535.453,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2535.934,
    "end": 2538.276,
    "text": "I don't think it contradicts what you've written in the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2538.316,
    "end": 2540.758,
    "text": "I think the move from CDF to PDF is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2541.696,
    "end": 2544.239,
    "text": " is a perfect example of that perspective swap.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2544.579,
    "end": 2559.273,
    "text": "And I'm not sure it's just a derivative, because as I said in the last live stream, you bring psychologists and engineers into the same space, and one doesn't get to rule over the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2559.313,
    "end": 2564.538,
    "text": "You need both to create that swapping condition, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2564.978,
    "end": 2566.66,
    "text": "Right, right, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2569.641,
    "end": 2578.347,
    "text": " Is that essentially what specific feedback control helps us get a better sense of?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2578.387,
    "end": 2588.535,
    "text": "Not just a grip or an optimality, but sort of a clear separation so that we can do the oscillating, so that we can do the swapping.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2589.036,
    "end": 2593.399,
    "text": "And so when we're having these kind of interactions, we're not doing a transdisciplinary thing here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2593.88,
    "end": 2596.882,
    "text": "We're really trying to get our heads around why did the laser work?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2597.782,
    "end": 2598.042,
    "text": " Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2600.284,
    "end": 2605.749,
    "text": "Because we can perspective swap that we might get closer to something satisfactory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2607.25,
    "end": 2610.913,
    "text": "So I'm trying to understand.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2611.053,
    "end": 2613.836,
    "text": "So when you're talking about a perception or perception swap.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2615.836,
    "end": 2618.697,
    "text": " I don't know if I'm going to answer your question satisfactorily.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2618.717,
    "end": 2621.098,
    "text": "We might have to wait for Eli, but I'm going to try my best here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2622.558,
    "end": 2625.059,
    "text": "That's all I want, you know, because I try my best too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2625.399,
    "end": 2626.459,
    "text": "Nobody's got to be perfect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2626.9,
    "end": 2627.98,
    "text": "Right, right, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2628.12,
    "end": 2634.682,
    "text": "But I think that that's part of what factors into how I was going to try to answer here, which is that I think that... So...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2643.328,
    "end": 2655.094,
    "text": " So the way I'll try to answer this is I'll try to draw on some of the social allostasis stuff that I've done, which is involving, more like you're saying, interactions between people, if we're bringing psychologists and engineers together, this sort of thing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2655.254,
    "end": 2672.684,
    "text": "So if, let's say, if I answered your question right now, let's pretend that I answered your question in a way that precisely got to the core of it and just stopped the conversation, and you just said,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2673.464,
    "end": 2676.286,
    "text": " oh yeah, I got it, that answers it in a word, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2678.128,
    "end": 2688.737,
    "text": "Then I might have perception swapped so closely to the way that you would frame this question and so perfectly understood that the way that you'd asked it, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2689.278,
    "end": 2695.623,
    "text": "That we don't actually explore the space around it in a way for other people to come in to understand anything of what's going on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2696.124,
    "end": 2696.584,
    "text": "Exactly.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2697.549,
    "end": 2712.432,
    "text": " if I actually didn't totally understand your question and I need to ask questions and we need to bounce this back and forth for like several minutes, then we might still come to a settling point and we might perform some gradient descent to come to an actual answer here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2713.093,
    "end": 2723.055,
    "text": "But because it's going to take longer, it might end up bouncing around through different parts of the space of answers that we could look at and end up capturing other ways that, um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2723.996,
    "end": 2726.517,
    "text": " other perspectives might be able to understand it, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2726.577,
    "end": 2736.961,
    "text": "So that they can catch some element of it that was predictable or that fit with some internal model that they'd already generated, and then to be able to follow along to the gradient descent to reach down to that point, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2737.922,
    "end": 2752.988,
    "text": "So I think that part of the advantage, right, of having interdisciplinary conversations, and we've done this a lot, especially, you know, in working with Eli and then working with the engineers at Northeastern, these psychology engineer interdisciplinary collaborations, right, is that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2754.005,
    "end": 2758.826,
    "text": " there will be a really long and frustrating period where people just do not understand each other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2761.247,
    "end": 2776.371,
    "text": "And you need to actually work through that because that's a period where you can do some learning and you can actually get some understanding of other perspectives, other ways to build a model of the environment, other ways to sort of take a perspective on events that are actually happening.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2777.652,
    "end": 2778.372,
    "text": "But yeah,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2779.755,
    "end": 2792.263,
    "text": " there will be a temptation through the entire thing to cut your losses and leave it because it is frustrating and it is metabolically costly, I'd say, um, to do all of that information processing and to follow that process.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2792.303,
    "end": 2807.072,
    "text": "And it's not always obvious when the gradient descent is going to end either, or when you do understand each other or when everyone is sort of followed into the loop and are able to follow that down to make the environment predictable, to come to a shared understanding, um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2810.222,
    "end": 2827.119,
    "text": " You might know when you're getting close, but until you get to that point, you might be in a really long and frustrating process of search, prediction error, of basically bouncing around through the environment of trying to come up with some model that can predict it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2828.467,
    "end": 2834.548,
    "text": " So I feel like that was a very meta way of trying to answer your question, but I think, does that help?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2834.789,
    "end": 2839.37,
    "text": "I think it gets at part of the use of interdisciplinary work, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2840.35,
    "end": 2848.752,
    "text": "And how having these different perspectives are going to help us explore the space more fully, because if we...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2850.157,
    "end": 2867.39,
    "text": " if we just had an internal language to each other, if we perfectly understood each other in the first place, then you don't actually end up exploring the space in that case because you descend to sort of common predictions too fast to really bounce around and explore everything.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2867.97,
    "end": 2874.675,
    "text": "You've basically described the capitulation to a retroductive or an abductive logical process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2874.735,
    "end": 2875.516,
    "text": "That's all you've done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2875.556,
    "end": 2876.677,
    "text": "And I don't think there's anything...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2877.509,
    "end": 2879.351,
    "text": " too nasty about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2879.391,
    "end": 2883.956,
    "text": "It's been around for over a hundred years and I think it's having a renaissance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2883.976,
    "end": 2884.576,
    "text": "So thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2884.957,
    "end": 2886.398,
    "text": "Cool, cool, cool, cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2891.723,
    "end": 2892.104,
    "text": "Ian?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2896.078,
    "end": 2925.641,
    "text": " Yes, as you were talking there about this, different disciplines coming together, it was reminding me of one of the Active Instruments Institute's papers that were covered a few weeks ago on social communication as control, I think it was, and also reminding me of the difficulty of a newborn child and a parent, that all the child can do is cry when it's,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2927.409,
    "end": 2947.357,
    "text": " feels some sort of discomfort and then the parent has to try and figure out what that that cry means does it mean it's hungry does it mean it's um nappy needs changing does it mean it's too hot or cold so there's a there's a period of learning each other's language and learning what each other's cues are and regulating each other and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2948.718,
    "end": 2949.538,
    "text": " controlling each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2949.558,
    "end": 2956.161,
    "text": "Yeah, that's what, arguably that's all we're doing all the time as socially as adults.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2956.241,
    "end": 2964.324,
    "text": "We just got a more bigger set of vocabulary and we can influence our environment more than the baby.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2965.044,
    "end": 2970.587,
    "text": "Well, then we can tell each other what our expectations are too, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2971.067,
    "end": 2976.489,
    "text": "Like the baby is giving a really diffuse signal that there is some interoceptive state that's disrupted",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2977.196,
    "end": 2988.501,
    "text": " And then the adult has to, like we were saying, right, explore around and bounce around until they can converge on that and get the baby satisfied, satisfy that interoceptive state, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2989.462,
    "end": 3002.707,
    "text": "But, you know, if I... So some of the other work that I've done is looking at how... I really want to look at this paper then of social communication as control because that's related to some other stuff that I've been doing too.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3002.788,
    "end": 3005.369,
    "text": "But it's that I think that...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3006.365,
    "end": 3018.738,
    "text": " You can think of social influence as basically people regulating uncertainty in a social environment by conforming to predictions that other agents have in it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3019.78,
    "end": 3025.746,
    "text": "So you can think of a social norm as a set of collective expectations that people might have in an environment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3027.492,
    "end": 3039.097,
    "text": " And if you conform to those expectations, then you can minimize prediction error for people and you can minimize the likelihood that their behavior is going to change, that your environment is going to become disrupted, more entropic, anything like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3040.018,
    "end": 3052.744,
    "text": "And so the baby's basically creating entropy in their environment for the adults in the room to try to minimize by satisfying interoceptive needs for them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3054.645,
    "end": 3074.792,
    "text": " You can, as an adult, once you can communicate, maybe get around some of those problems by saying, you know, you ask someone to pass the salt at Thanksgiving or pass the butter, you've made an expectation extremely clear, and then people can satisfy that expectation and everything continues on predictably, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3075.472,
    "end": 3079.333,
    "text": "They could also refuse and say, no, I'm not going to pass the salt.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3080.514,
    "end": 3081.254,
    "text": "But if you do that,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3082.264,
    "end": 3085.305,
    "text": " you will move things onto a more unpredictable trajectory, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3085.345,
    "end": 3097.488,
    "text": "You're going to push things out of the sort of bounds that people are used to navigating and you're going to potentially move off into this space of having to explore each other's reactions like Dean was talking about, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3100.888,
    "end": 3101.449,
    "text": "Yes, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3101.469,
    "end": 3105.91,
    "text": "And what you're sort of saying there, it's reminding me of some of the work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3106.01,
    "end": 3110.551,
    "text": "It's a Greek researcher called Dimitris Zylid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3111.836,
    "end": 3133.112,
    "text": " I think he's, he's done a lot of work on ritual and how rituals basically, you know, he's put heart rate monitors on people and measured cortisol levels and so on over the weeks and days following rituals and showing that it's, you know, there's a lot of synchronization that occurs during rituals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3134.153,
    "end": 3136.694,
    "text": "But the, so there's synchronization of physiology and,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3137.515,
    "end": 3144.661,
    "text": " but it's bound up in these kind of codes or rules about how our clan or our group or our society should operate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3144.701,
    "end": 3153.608,
    "text": "So it's kind of, I, you know, my interpretation on that is it's training a person's physiology to align itself with social behaviours.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3155.049,
    "end": 3156.91,
    "text": "Is this, wait, was this Demetrius Bolas?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3157.897,
    "end": 3170.909,
    "text": " Demetrius, his surname is spelt X, Y, G, A, L, A, T, A, S. He wrote a book recently called Ritual, How Seemingly Senseless Acts Make Life Worth Living.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3171.109,
    "end": 3182.56,
    "text": "But yeah, he's done some study with measuring heart rate variability and stuff for firewalking kind of rituals and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3184.045,
    "end": 3212.799,
    "text": " that's really cool jordan you did mention demetrius bolus and the work from 2020 through others we become ourselves the dialectic predictive coding active inference also hinging on a shared first name but a very relevant paper as well um and then one thought to connect this idea of synchrony uncertainty controlled novelty in communication",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3214.162,
    "end": 3222.608,
    "text": " And in rituals, that's when people are the laser for each other with their attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3223.269,
    "end": 3228.572,
    "text": "So then it's like, okay, we're going to do a role play where this is going to be the case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3229.493,
    "end": 3232.395,
    "text": "I'll synchronize this perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3232.455,
    "end": 3233.616,
    "text": "You'll have this perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3234.076,
    "end": 3238.379,
    "text": "We'll just be like, it will be just two stubborn characters having this argument.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3238.559,
    "end": 3239.42,
    "text": "It'll be very funny.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3240.301,
    "end": 3241.081,
    "text": "And then that...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3242.452,
    "end": 3243.473,
    "text": " is a predictable play.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3243.493,
    "end": 3244.435,
    "text": "It could even be scripted.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3245.135,
    "end": 3247.098,
    "text": "Or at the very least, you can have fun and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3248.553,
    "end": 3248.953,
    "text": " so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3248.973,
    "end": 3268.148,
    "text": "So it's very interesting that that is reflected in the social space, whereas the marathoning and going for the record, which few people want to do, most people can take a much more relaxed approach than the person trying to set the world record.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3269.108,
    "end": 3274.853,
    "text": "But in the social space, as Dean brought up,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3276.348,
    "end": 3302.976,
    "text": " there's a lot that we can bring to bear on the social space from variability reduced settings like laboratory studies on cognition fmri studies with social stimuli but the social space is a variability retained area of application right and so there's a challenge with the translation yes jordan",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3304.225,
    "end": 3312.506,
    "text": " But social norms, right, or sort of some social standards or mutual expectations add some variability constraint to that social space, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3312.566,
    "end": 3317.467,
    "text": "Because there's nothing physically stopping you from doing a lot of different things in any social setting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3318.327,
    "end": 3329.889,
    "text": "But the point is that if you want to stay in a variability reduced space, and I think that there's some metabolic advantages and interoceptive advantages to staying in a variability reduced state, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3329.949,
    "end": 3330.089,
    "text": "Then",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3333.968,
    "end": 3349.292,
    "text": " It's just the predictions of other agents that set some of the bounds of where you'll wander into a variability increased state if you wander outside of those expectations or a variability reduced state if you stay within them, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3349.432,
    "end": 3355.073,
    "text": "So as long as you're adhering to some predictions that other agents would have in that environment,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3355.879,
    "end": 3363.783,
    "text": " then you're going to stay in a variability-reduced state and you can stay for lots of purposes sort of socially invisible to other agents.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3363.843,
    "end": 3370.887,
    "text": "You don't need to create new disruptions to an environment that you're going to need to be prepared to adapt to, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3374.069,
    "end": 3374.429,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3374.609,
    "end": 3374.769,
    "text": "Dean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3376.446,
    "end": 3377.587,
    "text": " Sorry, I'll lower my hand again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3378.028,
    "end": 3388.419,
    "text": "So the fascinating thing about the paper was I used a basic heuristic that says when in doubt, and we're pretty much always in doubt, zoom in, zoom out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3389.3,
    "end": 3396.387,
    "text": "And so when I look at the scale of what that would mean from the perspective of interoception,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3397.208,
    "end": 3405.374,
    "text": " Those time scales are much tighter than if I zoom it out to the allostasis involved in running a marathon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3406.074,
    "end": 3420.644,
    "text": "My zoom in, zoom out range and potential gain is much different for the allostasis than it is for the interoception that's involved over that same course of time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3421.625,
    "end": 3429.947,
    "text": " And so that's where I found the specific feedback control, which implies that there must be a general feedback control as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3430.747,
    "end": 3431.507,
    "text": "So interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3431.547,
    "end": 3443.209,
    "text": "That's where Eli's part about the four different time segmentation possibilities allows for that zoom in, zoom out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3444.469,
    "end": 3448.29,
    "text": "Am I contradicting what the point was that you were trying to make in the paper, Eli?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3451.286,
    "end": 3454.448,
    "text": " I am slightly wondering where you got four specific scales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3455.469,
    "end": 3460.651,
    "text": "Well, you had the L4 in terms of... Oh, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3460.891,
    "end": 3462.692,
    "text": "Oh, that was just for modeling purposes.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3463.133,
    "end": 3464.113,
    "text": "No, I understand that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3464.173,
    "end": 3468.415,
    "text": "But I mean, you can still inflate that to... Yeah, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3469.216,
    "end": 3473.338,
    "text": "But I think that's a pretty standard part of the hierarchical active inference literature, isn't it?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3473.778,
    "end": 3473.998,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3474.959,
    "end": 3475.079,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3477.062,
    "end": 3487.445,
    "text": " But do you think the idea that again, we can swap from the specific to the general is again, it just seems to be again and again, it's that ability",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3488.075,
    "end": 3497.762,
    "text": " to move within ranges, but the range doesn't necessarily remain consistent unless of course you're following a laser.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3498.143,
    "end": 3515.536,
    "text": "But that goes back to my original question is because we offload the metabolic commitment that we would have to stay at that level of consistency, we can then turn those resources over to other aspects of that endeavor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3520.882,
    "end": 3537.629,
    "text": " Let me try to ask that a different way to Jordan, I think, would be how would different patterns in this type of multi-timescale framing reflect different metabolic or energetic costs?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3538.37,
    "end": 3545.953,
    "text": "Like, does the brain use more oxygen, glucose, ketone bodies, micronutrients?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3547.25,
    "end": 3572.293,
    "text": " knows during what kind of activity such that there's what kind of a link between the physiological costs in gold yeah versus this cognitive angle i mean i think the way to to do it and this was i think um i was thinking of this when you're asking you like too is that the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3574.226,
    "end": 3599.218,
    "text": " The trick is, right, is that if you're regulating some of the input to the interoceptive input that you're trying to regulate that might be really central to allostatic regulation, right, could be from sensed interoceptive variables like blood oxygenation, like blood glucose,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3600.285,
    "end": 3617.735,
    "text": " But the trick is, right, is that, and this is that I think more what I'm interested in, what I'm trying to develop with thinking about brain metabolism is that all of the steps and all of the communication that has to be done at some of these lower orders of this hierarchical scale, right, isn't free.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3618.195,
    "end": 3620.257,
    "text": "It has metabolic costs itself, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3620.957,
    "end": 3626.04,
    "text": "And so, you know, in the human brain, the actual...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3627.173,
    "end": 3635.576,
    "text": " resting state cost of the human brain when you're just sitting still in the MRI scanner is about 20% of your body's metabolic budget.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3637.297,
    "end": 3645.76,
    "text": "It fluctuates a little bit as you're doing some sort of, as you're doing sensory processing, as you're dealing with unpredictable information,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3646.894,
    "end": 3651.218,
    "text": " The details of how it fluctuates, like those matter too, and we can get into those.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3651.238,
    "end": 3662.408,
    "text": "There's relative changes in how much glucose you're consuming versus whether you're consuming the glucose with oxygen for like a more efficient yield of ATP energy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3662.469,
    "end": 3664.37,
    "text": "But the point is just that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3665.291,
    "end": 3668.334,
    "text": " Neuronal signaling itself is super expensive.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3668.955,
    "end": 3678.004,
    "text": "And if you're navigating an unpredictable environment, then you can expect to have some of those expenses kick up or have them change in ways that are going to have to be regulated.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3678.105,
    "end": 3680.707,
    "text": "So what that means, right, is that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3681.869,
    "end": 3699.255,
    "text": " Even though there's a hierarchy of processing here where you're taking in sensory signals, you're passing them up a cortical hierarchy and you're compressing them, if you're doing that more and more, and if you're in an environment where you have to be passing potentially more and more prediction error up this chain, that can itself then be changing",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3701.098,
    "end": 3729.953,
    "text": " important interoceptive sensed variables that might enter at different points of the hierarchy because there's still sense information but they might be more centrally regulated they might have downstream effects if those start to go out of whack right so basically i think that it like you brought up too that you know thinking about this from an allostatic perspective instead of a computational perspective and i think the computer metaphor that people have been using for the brain",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3731.556,
    "end": 3742.5,
    "text": " kind of computer scientists don't often think about cost in lots of ways too, unless, you know, but they'll think maybe about time cost of how many cycles this like deep neural net is going to take to train.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3742.58,
    "end": 3750.083,
    "text": "But they often don't think about the fact that like all of the components of this computer do take like real energy to run.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3750.423,
    "end": 3753.865,
    "text": "And, you know, you can heat up the planet mining Bitcoin.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3753.905,
    "end": 3755.125,
    "text": "You can do all of this stuff too.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3755.165,
    "end": 3756.986,
    "text": "There's external, there's a,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3760.094,
    "end": 3769.68,
    "text": " external cost to all of this that aren't taken into account when you're actually training these systems, the brain can't ignore that because it is an actual biological system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3769.72,
    "end": 3778.206,
    "text": "And its whole point is that it's going to have to keep that system working, navigate the environment and grab metabolic resources to keep the cycle going.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3778.967,
    "end": 3783.85,
    "text": "And so all of this computation that you're doing, yeah, isn't free.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3783.99,
    "end": 3788.213,
    "text": "It adds up and then can potentially have downstream effects on,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3788.621,
    "end": 3790.603,
    "text": " on sensed metabolic variables that are critical.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3795.248,
    "end": 3795.488,
    "text": "Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3795.849,
    "end": 3796.229,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3796.409,
    "end": 3796.609,
    "text": "Ian?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3802.155,
    "end": 3802.495,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3802.555,
    "end": 3808.542,
    "text": "Yeah, I was just thinking then after what Jordan was saying about climate change and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3810.842,
    "end": 3826.365,
    "text": " that if that's a prediction that's maybe, you know, two decades ago, wasn't going to affect my life, but it might affect the lives of my children or my children's children to act now with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3826.465,
    "end": 3833.046,
    "text": "That's a, that's a very abstract, you know, there's, there's probably for most people, there was nothing in their environment that would",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3836.391,
    "end": 3865.372,
    "text": " give them that prediction of future threats in 50 100 years time so they have to create a very you know abstract sort of image of what the planet's going to be like and then to you know all the huge energy expenditure that's required to switch to renewables to you know organize society differently that's going to require a massive in allostatic load in the short term",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3866.765,
    "end": 3878.651,
    "text": " or interoceptive sort of demand, chronic low-level interoceptive disturbance to create that shift through generations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3879.352,
    "end": 3879.632,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3880.572,
    "end": 3888.736,
    "text": "And so I think you see, right, like there's... If what your brain is regulating is...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3892.481,
    "end": 3914.58,
    "text": " at the core of it some of the interoceptive parameters that are necessary to keep your body and your whole organism moving forward right then being thrown into a constant state of uncertainty is going to be costly if we think it's true that processing all of that uncertainty is going to have a metabolic cost attached to it so there's going to be some",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3916.516,
    "end": 3924.78,
    "text": " I think the way that your sort of brain as a regulator is going to work is probably gonna wanna return you to some relatively predictable state.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3924.92,
    "end": 3934.986,
    "text": "And so the issue, right, is that if you require, if you can model and understand externally, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3935.086,
    "end": 3945.531,
    "text": "Like if you can understand that the long-term trajectory that you're on in terms of climate change is going to lead to disaster, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3946.437,
    "end": 3957.701,
    "text": " it can still be really difficult to divert from that because the trajectory is a predictable trajectory that you're on until it hits some of these critical exponential points where it's suddenly going to break, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3958.462,
    "end": 3962.123,
    "text": "And so I think you can see that with climate change.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3962.163,
    "end": 3963.884,
    "text": "I think you can see that with the pandemic.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3963.924,
    "end": 3974.768,
    "text": "You can see a lot of cases where there's a temptation to return to some sort of trajectory where when things are going moment to moment, they're relatively...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3976.252,
    "end": 3978.774,
    "text": " They don't require a relatively large amount of attention.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3979.774,
    "end": 3996.683,
    "text": "And if you're going to enter into some uncertain change state, I think there's going to be a sort of collective pressure of a lot of brains regulating themselves to get back onto some predictable trajectory, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3997.104,
    "end": 4004.868,
    "text": "You can't sustain complete uncertainty for a really long time because I don't think our brains can handle it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4006.032,
    "end": 4008.594,
    "text": " So I would have to ask uncertainty about what?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4010.275,
    "end": 4012.816,
    "text": "Uncertainty about the immediate lived environment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4013.337,
    "end": 4015.198,
    "text": "So what's going on around you?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4015.478,
    "end": 4016.099,
    "text": "What are you doing?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4016.199,
    "end": 4026.005,
    "text": "When I got up today, like I made coffee, I got on the computer, I have a predictable set of sensory signals that I'm going to be running into.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4026.025,
    "end": 4028.827,
    "text": "I have like a daily routine, these things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4029.447,
    "end": 4031.869,
    "text": "I don't mean in a broad sense of like... Can we go back a slide?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4031.889,
    "end": 4032.209,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4034.15,
    "end": 4034.571,
    "text": "Because...",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4036.545,
    "end": 4037.666,
    "text": " Let's see.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4037.926,
    "end": 4039.206,
    "text": "So what was it?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4039.286,
    "end": 4040.907,
    "text": "Climate change, pandemic.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4041.007,
    "end": 4047.01,
    "text": "So most of these are not actually things that make your day-to-day life that unpredictable.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4048.031,
    "end": 4049.351,
    "text": "That's exactly what I'm saying.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4050.372,
    "end": 4061.798,
    "text": "I'm saying that those long-term events, those things that you might be worrying about, those things that we're talking about being worried about climate change, they don't actually impact your day-to-day life right now very much.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4062.458,
    "end": 4066.08,
    "text": "And so changing your day-to-day life substantially now to deal with them",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4066.906,
    "end": 4068.588,
    "text": " is going to be difficult.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4070.529,
    "end": 4071.27,
    "text": "That's all I'm saying.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4071.65,
    "end": 4079.617,
    "text": "Well, not necessarily, because the reference trajectory for actually dealing with them is not necessarily that unpredictable either.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4080.698,
    "end": 4083.801,
    "text": "Different from what you're already doing doesn't mean unpredictable.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4086.063,
    "end": 4091.187,
    "text": "It's true, but the period where you shift what you're doing to something different is.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4092.368,
    "end": 4094.19,
    "text": "And so I guess what I'm saying is that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4095.535,
    "end": 4102.718,
    "text": " a change is something that requires a difference in trajectory from where something was already going.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4105.039,
    "end": 4121.506,
    "text": "Yeah, but I think the thing about, so the thing about our trajectory-based formulation of allostasis is that, well, the whole point is that, you know, if you, let's say you plan to go to the store, you're driving on the road, you make a right turn.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4122.822,
    "end": 4124.363,
    "text": " Is the right turn unpredictable?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4124.824,
    "end": 4125.484,
    "text": "No, it's not.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4125.944,
    "end": 4128.747,
    "text": "It's a predicted, baked-in part of the reference trajectory.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4132.73,
    "end": 4140.235,
    "text": "Change does not have to be unpredictable, and I think we should avoid conflating those two.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4140.255,
    "end": 4145.179,
    "text": "Sure.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4148.683,
    "end": 4150.023,
    "text": " Can I bring this back?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4150.304,
    "end": 4150.464,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4150.604,
    "end": 4152.904,
    "text": "A couple of examples of things we talked about in the .0.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4153.525,
    "end": 4159.467,
    "text": "So Daniel brought up a really interesting point when he talked about glucose stacking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4160.407,
    "end": 4170.49,
    "text": "And it automatically sort of brought me to the idea of people who have diabetes and those that are, I think it's hypoglycemic unawareness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4170.91,
    "end": 4172.311,
    "text": "They're the most brittle people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4172.813,
    "end": 4173.473,
    "text": " diabetics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4175.595,
    "end": 4189.082,
    "text": "And essentially what that speaks to is they have a large blind spot to sort of the cumulative effects of what's going on because the pancreas isn't working correctly, doing that kind of regulation piece.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4189.723,
    "end": 4198.048,
    "text": "That blind spot and the severe consequences of that blind spot, again, I don't want to beat this like a dead animal, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4199.198,
    "end": 4203.78,
    "text": " Because you are blind to something implies that you cannot take up that perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4204.2,
    "end": 4215.346,
    "text": "And then the consequences of that are more severe when you absolutely don't know how your body is going to respond to that donut or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4217.018,
    "end": 4231.267,
    "text": " So again, we talked about it in the context of, Jordan was really good in clarifying, we can't think of this in economic terms, but I think we can think of it in terms of blind spot terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4231.547,
    "end": 4234.709,
    "text": "If we have a blind spot to this, how do we respond to it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4235.91,
    "end": 4238.332,
    "text": "How do 7 billion people respond to it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4239.152,
    "end": 4241.454,
    "text": "Well, what they do is they revert back to the now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4242.759,
    "end": 4245.701,
    "text": " That's what they do about their blind spot, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4245.721,
    "end": 4250.145,
    "text": "Because they just don't want to take up the perspective swap because it's way too challenging.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4253.388,
    "end": 4267.359,
    "text": "They might also sense, there might be, you might think of it also, right, in this control hierarchy of that, if you're missing an ability to sort of sense and regulate some parameters in the hierarchy,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4268.114,
    "end": 4273.655,
    "text": " there might be downstream consequences of glucose use that can be sensed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4274.256,
    "end": 4277.436,
    "text": "But the problem is that it's going to mean that you don't have as tight control.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4277.456,
    "end": 4282.057,
    "text": "You're basically, like you're saying, you have a blind spot in that hierarchy that isn't as tightly regulated.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4282.117,
    "end": 4296.601,
    "text": "And so it could potentially wander out of some of the bounds that are going to be adaptive or safe because you're performing some sort of second order control on it instead of controlling it",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4297.256,
    "end": 4321.828,
    "text": " more tightly with some of the senses that you would normally use right yeah but what do you think if i could just give one quick response actually on this idea um the leverage point of the control system is the true control variable so beyond being a good regulator having a volume knob in your head if there's a volume knob in the generative process",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4322.893,
    "end": 4350.967,
    "text": " the ultimate control situation is to just have the actual control of the volume knob and there's cases where that's possible there's case where it's not but where it is possible it's the leverage point and then jordan you just pointed to if you're missing this ability to either um sense x like we can't directly perceive our glucagon circulating level or responsivity across different tissues it's just two multifaceted",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4351.827,
    "end": 4379.887,
    "text": " and subliminal of an interoception directly different hormone balances and so on though technology and measurements are increasingly allowing that to be laser focused without the ability direct to directly control those subliminal factors to either sense or act on them we can only apply upstream or downstream control so we could",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4381.238,
    "end": 4405.795,
    "text": " modify our niche or use signposting or stigmergy so that our environment dissuades us or makes something impossible like time boxing or just putting something away um or downstream consequences like if like um having um uh some kind of supplement that helps with lactose digestion so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4407.361,
    "end": 4412.352,
    "text": " We can't regulate most, you can't put oxygen in the blood simply.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4413.093,
    "end": 4415.959,
    "text": "You can't simply change the amount of cholesterol.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4417.441,
    "end": 4443.846,
    "text": " And so actually being able to have a framework such as you're describing, where we can talk about the true physiological variable, the actual substance of the essential variable, but also recognize that we're only going to have interoceptive access into potentially noisy or variable proxies that are influenced by many things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4445.168,
    "end": 4453.911,
    "text": " And they're going to be like sometimes multiple steps up or downstream, like lightheadedness in the context of glucose regulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4453.951,
    "end": 4455.611,
    "text": "But that can happen for a lot of reasons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4456.271,
    "end": 4461.953,
    "text": "So it can't be simply the Q. So really interesting there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4463.834,
    "end": 4464.814,
    "text": "Eli or anyone else?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4467.855,
    "end": 4468.155,
    "text": "So...",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4470.652,
    "end": 4479.04,
    "text": " I think we have to differentiate between how could you build an active inference control system in general and how are nervous systems built in specific?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4481.523,
    "end": 4485.446,
    "text": "How our nervous system is built in specific is an empirical question.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4486.688,
    "end": 4492.914,
    "text": "And I have pretty strong doubts that it's all just a matter of leverage.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4496.479,
    "end": 4501.521,
    "text": " for pretty much the same reason that I have my doubts about, it's all about avoiding change.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4509.503,
    "end": 4514.945,
    "text": "Like there's just such wide variability of behavior in real life.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4516.305,
    "end": 4518.506,
    "text": "There are people who embrace change.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4518.566,
    "end": 4521.147,
    "text": "There are people who challenge themselves.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4523.152,
    "end": 4527.614,
    "text": " There are people who give up some of their leverage or control over some things.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4530.295,
    "end": 4546.542,
    "text": "And if we don't look at those... If we sweep those actual behavioral instances under the rug of a sort of general principle that says, well, everyone ought to be very controlling and conservative all the time, then...",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4552.239,
    "end": 4554.641,
    "text": " I can't help but think it's a sort of scientific sin.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4555.962,
    "end": 4562.266,
    "text": "So Dean and I were talking when you were out too about... Sorry about that, by the way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4563.007,
    "end": 4566.37,
    "text": "Normally she's a bit more allostatically resilient, but she might be ill.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4567.27,
    "end": 4569.992,
    "text": "Oh, I hope she's feeling better.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4570.573,
    "end": 4580.08,
    "text": "But we were talking about, because I think maybe there's a misunderstanding because I don't think that we're saying that people only want to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4581.084,
    "end": 4584.205,
    "text": " control or make their environments perfectly predictable, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4584.885,
    "end": 4588.866,
    "text": "I think part of what we were talking about, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4588.886,
    "end": 4607.411,
    "text": "We were talking about this idea of shifting perspectives or this idea of how do... So we were coming at it from the perspective of what a collaboration between psychology and engineering really gets you in the first place even, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4608.342,
    "end": 4619.248,
    "text": " And what we were talking about is that part of what it does, if people have the goal of trying to understand each other at the end of it and reach some sort of mutual predictability, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4619.968,
    "end": 4633.856,
    "text": "So that they've developed some understanding that they can build a forward model from that they can actually, they have a model of the environment that incorporates some understanding from the other collaborator, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4636.223,
    "end": 4640.846,
    "text": " There's going to be a period of that where you don't necessarily understand each other super well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4641.986,
    "end": 4649.131,
    "text": "And there's going to be a long period of speaking to each other and not totally making sense and having to ask a lot of questions and having to search the space.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4650.111,
    "end": 4661.378,
    "text": "And what we are talking about is that from the perspective of fully exploring a space to actually develop a complete model of it, or at least a better model of it,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4662.81,
    "end": 4668.379,
    "text": " There's actually some advantage of not having things quickly achieve that predictability for each other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4669.701,
    "end": 4677.374,
    "text": "If you quickly just gravitate, if I answer a question and the other person just immediately understood what I meant by it,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4678.737,
    "end": 4686.06,
    "text": " It might be because I answered it in a way that just happened to nail it for that one person, but no one else in an audience is going to be able to understand it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4686.14,
    "end": 4688.441,
    "text": "No one else who's listening in is going to be able to understand it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4689.242,
    "end": 4698.726,
    "text": "And so by having some sort of imperfect process of gravitating toward making things predictable for each other,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4700.053,
    "end": 4705.858,
    "text": " we actually achieve some more exploration and we sort of get a better sense of the space that we're actually moving through.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4706.158,
    "end": 4709.861,
    "text": "And we might generate a better model than we would if we just immediately converged, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4712.904,
    "end": 4713.424,
    "text": "Yeah, of course.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4716.006,
    "end": 4718.008,
    "text": "But I think, yes, sorry, I'll go ahead.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4719.409,
    "end": 4723.731,
    "text": " Eli, you raised the difference between these two questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4723.791,
    "end": 4727.112,
    "text": "How is the nervous system built in specific or in particulars?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4727.712,
    "end": 4730.773,
    "text": "And how can you build or what is an active inference model in general?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4730.873,
    "end": 4733.754,
    "text": "So maybe return to the top question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4735.335,
    "end": 4736.375,
    "text": "Sure, yeah.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4736.395,
    "end": 4745.459,
    "text": "So I think this is one of those things that can get a little conflated when we have these collaborations of psychologists and engineers.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4746.542,
    "end": 4766.358,
    "text": " where from the engineering side, if you're building something for, so to speak, the other acronym that you can form out of active inference, AI instead of act-inf, then you don't want something that works like a human nervous system necessarily.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4766.418,
    "end": 4773.244,
    "text": "Well, you may want it to share a few properties, but actually you're building it to solve some sort of task.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4774.335,
    "end": 4778.458,
    "text": " or to exhibit some sort of relatively well-specified behavioral routine.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4780.02,
    "end": 4789.067,
    "text": "And therefore, it's going to be, in most respects, very completely different from a human being.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4790.508,
    "end": 4798.095,
    "text": "And that's actually not just because you're trying to avoid, what is it, Rossum's universal robots, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4799.545,
    "end": 4803.266,
    "text": " where, of course, those were actually made of flesh and blood.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4804.347,
    "end": 4808.188,
    "text": "It's not because you don't want your computer to grow feelings and decide to go on strike.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4808.308,
    "end": 4814.771,
    "text": "It's because, a priori, there's no reason to build a machine that works like a person in the first place.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4816.331,
    "end": 4824.014,
    "text": "Maybe it would decide to go on strike, but the space of things that you can build is just so much larger.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4825.862,
    "end": 4833.348,
    "text": " that what you would usually do as an engineer is just aim towards the point of the space that you actually need for your task.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4835.31,
    "end": 4851.823,
    "text": "And that also implies a sort of converse proposition, which is that the human nervous system is a pretty specific point in a space of things that could have evolved, or even in the space of things that did evolve.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4853.874,
    "end": 4858.035,
    "text": " you know, human being versus, what is it?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4858.115,
    "end": 4859.296,
    "text": "It's not a sponge.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4859.436,
    "end": 4874.761,
    "text": "It's that sea organism mentioned in one of those Friston papers that, you know, when it goes through a certain life transition, it latches itself down onto a rock and goes through a little stage of metamorphosis where it eats its nervous system.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4875.601,
    "end": 4876.362,
    "text": "Yeah, sea squirt.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4876.402,
    "end": 4876.922,
    "text": "Thank you, Ian.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4878.646,
    "end": 4880.167,
    "text": " Like those both evolved.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4880.488,
    "end": 4884.891,
    "text": "There is some space of possibilities that includes both the C squared and the human being.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4885.792,
    "end": 4889.615,
    "text": "This implies that it's a pretty broad space of possibilities.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4890.616,
    "end": 4904.168,
    "text": "And if we're using active inference to model them both, this implies a very, very large space of possible active inference models, formalisms, controllers,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4910.749,
    "end": 4924.902,
    "text": " So, Eli, if I've heard you correctly there, you're sort of saying that artificial intelligence or tools that humans make that might be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4927.458,
    "end": 4931.879,
    "text": " modeled may or may not be modeled using active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4932.259,
    "end": 4938.021,
    "text": "There's usually an outcome or a goal that's quite clear why we build them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4938.081,
    "end": 4941.662,
    "text": "So it might be, I don't know, I want to build a coffee maker to make me coffee.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4942.802,
    "end": 4951.084,
    "text": "And I might use some very intelligent methods to build that coffee machine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4951.704,
    "end": 4953.025,
    "text": "But the outcome is clear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4953.965,
    "end": 4958.907,
    "text": " It seems to me that with the nervous system, we're still not clear on what the outcome is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4958.947,
    "end": 4965.311,
    "text": "So if the FEP is right, then it's just to minimize free energy, minimize surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4965.351,
    "end": 4966.111,
    "text": "But am I right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4966.131,
    "end": 4970.693,
    "text": "You're sort of questioning whether that is the cup of coffee we're after at the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4975.996,
    "end": 4976.336,
    "text": "Yeah.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4976.476,
    "end": 4980.238,
    "text": "And so we always have to sort of remember that",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4982.481,
    "end": 4983.581,
    "text": " Dog Walker just got here.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4985.102,
    "end": 4990.084,
    "text": "We always sort of have to remember that surprise means under a certain generative model.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4992.045,
    "end": 5003.949,
    "text": "And so the models that are present in free energy can involve sort of epistemic value, you know, what's it called?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5004.61,
    "end": 5008.491,
    "text": "Verisimilitude to the sensory world, accurate modeling.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5008.511,
    "end": 5010.712,
    "text": "They can also involve a reference trajectory.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5012.168,
    "end": 5018.014,
    "text": " And so they can involve both perception and action, and that's a really broad space of things.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5020.076,
    "end": 5022.498,
    "text": "Why are they doing that?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5023.059,
    "end": 5025.842,
    "text": "Minimize surprise doesn't mean avoid change.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5026.983,
    "end": 5034.811,
    "text": "It means optimize this information theoretic functional whose meaning is actually pretty strictly mathematical.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5038.228,
    "end": 5044.812,
    "text": " And is the outcome always to be autopoetic, so to make another nervous system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5047.054,
    "end": 5047.754,
    "text": "I mean, is it?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5048.895,
    "end": 5049.315,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5049.576,
    "end": 5052.237,
    "text": "That's what I'm wondering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5052.878,
    "end": 5054.619,
    "text": "I would think it usually is.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5055.98,
    "end": 5058.682,
    "text": "If you're making a copy maker, it probably isn't.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5061.334,
    "end": 5067.617,
    "text": " Like cotton makers, sometimes you have to disassemble them slightly to replace the parts or to clean them.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5068.218,
    "end": 5077.182,
    "text": "And so you don't necessarily want it to be self-organizing in the sense of trying to, what, like make another carafe when you take the carafe away to wash it?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5079.838,
    "end": 5096.29,
    "text": " But I think that if Ian's asking about autopoiesis, he's asking about, is this something, so you're making a distinction either between a living and a non-living system or between a living system and a tool that you've made to give it a certain input and give a certain output back, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5096.41,
    "end": 5108.259,
    "text": "So is, maybe just to repeat his question, and say for a living system then, do you think that some of the fundamental controlled variables here are autopoietic?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5111.949,
    "end": 5123.677,
    "text": " And there, I think I have to say I don't know, because I am not a biologist, and I haven't seen the full range of weird stuff that other organisms do.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5125.138,
    "end": 5135.445,
    "text": "And I want to be very, very cautious about the idea that we can sort of introspect, gather what we think are a few general principles of human behavior...",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5137.196,
    "end": 5142.878,
    "text": " And as introspections go, they may be pretty good ones and they may generalize pretty broadly.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5144.138,
    "end": 5150.72,
    "text": "And then expand that to the entire rest of the kingdom of living organisms, like the entire rest of the tree of life.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5152.001,
    "end": 5160.123,
    "text": "So just as an easy counterexample, there are insects that die when they mate.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5162.064,
    "end": 5165.005,
    "text": "This is an ordinary baked in part of their life cycle.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5166.751,
    "end": 5178.222,
    "text": " And, you know, if you want to talk about that as autopoiesis, then I think we have to, autopoiesis, then we have to ask, what is being self-organized, the parent or the child?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5179.083,
    "end": 5182.286,
    "text": "Because the parent empirically is being disorganized.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5186.791,
    "end": 5187.371,
    "text": "That's fair.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5187.471,
    "end": 5189.934,
    "text": "I mean, I'm sorry, Dean, you should go first.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5193.419,
    "end": 5198.704,
    "text": " I'm just as happy, but I'll just throw this in here because I don't know if Eli would describe it this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5198.844,
    "end": 5202.128,
    "text": "I'm certain he wouldn't, but I always like to introduce new ideas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5203.425,
    "end": 5226.823,
    "text": " I've always said that if we're talking about living math, now don't make me define that, if we're talking about living math, math that's alive, that's much, to me, more easily described as a leap of faith embedded within a step function rather than being provided the functional requirements as a case use and then building the algos to carry that through.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5227.932,
    "end": 5231.395,
    "text": " That's a very clear difference between the two things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5231.675,
    "end": 5238.42,
    "text": "One is a bridge, and the other is we all get in a bus, build a ramp, and then fly over the divide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5238.841,
    "end": 5248.729,
    "text": "And then if we're really good and we land it, we go back the other way and go wee, because we're still allostatically and homeostatically existing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5249.609,
    "end": 5255.094,
    "text": "But to your point, I think we have to be clear that those two things are quite different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5255.965,
    "end": 5258.247,
    "text": " One is alive and the other is not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5258.927,
    "end": 5262.65,
    "text": "And both require math, but not the same math.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5264.392,
    "end": 5274.56,
    "text": "And even among, I would actually caution, even among living systems, living involves metamorphosis.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5274.82,
    "end": 5277.402,
    "text": "It involves death at a certain point.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5278.363,
    "end": 5279.844,
    "text": "It involves reproduction.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5280.544,
    "end": 5282.066,
    "text": "It doesn't just involve death.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5282.887,
    "end": 5284.148,
    "text": " individual survival.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5285.149,
    "end": 5287.111,
    "text": "That is not how an ecosystem works.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5289.153,
    "end": 5289.893,
    "text": "No, for sure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5289.973,
    "end": 5298.081,
    "text": "And I think what I was just going to add was that I think from an autopoetic perspective, I don't think anyone would disagree with that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5298.321,
    "end": 5309.011,
    "text": "I think that what someone would say is that you need to think about from a perspective of reproducing the relationships that create an organism,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5310.236,
    "end": 5326.883,
    "text": " Reproduction in that process, right, could be a process of recreating the organism or recreating the structures that create that organism when there's components of it that couldn't be repaired without reconstructing the entire thing, basically, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5327.763,
    "end": 5337.047,
    "text": "So you'll have death, you'll have any one of these systems are going to have components of it that can't be repaired",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5340.472,
    "end": 5362.669,
    "text": " If parts of it can't be repaired, then a way of basically ensuring that that system continues to exist in the relationships that compose it is to reproduce and create a new system that has those relationships, but has the parts that are going to terminally fall into disrepair over a certain period of time start fresh so it can begin that cycle again, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5363.73,
    "end": 5368.334,
    "text": "Yeah, but I think that's actually an empirical claim about the evolution of aging, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5368.991,
    "end": 5380.76,
    "text": " which is that aging came first, you know, at say the single cell level and then reproduction follows to cope with that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5382.021,
    "end": 5385.783,
    "text": "And I don't know enough about the history of life to know whether that's true or not.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5388.846,
    "end": 5394.43,
    "text": "If I could connect this very interesting theme to Dean's",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5396.343,
    "end": 5406.129,
    "text": " bridges and ramps, which are two different engineering projects and have two different sets of structures to modify the niche with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5406.289,
    "end": 5418.936,
    "text": "And also Ian's original point about the epigenome and the exposome and taking ecological, developmental and evolutionary perspectives on human health.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5419.917,
    "end": 5425.32,
    "text": "So the process of epigenetic canalization",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5426.949,
    "end": 5435.794,
    "text": " and the way in which epigenetic variability can become entrenched through genomic changes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5436.415,
    "end": 5443.239,
    "text": "Like one protein that has a bi-functional aspect over evolutionary time",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5444.144,
    "end": 5473.744,
    "text": " when that region undergoes some chance duplication, that could allow those two tandem proteins to diverge in functions and sub-specialize, because there's a new capacity in the genome for the coding sequence to take on some of the responsibilities that had been taken by a protein modification or some other dual functionalization of the ancestral protein.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5474.424,
    "end": 5488.233,
    "text": " So the bridges are on the continuum towards modifying the environment, modifying the anatomy to embody the constraints of the environment, like the buoyancy of a fish.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5489.58,
    "end": 5508.082,
    "text": " something where the anatomy even without going into the morphological computation angle just the scale of the femur is such that it ends up being able to do plausible actions which gets you in the ballpark by being that kind of thing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5509.111,
    "end": 5533.511,
    "text": " then behavior takes us closer and closer to that person jumping off the plane that ian showed whether it's like one footstep which is many times a challenge for all kinds of various regions i mean it could be really anything and that's kind of the challenge of of movement",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5535.765,
    "end": 5553.649,
    "text": " to the social risk settings and people having different profiles or envelopes of their risk in different areas of being alone, of being with other people, all these different settings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5556.789,
    "end": 5563.491,
    "text": "But those are more ramp-like because in the end, especially when it's socially extended, you can't have the actual bodily",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5565.302,
    "end": 5590.874,
    "text": " can't embody the content of social variability but your your physical body can embody the content of being regularized with the abiotic niche but the brain can only be prepared in a way that you know is different from the body hope that kind of brought it back to that epigenetics",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5592.273,
    "end": 5610.94,
    "text": " angle because behavior is even more epi than epigenetics and so allostatic are changes that are faster than it so it makes sense to put it within a broader evolutionary perspective on how our priors got honed in to even this modality yeah",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5618.544,
    "end": 5625.409,
    "text": " Well, in our last 25 minutes or so, where do we go from dot two?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5629.992,
    "end": 5632.833,
    "text": "Either the researchers or Ian, wherever you feel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5634.354,
    "end": 5647.183,
    "text": "The point you made, Daniel, about evolutionary, you know, I didn't mention evolutionary biology specifically at the beginning, but for me, that seems like maybe a blind spot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5654.922,
    "end": 5677.299,
    "text": " I'm thinking also about Markov blankets and if gut microbiome influencing my neurotransmitters that I produce and do I include my gut microbiome",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5678.519,
    "end": 5680.441,
    "text": " in within my Markov blankets?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5680.581,
    "end": 5684.005,
    "text": "And if so, you know, what am I feeding my gut microbiome?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5684.786,
    "end": 5688.57,
    "text": "Do I include the food that I'm selecting within that Markov blanket?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5688.67,
    "end": 5691.893,
    "text": "And if so, do I include the fields that the food is growing in?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5693.715,
    "end": 5695.056,
    "text": " because that will affect the foods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5695.156,
    "end": 5700.12,
    "text": "And if so, do I include the microorganisms in the soil?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5700.14,
    "end": 5705.304,
    "text": "Because that affects how the food, and then that will affect the microbes in my gut, and that will affect me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5706.084,
    "end": 5707.545,
    "text": "And then do I look at the weather?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5709.046,
    "end": 5719.154,
    "text": "So, you know, it's more of a kind of communion of subjects rather than bound objects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5723.988,
    "end": 5724.988,
    "text": " But we have to start somewhere.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5730.571,
    "end": 5746.097,
    "text": "So as a bit of a jumping off from that, I think with all active inference work, there's always this incredibly important question, which is we can use the framework across so many different scales.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5747.421,
    "end": 5755.163,
    "text": " you know, I just had Maxwell Ramstead tell me that they derived a theorem that literally every physical system has a Markov blanket.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5756.083,
    "end": 5760.164,
    "text": "And then I asked him, well, how do you pick out the ones that we're interested in studying?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5762.244,
    "end": 5772.766,
    "text": "And he said, sort of, you know, basically he said, well, there isn't necessarily a theorem directing you to the most interesting, you know, or a metric that tells you which ones are interesting.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5773.567,
    "end": 5774.827,
    "text": "So that's still in the realm of",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5776.789,
    "end": 5779.67,
    "text": " just an investigator's choice.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5780.93,
    "end": 5794.695,
    "text": "And I think there we really have to figure out how to ask, when do we think we're going to get something interesting out of applying this framework to a given object of study or to a specific object of study?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5795.395,
    "end": 5802.518,
    "text": "And when do we think we'll be doing something sort of like re-deriving evolution",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5803.902,
    "end": 5824.979,
    "text": " where it's useful to do as a formal exercise, but to my knowledge, we haven't learned anything new about evolution from the free energy principle or active inference that we didn't know before, mainly because people had already described evolution in terms of inference prior to describing it in terms of active inference.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5831.431,
    "end": 5842.496,
    "text": " I think another thing that's useful to think about, and I've been thinking about this a lot lately, is in terms of what are some of the metaphors that we're using to scaffold the scientific questions that we're asking?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5843.856,
    "end": 5858.042,
    "text": "Because I think one of the things that... One of the things that's a big strength of this paper of Eli's, right, is that the title itself is actually a sequence of two metaphors, which is interoceptionist modeling allostasis as control.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5858.062,
    "end": 5859.443,
    "text": "And so I think...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5860.589,
    "end": 5878.035,
    "text": " There's a sense that if we have particular questions, if we set ourselves up to think, what's the sort of framework that we're using for thinking about the questions that are interesting or not, as Eli is saying, what are the systems that are interesting?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5879.635,
    "end": 5881.896,
    "text": "What sort of metaphor is a Markov blanket?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5881.916,
    "end": 5883.657,
    "text": "What sort of metaphor is active inference?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5884.317,
    "end": 5887.038,
    "text": "What are the sort of things that these are directing us to look at?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5887.879,
    "end": 5897.881,
    "text": " And does thinking of control in the way that this paper has been doing direct us in a different direction to think about things in like a slightly different way maybe?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5901.981,
    "end": 5903.302,
    "text": "Can I tag on that right away?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5903.502,
    "end": 5905.322,
    "text": "Can I get your response to this, Jordan?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5905.802,
    "end": 5916.404,
    "text": "So is the metaphor consistently, is one of the elements baked into the metaphor non-continuity, meaning whether we build a bridge over it or whether we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5917.376,
    "end": 5934.065,
    "text": " all leap across the creek hand in hand, and then the second time we do it, we all go wee because we did it twice and now we have some confirmation that we can do it, is the consistency within the metaphor, the non-continuity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5934.305,
    "end": 5945.872,
    "text": "I know we perceive it sometimes as being continuous and progressive, but are we talking, whether we're talking Markov blanket or whether we're talking anything that's gap",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5947.205,
    "end": 5951.166,
    "text": " respecting is not necessarily gap filling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5951.986,
    "end": 5954.807,
    "text": "That's my question to you, Jordan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5954.927,
    "end": 5955.467,
    "text": "What do you think?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5956.047,
    "end": 5963.108,
    "text": "I think it's more about the gap respecting than the constantly searching for something to jab and wedge in it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5963.829,
    "end": 5970.73,
    "text": "Because that space that Eli spoke to, that possibilities thing, that really matters in terms of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5972.722,
    "end": 5989.004,
    "text": " staying alive right it's not when you get out of the particulars max ramstead says there is no rule for that yet that's that's what you have to self-organize so what do you think i don't know i don't know how to answer that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5990.414,
    "end": 5997.317,
    "text": " I'm trying to familiarize people, but I guess... So then, Jordan, I think... You should go again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5997.337,
    "end": 6000.538,
    "text": "Do you want to prep what you're saying for a moment, and I'll give an answer to that?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6000.939,
    "end": 6002.399,
    "text": "For sure, or you just take over.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6004.6,
    "end": 6011.463,
    "text": "So I think the thing is that, at least in our lab, we are a physiologically focused affective science lab.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6012.444,
    "end": 6015.565,
    "text": "And so we sort of come to active inference with...",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6016.778,
    "end": 6020.98,
    "text": " a set of systems of interest and a set of phenomena of interest in mind already.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6023.842,
    "end": 6037.83,
    "text": "And that doesn't necessarily help other people pick out what they want, but it does indicate that you can bring what you want to, I think active inference ends up being a bit of a potluck field at a certain point.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6041.712,
    "end": 6042.552,
    "text": "That's a good answer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6042.572,
    "end": 6043.393,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6043.823,
    "end": 6044.063,
    "text": " Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6044.764,
    "end": 6051.611,
    "text": "One thought on that is the structure of a lab with a system or a question in mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6053.397,
    "end": 6081.846,
    "text": " is a epistemic framework that allows the investigators to actually take on bold new theoretical choices and explore different frameworks that are investigating a specified system of interest like we're studying blood pressure regulation in the context of professional dodgeball players or interoceptive awareness in intramural dodgeball players",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6083.328,
    "end": 6108.571,
    "text": " when there's already a project or a need specified in potentially even a variability retained setting, then the lab exists to funnel that into different kinds of analyses and scenarios that help address that system, like all of the labs studying different human diseases.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6110.126,
    "end": 6133.554,
    "text": " and sometimes, and with challenges and successes, making their work in the lab connect back to the real world and being able to take on new theoretical perspectives, some which might not initially appear to be helpful until years of basic research have occurred around some molecule or gene family",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6135.509,
    "end": 6144.137,
    "text": " So yeah, that's very interesting what Maxwell added and I think speaks a lot to many of the notions that we've been discussing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6145.618,
    "end": 6155.427,
    "text": "Like pushing at not having two realms in the Metabasian with a highly rule-based and then leaving the outer level where there is no strategy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6155.447,
    "end": 6161.173,
    "text": "We just accept the priors without having metacognition on that level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6164.127,
    "end": 6168.79,
    "text": " because that's just the limits of how far the model was extended out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6175.794,
    "end": 6178.776,
    "text": "Do either of you authors want to add anything about dodgeball?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6181.538,
    "end": 6182.198,
    "text": "Oh, yes.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6182.579,
    "end": 6186.361,
    "text": "Yes, I was going to tell everyone why it was dodgeball.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6189.763,
    "end": 6192.065,
    "text": "Essentially, in basketball...",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6193.669,
    "end": 6196.131,
    "text": " you have to shoot to the hoop.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6196.872,
    "end": 6201.675,
    "text": "So you throw, the ball goes, it either goes into the hoop or it misses.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6202.216,
    "end": 6205.859,
    "text": "If you're passing, you know, the person either catches or you missed.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6207.0,
    "end": 6210.763,
    "text": "In dodgeball, the ball is coming at you.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6212.184,
    "end": 6218.409,
    "text": "And so the idea here is that you're picturing yourself trying to dodge and this lets us sort of",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6219.961,
    "end": 6227.928,
    "text": " merge the intuitions about predictive processing and control where the reference signal is to avoid contact with the ball.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6229.47,
    "end": 6235.395,
    "text": "So therefore, the stimulus becomes both a prediction error and an actual control error.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6238.218,
    "end": 6241.581,
    "text": "So in life, you're always playing dodgeball with something.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6244.369,
    "end": 6248.712,
    "text": " I mean, if you walk out into the middle of a traffic, yes.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6253.435,
    "end": 6262.941,
    "text": "There's always some obscure possibility of being hit by a rock out of nowhere, but hopefully most of the time in life you're not actually playing dodgeball with something.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6264.161,
    "end": 6268.023,
    "text": " Well, there's always something that can disrupt you, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6268.843,
    "end": 6269.203,
    "text": "Yeah.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6269.243,
    "end": 6273.185,
    "text": "There's always, you have a system, it can be disrupted in many ways.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6273.545,
    "end": 6277.967,
    "text": "I'm just picking on it because I think, again, it's about metaphors, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6278.027,
    "end": 6283.069,
    "text": "And I think when you're talking about basketball, you're talking about having a goal.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6283.99,
    "end": 6293.634,
    "text": "You're talking about having some sort of externally defined goal that you're trying to perform actions to satisfy, and then you tally up the score in some way of it, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6294.67,
    "end": 6298.153,
    "text": " Versus in dodgeball, you can get hit and you're out.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6299.034,
    "end": 6305.64,
    "text": "And the same thing is true of your physiological systems can get disrupted and you're out, you're dead, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6307.702,
    "end": 6317.531,
    "text": "Yeah, but I guess my intuition is that in dodgeball, the ball is coming for you in a way that most of the time it isn't physiologically.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6318.251,
    "end": 6318.832,
    "text": "No, that's true.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6319.437,
    "end": 6321.579,
    "text": " Metaphors aren't perfect, but I'm just saying that, yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6321.599,
    "end": 6323.56,
    "text": "The theology is not adversarial.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6324.161,
    "end": 6324.621,
    "text": "No, no, no.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6325.802,
    "end": 6327.864,
    "text": "But there's... Oh, no, sorry.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6327.904,
    "end": 6328.444,
    "text": "Go ahead.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6328.464,
    "end": 6333.968,
    "text": "Just remind me, each sport provides kind of a different metaphor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6334.188,
    "end": 6336.81,
    "text": "None of them total or, of course, exact.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6337.451,
    "end": 6340.173,
    "text": "But there's games where you're avoiding the ball.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6340.833,
    "end": 6345.517,
    "text": "There's games where you have to hit an inanimate object and then it bounces off, like wall ball.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6346.438,
    "end": 6348.519,
    "text": "There's games with implements, without implements.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6349.44,
    "end": 6372.706,
    "text": " there's uh marathoning there's sprinting there's throwing things then there's just one two three eleven all numbers of different players on ice as dean knows and each of these settings have their interoceptive challenges and social included in that model dean",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6373.439,
    "end": 6381.305,
    "text": " Yeah, I was just going to say the metaphor, you can have a lattice of rope that makes you a bridge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6382.225,
    "end": 6385.068,
    "text": "And you can have a lattice of rope that makes you a fishing net.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6385.748,
    "end": 6389.251,
    "text": "One captures, one allows you to cross.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6389.691,
    "end": 6391.953,
    "text": "One is in between, one is enveloping.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6392.433,
    "end": 6394.254,
    "text": "And I think that's why we use metaphors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6394.314,
    "end": 6395.996,
    "text": "But the point that I would make is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6397.02,
    "end": 6400.441,
    "text": " when you mesh something, you still have those gaps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6401.022,
    "end": 6405.703,
    "text": "And I think it's important to see the non-continuity in this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6405.743,
    "end": 6414.366,
    "text": "I think that's where the math, the theoretical, the ability to bring it down to that level, if it's not only one,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6416.522,
    "end": 6427.007,
    "text": " If it's not perceived as only being one math, if there are maths involved, I think you create the conditions around which better understanding can move forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6427.048,
    "end": 6434.571,
    "text": "Now to Jordan's point, it takes longer if you don't have the proper gauge of mesh to catch the smaller fish.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6435.232,
    "end": 6437.593,
    "text": "And that's what I think what Maxwell was speaking to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6438.173,
    "end": 6442.376,
    "text": "It's up to you to decide whether you're catching guppies or tuna.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6442.996,
    "end": 6443.256,
    "text": "Mm-hmm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6447.861,
    "end": 6449.582,
    "text": " There's your metaphor for the day, guys.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6452.883,
    "end": 6472.949,
    "text": "One short thought is a zero to one, which is a boundary we can talk about in the future, is when the entire or large subsets of the active inference ontology, and frankly, just the use of statistical modeling, these kinds of transformations are not",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6474.796,
    "end": 6477.457,
    "text": " 2022 Sinesh et al.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6477.678,
    "end": 6480.459,
    "text": "inventions with respect to control processes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6482.66,
    "end": 6492.445,
    "text": "Once one undertakes the statistics toolkit, they enable new visibilities into what was already latent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6492.645,
    "end": 6495.487,
    "text": "Every time somebody had shown something in terms of a CDF,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6496.431,
    "end": 6502.579,
    "text": " They didn't always show this, but this is also taking logs of variables and interchanging CDF and PDF.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6502.96,
    "end": 6506.424,
    "text": "Some of these atomic units already exist,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6507.598,
    "end": 6534.766,
    "text": " And this paper does an incredible job of putting the setting of interoception and the function of allostasis into the intersecting legacies of control theory and cybernetic approaches, as well as more recent developing threads, many of which don't have a formal basis initially",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6535.726,
    "end": 6561.859,
    "text": " like ecological psychology and affective modeling and so bringing those two areas together is kind of that psychologist engineer conversation that was brought up and that's like the dodgeball game now are they throwing if they hit each other do they knock each other out or are they sending each other you know and as we explored initially it's not clear",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6563.382,
    "end": 6569.305,
    "text": " And in that uncertainty in the beginning of the exchange, it's not like the dodgeballs are particles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6569.345,
    "end": 6570.346,
    "text": "They're more like waves.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6575.269,
    "end": 6582.313,
    "text": "What will Jordan and Eli, your host paper directions be?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6582.613,
    "end": 6585.915,
    "text": "Or how long are you going to be continuing or what directions here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6588.496,
    "end": 6591.058,
    "text": "Jordan, I think you should tell them about our lab meeting next week.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6593.288,
    "end": 6594.269,
    "text": " Oh, yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6594.589,
    "end": 6601.314,
    "text": "We're covering... So I think one of the things is we've talked about controlling variables here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6602.235,
    "end": 6610.321,
    "text": "We were interested in, or I'm interested at least, in thinking about other control perspectives.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6610.661,
    "end": 6615.645,
    "text": "There's a perspective perceptual control theory to think about whether the...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6620.66,
    "end": 6629.647,
    "text": " that basically the behavior is a means of controlling inputs or controlling sensory inputs to a system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6630.688,
    "end": 6639.075,
    "text": "But more specifically, I'm interested in thinking about how we can apply control systems thinking to neuroscience more generally.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6639.315,
    "end": 6645.861,
    "text": "So I think people are very used to taking an fMRI image, for example, bold imaging,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6646.798,
    "end": 6651.823,
    "text": " and then treating it as an input-output system where they deliver some sort of stimuli to the brain.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6652.483,
    "end": 6665.756,
    "text": "They'll observe some output, which will be a bold response in some region, and then they'll interpret that as causal, that they deliver stimuli, they see an effect in the brain, and they've identified some cause-effect relationship.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6665.816,
    "end": 6666.657,
    "text": "And the problem is that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6668.305,
    "end": 6670.786,
    "text": " People have been doing that for 20, 30 years now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6671.206,
    "end": 6676.628,
    "text": "You have a million different strands of these supposed cause effect relationships, and you don't have a whole lot to structure them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6677.268,
    "end": 6690.412,
    "text": "And a different way to think about it is that the brain is a negative feedback controlled system that's trying to regulate some homeostatic variables within it or allostatic when we consider them in the context that we're doing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6690.432,
    "end": 6694.454,
    "text": "And so if we deliver some sort of stimulation to the brain,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6695.407,
    "end": 6697.728,
    "text": " We're basically perturbing sensory input to it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6698.029,
    "end": 6706.834,
    "text": "And then we're seeing some perceptual response or we're seeing some restabilization within the brain to bring it back to homeostasis within a region.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6709.155,
    "end": 6710.496,
    "text": "And we're not really...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6711.775,
    "end": 6715.877,
    "text": " getting at causal relationships, we're looking at control systems that are being perturbed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6715.977,
    "end": 6728.402,
    "text": "So that's coming off of a chapter that was by Henry Yin called The Crisis in Neuroscience, which there's also a really great brain-inspired podcast episode about that too, which is worth checking out.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6731.843,
    "end": 6737.285,
    "text": "And Eli, you have some ideas too to follow up to think about control and affect, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6738.345,
    "end": 6739.106,
    "text": "Yeah, so...",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6741.817,
    "end": 6749.621,
    "text": " To start with that, I would sort of make a small amendment to the notion of a negative feedback control system.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6751.562,
    "end": 6753.283,
    "text": "Jordan, can you catch the podcast link?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6753.803,
    "end": 6754.144,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6754.264,
    "end": 6755.344,
    "text": "Sorry, just because I could.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6756.085,
    "end": 6757.265,
    "text": "Oh, no, I've got it.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6758.886,
    "end": 6766.57,
    "text": "And say, you know, maybe we should be thinking about nervous systems as mixed feedback control systems, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6767.159,
    "end": 6776.226,
    "text": " So sometimes you need to stabilize a state of sensitivity to the environment rather than resilience against the environment.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6776.386,
    "end": 6778.307,
    "text": "And that would involve positive feedback.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6779.708,
    "end": 6796.04,
    "text": "And that's sort of where I get into thinking about affect is that, you know, if you say that there's sort of these two modes of control, positive feedback, stabilized control for states that are very sensitive to the environment and then negative feedback,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6797.421,
    "end": 6802.745,
    "text": " purely negative feedback, really it's positive feedback in the service of negative feedback over the long run.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6803.666,
    "end": 6814.094,
    "text": "And then purely negative feedback states that are trying to be insensitive to the environment and you have failure and success for either of them.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6815.375,
    "end": 6820.499,
    "text": "And all of a sudden it sort of starts to look and you can structure the feedback loops in different ways.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6820.599,
    "end": 6827.104,
    "text": "It starts to look more like some of the core properties of affect that jump out in our data.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6828.74,
    "end": 6837.967,
    "text": " And sorry, that's a very hand-wavy explanation, and it's because we really don't have... I don't have this in the form of more than a few notes on my iPad.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6840.468,
    "end": 6844.771,
    "text": "But there's... Should I link the other Brain Inspired episode that got you thinking about that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6844.871,
    "end": 6845.992,
    "text": "Yes.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6846.032,
    "end": 6855.359,
    "text": "That one's good enough that I included a quote from it in... I think in my slides from here that we had.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6855.379,
    "end": 6858.101,
    "text": "It's the Rudolph...",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6859.443,
    "end": 6861.124,
    "text": " Sepulchre quote, yes.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6862.245,
    "end": 6865.428,
    "text": "Control is to engineering what philosophy is to the humanities.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6869.591,
    "end": 6869.791,
    "text": "Wow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6871.232,
    "end": 6871.412,
    "text": "Wow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6871.813,
    "end": 6873.274,
    "text": "Very interesting directions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6874.194,
    "end": 6878.758,
    "text": "Ian and Dean, what are your next research and education directions?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6884.422,
    "end": 6884.983,
    "text": "I'll go first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6885.003,
    "end": 6885.964,
    "text": "I'm going to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6887.307,
    "end": 6889.468,
    "text": " listen to those podcasts is my next steps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6889.869,
    "end": 6901.675,
    "text": "And, um, I've just really enjoyed this conversation and, um, what I think you're all, all trying to achieve is amazing stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6901.736,
    "end": 6905.458,
    "text": "And it's whether it's whether, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6906.798,
    "end": 6924.169,
    "text": " studying humans is going to help us make better AI on robotics or whether attempting to make better, you know, engineer better machines is going to help us understand humans or whether, you know, we're going to, as you said, Jordan bounce off each other and improve our understanding both ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6924.229,
    "end": 6926.291,
    "text": "I think it's, it's a good thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6929.153,
    "end": 6929.573,
    "text": "Over to Dean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6930.882,
    "end": 6931.783,
    "text": " Thanks, Ian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6932.063,
    "end": 6932.704,
    "text": "Thank you, Ian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6932.784,
    "end": 6933.525,
    "text": "Thank you, Eli.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6933.605,
    "end": 6934.305,
    "text": "Thank you, Jordan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6935.166,
    "end": 6936.207,
    "text": "Always thank you, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6936.768,
    "end": 6946.398,
    "text": "I think the last two, and I want to thank Dave Douglas, although he's not on a tile today as well because he was there for the dot one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6949.14,
    "end": 6952.783,
    "text": " It's really rewarding when you can actually have a conversation with people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6952.803,
    "end": 6956.105,
    "text": "Like, I mean, normally it's throw out the dodge balls.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6956.165,
    "end": 6964.99,
    "text": "And then if you had this conversation in that space, you know, it would basically be yelled out of the gym so they could get on with the game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6965.311,
    "end": 6969.974,
    "text": "And then there's these people that would actually want to figure out, well, what's really going on here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6969.994,
    "end": 6975.958,
    "text": "You know, besides the person that leaves and has to get the ice pack because they got hit in the head or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6976.678,
    "end": 7001.027,
    "text": " And I think the idea that a bunch of individuals can sit down and have one of these perspective swap sessions, because they're all really good translators in their particular area of focus, really, it kind of changes the idea around what we've been doing and we're trying to do in Active Inference, which is, you know, create a bigger tent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7002.045,
    "end": 7014.551,
    "text": " create a sense that people with different backgrounds don't have to feel strange because they don't, well, I don't know as much about active inference as Max Ram's did, so I'm going to spend 10,000 hours to have a conversation about this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7015.291,
    "end": 7016.392,
    "text": "That's not what we're about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7016.432,
    "end": 7022.995,
    "text": "What we're trying to do is pull a bunch of people into the room and let them translate together, swap those perspectives,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7023.935,
    "end": 7051.749,
    "text": " actually go away as Ian said I mean I'm going to go away now and figure out what why really why does this laser idea work not just sort of in a hypothesis in my brain but really go away and think about that for a bit and I think if we can do that more um in a you know semi-formal way you still have to cover the content and you still need to get the contextual background but to get to this place where we are today Jordan to your point it takes time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7052.162,
    "end": 7055.923,
    "text": " But man, the rewards and the payoffs, it's just huge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7055.963,
    "end": 7061.226,
    "text": "And again, Daniel, all the work that he puts into doing this, it's just, it's awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7061.426,
    "end": 7062.166,
    "text": "So thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7064.507,
    "end": 7064.907,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7066.708,
    "end": 7067.168,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7067.188,
    "end": 7068.148,
    "text": "This is really fun.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7068.728,
    "end": 7070.149,
    "text": "Yeah, great conversation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7070.389,
    "end": 7071.53,
    "text": "So really appreciate it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7071.85,
    "end": 7072.53,
    "text": "Also, as always.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7073.578,
    "end": 7080.585,
    "text": " All right, till the dot three, anytime you or anyone else want to continue or present any other time, always welcome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7081.145,
    "end": 7082.046,
    "text": "So farewell.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7083.388,
    "end": 7084.048,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 7084.489,
    "end": 7084.729,
    "text": "Bye.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7084.969,
    "end": 7085.329,
    "text": "Awesome.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7085.389,
    "end": 7085.65,
    "text": "Thanks.",
    "speaker": "SPEAKER_05"
  }
]