[
  {
    "start": 28.257,
    "end": 31.638,
    "text": " All right, welcome to ACT-INF livestream number 50.0.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.818,
    "end": 41.141,
    "text": "It is October 17th, 2022, and we are starting the series on Interoception as Modeling Allostasis as Control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 42.301,
    "end": 44.061,
    "text": "Welcome to the Active Inference Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 44.682,
    "end": 50.483,
    "text": "We're a participatory online institute that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 51.423,
    "end": 56.305,
    "text": "This is recorded in an archived livestream, so please provide us with feedback so we can improve our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 57.304,
    "end": 62.153,
    "text": " All backgrounds and perspectives are welcome and will be following good video etiquette for live streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 63.857,
    "end": 71.663,
    "text": " Today in 50.0, we're starting this series discussing the paper, Interoception as Modeling, Allostasis as Control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 72.404,
    "end": 81.21,
    "text": "The authors are Eli Sinesh, Jordan Theriot, Dana Brooks, John Wilhelm van de Meent, Lisa Feldman Barrett, and Karen S. Quigley.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 82.131,
    "end": 86.775,
    "text": "It is a paper published in the journal Biological Psychology in January of 2022.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 88.696,
    "end": 94.325,
    "text": " And this is just an introduction and context video as Dean here and I",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 95.598,
    "end": 98.419,
    "text": " work through this paper and discuss some related topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 99.499,
    "end": 119.045,
    "text": "We're going to go over some big questions, basic aims and abstract roadmap of the paper, then go into the paper, touch on a few key points and images and themes, and then primarily look forward to discussing it with any authors or anyone else who'd like to join in the coming weeks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 120.094,
    "end": 121.575,
    "text": " All right, so I'm Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 121.795,
    "end": 128.161,
    "text": "I'm a researcher in California, and the paper was selected by Decentralized Upvote.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 129.301,
    "end": 136.167,
    "text": "It was fun to read, and it brings some new topics into our regime of attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 136.948,
    "end": 139.27,
    "text": "So I'm looking forward to this, and I'll pass to Dean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 140.611,
    "end": 141.091,
    "text": "Thanks, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 141.131,
    "end": 141.792,
    "text": "I'm Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 141.812,
    "end": 142.912,
    "text": "I'm here in Calgary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 144.254,
    "end": 149.718,
    "text": "I think what's interesting about any paper that pulls too seemingly discreet information",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 150.472,
    "end": 162.681,
    "text": " things and puts them proximal and gets them entangling and then pulls them apart again and tries to look at sort of what happens when things get combined is always something that I'm always",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 163.129,
    "end": 186.404,
    "text": " interested in that in fact it was the title of this and the fact that they were bringing allostasis and interoception together and what does that mean was the reason why i spent a little bit of time on this and really am quite interested in hearing what the authors have to say now that they put this idea to to work all right how would you describe the big question",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 189.286,
    "end": 200.014,
    "text": " Well, I mean, I think the focus here is on what happens and what we can say about control requirements necessary to carry out physiological tasks, varying degrees of complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 202.876,
    "end": 212.923,
    "text": "I've never been really sure how the specificity of different outcomes and behaviors looks in aggregate, but I think one of the things that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 213.567,
    "end": 227.013,
    "text": " we can say is if there's a predictive component and there's a feedback component, and they're focusing on two particular types of that, it's interesting perhaps what kind of generalities we can walk away with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 229.154,
    "end": 234.556,
    "text": "Never, you know, sort of not getting lost in the weeds of, well, this happened here and then that happened there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 234.576,
    "end": 240.959,
    "text": "But just on that general level, what sorts of things, when those two things are put together, should we say,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 241.854,
    "end": 244.136,
    "text": " has a certain pattern or commonality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 246.017,
    "end": 247.118,
    "text": "Nice, I agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 247.138,
    "end": 260.768,
    "text": "I would put it in the category of asking how a given system-independent or modality-independent phenomena like allostasis, which is anticipatory changes in physiology,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 261.688,
    "end": 265.069,
    "text": " connects with a domain or a use case like interoception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 265.769,
    "end": 273.351,
    "text": "And it does seem like a lot of the models that we've explored have been visual or conceptual or symbolic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 274.532,
    "end": 280.113,
    "text": "And the interoceptive modality has popped up again and again in discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 280.313,
    "end": 285.835,
    "text": "And so this is a cool opportunity to look at some formalisms for interoception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 288.504,
    "end": 314.204,
    "text": " okay here's the paper uh as described earlier just a few of the highlights that were written by the authors on the publication page interoception enables the brain to anticipate the body's upcoming metabolic needs interoception provides performance metrics for viscera motor regulation we connect control theory with decision making and motor control of the body",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 315.458,
    "end": 321.802,
    "text": " We model allostatic control as optimal control with the time-varying reference signal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 322.783,
    "end": 336.833,
    "text": "They talk about some limitations of previous models and some unique aspects of what their model does and the way that they formulate the APIC model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 338.834,
    "end": 339.375,
    "text": "Anything to add?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 341.196,
    "end": 342.457,
    "text": "No, I think their answer is straightforward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 344.048,
    "end": 344.989,
    "text": " Okay, on claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 345.069,
    "end": 357.98,
    "text": "So Dean and I were looking into thinking of ourselves in terms of claims adjusters, appraisers, examiners, and investigators.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 360.114,
    "end": 388.491,
    "text": " as we pulled out a whole handful of really important and salient within the argument of this relatively long and technically scaffolded paper and pulling out a bunch of claims that are written that connect the dots and set some of the relevant interpretations for the formalisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 390.094,
    "end": 395.198,
    "text": " Do you want to highlight any of them or it's fine to just have them for anyone who wants to?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 395.298,
    "end": 399.081,
    "text": "Yeah, I'm not going to read anything off of this, but I will say this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 400.902,
    "end": 409.108,
    "text": "There is, I think, a parallel trying to be drawn here between predictive processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 409.889,
    "end": 418.756,
    "text": "I'm not saying that predictive processing, but processing as a predictive device and feelings and control",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 419.474,
    "end": 420.114,
    "text": " and feedback.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 420.314,
    "end": 424.537,
    "text": "And so I think there are a lot of claims that can be made.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 425.377,
    "end": 434.021,
    "text": "But that's a really, really nuanced and also very, very complex space to play in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 434.421,
    "end": 438.003,
    "text": "And so I can understand why there's lots and lots of claims.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 439.644,
    "end": 445.867,
    "text": "Again, whether or not or how far those claims can hold before they break down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 446.687,
    "end": 449.59,
    "text": " will be an interesting thing to talk to with the authors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 451.693,
    "end": 452.814,
    "text": "Yeah, well said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 453.415,
    "end": 455.197,
    "text": "It's a very intertwined area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 455.457,
    "end": 458.521,
    "text": "Maybe that's what you're pointing towards when you say it's complex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 459.182,
    "end": 459.602,
    "text": "Braiding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 460.423,
    "end": 460.824,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 460.944,
    "end": 463.807,
    "text": "I've got a lot of hair, so it's tricky for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 465.049,
    "end": 465.329,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 466.45,
    "end": 466.671,
    "text": "Abstract?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 466.691,
    "end": 466.871,
    "text": "Abstract?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 468.49,
    "end": 470.571,
    "text": " Okay, I'll read the first three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 471.631,
    "end": 478.754,
    "text": "The brain regulates the body by anticipating its needs and attempting to meet them before they arise, a process called allostasis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 479.854,
    "end": 486.217,
    "text": "Allostasis requires a model of the changing sensory conditions within the body, a process called interoception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 486.897,
    "end": 492.199,
    "text": "In this paper, we examine how interoception may provide performance feedback for allostasis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 493.223,
    "end": 503.269,
    "text": " We suggest studying allostasis in terms of control theory, reviewing control theory's applications to related issues in physiology, motor control, and decision making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 504.85,
    "end": 511.213,
    "text": "We synthesize these by relating them to the important properties of allostatic regulation as a control problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 511.894,
    "end": 515.556,
    "text": "We then sketch a novel formalism for how the brain might perform allostatic control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 516.354,
    "end": 527.57,
    "text": " of the viscera by analogy to skeletal motor control, including a mathematical view on how interoception acts as a performance feedback for allostasis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 527.87,
    "end": 531.876,
    "text": "Finally, we suggest ways to test implications of our hypothesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 534.224,
    "end": 535.825,
    "text": " Okay, onto the roadmap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 536.605,
    "end": 559.755,
    "text": "The paper starts with introduction, the functions of the brain in the body, and then introduces some of the key pillars or foundations of their synthesis and interpretation, which is interoception, control theory as an approach for unifying physiology, motor control, decision-making,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 560.916,
    "end": 588.986,
    "text": " and allostasis as a trajectory tracking stochastic optimal control the fifth section is a discussion and then there's an appendix b and c and in their words four sections in this paper connect interoception to allostasis section two establishes how interoception enables the brain to estimate the physiological efficiency of the body in the present moment which is precisely what it needs to know to evaluate and refine action",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 590.066,
    "end": 591.687,
    "text": " Section 3 introduces control theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 592.328,
    "end": 603.976,
    "text": "Section 4 applies the principles of control theory to derive a novel format model of how the brain might estimate the desirability of physiological trajectories and make prospective regulatory decisions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 604.697,
    "end": 611.582,
    "text": "Finally, Section 5 synthesizes the previous three sections to explore the direct implications of the proposed formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 612.322,
    "end": 617.806,
    "text": "Appendix A provides a glossary of terms, but this is moved up and it's no longer an appendix, so there's no Appendix A.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 618.737,
    "end": 626.56,
    "text": " Appendix B1 provides mathematical details related to Section 3, and Appendix C1 provides mathematical details related to Section 4.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 630.421,
    "end": 635.463,
    "text": "The keywords were interoception, allostasis, and predictive processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 636.344,
    "end": 639.465,
    "text": "We're going to talk a lot about interoception and allostasis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 640.669,
    "end": 644.251,
    "text": " somewhat in this dot zero, but certainly in the coming discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 644.791,
    "end": 651.335,
    "text": "And for predictive processing, a good recent stream is live stream number 43 with Maria.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 654.775,
    "end": 661.399,
    "text": " Okay, also just for reference, we'll pause on these just long enough for you to screenshot them if you want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 662.259,
    "end": 666.482,
    "text": "There's a nomenclature table with the definition of many words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 666.982,
    "end": 670.484,
    "text": "So here's the first nomenclature terms, 1 through 25.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 670.624,
    "end": 676.207,
    "text": "And then here's the second half of the nomenclature, 26 to 49.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 676.648,
    "end": 677.548,
    "text": "Sorted alphabetically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 685.171,
    "end": 693.378,
    "text": " Anything to add on the nomenclature other than to say that it's good that they provided it and it'll be used in the coming sections?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 695.239,
    "end": 703.406,
    "text": "Well, I think it's interesting that you pointed out that they pulled the definitions forward and then they look at the formalisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 704.327,
    "end": 714.455,
    "text": "And so I think from the standpoint of what they want to message around this braiding requires us to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 715.177,
    "end": 724.803,
    "text": " at least get a common sense around what things mean before we start trying to pull apart what they equal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 726.324,
    "end": 729.426,
    "text": "So yeah, I kind of like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 730.146,
    "end": 730.566,
    "text": "Well said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 730.586,
    "end": 732.007,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 732.167,
    "end": 735.669,
    "text": "Section one, introduction, the functions of the brain in the body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 736.57,
    "end": 736.89,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 738.491,
    "end": 741.593,
    "text": "There's an evocative beginning to this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 743.415,
    "end": 749.437,
    "text": " Playing a simple game of dodgeball then requires your brain to continually coordinate the systems of your body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 750.778,
    "end": 756.46,
    "text": "And this motif of dodgeball is going to be returning again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 757.441,
    "end": 764.223,
    "text": "And on the left is a hugging face implementation of a stable diffusion algorithm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 764.963,
    "end": 771.046,
    "text": "The prompt of the image was dodgeball, playful ants, active inference, free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 772.006,
    "end": 784.551,
    "text": " And while we were making the slides, we were engaged in active inference with some of these image generating affordances and allowing that to do what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 786.872,
    "end": 797.396,
    "text": "Well, I think it's really interesting that this, what the generator said, this would be the result of a coordinated, what's the word I'm looking for?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 798.517,
    "end": 800.418,
    "text": "Entanglement of these prompts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 801.874,
    "end": 808.178,
    "text": " But it doesn't talk anything about what strategy each one of those silhouettes is now employing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 809.099,
    "end": 814.743,
    "text": "And I think that there is an implied sense that there's a strategy going on as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 814.903,
    "end": 826.431,
    "text": "So again, when you bring some of these really interesting things together, I guess it depends on how deep you want to go, how much you want to dimensionalize the space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 828.504,
    "end": 829.704,
    "text": " What is that right there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 829.724,
    "end": 829.965,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 830.245,
    "end": 831.305,
    "text": "This is the same prompt.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 831.365,
    "end": 832.285,
    "text": "This was just another one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 832.705,
    "end": 839.928,
    "text": "This one's a little more photorealistic, a little bit more elusive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 840.108,
    "end": 841.188,
    "text": "Are they playing dodgeball?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 841.949,
    "end": 842.189,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 843.469,
    "end": 845.13,
    "text": "Or are they just inferring?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 847.25,
    "end": 847.551,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 848.291,
    "end": 848.871,
    "text": "Next keyword.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 849.291,
    "end": 850.732,
    "text": "You can go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 850.832,
    "end": 853.433,
    "text": "People can read the definition here, but just give your own take.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 853.533,
    "end": 854.433,
    "text": "What is interoception?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 856.249,
    "end": 870.859,
    "text": " Well, I think at the end of the day, there's, there's a certain amount of signaling signaling going on that we become aware of sometimes young people or all people might sort of categorize them all under the umbrella of feelings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 871.78,
    "end": 872.36,
    "text": "And, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 873.268,
    "end": 880.63,
    "text": " I grabbed this from Tots on Target just because I always worked in that kind of space of how do we keep this as simple as we can?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 881.39,
    "end": 901.374,
    "text": "And so when you get these signals, these sensory signals originating from within the body, these are the feelings you get and whether or not you connect them to the world outside of your skin or your margins, sometimes you do and sometimes you don't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 901.872,
    "end": 904.215,
    "text": " You don't, you just wake up with a tummy ache, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 904.416,
    "end": 907.019,
    "text": "So what does that mean about today?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 909.202,
    "end": 909.443,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 910.583,
    "end": 926.872,
    "text": " I would say a little narrowly, interoception is referring to some observation and inference on hidden states with a referent that's in tarot inside of the body, as opposed to extero outside of the body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 927.273,
    "end": 931.055,
    "text": "But there's probably also a lot of like blurring and what is the retina really doing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 931.415,
    "end": 932.896,
    "text": "Is it doing inference on itself?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 933.636,
    "end": 939.159,
    "text": "And where is it actually doing inference on the outside world structure?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 940.16,
    "end": 940.44,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 940.58,
    "end": 942.001,
    "text": "Interoceptive internal models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 942.201,
    "end": 943.321,
    "text": "You added some images.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 943.361,
    "end": 943.941,
    "text": "So what are they?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 945.422,
    "end": 945.822,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 945.842,
    "end": 947.862,
    "text": "So I'll just read this real quick.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 947.882,
    "end": 951.983,
    "text": "So psychologists refer to the internal model, including interoception, by many terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 952.063,
    "end": 960.486,
    "text": "And I think that's important because there hasn't always been agreement about clearly defining what an internal model is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 962.026,
    "end": 964.727,
    "text": "Things like unconscious inference seems to fit under this umbrella.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 965.14,
    "end": 972.143,
    "text": " embodied simulation concepts and categories, controlled hallucination, which was new to me because I don't know what that even means.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 973.243,
    "end": 979.145,
    "text": "And regardless of what it's called, the brain is hypothesized to construct a dynamic model of its body in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 979.205,
    "end": 982.687,
    "text": "In this paper, we use the terms prediction, simulation, and concept.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 983.027,
    "end": 994.371,
    "text": "And so for somebody with sort of my deep research background in terms of abduction, the signal, the interpreted, the object,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 995.803,
    "end": 996.824,
    "text": " What is that model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 997.464,
    "end": 1007.068,
    "text": "How do we avoid getting into another great debate about whether that's representational and content-filled or not?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1007.468,
    "end": 1019.854,
    "text": "Or is there something that we sense from the inside every single time data is coming at us and being poured out?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1020.76,
    "end": 1026.961,
    "text": " onto our different sensory surfaces, exterior, exterior, from the outside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1028.182,
    "end": 1030.502,
    "text": "I think that there's a piece that comes from the outside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1030.542,
    "end": 1036.484,
    "text": "I know when the temperature goes up in the room, but my temperature might also be going up because I ate a bad shrimp.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1037.164,
    "end": 1047.186,
    "text": "And it's sometimes difficult to figure out whether or not it's because the heat gone up or whether my body's responding with an inflammatory gesture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1048.847,
    "end": 1050.047,
    "text": "Yeah, that's a,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1051.553,
    "end": 1056.516,
    "text": " Nice point, like sometimes called a difference-making cause or a difference that makes a difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1057.196,
    "end": 1060.418,
    "text": "Does a viral infection cause the body temperature to rise?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1061.459,
    "end": 1069.803,
    "text": "And or to what extent can that be decomposed into factors from the virus versus the dynamics changing of the immune system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1071.284,
    "end": 1072.645,
    "text": "So interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1072.665,
    "end": 1075.026,
    "text": "Yeah, I don't know if the image on the left knows.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1076.267,
    "end": 1078.168,
    "text": "I can't tell whether the image on the left",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1079.332,
    "end": 1085.013,
    "text": " by the image on the left, what speed the image on the right is actually moving down the road.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1085.733,
    "end": 1102.036,
    "text": "And that's kind of why I wanted the ambiguity there for an interoceptive model, because, you know, Damasio talks a lot about what can we really describe in precise terms and what remains somewhat ambiguous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1102.096,
    "end": 1104.917,
    "text": "And the authors in this paper talk a little bit about that as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1105.626,
    "end": 1134.121,
    "text": " yeah when the referent is external it's objective then there's the opportunity for multiple external perspectives to align not even saying that's better but just the opportunity to whereas if the embodied behavior of your physiological set point for some physiological regulation is changed it doesn't have the same opportunity for external alignment again for better and for worse",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1135.276,
    "end": 1138.073,
    "text": " and almost always with difficulty,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1139.164,
    "end": 1165.676,
    "text": " communicating or sometimes measuring in laboratory settings as well and quote controlling so speaking with uh authors on this and why they study this modality will be interesting all right as for the computational or system independent phenomena that they're going to be trying to integrate with alice uh with in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1166.616,
    "end": 1194.986,
    "text": " terraception is allostasis they define this term as allostasis is to anticipate changing needs evaluate priorities and prepare the organism to satisfy them before they lead to errors a process called allostasis so let's just say that you have an allostatic model of the temperature in the room and the core body temperature doesn't change so then can one look back and say it didn't change because it was expected to change",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1196.038,
    "end": 1198.34,
    "text": " And somebody will just say, well, how do you know it worked then?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1198.46,
    "end": 1200.662,
    "text": "Because it didn't raise the body temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1203.584,
    "end": 1207.627,
    "text": "I focused on the part that the fact that they describe it as a three-part process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1208.448,
    "end": 1214.693,
    "text": "So me being always talking about what's the minimum here, what's the minimum here we need in order to be able to do this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1214.853,
    "end": 1217.235,
    "text": "I found that really, really quite interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1218.416,
    "end": 1225.682,
    "text": "Why three, not four or five or breaking it out into, into smaller slices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1226.26,
    "end": 1230.485,
    "text": " That's again, another one of those questions I'd like to be able to talk to the authors about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1231.787,
    "end": 1232.027,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1232.187,
    "end": 1232.848,
    "text": "Active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1235.711,
    "end": 1237.834,
    "text": "They wrote before",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1239.403,
    "end": 1264.495,
    "text": " diving into formal modeling details below which we're going to get to later in the paper it might be helpful to compare and contrast the approach here apic with the prominent modeling framework active inference and we're going to return to some of these details and i'm sure have a lot of discussion on it but you made a really interesting point in our preparation about how they're not treating their model as",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1265.535,
    "end": 1291.723,
    "text": " downstream or a corollary of any commitment to a particular physics which is how we often hear about the free energy principle and bayesian mechanics but rather they're treating the model as a first order construction anything you want to add on that because i thought that was really like helped me frame what the paper was about yeah that's straightforward i think that the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1292.93,
    "end": 1320.096,
    "text": " Fourth bullet, unlike most active inference models in the literature, the material below considers an indefinite time or infinite horizon control setting is interesting because that makes it really, really clear between what they're talking about and what we often see in a lot of the representations, which is T0, T1 to T whatever, in terms of being able to figure out what is going on sequentially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1322.312,
    "end": 1323.074,
    "text": " All right, cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1324.557,
    "end": 1329.008,
    "text": "This section in the introduction talks about some issues with other models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1330.768,
    "end": 1356.546,
    "text": " They talk about how existing models of interoception have either formulated allostasis as a prospective decision-making problem without considering how these decisions are enacted, which has a bunch of different interpretations, but maybe, for example, requiring the enumeration of policies and then the selection from policies, or as a motor control problem without considering where motor commands come from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1358.226,
    "end": 1368.99,
    "text": " Another issue they have with other models, rather than treat metabolic efficiency as the objective, they discuss homeostasis, the regulation of bodily variables to fix set points with fixed tolerance for error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1369.87,
    "end": 1377.013,
    "text": "So this is really going to be a cool theme, which is rather than fix the set point and variability,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1377.953,
    "end": 1395.795,
    "text": " see that outcome as being due to some other process that does result in an attracting set or point with a fixed set point and an empirical tolerance for error, as well as maybe some points of no return and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1396.656,
    "end": 1409.343,
    "text": " But seeing all those outcomes as the realization of a dynamical system that actually doesn't pursue a set point, but rather pursues a slope on a graph that we'll explore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1409.843,
    "end": 1423.671,
    "text": "And that like zone of maximum controllability and reduction of surprisal around the zone of maximum controllability over evolutionary time will come to be associated with this kind of a survival variable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1425.703,
    "end": 1426.323,
    "text": " And some other points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1426.663,
    "end": 1426.883,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1427.223,
    "end": 1427.684,
    "text": "Anything else?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1428.884,
    "end": 1431.004,
    "text": "Well, it's relationship, relationship, relationship.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1431.064,
    "end": 1433.165,
    "text": "And then they say this paper aims to fill this gap.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1434.005,
    "end": 1443.448,
    "text": "I think relationship doesn't necessarily imply that things have to get closed in terms of whatever the gap is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1444.701,
    "end": 1445.922,
    "text": " by filling something in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1446.122,
    "end": 1462.371,
    "text": "I think the fact that they talk about targeting, I think the fact that they see relationship as playing kind of the key role in what they think is happening here means that maybe the gap continues.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1462.651,
    "end": 1473.037,
    "text": "I mean, they're putting stuff in here for us to consider and contemplate, but I'm not sure if we're actually filling a gap or if we're just sort of understanding what's in this space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1476.624,
    "end": 1499.196,
    "text": " right section two so at the beginning of section two the top paragraphs interception modeling the body estimating its efficiency and then the below the fold section 2.5 the summary so both of these pre and post two um 2.0 2.2",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1505.396,
    "end": 1510.119,
    "text": " contains a lot of structural information about the key points in this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1511.661,
    "end": 1514.963,
    "text": "Anything to add on this specific slide too, or we'll just go on through the sections?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1514.983,
    "end": 1517.245,
    "text": "I'll just put a quick star down at the very bottom there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1517.745,
    "end": 1524.59,
    "text": "People might want to have a read on that because I think that's, I'm not saying that that's controversial, but I do think it's interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1525.342,
    "end": 1540.665,
    "text": " Yeah, that the movement towards the responsive range of a capacity curve could be potentially obviating the need for a dedicated neural circuit or module that specifically calculates the behavioral constructs of reward and cost.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1541.365,
    "end": 1552.267,
    "text": "So what does it mean to move into a non-reward-centric understanding of physiology or reinterpreting reward?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1553.767,
    "end": 1566.211,
    "text": " Okay, section 2.1 introduces a distinction that is going to be key in the rest of the paper, which is the difference between two types of viscerosensory variables, interoceptive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1567.211,
    "end": 1575.474,
    "text": "Those which represent quantities of resources, regulated resources, and those which represent rates at which processes act, controlled processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1576.96,
    "end": 1580.343,
    "text": " Regulated resources are kept stable, relatively stable over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1580.644,
    "end": 1583.306,
    "text": "Examples include blood glucose and core body temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1584.167,
    "end": 1588.291,
    "text": "So of note is they don't have to be a depletable resource.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1589.192,
    "end": 1595.418,
    "text": "The regulated resource is kind of like the bounded variable in a homeostasis context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1595.578,
    "end": 1598.101,
    "text": "It's not necessarily a depletable metabolite.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1599.719,
    "end": 1606.627,
    "text": " A regulated resource like blood glucose or core body temperature represents a physical quantity or a substance like glucose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1606.687,
    "end": 1608.67,
    "text": "Its quantity cannot change instantaneously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1609.331,
    "end": 1616.099,
    "text": "So I think it will be interesting to ask, like, what different regulated resources...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1618.588,
    "end": 1640.394,
    "text": " of different modalities are and then controlled processes are the rates at which physiological processes operate so in that case would be like the kind of input output relationships of blood glucose okay yeah we just talked about that we talked about that recently is what's the difference between gripper and gripped and can both exist at once nice",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1642.377,
    "end": 1659.851,
    "text": " 2.2 back to the dodgeball example the heart rate and the blood pressure must increase during aerobic exercise as noted in the dodgeball example so there has to be some physiological adaptation in order to start exercising and continue exercising",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1661.848,
    "end": 1671.072,
    "text": " Upon resting conditions, the baroreceptor, that's pressure receptor, heart rate reflex, would normally counter any rise in blood pressure by slowing the heartbeat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1671.792,
    "end": 1679.575,
    "text": "However, with exertion, your blood pressure and heart rate both must increase to support the needed increase in blood flow required by your exercising muscles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1681.036,
    "end": 1694.047,
    "text": " And so then there's a discussion of how this kind of modulation of reflex allows for the shifting of an entire function relating a change in blood pressure to a change in your heart rate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1695.922,
    "end": 1713.412,
    "text": " So this is describing like a dynamical systems approach and physiological model for how the causal or correlational structure of different physiological variables can be modeled pretty generally, but it's going to get more specific.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1715.653,
    "end": 1720.716,
    "text": "Yeah, a little bit of covariation there and physiology and away we go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1722.332,
    "end": 1726.574,
    "text": " Okay, 2.2, predicting and modeling the ranges of regulated and controlled processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1727.515,
    "end": 1738.6,
    "text": "This is describing some of the parameters of the curve, the threshold and saturation points, which partly define curves that are derived from functions,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1739.6,
    "end": 1747.881,
    "text": " which physiologists commonly use to model the connection between perturbations and regulatory responses, usually naming them response curves or transfer functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1749.142,
    "end": 1761.724,
    "text": "And then the term capacity curves will be used to emphasize the fact that while such curves can shift over time, in any one instant, they represent the current range of limited regulatory resources available to an organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1762.524,
    "end": 1768.045,
    "text": "So one could imagine like a financial capacity curve to maintain some",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1769.651,
    "end": 1782.868,
    "text": " market at some point like kind of like the depth but by analogy and then this um idea of modeling how a system responds to perturbations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1783.922,
    "end": 1788.887,
    "text": " doesn't necessarily require modeling the internal model of that system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1789.367,
    "end": 1800.478,
    "text": "But as you build a better generative model of the system being perturbed, then the better experiments and the further you can have kind of perturbability of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1801.019,
    "end": 1804.843,
    "text": "It allows you to approach a system without a strong hypothesis about its structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1808.086,
    "end": 1818.09,
    "text": " The capacity curve in figure one has the mathematical form, and then figure one is shown alongside with equation one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1820.471,
    "end": 1821.751,
    "text": "The parameters are defined.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1821.871,
    "end": 1830.575,
    "text": "The function Y is taking in U, mu, K, big R, big B, and combining those into an equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1832.735,
    "end": 1836.217,
    "text": "The figure one on the x-axis is showing the blood pressure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1837.099,
    "end": 1844.504,
    "text": " And then the y-axis is showing the baseline activation percentage of the reflex, modulating this physiological variable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1845.065,
    "end": 1859.054,
    "text": "So at 100, which is the target blood pressure, or sort of what would be called the homeostatic set point, because it seems to be an attractor, at that point, the baseline activation of the baroreflex is happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1859.975,
    "end": 1883.048,
    "text": " when the blood pressure increases then the baroreflex activates up to 2x thresholding at 2x activation of baseline and then as the blood pressure decreases the baroreflex again with this sigmoid symmetry decreases that's a dynamical model of regulation of blood pressure",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1887.208,
    "end": 1898.636,
    "text": " Equations 2, 3, and 4 outline the form of a generative model, a procedure for probabilistically predicting observed variables in terms of unobserved variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1899.704,
    "end": 1906.687,
    "text": " The variables listed are unobserved variables which are sampled from an a priori probability distribution not dependent on data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1908.067,
    "end": 1913.229,
    "text": "So that's referring to using a generative model and how these equations constitute it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1914.33,
    "end": 1916.09,
    "text": "The proposal here has an unusual feature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1916.471,
    "end": 1922.413,
    "text": "The equations for X, the mean arterial blood pressure, and Y, the baroreflex activation as a percentage of baseline.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1922.733,
    "end": 1924.114,
    "text": "So figure one, X and Y.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1925.214,
    "end": 1950.258,
    "text": " are in terms of the quantile variable u the quantile variable uniformly represents the relationship between the blood pressure and the barrel reflex activation irrespective of changes in the capacity curves operating point mu and gain k the quantile depends only on the functional form of the capacity curve and not on the parameters so we'll unpack that a little more technically but they point to that as a feature of their model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1952.847,
    "end": 1957.169,
    "text": " Here again is figure one, a little bigger with more space to discuss later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1957.95,
    "end": 1968.895,
    "text": "And here's figure two, which is the capacity curve from figure one in blue with a linearized response in orange around the operating point, the blue diamond marker.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1971.537,
    "end": 1977.02,
    "text": "So one can see this as the maximum positive slope of this sigmoid curve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1978.277,
    "end": 2004.149,
    "text": " and that under the specification that the reflex is going to be activated in a sigmoidal way, then depending on whether one is in like a curving up part or a curving down part, or thinks about it as pursuing the maximum positive slope, then pursuing that point and being rewarded by movements towards maximum maneuverability and control,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2005.1,
    "end": 2025.759,
    "text": " would have the equivalent of pursuing a homeostatic model where this is like a fixed point attractor so it puts the kind of bottom of the bowl in this orange line being maximized in slope rather than the blue diamond being reduced in its distance from 100 right",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2033.473,
    "end": 2036.4,
    "text": " I think we copied this section twice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2036.42,
    "end": 2039.186,
    "text": "It was so unusual, we copied it twice. 2.3?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2045.123,
    "end": 2074.015,
    "text": " return to the dodgeball example and they're going to widen their scope beyond just the barrow reflex blood pressure to circulating levels of oxygen glucose and carbon dioxide next we focus on blood glucose as a regulated resource with glucagon as the controlled process enabling secretion of glucose into the blood and insulin as the control process enabling removal of glucose from the blood so the barrel reflex was like a single volume knob",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2075.129,
    "end": 2078.491,
    "text": " or a triage nurse that can lower or raise the single response.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2079.151,
    "end": 2082.653,
    "text": "So if some physiological variable is high, it's like, it can be like removed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2084.114,
    "end": 2086.895,
    "text": "Glucose regulation has multiple hormones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2087.755,
    "end": 2101.362,
    "text": "It's going to be like buffered from two different sides in a slightly different way, but using a lot of the same formalisms and logic to introduce a slightly different and more complex physiological system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2102.243,
    "end": 2102.363,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2106.713,
    "end": 2116.617,
    "text": " The section discusses some findings that blood glucose levels are not actively defended at a biologically hard-coded set point any more than heart rate is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2116.837,
    "end": 2133.645,
    "text": "Instead, glucagon and insulin, two hormones, activity balance each other's effects to bring the blood glucose to a point within its settling range, with glucose entering the blood after the person ingests food and glucose then crossing from the blood into other bodily tissues to support their function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2135.515,
    "end": 2138.338,
    "text": " Anything to add on this slide?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2138.378,
    "end": 2139.619,
    "text": "Not specifically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2139.659,
    "end": 2143.503,
    "text": "I'll wait till we get to the end of the Section 2 stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2144.864,
    "end": 2146.285,
    "text": "So here is Figure 3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2147.306,
    "end": 2151.37,
    "text": "They're writing, Figure 3 shows plots of the resulting functions...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2152.558,
    "end": 2159.264,
    "text": " of this equation applied to the insulin case, which can be interpreted as capacity curves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2159.484,
    "end": 2161.285,
    "text": "Orange sigmoid is insulin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2162.066,
    "end": 2164.508,
    "text": "The blue sigmoid is glucagon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2165.449,
    "end": 2172.215,
    "text": "They have different hormone levels at different x-axis, which is the level of glucose in the blood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2172.795,
    "end": 2179.541,
    "text": "And so you kind of see familiar behavior when glucose is high, then insulin is at high secretion",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2181.502,
    "end": 2198.956,
    "text": " which drives the absorption of glucose and when glucose gets low in this case below 2.5 or 3 or so then glucagon is secreted to elicit glucose to enter the blood okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2202.046,
    "end": 2225.981,
    "text": " so one can imagine that the glucose level will be oscillating in this space but not exactly set at a set point with a residual being minimized section 2.4 is where they move from discussing this kind of a regulatory model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2227.373,
    "end": 2249.534,
    "text": " uh into viable ranges and capacities could obviate a modular reward system here's an argument or appeal to neuroanatomy there's no single brain site that specifically encodes appetitive or aversive reinforcement value it is useful to reframe discrete reward and decision systems as domain general allostatic control systems",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2250.515,
    "end": 2261.338,
    "text": " The domain generality of interoception provides further theoretical support for the idea that we do not need mental modules or faculty psychology concepts to understand how a brain works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2262.398,
    "end": 2271.32,
    "text": "A mathematically sound and biologically plausible account of allostatic control does not require a modular or separate reward system in the central nervous system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2272.261,
    "end": 2273.841,
    "text": "And a bit more on this topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2274.361,
    "end": 2274.881,
    "text": "Anything to add?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2276.382,
    "end": 2277.002,
    "text": "No, let's get to 37.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2278.442,
    "end": 2280.263,
    "text": " All right, the rewards of control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2280.404,
    "end": 2287.309,
    "text": "So here I wanted to highlight two papers with some nice images by both papers involving Tobias Morville.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2288.35,
    "end": 2296.436,
    "text": "And these papers are cited in the paper under discussion and they all show some pretty interesting features.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2296.476,
    "end": 2304.102,
    "text": "So just to highlight some of these graphs, here's movements within a glucose and temperature space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2304.803,
    "end": 2307.325,
    "text": "So regulation of multiple physiological variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2309.127,
    "end": 2322.55,
    "text": " here on the bottom left is the integration of interoception homeostatic set point and motor commands like related to foraging here is some bayesian",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2323.922,
    "end": 2333.645,
    "text": " visualizations with a prior posterior and likelihood and about this two-way relationship of inference and a forward dynamical model, the tale of two densities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2334.405,
    "end": 2351.19,
    "text": "And then the last one, this is another body temperature glucose modeling approach that gets to that notion that we describe as going to the bottom of the bowl where the shape of this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2353.524,
    "end": 2362.811,
    "text": " napkin could be designed or evolved or selected so that the marble spends most of its time in a certain zone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2363.151,
    "end": 2370.816,
    "text": "And this is just one other way to think about these types of attractor systems rather than as traces or so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2372.637,
    "end": 2373.458,
    "text": "Okay, anything to add?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2374.879,
    "end": 2380.243,
    "text": "I think Section 2 basically confirms that if you're going to be doing any kind of predictive performance",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2381.158,
    "end": 2393.621,
    "text": " that has an element of continuity to it, that depends on sort of recognizable finite limits and also variability within whatever those limits are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2394.361,
    "end": 2404.764,
    "text": "And I think that kind of speaks to the idea that there's, in a sort of a two factor situation, there's signaling that looks like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2404.824,
    "end": 2409.985,
    "text": "And they sort of pointed out a couple of examples of the Barrett reflex and the glucagon thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2410.86,
    "end": 2416.404,
    "text": " And they also were trying to avoid oversimplifying or over reducing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2416.444,
    "end": 2428.753,
    "text": "Like they tried to keep the complexity of those two examples retained in terms of what they were trying to hold up as something that allows us to start looking at these capacity curves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2432.639,
    "end": 2439.427,
    "text": " All right, section three, control theory, a unifying lens for physiology, motor control, and decision-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2440.368,
    "end": 2442.631,
    "text": "And then one of their summaries of the chapter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2443.212,
    "end": 2450.901,
    "text": "This section introduces concepts from engineering control theory, then reviews its applications in the life sciences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2451.522,
    "end": 2457.804,
    "text": " These include physiology, section 3.1, skeletal motor movement, section 3.2, and decision-making, section 3.3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2459.005,
    "end": 2469.148,
    "text": "Section 3.4 will connect future interoceptive states to present movements, illuminating what makes allostatic regulation more energy efficient than homeostatic regulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2469.888,
    "end": 2477.371,
    "text": "The next section, 4, will build off the account of control used in physiology to suggest how interoception supports allostasis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2479.113,
    "end": 2485.843,
    "text": " Okay, here we're not going to read everything on the slide, but this is from Section 3.1, Control Theory for Physiology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2486.364,
    "end": 2489.549,
    "text": "A reliable body built from unreliable parts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2490.17,
    "end": 2490.991,
    "text": "Anything to add on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2492.233,
    "end": 2492.433,
    "text": "Nope.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2493.575,
    "end": 2494.637,
    "text": "People just want to read this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2495.202,
    "end": 2504.288,
    "text": " Yep, I'll just call out for a controller to perform well, it must contain some sort of copy or mirror of the plant's expected behavior, which is referred to as an internal model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2505.049,
    "end": 2511.393,
    "text": "Control theorists call the driven system the plant and its desired trajectory the reference trajectory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2512.694,
    "end": 2518.579,
    "text": "And there's some interesting discussion of this kind of thread of control theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2519.96,
    "end": 2520.36,
    "text": "Figure four.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2521.914,
    "end": 2525.935,
    "text": " So figure four is a functional block diagram of a model-based control system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2526.275,
    "end": 2530.416,
    "text": "The plant in orange is the object or system whose motion or other behavior is controlled.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2531.317,
    "end": 2544.66,
    "text": "The controller, purple, sends signals, controls, solid black arrows that change how the plant moves and signals the expected outcome, predictions, solid yellow arrow to the state estimator in yellow, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2544.74,
    "end": 2546.121,
    "text": "People can read the rest of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2548.166,
    "end": 2560.165,
    "text": " But these figures, Daniel, as we get further down in the slides, why don't I read and then you can run the cursor over the different parts of the model so people can kind of see in real time how the two things align.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2560.706,
    "end": 2561.167,
    "text": " Sounds good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2561.207,
    "end": 2562.268,
    "text": "We'll do that for the future ones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2563.148,
    "end": 2579.404,
    "text": "And this is going to revoke or recall some of our earlier discussions in Livestream 23, skillful performance and interactionism and instructionism and how to think about motor plants and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2580.185,
    "end": 2580.345,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2582.31,
    "end": 2585.873,
    "text": " Section 3.2, moving the body, the referent control hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2586.514,
    "end": 2593.199,
    "text": "So the referent control hypothesis, the citations provided were to Feldman 2015 and Latosh 2021.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2594.841,
    "end": 2600.445,
    "text": "And the referent control hypothesis describes the skeletal motor system in terms of a hierarchy of controllers,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2601.266,
    "end": 2608.352,
    "text": " with higher level controllers in the brain prescribing reference trajectories to the lower level reflexes in the spinal cord.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2608.833,
    "end": 2620.002,
    "text": "These reflexes then compare the actual length of the muscle as signaled by afferent proprioceptor neurons to the reference length sent down by the brain and contracts the muscle to bring the two into agreement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2620.683,
    "end": 2627.669,
    "text": "And so here is the top part of the table of content of Feldman's 2015 book, Referent Control of Action and Perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2628.489,
    "end": 2637.839,
    "text": " and the paper of Latosh in Physics of Life Review 2021 with some graphics around this type of approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2644.045,
    "end": 2646.427,
    "text": "You can start this slide on the real world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2649.55,
    "end": 2651.573,
    "text": "Okay, well, I'll just...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2652.455,
    "end": 2658.217,
    "text": " point out a couple things the authors say, because they do not want to be accused of sort of overfitting here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2659.017,
    "end": 2663.239,
    "text": "Structural motor control experiments only limited overlap with the actual structure of motor control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2663.759,
    "end": 2666.98,
    "text": "So only limited overlap.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2667.34,
    "end": 2672.882,
    "text": "An experiment on reaching behaviors involves an experimenter prescribing the reaching task to the participants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2672.902,
    "end": 2679.905,
    "text": "The participant's brain does not function specifically to follow instructions from an experimenter, but rather to regulate their own body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2680.762,
    "end": 2686.845,
    "text": " The actual organization of the central nervous system, of course, is better with an inside-out view of motor function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2687.346,
    "end": 2689.127,
    "text": "Movement of the body, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2689.147,
    "end": 2695.23,
    "text": "the somatomotor pathways, serves regulation of the body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2695.85,
    "end": 2704.315,
    "text": "For example, in the game of Dr. Ball, if you unexpectedly step on a hard or sharp rock or object, you usually don't purposely impale yourself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2705.356,
    "end": 2707.577,
    "text": "I stepped on it, so I just wanted to go through my foot now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2708.715,
    "end": 2711.856,
    "text": " because my focus is still on stabilizing my posture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2711.876,
    "end": 2722.401,
    "text": "Rather, you recoil in pain, you feel that interoceptively, and the unplanned disturbance of any tissue damage requires you to make a decision about what to do next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2722.682,
    "end": 2726.183,
    "text": "Excuse yourself to nurse your foot or play through the pain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2727.264,
    "end": 2735.628,
    "text": "I think the fact that they're trying to limit what they are saying is the extent to which the control piece of this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2736.624,
    "end": 2743.749,
    "text": " can be said to apply as a good thing, because I think there's a couple of areas around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2744.549,
    "end": 2765.343,
    "text": "So what is in this relationship between a command system or a control system and a demand system, where do things like, like when your body is starting to suffer from mild hypothermia and, and, you know, people know that, that your brain stops functioning correctly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2765.864,
    "end": 2765.944,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2766.513,
    "end": 2787.018,
    "text": " How do you differentiate between, for example, I'm getting a slurpee headache and you put the slurpee down and stop drinking it because you know that that's the effect versus you have your limbs, which aren't, you know, frostbitten at this point, or at least hopefully not frostbitten, continue to move so that you...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2788.345,
    "end": 2794.51,
    "text": " don't stop, you avoid stopping moving altogether, which essentially is death.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2794.99,
    "end": 2804.198,
    "text": "So here we've got to wonder whether or not, without getting into the argument of, because it's pretty obvious, if your brain is dead, you're dead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2804.919,
    "end": 2815.267,
    "text": "But if your hands are dead and you are still alive, that clear distinction between a command center consequence and a demand center consequence, what does that mean in terms of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2815.908,
    "end": 2823.451,
    "text": " Okay, so there's things that happen that you do automatically in order to keep yourself alive in some of the most critical situations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2824.071,
    "end": 2840.816,
    "text": "And it's not like your hand has the brain, and yet it may, in just simply moving around beyond a reflexive thing, be able to keep you alive long enough until somebody comes to your rescue as a poor example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2841.557,
    "end": 2845.398,
    "text": "So I don't know if that's confusing or not, but I think that there's a reconciliation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2846.392,
    "end": 2848.394,
    "text": " that goes on between command and demand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2848.454,
    "end": 2859.842,
    "text": "And maybe some of control is the ability to give up command at times in order for a new response to take over and keep you alive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2860.243,
    "end": 2865.506,
    "text": "And you may not necessarily know how to do that from a command center.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2865.847,
    "end": 2870.15,
    "text": "So we'll have to talk to the authors about that because these are questions that I have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2870.81,
    "end": 2875.474,
    "text": "And I got a bit of a physiological background, so I wonder about these extreme situations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2877.486,
    "end": 2877.746,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2879.428,
    "end": 2883.693,
    "text": "Section 3.3, making decisions, constructing future reference trajectories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2884.954,
    "end": 2888.077,
    "text": "They use the word demands, so we'll talk about it later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2888.698,
    "end": 2888.878,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2889.599,
    "end": 2892.562,
    "text": "More quotes from 3.3 for those who want a screenshot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2894.249,
    "end": 2899.071,
    "text": " talking about ergodicity, which is also raised in the Appendix B, which we're not going to focus on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2900.731,
    "end": 2903.752,
    "text": "Okay, you can read Figure 5, and I'll use the mouse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2904.273,
    "end": 2905.013,
    "text": "Go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2905.033,
    "end": 2911.855,
    "text": "So a functional block diagram for an experimental psychologist's task-oriented view of motor control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2912.215,
    "end": 2916.897,
    "text": "The diagram shows a formal logic structure here at a conceptual level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2917.486,
    "end": 2921.407,
    "text": " The boxes and arrows do not map onto the anatomy of the brain or nervous system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2921.447,
    "end": 2931.49,
    "text": "In contrast to figure four, this diagram differentiates between skeletal motor, brain, and peripheral stretch reflex controllers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2932.17,
    "end": 2940.732,
    "text": "And between sensory state estimators, brain, and peripheral sense organs, sensory surfaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2941.132,
    "end": 2944.133,
    "text": "The diagram shows an engineering perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2945.154,
    "end": 2946.034,
    "text": "Important to note that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2946.614,
    "end": 2946.734,
    "text": "On a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2947.33,
    "end": 2961.252,
    "text": " psychology experiment, in which the experiment prescribes a task or behavior to participants, so there's an externality, and a participant's brain then acts as a control system to achieve the prescribed behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2962.113,
    "end": 2970.714,
    "text": "Systems that maintain the body, therefore, serve systems that move the body, which in turn serve a prescribed behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2970.854,
    "end": 2975.875,
    "text": "So again, the focus on the prescriptive, the externality, the information coming in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2979.688,
    "end": 2980.048,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2981.169,
    "end": 2982.11,
    "text": "Functional block diagram.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2982.49,
    "end": 2983.29,
    "text": "Yeah, next one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2983.811,
    "end": 2987.473,
    "text": "Functional block diagram for a control theoretic view of allostasis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2988.014,
    "end": 2995.298,
    "text": "In contrast to figure five, this diagram shows a closed loop control system designed for autonomous regulation of the body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2995.999,
    "end": 3008.307,
    "text": "An experimenter's desired task behaviors were placed with, or by, sorry, the allostatic capacity estimator, which sends predictions of capacity curves, which we've already looked at,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3008.834,
    "end": 3014.999,
    "text": " to the intercepted state estimator and receives prediction errors with which to update its estimates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3015.879,
    "end": 3022.044,
    "text": "The updated estimates are issued as a reference signal to the visceral motor controller.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3022.284,
    "end": 3027.107,
    "text": "This diagram shows a formal logical structure, a conceptual level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3027.788,
    "end": 3037.275,
    "text": "The hypothesis depicted is constrained by the inferred anatomical structures in Barrett 2017, but the boxes and arrows do not match",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3038.254,
    "end": 3042.296,
    "text": " I'll repeat, do not map one to one onto the anatomy of the brain or nervous system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3043.857,
    "end": 3044.157,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3047.379,
    "end": 3047.619,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3048.66,
    "end": 3054.063,
    "text": "So just to highlight the difference here, the left is almost like an instructionalist",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3056.408,
    "end": 3076.883,
    "text": " arrangement and this is how the experimental psychologist thinks about this task which is like we write down the instructions the pseudocode for the task keep your heart rate within this range and then there's some decision making with the skeletal motor system whether capable of conscious action",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3078.004,
    "end": 3106.652,
    "text": " and stretching or more uh subconscious and then acting through physiology in the body or in the external world that interoceptive state estimator comes into alignment with the desired implementation of the skeletal motor decision in contrast the role of the task instructions so to speak is substituted in this control theoretic view",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3107.918,
    "end": 3135.503,
    "text": " with the allostatic capacity estimator as the imperative and that feeds on through a very similar set on the right side but here we actually have the viscera motor decision controller in uh in contrast to a skeletal motor decision controller because this is more focused on like choose the left button or the right button and figure six is focused more on the kind of baro reflex",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3137.082,
    "end": 3140.587,
    "text": " control theory view, but that also generalizes beyond.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3140.607,
    "end": 3144.712,
    "text": "Okay, I think that's just another view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3145.393,
    "end": 3150.52,
    "text": "Section four, allostasis as trajectory tracking stochastic optimal control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3153.106,
    "end": 3161.115,
    "text": " This section will describe our formal model of allostatic decision-making, the Allostatic Path Integral Control model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3162.016,
    "end": 3164.179,
    "text": "APIC has a simple idea at its core.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3164.619,
    "end": 3168.704,
    "text": "Just as perceptual concepts serve as internal models of the body's sensory surfaces,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3169.785,
    "end": 3175.648,
    "text": " Action concepts also serve as internal models of potential behaviors and their predicted outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3176.969,
    "end": 3185.553,
    "text": "Section 4.1 derives an SOC objective function from the mathematical form by which Section 2 represented capacity curves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3186.534,
    "end": 3192.257,
    "text": "Then Section 4.2, 4.3, and 4.4 are described fleshing out this APIC model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3192.657,
    "end": 3193.097,
    "text": "Anything to add?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3194.653,
    "end": 3195.274,
    "text": " No, let's go there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3195.815,
    "end": 3200.024,
    "text": "All right, 4.1, transforming capacity curves into objective functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3201.447,
    "end": 3204.854,
    "text": "Since any given capacity curve, such as the one in figure one above,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3205.939,
    "end": 3208.72,
    "text": " which is a maximum value on the vertical axis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3209.4,
    "end": 3215.181,
    "text": "It can be divided by its maximum y value to normalize it to range between zero and one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3216.101,
    "end": 3221.502,
    "text": "Once normalized in this way, it can be interpreted as a cumulative distribution function from probability theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3222.382,
    "end": 3233.425,
    "text": "This is precisely, in fact, precisely what Srinivasan, Laughlin, and Dubs did to interpret the firing of retinal neurons in flies as a form of predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3233.965,
    "end": 3234.685,
    "text": "See their figure one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3235.834,
    "end": 3242.9,
    "text": " The derivative of a CDF cumulative distribution function yields a probability density function, PDF.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3244.181,
    "end": 3247.663,
    "text": "So the derivative of a CDF gives a PDF.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3250.085,
    "end": 3257.251,
    "text": "This is the more familiar way of representing a probability distribution where the height on the vertical axis corresponds to likelihood in the PDF.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3258.476,
    "end": 3263.278,
    "text": " But for a PDF derived from a capacity curve, it represents relative responsiveness to perturbation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3263.999,
    "end": 3266.84,
    "text": "We will call such distribution a reference distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3267.54,
    "end": 3273.123,
    "text": "So this is a transformation of statistical distributions between the PDF,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3273.823,
    "end": 3278.807,
    "text": " which is the probability density function and CDF cumulative distribution function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3279.548,
    "end": 3284.612,
    "text": "It might be very familiar to some, it might be totally new to some, so that's all good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3285.432,
    "end": 3289.415,
    "text": "Hopefully this is useful still to consider the relationship between the two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3290.316,
    "end": 3300.764,
    "text": "So here on the left of these three images, the PDF, which is the more familiar way of representing a probability distribution, we would say, this is a uniform distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3301.485,
    "end": 3305.246,
    "text": " there's a one in six chance of getting each outcome from a six-sided die.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3306.267,
    "end": 3315.89,
    "text": "Or in the Gaussian bell curve situation, which both of these two middle and right images show, the PDF of the bell curve is the bell curve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3316.11,
    "end": 3317.771,
    "text": "So the PDF is the most familiar one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3318.031,
    "end": 3320.872,
    "text": "The uniform distribution is like a flat line in the PDF.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3321.432,
    "end": 3323.473,
    "text": "The bell curve is like a bell curve in the PDF.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3324.794,
    "end": 3343.405,
    "text": " But since you know the maximum and minimum values, if only asymptotically, then you can make a cumulative distribution function, which starts basically as low as the function can go, the support for that distribution, and it just accumulates cumulatively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3344.346,
    "end": 3371.859,
    "text": " so it's like useful to answer the question what is the probability of getting a four or three or two or one that is two thirds or what is the probability of getting a z score of below two like two standard deviations positive what fraction of the curve is below that z score on the pdf and that is addressable by quickly just looking up a point on this cdf",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3373.038,
    "end": 3395.165,
    "text": " It turns out that that relationship between the PDF and the CDF, which is more familiar to again, like rolling a die or evaluating like height in a classroom can be used on the capacity curve discussed earlier to move to a distribution, which when maximized is in this spot of maximum control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3399.201,
    "end": 3410.968,
    "text": " So here the CDF from figure two gets the derivative and then it becomes the PDF with this sort of negative curve shape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3411.728,
    "end": 3416.19,
    "text": "And that's kind of what was being hinted at with this orange line being maximized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3416.691,
    "end": 3426.956,
    "text": "Orange line being maximized is the high point on this bell curve like, but it's not a classical bell curve, but it is a mountain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3427.457,
    "end": 3427.557,
    "text": "It's...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3428.437,
    "end": 3448.028,
    "text": " one peak that you can know which side you're on and therefore pretty easily optimize torts um for analytical convenience we take the practice from todorov 2006 of using a log density the logarithm of a pdf as an objective function rather than the pdf itself",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3449.127,
    "end": 3456.591,
    "text": " The operating point then continues to appear as local maximum while the gain determines the cost of movement away from the operating point and the value of movement towards it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3457.371,
    "end": 3462.634,
    "text": "Figure 8 shows the objective function log density corresponding to the original Barrow-Reflex capacity curve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3463.885,
    "end": 3469.589,
    "text": " Figure 9 further clarifies the relationship between the various forms of capacity curve by showing all three alongside each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3469.789,
    "end": 3471.21,
    "text": "So this is a really nice figure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3472.011,
    "end": 3480.818,
    "text": "On the top left of the figure is the figure 1 with the reflex that gets dialed up or dialed down to regulate blood pressure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3482.379,
    "end": 3487.482,
    "text": "That's when interpreted as a CDF can result in a PDF.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3488.43,
    "end": 3510.885,
    "text": " and that is a single peak that you can maximize instead of trying to calculate a residual the shape of this curve becomes slightly nicer to optimize computationally when you make it so that it's like a smoother bowl rather than this kind of like inverted funnel shape it just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3512.045,
    "end": 3513.566,
    "text": " We can go into more detail why.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3513.586,
    "end": 3514.427,
    "text": "I think that'll be cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3514.907,
    "end": 3516.408,
    "text": "Why does this log step matter?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3516.428,
    "end": 3517.609,
    "text": "Or does it matter?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3517.689,
    "end": 3527.537,
    "text": "But suffice to say that this is the big move that lets you turn the sigmoid juggling act into the mountain climb.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3530.479,
    "end": 3538.625,
    "text": "Table 1 summarizes some key... Table 1 summarizes some key notations...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3540.083,
    "end": 3543.165,
    "text": " We do not claim our graphical model accurately captures the anatomy of the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3543.385,
    "end": 3548.688,
    "text": "It captures reference-based sensory motor control across a hierarchy of timescales, a single feature shared with the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3550.489,
    "end": 3552.51,
    "text": "Variables in a table.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3554.852,
    "end": 3558.454,
    "text": "Equations five and six about the instantaneous capture rate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3559.594,
    "end": 3561.836,
    "text": "We'll discuss it in the dot one, dot two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3563.982,
    "end": 3566.963,
    "text": " Section 4.2 also will be nice to discuss.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3567.203,
    "end": 3571.445,
    "text": "It is optimal forging theory suggests a functional form for allostatic control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3571.485,
    "end": 3575.306,
    "text": "Do you want to add anything up front about optimal forging?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3577.767,
    "end": 3582.589,
    "text": "No, other than I want to talk with the authors about what does that even mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3583.049,
    "end": 3587.471,
    "text": "That'll be great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3588.171,
    "end": 3588.432,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3589.032,
    "end": 3591.413,
    "text": "Equation eight, global capture eight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3592.293,
    "end": 3597.355,
    "text": " Section 4.3, feed forward control with generative action concepts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3598.735,
    "end": 3611.119,
    "text": "So here's some more formalisms, and this is within not the experimental psychologist framework, but rather the control theoretic framework with allostatic capacity estimator on the left.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3613.04,
    "end": 3617.361,
    "text": "Section 4.3, equation 10, equation 11, more variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3622.156,
    "end": 3625.637,
    "text": " Stochastic optimal control, SOC, which was mentioned earlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3626.537,
    "end": 3626.877,
    "text": "Equation 12.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3630.879,
    "end": 3631.299,
    "text": "Figure 10.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3632.199,
    "end": 3634.06,
    "text": "This one will be nice to discuss.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3634.76,
    "end": 3639.822,
    "text": "A hierarchical generative model capturing multiple timescales and reference distributions at each level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3640.782,
    "end": 3647.224,
    "text": "Without addressing empirical questions about neural hierarchies, here we employ a model with L equals 4 models to match figure 6.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3650.968,
    "end": 3653.51,
    "text": " it defines what some of these nodes mean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3653.99,
    "end": 3656.773,
    "text": "But the y-axis is increasing time scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3658.354,
    "end": 3661.096,
    "text": "So perhaps slower things higher up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3661.896,
    "end": 3664.258,
    "text": "And then on the right is the passage of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3665.739,
    "end": 3667.1,
    "text": "So what does this make you think about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3667.18,
    "end": 3669.902,
    "text": "Or what is like a way we can approach the interpretation of this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3671.724,
    "end": 3679.69,
    "text": "Well, I'm not trying to be a smart apple, but I do find it interesting that L4 gives you quite a bit of information that, I mean,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3680.31,
    "end": 3685.977,
    "text": " And they talk about the fact that there's more than four levels, but they want to focus on those four.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3686.497,
    "end": 3691.903,
    "text": "I mean, where my brain goes is, okay, so we've got the water, we've got the yeast, we've got the hops, and we've got the grains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3692.384,
    "end": 3693.786,
    "text": "And that can create quite the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3695.083,
    "end": 3718.512,
    "text": " quite the product so you can go past that you can add juice or whatever but you got the four basic ingredients so now moving through time what does that enable so again it'd be nice for them to pull that pull that apart because i think even in this there's enough there to figure a lot of stuff out",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3720.821,
    "end": 3738.369,
    "text": " right 4.4 feedback control with generative action concepts still there is equation 13 equation 14 and then a nice quote readers familiar with predictive processing and active inference will recognize the form of the above equation 14",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3740.25,
    "end": 3761.85,
    "text": " as a negative free energy or a variational lower bound for discussion see some citations since objectives can typically be written out and interpreted in several equivalent ways each of which can come with its own intuitions there are arguments for the computational and thermodynamic efficiency of minimizing this specific divergence in the course of neural processing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3762.631,
    "end": 3788.105,
    "text": " but to date the available evidence does not rule out other more complex information divergences for penalizing feedback correction of movements so it's pretty interesting how different lower bounds variational lower bounds negative free energies exist like there's expected free energy and then there's free energy of the expected future and there's all of these variants and then each of those",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3789.546,
    "end": 3796.292,
    "text": " energies can be decomposed differently, like equation 2.6 in the textbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3797.513,
    "end": 3797.853,
    "text": "So it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3800.72,
    "end": 3822.92,
    "text": " interesting to see how first off how did they converge to this kind of a bound and from why should it have such resonance with free energy principle and what does that mean and then how can different partitionings of these energy bounds help us think about systems that survive",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3825.45,
    "end": 3828.773,
    "text": " I'll just add here, Daniel, that we're going to get to these things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3828.793,
    "end": 3838.8,
    "text": "But up until this point in the paper, I guess I had a bit of familiarity and I didn't really struggle with sort of the lockstep way that they were going through this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3839.741,
    "end": 3848.788,
    "text": "But as soon as we got to equations 13 and the jump to equation 15 and 16, somebody brighter than me is going to have to be able to explain that jump",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3849.369,
    "end": 3855.832,
    "text": " in real simple terms, because even though I've read it a number of times, I'm still not exactly sure how it works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3856.032,
    "end": 3862.954,
    "text": "So again, the authors will really want to bring their softest gloves because I need my handheld.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3864.435,
    "end": 3865.816,
    "text": "Yeah, agreed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3868.837,
    "end": 3870.237,
    "text": "Section 4.4 still, here's equation 15.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3870.277,
    "end": 3871.758,
    "text": "Section 4.4, here's equation 16.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3880.723,
    "end": 3898.292,
    "text": " Substituting the augmented objective, fancy J, equation 14, and the analytical expression for the optimal feedback controller alone, equation 15, into the Bellman equation, equation 12, would yield equation 16.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3898.412,
    "end": 3900.613,
    "text": "Let's learn what it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3901.574,
    "end": 3901.734,
    "text": "Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3904.269,
    "end": 3909.218,
    "text": " Now the intractable recursive term in the equation is etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3910.361,
    "end": 3914.669,
    "text": "Finding a way to replace this term will yield a more computationally tractable problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3916.035,
    "end": 3931.282,
    "text": " The information divergence term in Fancy J provides just such a way since it can be written as precisely the difference between the intractable hard maximum under Q star sub phi and the more tractable smooth maximum under the preplanned action concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3931.682,
    "end": 3933.202,
    "text": "In symbols, equation 17.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3933.282,
    "end": 3934.943,
    "text": "Pretty interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3934.963,
    "end": 3938.084,
    "text": "Equation 17 through 21.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3947.136,
    "end": 3948.376,
    "text": " then the final section.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3948.936,
    "end": 3951.597,
    "text": "Section five, discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3952.417,
    "end": 3953.918,
    "text": "Maybe you can help me today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3954.438,
    "end": 3974.983,
    "text": "So we're 13 through 17 and then 18, 19, and 20, a way of being able to put together some of the scale-free formalisms with the scale-specific or scale-friendly details and particulars.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3975.383,
    "end": 3976.723,
    "text": "When you read this, is that what",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3977.216,
    "end": 3981.858,
    "text": " you saw them trying to clarify?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3985.78,
    "end": 3987.641,
    "text": "That's a great question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3987.661,
    "end": 3994.265,
    "text": "Because they talk about global, and I think they have to be able to spell that out, and I think they did.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3994.885,
    "end": 4000.248,
    "text": "But again, it was all of a sudden, things went off into the ditch for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4002.149,
    "end": 4004.61,
    "text": "Here's what I would venture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4007.538,
    "end": 4024.467,
    "text": " In the early section, there's a contrasting of homeostasis with allostasis and about how reward systems are no longer required under certain distributed models of brain neuroanatomy and a function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4025.487,
    "end": 4032.871,
    "text": "So I believe that the following formalisms substitute the augmented objective into",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4034.011,
    "end": 4041.396,
    "text": " an optimality and optimization framework like the Bellman equation, which is often used for reward maximization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4042.037,
    "end": 4044.638,
    "text": "So I'm rewarded by getting to the top of the mountain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4045.479,
    "end": 4050.462,
    "text": "So I'm going to evaluate paths based upon how much reward they accrue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4051.283,
    "end": 4070.226,
    "text": " okay and then curiosity or so on will be valuable to the extent over the time horizon that i considered it facilitates reward in terms of elevation whereas we here are seeing the move towards that like optimal maneuverability maximization",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4071.977,
    "end": 4074.018,
    "text": " with a PDF-CDF relationship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4075.019,
    "end": 4085.665,
    "text": "Like instead of trying to reduce divergence to the midpoint of the CDF, you maximize your responsiveness in terms of maximizing the log PDF.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4086.846,
    "end": 4092.569,
    "text": "So I think that's the augmented reward function, which is tractable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4093.815,
    "end": 4120.187,
    "text": " and then some work remains to specify that function and how it behaves perhaps okay then section five discussion interception stabilizes action and constructs allostatic references people can look at the quotes anything to summarize here nope",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4120.779,
    "end": 4141.719,
    "text": " all right 5.1 viewing the brain as an allostatic optimal controller the allostatic path integral control apic model in section 4 implies a number of specific hypotheses beyond those generic to stochastic optimum control there's some discussion of shared modeling choices with active inference models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4143.345,
    "end": 4147.728,
    "text": " perhaps enough for APIC to be considered an active inference model of sorts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4149.55,
    "end": 4159.717,
    "text": "And then a few other features that are shared with active inference models in the strict sense, if one even exists, and also related modeling efforts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4159.837,
    "end": 4160.358,
    "text": "Anything to add?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4162.9,
    "end": 4165.061,
    "text": "No, they spelled it out pretty clearly here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4165.081,
    "end": 4166.082,
    "text": "You just want to read through this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4166.722,
    "end": 4167.803,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4167.823,
    "end": 4172.667,
    "text": "5.1 provides some predictions and some contrasts with the APIC model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4176.727,
    "end": 4180.209,
    "text": " 5.2, the body and the brain through the lens of control theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4182.851,
    "end": 4189.554,
    "text": "Figure 6, show how viscera sense data ascend in effect to become exafferent interoceptive prediction errors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4193.296,
    "end": 4196.098,
    "text": "Do you want to explain briefly what an exafferent means?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4196.118,
    "end": 4204.542,
    "text": "Because people might, they do explain that in the glossary, but it's basically an apparent signal on an apparent signal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4204.562,
    "end": 4205.503,
    "text": "There's a bit of recursion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4206.328,
    "end": 4208.089,
    "text": " there, you want to add anything to that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4209.229,
    "end": 4212.991,
    "text": "Um, I see the distinction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4214.071,
    "end": 4226.376,
    "text": "Just to highlight what afferent is, afferent is conducting or conducted inwards or towards something for the nerves, the central nervous system, for blood vessels, the organ supplied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4227.656,
    "end": 4231.418,
    "text": "And how would you distinguish exact efforts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4233.363,
    "end": 4236.125,
    "text": " It's just that it's that sort of cumulative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4237.186,
    "end": 4240.129,
    "text": "It's not sort of the initial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4242.631,
    "end": 4244.892,
    "text": "It's what I took away from that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4245.193,
    "end": 4247.054,
    "text": "The accumulation of those afferent signals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4250.457,
    "end": 4250.997,
    "text": "Interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4252.158,
    "end": 4252.759,
    "text": "I might be wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4252.999,
    "end": 4254.06,
    "text": "That's what I took away from it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4254.912,
    "end": 4257.894,
    "text": " Five-three, interoception and capacity curves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4259.175,
    "end": 4260.856,
    "text": "Theories of peripheral predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4261.957,
    "end": 4269.742,
    "text": "Reason that a neuron's most metabolically cheap responses should represent the predictable stimuli, whereas expensive responses are reserved for the most surprising stimuli.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4271.402,
    "end": 4277.705,
    "text": " Some predictions and suggestions from Barrett 2017 and findings of Dworkin 2013.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4278.345,
    "end": 4284.147,
    "text": "Certain peripheral interoceptors in humans reduce their apparent firing rate to zero under a constant stimulus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4285.008,
    "end": 4286.288,
    "text": "So that's kind of interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4286.388,
    "end": 4289.729,
    "text": "Like if no change, don't tell me about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4289.749,
    "end": 4295.712,
    "text": "And that should be cheap under a model where something is changing less often than not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4296.392,
    "end": 4296.592,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4300.215,
    "end": 4303.759,
    "text": " And there's some more hypotheses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4303.799,
    "end": 4316.455,
    "text": "We have hypothesized that increases in such responsiveness, which is the imperative in this APIC model, could function as rewards, positively reinforcing behavioral trajectories, while decreases in responsiveness could function as costs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4317.296,
    "end": 4319.557,
    "text": " negatively reinforcing behavioral trajectories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4320.378,
    "end": 4331.205,
    "text": "So keeping options open over the infinite time horizon becomes equivalent to keeping the business floating or keeping physiology bounded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4331.225,
    "end": 4332.225,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4334.527,
    "end": 4335.047,
    "text": "Continuity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4335.808,
    "end": 4352.567,
    "text": " instead of just maximizing amount of USD or calories, but rather having reduced or bounded surprisal about a range and a trajectory and a strategy, not in this model as stated here to generate that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4354.724,
    "end": 4357.185,
    "text": " 5.3 Interception and Capacity Curves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4358.565,
    "end": 4358.846,
    "text": "More.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4358.866,
    "end": 4359.486,
    "text": "5.4 Conclusions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4360.026,
    "end": 4364.227,
    "text": "Finally, we return to the amateur dodgeball player.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4364.247,
    "end": 4366.848,
    "text": "The amateur.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4367.308,
    "end": 4367.568,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4369.689,
    "end": 4382.033,
    "text": "And some summarizations of the APIC model and suggestions about its compatibility with the referent control hypothesis and some of its tractability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4384.471,
    "end": 4385.311,
    "text": " That's the discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4385.531,
    "end": 4391.192,
    "text": "Then Appendix B, Ergodicity, which we've talked about before, but it's kind of a cool topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4391.232,
    "end": 4395.713,
    "text": "So just to skip through these appendices, just discussing them with the authors, we hope.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4396.433,
    "end": 4405.895,
    "text": "Then some more equations in Equation B, Formulating Perception and Control Ergodically Leads to the Free Energy Principle, FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4407.776,
    "end": 4414.157,
    "text": "More of Appendix B. Appendix C, APIC Model Derivation Details Equations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4416.573,
    "end": 4435.119,
    "text": " c.1.2 full derivation of optimal value function and transition dynamics more equations the path integral form for the value desirability function gives its name to the technique of path integral control and so on a kind of closing note",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4436.451,
    "end": 4462.883,
    "text": " we wondered how this connects to the Bayesian mechanics and to the path formulation, the rightmost of the three faces of Bayesian mechanics and about how coming potentially from quite a different starting point and with different approaches and constraints, some similar features",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4465.603,
    "end": 4473.868,
    "text": " might have arisen and been highlighted in APIC that are also highlighted and relevant for Bayesian mechanics in the path formalization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4474.568,
    "end": 4482.113,
    "text": "And maybe there's like a kind of unmapped Venn diagram there and some similarities and differences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4484.494,
    "end": 4493.759,
    "text": "The proximity to the last live stream, whether by accident or by intent, makes the way that you look at this paper",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4497.208,
    "end": 4498.328,
    "text": " Interesting, I'll just say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4499.369,
    "end": 4500.949,
    "text": "Yeah, agreed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4501.609,
    "end": 4505.951,
    "text": "Well, anything you want to close with?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4506.991,
    "end": 4523.716,
    "text": "I think the idea of being able to look at modeling, internal modeling, and sort of the coordination of that, either, again, kind of as a minimum too, either as a risk management or risk minimizing exercise, therefore a limiting strategy,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4524.793,
    "end": 4532.399,
    "text": " or as an option generating or an expanding strategy will be something really interesting to talk to the authors about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4533.0,
    "end": 4547.671,
    "text": "Because again, I can't, I can't really figure out whether or not the APIC model works in both domains until I get past the jump between formalism 13 and all the way up to 17, 18, 19, or 20.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4547.771,
    "end": 4550.173,
    "text": "But I mean, with an explanation of that and a, and a,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4554.201,
    "end": 4573.671,
    "text": " and a gentle prod, it'd be interesting to find out how that works when those things seem to be, we as physiological entities are able to juggle both the risk management and the option generating or option expanding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4574.231,
    "end": 4577.433,
    "text": "So I am really actually quite excited about that from a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4579.093,
    "end": 4580.054,
    "text": " Here's what I'm feeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4580.734,
    "end": 4590.34,
    "text": "How should I read that in terms of how far out I can make my next bet from an allostatic perspective?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4590.38,
    "end": 4592.661,
    "text": "I think that's really exciting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4592.681,
    "end": 4599.966,
    "text": "Like I said, if I can get a better sense of how that jump works in their model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4603.496,
    "end": 4617.653,
    "text": " Yeah, definitely interested in that infinite time horizon and that mentality of like, what's the best physiological decision over the infinite horizon?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4617.673,
    "end": 4620.516,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4621.297,
    "end": 4622.339,
    "text": "That's a great question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4623.3,
    "end": 4634.568,
    "text": " and yeah the eternal now the presence and then um also just a little bit more mundanely like what kind of data are relevant for this type of model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4635.655,
    "end": 4639.277,
    "text": " Is it data that already exists for people?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4640.298,
    "end": 4653.405,
    "text": "Is it something where you can extrapolate a lot from a sparse data set or do you need a bunch of replication to get good statistical confidence on the model parameter and extract findings that are like non-trivial?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4656.226,
    "end": 4661.37,
    "text": " And where's this technology or approach being used or where could it be used?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4661.51,
    "end": 4665.313,
    "text": "There's like a lot of things that'll be interesting to talk about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4666.233,
    "end": 4673.998,
    "text": "Well, thank you for all the preparation and help on this one, Dean, and see you in the dot one and beyond.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4674.018,
    "end": 4675.66,
    "text": "All right, my friend, take care.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4676.08,
    "end": 4676.26,
    "text": "Bye.",
    "speaker": "SPEAKER_02"
  }
]