[
  {
    "start": 29.056,
    "end": 32.724,
    "text": " hello everyone welcome to active lab live stream number 46.2 it's june 22nd 2022.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 38.442,
    "end": 39.823,
    "text": " Welcome to the ACT-INF Lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 40.503,
    "end": 46.026,
    "text": "We're a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 46.686,
    "end": 48.527,
    "text": "You can find us at the links on the slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 49.788,
    "end": 55.431,
    "text": "This is a recorded and an archived live stream, so please provide us with feedback so we can improve our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 56.471,
    "end": 61.474,
    "text": "All backgrounds and perspectives are welcome, and we'll follow video etiquette for live streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 63.339,
    "end": 72.368,
    "text": " Head over to ActiveInference.org to learn about participating in livestreams or in the many other Active Lab projects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 75.932,
    "end": 85.342,
    "text": "We're here in our third discussion on the paper, Active Inference Models Do Not Contradict Folk Psychology by Smith, Ramstad, and Kiefer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 86.721,
    "end": 107.306,
    "text": " had a dot zero with ryan joining and jacob and dean where we talked through some of the background of this paper and last week in the dot one we had a great discussion went a lot of ways as dot ones do and opened up some threads to continue discussing in this dot two",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 108.286,
    "end": 111.429,
    "text": " I know each of you have some things to bring up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 111.489,
    "end": 115.893,
    "text": "There's also a few key sections of the paper that we haven't gone into in much detail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 116.513,
    "end": 119.135,
    "text": "So there'll be a lot to do in the dot-to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 119.776,
    "end": 124.12,
    "text": "And of course, everybody watching live is also welcome to make comments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 126.101,
    "end": 129.564,
    "text": "We'll start with just an introduction and warm-up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 130.56,
    "end": 152.89,
    "text": " we can say hi and add anything else that we're looking forward to talking about or to reducing our uncertainty about through today's discussion or maybe even if it's not too early where we'd like to be heading as we take off on this dot 2 and leave the 46 series how does it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 155.399,
    "end": 167.426,
    "text": " result in us being different thinking differently acting differently in the rest of our post 46 lives so I'm Daniel I'm a researcher in California and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 168.962,
    "end": 177.689,
    "text": " Just a conversation with Dean before we began about some other core concepts other than beliefs, desires, and intentions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 178.41,
    "end": 181.052,
    "text": "So what other acronym models could we use?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 181.993,
    "end": 189.939,
    "text": "What other kinds of models are consistent or where else can Active Inference be providing us extra information or utility?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 191.42,
    "end": 192.041,
    "text": "And a few other things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 192.641,
    "end": 193.862,
    "text": "And I'll pass it to Dean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 195.663,
    "end": 196.064,
    "text": "Thanks Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 196.124,
    "end": 197.485,
    "text": "I'm Dean here in Calgary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 198.684,
    "end": 202.666,
    "text": " I think what I'm curious about is a couple of things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 202.746,
    "end": 211.951,
    "text": "As I said, I'm curious about things or behaviors that appear to be targeted versus behaviors that appear to be non-targeted.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 212.531,
    "end": 216.813,
    "text": "And there's some reference to that in this paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 217.453,
    "end": 224.917,
    "text": "The other thing, as I said, I'm kind of curious about is this moving to the place of saying that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 226.556,
    "end": 233.588,
    "text": " Active inference has these different types, be it extended or decision making or motor active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 234.144,
    "end": 235.624,
    "text": " what the implications of that are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 235.644,
    "end": 253.768,
    "text": "The bottom line for me is I think if we can operationalize that word through active inference, it shouldn't be difficult to figure out that that applies to behaviors, that there's operations grounding a lot of behaviors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 253.828,
    "end": 256.309,
    "text": "So yeah, that's what I'm kind of curious about today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 256.349,
    "end": 257.909,
    "text": "I'll pass it to David.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 261.244,
    "end": 285.505,
    "text": " great to be back uh it's my second time on here really uh appreciate this i'm i'm on uh 33 so i've listened through lecture 33 so i'm almost uh caught up to uh the current i look forward to having daniel on my channel friday 4 p.m eastern time um you know there's so much to active inference because it's a useful framework for",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 286.687,
    "end": 296.109,
    "text": " countless different fields and specifically related to this I had your definitely thoughts and then how do we look at the mechanics of the equation versus",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 298.536,
    "end": 303.701,
    "text": " We call folk psychology, but I would put that generally into what I would call introspection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 303.721,
    "end": 319.856,
    "text": "I have a background in theology, and I've thought a lot about introspection and trying to match what we see through various methods of introspection and maybe where the science and mathematics is leading us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 320.536,
    "end": 330.161,
    "text": " And also, I guess, the field of psychometrics that isn't necessarily introspection, but it may or may not match the equations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 330.601,
    "end": 332.502,
    "text": "And then how do we describe the phenomenon?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 333.362,
    "end": 338.505,
    "text": "You understand them, or maybe they're not descriptible, saying that we describe them with the mathematical equations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 339.065,
    "end": 349.67,
    "text": "And there's not really any good way to translate that into words that would be understandable to folk, common people in that way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 353.371,
    "end": 353.691,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 354.071,
    "end": 354.292,
    "text": "Ali?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 357.053,
    "end": 358.114,
    "text": "Hi, I'm Ali.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 358.194,
    "end": 360.655,
    "text": "I'm an independent researcher from Iran.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 361.856,
    "end": 369.1,
    "text": "I'm very glad to be here and I'm looking forward to learn more about this fascinating paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 369.12,
    "end": 376.825,
    "text": "Especially, I'm interested in exploring phenomenological aspects of BDI",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 377.95,
    "end": 397.7,
    "text": " believe, desire and intention, and also to explore somewhat more deeply the philosophical underpinnings of representation versus simulation aspect of modeling VDI in active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 399.14,
    "end": 402.502,
    "text": "And yeah, that's it for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 404.023,
    "end": 404.203,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 405.498,
    "end": 412.188,
    "text": " Let's begin with this more taxonomic question about the types of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 412.969,
    "end": 418.838,
    "text": "So we can think about different types that we've heard about in this paper and elsewhere, and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 420.717,
    "end": 426.884,
    "text": " whether or not we have something to contribute about adding a specific type to this list that will continue to grow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 427.785,
    "end": 433.411,
    "text": "What does it mean or entail that we do have these different types?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 433.972,
    "end": 437.876,
    "text": "So just to review in this paper, 46,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 439.398,
    "end": 448.409,
    "text": " They make a very clear upfront distinction between what they characterize as motor actinth, MAI, and decision actinth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 449.11,
    "end": 453.796,
    "text": "And there's a few differences between motor and decision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 455.418,
    "end": 457.681,
    "text": "Who can list one category of difference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 462.128,
    "end": 468.334,
    "text": " Well, the motor active inference doesn't typically require that you have to make a decision.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 468.434,
    "end": 484.889,
    "text": "It's more a reaction or a reflective form as compared to the decision active inference, which does, as the papers say, likely map over to the desire question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 486.192,
    "end": 486.432,
    "text": " Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 487.152,
    "end": 492.313,
    "text": "So the motor AI was connected to motor reflex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 493.254,
    "end": 497.755,
    "text": "Are there decision-making reflex?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 498.295,
    "end": 510.638,
    "text": "Even if that's not a classical usage, like in the reflex arc of the spine or something, moving the hand away from a hot surface, are there cognitive reflexes?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 518.112,
    "end": 519.112,
    "text": " Not really sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 519.572,
    "end": 546.079,
    "text": "I just basically was asking in the context of people who are writing these papers now who are bringing the question down to a motor operational behavior standpoint, how breaking active inference up into different classifications is that in response to a bigger problem, which is the behavior doesn't necessarily",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 550.08,
    "end": 576.254,
    "text": " behavior isn't something that's necessarily, we're able to conveniently dissolve down to or concentrate down into motor operations or extensions or any of those other different things that the writers tend to want to focus on now, as opposed to sort of the complexity and the variety and the randomness of behavior as a whole, so.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 579.17,
    "end": 580.971,
    "text": " Yes, great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 581.392,
    "end": 584.394,
    "text": "So this is from page 81.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 584.514,
    "end": 585.575,
    "text": "Oh, yes, Ali, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 588.657,
    "end": 601.606,
    "text": "Well, I think the distinction between MAI and DAI is not globally accepted among, well, various researchers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 602.287,
    "end": 606.45,
    "text": "For instance, if we look at the work of Alan Berthouds,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 608.0,
    "end": 615.785,
    "text": " French neuroscientist, especially his book, I think it was called The Brain's Sense of Movement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 616.706,
    "end": 626.052,
    "text": "In that book, he actually has a famous quote, namely, perception is simulated action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 627.153,
    "end": 634.978,
    "text": "And by this, he means that he implies that perception and motion and motion and perception or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 635.836,
    "end": 639.501,
    "text": " thinking for that matter, are irreducibly interconnected.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 640.122,
    "end": 650.395,
    "text": "And so the former defines the latter because of the intrinsic motricity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 651.327,
    "end": 655.17,
    "text": " uh, uh, of the creatures endowed with, uh, nervous systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 655.85,
    "end": 678.063,
    "text": "Uh, so I'm not sure if we can, uh, distinguish between MAI and DAI in such a, uh, clear cut manner, uh, because as we know that most motor, uh, most, uh, um, motricity and, uh, motor or actions, uh, are also, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 680.143,
    "end": 684.686,
    "text": " predefined in that perception or many other thought processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 687.388,
    "end": 687.669,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 688.109,
    "end": 688.329,
    "text": "David?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 692.032,
    "end": 704.842,
    "text": "Yes, I didn't know enough about the BDI model or the, you know, I'm still new to the language, especially of the authors of this paper, to the general philosophy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 705.243,
    "end": 708.145,
    "text": "But, you know, I was talking a lot about last week about the unified I,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 709.509,
    "end": 724.282,
    "text": " and higher order rules so if you want to look like decision as higher order rules and they would have some sort of power like usually when we think of consciousness in a unified eye that makes decisions and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 726.238,
    "end": 730.761,
    "text": " We talked about eliminativism and the implications of the equations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 730.841,
    "end": 732.202,
    "text": "Are they eliminativistic or not?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 732.882,
    "end": 737.525,
    "text": "And what direction does the evidence take us?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 738.485,
    "end": 748.911,
    "text": "And so in terms of motor control, like I mentioned, Fodor's modular mind, that it could be that it's a threshold, it's a free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 750.393,
    "end": 764.931,
    "text": " And it could just be action, reaction, sense perception, and then a module of our mind sends some perception of however we understand consciousness that makes it appear to us like we made a decision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 767.031,
    "end": 779.476,
    "text": " I mean, but that may not be accurate that you're the equations might hint that that's not actually what's going on it's simply free energy threshold being reached the threshold could conceivably have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 780.337,
    "end": 794.363,
    "text": "Nothing or very little to do with the decision making process and it could be post facto like the lead that experiments that the perception, like we made a decision actually comes post facto from the threshold.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 799.025,
    "end": 799.245,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 799.565,
    "end": 799.946,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 800.786,
    "end": 813.276,
    "text": "Also, I think Adam Safran, who had discussed those Libet experiments, does find a space for agency, if that's not too coarse of a simplification.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 813.396,
    "end": 821.403,
    "text": "But there is some interesting ways to think about what that experiment does or doesn't show.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 821.423,
    "end": 826.167,
    "text": "Maybe we can return to that when we kind of have some figures and details.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 826.307,
    "end": 826.487,
    "text": "Dean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 828.362,
    "end": 851.75,
    "text": " yeah i didn't know what you guys were talking about with this illimitativist thing until i went back to the paper and then i found this and i'll just quote it we also this is from the paper we also motivate a squarely non-illimitivist position with respect to such constructs and suggest that the set of theoretical primitives out of which the active inference models are built is sufficient not only to recover the categories",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 852.31,
    "end": 858.492,
    "text": " a folk psychology, but also to potentially nuance them with more fine-grained distinctions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 858.752,
    "end": 868.674,
    "text": "So I'm not sure exactly, David, what you've been saying either corresponds with that or not, but I'm kind of curious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 871.055,
    "end": 871.615,
    "text": "Yeah, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 873.516,
    "end": 890.413,
    "text": " Yeah, I mean, to me, it's a fallacy that, you know, like a best of both worlds fallacy that materialistic research into consciousness make is that in reality, my understanding of the conclusions of what they're saying is that it is a limit of this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 890.773,
    "end": 893.256,
    "text": "And they'll put a little statement in like it's not a limit of this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 894.057,
    "end": 897.16,
    "text": "But what is the evidence of their models actually say?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 897.96,
    "end": 903.224,
    "text": " And can they actually program like a unified eye?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 903.885,
    "end": 907.548,
    "text": "And did they eliminate the unified eye?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 908.228,
    "end": 912.772,
    "text": "And it's just a bunch of perceptions and various factors that reach a threshold.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 913.512,
    "end": 916.955,
    "text": "And what does it mean to make a decision?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 918.056,
    "end": 924.841,
    "text": "And that's why I said, do we just throw away thousands of years of dualistic theology?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 928.003,
    "end": 935.51,
    "text": " How people, our whole lexicon of consciousness, psychology comes from a dualistic tradition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 936.35,
    "end": 945.498,
    "text": "So if they're trying to grandfather in these dualistic concepts, but even the evidence of what they're saying doesn't necessarily seem to warrant it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 946.078,
    "end": 947.88,
    "text": "And then, you know, do they have the courage?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 948.5,
    "end": 954.403,
    "text": " to be like, no, unfortunately, the evidence points to illimitivism and go with that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 954.843,
    "end": 961.507,
    "text": "So, I mean, in my impression, they kind of just throw in the statement, but it's unclear how they're, you know, how they're doing it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 961.527,
    "end": 965.089,
    "text": "Because, you know, I guess, you know, it's going to be unpopular to be an illimitivist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 965.429,
    "end": 970.371,
    "text": "It's kind of like the free will question that, I mean, illimitivism also relates to free will.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 971.232,
    "end": 974.954,
    "text": "But, you know, to stand up and be like, no, I'm sorry, free will doesn't exist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 975.534,
    "end": 976.895,
    "text": "That's where the evidence is pointed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 977.875,
    "end": 980.657,
    "text": " sort of put in there that they're not trying to say that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 981.357,
    "end": 985.0,
    "text": "But my impression, I think they actually are trying to say that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 987.601,
    "end": 997.707,
    "text": "Or that's where the evidence of their conclusions are saying, and they just have a human weakness that doesn't want to go so far as to follow the evidence of their research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1000.157,
    "end": 1027.739,
    "text": " interesting so just to continue on this motor and decision ai so page five mai does not make decisions once a decision has been made about what to do mai uses proprioceptive prediction signals to move the body to carry out the decided action sequence and elsewhere we've talked about that sort of set point and then a transient suppression of precision which allows the body to reach this new spatial position",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1029.574,
    "end": 1033.678,
    "text": " and also these models have tended to be formulated in continuous time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1034.479,
    "end": 1046.312,
    "text": "Whereas decision AI plugs in very nicely to the motor AI because it is explicitly considering decision making and these higher order rules that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1047.498,
    "end": 1072.379,
    "text": " have to do with either if you take a more realist perspective what organisms or cognitive systems are doing or the more instrumental perspective which is just this is how the the process of decision making can be modeled and it's about what which decisions are made about what to do in order to generate some observations and not others and it's that uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1073.308,
    "end": 1083.854,
    "text": " focus on the observations that are generated under different courses of action and their evaluation in terms of expected free energy that also ties it closely to like perceptual control theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1085.615,
    "end": 1087.216,
    "text": "So that's the distinction they bring up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1088.336,
    "end": 1094.56,
    "text": "And again, whether in the real world, this carves cognitive systems at the joint is one question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1095.32,
    "end": 1099.663,
    "text": "In the world of the theories as constructed, this is a clean separation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1101.121,
    "end": 1109.507,
    "text": " Although as Ali brought up, that doesn't mean that it's widely accepted or even if everybody heard about it that they would necessarily agree with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1111.823,
    "end": 1114.243,
    "text": " And there may be phenomena that are mixtures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1114.484,
    "end": 1122.925,
    "text": "And that's also why they talk about the hybrid models where it's like decision-making at a higher level and then motor at a lower level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1123.305,
    "end": 1129.287,
    "text": "So that could allow decisions about what section of a face to look at or what section of a page to read.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1130.067,
    "end": 1138.168,
    "text": "And then that decision becomes implemented in a continuous motor active inference context through ocular motor action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1138.628,
    "end": 1138.848,
    "text": "Dean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1141.169,
    "end": 1141.429,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1143.038,
    "end": 1158.806,
    "text": " I don't think I'm leading with this question about are we moving to a place that says that active inference will have different types because I think that there's math that's used in financial situations, those operations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1159.206,
    "end": 1162.608,
    "text": "There's math that's used in mechanical situations, those operations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1162.648,
    "end": 1168.571,
    "text": "So I think it's a natural byproduct of, so how do you make the math work?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1169.844,
    "end": 1170.984,
    "text": " given the circumstance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1171.024,
    "end": 1182.227,
    "text": "I don't think that there's anything about this that's saying active inference doesn't work just because you want to make sure that you're applying the proper formula to the thing that you're trying to describe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1182.727,
    "end": 1190.009,
    "text": "But I do think it's interesting that in order to be able to describe it more precisely, you just can't say active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1190.029,
    "end": 1195.671,
    "text": "You have to kind of figure out what the math is for the specific condition that you're trying to analyze.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1197.577,
    "end": 1199.499,
    "text": " Yeah, definitely makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1199.639,
    "end": 1205.286,
    "text": "Let's now move to this lower part of the page on the different adjectives that we've seen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1206.047,
    "end": 1209.291,
    "text": "So people can probably add or think of more or even imagine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1209.511,
    "end": 1213.195,
    "text": "There's so many adjectives in the textbook called the dictionary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1214.577,
    "end": 1242.122,
    "text": " We've talked about extended active inference, which was addressing extended cognitive features and phenomena, where there could be sort of a offloading, which was when the adaptive active entity is going to utilize something that is more like a notepad, like it's offloading memory onto the notepad, and then the entity is holding on to information about how to seek that information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1243.564,
    "end": 1247.767,
    "text": " Or on both sides of the interface, there could be adaptive act-inf.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1247.807,
    "end": 1253.032,
    "text": "And so that was like the sort of true emergent extended cognitive processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1254.953,
    "end": 1259.417,
    "text": "Deep active inference and citations could be added, didn't get them for all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1261.57,
    "end": 1268.336,
    "text": " was utilized to describe temporal depth in terms of longer and longer time horizons of considerations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1268.976,
    "end": 1286.892,
    "text": "This was really an important development because it moved beyond the sort of one-shot next step model of active and help manage this trade-off between considering time horizons as well as taking action in the time step that the entity is actually in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1288.696,
    "end": 1310.817,
    "text": " sophisticated active inference and various other cousins of it utilized hierarchical modeling which could have temporal depth at one or multiple levels but doesn't need to it does and it could but this is referring to like the thickness or the hierarchical modeling component",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1311.778,
    "end": 1338.472,
    "text": " uh affective active inference which was used by hesped all to refer to uncertainty parameters and some of the cognitive interpretations of uncertainty parameters as being related to valence um and then there's others like branching time act infants um it comes to what dean said which is just saying like we use active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1339.838,
    "end": 1346.395,
    "text": " may not reduce uncertainty enough any more than we used a linear model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1347.898,
    "end": 1353.822,
    "text": " whether just talking about it casually or writing the paper, more information has to be provided.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1354.422,
    "end": 1363.488,
    "text": "And so this is starting to build the taxonomy and the classifications and the ways of communicating, reducing uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1363.588,
    "end": 1368.212,
    "text": "Okay, you went to that hemisphere, but was it this continent or that continent?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1368.672,
    "end": 1370.713,
    "text": "Was it this coast or was it that coast?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1370.733,
    "end": 1376.937,
    "text": "Like zooming in, ultimately resulting in just describing the particulars of the model that was constructed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1377.558,
    "end": 1377.718,
    "text": "Ali?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1381.341,
    "end": 1400.135,
    "text": " Well, adding to what Dean has just said, well, I don't think that these different flavors and versions of active inference that have recently been branched up, they don't necessarily concern themselves with different situations or different niches.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1401.375,
    "end": 1404.418,
    "text": "For example, that last one, branching time active inference,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1405.579,
    "end": 1417.147,
    "text": " Well, that was a very recent version of active inference, which was, yes, this is the paper they introduced that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1417.727,
    "end": 1424.212,
    "text": "And it's basically a more efficient computational approach to active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1425.032,
    "end": 1428.335,
    "text": "And it's just the traditional active inference, but in a more",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1429.355,
    "end": 1457.229,
    "text": " efficient with a more efficient algorithm to compute the all the parameters needed yes sometimes it's these adjectives are describing heuristics or implementations or algorithms other times they're describing the model structure other times they're referring to the context that the model is being applied to like an extended cognitive system dean",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1458.499,
    "end": 1461.421,
    "text": " Yeah, that's what I was going to ask Ali about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1461.481,
    "end": 1466.565,
    "text": "So if I'm saying something more efficient, what am I saying is more efficient relative to?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1471.307,
    "end": 1494.955,
    "text": " Well, relative to the traditional approach to active inference that has been proposed for the past decade or two, and also relative to the other approaches that are similar to active inferences approach, but not exactly equivalent to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1495.455,
    "end": 1499.837,
    "text": "For instance, reinforcement learning approaches and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1501.271,
    "end": 1519.507,
    "text": " And one other kind of analogy or mapping there would be like, when a new variant of a neural network architecture is introduced, there's a pomp and circumstance to announce the novelty and the relevance of this for somebody who's in that field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1520.247,
    "end": 1529.455,
    "text": "Similarly, when there's a new variant or a new focus, whether model structure, model target, or something else related to evolutionary biology,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1530.962,
    "end": 1557.394,
    "text": " sometimes a new word will come in, but then that new target or model structure, if it becomes used and it's sufficiently close that it's not rejected from the rest of the body of theory, if it's an incoherent usage of the adjective, someone says, well, I made simple active inference and it has this totally different structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1558.752,
    "end": 1563.975,
    "text": " that might not become incorporated into the network of active inference models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1564.755,
    "end": 1583.345,
    "text": "Whereas if it does become incorporated through its theoretical compatibility or utility in modeling that phenomena, or it's presented in terms of a model architecture that does apply elsewhere, the adjective kind of gets dropped",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1584.212,
    "end": 1589.016,
    "text": " And then it just goes back to being neural networks, back to being active inference, back to being evolutionary biology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1589.657,
    "end": 1591.759,
    "text": "And then the field moves on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1592.039,
    "end": 1595.362,
    "text": "And so the adjectives are just kind of like another brick in the wall.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1596.483,
    "end": 1596.703,
    "text": "Doof it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1600.967,
    "end": 1616.595,
    "text": " Yeah, I also mentioned last week, I'm not sure if it would go here in this section, is the purpose-driven behavior, action, or even perception related to a unified I and I.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1617.916,
    "end": 1636.905,
    "text": " even if it's on the pure level of sense perception is it just that we have uh you know these perceivers and they perceive and then how are the signals read and uh i mean it's easier to describe this in a liministic way whether we're limited or not uh in the for the predictive mind",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1637.505,
    "end": 1644.29,
    "text": " is the main struggle, so to say, between short-term goals and long-term goals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1644.35,
    "end": 1647.152,
    "text": "And then you have to put in what axioms are we making?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1647.713,
    "end": 1660.602,
    "text": "Is there some sort of, for the higher order rules, if we assume that there's some sort of rule that like an organism acts in its own self-interest, in its own, you know, sort of say desire to survive,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1661.202,
    "end": 1684.513,
    "text": " or to uh replicate and then you the only struggle would be between short-term and long-term actions like you know God forbid here we have a mosquito pandemic I was gardening and got you know eaten up by mosquitoes and it was just a sense you're replying to the environment like I have an itch should I itch it or should I have some longer term that'll go away quicker if uh if I don't itch it",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1685.073,
    "end": 1699.104,
    "text": " And is that something that's even in the subconscious where just naturally I would have an itch and I would itch it, but then I would somehow enter a longer term decision-making process that would tell me to act in a different way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1699.544,
    "end": 1709.632,
    "text": "And even in terms for how I'm going to interact with the environment in the future, let alone something that might have a moral or ethical implication.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1709.672,
    "end": 1712.414,
    "text": "So if you have a simplified model of just a,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1714.918,
    "end": 1743.569,
    "text": " where do we need purpose for sense perception to work and for motor control to work even in terms of reflexes because i think uh you're just even on the motor control let alone the decision making uh you know where does the decision making uh go and what's the purpose behind it and then how is that purpose derived yes so we can go to uh targeted non-targeted",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1746.282,
    "end": 1766.415,
    "text": " Another branch point is I think this important question of mapping from real-world phenomena and even direct felt experiences like aesthetic or just more generally phenomenological and anything about a formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1767.436,
    "end": 1770.178,
    "text": "And I'm not sure if I've quoted too narrowly,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1771.952,
    "end": 1784.577,
    "text": " But they are writing that intentions, so just to review the BDI, the beliefs and the desires come together, and that is what generates the intention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1784.997,
    "end": 1793.941,
    "text": "There's the desire for the ice cream, and there's the belief that there's the ice cream truck, and that is what generates the intentional behavior of pursuing the ice cream truck.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1794.821,
    "end": 1801.827,
    "text": " Intentions map straightforwardly to policies with the lowest value for expected free energy, which is calculated across different policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1803.288,
    "end": 1808.432,
    "text": "Policies are affordances that can be taken over a given time horizon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1808.972,
    "end": 1812.976,
    "text": "So over a time horizon of three, it's the combination of affordances of length three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1814.068,
    "end": 1824.379,
    "text": " Almost all the variables in the DAI model are candidates for traditional psychological beliefs if being used to model the right kinds of high level cognitive processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1825.46,
    "end": 1826.881,
    "text": "So what are the right kinds?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1827.702,
    "end": 1829.624,
    "text": "But then later in footnote five,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1830.558,
    "end": 1836.42,
    "text": " This is distinguishing in what they characterize as a different reading of desire.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1837.04,
    "end": 1843.502,
    "text": "This reading is not the thing that is desired, but instead about the transient presence of the motivational force to approach the thing we desire.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1844.442,
    "end": 1846.383,
    "text": "So it's like, why did you go there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1846.543,
    "end": 1847.843,
    "text": "It was my desire to go there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1848.443,
    "end": 1849.704,
    "text": "What moved you to go there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1850.164,
    "end": 1850.544,
    "text": "Desire.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1851.564,
    "end": 1857.026,
    "text": "So it's almost like desire in the specifics, and then also seeing it as a motivating force",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1858.626,
    "end": 1874.054,
    "text": " But then they note that habit might not have a direction of fit, and it illustrates another reason consistent with our broader argument concerning desires not to assume that probability distributions in the formalism must be mapped onto beliefs at the psychological level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1875.255,
    "end": 1885.32,
    "text": "So they're candidates if we do it right, but it isn't an assumption that they must be mapped onto beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1893.482,
    "end": 1916.617,
    "text": " Well, I wanted to mention the broader sense of the term intentionality, which I think here is referred to because you see, for all the entities defined by markup blankets and defined by the existence of their markup blankets and their ergodic behavior,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1917.285,
    "end": 1925.072,
    "text": " Well, we need an entity who can treat an effect as being about its cause.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1925.853,
    "end": 1930.537,
    "text": "An entity who can follow the direction from effect to cause.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1930.697,
    "end": 1936.723,
    "text": "And we also need an entity who can treat an isomorphic map.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1938.62,
    "end": 1945.363,
    "text": " as being about what it maps, or let's say as oriented toward what it maps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1945.703,
    "end": 1956.688,
    "text": "Well, in both of these cases, the directionality or orientation can be referred to as intentionality in its broad sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1959.201,
    "end": 1973.792,
    "text": " So just to clarify there, so the second piece you mentioned was the entity needs to be able to treat some sort of isomorphic or structure-preserving mapping as having an aboutness of the target, like the map of the city",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1974.932,
    "end": 1977.114,
    "text": " translating that into the physical movement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1977.674,
    "end": 1981.056,
    "text": "And then there was a causal inference question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1981.777,
    "end": 1995.587,
    "text": "Entity can trace causes such that they're doing some kind of causal mapping where agency is the belief that one can be the cause of future aspects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1995.647,
    "end": 2003.933,
    "text": "So is this agency or is this causal modeling that could happen in the absence of entity level agency?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2006.122,
    "end": 2013.534,
    "text": " I think it's broader than necessarily being a cognitive agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2014.195,
    "end": 2018.682,
    "text": "You see, it's any abstract entity that can",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2022.034,
    "end": 2036.422,
    "text": " that can sketch out these kinds of causal relationships between the signs and their either icons or their indices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2036.762,
    "end": 2044.046,
    "text": "So it's much broader and more abstract than necessarily cognitive agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2045.728,
    "end": 2047.891,
    "text": " What kind of entities are you thinking of?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2049.153,
    "end": 2055.443,
    "text": "And isn't it manipulation and that kind of logical juxtaposition?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2055.783,
    "end": 2060.511,
    "text": "No, the one obvious example would be neural networks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2061.741,
    "end": 2062.301,
    "text": " neural nets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2063.042,
    "end": 2070.465,
    "text": "We don't necessarily bestow upon neural networks a cognitive agency, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2070.545,
    "end": 2083.65,
    "text": "But they can well match at least their input patterns onto their output indices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2092.307,
    "end": 2116.304,
    "text": " and it's um these continuums of agency continuums of cognitive systems it's like easy to forget we're we're talking about a cognitive modeling framework albeit one that has a motor cousin mai and motor motor modeling history because the mai distinction is um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2117.765,
    "end": 2121.766,
    "text": " Also historical, like in terms of which models were developed when.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2126.147,
    "end": 2129.908,
    "text": "And is this pan-cognitivism?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2131.289,
    "end": 2135.13,
    "text": "Are we modeling everything as if it is on the continuum of cognitive entities?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2135.43,
    "end": 2141.932,
    "text": "Like, I don't know if it's as controversial to say that a neural network is a cognitive artifact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2143.3,
    "end": 2155.588,
    "text": " it might not be self-perpetuating or embodied or have open-ended agency or all these other features that some cognitive systems have, but what makes it not cognitive, if you meant that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2158.31,
    "end": 2164.575,
    "text": "Well, probably the cognitive here was not a proper adjective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2165.795,
    "end": 2172.32,
    "text": "Perhaps what I meant was to be, I don't know, a kind of conscious agent or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2173.081,
    "end": 2198.059,
    "text": " But again, on the subject of using the adjective cognitive for neural networks, well, there are quite a few opponents to this characterization for neural networks because they believe that neural networks as agents don't necessarily...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2200.501,
    "end": 2217.492,
    "text": " decide on their cognitive basis how to map between the inputs and outputs, because that's the difference between representation and simulation if we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2218.637,
    "end": 2223.279,
    "text": " well, can differentiate between those two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2223.919,
    "end": 2233.081,
    "text": "So probably, yeah, the more suitable adjective here should be a conscious agent as opposed to cognitive agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2234.762,
    "end": 2247.766,
    "text": "Does that not take us extremely far afield out of where we lose touch with empirical measurements, for example, and enter into important",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2249.104,
    "end": 2256.645,
    "text": " philosophical questions, but ones that take us away from our cognitive leg.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2257.446,
    "end": 2265.127,
    "text": "And psychology, perhaps even especially folk psychology, is sitting at the intersection of cognitive systems, philosophical, self-reflexive systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2265.967,
    "end": 2272.729,
    "text": "So it's almost like a question of this teetering stack of folk psychology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2272.789,
    "end": 2274.769,
    "text": "Which way will it end up falling?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2276.144,
    "end": 2293.092,
    "text": " Elimitivism perhaps is saying we'll be able to dispense with classical philosophical debates or some aspects of them by just moving everything that was folk psychological into a mathematical cognitivist framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2295.873,
    "end": 2305.338,
    "text": "Well, what I mean here is that, well, the term intentionality here can also be used",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2306.201,
    "end": 2321.807,
    "text": " in abstract models of active inference and not necessarily well in the cases where we unambiguously deal with conscious entities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2321.867,
    "end": 2322.587,
    "text": "That's what I mean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2325.268,
    "end": 2333.612,
    "text": "I think one of the takeaways of this paper or one of the implications of this paper would be that if",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2334.696,
    "end": 2350.398,
    "text": " intentions in folk psychology are beliefs plus desires and beliefs and desires are identifiable quantities in the academic formalism",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2351.65,
    "end": 2369.814,
    "text": " Then, by constructing entities consistent with the act of formalism, it can be said that they have intentionality, because it could be said that they have beliefs and desires, and so then it would only make sense to call the behaviors arising from beliefs and desires to be intentional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2371.021,
    "end": 2381.909,
    "text": " So doesn't this conceptualization of intentionality also subsume the more strict or narrow sense of that term?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2383.07,
    "end": 2398.502,
    "text": "Because, well, in this sense, if we infer from the use of intentionality here as referring to only conscious agents,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2399.362,
    "end": 2412.193,
    "text": " Well, in that case, the whole purpose of simulating active inference agents could potentially, well, raise some questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2412.913,
    "end": 2421.58,
    "text": "I'm not sure if I could express myself clearly on this matter or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2421.62,
    "end": 2422.441,
    "text": "Very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2422.801,
    "end": 2423.622,
    "text": "Dean, and then do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2425.965,
    "end": 2433.008,
    "text": " So maybe amongst the three of you, you can help me with this because I don't really keep up with the latest news on neural nets.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2433.129,
    "end": 2443.814,
    "text": "But if I were to look at a neural net, I would assume that most of those nets are given some kind of a target.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2444.714,
    "end": 2447.636,
    "text": "Even if they go out and forage for it, there is something about that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2447.676,
    "end": 2454.199,
    "text": "But what I've always been curious about is, especially in the context of this paper, is that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2455.47,
    "end": 2461.235,
    "text": " If there is a target, that's been sort of linked to desire in this paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2461.355,
    "end": 2468.821,
    "text": "And if there's a curiosity aspect to the agent or the net, that's been sort of linked to non-targeting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2469.501,
    "end": 2478.969,
    "text": "So if that's one continuum, the orthogonal aspect of that also in the paper is that there's a reward seeking component",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2480.197,
    "end": 2487.922,
    "text": " say on the left of that, there's an information seeking or an information and ambiguity component to the right of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2488.342,
    "end": 2489.963,
    "text": "So here's my question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2491.424,
    "end": 2509.195,
    "text": "Unless we say that curiosity actually is a target, which this paper says it's actually a non-target and the operation and the formalism actually points that out, then how do we set something up like a neural net to actually be curious?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2510.026,
    "end": 2522.612,
    "text": " Because we can be curious, we can be non-targeting and find reward in that if we go one direction and find information gained in that in another direction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2522.653,
    "end": 2524.894,
    "text": "And they are completely different things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2524.914,
    "end": 2528.736,
    "text": "They're not seen in the formalism as the same thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2528.816,
    "end": 2530.857,
    "text": "So I'm just curious whether...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2532.29,
    "end": 2540.756,
    "text": " Because as I said, I don't know enough about neural nets to know, but aren't neural nets constantly constrained by having a target?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2540.776,
    "end": 2548.342,
    "text": "I think there's many ways to answer that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2551.504,
    "end": 2556.868,
    "text": "I am not sure if it would totally map onto the difference of supervised and unsupervised learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2558.24,
    "end": 2562.223,
    "text": " like supervised learning being where labels are provided.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2562.243,
    "end": 2565.945,
    "text": "These x-rays belong to this patient category.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2566.025,
    "end": 2568.047,
    "text": "These ones belong to the alternate category.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2568.067,
    "end": 2576.132,
    "text": "I want you to get really good, but don't over-specify, don't over-fit that distinction, supervised learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2576.833,
    "end": 2581.976,
    "text": "Unsupervised learning is more along the lines of like, here's input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2584.238,
    "end": 2585.599,
    "text": "According to how you're set up,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2586.932,
    "end": 2593.574,
    "text": " embody the statistical regularities and the structure of the information that has been input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2595.474,
    "end": 2611.779,
    "text": "And then that representation allows like clustering and subsequent analyses or the addition of labels later, but it isn't predicated in the training phase upon the data or the cases being labels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2613.953,
    "end": 2614.413,
    "text": " Does that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2615.133,
    "end": 2617.474,
    "text": "Yeah, but the predication is not curiosity, is it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2618.194,
    "end": 2622.656,
    "text": "That's my point, is that there is no curiosity in what you just described.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2625.597,
    "end": 2626.017,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2626.097,
    "end": 2631.119,
    "text": "It's like a pipeline that is receiving whatever information is being provided.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2631.879,
    "end": 2634.38,
    "text": "And curiosity seems to kind of break out of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2635.28,
    "end": 2636.921,
    "text": "And it's like, give me more examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2638.141,
    "end": 2642.843,
    "text": "And then the directed curiosity would be like, I'm looking for more examples of the label A.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2643.783,
    "end": 2649.328,
    "text": " The undirected curiosity would be more like, I just would like more examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2650.469,
    "end": 2655.933,
    "text": "So to ask Ali maybe, Ali, is it consciousness if it doesn't have curiosity?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2658.836,
    "end": 2663.94,
    "text": "Well, I don't think so, because you see, even in...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2665.845,
    "end": 2667.166,
    "text": " unsupervised learnings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2668.246,
    "end": 2680.853,
    "text": "We don't necessarily, well, the neural networks don't necessarily extract the essence of their training examples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2680.913,
    "end": 2684.054,
    "text": "What they do is to extract",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2686.295,
    "end": 2709.726,
    "text": " statistical prototype of their tokens the statistical prototype of their training examples so actually they can't recognize a dog as a dog they just see patterns they just see statistical patterns which they've learned through their training process so they're not uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2710.966,
    "end": 2717.888,
    "text": " they're not necessarily conscious of the object of dog or cat or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2718.409,
    "end": 2737.115,
    "text": "What they try to do is, and in fact, in some cases, well, sometimes we see that they have, in fact, inferred wrong statistical prototypes because of, well, insufficient training examples or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2739.817,
    "end": 2743.7,
    "text": " well, not appropriate training examples or so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2744.34,
    "end": 2748.063,
    "text": "But in any case, I don't think we can...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2750.012,
    "end": 2778.338,
    "text": " say that, well, neural networks, because of their ability to recognize these patterns, they necessarily, well, have consciousness because, well, probably in order to achieve consciousness, well, other layers of cognitive and even perceptual mechanisms need to be deployed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2781.769,
    "end": 2782.029,
    "text": " David.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2788.111,
    "end": 2790.051,
    "text": "Yeah, I had some other points, but if you wanted to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2791.352,
    "end": 2798.174,
    "text": "You'll stay in the curiosity topic and it's related to what the point I was going to make about belief and desire.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2800.374,
    "end": 2809.197,
    "text": "Clearly defining the words so they're specifically you know you're going to take the BDI model and use words like belief and desire to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2810.177,
    "end": 2826.25,
    "text": " you know, some relatively obscure scientific model versus, you know, like a whole historical review of the etymology and, you know, I mean, and how do we, how are we defining beliefs and desire?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2826.27,
    "end": 2829.753,
    "text": "You know, does curiosity have a desire to learn something?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2832.558,
    "end": 2836.921,
    "text": " For its own purpose, that means it's not goal-driven.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2837.521,
    "end": 2852.109,
    "text": "And then how I would understand belief and desire in terms of, so desires are biological urges, like reproduction or survival, and if the emotions are maybe all derivative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2852.829,
    "end": 2871.677,
    "text": " How you're going to put that out where if you're going to try to source all of them from one pure desire and all the other desires are derivative or if you're going to have multiple desires, and then you'd have to have some sort of waiting function to wait the different desires and then beliefs are self made.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2873.115,
    "end": 2900.897,
    "text": " rules that come from our own cognition and that's where decision making comes comes in and even you know i think a rabbinic statement in terms of free will that free will is implying that you have the choice to make the less desirous opinion the the less desires choice like as a chess player if you're thinking like uh uh candidate moves and analysis trees that in reality our candidate moves are just how we control our body",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2901.577,
    "end": 2906.945,
    "text": " And do we move our arm up or down or the various controls of our physical function?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2907.686,
    "end": 2909.589,
    "text": "But what are the candidate moves?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2910.37,
    "end": 2912.513,
    "text": "And then how would the analysis tree and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2915.276,
    "end": 2937.832,
    "text": " decision making is it you know how would it come that you would make the less desirous uh decision is it purely you know let's say short term uh versus long term and then the organization of uh you know let's take a system like okay i'm a jew i'm a muslim i'm an atheist or i'm a capitalist i'm a communist that we have these self-directed uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2940.35,
    "end": 2960.966,
    "text": " beliefs that control our behavior and if it's learning to do things like i can't steal god forbid i can't rape i can't kill and that like my desire if the body tells me okay i see attractive woman i want to have sexual relations but then i have these beliefs like that there's a system of rules and governance",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2961.526,
    "end": 2965.028,
    "text": " that is it purely because I can't get away with it that I don't do it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2965.428,
    "end": 2970.21,
    "text": "We don't rape, steal, and kill because we can't get away with it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2970.67,
    "end": 2977.113,
    "text": "Or is there this self-imposed moralistic behavior and that's coming down to what belief means?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2977.713,
    "end": 2982.015,
    "text": "And then also, so curiosity, you'd have to clearly define",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2983.435,
    "end": 3006.523,
    "text": " curiosity if you're talking about neural nets that you know can computer just learn for its own sake uh and even can a human just learn for its own sake that uh you know we're participating in these discussions purely because i enjoy figuring things out even if it has no practical implication to uh you know some primal directive of survival",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3007.163,
    "end": 3011.066,
    "text": " or reproduction or however you're going to understand these primal directives.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3011.966,
    "end": 3028.796,
    "text": "And then the equation be similar to a chess algorithm for a computer where it would appear that you could add in weighting factors, that you could program this into the equations and you have some constants that would be weighting factors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3029.316,
    "end": 3046.38,
    "text": " So if you did have just one primal directive of survival or two primal directives of reproduction and survival, and then you could give those weighting factors, or you could have a feedback mechanism with the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3046.92,
    "end": 3053.722,
    "text": "And then, as I said, where do the belief comes in, the self-made rules, and then how are those weighting factors calculated?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3054.322,
    "end": 3056.824,
    "text": " in decision-making and what does it mean to make a decision?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3056.884,
    "end": 3060.606,
    "text": "Is it possible that we make the least desirous decision?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3060.626,
    "end": 3065.469,
    "text": "And if we can't make the less desirous decision, do we not have free will?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3069.721,
    "end": 3069.981,
    "text": " Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3070.281,
    "end": 3078.523,
    "text": "So Jonathan Schock made a great point, which is that deep neural networks applied to reinforcement learning can include curiosity as an explicit factor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3079.303,
    "end": 3083.464,
    "text": "It guides the agent to states about which it has the most uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3084.004,
    "end": 3087.685,
    "text": "So it's a term which makes it rewarding to explore currently unexplored states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3087.845,
    "end": 3096.227,
    "text": "And then just to provide a recent example, here's a way in which a neural network architecture was used.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3098.737,
    "end": 3119.535,
    "text": " certainly worthy of more exploration and at a first pass or at least just qualitatively one way to think about that and then we'll come to how curiosity was described in the text is in active inference we have a imperative for action selection that includes a pragmatic and an epistemic component",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3121.035,
    "end": 3130.601,
    "text": " Whereas a pragmatic absolutist perspective like reinforcement learning needs to generate these modules and alternate architectures",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3131.747,
    "end": 3139.249,
    "text": " such that information seeking, curiosity, can be coerced into a reward framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3139.989,
    "end": 3141.589,
    "text": "I mean, what is the next question gonna be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3142.109,
    "end": 3144.29,
    "text": "Well, it's rewarding to gain information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3145.01,
    "end": 3146.37,
    "text": "Oh, what kind of information?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3146.53,
    "end": 3147.351,
    "text": "How much information?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3147.611,
    "end": 3150.531,
    "text": "How are we going to learn the parameters on our curiosity model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3150.791,
    "end": 3151.271,
    "text": "And so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3151.711,
    "end": 3157.733,
    "text": "And so active inference as a first principles approach for this kind of artificially intelligent system",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3158.593,
    "end": 3169.32,
    "text": " allows us to include at the base level both an objective achieving and a pure curiosity reducing element.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3169.98,
    "end": 3173.122,
    "text": "Dean, and then we'll look at how they talk about curiosity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3175.828,
    "end": 3176.448,
    "text": " Thanks, Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3176.548,
    "end": 3185.33,
    "text": "So, as has historically been the case for point twos, David just left and I was going to ask him this question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3185.37,
    "end": 3186.43,
    "text": "Okay, I guess he's still here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3187.751,
    "end": 3198.313,
    "text": "So, David, after thought one, and now just what you were just sharing with us here, I wondered, without putting words in one mouth, can I get a clarification?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3198.813,
    "end": 3202.654,
    "text": "I think one of the things that you're trying to make clear or",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3203.84,
    "end": 3227.99,
    "text": " or at least bring into the conversation is that prioritization, which is the sort of the value weighting aspect of how we see the world is not ordering the kind of placing of a formalism down on paper that includes rules like equals and plus and minus in the FEP or the sort of extended and variation of free energy piece.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3228.51,
    "end": 3228.83,
    "text": "Is that,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3229.904,
    "end": 3238.368,
    "text": " And that oversimplifying what you want us to make clear that that having evaluating is not the same.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3239.268,
    "end": 3244.971,
    "text": "That kind of prioritization is not the same as being able to formally set down an order.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3248.496,
    "end": 3259.72,
    "text": " Well, I'm a dualist, so like I'm trying to I think I could use these equations for dualistic purposes, and you could just factor in a weighting factor for these higher order rules.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3260.3,
    "end": 3268.383,
    "text": "And then, you know, so my system would have some sort of struggle between two separate realms of material and spiritual realm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3268.884,
    "end": 3271.265,
    "text": "So that's personally how I'm I'm looking at it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3271.645,
    "end": 3276.807,
    "text": "But, you know, I could attempt to understand it from just the materialistic realm and how the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3277.987,
    "end": 3297.177,
    "text": " equations uh you would apply and then if there's competing factors what's the origin of those competing factors so so if you just put your desires are biological uh animalistic urges and beliefs are self-created uh rules of uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3297.977,
    "end": 3312.202,
    "text": " cognition, and then you want to have a separate function like curiosity, where curiosity maybe benefits the purpose of making beliefs, which would later come to become higher order rules.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3313.643,
    "end": 3325.167,
    "text": "Or if you want to have the ability to have behavior that has no purpose, that I just enjoy understanding things, maybe that understanding will help me make better higher order rules.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3327.671,
    "end": 3331.857,
    "text": " And then saying, oh, like you're saying for the equation, here we have these equations and it's free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3332.679,
    "end": 3341.391,
    "text": "And so the purpose is to minimize the least action principle or limit energy usage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3343.624,
    "end": 3345.785,
    "text": " And so if you're looking like, well, why did I do that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3346.165,
    "end": 3348.545,
    "text": "Well, it's like, dummy, didn't you look at the equation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3349.125,
    "end": 3350.406,
    "text": "It was the free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3350.786,
    "end": 3352.866,
    "text": "You did it to minimize energy usage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3353.626,
    "end": 3362.689,
    "text": "And so we're just saying that that's the origin of all human behavior from an eliminativistic sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3363.349,
    "end": 3372.471,
    "text": "And from the folk psychology, that's why I'm taking a dualistic perspective where these higher order rules are coming from a non-material plane.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3372.861,
    "end": 3375.042,
    "text": " but I think they could be modeled into the equations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3376.924,
    "end": 3377.184,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3377.964,
    "end": 3384.489,
    "text": "Also, free energy minimization doesn't entail the actual minimal possible energy usage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3385.29,
    "end": 3395.098,
    "text": " Though some people have made that, accidentally or intentionally, a claim, it isn't what those equations, as they're being used here, necessarily represent, but it could.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3395.658,
    "end": 3406.987,
    "text": "There could be a system that thrives optimally based upon reducing energy usage, but also there's situations where free energy minimization and the path of least action are not the lowest energy consumption.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3408.769,
    "end": 3410.17,
    "text": " Was that short term versus long term?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3410.37,
    "end": 3421.561,
    "text": "They're saying long term it is, but it's just short term versus long term decision making in the, as opposed to a dualistic, the predictive mind that's saying it's not dualistic, spiritual versus material.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3422.042,
    "end": 3425.165,
    "text": "It's a single materialistic in its short term versus long term.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3428.911,
    "end": 3452.678,
    "text": " okay let's think about that in the context of of curiosity um how they're describing so g expected free energy of policies it's like the policies are enumerated and then g is calculated for them reflects the inferred value of each policy based upon beliefs beliefs are p of o sub t",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3453.678,
    "end": 3454.459,
    "text": " conditioned on pi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3454.559,
    "end": 3459.483,
    "text": "So the distribution of outcomes conditioned upon policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3459.703,
    "end": 3461.144,
    "text": "If I go left, what do I expect to see?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3461.224,
    "end": 3462.646,
    "text": "If I go right, what do I expect to see?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3462.926,
    "end": 3463.546,
    "text": "That's a belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3465.028,
    "end": 3471.233,
    "text": "And the belief distribution about observations conditioned upon hidden states of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3472.927,
    "end": 3476.768,
    "text": " If there is food there, then what observations will I expect to see?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3477.608,
    "end": 3493.952,
    "text": "And desired outcomes, which is, as we've explored in 37 in user's guide, there's this dual implication of the P of O distribution and active inference as what is expected as well as preferred.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3496.328,
    "end": 3502.189,
    "text": " because we reduce our surprise about the expected",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3503.106,
    "end": 3529.358,
    "text": " slash preferred outcome distribution, and that is how the desired outcomes are realized, not by providing a higher reward or value to increasingly preferred states, but rather treating the preference distribution as expectations, which allows us to use surprisal and surprisal-bounding approaches towards achieving",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3530.851,
    "end": 3558.21,
    "text": " preferences so how do they talk about desire and curiosity they're suggesting that these drives so this is in earlier we talked about there's the two ways to talk about desire the specific target of desire as a desire like i desire a cube of tungsten or something and then there's the drive that is associated with desire what made the person do it desire in the abstract",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3560.507,
    "end": 3588.44,
    "text": " um curiosity drives discovery of what is not yet known and thus has no preconceived target however one could also say that it has a semi-formed concept of target because one could be like curious about something and then their curiosity would be satiated by something else something but not something else so in that case there was some of something of a prior on what they were looking for um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3590.796,
    "end": 3608.742,
    "text": " The claim that curiosity is not cognitive, so desire-related, might seem suspect on the grounds it could also be characterized as simply the desire to learn, qualitatively, and this in turn could be conceived as the desire that one's beliefs are as precise as possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3610.463,
    "end": 3615.265,
    "text": "Even though, especially in the short term, learning sometimes feels like it reduces our precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3616.926,
    "end": 3620.008,
    "text": " However, the mathematics allow us to motivate a genuine distinction here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3620.809,
    "end": 3631.077,
    "text": "Specifically, changing outcomes to minimize the KL divergence in the risk term in EFE is a fundamentally different sort of process from minimizing the ambiguity term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3631.838,
    "end": 3634.86,
    "text": "So the KL divergence is on the left side here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3637.682,
    "end": 3640.084,
    "text": "And the ambiguity term is on the right side here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3640.745,
    "end": 3643.207,
    "text": "Here's equation 2.6 from the textbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3645.026,
    "end": 3672.943,
    "text": " and it's it's in a different order but just to see here's risk with the kl divergence and then here's expected ambiguity with the h for the entropy calculation um the latter which is the ambiguity term does not care how uncertainty is resolved so long it is resolved there's no preference for becoming more confident in one possible belief over another",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3675.151,
    "end": 3686.002,
    "text": " Whereas the reduction of uncertainty by reducing the KL divergence is what is bringing us into alignment with our preferences slash expectations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3686.743,
    "end": 3696.133,
    "text": "Hence, that is a much more targeted form of curiosity in that it allows for goal-directed information seeking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3698.345,
    "end": 3698.986,
    "text": " And then they write, Dean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3709.048,
    "end": 3711.23,
    "text": " Yeah, that's perfect.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3711.25,
    "end": 3716.875,
    "text": "Because what I wanted to say was that I think that curiosity really points to that risk.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3717.555,
    "end": 3727.424,
    "text": "And the reason I say that is because you may find that when the ambiguity is removed, the prize is a happy one or a not so happy one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3727.464,
    "end": 3735.911,
    "text": "And I think that's kind of important here to see sort of the... It's hard to say, as it says here,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3737.312,
    "end": 3745.156,
    "text": " However, the claim that curiosity is non-cognitive might seem suspect on the grounds it could also be characterized as simply the desire to learn.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3746.637,
    "end": 3751.88,
    "text": "Before the learning, you're sort of in an ambiguous state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3752.04,
    "end": 3755.582,
    "text": "Will it be a happy surprise or will it be an unhappy surprise?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3756.162,
    "end": 3759.143,
    "text": "And so I think this kind of pulls that out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3762.524,
    "end": 3777.63,
    "text": " The ambiguity applies a certain amount of risk, but then you have to act in the active inference aspect of it to determine whether or not the surprise all at the other side of it is actually good or not so good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3778.351,
    "end": 3783.413,
    "text": "So I think that's where the curiosity arm of this comes to the fore.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3783.533,
    "end": 3790.156,
    "text": "It is non-targeted until it actually has been realized or somehow materialized.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3790.885,
    "end": 3796.852,
    "text": " Whereas the targeted stuff, the desire stuff, can be part of your plan.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3799.215,
    "end": 3804.561,
    "text": "I'm not sure whether the curiosity fits as conveniently as the desire does.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3804.581,
    "end": 3810.728,
    "text": "And just one short note on that is we see a conditioning on policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3811.449,
    "end": 3811.649,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3813.88,
    "end": 3814.982,
    "text": " in a few different places.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3815.062,
    "end": 3820.809,
    "text": "So it'd be interesting to think about where does planning to learn come into play?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3821.61,
    "end": 3824.233,
    "text": "And in what ways is planning to learn directed?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3824.253,
    "end": 3828.599,
    "text": "Or what if you plan to have undirected learning?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3830.281,
    "end": 3831.342,
    "text": "Or all these other combinations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3831.482,
    "end": 3831.703,
    "text": "Doovit?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3835.376,
    "end": 3851.055,
    "text": " Yeah, I'm not sure if it would exactly fit in with the equation, but I'm thinking here like Maslow's hierarchy of needs defined in terms of the free energy principle where, so to say, curiosity requires excess energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3851.536,
    "end": 3853.518,
    "text": "So if you're on the first rung of the hierarchy,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3854.179,
    "end": 3858.224,
    "text": " that you have limited energy to apply towards curiosity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3858.344,
    "end": 3868.877,
    "text": "And if you do have energy to apply towards curiosity, you're going to be best off to be curious about things that will directly apply to your security,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3870.718,
    "end": 3897.75,
    "text": " your food or the primal directives as opposed to if you move up the hierarchy, at least put this into Maslow's hierarchy, where there's less risk associated with curiosity that maybe you've achieved more leisure activity and therefore have more energy to expand towards curiosity that you could reach the highest levels of Maslow's hierarchy and focus on",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3899.131,
    "end": 3915.638,
    "text": " you know ideals and uh what is the meaning of truth or understanding uh science uh but it would still be uh you however you're defining the free energy principle that you have some sort of uh uh conservation of energy and curiosity is an expansion",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3916.298,
    "end": 3939.305,
    "text": " of energy that is limited, but more resources could be allocated, so to say, energy resources to curiosity if it makes the whole unified person more efficient and they become more secure, more safe, more social, accepted, so on and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3939.765,
    "end": 3942.426,
    "text": "And therefore, they have more energy to expand towards curiosity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3944.747,
    "end": 3945.167,
    "text": "Thanks, Ali.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3948.631,
    "end": 3975.709,
    "text": " I also think it might be helpful to mention the neural basis for these surprise appraisals, because you see, as we know, we have two systems of thinking, system one and system two famously sketched out by Kahneman and Tversky, or fast track and slow track reacting to stimuli.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3976.49,
    "end": 3978.071,
    "text": "So in the fast track,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3979.432,
    "end": 3988.421,
    "text": " Well, the stimuli bypass the sensory cortex and go directly from thalamus to amygdala.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3988.801,
    "end": 3998.75,
    "text": "So our first reaction, our immediate reaction to every surprise would be something quite similar to fear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3999.531,
    "end": 4018.36,
    "text": " But then after appraising that stimulus, after going through the sensory cortex and then amygdala and then hippocampus, then we can appraise, we can evaluate that surprise as being positive or negative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4019.22,
    "end": 4024.663,
    "text": "And as a result of that, we get a positive or negative valence effect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4025.445,
    "end": 4046.078,
    "text": " So in summary, well, every surprise, I mean, either positive or negative, it could be at first, at the very first moment, can induce a negative valence emotion in us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4050.626,
    "end": 4057.71,
    "text": " Yes, I brought in some of the quotes from this paper, Habitual and Reflective Control in Hierarchical Predictive Coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4058.431,
    "end": 4063.414,
    "text": "It's from 2021 and it's by Kinghorn, Milledge and Buckley.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4064.154,
    "end": 4073.319,
    "text": "So they directly connect hierarchical predictive coding architectures, which when they consider action have a lot to do with active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4074.594,
    "end": 4077.436,
    "text": " in terms of thinking fast and slow, like you had just brought up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4078.196,
    "end": 4087.701,
    "text": "So they wrote, on this view, fast actions may be triggered using only the lower levels of the hierarchical predictive coding schema, whereas more deliberative actions need higher layers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4088.381,
    "end": 4095.265,
    "text": "We demonstrate that HPC can distribute learning throughout its hierarchy with higher layers called into use only as required.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4096.285,
    "end": 4099.547,
    "text": "So that is very interesting when we think about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4101.072,
    "end": 4120.465,
    "text": " going back to the MAI-DAI distinction from this paper, it's a hybrid model, albeit one where the motor spatial control is continuous or modeled as continuous, and then there's a more discrete, more mental or cognitive model that's like thinking slow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4121.085,
    "end": 4126.389,
    "text": "So it's almost like there's thinking fast and slow even within the mind, and then there's thinking with the body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4127.523,
    "end": 4152.661,
    "text": " that's like even a lower level i don't think even by thinking fast they weren't talking about the reflex arc but there can be hierarchical modeling even there um so it uh what are these nested models that are slower",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4154.076,
    "end": 4155.197,
    "text": " How do those develop?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4155.477,
    "end": 4162.983,
    "text": "Are they related to the physical architecture of our onboard machinery?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4163.783,
    "end": 4178.894,
    "text": "To what extent do they involve so many of our off-sourced or extended cognitive phenomena, like our colleagues, like our social networks, our books and learnings, the social structures that scaffold our beliefs and so on?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4180.155,
    "end": 4182.276,
    "text": " There's a lot of interesting pieces there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4185.398,
    "end": 4190.34,
    "text": "What would be a good direction to go in this second half of the dot, too?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4191.84,
    "end": 4193.761,
    "text": "We had targeted, non-targeted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4195.162,
    "end": 4200.364,
    "text": "Is there anything there that's not covered by the curiosity discussion?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4200.844,
    "end": 4204.286,
    "text": "Is there... Oh, unmute, Dina, then yes, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4208.436,
    "end": 4208.997,
    "text": " Sorry about that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4209.217,
    "end": 4212.703,
    "text": "Yeah, I think we pretty much wrestled that one to the ground.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4212.723,
    "end": 4214.326,
    "text": "Okay, David?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4216.73,
    "end": 4222.158,
    "text": "Yeah, my conception for targeted, I'm calling the unified I in terms of...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4223.403,
    "end": 4238.728,
    "text": " maybe like the ant colony where you could look at it like the ants are all functioning personally with their own directive behavior and it just works out that they're directed or as a unit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4239.289,
    "end": 4249.212,
    "text": "But even in like a human, whether there's a unified of the human cells, like even sense perception that it's easier to look at it like our...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4252.233,
    "end": 4258.537,
    "text": " Like I mentioned, we have almost 100 million cones and rods in our eyes that are receiving photons at every given instant.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4258.557,
    "end": 4262.419,
    "text": "And we just look at it like they're acting in a unified manner.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4263.76,
    "end": 4275.187,
    "text": "But even that requires some sort of targeted behavior for even direct motor control that our cells in our given body are acting in a unified manner.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4275.747,
    "end": 4290.493,
    "text": " And could you take the free energy principle to a cellular level and say, well, cells will act in a unified way if it's in accordance with the free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4290.533,
    "end": 4296.716,
    "text": "But if it wasn't in accordance with the free energy principle, then cells don't act in a unified targeted way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4297.376,
    "end": 4299.558,
    "text": " and act according to their own levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4299.598,
    "end": 4308.705,
    "text": "I'm not sure if you could take that to the cellular level for even things like sense perception, motor control, like one arm wants to go this way and one arm wants to go that way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4309.165,
    "end": 4311.007,
    "text": "And how do we have this unified control?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4315.95,
    "end": 4322.735,
    "text": "It's an interesting thing about what would make something concord or not with FEP because it's a description framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4323.942,
    "end": 4350.685,
    "text": " here is where in from livestream 25 with uh professor levin here's even in the ant colony example where different subsystems and and cancer and and um like other situations like biofilms were modeled this way that there can be coherence within each cone so to speak uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4352.83,
    "end": 4368.305,
    "text": " I don't know if this moves us closer to understanding the experience of the eye or whether there is in fundament a unified eye, but the cells in the nestmate's body can be understood as undergoing coherent behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4368.325,
    "end": 4371.027,
    "text": "The nestmates can, the colony can.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4372.253,
    "end": 4379.501,
    "text": " And then different people have taken different perspectives on what makes one level of analysis more relevant than others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4379.941,
    "end": 4384.807,
    "text": "Like an evolutionary perspective is that the unit of selection is granted some special power.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4385.828,
    "end": 4393.116,
    "text": "A information processing perspective or integrated information theory might highlight what happens informationally within and across levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4399.5,
    "end": 4404.141,
    "text": " Let's look at their dark room experiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4405.341,
    "end": 4414.144,
    "text": "We kind of came to it a little bit last time, but what did anyone think their figure and simulation spoke to?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4414.164,
    "end": 4422.826,
    "text": "How was it adding details or information that weren't present in the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4426.32,
    "end": 4430.223,
    "text": " more formalism and qualitative driven other sections of the paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4434.747,
    "end": 4435.948,
    "text": "I have a question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4435.968,
    "end": 4438.89,
    "text": "I don't know if I have an interpretation of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4440.461,
    "end": 4454.435,
    "text": " When others looked at this as it's now graphed out, did they see ambiguity removal or did they see an entropy question being resolved?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4454.455,
    "end": 4456.817,
    "text": "Because what I saw was the latter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4457.618,
    "end": 4461.422,
    "text": "I kind of saw that something...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4462.586,
    "end": 4477.315,
    "text": " something appeared with more information gain or something disappeared if there was no sense that the change of an ambiguity state was going to make any difference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4477.555,
    "end": 4487.782,
    "text": "So I'm kind of curious how others interpreted the actual data as it laid out post hoc, because this is all post hoc.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4488.522,
    "end": 4491.704,
    "text": " This is just comparing .7.3 to .99.01.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4492.564,
    "end": 4511.114,
    "text": "In terms of the desire strength, and I think they use the term urgency in the paper, going up, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4511.134,
    "end": 4511.194,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4513.075,
    "end": 4513.295,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4517.267,
    "end": 4523.089,
    "text": " Well, on the left side, okay, so time is moving from left to right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4525.309,
    "end": 4531.811,
    "text": "There's an entity that doesn't desire, they don't have a preference for achieving ice cream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4532.751,
    "end": 4540.213,
    "text": "And in this simulation run, they observed that they were in a dark room and they picked the decision to flip a switch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4542.033,
    "end": 4544.394,
    "text": "They then went to the right",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4547.301,
    "end": 4575.096,
    "text": " and they ended up not finding that they got ice cream the weak desire agent first flips a switch and then with higher confidence goes to the left and they end up realizing ice cream in this case of the strong desire agent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4576.681,
    "end": 4603.728,
    "text": " even though they have uncertainty about going left or right initially they're in a hurry or it's urgent and they go left immediately and that turns out that it does achieve getting the ice cream one note is like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4605.618,
    "end": 4632.215,
    "text": " these are only showing one run of each of those simulations so it's like does the no desire entity always go to the right or is that a 50 50. how have people used the bdi to do quantitative modeling of behavior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4633.877,
    "end": 4654.774,
    "text": " Are they moving their verbal and formal arguments from above in the paper into a form factor that will be more amenable or palatable to people who are already using these models to do behavioral analysis?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4660.009,
    "end": 4667.332,
    "text": " Well, I think the BDI, I mean, strictly from the standpoint of here's what we watched this agent do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4667.352,
    "end": 4670.393,
    "text": "It kind of had a 50-50 choice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4670.533,
    "end": 4672.453,
    "text": "It was playing more in the geometry space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4672.893,
    "end": 4679.016,
    "text": "How this is represented is more sort of the Bayesian distribution piece, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4679.096,
    "end": 4679.736,
    "text": "So you've got a",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4680.97,
    "end": 4691.056,
    "text": " percentage of an area as you're moving from left to right that's either darkened or remains agnostic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4691.696,
    "end": 4703.843,
    "text": "It doesn't sort of change what the outcome or what the matching of an outcome and the expected free energy are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4704.763,
    "end": 4707.685,
    "text": "So I think that it just brings more information to the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4708.669,
    "end": 4715.17,
    "text": " to the observation of what's actually going on when the lights either do go on or don't go on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4715.19,
    "end": 4725.032,
    "text": "Because that first one, the lights don't go on, I think, and the agent either stumbles to the right place or doesn't, but they don't care.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4727.052,
    "end": 4735.574,
    "text": "But I do think that what happens is you can have geometry only, or you can have geometry and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4736.705,
    "end": 4744.287,
    "text": " a proportion or a distribution, and I think that's what this is kind of laying out for us, that now you've got more information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4745.107,
    "end": 4753.39,
    "text": "And with more information, hopefully you've got less invariance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4753.73,
    "end": 4759.632,
    "text": "You've got more variance being described here than you would if you left it at the geometric level alone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4759.652,
    "end": 4760.872,
    "text": "Does that make sense?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4763.669,
    "end": 4787.729,
    "text": " Yes, and they follow up after the figure that this magnitude mapping, it's giving not just some theoretical detail to this mapping, and they provide several citations, many recently with Smith and others,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4791.472,
    "end": 4794.654,
    "text": " where it's used in many different contexts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4795.334,
    "end": 4806.921,
    "text": "And then I kind of found it also interesting in the following sentences after the paragraph that I had just quoted there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4811.003,
    "end": 4814.765,
    "text": "This motivating force could be corresponding to the magnitude of the KL divergence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4815.831,
    "end": 4838.503,
    "text": " KL divergence between the Q variational distribution of observations conditioned upon policy divergence with the preference distribution P of up within the expected free energy so that's one of the terms that we've looked at in the G of Pi i.e the risk term not the ambiguity term with entropy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4840.598,
    "end": 4852.125,
    "text": " This is because stronger preference values over rewarding outcomes in P of O of T increase the KL divergence and lead the agent to seek reward over information gain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4854.607,
    "end": 4859.51,
    "text": "So there's still a knob, maybe multiple that are slightly interacting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4860.591,
    "end": 4863.032,
    "text": "There's a knob by which more",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4864.434,
    "end": 4865.775,
    "text": " Pure curiosity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4866.295,
    "end": 4870.438,
    "text": "That would be just the ambiguity resolving, but undirected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4872.559,
    "end": 4875.541,
    "text": "Mixtures of pure curiosity and directed curiosity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4876.201,
    "end": 4879.623,
    "text": "Weak preferences with a lot of openness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4880.684,
    "end": 4891.05,
    "text": "And increasingly sharp preference distributions induce increasingly urgent pragmatic value-seeking outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4892.451,
    "end": 4892.551,
    "text": "And...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4894.54,
    "end": 4907.674,
    "text": " There's a lot of funny things that come to mind, like a question for one person might be a survival question, for another it might be a research question, for another it might be like a pure curiosity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4911.478,
    "end": 4913.26,
    "text": "Where's the oxygen in this room?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4914.361,
    "end": 4915.402,
    "text": "Is that a survival question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4916.44,
    "end": 4921.184,
    "text": " Is that just, you know, again, are you researching oxygen distributions in rooms?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4921.624,
    "end": 4923.605,
    "text": "So you have a target to understand that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4924.186,
    "end": 4926.307,
    "text": "Or are you just curious about that thought?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4926.728,
    "end": 4927.468,
    "text": "Dean, then David.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4928.529,
    "end": 4935.614,
    "text": "I think, Daniel, that clearly speaks to what David and Allie were both mentioning in terms of, so what's your timeframe here, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4936.314,
    "end": 4944.097,
    "text": " So you take off and you have a bird strike and now you don't have enough time to land anywhere other than on the river.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4944.657,
    "end": 4945.657,
    "text": "Is that curiosity?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4946.618,
    "end": 4947.998,
    "text": "Is that desire?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4949.439,
    "end": 4959.923,
    "text": "What is that in terms of how much time do you have now to manage the risk aspect of this situation that you now find yourself under?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4960.083,
    "end": 4960.923,
    "text": "Certainly survival.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4962.469,
    "end": 4979.264,
    "text": " But yeah, what percentages or what proportions of each one of these different parts of the equation are being calculated at any given moment relative to the overall time frame that you're now constrained under?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4981.687,
    "end": 4982.167,
    "text": "Yes, do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4984.005,
    "end": 5000.628,
    "text": " let me just look at the refrigerator you know example that well okay had i been curious you know earlier during the day about the layout of the room i might have remembered how to get to the refrigerator but i i didn't expend that mental energy so here i am hungry",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5001.369,
    "end": 5003.55,
    "text": " And I don't know my surroundings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5004.21,
    "end": 5007.851,
    "text": "And so you have the level of curiosity could have provided benefit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5007.891,
    "end": 5011.191,
    "text": "But now at this point, you know, you have the risk factor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5011.231,
    "end": 5013.672,
    "text": "Will I injure myself or eat?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5013.712,
    "end": 5026.595,
    "text": "And I was thinking, you know, like chess or something like, OK, like the AlphaZero is programmed with the most powerful computers for hours and hours.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5027.233,
    "end": 5029.174,
    "text": " to just understand the game.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5029.194,
    "end": 5031.916,
    "text": "And then later, it's able to take that and win.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5032.676,
    "end": 5037.019,
    "text": "So as a person, it's like, OK, I really just like thinking about chess and understanding the patterns.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5037.579,
    "end": 5039.56,
    "text": "But then, OK, well, I have to reproduce.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5039.6,
    "end": 5043.423,
    "text": "I have to see to the success of my children and the offspring.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5043.463,
    "end": 5045.424,
    "text": "I have to make money and survive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5046.184,
    "end": 5065.789,
    "text": " and so you know maybe i could become a professional chess player or something like that but then you would come and come in and well um if my goal is to uh you know reproduce and see the success of my offspring and you know make money and survive there's better methods to do that than becoming a professional chess player even like active inference",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5066.409,
    "end": 5072.473,
    "text": " that, okay, I'm curious about how this stuff works, but it's probably not going to help me reproduce or make a living.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5072.913,
    "end": 5087.102,
    "text": "And if I tried to take my curiosity about consciousness and use that to benefit the reproduction or making a living, it's unlikely to see that much fruition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5087.663,
    "end": 5093.066,
    "text": "But at the same time, the power of curiosity is you don't know how it's going to benefit you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5093.672,
    "end": 5112.698,
    "text": " So the ice cream example, if we had a meeting in the kitchen during the day and then we all go back to our rooms to go to sleep and then we're hungry at night, the person who was just curious about how the room was laid out is going to be able to likely retrieve the ice cream without any injury as where the person who didn't",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5113.238,
    "end": 5120.981,
    "text": " expand the energy to be curious about the layout of the room may not achieve the ice cream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5121.001,
    "end": 5127.663,
    "text": "And that's why in my own head, it may not be directly applicable to this paper, but it could be in folk psychology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5127.683,
    "end": 5138.647,
    "text": "It would be to map this to something like Maslow's hierarchy of rules, which would be in line with neural nets, that there would be some sort of higher order rules.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5139.247,
    "end": 5162.7,
    "text": " and some sort of ability to uh put the expansion of more energy like okay like i thought about chess and now i'm winning and i've achieved a little bit of social standing or you know won a little prize money or you know even school i was curious about consciousness now i got a bachelor's degree and i have enough proficiency to you know get a job and support a family",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5163.46,
    "end": 5188.378,
    "text": " and now i could exhort even more energy to it but at the time of the pure curiosity you don't know how it may you actually benefit you in terms of reward great points that it's almost like jumping through different hoops what it might be best accomplished through pure curiosity at a future time point",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5189.881,
    "end": 5204.764,
    "text": " So in, again, that survival, research, and pure curiosity trilemma, there's times where being driven by one or the other helps us move through complex real-world situations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5205.924,
    "end": 5211.825,
    "text": "If we knew the whole story from the beginning, then we could just follow along.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5212.445,
    "end": 5218.306,
    "text": "But in a highly partial information world, where we don't want our priors to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5221.058,
    "end": 5249.38,
    "text": " lead to ruin basically then pure curiosity and research help bring things within our survivable limit into information gathering spaces that we wouldn't necessarily have traveled to limited resources i don't know if they could program that also into the computer also like the limit of resources and if that if you interpret free energy principle in general to you'll be a definition of limited energy resources",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5253.516,
    "end": 5253.736,
    "text": " Ali?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5257.599,
    "end": 5271.427,
    "text": "Well, adding to my own previous comments about the subject of consciousness and curiosity, I personally believe that the nature of consciousness is ultimately computational.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5272.248,
    "end": 5277.151,
    "text": "So it's amenable to modeling and simulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5277.191,
    "end": 5279.892,
    "text": "But we're just not there yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5280.953,
    "end": 5282.034,
    "text": "But well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5283.377,
    "end": 5295.222,
    "text": " One possible approach to achieve such model could be potentially the active inference approach or other related approaches.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5296.043,
    "end": 5303.166,
    "text": "But you see, curiosity is just one aspect of consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5304.587,
    "end": 5326.808,
    "text": " I think it could probably be helpful to distinguish between the artificial curiosity and the experience of curiosity or the phenomenology of the curiosity because what we see here is the agent that simulates the artificial curiosity and it's not exactly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5328.685,
    "end": 5336.815,
    "text": " isomorphic with the experience we get from our derived to our information seeking drives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5337.015,
    "end": 5341.761,
    "text": "And in fact, in this paper, I think it was in page 28.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5341.801,
    "end": 5342.843,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5345.828,
    "end": 5359.459,
    "text": " It's in page 28 that they state that we have not addressed questions about the structure a generative model would need in order to account for experiences of beliefs and desires.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5361.961,
    "end": 5369.248,
    "text": " Well, at least in this paper, we're not dealing with the actual experience of curiosity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5369.328,
    "end": 5375.614,
    "text": "We're just trying to somehow model and simulate the artificial curiosity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5375.734,
    "end": 5382.781,
    "text": "In fact, this term artificial curiosity is one favored by Carl Friston himself in his various other lectures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5384.301,
    "end": 5406.035,
    "text": " yes very good point and it relates to kind of the experienced view from the inside versus the behavioral modeling view from the outside a curious particle or a curious forager might be engaging in some kind of behavior but that isn't the same thing as experience of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5407.079,
    "end": 5420.762,
    "text": " but they do provide references to other work, like including work that has been discussed previously on live streams with Christopher White and Ryan Smith on report paradigms of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5422.783,
    "end": 5434.666,
    "text": "As we kind of head towards the end here, I thought this was very interesting in the section before the conclusion 11, free energy principle and direction of fit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5435.506,
    "end": 5436.506,
    "text": "And this is kind of a good,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5438.064,
    "end": 5443.386,
    "text": " section to carry out and bring forward into our other discussions on Act-Inf.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5445.948,
    "end": 5458.193,
    "text": "For any organism described by the FEP, the description will contain an implicitly normative state element about the states the organism should be in and can be described as having cognitive desire-like direction of fit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5458.893,
    "end": 5462.135,
    "text": "So there's a preference distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5463.209,
    "end": 5470.412,
    "text": " And as this paper is building up, it can have an interpretation as desire, being a targeted desire.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5472.713,
    "end": 5476.655,
    "text": "Even beyond the case of forward-looking decision-making agents,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5477.682,
    "end": 5485.224,
    "text": " Not all Bayesian beliefs in the FEP formalism are best characterized as doxastic, being about belief, doxology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5486.325,
    "end": 5503.43,
    "text": "This perspective may expand upon current discussion in the FEP literature, where it is fairly prominent to discuss as-if beliefs in simple systems, whether a mere active entity like a pendulum or adaptive active entities, and just say, well, I'm not saying that it really believes that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5503.53,
    "end": 5505.511,
    "text": "It's acting as if it believes that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5507.042,
    "end": 5508.203,
    "text": " that conform to the FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5509.303,
    "end": 5515.267,
    "text": "Here, our point is they can also equally be described as having as-if desires.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5517.529,
    "end": 5522.372,
    "text": "Belief entered the active lexicon slash ontology",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5523.322,
    "end": 5530.05,
    "text": " Perhaps because belief is used also in Bayesian statistics, where distributions more generally are called beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5530.711,
    "end": 5541.183,
    "text": "Also disjoint from the phenomenology of experiencing a belief, but rather that's just called belief updating, is like a process in Bayesian statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5543.145,
    "end": 5543.645,
    "text": "This paper...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5544.69,
    "end": 5559.759,
    "text": " kind of closes the loop with belief, not towards phenomenology, but stapling together some of the Bayesian distributional usage of the term belief with the doxastic being about belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5559.799,
    "end": 5565.323,
    "text": "The aboutness of those Bayesian beliefs is the folk psychological concept of belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5567.967,
    "end": 5592.135,
    "text": " By making that mapping and connecting the formalism as a whole, or at least in the core equations like the F and the G, to the BDI model, it also allows them to identify which Bayesian belief distributions map to belief in the BDI, and which Bayesian belief distributions map to D, to the desires in the BDI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5593.484,
    "end": 5613.861,
    "text": " and so to the extent that somebody can say a system has an as if belief implicitly in a folk psychological way we can also talk about as if desires and that helps um partition",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5615.689,
    "end": 5623.035,
    "text": " but not disregard the discussion around what different systems experience, the classic, you know, what is it like to be X?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5624.055,
    "end": 5640.507,
    "text": "But it, at least according to this argument and perspective, authorizes usage of intentions and desires, intentions arising from basically the combination of the beliefs and the desires in the BDI, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5641.724,
    "end": 5645.426,
    "text": " and talking about active systems as if they have desires.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5646.727,
    "end": 5650.109,
    "text": "What is that simulation desirous of?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5651.83,
    "end": 5667.539,
    "text": "And then using its beliefs and desires to explain its intentional behavior, not the experience of intentionality, experience of belief, experience of desire, but using them in this view from the outside, more deflationary perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5667.799,
    "end": 5670.0,
    "text": "So that's quite interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5670.04,
    "end": 5670.861,
    "text": "And I think something that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5672.09,
    "end": 5676.172,
    "text": " We'll see how it catches on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5684.235,
    "end": 5686.236,
    "text": "Are there other sections that people want to talk about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5686.616,
    "end": 5692.398,
    "text": "Or what will they carry forward into their post-46 life?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5700.811,
    "end": 5724.205,
    "text": " think daniel a couple of things i think the desire to think part that you're just talking about there i'm not sure that it's specific in nature i think it's more generalizable and sort of that scale free um to there's some of the stuff that david brought up um i think that when you when you um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5726.929,
    "end": 5753.37,
    "text": " you start getting getting to know active infants a little bit more and i'll speak from personal experience with a focus on a little bit of sort of personal grooming you become one heck of an attractive state and so i think you might not make money off of that but at this point but i think as you get more comfortable with the kind of being able to take the information and uh use it across a variety of different situations it's um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5754.71,
    "end": 5755.911,
    "text": " It actually is quite helpful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5755.971,
    "end": 5766.18,
    "text": "I don't think I'll ever get rich off of it at this point, but it is kind of interesting how it's, I think it is growing in terms of the amount of attention that it's getting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5766.5,
    "end": 5770.924,
    "text": "So that's kind of my two takes on this so far.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5770.964,
    "end": 5775.548,
    "text": "So you're saying it might influence fitness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5776.869,
    "end": 5780.392,
    "text": "I think it might down the road, as long as we have enough timescale.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5780.492,
    "end": 5782.454,
    "text": "Do the talk."
  },
  {
    "start": 5785.478,
    "end": 5785.659,
    "text": " Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5785.679,
    "end": 5790.021,
    "text": "And I've been coaching chess for a while and mostly to youth and I'm used to explaining, uh,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5791.619,
    "end": 5820.04,
    "text": " somewhat you know these concepts like you know i i want you to say that uh people who are just curious about chess and how the patterns work and how the pieces work often improve much faster than people who desire to win and that a lot of times people will reach a certain strength and then their curiosity diminishes and it's just their desire to win which isn't enough that you know it's just like i want to spend my night thinking about these uh patterns",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5821.301,
    "end": 5827.55,
    "text": " versus like I really want to win and have some sort of practical benefit from my efforts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5827.63,
    "end": 5836.803,
    "text": "So I have my own personal goals that brought me to active inference because I was looking for my own tools to advance my own research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5837.344,
    "end": 5850.753,
    "text": " and came on to active inference as a method or tool that even though it appears that the majority of people are using it for a different purpose, that I would be able to rework it for my own purpose.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5850.813,
    "end": 5861.101,
    "text": "But because it's an interdisciplinary study and I'm an engineer and engineering usually works that way, where someone has professional certification, they sign off,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5861.721,
    "end": 5877.914,
    "text": " and you could expect that they did their part right and it's going to work and you could you know attach that module to your module and both modules are going to do what they said they're going to do and then you know the curiosity will do i really want to understand how your module works",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5878.294,
    "end": 5892.042,
    "text": " you know, do I really care about Dean and Ali's research or, you know, do I just, you know, want to trust that their module works and I'm going to be able to attach that to my module to, you know, make something more powerful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5892.202,
    "end": 5902.748,
    "text": "And both are probably true to, you know, to your limited energy, limited resources that, you know, that I would like to understand Dean and Ali's module to the best of my",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5903.308,
    "end": 5929.387,
    "text": " ability but energy time allocation resources are limited but then you know certainly if you had a module that would help my module and we could plug them in together and you create a more powerful interface so that I'm bullish about active inference and as a framework that will benefit you know the more and more people who get involved and I'm seeing my own direction into my own research how",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5930.407,
    "end": 5948.712,
    "text": " I think this will be useful and I even think I got Jennifer, I think, joined the Discord and I mentioned to a few other people that might be able to advance their research and then try to understand the current existing modules that are out there within the active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5950.073,
    "end": 5955.897,
    "text": " As I mentioned, the importance of interdisciplinary studies for big issues.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5956.057,
    "end": 5957.358,
    "text": "None of us are going to figure this out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5957.798,
    "end": 5966.164,
    "text": "It's going to take interdisciplinary studies, and none of us are going to be able to understand all the disciplines necessary to piece together the bigger puzzle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5968.666,
    "end": 5968.846,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5968.906,
    "end": 5969.366,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5969.506,
    "end": 5969.786,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5970.147,
    "end": 5974.55,
    "text": "Interesting point about the curiosity-driven learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5976.44,
    "end": 5989.384,
    "text": " and how that can be like a not even paradoxically more successful approach or mentality to set off on a learning journey with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5993.705,
    "end": 6005.169,
    "text": "I just think about somebody trying to learn organic chemistry, which I tutored for many years, and people who set themselves up for the pragmatic value and said, I want this outcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6006.508,
    "end": 6019.671,
    "text": " Sometimes they achieve the outcome, other times they didn't, but it set up a lot of psychology around not achieving the outcome when it didn't happen on the expected timeline and a lot of like secondary cascading failures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6022.291,
    "end": 6035.794,
    "text": "However, there's also the clear counterpoint, which is, but if we don't want the higher grade, then like if we're just going to be curious about learning organic chemistry, like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6036.539,
    "end": 6037.6,
    "text": " my finals in six weeks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6038.42,
    "end": 6043.062,
    "text": "So how are we going to balance the timelines and the curiosity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6043.622,
    "end": 6054.387,
    "text": "And I think maybe even this paper helped us look at one way, which is keep the preference direction, but understand how the urgency of your preference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6057.344,
    "end": 6060.287,
    "text": " influences the way that you take action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6061.568,
    "end": 6065.932,
    "text": "And just think about what if your final was tomorrow?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6066.532,
    "end": 6067.453,
    "text": "How would you go about it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6068.073,
    "end": 6070.215,
    "text": "Okay, now what if the final was in 100 years?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6070.816,
    "end": 6071.697,
    "text": "How would you go about it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6072.918,
    "end": 6074.399,
    "text": "Where are we in that continuum?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6075.22,
    "end": 6077.882,
    "text": "Do we have time for curiosity and for openness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6078.603,
    "end": 6081.005,
    "text": "Or is this an actual emergency situation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6083.121,
    "end": 6110.316,
    "text": " and then we can triage where there is an emergency organic chemistry situation but also hold space for curiosity and openness and even in the emergency there has to be information seeking it's just more directed information seeking okay we're going to work through the practice tests and that's what we're going to have time for there still is going to be information seeking but not of the same kind if we had more time to kind of space out",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6111.539,
    "end": 6118.506,
    "text": " even though in an alternate slash preferable world, perhaps that's the better way to learn or the more fun way to learn or so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6122.149,
    "end": 6123.39,
    "text": "Any other thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6128.215,
    "end": 6132.639,
    "text": "Well, one of the things I really like about active inference research is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6133.297,
    "end": 6156.254,
    "text": " the willingness of the researchers in this area to seriously address the criticisms instead of just dodging them and their willingness to constantly improve and update the theory in order to fill the gaps and also address the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6161.755,
    "end": 6166.996,
    "text": " well, the weakness or any weakness or loophole in the theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6167.756,
    "end": 6184.219,
    "text": "And that's very, you see, liberating to see such active area of research going forward in a very determined and also very open-minded way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6185.159,
    "end": 6190.38,
    "text": "And well, that's one of the things I think sets it apart from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6192.432,
    "end": 6195.534,
    "text": " some other research areas today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6201.217,
    "end": 6202.317,
    "text": "It's what we prefer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6202.337,
    "end": 6203.138,
    "text": "It's what we expect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6206.079,
    "end": 6206.94,
    "text": "We're curious about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6210.396,
    "end": 6219.081,
    "text": " Okay, Dean, Ali, Duvid, thanks a lot for this fun discussion, and Ryan, Maxwell, and Alex for this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6219.121,
    "end": 6222.744,
    "text": "It really capped off a long run of livestreams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6222.784,
    "end": 6234.071,
    "text": "We've had quite a nice sequence going back to the beginning of this year, getting through many, many discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6235.638,
    "end": 6246.507,
    "text": " Next week, we're going to have the second quarterly round table meeting, and then we'll have July off of paper discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6247.928,
    "end": 6251.491,
    "text": "And we'll be coming back in August with paper discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6252.913,
    "end": 6263.802,
    "text": "We don't know exactly what they're going to be, but we know some of them and we have a few guest streams and other streams coming up, but, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6265.407,
    "end": 6267.089,
    "text": " Yeah, it's been a nice run.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6267.469,
    "end": 6272.334,
    "text": "The lab meeting next week will be a great cap to this season slash semester.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6273.275,
    "end": 6280.161,
    "text": "And then we'll come back for the end of 2022 with some new changes that I think people will be really excited about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6280.582,
    "end": 6282.263,
    "text": "So thanks, everybody.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6282.824,
    "end": 6283.464,
    "text": "And see you later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6283.485,
    "end": 6284.505,
    "text": "Thanks, Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6285.266,
    "end": 6285.847,
    "text": "Thanks, everyone.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6286.467,
    "end": 6287.008,
    "text": "Okay, thanks a lot.",
    "speaker": "SPEAKER_04"
  }
]