[
  {
    "start": 12.967,
    "end": 13.287,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 13.968,
    "end": 15.348,
    "text": "Hello and welcome everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 16.749,
    "end": 22.992,
    "text": "It's ACT-INF Lab live stream number 46.0 and it's June 10th, 2022.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 24.693,
    "end": 26.294,
    "text": "Welcome to the ACT-INF Lab everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 26.834,
    "end": 32.557,
    "text": "We're a participatory online lab that is communicating, learning and practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 33.077,
    "end": 34.958,
    "text": "You can find us at links here on the slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 35.878,
    "end": 38.119,
    "text": "This is a recorded and an archived live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 38.539,
    "end": 41.321,
    "text": "So please provide us with feedback so we can improve our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 42.611,
    "end": 47.456,
    "text": " All backgrounds and perspectives are welcome, and we'll be following video etiquette for live streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 48.777,
    "end": 55.905,
    "text": "Head over to ActiveInference.org if you want to learn more about live streams at the lab or other projects that are ongoing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 57.566,
    "end": 76.612,
    "text": " all right we are here in the first discussion the dot zero for background and context in stream number 46.0 we are learning and discussing the paper active inference models do not contradict folk psychology by ryan smith maxwell ramsted and alex keifer",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 77.492,
    "end": 103.118,
    "text": " and the video just like all the videos are is an introduction and a contextualizer and an appetizer for some of these ideas it's not a review or a final word we're going to say hi and give introductions then we'll be covering the roadmap and abstract claims and aims and then we'll head through some of the core sections of the paper and just get some of the key arguments down and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 103.718,
    "end": 116.253,
    "text": " during the dot one and the dot two in the coming two weeks we'll have open space for asking a lot of questions for those who want to participate live and ask questions as well so on we go",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 117.363,
    "end": 130.667,
    "text": " We'll start just by introducing ourself as much or as little as we'd like, and if we want to, mentioning something that we're excited about in the paper, like what brought us to want to contribute to this.zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 131.707,
    "end": 132.648,
    "text": "And I'll start.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 132.968,
    "end": 133.428,
    "text": "I'm Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 133.768,
    "end": 143.911,
    "text": "I'm a researcher in California, and I think the title says it all, though there's still more to add, and it speaks to many of the hottest",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 144.815,
    "end": 155.022,
    "text": " and brightest debates in Active Inference, which is the rubber hitting the road with mind and brain and body and psychology and previous and different conceptions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 155.903,
    "end": 157.224,
    "text": "I'll pass it to Dean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 159.065,
    "end": 159.425,
    "text": "Thanks, Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 159.445,
    "end": 159.886,
    "text": "I'm Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 159.926,
    "end": 160.986,
    "text": "I'm up here in Calgary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 161.006,
    "end": 161.927,
    "text": "I think",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 163.482,
    "end": 164.302,
    "text": " Well, a couple of things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 164.342,
    "end": 169.285,
    "text": "First of all, one of the first active inference that I was on was a paper that Ryan had written.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 169.425,
    "end": 171.766,
    "text": "And so I was kind of impressed with that paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 171.986,
    "end": 180.771,
    "text": "And I knew that if I sort of invested some time in this one, that I would become previous.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 181.131,
    "end": 190.236,
    "text": "And the primary thing that came to my mind was looking at active inference from the decisioning and the movement standpoint.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 191.118,
    "end": 199.782,
    "text": " sort of seeing that looked at from a higher order and the lower order type of processings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 200.482,
    "end": 208.766,
    "text": "And that, by the time I got to the end of the paper and started looking at the mind-to-world and world-to-mind piece and seeing where the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 209.81,
    "end": 223.697,
    "text": " the potential connectors were between sort of coming into it, not necessarily knowing that there would be different things of active inference, much like I didn't realize there was an extended active inference until I read Axel Constant's paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 224.117,
    "end": 226.138,
    "text": "That was kind of helpful and I'll pass it to Jacob.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 226.178,
    "end": 228.76,
    "text": "Hi everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 228.96,
    "end": 229.58,
    "text": "I'm Jakub.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 229.88,
    "end": 239.165,
    "text": "I'm a student from the Czech Republic and I'm excited to reduce my uncertainty about the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 241.047,
    "end": 250.572,
    "text": " new formulation that was introduced in this paper, or at least it was the first time I came across it in the active inference literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 251.832,
    "end": 266.62,
    "text": "As you mentioned, Dean, about the different higher order and lower order descriptions and how they conceptually map to the different mathematical formulation and also",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 267.202,
    "end": 284.334,
    "text": " to the full psychological ontology and overall just discuss what that means and what it might mean for other applications as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 285.355,
    "end": 287.656,
    "text": "And I'll pass it on to Ryan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 289.718,
    "end": 290.198,
    "text": "Yeah, thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 290.478,
    "end": 291.639,
    "text": "So I'm Ryan Smith.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 291.919,
    "end": 296.723,
    "text": "So I'm a research associate professor at the Laureate Institute for Brain Research.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 297.523,
    "end": 323.239,
    "text": " um you know so i'm the the first author of this uh this paper so you know obviously i was sufficiently excited about the ideas to write about it um or sufficiently motivated at least to try to clarify some things that i um you know from my perspective are sort of common misconceptions um so um yeah i mean you know i'm i'm probably more gonna sit in the background here i'll just be here to um you know answer questions or clarify anything um you know if something comes up where",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 324.184,
    "end": 328.229,
    "text": " something in the paper wasn't sufficiently clear because I didn't do my job well enough.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 328.529,
    "end": 329.591,
    "text": "So, yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 329.851,
    "end": 333.136,
    "text": "So I appreciate you guys being willing to talk about it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 334.244,
    "end": 359.006,
    "text": " thanks well an overall comment was we really appreciate the clarity of the argument and the writing and the weaving together of the the math and the formalisms with the argument the rhetoric and the ontology that's that's prime time so we'll just jump right in and of course anyone is welcome to share their comments so dean would you like to help us contextualize with a big question",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 360.023,
    "end": 367.653,
    "text": " Yeah, so I think that there's some questions surrounding, and I'm just going to take some of the important quotes that I lifted from the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 367.673,
    "end": 369.075,
    "text": "The concern that active infants also",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 370.317,
    "end": 380.081,
    "text": " psychology because they do not explicitly include terms for desires or other cognitive constructs at the mathematical level of description.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 380.701,
    "end": 399.148,
    "text": "So given that distinction, that there are active inference models with motor control which need not have desires under folk psychology and active inference models do have desires within folk psychology then, the worry is that if those models can",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 403.37,
    "end": 409.195,
    "text": " Dean, could you, I think when you're talking, you like turn away a little bit or move back, it kind of cuts the audio.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 409.775,
    "end": 412.217,
    "text": "So maybe, yeah, we'll try that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 412.577,
    "end": 413.738,
    "text": "Continue from the given.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 413.778,
    "end": 414.078,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 414.939,
    "end": 415.199,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 415.419,
    "end": 420.163,
    "text": "So given the, there's a distinction in active inference models of motor control.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 421.827,
    "end": 436.504,
    "text": " which do not have desires under folk psychology and active interest models of decision processes, which do have desires with psychology, or so it's argued here, then the worry is that if active interest models can explain cognition in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 436.943,
    "end": 449.337,
    "text": " without appealing to constructs that can be mapped onto the common sense notion of desires, and that's how I explain what that is, then this could be seen as threatening our intuitive folk psychology of ourselves as agents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 453.16,
    "end": 462.01,
    "text": " Such a situation would also pressure the traditional belief, desire, intention model of folk psychology that is prominent in philosophy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 462.491,
    "end": 467.957,
    "text": "The BDI model is a model of human agency that explains what it means to act intentionally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 468.057,
    "end": 471.561,
    "text": "So for me, I was introduced to the BDI model as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 474.332,
    "end": 495.998,
    "text": " yes great and and one way that i kind of saw this big question even pulling back a layer is like is active inference recontextualizing reframing augmenting building on what is already familiar in a sense though there are many folk psychologies and i think that could be something we go into or is this the displacement of some",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 496.658,
    "end": 516.349,
    "text": " cherished framework for some other construct and the way that people speak like i want the cup of coffee or something like that are we going to need like a different word for an active compatible folk psychology and linguistics so jacob any thoughts on that well um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 517.731,
    "end": 538.116,
    "text": " I guess one question I perhaps had was, even this formulation of the initial statement, given this distinction of motor control active inference and decision processes active inference, then we have this issue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 539.716,
    "end": 562.177,
    "text": " Well, one thing that I was a bit uncertain about was whether this distinction was made to fit the distinction that's within folk psychology, like there is some kind of ontology for motor control and an ontology for decision processes, so therefore we try to split active inference into these two parts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 562.777,
    "end": 574.187,
    "text": " or whether there is actually, whether this distinction follows directly from the same mathematical formulation of active.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 576.468,
    "end": 578.13,
    "text": "Great.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 578.45,
    "end": 590.66,
    "text": "I think one thing to clarify is I think the way that this kind of given the distinction followed by then here, I think could be leading to a little bit of a misunderstanding.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 590.68,
    "end": 591.361,
    "text": "You know, so the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 591.991,
    "end": 598.953,
    "text": " The idea that there's a concern about a threat to folk psychology comes not from that distinction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 598.993,
    "end": 610.755,
    "text": "It comes from the fact that at the mathematical level of description, it doesn't look like there's anything in there that's desire-ish, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 610.815,
    "end": 612.216,
    "text": "I mean, that's where the worry comes from.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 613.596,
    "end": 617.937,
    "text": "The worry doesn't come from the distinction between motor control and decision processes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 618.717,
    "end": 636.487,
    "text": " Right, the distinction between motor control and decision process is actually one thing that by making that more explicit, it actually helps to resolve the concern or it shows why it's not really a concern or that part of the concern stems from a failure to make that distinction explicitly.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 637.748,
    "end": 639.749,
    "text": "So just to kind of clarify that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 640.269,
    "end": 646.393,
    "text": "So I think the order of the thought process here is a little bit different than the way it is in the paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 648.308,
    "end": 666.722,
    "text": " thanks helpful times and we'll clarify and and go through the argument in order to so uh briefly just the aims of the paper as they present it are to provide a brief review of the historical progression from predictive coding to current active inference models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 667.918,
    "end": 686.285,
    "text": " and show that despite a superficial tension when viewed at the mathematical level, the active inference formalism contains terms that are readily identifiable as desires and related cognitive constructs at the psychological level, which is downstream of that clarification of the distinction that Ryan just mentioned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 687.145,
    "end": 694.908,
    "text": "And then they discuss the additional insights offered by active inference and the implications it has for current debates about active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 697.375,
    "end": 698.696,
    "text": " Any other aims you'd want to add, Ryan?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 701.978,
    "end": 703.119,
    "text": "I think this is fine at the moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 703.459,
    "end": 704.8,
    "text": "I mean, I'm sure things will come up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 705.901,
    "end": 706.101,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 706.802,
    "end": 708.643,
    "text": "And then claims.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 709.564,
    "end": 711.005,
    "text": "Jakob, could you read the claims?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 712.403,
    "end": 722.066,
    "text": " Yeah, so firstly that the apparent problem posed by purely doxastic-looking constructs simply is not a problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 722.607,
    "end": 740.313,
    "text": "There do not appear to be cases where the phenotype-consistent prior expectation in DAI, often called prior preferences, will ever conflict with or make distinct predictions than a traditional folk psychological account in which beliefs and desires are integrated to find intentions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 741.226,
    "end": 761.493,
    "text": " The second claim is that what we have referred to as DAI, the Partially Observable Markov Decision Process Formulation of Acton, is a corollary of the FEP, and it can be implemented using prediction error minimization, but there are many other aspects of the FEP and many other theories that fall under the umbrella of predictive processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 762.193,
    "end": 767.275,
    "text": "And in some, there are beliefs and desires in the active inference framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 768.929,
    "end": 775.073,
    "text": " And those are just a few claims that we pulled out, but many other declarative sentences will also be claims.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 777.815,
    "end": 781.498,
    "text": "I wouldn't necessarily call those the primary claims of the paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 781.518,
    "end": 789.904,
    "text": "I mean, there's certainly statements that we make, but I think the idea that the apparent problem isn't a problem, I think that's a claim.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 789.924,
    "end": 796.108,
    "text": "And that there won't be a conflict with",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 796.584,
    "end": 800.007,
    "text": " with an account where you're combining beliefs and desires to form intentions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 800.067,
    "end": 800.707,
    "text": "That's true.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 802.989,
    "end": 813.997,
    "text": "This idea about what falls under the predictive processing umbrella, I wouldn't necessarily say that's something we're arguing for in the paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 814.057,
    "end": 825.306,
    "text": "It's just something that matters when you're trying to correctly frame this kind of debate because predictive processing is just a very",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 826.058,
    "end": 828.019,
    "text": " generic term, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 828.099,
    "end": 831.341,
    "text": "Like it doesn't refer to any particular mathematical formalism.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 831.381,
    "end": 842.808,
    "text": "It just refers to a really broad idea that in some way the brain's doing some sort of predicting, either with respect to resolving problems in perception or problems in decision-making and motor control.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 844.228,
    "end": 855.515,
    "text": "So there really isn't, there's not enough, there's really just not enough mathematical specificity associated with predictive processing as a term to really even test any predictions that it would make.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 856.209,
    "end": 856.449,
    "text": " Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 856.489,
    "end": 864.154,
    "text": "So, I mean, I mean, what you, what you need to do is pick, you know, whatever specific mathematical formalism, what actual hypothesis you're talking about.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 864.174,
    "end": 868.416,
    "text": "Um, and you evaluate and test claims with respect to that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 869.017,
    "end": 869.177,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 869.197,
    "end": 879.703,
    "text": "So there's, there just aren't, there's aren't clear, uh, like what even, uh, it's just a pretty good processing is just too general and vague is the point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 879.863,
    "end": 882.485,
    "text": "So, you know, we can only really say, look under,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 883.16,
    "end": 886.362,
    "text": " under the current models used that are called active inference, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 886.402,
    "end": 895.368,
    "text": "So these, you know, partially observable markup decision process models, you know, that minimize expected free energy as a way of making decisions, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 896.028,
    "end": 904.113,
    "text": "Those arguably count as one particular, right, theory or class of models under the predictive processing umbrella.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 904.714,
    "end": 907.636,
    "text": "And we can evaluate claims with respect to that model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 908.596,
    "end": 912.659,
    "text": "But, you know, what's true of that doesn't need to be true of, you know, the other",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 913.203,
    "end": 918.126,
    "text": " you know, 20 things out there that might, you know, might also fall under a predictive processing umbrella.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 918.246,
    "end": 929.672,
    "text": "So, I mean, the main point is just we need to evaluate, you know, claims and predictions and things like that with respect to a specific model, not with respect to a kind of vague general category of models.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 931.893,
    "end": 932.213,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 935.815,
    "end": 936.155,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 937.556,
    "end": 940.398,
    "text": "So just rapidly through the abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 941.368,
    "end": 948.015,
    "text": " Active inference offers a unified theory of perception, learning, and decision-making at computational and neural levels of description.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 948.936,
    "end": 963.85,
    "text": "In this article, we address the worry that active inference may be in tension with the belief-desire-intention model within folk psychology because it does not include terms for desires or other cognitive constructs at the mathematical level of description.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 964.571,
    "end": 976.058,
    "text": " To resolve this concern, we first provide a brief review of the historical progression from predictive coding to active inference, enabling us to distinguish between active inference formulations of motor control",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 977.27,
    "end": 988.935,
    "text": " MAI, which need not have desires under folk psychology, and active inference formulations of decision processes, DAI, which do have desires within folk psychology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 989.715,
    "end": 1003.861,
    "text": "We then show that despite a superficial tension, when viewed at the mathematical level of description, the active inference formalism contains terms that are readily identifiable as encoding both the objects of desire and the strength of desire at the psychological level of description.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1004.921,
    "end": 1011.284,
    "text": " We demonstrate this with simple simulations of an active inference agent motivated to leave a dark room for different reasons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1012.144,
    "end": 1023.35,
    "text": "Despite their consistency, we further show how active inference may increase the granularity of folk psychological descriptions by highlighting distinctions between drives to seek information versus reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1024.19,
    "end": 1047.606,
    "text": " and how it may also offer more precise quantitative folk psychological predictions finally we consider how the implicitly quantitative components of active inference may have partial analogs i.e as if desires in other systems describable by the broader free energy principle to which it conforms here's the roadmap so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1048.834,
    "end": 1054.115,
    "text": " the dot zeros, all of them in the world, wouldn't be enough to hit every stop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1054.755,
    "end": 1059.776,
    "text": "So we will go through roughly in order of these sections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1061.077,
    "end": 1062.737,
    "text": "And the section titles are listed here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1062.897,
    "end": 1074.799,
    "text": "But Ryan, what was the thought going into the ordering or the structuring and why there was such a comprehensive historical and preliminary consideration section?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1077.06,
    "end": 1077.74,
    "text": "I mean, a lot of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1078.749,
    "end": 1083.233,
    "text": " I mean, the vast majority of these sections are just kind of building up background, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1083.353,
    "end": 1107.212,
    "text": "I mean, sufficient background to kind of see, right, where the, you know, both I think historically where, you know, potential misunderstandings might come from, you know, and also just enough of the, you know, providing enough of the formalism, you know, one part of the formalism does kind of build on another, right, to see why the, you know, to see why the apparent problem just isn't there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1107.898,
    "end": 1108.158,
    "text": " Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1108.198,
    "end": 1115.9,
    "text": "So, I mean, the vast majority of these sections are just are just preliminary, just kind of building up so that the reader has the information necessary to understand the argument.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1115.92,
    "end": 1121.302,
    "text": "I mean, only only the last couple of sections that really really are the meat of the argument itself.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1122.042,
    "end": 1132.345,
    "text": "I mean, so so, you know, for example, just section two, you know, there are what we just said from the predictive coding active inference is just kind of highlighting how, you know, these initials of.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1134.012,
    "end": 1139.335,
    "text": " brain as implemented through predictive coding was, you know, purely a model of perception, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1139.355,
    "end": 1160.725,
    "text": "So then, you know, so then when people, but a lot of times you'll see, especially in the, you know, older literature and philosophy literature, you know, predictive processing somehow both refers to predictive coding, but then also is talked about as though it's as though it's the same thing as active inference, you know, or there'll be these kinds of ideas where",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1161.76,
    "end": 1177.187,
    "text": " if you just extend predictive coding as kind of the way it's talked about as a kind of way of thinking about what the whole brain does, you know, then all of a sudden, you know, controlling the body ends up also just being something about predicting what the body will do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1179.027,
    "end": 1188.971,
    "text": "But, but, and especially when described that way, right, it sounds like something like desire and motivation and goals and things like that are just kind of completely out the window.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1188.991,
    "end": 1190.392,
    "text": "And it's very hard to make sense of what,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1190.848,
    "end": 1192.188,
    "text": " how a system like that would even work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1192.909,
    "end": 1193.169,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1193.529,
    "end": 1214.175,
    "text": "Um, and so it's, and, and part of that I think is because there's, you know, some, um, you know, some, uh, the way that certain things are written in some of the literature can be a little bit, um, confusing or it's not too, it's not too hard to understand why, you know, these sorts of, um, you know, these sorts of misunderstandings could, uh, you know, could happen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1214.955,
    "end": 1218.916,
    "text": "Um, but, but, uh, but the, you know, section two, there was really,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1219.38,
    "end": 1231.302,
    "text": " really is to show how, you know, initially, right, when you're trying to move from predictive coding, again, which is purely a model of perception, it's not about decision making, it's not about action selection, you know, it's not even about motor control, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1231.402,
    "end": 1236.163,
    "text": "It's just a Bayesian, just a theory of how the brain can do approximate Bayesian inference and perception.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1236.183,
    "end": 1249.086,
    "text": "You know, how that was initially just extended to say, hey, like, if the brain works this way, then, you know, how do you get a system that actually controls the body using the same generic architecture?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1249.847,
    "end": 1250.167,
    "text": " Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1250.187,
    "end": 1265.372,
    "text": "And so then, you know, the story that Carl Friston, you know, um, and, um, you know, some other people started trying to put together was the story about how you can use predictions, you know, descending predictions, um, if weighted appropriately, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1265.412,
    "end": 1269.354,
    "text": "As a way of essentially setting the target states of the body, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1269.434,
    "end": 1276.256,
    "text": "Like, like, is this kind of, you know, the way you'll see it talked about is, you know, I predict that my arm will be here, but really it's down here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1276.476,
    "end": 1278.677,
    "text": "But if I wait that correctly, then it'll kind of like,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1279.156,
    "end": 1307.352,
    "text": " know you'll kind of control the set point and reflex arc to you know so your arm kind of moves up with the correct position right but but that's just a theory about how you can use a descending prediction signal to essentially act as a motor command signal right there's nothing in that at all that that's deciding what that prediction ought to be right there's nothing deciding what that what which motor command should should be the one right that's getting sent down in in a you know in in the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1308.12,
    "end": 1310.722,
    "text": " with the form of a prediction, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1310.742,
    "end": 1316.266,
    "text": "So, so again, so even there, it's just a theory about how you can use predictions as motor commands, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1316.366,
    "end": 1322.67,
    "text": "Like there's no, there's a very big distinction between that and whatever the system is on top of that, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1322.69,
    "end": 1327.133,
    "text": "That's deciding, okay, what motor command, what, what motor prediction, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1327.173,
    "end": 1327.713,
    "text": "Do I send?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1328.694,
    "end": 1331.856,
    "text": "And so just making, you know, making, making that clear, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1331.896,
    "end": 1336.239,
    "text": "Because around 2015, there was this big shift, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1336.259,
    "end": 1337.34,
    "text": "From these, from these,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1338.281,
    "end": 1343.063,
    "text": " where from active inference being talked about as a, just kind of a motor control process, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1343.183,
    "end": 1349.646,
    "text": "Like a story about how you can extend predictive coding to, you know, also do motor commands, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1349.927,
    "end": 1357.57,
    "text": "Like from that to, you know, these larger, more comprehensive decision-making models, which are the current, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1359.311,
    "end": 1367.715,
    "text": "And those, you know, which was what we aim to show very explicitly, you know, have something that, you know, in the mathematics,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1368.522,
    "end": 1369.583,
    "text": " It just does, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1369.663,
    "end": 1371.184,
    "text": "It specifies the goals of the system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1372.044,
    "end": 1377.148,
    "text": "It's pretty hard to get around the fact that you need something, a system needs something like goals, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1377.168,
    "end": 1382.771,
    "text": "Because it has to evaluate somehow why one decision is going to be better than another, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1382.911,
    "end": 1387.955,
    "text": "The only way it can really do that is with respect to how likely it is to get whatever the system wants.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1389.796,
    "end": 1397.621,
    "text": "So it's just, I mean, in my view, it's very difficult to see how you could ever get",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1398.895,
    "end": 1405.26,
    "text": " a system to be able to evaluate one action as better than another without having some sort of target state.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1405.38,
    "end": 1414.147,
    "text": "And so you can call, right, like the target states in active inference a type of prior belief.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1414.888,
    "end": 1420.552,
    "text": "But at the end of the day, its functional role is to specify what observations are better than what, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1420.672,
    "end": 1427.758,
    "text": "So, I mean, you can really think of active inferences as using this kind of trick in a certain sense, right, of specifying",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1428.154,
    "end": 1436.758,
    "text": " desired outcomes in the form of a probability distribution because that helps keep everything fully Bayesian, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1437.839,
    "end": 1441.101,
    "text": "But it's not playing the functional role of belief, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1441.161,
    "end": 1444.402,
    "text": "It's encoding higher probability just means, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1444.642,
    "end": 1446.623,
    "text": "Like the better, more rewarding outcome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1447.904,
    "end": 1457.889,
    "text": "So a lot of it is just kind of working step-by-step through both kind of the historical progression so you can see where the misunderstanding could come from",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1458.476,
    "end": 1469.003,
    "text": " and then also through the current formalism so that you can see exactly where the goal states are encoded in terms of something with the form of a probability distribution.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1470.905,
    "end": 1471.185,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1473.362,
    "end": 1482.708,
    "text": " The keywords are active inference, poke psychology, predictive processing, Bayesian beliefs, and desires.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1483.329,
    "end": 1485.13,
    "text": "So now we're going to jump in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1485.791,
    "end": 1489.793,
    "text": "And some of the slides have a lot of text topically arranged.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1490.294,
    "end": 1493.756,
    "text": "So we won't need to read all of the text on many of the slides.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1494.376,
    "end": 1501.942,
    "text": "But especially if somebody wants to pull out one of the highlighted sections and bring it to our attention, that would be awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1502.822,
    "end": 1507.063,
    "text": " So, and also Ryan, thanks a lot for that great historical overview.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1507.263,
    "end": 1515.524,
    "text": "And I think there's so much more to be going into about what happened before 2015 and what happened in the last seven years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1518.045,
    "end": 1529.527,
    "text": "In fact, I think you covered many of the key points in what you just described here, which had to do with the development of predictive coding framework into understanding brain and body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1531.653,
    "end": 1534.436,
    "text": " Is there anything that anyone else wants to add about these points?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1537.819,
    "end": 1537.979,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1541.593,
    "end": 1561.206,
    "text": " All discussions and dot zeros are like a two-way street where some people with active inference familiarity are learning about new ideas and frameworks, and also people who might have familiarity with a broadly used area outside of Act-Inf are learning about Act-Inf.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1562.066,
    "end": 1573.188,
    "text": " For both directions on that freeway, it's important to understand what is the target non-ACT-INF framework that's being juxtaposed and found concordances with active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1573.788,
    "end": 1581.849,
    "text": "So the article is addressing the worry that ACT-INF models may be in tension with the belief-desire-intention model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1582.389,
    "end": 1585.43,
    "text": "And there are some consequences to that worry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1586.23,
    "end": 1589.431,
    "text": "In other words, given some priors, it's a founded worry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1591.351,
    "end": 1595.919,
    "text": " Would anyone like to summarize what the belief, desire, intention model is?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1595.939,
    "end": 1601.128,
    "text": "I think you should, Daniel, because I think you put this slide together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1604.144,
    "end": 1607.386,
    "text": " Ryan, what led you to select the BDI model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1608.046,
    "end": 1613.468,
    "text": "And I wondered about almost this tension or paradox with like, it's folk psychology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1613.609,
    "end": 1621.332,
    "text": "It's about what the people think, but we're gonna do a citation and one specific academic acronym for what people think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1621.572,
    "end": 1630.517,
    "text": "So is this like the main game in town for folk psychology from an academic perspective or what is the BDI and what led you to select that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1631.607,
    "end": 1635.248,
    "text": " rather than a small portfolio of alternate folk psychologies?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1637.749,
    "end": 1650.874,
    "text": "I think that the belief-desire-intention model is just a very generic but also widely known account of trying to capture folk psychology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1650.894,
    "end": 1655.176,
    "text": "It's a major target of a lot of discussion within",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1661.394,
    "end": 1662.555,
    "text": " you know, like philosophy of mind.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1663.976,
    "end": 1666.038,
    "text": "But I mean, it's just very generic, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1666.078,
    "end": 1672.102,
    "text": "I mean, it's just this idea that, you know, what are the necessary ingredients to make a decision?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1672.823,
    "end": 1678.367,
    "text": "Well, you know, I have to have some beliefs about how the world is and I have to have some desires about how the world I would like it to be.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1679.148,
    "end": 1682.51,
    "text": "And my intention involves integrating those two things, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1682.75,
    "end": 1691.117,
    "text": "And then if all goes well in terms of translating intentions into controlling the body, then I'll act out, you know, something according to my intentions",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1691.837,
    "end": 1692.017,
    "text": " Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1692.137,
    "end": 1709.364,
    "text": "I mean, simple, you know, like the dumb example that you'll often hear is just, you know, something like, you know, I desire some ice cream, you know, I believe that there's an ice cream truck, you know, down the road, you know, given those two things and, and necessarily those two things, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1709.404,
    "end": 1715.206,
    "text": "I can inform and touch it and form an intention to go, you know, walk over to the ice cream truck and buy some ice cream, you know?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1715.246,
    "end": 1718.267,
    "text": "So, I mean, the question is how else, you know, are you going to explain,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1718.857,
    "end": 1720.678,
    "text": " why I went over to the truck to buy the ice cream.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1720.698,
    "end": 1732.142,
    "text": "That literally just is, you know, that is the general sort of thing that when we're reasoning about other people's, you know, decisions, other people's, um, you know, behavior and we're trying to figure out, okay, why did this person do what they did?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1732.762,
    "end": 1735.043,
    "text": "You know, if we're assuming it's a voluntary action, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1735.063,
    "end": 1742.706,
    "text": "If we're assuming it's not because like their arms spasmed or, you know, because they have some like really highly ingrained habit or compulsion or something like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1742.786,
    "end": 1743.026,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1743.046,
    "end": 1744.746,
    "text": "And we're talking about voluntary behavior.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1744.766,
    "end": 1746.367,
    "text": "Um, that is just the way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1747.22,
    "end": 1751.224,
    "text": " that we tend to reason about how people do what they do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1751.304,
    "end": 1760.431,
    "text": "Either when somebody does something that we think is weird, then usually we have to explain that in terms of, okay, well, they just believed something that was incorrect.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1761.092,
    "end": 1764.154,
    "text": "Or they had some really funny desire that I don't relate.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1766.196,
    "end": 1770.499,
    "text": "It tends to be one of those sorts of things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1770.799,
    "end": 1773.842,
    "text": "I don't know a lot of other separate",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1774.537,
    "end": 1781.04,
    "text": " uh, both psychological models that would, uh, entail anything different than this, um, you know, at, at a very generic level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1781.62,
    "end": 1785.942,
    "text": "Um, and it's also exactly the sort of thing, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1786.002,
    "end": 1802.11,
    "text": "That, that people try to contrast active inference with where, where instead of, you know, belief desires, beliefs and desires coming together to form intentions, instead it'd be something like one kind of belief and another kind of belief come together to form an intention.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1803.641,
    "end": 1810.304,
    "text": " which again, for a lot of reasons is confusing and rightfully so when it's presented that way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1812.385,
    "end": 1812.625,
    "text": "Thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1813.366,
    "end": 1814.286,
    "text": "Yes, Steve.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1815.126,
    "end": 1830.093,
    "text": "So Ryan, when we've had some conversations with other authors and other papers where we've talked about the scale three formalism, and we've also talked a little bit about the sort of scale friendly times when you have to find that history.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1830.533,
    "end": 1831.354,
    "text": " and that context.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1831.374,
    "end": 1837.96,
    "text": "What you just mentioned was sort of the generic, generalized sense that the BDI umbrella provides.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1838.24,
    "end": 1846.708,
    "text": "You're not saying that scale-free quantification and a generic way of modeling something are the same thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1846.748,
    "end": 1853.895,
    "text": "But what I think, without putting words in your mouth, are you saying that the scale-freeness, as it moves to something more",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1854.415,
    "end": 1882.136,
    "text": " scale friendly sweeps up some of that generic big tent idea or model and now moves it along it allows you to sort of parse and be specific and precise precise but also be able to generalize as you move through those you know quantifications of the distribution and density and such because that's kind of what i was reading into it i just want to make sure that i got it i was kind of maybe you can help me clean that up a bit",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1884.263,
    "end": 1890.045,
    "text": " I mean, I really don't know that anything that we're saying really depends on or even gets into a lot of those sorts of specifics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1890.065,
    "end": 1903.408,
    "text": "I mean, really, really all we're saying is, is that, you know, if you want to take a model, like the current active inference formalism, the current kind of like vanilla formalism, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1903.428,
    "end": 1910.11,
    "text": "So in terms of interest to standard one level POMDP, or, you know, if you want to scale it up hierarchically, it doesn't ultimately matter.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1910.13,
    "end": 1911.751,
    "text": "It is if you want to use",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1913.663,
    "end": 1919.707,
    "text": " the vanilla active inference framework to actually model some sort of voluntary decision process in a human, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1919.727,
    "end": 1925.531,
    "text": "So, I mean, a lot of my work has to do with people, you know, modeling behavior on decision-making tasks, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1925.791,
    "end": 1935.238,
    "text": "Often have to do with, you know, the person, the person has the goal of maximizing, you know, how much money they win or, you know, maximizing some sort of social reward, something like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1935.798,
    "end": 1942.883,
    "text": "The idea is just that when you're trying to, if you're going to take an active inference model and you're going to use it to model,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1944.009,
    "end": 1971.689,
    "text": " successfully model actual human behavior when they're making decisions, then there's always going to be a mapping between the different elements in the active inference model of voluntary behavior that whatever the prior preference distribution is, you just check that so that it just shows the level of reward associated with it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1971.709,
    "end": 1973.29,
    "text": "So there's really nothing about",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1973.789,
    "end": 2003.461,
    "text": " any scale or anything like that this is much more generic it's just if you're going to use active inference to model voluntary choice then um it will always have something analogous to a belief and a desire because that's just what you need right like to model to model voluntary behavior um it's true that you know that's probably if you're if you actually were going to try to capture something uh kind of like more of the actual architecture in the brain as opposed to just",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2004.019,
    "end": 2007.061,
    "text": " this kind of like voluntary decision process aspect.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2007.141,
    "end": 2011.203,
    "text": "I mean, I'm sure there's a lot of kind of hierarchy below that under the hood, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2011.223,
    "end": 2022.389,
    "text": "That's translating more abstract policy selection processes into whatever the dynamic signals are that, that end up controlling, you know, moment by moment muscle movements and things like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2022.409,
    "end": 2029.673,
    "text": "Uh, but the point is, is the below, below this kind of top level where you're doing policy selection, um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2031.448,
    "end": 2034.129,
    "text": " you know, at that point you don't really need the desires anymore, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2034.149,
    "end": 2040.711,
    "text": "You just need the policy to specify whatever the motor commands are going down that can take the form of predictions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2041.732,
    "end": 2053.596,
    "text": "Um, so, so I don't, I don't know if that helps, but it's just, it's just that there's a certain level in any kind of hierarchy of a model that's going to actually be applicable successfully to human behavior.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2053.796,
    "end": 2056.417,
    "text": "And, um, at the level of policy selection, um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2058.783,
    "end": 2061.426,
    "text": " Prior preferences will just include the desired outcomes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2061.806,
    "end": 2064.388,
    "text": "They'll just encode the goals that the agent's trying to reach.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2064.629,
    "end": 2077.842,
    "text": "And the policy that's chosen will be evaluated as being the most likely policy because it's the thing that's predicted to have the highest probability of generating the desired observation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2084.285,
    "end": 2094.046,
    "text": " If I may also comment on that, and I'm not sure if this is answering your question, Dean, but the way I thought about it when I was reading the paper was that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2094.585,
    "end": 2112.867,
    "text": " Part of the reason why the belief-desire-intention model works well for mapping the active inference ontology to the folk psychology ontology is because it's a discrete model in that it separates these different parts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2114.549,
    "end": 2142.178,
    "text": " And I think that also might have motivated the choice to consider mainly discrete POMDPs and describe the decision active inference in that way as well, because then this discrete model can be more easily mapped to, say, the discrete model of the POMDP that's described like a factor graph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2143.962,
    "end": 2145.603,
    "text": " Um, I'm not sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2147.125,
    "end": 2151.568,
    "text": "I was wondering how this would map to continuous tasks as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2152.889,
    "end": 2161.777,
    "text": "Well, I mean, I mean, I think the, I mean, part of the, I mean, uh, you know, part of the, part of the reason why you need something discreet, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2161.917,
    "end": 2164.639,
    "text": "Is, is because actions is discreet, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2164.699,
    "end": 2168.762,
    "text": "I mean, there's either one or there's policy two or there's policy three.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2168.982,
    "end": 2169.243,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2169.283,
    "end": 2172.125,
    "text": "So those, those just are sort of necessarily different.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2172.858,
    "end": 2173.118,
    "text": " right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2173.218,
    "end": 2193.522,
    "text": "I mean, you get, you know, continuous state spaces work well or are appropriate, you know, at lower levels in a hierarchy, you know, when you're talking about kind of dynamics and motor movement, you know, dynamics in the set point of some reflex arc or when you're trying to estimate something in perception that, you know, just as a continuous quantity, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2193.562,
    "end": 2196.623,
    "text": "Like brightness or, you know, orientation or things like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2197.403,
    "end": 2201.364,
    "text": "But at the level of decision-making,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2202.236,
    "end": 2205.038,
    "text": " Um, models that are necessarily right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2205.118,
    "end": 2205.539,
    "text": "It's free.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2206.359,
    "end": 2210.283,
    "text": "Um, I mean, I mean, there is, you know, there are, there are kind of hybrid models, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2210.303,
    "end": 2224.774,
    "text": "That are out there in the literature, you know, like Thomas Parker, for example, you know, has published several papers using these sorts of models where the kind of policy at the higher level, which is, which is an industry model, um, generates right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2224.794,
    "end": 2227.757,
    "text": "Some observation that then sets the set point, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2227.777,
    "end": 2230.739,
    "text": "For some continuous or some continuous lower level model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2231.291,
    "end": 2241.46,
    "text": " that then, you know, can end up in a, in a way that's kind of like this kind of story, you know, like move the eyes around the God to different locations and things like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2242.24,
    "end": 2259.795,
    "text": "Um, so, um, so I, I, I kind of think that, that the, the discreteness is the, or the, the, the reason why, um, things move to a discrete state space architecture is just because of like the necessary, um, what's necessary with respect to a model of policy selection.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2260.875,
    "end": 2261.975,
    "text": " because it is kind of all or none.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2265.616,
    "end": 2272.058,
    "text": "Just to keep the .00-ish, we're going to move a lot faster through the following slides.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2272.678,
    "end": 2277.28,
    "text": "And there's many important questions in the chat and also arising.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2277.44,
    "end": 2280.781,
    "text": "So we're just going to carry on more rapidly so people can...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2281.661,
    "end": 2286.042,
    "text": " pick up on these key points in the zero and we'll have a lot of time to explore soon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2287.883,
    "end": 2296.465,
    "text": "Section two, from predictive coding to active inference, traces the history and the development from various fields.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2297.286,
    "end": 2304.708,
    "text": "And just one sentence here that Dean and I both highlighted on, and then Dean, I'll let you describe the button, was that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2305.908,
    "end": 2311.812,
    "text": " Crucially, for the purposes of this paper, the first generation active inference was not a theory of decision making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2312.452,
    "end": 2315.775,
    "text": "It did not explain how we decide or plan where to move our body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2315.855,
    "end": 2322.819,
    "text": "It only explained how body movements can be executed using the predictive coding apparatus once a decision has been made.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2323.28,
    "end": 2325.261,
    "text": "So how did you connect that to the bottom right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2326.42,
    "end": 2350.635,
    "text": " Yeah, so if you're on some sort of a website and you have to pass through to something, my question was based on that statement, when the expectation is to know that you've actually crossed a threshold, you've moved beyond one page and there's an expectation that there's something that you validated or confirmed or whatever, is the feedback that you received, does that happen?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2351.767,
    "end": 2360.879,
    "text": " how does the person who's actually expecting that they're on the other side, what kind of feedback mechanism do they need for that confirmation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2360.939,
    "end": 2363.041,
    "text": "Is tactile feedback enough?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2363.142,
    "end": 2366.005,
    "text": "Do they need some sort of a visual confirmation as well?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2366.045,
    "end": 2368.028,
    "text": "Like what is the, what's the,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2369.977,
    "end": 2379.545,
    "text": " Is there, because we're talking about thresholds, is that different for every single person or is there sort of expectations built in depending upon the kind of situation that you're dealing with?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2380.505,
    "end": 2390.754,
    "text": "I do know that with the idea that like changes are saved or links are copied, sometimes the click isn't enough to give people confidence that in fact that process is carried through.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2392.455,
    "end": 2398.04,
    "text": "I mean, I would say that, I mean, a lot of those questions are really empirical questions as opposed to modeling questions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2399.731,
    "end": 2403.233,
    "text": " I mean, in terms of how you would model that sort of thing, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2403.253,
    "end": 2422.861,
    "text": "You just specify what observations count as tactile, you specify what observations count as visual, and what ends up being thresholds for sufficient evidence and things like that just have to do with the way that processes just have the dynamics naturally unroll in the model under whatever the model parameterization is.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2422.941,
    "end": 2427.063,
    "text": "So you'll hit a threshold faster if the mapping between",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2428.04,
    "end": 2430.201,
    "text": " whatever observations and states is more precise.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2430.841,
    "end": 2445.485,
    "text": "For example, I mean, there's, you know, in relation to that, when we're doing policy selection, right, we also have to check and see whether things are actually going as we expected them to go, you know, under a choice of policy, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2445.525,
    "end": 2457.249,
    "text": "So it's possible that you choose policy one and you start to get the subsequent observations and they don't actually match what you expected, you know, given that you had chosen policy one, you know, in which case,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2458.415,
    "end": 2463.6,
    "text": " you'll update your beliefs through perceptual inference, and that might influence how you act going forward.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2464.841,
    "end": 2476.392,
    "text": "So, but the specifics about, you know, what's enough and whether it's visual or tactile or anything like that, I mean, those are really just empirical questions that would have to be answered in studies as opposed to something about model choices.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2477.313,
    "end": 2481.517,
    "text": "Okay, so there was really not a good enough thing when you did the darkroom aspect of it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2482.725,
    "end": 2485.929,
    "text": " Like the risk that you were prepared to take on, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2485.969,
    "end": 2492.678,
    "text": "Like somebody was prepared to take on the risk because they really urgently wanted the ice cream versus the person who was like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2493.527,
    "end": 2495.948,
    "text": " eh, I'm agnostic, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2496.308,
    "end": 2500.989,
    "text": "So that's maybe, that's kind of what I was, because this was on the second reading of your paper, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2501.009,
    "end": 2504.87,
    "text": "So I was kind of now backfilling from further down in the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2505.89,
    "end": 2506.81,
    "text": "Well, I'm into that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2507.451,
    "end": 2511.031,
    "text": "We'll go in the order of the paper because we're mentioning things that we haven't brought up yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2511.091,
    "end": 2513.052,
    "text": "But let's continue on and we'll return to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2513.272,
    "end": 2519.013,
    "text": "And Ryan, I also agree that in any specific case, it's going to be a model parameterization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2519.434,
    "end": 2520.854,
    "text": "Some of these are very difficult to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2521.394,
    "end": 2544.055,
    "text": " answer in the abstract model selection setting um here the uh distinction between motor active inference and decision active inference is introduced and um I'll allow Jakob to just convey one pass what is the difference between motor active inference and decision active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2546.992,
    "end": 2573.485,
    "text": " So I'm not sure whether I can say much that hasn't been said yet, but briefly, the motor active inference does, well, as already mentioned, it does not consider desires in both the active inference and folk psychological sense as was then connected in the paper, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2575.226,
    "end": 2595.671,
    "text": " Also, it is my understanding that the motor control version of active inference is modelled continuously, like the models of the movement of individual muscles, which does not entail decision-making, so it's modelled with continuous time rather than in discrete time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2596.571,
    "end": 2601.792,
    "text": "And the decision-making act in, as Ryan already said as well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2603.9,
    "end": 2605.181,
    "text": " is all about decision-making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2605.281,
    "end": 2614.966,
    "text": "So it describes the discrete process of decision-making with prior beliefs and preferences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2615.947,
    "end": 2632.336,
    "text": "And it can be modeled at different levels of cognition as well, which is one thing that I'm still a bit uncertain about how we can move through these different layers while still keeping the same mathematical formulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2634.022,
    "end": 2636.743,
    "text": " but I think we'll probably get to that in the other slides.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2638.623,
    "end": 2647.846,
    "text": "Yep, we're going to continue with this distinction of MAI for motor active inference and DAI for the decision active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2651.347,
    "end": 2657.108,
    "text": "Here, we're showing some key sections from the paper and some citations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2661.559,
    "end": 2687.257,
    "text": " i think we will continue on without going into this in depth but it describes some of the specific model quantities that are being described in active inference formalism and we're going to come to them when we look at some equations in the coming slides um in section three preliminary considerations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2689.181,
    "end": 2695.467,
    "text": " Two broad points are introduced and we might show a second one on a later slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2699.151,
    "end": 2708.62,
    "text": "How can we think, Ryan, about what is said here that decision-making AI models are largely taken to describe sub-personal, non-conscious processes?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2710.431,
    "end": 2719.017,
    "text": " And also it was asked in the chat, not that we have to address it now, by Duvid, has active inference produced a single reasonable model of a qualia?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2719.758,
    "end": 2729.646,
    "text": "So when we're thinking about this first broad point that was made here, where is experience and what is the distinction between the personal and the sub-personal in DAI?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2733.049,
    "end": 2738.353,
    "text": "Well, I mean, so there's a couple different questions you asked there, and I don't necessarily think they're synonymous.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2738.959,
    "end": 2752.861,
    "text": " So, you know, when you said, I think the first question you asked was something about, um, uh, has active inference provided some sort of, uh, explanation or, or model of, um, of qualia that would be satisfactory, um, in the strong sense.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2752.881,
    "end": 2766.944,
    "text": "So in the sense of the sense of quality as an explanation for like the hard problem of consciousness, then I think active inference is in the same place as anyone else in the, no one has a good explanation for, for, you know, how to deal with the hard problem of consciousness.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2767.024,
    "end": 2767.264,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2767.364,
    "end": 2767.804,
    "text": "I mean, like,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2768.379,
    "end": 2772.442,
    "text": " massive literature out there, but I think everyone thinks it's just as mysterious as ever.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2774.123,
    "end": 2775.704,
    "text": "So no, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2775.784,
    "end": 2788.913,
    "text": "I mean, on the other hand, I mean, you know, myself and others, you know, have published multiple papers showing how you can successfully use active inference models to model conscious access processes, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2788.954,
    "end": 2798.14,
    "text": "So the distinction between when the brain is representing something unconsciously versus when it's representing something consciously, you know, in that it can, you know, self-report",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2798.598,
    "end": 2803.119,
    "text": " right, what it's representing, um, can use the information to make voluntary choices.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2803.959,
    "end": 2813.262,
    "text": "Um, and we've shown that those sorts of models are able to, um, you know, reproduce, uh, like empirical results and like EEG studies and fMRI studies and things like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2813.982,
    "end": 2817.743,
    "text": "Um, that, and that also can make novel neurophysiological predictions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2818.023,
    "end": 2825.005,
    "text": "Um, some of which seem like they, um, you know, in some subsequent work, uh, you know, have, um, like empirical support for those predictions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2826.117,
    "end": 2848.028,
    "text": " So in terms of providing what seems like a useful account of the processes associated with what people self-report that they consciously experience and the brain basis for that, I think active inference has at least the starting point for being useful and explaining those sorts of things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2848.108,
    "end": 2854.391,
    "text": "But why one little posterior inside a model versus another posterior in a model actually corresponds to like,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2854.957,
    "end": 2856.797,
    "text": " the experience of red versus blue or something.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2856.837,
    "end": 2863.538,
    "text": "I mean, no, I don't, I think active inferences is not any better than anyone else, you know, any other model for that question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2866.579,
    "end": 2876.621,
    "text": "I guess the second thing, you know, that you asked had to do with this kind of like related question of, you know, why it's the case that one level has to do with a conscious process versus unconscious process.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2876.921,
    "end": 2883.802,
    "text": "And the best I really got there and, you know, what falls out of the models that we've, you know, shown.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2884.192,
    "end": 2885.632,
    "text": " really just has to do with temporal scale.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2886.893,
    "end": 2905.439,
    "text": "You know, so there will be a certain level of temporal representations in a hierarchical model that integrates enough and represents regularities over a long enough time scale that it can contribute to, you know, sort of prospective, it will be sufficiently compact to generate things like self-reports, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2905.459,
    "end": 2913.362,
    "text": "So, I mean, think about how complicated and temporally extended reporting and choosing to report something like, you know, I see something green and",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2914.434,
    "end": 2914.994,
    "text": " me, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2915.034,
    "end": 2926.301,
    "text": "I mean, it's a very complicated and really deep, um, you know, type of policy to select and it requires integrating a bunch of information from stuff at lower levels that's happening over faster timescales.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2927.122,
    "end": 2943.171,
    "text": "Um, so at a minimum, right, you just need to be at a level of representation where the regularities are sufficiently, uh, sufficiently long and, um, especially temporarily deep and then have access to all the relevant information you need to integrate to be able to generate, um, reports like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2944.132,
    "end": 2944.232,
    "text": "Um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2944.69,
    "end": 2958.217,
    "text": " Whereas much of the other kind of little pieces in the model, right, like, you know, the generated, say, like, expected error for, like, variational free energy gradients and things like that, that, you know, people might call, like, surprise, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2958.257,
    "end": 2974.445,
    "text": "I mean, no one's claiming that, and often they will not relate in any way to people's conscious reports about feeling surprised, because conscious reports about feeling surprised will have to do with representations of surprises in states, right, as opposed to, you know, some sort of prediction error, like,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2975.179,
    "end": 2976.88,
    "text": " you know, gradient minimization process.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2978.602,
    "end": 2978.862,
    "text": "Thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2985.308,
    "end": 2999.58,
    "text": "Also in section three, there are several clarifications and some seeds that are planted, namely if computational and folk psychological predictions converge,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3000.541,
    "end": 3026.774,
    "text": " and no other available theory can account for behavior equally well this could entail the mathematical structure of dai as more than a convenient tool instead that it corresponds to the true information processing structure underlying and enabling folk psychology and related abilities and this is really nicely put here that the crucial point remains that one should not conflate mathematical and psychological levels of description",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3027.654,
    "end": 3035.942,
    "text": " However, DAI models might nonetheless offer more detailed information about the true form of folk's psychological categories and processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3036.863,
    "end": 3048.654,
    "text": "And then they add that their aims are to demonstrate that there's a clear isomorphism between the elements of DAI models and those of the BDI model, and then show how",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3049.855,
    "end": 3077.037,
    "text": " provided one does not assume probability distributions in computational models must be identified with beliefs at the psychological level there will be no tension between dai and bdi and that comparison or juxtaposition is clarified by separating mai from dai like has been mentioned anything else before we start to jump into some of the formalisms and keeping all of this in mind",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3081.041,
    "end": 3098.52,
    "text": " I guess I had one question on which ontology we're working with when we say there's an isomorphism between the elements of DAI models and those of the BDI model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3100.642,
    "end": 3102.824,
    "text": " because I think there are multiple ways to interpret this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3104.625,
    "end": 3123.901,
    "text": "One thing that I'm wondering about is whether this means that we can basically construct a mathematical formulation of the BDI model that is like a subset of active inference, or maybe there are certain elements of the BDI model that aren't necessarily",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3124.722,
    "end": 3141.97,
    "text": " encapsulated with enactant that weren't discussed in this paper and what that would mean in terms of formulating this mathematical formulation of the BDI model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3141.99,
    "end": 3153.896,
    "text": "So I mean what the isomorphism just means is tell me the description at one level and I'll be able to translate it for you very quickly and directly into whatever the description is at the other level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3154.269,
    "end": 3155.049,
    "text": " in both directions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3155.87,
    "end": 3156.15,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3156.29,
    "end": 3161.572,
    "text": "I mean, so it just means, you know, tell me, tell me what, you know, tell me what it is that you want.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3161.952,
    "end": 3165.154,
    "text": "You know, if I say, do you want ice cream or do you want a pizza?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3165.614,
    "end": 3165.814,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3166.214,
    "end": 3183.842,
    "text": "Tell me, tell me that you like, if you tell me that you like, you want pizza twice as much as you like ice cream, then it's very easy to just put, you know, a four, you know, in the, you know, in the, in the distribution in, you know, in the preference distribution over the observation of pizza and the two for ice cream.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3184.711,
    "end": 3186.792,
    "text": " And then softmax it and log it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3187.173,
    "end": 3187.433,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3187.653,
    "end": 3192.336,
    "text": "And then like, you know, there's that's the description, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3192.356,
    "end": 3198.319,
    "text": "So just in a very direct way, it just encodes relative desires for one thing versus another, you know, tell me what your beliefs are.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3198.719,
    "end": 3199.0,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3199.04,
    "end": 3201.481,
    "text": "I mean, do you believe that pizza is to the left or to the right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3202.141,
    "end": 3206.304,
    "text": "I can put that in as the different categories of hidden states that you're going for a distribution over.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3206.324,
    "end": 3207.164,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3207.244,
    "end": 3211.287,
    "text": "So like, it's just, the point is, is that in either direction, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3211.447,
    "end": 3212.968,
    "text": "Give me the full psychological description.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3213.84,
    "end": 3224.824,
    "text": " I can translate it very straightforwardly using the same elements every time as being desires or beliefs, you know, give it to me at the mathematical level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3225.464,
    "end": 3228.585,
    "text": "I can translate that into a description in terms of beliefs and desires, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3228.665,
    "end": 3229.845,
    "text": "I mean, it's just one to one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3231.086,
    "end": 3240.389,
    "text": "I can't think of an example offhand where there would be any kind of like mismatch or inability for one to account for the other, but",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3241.241,
    "end": 3243.282,
    "text": " Um, you know, it's kind of hard to prove a negative, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3243.302,
    "end": 3246.144,
    "text": "So, I mean, maybe you can give me an example, but I can't think of one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3248.225,
    "end": 3248.545,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3249.466,
    "end": 3249.846,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3250.907,
    "end": 3254.669,
    "text": "I was just going to say that I can't really think of an example, uh, right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3256.627,
    "end": 3273.402,
    "text": " I just found it really interesting with the usage of the word isomorphism, because as you said, it's just a bidirectional and subjective map, so it's basically equivalent, it's just set in a different way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3274.162,
    "end": 3290.815,
    "text": " So I can imagine that, uh, meaning that we can basically, instead of the Wikipedia page for the BDI model, uh, using all of these terms, um, like believe, desire, intention, it could just be a set of active inference equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3291.195,
    "end": 3293.377,
    "text": "And that's the BDI model because it's an isomorphism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3294.097,
    "end": 3294.257,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3294.277,
    "end": 3299.982,
    "text": "I mean, literally your, your beliefs are just your cues, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3300.382,
    "end": 3301.663,
    "text": "And you're, uh,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3302.208,
    "end": 3305.609,
    "text": " and your desires are just your, uh, you know, P of O's, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3306.41,
    "end": 3312.933,
    "text": "I mean, and, and, and, uh, you know, the way that we've, uh, you know, we and others have tended to write it now, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3312.973,
    "end": 3319.435,
    "text": "It's to literally, it's just explicitly to say like that desires are, um, or the preference distribution is P of O given C, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3319.455,
    "end": 3322.397,
    "text": "Where C is just a matrix that defines your preferences, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3322.437,
    "end": 3328.459,
    "text": "So, I mean, it's a lot clearer to do that, um, than to just, just leave it just P of O, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3328.499,
    "end": 3330.58,
    "text": "I think that's part of the confusion is, is, is that, uh,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3331.138,
    "end": 3355.586,
    "text": " not clear where the preferences come from well but they're just it's just because they're conditioned on this other thing c and c can be fixed or learnt but that's the basis of the calculation there um yeah here we get into section four variational and expected free energy considerations and in large script we see the variational free energy equation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3357.367,
    "end": 3359.948,
    "text": " Dean, what is the skydiver doing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3360.768,
    "end": 3369.29,
    "text": "And during the one and the two, we'll unpack more about the exact terms and what is coming into and coming out of this equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3369.61,
    "end": 3372.991,
    "text": "But just as an appetizer here, what's the skydiver doing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3374.312,
    "end": 3377.773,
    "text": "Well, now that I've got the author here, I just put through that in there because I like the...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3379.386,
    "end": 3386.328,
    "text": " I don't think it's a metaphor, but the analogy of, of how, so how do you respond when you jump out of the airplane and you know, your parachute's not going to work?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3386.908,
    "end": 3395.071,
    "text": "Do you, uh, do you go ahead first and really attack it or like what now, what are you doing in terms of what your expectations are?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3395.091,
    "end": 3402.633,
    "text": "So maybe, maybe that, that, that was a good analogy, Ryan, maybe, but what, like, so where were you, where were you going with that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3402.653,
    "end": 3404.074,
    "text": "Cause yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3405.034,
    "end": 3408.435,
    "text": "Well, I mean, I think the point, the point of those sorts of examples are just, uh,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3409.056,
    "end": 3427.906,
    "text": " just to, um, sorry to put this to, to show why it's not, um, it's not really correct to think about the, um, like prior, uh, you know, this prior preference distribution, even though it's, you know, it's again, it's cast as a prior belief.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3428.286,
    "end": 3428.586,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3429.207,
    "end": 3435.93,
    "text": "Um, it's not really appropriate to think about that as a, as a, um, uh, a belief per se.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3436.171,
    "end": 3436.431,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3436.571,
    "end": 3436.791,
    "text": "I mean,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3437.386,
    "end": 3441.668,
    "text": " the, um, or an expectation at any, at a psychological level of description.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3441.688,
    "end": 3444.829,
    "text": "Um, so you can, and the way to contrast that, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3444.869,
    "end": 3450.472,
    "text": "As you can say, look like the person in a model where they don't want, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3450.552,
    "end": 3451.692,
    "text": "To fall to the ground and die.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3451.712,
    "end": 3452.673,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3452.733,
    "end": 3456.634,
    "text": "That would be your, that would be your PO though.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3456.654,
    "end": 3457.215,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3457.235,
    "end": 3461.156,
    "text": "It's your preference not to have the observation of hitting the ground and dying.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3461.176,
    "end": 3464.738,
    "text": "Um, but what you act, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3465.427,
    "end": 3468.009,
    "text": " Is your Q of O given pi, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3468.049,
    "end": 3473.332,
    "text": "It's what do I expect to observe given that I choose this policy versus that policy, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3473.352,
    "end": 3475.873,
    "text": "So that's the, you know, the belief-y part, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3475.893,
    "end": 3477.894,
    "text": "It's what I expect given that I do this or that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3478.555,
    "end": 3484.778,
    "text": "And, you know, how close is that to how much does that diverge from what I want, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3484.818,
    "end": 3494.184,
    "text": "Which would be your P of O. So it's just a clear example of how your belief-y expectations and your desire-y expectations come apart, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3495.866,
    "end": 3502.792,
    "text": " And it just doesn't work conceptually to think of one as like the same kind of thing as the other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3503.993,
    "end": 3510.418,
    "text": "Yeah, I just saw it as if I'm not going to get a soft landing, how big of a crater can I create?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3510.998,
    "end": 3514.401,
    "text": "Well, that then is going to be packed into your preference distribution, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3514.621,
    "end": 3521.007,
    "text": "You would have some desire to make a big conditional on you're going to die, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3521.667,
    "end": 3525.27,
    "text": "Like you'd prefer to make a big crater than a small crater.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3526.546,
    "end": 3528.948,
    "text": " and that would still just go in your P , right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3529.028,
    "end": 3531.33,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3532.331,
    "end": 3532.671,
    "text": "Jakob?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3535.153,
    "end": 3551.788,
    "text": "I was just wondering, and this might be me thinking too deep, or not too deeply about the equation, rather, but in this formulation where it's a variational free energy for each policy f ,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3554.47,
    "end": 3562.513,
    "text": " Does that imply, in the last sentence on this slide, that free energy is a functional of beliefs and a function of observations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3562.713,
    "end": 3567.855,
    "text": "Does that mean that the free energy is essentially a function of three variables?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3569.255,
    "end": 3579.96,
    "text": "But in this case, we are only writing it f because it's clear that it's a functional of beliefs and observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3580.974,
    "end": 3588.597,
    "text": " Um, or should we think of it more as just a function of each policy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3590.338,
    "end": 3600.703,
    "text": "Um, I mean, the way it's written here, I mean, I think that the most straightforward way to think about it is, I mean, it literally just means that, um, using this equation, you will calculate a different F value for each policy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3601.643,
    "end": 3601.843,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3601.903,
    "end": 3602.763,
    "text": "I mean, that's really it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3602.924,
    "end": 3606.165,
    "text": "Like you just, there will be, you're going to be computing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3606.917,
    "end": 3612.301,
    "text": " some some variational for energy value for each policy, and that's going to make up a distribution over policies.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3614.442,
    "end": 3626.03,
    "text": "And and I mean, the the tricky thing, I guess, here is, is that, you know, this isn't about this isn't, you know, f of f of pi here isn't about making decisions, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3626.45,
    "end": 3636.117,
    "text": "This is just about, you know, something like evaluating evidence for, you know, for various policies, because you you can't you calculate f when you already have the observation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3636.721,
    "end": 3636.961,
    "text": " Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3637.501,
    "end": 3640.822,
    "text": "So you can't really do this perspective decision-making thing with that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3641.642,
    "end": 3653.504,
    "text": "Um, so this is just basically a way of describing how, um, how under each policy, your beliefs will change, um, or wouldn't change right under, you know, when you get conditional on each new observation that you got.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3653.524,
    "end": 3663.066,
    "text": "Um, and, um, and so it's not, uh, yeah, so all, all it denotes really is, is just, you know, you have a value of F for each policy and that makes them a distribution.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3664.946,
    "end": 3685.701,
    "text": " And that takes us to G, expected free energy, the letter after F. And as shown here, not sure if there's another reason for why it's G. This is equation 2.6 from the Active Inference textbook, just for reference with some other versions of how G is framed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3688.998,
    "end": 3701.483,
    "text": " G is a prospective value, and they write, decision-making does not only require beliefs about past and present states, it also requires making predictions about future states and future observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3702.123,
    "end": 3704.144,
    "text": "This requires taking the average, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3704.244,
    "end": 3711.508,
    "text": "expected, free energy, G of pi, given anticipated outcomes under each policy that one might choose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3712.788,
    "end": 3716.87,
    "text": "And there's a lot to say on expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3718.567,
    "end": 3721.209,
    "text": " What is just one short note that somebody could add?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3721.229,
    "end": 3724.012,
    "text": "Or Ryan, why was it placed here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3724.032,
    "end": 3728.015,
    "text": "I'm not sure I understand the question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3731.378,
    "end": 3733.52,
    "text": "Why is expected free energy required?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3733.58,
    "end": 3735.742,
    "text": "Why is variational free energy not enough?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3737.683,
    "end": 3742.708,
    "text": "I mean, expected free energy is just what the system is trying to minimize when it's selecting a policy, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3742.728,
    "end": 3743.028,
    "text": "So I mean,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3743.68,
    "end": 3771.558,
    "text": " it's just trying to, I mean, in this, I mean, this decomposition right here is often called like the risk, risk plus ambiguity decomposition, but, um, I guess, uh, I like, I think that, I think that showing the, um, you know, the risk term, the risk term here provides a nice kind of intuition for, um, for again, the separation between beliefs and desires and active inference, because, um, you know, your, your, uh, so the, the,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3772.298,
    "end": 3775.339,
    "text": " the term underlined in red there, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3775.379,
    "end": 3779.52,
    "text": "So the kale divergence between PO given pi and P of O, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3779.64,
    "end": 3791.044,
    "text": "I mean, that's just saying that, you know, how different are the observations I expect given that I choose a given policy and, you know, how different is that?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3791.724,
    "end": 3797.486,
    "text": "How different do I expect that to be from my preferences or my desires, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3797.546,
    "end": 3798.887,
    "text": "P of O. So the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3800.506,
    "end": 3802.207,
    "text": " the closer those are together, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3802.227,
    "end": 3811.475,
    "text": "The more similar I expect the observations to be under a policy to my preferred observations, the smaller that's going to be.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3811.495,
    "end": 3824.325,
    "text": "And so if I'm trying to select the policy that minimizes G, right, then that means I'm going to select the policy that's going to get me as close to my preferred observations as possible, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3824.365,
    "end": 3827.428,
    "text": "So literally just is that KL divergence literally just is",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3827.898,
    "end": 3831.341,
    "text": " trying to choose the policy that brings beliefs closest to desires.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3834.424,
    "end": 3834.924,
    "text": "Very nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3835.085,
    "end": 3836.726,
    "text": "And then what does the blue term mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3839.168,
    "end": 3840.81,
    "text": "Um, that's just an entropy term, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3840.83,
    "end": 3846.215,
    "text": "So, I mean, it's just basically saying that the, it's what drives information seeking or part of what drives information seeking.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3846.395,
    "end": 3853.842,
    "text": "It's just, uh, it's just, yeah, basically the agents choose, you know, driven to choose policies that also are going to generate, um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3854.318,
    "end": 3858.768,
    "text": " more precise expected observations that are going to disambiguate states more easily.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3858.788,
    "end": 3858.889,
    "text": "Great.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3864.842,
    "end": 3879.296,
    "text": " Here we'll explore it more in the dot one, but there's a description of the posterior probability distribution over policies, p , and an expression involving the softmax symbol with a sigma.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3879.756,
    "end": 3886.483,
    "text": "We'll return to that later, but this is just so that we can cover the key experiments and the simulation results today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3888.975,
    "end": 3902.399,
    "text": " This is also one other area of formalism we can explore in the coming discussions about precision and the relationship of beta and gamma and what the convergence towards means.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3903.219,
    "end": 3904.039,
    "text": "But we won't go there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3904.359,
    "end": 3906.62,
    "text": "There is precision parameter in this model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3909.127,
    "end": 3936.279,
    "text": " let's go to the dark room problem and many lines of pdf screen and ink has been written on the dark room in the active world since um perhaps friston at all 2012 and also outside of active and um they write in a nutshell the concern is that if agents only act to minimize prediction error",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3937.299,
    "end": 3948.309,
    "text": " as opposed to acting under the impetus of a cognitive desire-like state, then they ought to simply seek out very stable, predictable environments, such as a dark room, and stay there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3951.132,
    "end": 3962.422,
    "text": "Would anybody like to add anything about this dark room problem, or what is the relationship between doxastic and cognitive ontology and act-inf?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3968.831,
    "end": 3972.393,
    "text": " I mean, are you just asking what those words mean?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3972.993,
    "end": 3974.894,
    "text": "Yes, how do you use these words?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3976.795,
    "end": 3983.359,
    "text": "I mean, doxastic is just a term that refers to the leafy, like epistemic sorts of things, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3983.879,
    "end": 3988.902,
    "text": "So a doxastic ontology would be an ontology that includes the leafy things, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3989.202,
    "end": 3996.466,
    "text": "Whereas conative just refers to being targeted towards something, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3996.526,
    "end": 3997.286,
    "text": "Like something about",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3997.739,
    "end": 4005.302,
    "text": " you know, desires or, you know, something, things you want versus don't want, things you like versus don't like, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4005.362,
    "end": 4023.388,
    "text": "So it's just, you know, when we say it's apparently purely doxastic ontology, it's just saying it might look as though superficially like the ontology proposed in active inference, like the things that exist in active inference are purely belief-y.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4024.329,
    "end": 4025.349,
    "text": "That's all that means.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4026.77,
    "end": 4030.354,
    "text": " Great, and it's applied in the setting of this dark room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4031.596,
    "end": 4042.289,
    "text": "For the following two slides, Dean help us understand what concerns are addressed and what the child on the top right of the slide is doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4043.988,
    "end": 4061.978,
    "text": " Yeah, well, so I'm not going to go through all of the text, but essentially this was my introduction to the darkroom problem because it was kind of the opposite of all my experience, which is that I tend to find people that were curious and were trying to move away from information",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4064.866,
    "end": 4069.067,
    "text": " leveling off or being static to information gain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4069.167,
    "end": 4088.775,
    "text": "So first of all, I had to learn what the argument was about why people would actually, who are normally social, why they would move away from that social realm and into this sort of dark space under the idea that active inference actually implies that that's what people would do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4090.556,
    "end": 4091.456,
    "text": "And then secondly, it was",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4091.949,
    "end": 4096.433,
    "text": " I was kind of trying to tie it into the idea of the refrigerator and where it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4096.713,
    "end": 4113.006,
    "text": "And until you actually, and Danny, you and I talked about this a bit, the pragmatic piece of until you actually open the refrigerator door, which is on the kind of the next slide, you don't really, I mean, you can have a belief that there's something of value in there, but it can turn out that when,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4113.956,
    "end": 4125.943,
    "text": " you open the door or Monty raises the curtain, the thing that you were expecting turns out to be a value, but not necessarily of that thing that you were setting yourself up to believe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4126.623,
    "end": 4142.612,
    "text": "And so that young individual spitting the coin out, maybe I guess I was just trying to be a little bit facetious there that it holds value, but it doesn't hold the same kind of tasty value as say having a lick of an ice cream cone, so.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4143.796,
    "end": 4154.759,
    "text": " Again, it was trying to move away from the idea that the belief he stopped alone is satisfactory or necessary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4154.779,
    "end": 4171.383,
    "text": "I always get those two mixed up, but I think I was just trying to reinforce the idea that you kind of need to have both so that you can compare and contrast so that you get a sense of what a person or what an agent is doing as they're getting past some of those shrouds or some of those",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4173.456,
    "end": 4175.739,
    "text": " non-observables into the observable state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4178.963,
    "end": 4179.204,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4179.264,
    "end": 4180.165,
    "text": "We'll keep going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4184.884,
    "end": 4209.092,
    "text": " this is unpacking some of the concerns about the apparent pure doxastic belief oriented ontology of actin so ryan described earlier like is it about beliefs colliding and if so if it's purely doxastic then where is this um desire and um is there anything else that anybody wants to add here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4211.428,
    "end": 4228.161,
    "text": " I would maybe comment that I think this also relates to the earlier thing that was discussed, how this confusion might stem from people misinterpreting or misinterpreting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4228.681,
    "end": 4231.983,
    "text": " confusing the terms predictive processing and active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4232.924,
    "end": 4244.992,
    "text": "And I feel like this addresses it as well, where if it's only beliefs, then there is obviously a concern that once we're in a dark room, we...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4247.694,
    "end": 4256.199,
    "text": " Because if we're only in the regime of predictive processing, there is no way for us to move to a different state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4257.04,
    "end": 4261.923,
    "text": "Or there isn't the formalism that describes planning and action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4264.045,
    "end": 4276.153,
    "text": "But as I guess we'll get to in the other slides, when we do include this planning, we suddenly have desire-like terms appearing within.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4276.82,
    "end": 4278.261,
    "text": " the mathematical formulation as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4281.023,
    "end": 4281.243,
    "text": "Great.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4283.625,
    "end": 4285.006,
    "text": "Yeah, and I want to be clear.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4285.046,
    "end": 4287.328,
    "text": "It's not like they're thrown in ad hoc, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4287.388,
    "end": 4296.194,
    "text": "They emerge naturally as like necessary components of any kind of, you know, like using this sort of framework or building it out to involve planning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4296.234,
    "end": 4299.777,
    "text": "So it's not like they emerge naturally and necessarily.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4299.857,
    "end": 4302.639,
    "text": "It's not because someone's just kind of tacking them on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4305.501,
    "end": 4323.65,
    "text": " great um and this is referring to that minimization of g the minimization of g drives the agent to seek out observations that will reduce uncertainty about the best way to subsequently bring about phenotype congruent or preferred outcomes so that's the information seeking",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4325.051,
    "end": 4333.274,
    "text": " Another way to put this is that under DAI, an agent doesn't simply seek to minimize prediction error with respect to its current sensory input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4333.814,
    "end": 4348.42,
    "text": "It seeks instead to minimize prediction error with respect to its global beliefs about the environment, which entails seeking out observations that are expected to generate prediction errors, such that uncertainty is minimized for the generative model as a whole.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4349.893,
    "end": 4362.167,
    "text": " And another aspect of this type of global prediction error minimization process is that it pertains not only to beliefs about states in the present, but also to beliefs about the past and in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4363.068,
    "end": 4370.596,
    "text": "And so this is leading to one of the claims, which is that in addition to desires, DAI captures folk",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4371.573,
    "end": 4382.462,
    "text": " psychological experiences associated with the drive to both know about one's current states and learn what will happen when choosing to move to other states among other parameters in a generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4385.764,
    "end": 4390.088,
    "text": "Let's go into this generative model and come to the darkroom simulation itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4392.51,
    "end": 4399.876,
    "text": "And we'll unpack it more in future times, but the prior over policies E of pi,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4401.354,
    "end": 4421.701,
    "text": " they write that um when the agent repeatedly chooses a policy this term increases the probability that the agent will continue to select that policy in the future at the level of the formalism this corresponds to an agent coming to expect that it will choose a policy simply because it has chosen that policy many times in the past",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4422.481,
    "end": 4432.517,
    "text": " This can be thought of as a type of habitization process, but it doesn't have any direct connection to preferred outcomes because E of pi is not informed by other beliefs in the agent's model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4432.958,
    "end": 4437.505,
    "text": "So here's the partially observable Markov decision process, just one representation of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4438.185,
    "end": 4459.798,
    "text": " and e is sort of floating there influencing but not being influenced by and we had some interesting discussions which we can return to another time about how we might be able to assess whether somebody is engaging in a behavior because they simply have habitually engaged in that behavior but they understand the actual mapping",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4460.885,
    "end": 4479.519,
    "text": " of how policies relate to outcomes, or in another case where somebody might be engaging in a behavior, not because of habituation, but rather because they have some sort of deviation from the appropriate mapping between policies and outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4480.359,
    "end": 4504.567,
    "text": " and maybe there's other ways so I thought that was very interesting how even within the same sort of sparse and first principles model similar behavioral outcomes might be observed on like a behavioral manifold and then different kinds of perturbations or evaluations might reduce uncertainty about what is giving rise to those conversion behaviors in in that case",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4508.603,
    "end": 4511.744,
    "text": " Okay, Dean, with the ice cream truck and the eye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4512.864,
    "end": 4535.15,
    "text": "I'm going to wait because I think this one and the next one are better to take up in a one-two part because if Ryan can come back, there's some good questions I want to ask him about those two sections because this slide and the next one are kind of anti-dark rooms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4535.856,
    "end": 4555.89,
    "text": " And so I want to kind of pick his brain about how we can sort of convince people that that dark room problem is for such a small subset of the population that majority of the stuff that we're talking about here is done in sort of social settings and social context.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4556.051,
    "end": 4557.372,
    "text": "And there's a third party.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4558.212,
    "end": 4570.654,
    "text": " sometimes it can observe an observer and what role that plays in trying to figure out what's going on here as we move from the idea of decisioning and so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4570.714,
    "end": 4571.454,
    "text": "So I'll wait.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4572.115,
    "end": 4572.355,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4572.635,
    "end": 4574.755,
    "text": "So here's part one of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4575.615,
    "end": 4579.856,
    "text": "And here's part two, looking at social learning theory a little bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4580.696,
    "end": 4584.137,
    "text": "But let's go to the figure and to the simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4585.616,
    "end": 4591.699,
    "text": " This is figure one, simulation of an active inference agent deciding whether to eat some ice cream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4592.839,
    "end": 4599.082,
    "text": "And there's various ways to go about describing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4599.622,
    "end": 4608.386,
    "text": "But one of the key pieces, if anyone can give a remark about what is occurring here, is that there's three cases that are being compared.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4609.147,
    "end": 4611.268,
    "text": "There's a no desire case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4612.268,
    "end": 4630.507,
    "text": " a weak desire reflected by this p of o and a strong desire case where the ratio between the two alternatives between um wanting the ice cream and or between the ice cream state and the no ice cream state is a sharper distinction in this second row",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4631.528,
    "end": 4639.952,
    "text": " So there's a case in which ice cream is in the fridge, but where the kitchen is currently dark, and so the agent doesn't know whether the fridge is to the left or right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4640.593,
    "end": 4646.116,
    "text": "So it's like a tea maze setup with three possible cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4646.856,
    "end": 4653.82,
    "text": "One where there's no preference for observing ice cream or not, a weak or a strong preference for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4655.1,
    "end": 4679.124,
    "text": " um and then under these situations we can ask about what happens in terms of the action as well as the um beliefs and valence updates what else would you add about that ryan well i mean i think the point you know the point of this is just to show um well i guess make a couple you know i mean so dean mentioned the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4680.532,
    "end": 4682.393,
    "text": " you know, the issue with the dark room, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4682.453,
    "end": 4690.018,
    "text": "I mean, as you said, I mean, as you said, I mean, this is essentially just a particular, very similar to, to like a teammates, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4690.078,
    "end": 4703.525,
    "text": "I mean, just putting a, putting a different sort of semantics on top of it, but the, you know, but the idea is just that it's just set up to show that, you know, even without any kind of desire, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4703.605,
    "end": 4708.008,
    "text": "Just, just resolving uncertainty the agent will be driven by,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4708.319,
    "end": 4710.941,
    "text": " to leave a dark room or do something to get rid of the dark room.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4711.661,
    "end": 4714.082,
    "text": "Um, so you don't need a desire, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4714.263,
    "end": 4718.345,
    "text": "But, but in fact, any realistic agent is also going to have desires.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4718.745,
    "end": 4731.333,
    "text": "So, um, so in the case where there are desires, then there's two different reasons why, um, no active inference agent will ever, um, stay in a dark room or be motivated to stay in a dark room.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4731.493,
    "end": 4735.755,
    "text": "Like in all cases, it will have a motivation to, to leave.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4736.076,
    "end": 4736.496,
    "text": "So, I mean, the,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4737.059,
    "end": 4750.504,
    "text": " Point is just to show, right, in some explicit simulations that generically, right, like this kind of darkroom problem, it will just never apply to active inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4751.764,
    "end": 4759.567,
    "text": "Again, this darkroom thing only applies if you assume the thing is just doing something like predictive coding, but then somehow also assume that it's making decisions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4763.028,
    "end": 4764.049,
    "text": "But that's not active inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4766.561,
    "end": 4767.941,
    "text": " because it's not a theory of decision-making.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4771.122,
    "end": 4775.143,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4775.363,
    "end": 4781.164,
    "text": "Here is some description about the strength of the desire.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4781.904,
    "end": 4787.845,
    "text": "Could have been shown before the figure, but we wanted to introduce the simulation setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4789.806,
    "end": 4794.587,
    "text": "And as described, there is a desire",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4795.723,
    "end": 4809.034,
    "text": " as well as an information seeking and i believe that's the two reasons why the agent will escape the dark room and there's there's other escape hatches depending on how one constructs their model um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4809.878,
    "end": 4817.127,
    "text": " potentially like a hierarchical model might have a slightly different explanation for why an agent does or doesn't stay in the room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4817.527,
    "end": 4825.797,
    "text": "But even just within this single level model, there's an information seeking as well as a preference realizing reason.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4828.04,
    "end": 4829.121,
    "text": "Any other comments here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4833.76,
    "end": 4834.881,
    "text": " Okay, Dean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4835.841,
    "end": 4836.521,
    "text": "Just a quick thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4837.021,
    "end": 4838.382,
    "text": "I'll put you in the island.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4838.522,
    "end": 4839.342,
    "text": "I'll put you in the island.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4839.663,
    "end": 4840.043,
    "text": "Go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4840.303,
    "end": 4841.123,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4841.704,
    "end": 4849.047,
    "text": "So maybe, Ryan, just a quick, this last couple of sentences, however, preference distributions are set to zero.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4849.607,
    "end": 4850.107,
    "text": "Oh, I'm sorry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4850.147,
    "end": 4851.828,
    "text": "I'm not still on the previous slide, Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4851.848,
    "end": 4852.148,
    "text": "Sorry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4852.588,
    "end": 4853.349,
    "text": "Can you go back one?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4853.429,
    "end": 4854.089,
    "text": "Yeah, go for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4854.769,
    "end": 4862.913,
    "text": "Okay, so however, if preference distributions are set to zero, as in our no-desire simulation, such that no outcome is desired over any other net and active inferences",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4863.433,
    "end": 4867.759,
    "text": " will nonetheless be driven to choose behaviors that will maximize information gain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4867.779,
    "end": 4868.68,
    "text": "Okay, that all makes sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4869.04,
    "end": 4869.961,
    "text": "That's just the background.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4870.662,
    "end": 4872.004,
    "text": "This is the part I was curious about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4872.204,
    "end": 4880.435,
    "text": "While this might reasonably be considered a motivational influence, it is prima facie less plausible that it should be considered cognitive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4881.257,
    "end": 4884.999,
    "text": " and may therefore be better seen as a type of doxastic drive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4885.639,
    "end": 4893.163,
    "text": "Here, the formalism may therefore help us to recover and potentially nuance the folk psychological distinction between desire and curiosity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4893.563,
    "end": 4896.645,
    "text": "These types of drives seem to differ fundamentally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4896.885,
    "end": 4901.628,
    "text": "I agree with you, but I was wondering if you could maybe explain why that...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4903.328,
    "end": 4929.158,
    "text": " should be something that we should keep separate the idea of desire and curiosity I know you go into explaining it a little more into the paper but why did you want to point that out to readers well I mean I think there's a couple things I mean I mean one I think that you know these things are both driving you know decisions about what to do right so in some way they motivate they both motivate behavior right but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4929.773,
    "end": 4958.765,
    "text": " but at the same time, um, you know, and, and I think, uh, this is something, you know, that Alex Keeper, um, you know, pointed out when we were writing this as opposed to just, you know, so it's not just me, um, but, you know, pointed out that, um, you know, there is this kind of, um, fairly clear difference, um, between the, um, this, uh, you know, curiosity or epistemically driven, um, sort of behavior, um, from the kind of desire-driven behavior and the, the, the kind of clear differences is that the, um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4959.465,
    "end": 4963.366,
    "text": " this epistemically driven motivation isn't, um, it isn't driven toward anything, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4963.406,
    "end": 4964.266,
    "text": "It doesn't have a target.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4964.866,
    "end": 4966.906,
    "text": "It's not trying to get one thing versus another.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4966.926,
    "end": 4974.828,
    "text": "Um, all it's trying to do is just, um, you know, just become clearer about what's out there, um, essentially.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4975.448,
    "end": 4975.608,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4975.628,
    "end": 4980.949,
    "text": "So, so the fact that it lacks a target, um, is really, I think what makes the, what makes the distinction clear.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4981.809,
    "end": 4986.99,
    "text": "Um, but the, I mean, beyond that, I think the motivation was just, uh, was just to show that, um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4989.09,
    "end": 4992.111,
    "text": " you know, like just a, you know, generically, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4992.211,
    "end": 5001.012,
    "text": "Like the belief, desire, intention principle doesn't really, um, doesn't really say anything about, uh, you know, types of types of desires.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5001.032,
    "end": 5012.114,
    "text": "There's nothing really explicitly just in that very, very simple, um, um, way of, way of, um, describing the framework that, that separates out, uh, information seeking from, from reward seeking.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5012.735,
    "end": 5012.995,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5013.275,
    "end": 5014.575,
    "text": "Um, so, um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5015.529,
    "end": 5031.392,
    "text": " you know, so you could, right, if all you're doing is trying to, you know, compare active inference to, um, to, you know, the BDI model, very simply stated, then, um, then this is able to kind of nuance a little more, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5031.472,
    "end": 5043.674,
    "text": "Like different, different things that, that, um, might look like, you know, cognitive motivational kinds of things, but, but there are separate, um, um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5044.891,
    "end": 5049.133,
    "text": " on why decisions are made for one thing versus another that are more tied to beliefs in a different way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5050.714,
    "end": 5068.582,
    "text": "That being said, at the same time, I think that folk psychology more broadly, I think very intuitively and naturally does recognize the difference between things like curiosity and things like reward-driven behavior.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5068.702,
    "end": 5071.683,
    "text": "Those are concepts that we have just in our natural folk psychology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5072.532,
    "end": 5075.874,
    "text": " Um, you know, so active inference just captures those, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5076.014,
    "end": 5097.625,
    "text": "I mean, I, um, yeah, I talked about this, um, just as an example of, you know, how, how intuitive I think in like natural, um, this sort of aspect is, um, you know, and I just like, think of like most of the behaviors that say like my little dog does, um, you know, if I look at, if I look at what my dog does 90% of the time, it's way more information seeking than it is reward seeking.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5097.645,
    "end": 5100.967,
    "text": "You know, she searches out for some food a couple of times a day.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5101.51,
    "end": 5106.592,
    "text": " but I take her in the car, she's pulling left and right to see what's out the window and how that changed all the time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5107.093,
    "end": 5109.434,
    "text": "You know, any little sound perks up looks right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5109.494,
    "end": 5110.774,
    "text": "None of those things are reward driven.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5111.215,
    "end": 5113.616,
    "text": "They're all just information seeking.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5114.476,
    "end": 5121.46,
    "text": "Um, so I mean, very, very clearly, that's a big part of, um, you know, what drives, um, us and other animals to do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5121.48,
    "end": 5128.563,
    "text": "Um, so, so the point was just to, just to kind of show that active inference captures that in a certain sense, it adds some granularity to, um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5129.11,
    "end": 5130.811,
    "text": " to at least what the BDI model says.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5130.871,
    "end": 5134.714,
    "text": "But in that case, the BDI model is kind of too horse-grained.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5134.754,
    "end": 5137.215,
    "text": "And I think normal folk psychology doesn't include those things already.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5139.297,
    "end": 5139.577,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5142.559,
    "end": 5144.08,
    "text": "Also to be returned to, Dean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5146.001,
    "end": 5148.723,
    "text": "Yeah, because Brian just basically answered it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5148.763,
    "end": 5155.748,
    "text": "All these two images are basically doing is separating out the sort of goal directed from the curiosity, which is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5156.877,
    "end": 5182.364,
    "text": " know the the image on the right is basically a documentary about the franklin expedition where they were going out to the event horizon but they never returned so did they have a goal probably but was that their curiosity being carried out i think we i think we got to be able to make sure that we appreciate both so that's all i wanted about that this makes me think like um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5183.863,
    "end": 5212.795,
    "text": " are you driven to watch the sunset over the horizon or are you driven to find out what's at the end of the rainbow and what's over the horizon and that's the sort of like infinite open-ended curiosity drive beyond the horizon versus the preferred specific state that one can desire in terms of their um observations and reduce the divergence there but cool um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5215.04,
    "end": 5237.343,
    "text": " wishful thinking we'll come back to we're just leaving notes so that we can um have more to discuss later because these are all like there's such vital threads um Ryan and Maxwell and Alex because they um touch to our day-to-day experience in a way that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5238.888,
    "end": 5243.27,
    "text": " few other frameworks and even papers within Act-Inf do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5243.73,
    "end": 5253.893,
    "text": "So affect and the role of affect and precision, curiosity, these are all just like terms that touch humans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5256.374,
    "end": 5266.478,
    "text": "One thing that I think is probably worth just touching on, I mean, again, something maybe you guys would want to talk about in the future, maybe when I'm not around in any other sessions, not sure, but",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5267.216,
    "end": 5276.163,
    "text": " Um, you know, uh, so there is a, a, probably a distinction that's worth keeping in mind between that curiosity per se and, um, and goal-directed information seeking.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5276.183,
    "end": 5281.127,
    "text": "Um, I think some of the examples you guys have mentioned have been more kind of along the lines of one versus the other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5281.147,
    "end": 5288.392,
    "text": "I think it might be good to just, just keep that distinction clear that, um, you know, and, and vanilla active inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5288.973,
    "end": 5291.094,
    "text": "Um, it is really something more just kind of like curiosity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5291.114,
    "end": 5295.878,
    "text": "You're just kind of like independently driven, just kind of, you know, look where you're going to gain the most information.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5297.104,
    "end": 5316.878,
    "text": " Whereas the construct of directed exploration and reinforcement learning and what also often something that can emerge, I think, a little more clearly in sophisticated active inference is information seeking specifically or in the service of knowing how to get your goal.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5319.72,
    "end": 5326.004,
    "text": "The curiosity version that we're showing here, it has the effect of helping the agent get to what it wants.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5327.919,
    "end": 5334.944,
    "text": " But the drive to seek out information isn't actually itself due to the fact that the agent thinks it will help it get its goal.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5336.425,
    "end": 5338.746,
    "text": "It's just driven to seek the information independently.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5339.927,
    "end": 5356.538,
    "text": "Whereas in other, like in sophisticated inference, the agent is actually doing something more like, I'm going to look over here because I think looking over here is actually going to help me get to what I want better.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5357.342,
    "end": 5362.144,
    "text": " So this is kind of strategic information seeking and that's a little different than just like intrinsic curiosity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5362.804,
    "end": 5364.524,
    "text": "So it's just something to keep clear.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5365.285,
    "end": 5366.645,
    "text": "That's quite interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5366.665,
    "end": 5373.127,
    "text": "It kind of ties a braid back, but let's explore that later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5374.488,
    "end": 5381.11,
    "text": "Here we have a nice clean representation of the summary of the main argument.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5382.421,
    "end": 5396.556,
    "text": " Their proposed solution is somewhat deflationary in the sense that it simply argues that the functional role of desire, not the experience of desire, is straightforwardly present in the DAI formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5397.156,
    "end": 5403.823,
    "text": "And then in more detail, they argue that and they provide four points, which it'll be great to go over with the authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5405.097,
    "end": 5412.921,
    "text": " Based on those considerations, the apparent problem posed by purely doxastic looking constructs is simply not a problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5414.242,
    "end": 5417.503,
    "text": "There are beliefs and desires in the active inference framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5423.006,
    "end": 5426.268,
    "text": "Perhaps we could have explored this more with the formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5426.368,
    "end": 5429.57,
    "text": "So we'll bring it up to talking more about F.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5431.087,
    "end": 5432.671,
    "text": " but won't go into it now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5432.691,
    "end": 5434.716,
    "text": "We'll return to the letters later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5434.736,
    "end": 5438.967,
    "text": "And then the appendix is very informative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5439.977,
    "end": 5446.502,
    "text": " There's a description of all the states and the factors that are used in the simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5447.502,
    "end": 5455.948,
    "text": "And in the model stream one, which is by the way, Ryan, it's our, our most popular series was model stream one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5456.809,
    "end": 5460.732,
    "text": "It was, it was, it was a fan favorite, but yeah,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5462.0,
    "end": 5465.764,
    "text": " It's some similar concepts and MATLAB scripts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5465.784,
    "end": 5470.548,
    "text": "So the appendix describes how the figure one results were generated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5471.229,
    "end": 5475.132,
    "text": "And maybe we'll see if anybody can run that and execute it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5475.213,
    "end": 5485.402,
    "text": "We can play with a few different things and take some of these qualitative linguistics and even mutate the simulation a little bit, see where that takes us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5487.284,
    "end": 5489.946,
    "text": " We'll close out with our usual closing slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5491.427,
    "end": 5494.809,
    "text": "So who would like to take the first last word?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5499.732,
    "end": 5501.834,
    "text": "Yes, Dean, then Jakob, then Ryan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5502.034,
    "end": 5512.821,
    "text": "First of all, thanks for shepherding us, these three cats, through this paper, because there's an awful lot of stuff to try to cover in a pretty short period of time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5512.901,
    "end": 5515.643,
    "text": "And it's easy, I think, to sort of go",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5516.71,
    "end": 5533.463,
    "text": " I don't want to say tangentially, but go deeper into some of the parts of the paper, because for me, it was one of those ones where I would go back and have to reflect on something after I read a section, and then try to fit it into the larger picture that was right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5533.503,
    "end": 5539.288,
    "text": "I think the paper did a very good job of sort of ordering through what you were trying to say in terms of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5539.793,
    "end": 5567.32,
    "text": " the reassurance of how the quantitative and the modeling of the psychosocial could be seen as working with each other, as opposed to, oh, this doesn't answer what this other thing questions, but it does cause, this was a paper that for me, I won't speak for the others, but I had to read the section and then try to plug it back into the overall narrative that was being told.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5567.36,
    "end": 5569.08,
    "text": "And again, I think part of that is because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5569.6,
    "end": 5590.722,
    "text": " the the translation from the stuff that's typically seen as the quantitative part is hard to move into the qualitative part i think that's that's a challenge for anybody that tries to move back and forth between those two things but uh yeah i mean in terms of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5592.546,
    "end": 5599.53,
    "text": " in terms of making a case and providing what I think people need to sort of see the two in the same light.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5600.41,
    "end": 5601.671,
    "text": "Thank you, appreciate it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5603.112,
    "end": 5604.712,
    "text": "Sure, I'm happy if it's helpful.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5606.493,
    "end": 5606.814,
    "text": "Rocco?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5608.174,
    "end": 5616.599,
    "text": "Yeah, I think, I guess there are two points that I'd like to touch on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5616.639,
    "end": 5620.581,
    "text": "Firstly, I thought it was very helpful to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5622.137,
    "end": 5640.53,
    "text": " map these concepts that everyone, even though everyone, I guess that's the nature of psychology, that everyone will have a slightly different probably distribution of what these terms actually mean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5640.93,
    "end": 5649.476,
    "text": "But I think it's in just learning about active inference, it's helpful to link the mathematical formulation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5650.043,
    "end": 5660.633,
    "text": " And even just the active inference ontology, which itself can be very cumbersome at times to these very intuitive concepts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5661.433,
    "end": 5669.701,
    "text": "And I think as we're starting to explore modeling within the accident flap as well, I think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5670.382,
    "end": 5684.006,
    "text": " it will be really helpful to use this isomorphism between active inference and folk psychology to explain the behavior of agents within these models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5684.566,
    "end": 5693.369,
    "text": "And beyond a darkroom problem, when there is some unexpected behavior of an agent, we can directly look at",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5694.011,
    "end": 5706.976,
    "text": " okay, how did this tensor change its values and describe it with this folk psychological ontology?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5707.437,
    "end": 5713.639,
    "text": "So I think personally, that's the most exciting thing about this paper for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5716.28,
    "end": 5716.48,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5717.261,
    "end": 5722.823,
    "text": "Well, I mean, if that's the kind of thing that you're interested in, then, I mean, that's kind of the whole...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5723.814,
    "end": 5727.856,
    "text": " it's kind of the whole motivation of, you know, for instance, like computational psychiatry, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5727.896,
    "end": 5729.777,
    "text": "Which is like the area that I currently work in.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5730.437,
    "end": 5730.637,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5730.657,
    "end": 5739.301,
    "text": "So you, you take, for instance, clinical populations where people may behave in unexpected or ways or ways that don't necessarily seem like they're all that adaptive.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5739.902,
    "end": 5740.062,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5740.082,
    "end": 5742.883,
    "text": "Then you can just fit these models to their behavior and you can figure it out.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5742.903,
    "end": 5743.043,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5743.063,
    "end": 5745.104,
    "text": "Well, what is making their behavior abnormal?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5745.244,
    "end": 5745.464,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5745.584,
    "end": 5750.386,
    "text": "Is it, is it something about an overly precise preference distribution or is it something about, um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5751.909,
    "end": 5760.331,
    "text": " you know, uh, the belief that states, uh, states transition to, uh, to, um, into volatile or uncertain way or, you know, things like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5760.411,
    "end": 5769.474,
    "text": "So, I mean, it is the, yeah, I mean, the kind of, uh, you know, the major point is you can use these models and empirical studies to figure out what the mechanisms are that are leading to healthy and unhealthy behavior.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5770.434,
    "end": 5778.896,
    "text": "Um, and, um, you know, that can give you kind of guiding information toward, you know, design better treatments or,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5779.497,
    "end": 5782.699,
    "text": " you know, trying to measure these things in a more quantitative way, things like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5782.979,
    "end": 5793.725,
    "text": "And, and the, you know, and just as I've said, I mean, this is all using, using tasks that, you know, that involve some kind of goal, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5794.206,
    "end": 5802.21,
    "text": "Like seeking some kind of reward or social approval, or, you know, whatever it is that, you know, humans seek out, you could do that, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5802.29,
    "end": 5807.894,
    "text": "Unless you have a straightforward way to map the formalism, each element of the formalism to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5809.468,
    "end": 5812.909,
    "text": " you know, the reason that we think people behave in the way that they do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5813.249,
    "end": 5813.489,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5813.529,
    "end": 5836.314,
    "text": "So, so, so I guess I'm just saying if that's an interest of yours, then I would think that you would, you'd probably be a fan of a lot of the, a lot of the computational psychiatry literature more broadly, both, you know, both the active inference part, which is a lot of what my lab does, but, but also just the broader computational psychiatry community that uses reinforcement learning and direct diffusion models and all the other, you know, all the other classics that are out there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5838.097,
    "end": 5838.377,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5838.797,
    "end": 5849.181,
    "text": "And it, it opens it up to what organizations want and what do cells want and all these other, um, transpositions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5850.061,
    "end": 5853.242,
    "text": "Well, Ryan really appreciate that last minute, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5855.714,
    "end": 5882.778,
    "text": " belief or desire combination thereof to join us it certainly helped resolve our uncertainty a lot and it's a great conversation in the coming two weeks we're going to be with hopefully some more authors and more lab participants and just i'm looking forward to taking some notes thank you see you all soon bye",
    "speaker": "SPEAKER_00"
  }
]