[
  {
    "start": 3.507,
    "end": 5.25,
    "text": " Hello and welcome everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5.591,
    "end": 10.28,
    "text": "This is ActInf OrgStream number 7.1 on March 20th, 2024.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10.32,
    "end": 14.308,
    "text": "We're here with Jamie Joyce and Speaker John Ash.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 14.869,
    "end": 19.959,
    "text": "We'll have a presentation, then some opening remarks and a discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 20.5,
    "end": 22.825,
    "text": "So thank you both for joining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 22.985,
    "end": 25.009,
    "text": "Looking forward to this and go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 26.356,
    "end": 29.241,
    "text": " Thank you so much, and we're so happy to be here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 29.301,
    "end": 35.772,
    "text": "My name is Jamie, and as stated, I'm here with John Ash, who works with us at the Society Library.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 35.792,
    "end": 50.136,
    "text": "And today we're going to talk about how and why we can make sense of AI deliberations at the societal scale using some proven collective intelligence methods that we've developed in order to help inform and hopefully improve decision making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 50.116,
    "end": 55.645,
    "text": " And, you know, this methodology is something that we've taught to students at 32 universities through educational programming.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 56.005,
    "end": 61.614,
    "text": "And we've even been asked to extend this type of education to fact checkers around the world through the IFCN.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 62.115,
    "end": 73.052,
    "text": "But besides educational programming, one of the main things the Societal Library is working on is enabling societal scale debate on complex issues by creating knowledge graphs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 73.032,
    "end": 81.166,
    "text": " Now, I think we were asked to speak here today because of some recent AI-generated deliberation graphs that we've been releasing on topics related to AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 81.647,
    "end": 95.852,
    "text": "For example, we got an advanced transcript of the debate between Conor Leahy and Beth Jezos, and then we created a number of debate maps about not only their arguments, but different arguments that could be made in the genre of topics that they were discussing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 95.912,
    "end": 98.196,
    "text": "So you can go to our website to see those if you like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 99.188,
    "end": 107.899,
    "text": " I'll show you what it looks like in actuality very shortly, but our work automating the creation of deliberation graphs stemmed from our work building them by hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 108.42,
    "end": 119.835,
    "text": "Essentially, we've been building linked knowledge graphs which map the arguments, claims, and evidence from as many detectable points of view as we can find derived from about 12 different forms of media.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 119.855,
    "end": 126.023,
    "text": "And this includes anything from economic impact assessments to scholarly articles to podcasts and tweets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 126.003,
    "end": 129.89,
    "text": " And we modeled the back and forth or pro-con reasoning in these knowledge graphs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 130.611,
    "end": 132.254,
    "text": "And again, we used to do this by hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 132.354,
    "end": 141.21,
    "text": "And when we did it by hand, analysts would have to spend thousands of hours combing through archives and the internet to find relevant knowledge so that readers wouldn't have to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 141.19,
    "end": 157.596,
    "text": " And of course, we don't just build deliberation graphs, we also enable this complex linked data from our knowledge graphs to be viewable through more flattened usable structures, such as micro-voting decision-making models, which have been piloted at the city level, and something we call papers,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 157.576,
    "end": 174.015,
    "text": " which is an interactive interface that looks deceptively like a paper but is unpackable across varying dimensions of argumentation, linguistic register, and you can even open sentences in the paper to see like a Wikipedia page of information about each and every sentence which contains a specific claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 174.485,
    "end": 175.726,
    "text": " But why would we do this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 176.207,
    "end": 179.75,
    "text": "Well, once upon a time, libraries existed because information was really scarce.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 179.93,
    "end": 181.872,
    "text": "That's not why they existed, but that's why they were useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 182.493,
    "end": 186.317,
    "text": "And it was helpful to have commonly held knowledge that people could go and collect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 186.857,
    "end": 200.391,
    "text": "Now we have an overwhelming amount of information, and it's a fine line to walk to both parse out irrelevant or duplicative information, while also ensuring that you have the maximally context relevant information to include a particular issue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 200.371,
    "end": 204.577,
    "text": " Essentially, it's like really easy to bias our understanding of an issue by omission of data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 205.097,
    "end": 220.759,
    "text": "So we feel as though independent public serving institutions should exist like libraries, digital libraries, to ensure that people have the maximal context and the maximum amount of information available about complex issues without having to spend the thousands of hours finding it and analyzing it themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 220.739,
    "end": 237.195,
    "text": " So just like the Library of Congress largely serves as the intelligence arm of Congress on policy matters because the intelligence community works for the executive branch, if I'm not mistaken, I think we need to reimagine what a digital public library in the 21st century could look like to serve the public.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 237.175,
    "end": 252.197,
    "text": " which by default doesn't give you like a consensus view, but a diversity of views and shows you that when it comes to complex policy matters, there are usually multiple competing points of view with evidence and argumentation that are in direct conflict.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 252.177,
    "end": 260.567,
    "text": " simply a lot of complex issues have no right answer, but must be elucidated amongst value trade-offs and assessment of the evidence that's available.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 261.268,
    "end": 280.851,
    "text": "Because when we have questions like, how far do you think personalization of AI assistance like ChatGPT to align with a user's taste and preferences should go, which was a wicked ethical question that OpenAI posed over the summer, there are many competing answers and philosophies, some which deploy justifications and reasoning to support why that answer is correct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 280.831,
    "end": 294.549,
    "text": " So, for example, one response could be that AI assistance like ChatGPT should be personalized to a user's taste and preferences to the fullest extent and highly tailored based on the user's past interactions, preferences, and data with no boundaries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 294.99,
    "end": 304.442,
    "text": "Another position is AI assistance should understand and adapt to a user's taste and preferences but have defined limits on learning sensitive or potentially harmful information, et cetera, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 304.979,
    "end": 327.274,
    "text": " Essentially, given the limited powers of observation that we have and that there's only been so much investigation into a given question space, it's helpful to see what work has been done and what reasons and evidence exist and what preferences people have, which can be informed by the collective knowledge pool of a given civilization, pre-modeled as a deliberation so that people can have an easier time logically processing how information is related.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 328.165,
    "end": 340.941,
    "text": " Now there's still a gap and we can do demos later on this talk, but there's still a gap between what we've been able to automate with AI in terms of creating these large maps of societal scale deliberation and what we've been able to do by hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 341.061,
    "end": 343.187,
    "text": "So here's an example of when we did by hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 343.167,
    "end": 352.396,
    "text": " Hopefully, some of you remember that there was this great big debate in the state of California about the last remaining nuclear power plant, which was called Diablo Canyon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 352.416,
    "end": 355.118,
    "text": "This was a big debate in the past couple of years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 355.859,
    "end": 370.052,
    "text": "Essentially, the plant was slated to be closed down, its respective reactors in 2024, 2025, but the safety and environmental impact and the utility of its energy production has been debated for decades and decades.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 370.032,
    "end": 386.209,
    "text": " So we essentially deconstructed or extracted the logical reasoning from over 5,000 artifacts of multimedia types in order to create a state-scale representation of what the debate in California looked like, what the debate that people were having actually looked like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 386.709,
    "end": 397.761,
    "text": "And we mapped thousands of arguments linked based on their logical relationships across economic, environmental, safety, political, ethical, and other considerations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 397.741,
    "end": 401.067,
    "text": " We then fact-checked and steel-manned these arguments as much as possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 401.688,
    "end": 406.896,
    "text": "Steel-manning means to make the argument as strong as possible through supportive reasoning and evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 406.916,
    "end": 412.426,
    "text": "And this took over 8,000 human research hours, which is four full-time human research years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 413.447,
    "end": 416.733,
    "text": "I could say a lot more about methodology here, but let's just get the idea of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 417.014,
    "end": 419.698,
    "text": "And you can see this map on our website if you would like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 420.134,
    "end": 425.241,
    "text": " So here's an example of just like one claim that's enlarged and then the debate about that one claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 425.822,
    "end": 434.894,
    "text": "So this enlarged claim reads market forces and financial incentives have made the Diablo Canyon nuclear power plant redundant, non-competitive and undesirable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 434.934,
    "end": 439.139,
    "text": "And that's both like a high level kind of vague, but also substantive claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 439.56,
    "end": 444.927,
    "text": "So as we unpack the tree, we see linked argumentation and evidence that's more precise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 444.907,
    "end": 455.003,
    "text": " I know you can't read it, but basically that high level claim gets broken down into more specifics like the details of consumer demand in California across three trends.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 455.564,
    "end": 460.052,
    "text": "And then as you can see here, there's essentially like eight levels of argumentation back and forth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 460.352,
    "end": 468.906,
    "text": "That's a combination of breaking claims down into something that can be mainfully debatable and then actually getting down to like the data level of people arguing over this claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 468.886,
    "end": 472.27,
    "text": " Now what you're seeing on screen is not everything that could be unpacked here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 472.31,
    "end": 475.494,
    "text": "It's just one tiny little string that goes eight layers in depth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 476.295,
    "end": 486.668,
    "text": "Now I'm going to show you how many strings exist only if we unpack three levels deep because unpacking to the full extent would actually be too large.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 487.669,
    "end": 489.291,
    "text": "So here we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 490.368,
    "end": 494.273,
    "text": " So this is just three layers of argumentation in that same graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 494.293,
    "end": 496.095,
    "text": "It's a very superficial unpacking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 496.535,
    "end": 508.149,
    "text": "These are, again, very high-level and substantive arguments, which we collected from those 5,000 artifacts, deduplicated, steel-manned, cleaned up, contextualized, fact-checked, linked to references as much as we possibly could.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 508.83,
    "end": 514.076,
    "text": "And if we unpack further, we could see those long eight-layer strings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 514.796,
    "end": 518.721,
    "text": "And this is a 2x speed video that's not on loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 518.701,
    "end": 521.125,
    "text": " And it goes on for a minute and 50 seconds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 521.505,
    "end": 527.234,
    "text": "I'm certainly not going to subject you to watching it, but my hope is that you can appreciate the scale that we're talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 527.675,
    "end": 535.187,
    "text": "Social media has allowed us to scale up the nature of communication since hundreds of thousands or millions of people can comment on threads online.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 535.627,
    "end": 541.857,
    "text": "But these threads in this video are deduplicated and like high quality real arguments that were made.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 541.837,
    "end": 552.217,
    "text": " So even though social media scaled our ability to communicate at the societal scale, no platform we've seen has really enabled the clean and formal debate at the societal scale on these points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 553.019,
    "end": 557.668,
    "text": "Social media content is very useful, but you still have to dig through lots of underdeveloped points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 557.648,
    "end": 572.186,
    "text": " So this enormous model of California's debate was created over eight months with four full-time analysts and then two part-time analysts using our tools and methods, largely unautomated by LLMs, which we're working on today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 573.908,
    "end": 576.832,
    "text": "And hopefully you'll let me, there we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 577.012,
    "end": 577.433,
    "text": "Okay, great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 578.214,
    "end": 585.563,
    "text": "So again, that's the old process and we're looking to automate with AI and then actually point that technology towards debates about AI itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 586.049,
    "end": 597.226,
    "text": " So when we ask questions like, what should we do about AI, we don't have to spend thousands of research hours seeing the debate that has already occurred asymmetrically through different publications and platforms on the web.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 597.847,
    "end": 604.497,
    "text": "And here's the article on Medium if you'd like to read about our framing of debates about AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 604.477,
    "end": 608.482,
    "text": " there's some problems with how we debate about AI currently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 609.243,
    "end": 630.071,
    "text": "What I'm trying to impart today is that Twitter spaces and online polls and citizen assemblies and books really aren't going to cut it in order for us to comprehensively and sincerely model the collective knowledge and reasoning we are expressing if our goal is to sincerely scale conceptualization of problems and the solution space and then inquire into truth to try to make optimal decisions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 630.152,
    "end": 634.197,
    "text": "Let's dive a little deeper into the challenges of mapping AI debates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 634.177,
    "end": 638.181,
    "text": " and especially the problems that people tend to run into in other projects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 638.601,
    "end": 640.303,
    "text": "Of course, first is scope.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 640.323,
    "end": 659.801,
    "text": "From just a few hackathons that we were conducting at the Internet Archive, we were asking hackathoners to generate topics of debate and they came up with 841 unique high-level preliminary debate categories across topics like regulation and safety and alignment and goals and paths and future threats and risks and on and on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 660.782,
    "end": 664.065,
    "text": "The AI debates are enormous debates",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 664.045,
    "end": 672.457,
    "text": " Think about that video you just saw and all the arguments in that knowledge graph scrolling by and how that was just answers to one question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 672.517,
    "end": 675.04,
    "text": "What should happen to that nuclear power plant?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 675.06,
    "end": 677.083,
    "text": "There are potentially hundreds of questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 677.223,
    "end": 689.901,
    "text": "There's probably millions of questions you could plausibly ask, but if you bucket them together and regress backwards, there's at least hundreds of questions that we could ask about artificial intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 689.881,
    "end": 696.803,
    "text": " And so if we're to comprehensively map these AI debates, the breadth alone of just questions we need to answer is unbelievably immense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 697.103,
    "end": 702.79,
    "text": " But before we even start debating questions, we have other problems like regarding semantics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 702.991,
    "end": 708.618,
    "text": "When people discuss risk and regulation, it's really important to get straight about what we mean about AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 708.638,
    "end": 713.144,
    "text": "There's many terms that people often use interchangeably with AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 713.164,
    "end": 720.853,
    "text": "The wonderful thing about government documentation is that they provide in their regulatory language definitions of what they mean, which is fantastic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 721.194,
    "end": 724.478,
    "text": "But not everyone on the Internet does that, and that can prove a challenge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 724.458,
    "end": 735.732,
    "text": " And then also, if we're sincerely interested in debating and facilitating societal scale debate, it's really critical that we're sourcing arguments and materials from different stakeholders and groups who hold different views.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 736.373,
    "end": 742.901,
    "text": "At the Society Library, we explore the culture of different stakeholders in order to try and understand the differing context of groups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 743.302,
    "end": 747.647,
    "text": "That's actually really important because the context can have a great big impact on reasoning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 747.627,
    "end": 752.377,
    "text": " which may be another challenge if groups are left to themselves to communicate across silos.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 753.199,
    "end": 765.485,
    "text": "Here's an example of something that happened recently on Twitter, where this was an exchange between AI Safety Memes and George Hotz, where George Hotz said, it's not the models they want to align, it's you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 765.966,
    "end": 768.471,
    "text": "And then AI Safety Memes replied with both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 768.451,
    "end": 778.58,
    "text": " And so in order for that exchange to happen in earnest, my sense of it is that there is a great big difference about what is implied when we talk about aligning human behaviors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 779.341,
    "end": 790.271,
    "text": "And I think that kind of has something to do with trust and authority for people who maybe are more safety aligned, adjacent to that idea within their particular culture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 790.332,
    "end": 796.197,
    "text": "There may be this idea of increasing harmony and understanding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 796.177,
    "end": 824.58,
    "text": " uh when they mean ai alignment and then maybe like other groups in different communities like effective accelerationism even though i don't want to paint any group with a broad brush of course there may be like this inherent implied distrust and authority so it kind of brings the question up of like well who decides um you know so there can be differences within cultures even though the same language is used meaning can be implied and so it's really important to like be in these communities and trying to understand to help extricate out all the implied meaning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 824.56,
    "end": 849.623,
    "text": " when people are making claims um now this is a fun part that i really like um another challenge of mapping ai debates is around calibrating the level of abstraction of the knowledge that we're surfacing so at the society library we create links between and this is not our full ontology this is very simplified um just so you know um we create links between high level sentiments and arguments and more precise claims and then link those to the artifacts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 849.603,
    "end": 856.222,
    "text": " And the reason why we do this is because it's faster to read through all the sentiments than if you were presented like the full scope of all those arguments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 856.282,
    "end": 864.625,
    "text": "It's much easier to read like, you know, 14 positions as opposed to go through that entire video's worth of 5,000 linked points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 864.605,
    "end": 881.112,
    "text": " um and then just so we aggregate things up and allow people to click and unpack um but what do we mean by a sentiment so here's one um you know fears about super intelligent ai from the less wrong community are just a projection",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 881.092,
    "end": 883.916,
    "text": " Now, you can imagine this being something that someone would tweet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 884.336,
    "end": 885.678,
    "text": "It's like the gist of an idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 885.698,
    "end": 890.404,
    "text": "And then there are certain like these kinds of sentiments are the kinds of things that often pop up in polling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 890.805,
    "end": 901.058,
    "text": "So like this is an example of some high level sentiments that were aggregated in a pollist poll about, you know, sentiments around A.I.,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 901.038,
    "end": 920.413,
    "text": " if we were to debate sentiments like this it's a little bit too high level setting aside for a moment so like you can't you know drive is from on and all of that but um if people do so we're more descriptive in the way that we represent deliberations so we accommodate the fact that people justify value preferences with uh reasoning and evidence but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 920.393,
    "end": 927.012,
    "text": " So if we were to debate the justifications around it, we would have to break them down into arguments and each one of the pieces of reasons that support it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 927.513,
    "end": 935.736,
    "text": "So let's go back to that example of the sentiment that fears about super intelligent AI are just a projection from the less wrong community.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 935.716,
    "end": 938.039,
    "text": " Now, this is just an example, so everyone calm down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 939.661,
    "end": 941.864,
    "text": "And here's an example of an argument.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 941.945,
    "end": 943.487,
    "text": "I will read this to you, don't try to read it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 943.927,
    "end": 951.618,
    "text": "So, taking that sentiment and actually breaking it up into a high-level argument, here's an example of extricating out the premises and conclusions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 951.718,
    "end": 952.579,
    "text": "So, premise one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 953.12,
    "end": 956.805,
    "text": "Members of the less-wrong community are more likely to display higher-than-average intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 957.366,
    "end": 962.753,
    "text": "Higher-than-average intelligence individuals are more likely to have experienced more frequent feelings of loneliness in childhood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 962.733,
    "end": 969.52,
    "text": " Several studies suggest frequent feelings of loneliness in childhood is correlated with increased likelihood to project that God is wrathful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 969.901,
    "end": 974.666,
    "text": "However, according to X survey, most self-reported less-wrong members indicated they do not believe in God.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 974.946,
    "end": 979.351,
    "text": "However, 83% claimed they were raised in a household in which one or both parental guardians believed in God.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 979.972,
    "end": 990.023,
    "text": "Though, according to Y survey, 64% of self-reported less-wrong members indicated they have 70% confidence level or higher that superintelligence would exhibit wrathful behaviors or attitudes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 990.003,
    "end": 999.737,
    "text": " The powers ascribed to superintelligence are often defined in ways that would make it analogous to perceived powers of God, irrespective of incentives, motivations, or perceived forms of said identities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1000.198,
    "end": 1005.065,
    "text": "Human beings sometimes project perceptions of one feeling, idea, entity, or event onto others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1005.486,
    "end": 1016.061,
    "text": "Therefore, less wrong members may have an increased likelihood of experiencing a cognitive bias which results from extensive loneliness due to higher than average intelligence in childhood, which primes them to transfer projections of a wrathful God",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1016.041,
    "end": 1040.31,
    "text": " which they are more likely not to believe in instead onto the future behaviors or attitudes of super intelligence so it's just an example it's i know it's income it's not incomplete and it's like not broken down to like the greatest extent and that's because it would just be too much to read on screen um so but in if we're going to be meaningfully debating these things we need to take sentiments build out argumentation to like steel man them and then argue over those premises",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1040.358,
    "end": 1042.563,
    "text": " Let's see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1042.643,
    "end": 1042.964,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1042.984,
    "end": 1057.135,
    "text": "And like, you know, each one of these premises, hypothetical example, has even though some of them are real claims that are made with actual references, you know, each one of these is kind of supported by like a stack of artifacts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1057.115,
    "end": 1065.383,
    "text": " And so when we think about how to create a model that shows the debate at the societal scale, we are essentially aggregating up and compressing knowledge so that it's reversible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1065.764,
    "end": 1073.151,
    "text": "But as an organization, we think it's important to have an audit trail down to the references themselves so readers can dive up and down the level of abstraction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1073.472,
    "end": 1076.435,
    "text": "So it's about maintaining provenance while enabling accessibility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1076.455,
    "end": 1081.84,
    "text": "So it's like we are providing this bird's eye view and then going into in-depth detail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1082.63,
    "end": 1086.116,
    "text": " The problem with this, though, is that, of course, we lose details, we aggregate up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1086.597,
    "end": 1095.654,
    "text": "But we've developed an ontology based on descriptive methods of how people tend to argue and then how we can make it concrete to make things actually debatable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1096.074,
    "end": 1103.267,
    "text": "So, for example, you know, people may say things like nuclear waste is dangerous, but it's kind of a meaningless thing to debate unless you make it really concrete.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1103.548,
    "end": 1106.393,
    "text": "Are we talking about storing it, transporting it, licking it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1106.373,
    "end": 1110.779,
    "text": " In what form and in what ways is it actually dangerous?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1110.839,
    "end": 1114.304,
    "text": "When you start breaking it down, you can actually get into something that's meaningfully debatable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1114.865,
    "end": 1117.528,
    "text": "But I just really want to drive home the scale that we're talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1117.548,
    "end": 1126.08,
    "text": "I showed you an example of the difference between a sentiment and an argument, but let's walk through what it may be like to actually map this out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1126.881,
    "end": 1131.027,
    "text": "Here are the seven claims that make up that one argument about less wrong folks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1131.127,
    "end": 1133.27,
    "text": "That's not including the conclusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1133.29,
    "end": 1135.553,
    "text": "I guess the conclusion is there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1135.533,
    "end": 1141.042,
    "text": " So let's just unpack the premises because each one of these premises is debatable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1141.603,
    "end": 1144.728,
    "text": "So there may be a set of arguments need to support why each claim is true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1144.788,
    "end": 1148.915,
    "text": "This is why it may look like there's just one argument for each claim when there could be like way more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1148.955,
    "end": 1155.465,
    "text": "And those arguments to support the claims in and of themselves have arguments and like on and on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1155.445,
    "end": 1179.917,
    "text": " So hopefully this kind of reminds you of the knowledge graph video I showed you earlier, and hopefully this helps you appreciate the magnitude of what it means to not take shortcuts and really try to comprehensively map argumentation by breaking it down and then arguing over the premises, then arguing over the data that supports those premises, etc., etc., which we feel is how you can in earnest map societal scale deliberation, especially if we care about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1179.897,
    "end": 1188.675,
    "text": " Not necessarily like finding out the truth, because again, we have limited knowledge, limited powers of observation, but at least just sincerely inquiring into what could be true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1189.887,
    "end": 1194.071,
    "text": " So there's this sort of like mind blowing complexity with the volume and structure of knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1194.912,
    "end": 1198.174,
    "text": "And we think we need tools to help us accommodate that complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1198.214,
    "end": 1206.002,
    "text": "And like I said, we work on many different things like interactive briefing documents, different visualizations and decision making models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1207.062,
    "end": 1210.466,
    "text": "But, you know, just getting that base layer data is like really important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1210.606,
    "end": 1217.132,
    "text": "So on top is kind of like a layout of our old methodology and how we used to build these knowledge graphs by hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1217.472,
    "end": 1219.894,
    "text": "And now we're moving towards automating with AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1219.874,
    "end": 1235.258,
    "text": " by fine-tuning models at different layers of our ontological structure based on our understanding of what ontology accommodates deliberation, generating synthetic data, fine-tuning it, and pairing that with claim extraction from the artifact level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1236.04,
    "end": 1241.308,
    "text": "We're working on modeling the logical relationships of which we accommodate 11.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1241.288,
    "end": 1244.452,
    "text": " So there's still a lot of work to be done, but we've made a lot of progress.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1244.813,
    "end": 1248.417,
    "text": "And I'm happy to open up some of our toys and we can do some live demos if you're interested.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1248.798,
    "end": 1263.297,
    "text": "But in general, this is just the direction that we're moving in so that there can be this library institution that exists where if people want to explore complex subjects, they can ask a question, press a button, and then it goes out and through a system",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1263.277,
    "end": 1272.449,
    "text": " collects the relevant information, logically structures it so people can see the different positions and the different evidence and argumentation that supports those different positions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1273.591,
    "end": 1275.313,
    "text": "And we could always use help.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1275.333,
    "end": 1277.536,
    "text": "We're a 501c3 nonprofit organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1277.596,
    "end": 1280.5,
    "text": "Feel free to reach out to us to collaborate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1281.181,
    "end": 1283.885,
    "text": "And I'm really excited to now take your questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1283.905,
    "end": 1284.205,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1289.737,
    "end": 1290.498,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1290.518,
    "end": 1291.519,
    "text": "Thanks for the presentation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1291.979,
    "end": 1296.264,
    "text": "John, want to give a first remark or any comments?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1297.225,
    "end": 1298.026,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1299.087,
    "end": 1313.022,
    "text": "You know, when we talk about active inference, we're often talking about sort of a generative world model on which, you know, we're using to make predictions about some underlying true world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1315.464,
    "end": 1319.068,
    "text": "But in the case of either language models, which are",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1320.854,
    "end": 1325.22,
    "text": " you know, dominating, you know, so much of the tech space right now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1326.362,
    "end": 1334.372,
    "text": "And just the sort of direction that things are sort of going is that we're not actually modeling a real world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1335.013,
    "end": 1338.258,
    "text": "We're modeling the artifacts of many separate different world models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1338.338,
    "end": 1348.752,
    "text": "And all of those different world models have a different, you know, crystallized representation of that world",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1349.103,
    "end": 1361.877,
    "text": " And when we train these models, we're not making predictions about a true underlying world state, we're making predictions about a collective representation of artifacts about the world where there are many different world states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1363.199,
    "end": 1376.173,
    "text": "And the interface to that, to these models of world models is sort of evolving and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1377.233,
    "end": 1404.321,
    "text": " changing as we grow as a people as we discover what is right and what is wrong inherently these models are pluralist because there's so much disagreement about what the true underlying state of the world is because it doesn't have access to or the language models currently do not have access to the real world there is going to be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1404.757,
    "end": 1431.355,
    "text": " Representations or like a multi dimensional representation that covers all of those different perspectives perspectives and what we're trying to do is to get like in terms of the models that exist right now is both get a. True in some accounting of the world, but also you know, keep the user talking to the model and.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1431.942,
    "end": 1457.545,
    "text": " different models have different interfaces on which they preference right now for example experimenting with claude quite a bit it tends to really lean into confirmation bias meaning that whatever world model that you might have that has a tendency to reflect and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1458.301,
    "end": 1461.788,
    "text": " proclaim or project that you are right, to keep you talking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1461.948,
    "end": 1476.478,
    "text": "If it tried to lean into only one representation of the world, it's not really leaning into the real world, it's leaning into our preferred representations of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1477.64,
    "end": 1499.344,
    "text": " the world basically whether it be preferencing towards the scientific worldview whether it is like grok where you know they literally in their system prompts say never be woke um whether it's gemini which had the debate about their uh tendency to um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1500.286,
    "end": 1523.897,
    "text": " you know when producing like generated artifacts about historical periods to always include minorities in those representations there is inherently going to be baked in some preference to the world model of the generators so what we're trying to do here is to strip back a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1524.316,
    "end": 1552.568,
    "text": " that preference or that bias meaning that we're trying to use as many models and tools as possible to get some form of artifact where you can holistically see the largest possible distribution of actual world models that are held within that map without preferencing or biasing any particular one and give people the capacity to explore",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1553.02,
    "end": 1582.302,
    "text": " the those differential world models in that we as a species have succeeded so much because we are integrating and aggregating um our different perspectives of the underlying true state of the world because we have such a limited you know aperture through which each to see the world and we have succeeded quite a bit by summing those differential perspectives through conversation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1582.72,
    "end": 1612.626,
    "text": " and now there's this evolved sense that we can use these generative models which are modeling the conversation space by predicting you know essentially what the next token is i can't possibly access uh all potential written text ever written by all humans but it tries to do the best that it can and we're trying to with the full knowledge that it is sort of a fluid space",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1612.977,
    "end": 1642.09,
    "text": " create some representations whereby people can honestly interact at a bird's eye view of all the potential representations that might be held within the model um so that you can get this pluralistic god's eye or bird's eye view of belief space about the true the supposed true underlying world that exists those are my thoughts",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1646.018,
    "end": 1670.136,
    "text": " a lot of ways to go i mean just to connect to the concept of affordances and policy selection in active inference a really important thing that's not shown on those branching trees is like the probability of each of those paths so it can be a pure collection effort like collecting the flora and fauna of a region",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1670.487,
    "end": 1688.85,
    "text": " at a first pass and then that provides all of these tools some of which are quite hard to get to they're like a well-crafted design or a thought that might not be immediately apparent in its relationship to a parent claim and then giving the toolbox",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1689.674,
    "end": 1719.225,
    "text": " without even necessarily saying here's what 80 or 99.9 of people in this or that space feel so instead of going the statistical route of averaging out over word use which is already going to be an issue because it's like the fuzzy and the statistical as well as the the dead and the linearized as opposed to the actual cognitive regenerative model that's making those words this is providing a tool bench",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1719.695,
    "end": 1732.189,
    "text": " or at least seeing, like you said, from a bird's eye view, like these are the lanes in the highway, or this is the street map, but how you use the street map is going to be all about where you want to go, all of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1736.494,
    "end": 1746.346,
    "text": "Did you just want to talk a little bit about how we are attempting to crowdsource in through the voting mechanism?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1747.047,
    "end": 1747.407,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1748.534,
    "end": 1758.983,
    "text": " Yeah, so like, you know, our interest in the work that we're doing is acknowledging that a lot of the work that we could be doing could be a middle layer for different tools.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1759.485,
    "end": 1763.556,
    "text": "So like, if I'm not mistaken, like, you know, in Tetlock's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1763.536,
    "end": 1774.958,
    "text": " literature, there is some evidence to suggest that one of the distinguishing characteristics of a super forecaster is ingesting diverse amounts of information across a spectrum of potential belief space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1774.978,
    "end": 1784.076,
    "text": "And so having tools that could make it so human prediction could be increased in quality or more likely to predict the correct outcomes is one potential middle layer thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1784.056,
    "end": 1795.352,
    "text": " The other thing that we did that John just mentioned is that when we were releasing our debate maps about AI that are AI generated, which you can see on our website or LinkedIn or Twitter, people asked for a voting mechanism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1795.773,
    "end": 1799.979,
    "text": "So we enabled the ability for people to vote on each and every single node.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1800.279,
    "end": 1802.943,
    "text": "And then it creates a little mini graph on top of the node.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1802.963,
    "end": 1809.372,
    "text": "So you can see in terms of how many people are participating where, you know, towards",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1809.352,
    "end": 1811.956,
    "text": " disagreement or agreement how much people believe that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1812.276,
    "end": 1819.627,
    "text": "Now, we normally don't platform that specific feature because it has this inherent biasing effect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1820.388,
    "end": 1835.95,
    "text": "If people believe that something is highly believed by others, they may be coerced to believe that that has higher value or something like that, which unless you're doing like a really rigorous, robust representative sampling of people and then have them vote on that platform.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1835.93,
    "end": 1841.241,
    "text": " Then, yeah, it just it just may be like a majority rule or like self-selected bias kind of situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1841.301,
    "end": 1843.605,
    "text": "So we've never used that feature before, but people asked for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1844.006,
    "end": 1857.313,
    "text": "But in addition, you know, our next steps include taking our decision making model, which is a micro voting protocol that actually aggregates up people's beliefs once they go through each and every section of a belief space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1857.293,
    "end": 1859.375,
    "text": " and connecting that with our knowledge graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1859.395,
    "end": 1864.521,
    "text": "So there's many different decision-making tools, prediction tools that could be built on top of this linked data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1864.541,
    "end": 1877.094,
    "text": "It's just enough of a challenge to create this linked data and pushing to like the maximalist context that we're interested in pushing towards in order to make it possible to make an evidence-based or more informed decision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1878.996,
    "end": 1887.064,
    "text": "Yeah, and that's the interesting thing is that inherently with these language models, you know, if you go before fine-tuning",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1887.584,
    "end": 1899.896,
    "text": " they're inherently going to put output worldviews that are more common, that are more prevalent, whether or not those reflect the true underlying state of the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1899.976,
    "end": 1910.066,
    "text": "If you train a language model only on information from the 1500s, you're going to get a very, very different set of outputs for the distribution of beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1910.707,
    "end": 1916.072,
    "text": "And that notion of the probability of the different lanes",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1916.373,
    "end": 1940.592,
    "text": " that could be traced out is something that I find to be sort of woefully underrepresented in the work as it currently stands and hopefully we'll see more of an evolution towards embracing outputs that lean into the uncertainty about the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1940.993,
    "end": 1966.123,
    "text": " claims being made by the model and also hopefully bake into the model you know really at a parameter level like assessments of uncertainty and assessments of confidence that different people have and sort of an evolving time-based binding to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1966.812,
    "end": 1968.455,
    "text": " the changing of that map.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1968.675,
    "end": 1976.828,
    "text": "Because like I said, if we take this snapshot today, it's going to look different than it does in two years.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1976.888,
    "end": 1988.767,
    "text": "There are various sub-movements in AI that exist now that really did not exist five years ago.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1988.827,
    "end": 1994.136,
    "text": "And so there will be a process of evolution where",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1995.82,
    "end": 2009.442,
    "text": " these maps and the way the information that is represented in them will evolve and people will be able to get a more nuanced representation of the change",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2010.62,
    "end": 2033.725,
    "text": " over time but it's one of those things where it's like we're going from having to rely on like four years of full research work from humans just sitting around gathering documents on their own and reading through them manually to okay well now we can get at least a snapshot of this particular moment to hopefully creating a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2034.093,
    "end": 2060.775,
    "text": " evolving representation of all those lanes and all the probabilities and sort of like uh you could imagine like a ton of overlapping overton windows and their motion through time as these maps you know evolved through time as the internal representation of all these world models held by this one model or these many different models in this case",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2061.582,
    "end": 2067.272,
    "text": " evolve as training continues, as feedback from the crowd continues.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2068.147,
    "end": 2074.175,
    "text": " And that actually may be really useful through time to be able to predict certain trends in human beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2074.695,
    "end": 2089.554,
    "text": "So if we were to go back in time and model the argumentation about interracial marriage, which is a values-driven, conflict-laden debate at a societal scale, we may see patterns of argumentation like, what about the children?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2089.654,
    "end": 2090.255,
    "text": "It's unnatural.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2090.275,
    "end": 2091.977,
    "text": "It'll destroy the fabric of society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2091.957,
    "end": 2099.125,
    "text": " And then fast forward through time, same-sex marriage is an issue that people are debating about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2099.465,
    "end": 2101.828,
    "text": "And maybe we see the same pattern of argumentation emerge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2101.948,
    "end": 2102.769,
    "text": "What about the children?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2102.829,
    "end": 2103.509,
    "text": "It's unnatural.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2103.57,
    "end": 2104.931,
    "text": "Destroy the fabric of society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2105.291,
    "end": 2112.699,
    "text": "So maybe that's going to make it easier to predict when polyamorous marriage seems to inevitably become a legal issue that people are going to want to debate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2113.06,
    "end": 2115.042,
    "text": "Is it the same pattern of argumentation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2115.142,
    "end": 2117.965,
    "text": "Is there anything that is actually differentiating that situation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2117.945,
    "end": 2129.685,
    "text": " like what would be differentiated in a debate about like interspecies marriage or something like that, where a new argument about like consent, because we cannot communicate with animals, could actually make a meaningful difference in the pattern of argumentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2130.106,
    "end": 2139.582,
    "text": "So we're hoping that over time, we can kind of like accelerate through the kind of arguments that are more related to culture and values, which could be actually",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2139.562,
    "end": 2151.857,
    "text": " correlated with, like, disgust or, like, unfamiliarity or fear and, like, feelings, as opposed to, like, the reasons that people may deploy to justify those things, which we could see over time, like, it didn't result in what people thought it may result in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2151.897,
    "end": 2161.249,
    "text": "That's another interesting aspect when we would perhaps compare this to something like active inference, in that there is...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2163.288,
    "end": 2172.06,
    "text": " There is supposedly, you know, this underlying true world state, which, you know, when we had... Yeah, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2172.08,
    "end": 2172.561,
    "text": "Debatable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2173.662,
    "end": 2174.643,
    "text": "Very debatable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2174.723,
    "end": 2183.876,
    "text": "At your, you know, school where you hosted it, there was like a very rich and intense debate about the nature of truth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2184.256,
    "end": 2190.645,
    "text": "But then on top of that, there is also this more morality space, this...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2191.368,
    "end": 2221.273,
    "text": " that exists only within here right and the only way to model that distributed morality space is just by asking people their questions and inherently baked into like these maps inherently baked baked into debates in the first place is there's the true aspect of it like people trying to assess what's true but there's also this uh much more complex representation of morality and ethics which often can",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2222.418,
    "end": 2236.951,
    "text": " not necessarily reflect something in the real world, but reflects something deeply felt that is very hard to get access to, very hard to model, very, very hard to predict, but can dramatically shift very rapidly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2237.072,
    "end": 2243.698,
    "text": "Like for a long time, the interracial marriage question was very, very, very fixed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2243.878,
    "end": 2251.665,
    "text": "It was like something like 10% of people thought it was okay, and then it just very rapidly shifted.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2252.472,
    "end": 2265.621,
    "text": " to to the other direction and people just very rapidly began to accept oh that that makes more more sense and it's an interesting unsolved question trying to model that space",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2265.905,
    "end": 2292.486,
    "text": " yeah well and one thing i would say too is that like it's the reason why our approach is so context maximalist so instead of like trying to get people at a citizen assembly or to like fill out a poll and have them like express their preferences or values and then try to justify that it's like some some things are so deeply felt and justified by our feeling of certainty that it can be it's almost like ineffable it can be really difficult for people to articulate so instead like deploying strategies to like look",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2292.466,
    "end": 2320.954,
    "text": " across different stakeholder groups look across different forms of media that different stakeholder groups are expressing themselves um we can begin to like kind of link together some of the justifications that people put forth because instead of uh you needing someone who's participating in a poll to be able to articulate themselves well it's like you can look across the wide span of civilization and its artifacts to see if someone was able to articulate something and what's the diversity of those articulations you know when people feel nuclear waste is dangerous",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2320.934,
    "end": 2332.547,
    "text": " Where are the people who are talking about containment, long-term storage, transportation, standards of containment in the United States versus Sweden, coming in contact with it, leakages that happen, that sort of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2332.827,
    "end": 2337.673,
    "text": "So by just looking deep into the space, you can find some people are able to articulate more so than others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2338.033,
    "end": 2347.684,
    "text": "And particularly in published works, they tend to be more thought out and more descriptive than what a real-time performance of a debate or participation in a deliberative",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2347.664,
    "end": 2377.587,
    "text": " system or like citizen assembly may yield in terms of like reasoning yeah that's interesting oh did you sorry were you still going daniel looked like he wanted to pop in i just go ahead john if you want okay go john i was just thinking about like there is this inherent aspect of polling which is the dominant form of getting the sense or the pulse of the population that the phrasing of the polling biases the responses and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2379.254,
    "end": 2389.126,
    "text": " also the fact that you're sort of boiling down their perspective into just one way or the other and not leaving the space for them to just say whatever they say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2390.147,
    "end": 2406.527,
    "text": "What is interesting about this evolving space is that we can take and just cast as wide a net as possible with no presumptions baked into, you know, that sampling, like with a large language model in the first place, trying to get a representation of the internet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2407.317,
    "end": 2414.593,
    "text": " yes there may be all these bots in there and there may be all these you know people trying to influence what is online but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2415.046,
    "end": 2441.779,
    "text": " you're not referencing or shaping the debate by any particular question you're just pulling every possible thing and then trying to distill out of it compress out of that representation that people can make sense of the territory that exists and hopefully as time evolves we'll get clearer and clearer representations of those um of the territory with better and better maps",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2442.434,
    "end": 2449.143,
    "text": " And I just want to pull on this thread a little bit because this is actually a really important distinction within the society library methodology and our ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2449.644,
    "end": 2453.649,
    "text": "Like when we built debate maps by hand, the question would actually come last.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2454.09,
    "end": 2458.756,
    "text": "We would just find a topic and unpack the topic space through like various techniques.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2458.776,
    "end": 2462.181,
    "text": "We had like 22 different techniques for how to unpack a space and look for claims.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2462.161,
    "end": 2478.485,
    "text": " And what would happen was we would just aggregate claims up, and what we would find was when you start clustering them up hierarchically based on reasoning and levels of abstraction, eventually you would get to what we call positions, which are just general orientations about something, and what that would do is actually articulate the question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2479.106,
    "end": 2483.292,
    "text": "Because like John said, the way you ask a question can be inherently biasing to a debate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2483.272,
    "end": 2508.807,
    "text": " like we received an email and someone said you know how fast can you make a debate map about like should ai be governed democratically and i wrote that back to them like well we can literally press a button and have four or five stages of a deliberation graph done in a couple of minutes but like you may want to rethink like how you're asking the question because the question behind should ai be governed democratically is should ai be governed or even beyond that what should we do about ai",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2508.787,
    "end": 2511.612,
    "text": " And then we can progressively formalize to what should we do about AI?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2511.632,
    "end": 2512.493,
    "text": "Well, we should govern it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2512.513,
    "end": 2516.12,
    "text": "How should we govern it democratically versus all of these other different governance mechanisms?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2516.581,
    "end": 2523.693,
    "text": "And like right now we're releasing maps where we're just asking the question of our system and pressing a button just to demo how we're like being able to automate this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2524.094,
    "end": 2532.448,
    "text": "But really when it comes to building the libraries themselves, it's about figuring out what questions people are actually debating over most fundamentally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2532.428,
    "end": 2562.199,
    "text": " because it's when you find those fundamental questions that you're casting the widest possible net of relevant argumentation it really like creates the scope of logical relevance and we don't want to accidentally bias by omission or commission and so the best example i can give for this is our work on climate change climate change was the first topic that we began like doing r d and our methodology on and what we ultimately found that of the millions of questions you could ask about climate change and like the hundreds of millions of claims that have been made about climate change",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2562.179,
    "end": 2567.284,
    "text": " Pretty much the debates about climate change break up into just six questions, which is like, what is it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2568.005,
    "end": 2569.406,
    "text": "Again, those debate over terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2570.507,
    "end": 2571.228,
    "text": "Is it happening?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2571.668,
    "end": 2572.469,
    "text": "What causes it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2572.769,
    "end": 2573.891,
    "text": "What's the impact of it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2573.971,
    "end": 2575.292,
    "text": "What could or should we do about it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2575.572,
    "end": 2577.534,
    "text": "And why has this debate lasted for so long?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2577.935,
    "end": 2588.625,
    "text": "And we found that when we framed the questions that way, we've never been able to find a claim that wasn't logically relevant somewhere in the tree very cleanly across those six questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2588.605,
    "end": 2594.531,
    "text": " And it allows for like a really clear delineation of like relevance when it's, it may not seem obvious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2594.591,
    "end": 2603.279,
    "text": "So like claims about the extreme weather events, their intensity and frequency belong under like, how do we know, you know, is climate change happening?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2603.299,
    "end": 2616.351,
    "text": "Well, there's increased intensity and frequency of storms and that's relevant because yada yada, which is very different than statements about the intensity and frequency of storms, like killing people and impacting like underdeveloped nations, which would fall under impact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2616.331,
    "end": 2643.385,
    "text": " and you can see how like maybe it'd be very easy on social media for that argumentation to go differently where someone's like storms are increasing in intensity and frequency and some and someone's like yeah and they're killing people it's like it's easy for um debates to kind of like bleed all over the place but when you find those most fundamental questions it gives clear delineation so you can meaningfully debate something to conclusion because if you don't have that structure you can just debate infinitely and recursively forever in all directions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2643.365,
    "end": 2673.304,
    "text": " um yeah so that was like a little discovery that we made early on with our methodology that led us to believe we were on the right track in terms of our approach awesome well so many pieces here just some of the terms and the topics that i'm picking up on that we talk about all the time in active inference are like attention the role of affect in cognition uncertainty including estimates of one's own uncertainties introspection",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2673.284,
    "end": 2701.755,
    "text": " context different forms of expression epistemic foraging so those are all really cool topics and then i got the sense like we're saving or scaffolding or augmenting the relevance realization for the cognitive entity like the ant colony nestmate as they're going through the street map not trying simply or only to make an artifact which itself has an understanding",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2702.09,
    "end": 2707.847,
    "text": " like a kind of answer machine about what should we do about this power plant in California?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2708.03,
    "end": 2715.92,
    "text": " It's a totally different systems design and process and method to try to develop something that can address that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2716.341,
    "end": 2725.533,
    "text": "Again, begging the question, what does it even mean to address that question for an artifact when it's the people who have to do and live with it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2726.414,
    "end": 2734.965,
    "text": "And then just one last piece was like on some of the recent active inference papers touching on these topics like...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2734.945,
    "end": 2748.634,
    "text": " Designing Explainable Artificial Intelligence with Active Inference by Mal Abarassan and colleagues talking about how when uncertainty parameters are explicitly defined and used as such in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2748.918,
    "end": 2771.922,
    "text": " these composable architectures then that variable in the program like can be interpreted that way it has that semantics internally and then that semantics that are internal can be used externally whereas this this whole reverse engineering of investigation into really nano and sub components of statistical architectures which",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2772.02,
    "end": 2789.45,
    "text": " may come up with some gold, may come up with some vapor, but it's also kind of like tracing the connections in brains or ant colonies or other complex systems, which is like, okay, even when you know every microprocessor, it still is hard to actually predict what is the effect of two lesions at once.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2790.131,
    "end": 2793.116,
    "text": "Those are just some of the challenges of complex systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2793.577,
    "end": 2796.542,
    "text": "And so to really respect that,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2796.522,
    "end": 2807.005,
    "text": " or even appreciate some of the depth like many many layers of depth that these debates are and i think like hold up that affective component",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2807.339,
    "end": 2811.124,
    "text": " but also recognize that it's kind of like an attractor excuse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2811.484,
    "end": 2812.446,
    "text": "Like, I'm tired.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2812.906,
    "end": 2813.847,
    "text": "Like, why can't I do this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2813.968,
    "end": 2814.568,
    "text": "I'm tired.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2815.349,
    "end": 2816.771,
    "text": "It is a totally valid reason.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2816.831,
    "end": 2829.668,
    "text": "And that person maybe like shouldn't be forced to go to that event, but I'm tired doesn't have, you could go sub reasons, but it's like it collapses a lot of other reasons into it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2829.648,
    "end": 2849.479,
    "text": " and those are our general sentiments which is why it is hard to get so precise and follow these trails because they take a lot of attention and craft and suggestions from others which unless they're curated you're never going to get exposed to enough good takes or takes period",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2851.265,
    "end": 2854.691,
    "text": " Yeah, I super love the phrase epistemic foraging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2854.871,
    "end": 2858.157,
    "text": "I had not previously heard that and I love that as an idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2858.197,
    "end": 2865.77,
    "text": "And yeah, we specifically use the terms arguments, claims, and evidence to like kind of preserve claims that people make like I'm tired.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2865.87,
    "end": 2870.938,
    "text": "It's not all fact-based, like it's a big misconception people have about the nature of our work is it's like mostly just facts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2871.439,
    "end": 2877.289,
    "text": "So I'm glad you like kind of brought that up because it's an important distinction for people to know about our work too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2878.838,
    "end": 2887.431,
    "text": " Yeah, that's been on my mind this whole conversation is that there's sort of like a differing philosophy about, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2887.765,
    "end": 2914.279,
    "text": " like I was trying to say, something like a model that has access to the world directly, where it's trying to model the universe, trying to model and predict things that will actually happen in the real world, versus epistemic space, versus belief space, where it is this aggregation of various beliefs, and we can't come to a pure representation of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2914.934,
    "end": 2925.65,
    "text": " the real world just by evenly sampling, the best thing that we can do is we can map that belief space and the distribution of beliefs that exist within it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2926.813,
    "end": 2928.218,
    "text": "Yeah, like...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2928.4,
    "end": 2953.8,
    "text": " to the example of body temperature which we kind of commonly return to an active inference there's a distribution of body temperatures there's no point in like denying that it could be outside of a homeostatic range that excludes people who need it most basically and so you can just talk at the like research level or scale about the distribution",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2953.831,
    "end": 2958.056,
    "text": " then you could make that into like a weighted distribution, basically a probability distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2958.377,
    "end": 2964.084,
    "text": "So the area under the curve sums to one for a given person through time or for population in a snapshot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2964.244,
    "end": 2972.754,
    "text": "And then like, that's the beginning of sampling and inferring that from the thermometer readings or from the body sensors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2973.715,
    "end": 2977.56,
    "text": "That's the beginning of what we can and ought to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2978.536,
    "end": 2991.938,
    "text": " that's the policy selection question but that initial sense making to go from observations um and crashing them with priors getting to a probabilistic understanding of of how things are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2992.357,
    "end": 3011.428,
    "text": " then that can be acted upon and it can be modeled how that gets updated by taking different affordances like the different things that are said in the conversation they are like selected from kind of a deck of cards it's like written on the fly as well but it is selection if you start to abstract",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3012.59,
    "end": 3015.793,
    "text": " I'll ask a question from the live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3016.494,
    "end": 3024.642,
    "text": "Upcycle Club wrote, I wonder what types of information theoretic patterns emerge from those debate maps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3027.124,
    "end": 3031.469,
    "text": "I wish it was more of a live chat so I can know what you mean by information theoretic patterns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3033.41,
    "end": 3041.078,
    "text": "They can follow up, but statistical or informational patterns in the maps when you analyze them like as their own data structures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3041.48,
    "end": 3050.593,
    "text": " Yeah, so I mean, one thing I can say that's hopefully relevant to what the person was querying is that our ontology was built descriptively and not prescriptively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3050.613,
    "end": 3064.213,
    "text": "So before we developed essentially the strategy of the Society Library, we looked at over 168 different systems and we found a lot of different systems were prescribing a specific ontology to reasoning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3064.193,
    "end": 3078.125,
    "text": " And while it's important to like accommodate more formal forms of reasoning, like actually breaking up argumentation into premises and conclusions, if we're creating a model that can inform like, you know, tools that could help human reasoning, you kind of have to accommodate how people also reason.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3078.166,
    "end": 3081.814,
    "text": "So our ontology has 11 different kinds of logical relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3081.794,
    "end": 3086.442,
    "text": " And there's the typical pro, con, true, relevant dimensions to argumentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3086.702,
    "end": 3105.473,
    "text": "But then there's also things like, to be more specific, this means, which is a tag that we put on the edge relationship of nodes between something vague, like nuclear waste is dangerous, and then essentially the cluster of more precise things that kind of have the same abstract meaning, but are actually something that's more precise that can be debated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3105.453,
    "end": 3111.845,
    "text": " And that can be broken down, you know, across several different layers because people, we couch so much meaning in terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3111.885,
    "end": 3114.891,
    "text": "Like if we're talking about market forces, then we talk about consumer demand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3114.911,
    "end": 3118.838,
    "text": "Well, consumer demand means very specific things at very specific times, et cetera, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3119.219,
    "end": 3124.93,
    "text": "So in terms of like information patterns, our ontology kind of like represents those information patterns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3124.91,
    "end": 3130.036,
    "text": " We just notice like consistently how people tend to reason and we work to formalize it as much as possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3130.316,
    "end": 3135.362,
    "text": "So it's not just like a relevant random link data that's kind of like a visualization of what Twitter is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3135.763,
    "end": 3153.364,
    "text": "Our goal is to put it into formal reasoning while also accommodating the fact that when people express themselves, they may express themselves more vaguely or they may have a wider birth of what they would consider to be relevant, which we then have to include because it's such a popular sentiment, but then like also correct with counter argumentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3153.344,
    "end": 3158.972,
    "text": " And so one way we do that is we not only have these edge relationships between nodes, but we also have tags.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3159.492,
    "end": 3176.736,
    "text": "So things like information in the model could be outdated, but we include that information and then just include the counter relevance argumentation and a label that says maybe outdated because we understand that not everyone has the most up-to-date information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3176.716,
    "end": 3178.338,
    "text": " And so we're modeling a deliberation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3178.438,
    "end": 3193.06,
    "text": "We're going to include what may be currently irrelevant given the evidence that exists, especially if it's very factual, but have that contextualized information attached to it that can only be unpacked and seen as pairs together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3193.44,
    "end": 3195.203,
    "text": "So there's things like that we've done with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3195.243,
    "end": 3202.894,
    "text": "And so I guess one of the information patterns is that people have a lot of unupdated understanding of a particular issue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3202.934,
    "end": 3205.778,
    "text": "People tend to cluster around",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3205.758,
    "end": 3223.227,
    "text": " Popular ideas which are punctuated across different categories and then people often argue in very vague ways I would say another information pattern is that people get and again, hopefully this is my correct interpretation of what was implied by the use of the term but people tend to debate about methodology as well and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3223.207,
    "end": 3232.522,
    "text": " So a lot of like the little strings that we were debated have to do with like, you know, the changing of models of how we assess seismic risk throughout the 20th century.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3232.542,
    "end": 3244.32,
    "text": "And it's like the back and forth argumentation from like congressional hearings and things like that about like, hey, listen, as this plant got older and older, we discovered more and more fault lines, but also the model for how we assess seismic risk changed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3244.3,
    "end": 3254.646,
    "text": " So it's like argumentation within academia and like activists and like Congress about like, is that appropriate or is that a way of just like giving a green like rubber stamp for the nuclear power plant to continue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3255.007,
    "end": 3261.583,
    "text": "And then we, we of course find all of the logical fallacies at play ad hominem and things like that, which, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3261.563,
    "end": 3264.909,
    "text": " which we have to deconstruct so it's not ad hominem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3264.929,
    "end": 3268.757,
    "text": "It's not just like, this is a, you know, sorry for the knocking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3268.777,
    "end": 3270.26,
    "text": "There's some construction in the building.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3271.182,
    "end": 3280.58,
    "text": "You know, people will make the argument that like a character who has produced evidence or reasoning is like flawed in some way, but we like look for, well, what are the reasons that justify that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3280.6,
    "end": 3281.782,
    "text": "And can we model debates about that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3283.846,
    "end": 3283.926,
    "text": "Hmm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3285.104,
    "end": 3293.595,
    "text": " all very interesting and like looking at that like growth and kind of the occupancy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3293.66,
    "end": 3323.633,
    "text": " the non-equilibrium stationary state of like where people dwell like these are the radio stations that people are dwelling on again there's the spectrum of all the radios and then here's the dwelling patterns and so it's like there's the underlying possibilities of landscape and then stacking it up and looking like a sharper and sharper probability distribution where people are spending more of their attention and then all the ways that the different computer systems are are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3324.355,
    "end": 3353.181,
    "text": " in feedback with that at kind of unprecedented scale and type and it's like each one of these brit topics touches upon so many different cascades of claims and questions and i think it was really cool how you talked about the question arising from higher order perhaps very seemingly latent or oblique aspects of the space",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3353.6,
    "end": 3366.85,
    "text": " And I guess my question is, do the claims always ramify out like a directed acyclic graph or how do you deal with it when there are cycles of justifying claims?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3368.585,
    "end": 3378.443,
    "text": " Yes, there's, again, finding the right question is important to kind of create the bounds of logical relevance so you actually can argue to a specific conclusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3378.483,
    "end": 3380.567,
    "text": "Now, our tree is what you saw.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3380.627,
    "end": 3382.11,
    "text": "It's actually an important point to bring up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3382.571,
    "end": 3385.356,
    "text": "It is actually a graph architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3385.696,
    "end": 3386.538,
    "text": "They're not trees.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3386.898,
    "end": 3392.128,
    "text": "They actually do have all these interrelationships where claims pop up at different layers in the map across different areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3392.108,
    "end": 3417.188,
    "text": " perspectives and things like that and that's just like linked data all across and we have different ways of detaching how linked they are so like if there's a slight difference in context of a claim popping up in one area and another we can copy it but like it doesn't update in the exact same way even though like the language and like we partitioned off like reasoning we've like broken the link of updating them because one is only relevant to update in one section",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3417.168,
    "end": 3423.175,
    "text": " Um, yeah, so there's a lot of like trickiness with like the modeling itself and like the updating of this stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3423.755,
    "end": 3440.914,
    "text": "Um, but it is kind of, uh, graph-like and cyclical, but the idea of trying to find what question is going to enable us to argue to conclusion is so we can just do that and not just like constantly be going around and around and around and around, but like you're breaking things down and you're formalizing it and you're",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3440.894,
    "end": 3444.08,
    "text": " Kind of asking that like Socratic question of like, well, how do we know this is true?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3444.12,
    "end": 3444.801,
    "text": "How do we know this is true?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3444.821,
    "end": 3445.682,
    "text": "How do we know this is true?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3446.003,
    "end": 3455.399,
    "text": "Which tends not to yield in the same cyclical patterns that you may see in like other systems where the ontology is either really overly restrictive or just like totally vague and open.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3457.523,
    "end": 3457.603,
    "text": "Hmm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3457.887,
    "end": 3478.09,
    "text": " and always a trade-off like whether working by oneself or in collaborative or crowdsource settings tag systems are very general however sometimes they're just a few letters and so that means that all the context is being brought to the table by the tag viewer which ends up kind of defeating the purpose because it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3478.07,
    "end": 3503.942,
    "text": " some ways doesn't resolve that semantic ambiguity of what the tag was about other than just giving the kind of tautological it was used how it was used whereas with more structured ontological systems they are sometimes harder to use or they have a more restricted range however you can do more powerful inference with them when the information's in that format yeah can i actually show you share my screen one more time i just want to show like this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3504.53,
    "end": 3504.791,
    "text": " Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3504.971,
    "end": 3506.575,
    "text": "Any demos would be definitely cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3506.875,
    "end": 3510.123,
    "text": "And then if anyone has other questions in live chat, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3510.704,
    "end": 3513.631,
    "text": "And then we'll look at a demo and look at any last questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3514.493,
    "end": 3514.694,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3514.714,
    "end": 3515.736,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3515.756,
    "end": 3516.859,
    "text": "Can you see this screen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3519.845,
    "end": 3520.206,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3520.226,
    "end": 3520.467,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3520.687,
    "end": 3521.83,
    "text": "I'll crop it and everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3522.164,
    "end": 3522.805,
    "text": " Okay, cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3523.466,
    "end": 3524.968,
    "text": "So this is our papers interface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3525.289,
    "end": 3533.521,
    "text": "Like you mentioned like tags and how like, if it's like a crowdsourcing system, like sometimes you can't like really like extricate out the meaning of where something was tagged in a certain way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3533.981,
    "end": 3541.813,
    "text": "So this is the same Diablo Canyon data, except we've rendered it in an interactive piece of paper where you can like unpack like the definitions and things like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3542.213,
    "end": 3545.057,
    "text": "But also like, you know, here's the high level nine positions that people take.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3545.137,
    "end": 3546.94,
    "text": "And if you click on a word like economic,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3546.92,
    "end": 3563.258,
    "text": " you can see a believe it or not we rewrote this by hand this is a more natural language like kind of article version of all of the nodes in the graph under the economics section that support this position so when we add tags you can actually click on them and then it has a specific definition",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3563.238,
    "end": 3568.848,
    "text": " And it's like sometimes we provide more information within like a little Wikipedia page for each and every claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3568.868,
    "end": 3573.757,
    "text": "And then you can like unpack, you know, more information argumentation about that claim space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3574.058,
    "end": 3582.293,
    "text": "So like the benefit of like curation is that we can be as like comprehensive and explaining and justifying why we're like labeling and linking things in certain ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3582.273,
    "end": 3596.937,
    "text": " Which again, if people are participating in a crowdsourced way, it's work, so people may not be providing all the information that's needed in order to be able to interpret what was the original intention behind linking and labeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3599.742,
    "end": 3607.875,
    "text": "And this makes me wonder if we could do it for the active inference literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3607.923,
    "end": 3612.534,
    "text": " Because people will say things like Markov blankets explain consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3613.577,
    "end": 3614.118,
    "text": "Or they don't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3614.699,
    "end": 3616.945,
    "text": "Or active inference proves free will to be correct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3617.105,
    "end": 3618.809,
    "text": "Or it proves that it's not correct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3618.95,
    "end": 3619.972,
    "text": "Or it proves we can't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3620.012,
    "end": 3622.759,
    "text": "And some of these high-level...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3622.942,
    "end": 3652.358,
    "text": " decisions go into incredible places and people have incredible journeys sharing and working through some of these and like all of the kind of re-stabilizations in the meta learning journey and it's like not just does this method touch upon the scientific discourse as a source of stabilizing more natural discussion like are eggs good or bad for you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3653.198,
    "end": 3657.248,
    "text": " which is going to rely on a lot of science, but not even any one person will ever know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3657.929,
    "end": 3669.317,
    "text": "We can also kind of turn the method back to the scientific literature because to analyze the claims made in papers, like either you have...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3669.466,
    "end": 3699.321,
    "text": " system you have or you have implicitly that emulated in your mind somehow yeah or you don't at which point it's just the affect that's retained and people will read something and just think i don't really like that or i wouldn't have really said that but of course not that's because another person said it and so that is so clear to see once it's seen yet it is enormously hindering to understanding and communicating technical topics like active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3699.638,
    "end": 3701.161,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3701.202,
    "end": 3717.057,
    "text": "I mean, imagine how many hours people have to put into like diving through the conversations that have already been treaded, um, just to like pick up that full context of like what has already been explored to like either offer something novel or to interpret for themselves where they want to assign their belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3717.037,
    "end": 3723.308,
    "text": " And so, yeah, we think it's helpful to traverse that for people and kind of create this linked library of ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3723.648,
    "end": 3725.111,
    "text": "Like it's like a marketplace of ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3725.411,
    "end": 3743.061,
    "text": "So people can browse and shop and like, you know, read the reviews, so to speak, of certain beliefs and ideas so that they can like, you know, either assign belief or just like pick up where that conversation has, you know, left off and like continue it in under, you know, some sort of investigation for themselves over what is true or what they would like to believe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3744.256,
    "end": 3763.564,
    "text": " wanted to add you know i've been thinking about this a while in this conversation that the work that we're doing is not just sort of this top down from or i don't know how you which way you refer it top or bottom but from the question but that there is you know there's both a top down and a bottom-up approach where it's like we are trying to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3763.544,
    "end": 3771.233,
    "text": " build out a library of artifacts related to the particular debate space and then generate them from the claim as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3771.273,
    "end": 3780.965,
    "text": "And some of the first work that we've been doing is just generating that from the question using these language models without taking in the actual space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3780.985,
    "end": 3782.407,
    "text": "Because, you know, we're in the Wild West.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3782.447,
    "end": 3788.714,
    "text": "I mean, like, you go back a few years, the only way to poll the community was through polls.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3789.115,
    "end": 3792.859,
    "text": "And, like, there's a lot of bias inherent in those.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3793.075,
    "end": 3797.027,
    "text": " But as we build out these models, we're also using them to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3798.003,
    "end": 3824.398,
    "text": " reach out into specific spaces so like the process that might occur for something like active inference is okay there's something baked into the model from this overarching view from like scanning the entire internet but what we also would do and we're more and more you know moving towards is pulling in a library of documents uh that are you know from experts in the field that are that is a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3824.783,
    "end": 3853.896,
    "text": " zooming in to a higher level of resolution and then, you know, either training a model specifically to specific spaces or using various techniques that, you know, I won't go into quite in this particular space about how we're approaching it, but there is an aspect of both trying to get the top level of the map to bubble out from the, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3854.315,
    "end": 3879.304,
    "text": " focused view of documents that we might pull in, as well as to get it to bubble from the top where it's like a very large view, like a combination of two lenses trying to make it merge in the center towards something that is as best as possible a representation of belief space in the moment that the artifact of the map is generated and viewed by the people, because that's what we want.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3879.364,
    "end": 3880.525,
    "text": "We want it to reflect",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3880.893,
    "end": 3884.558,
    "text": " the debate as it currently stands with the full knowledge that it is changing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3886.394,
    "end": 3915.152,
    "text": " yeah very interesting and like thinking about the epistemic foraging nestmate on the trail all the trail they cover is either new to them which is education or new totally which is research and discovery and the process has to be encouraged to maintain both of them like at all um question from love evolve curious how much of society libraries mapping is openly accessible",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3916.685,
    "end": 3921.295,
    "text": " Yeah, I mean, we have a ton of maps that are not online.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3922.879,
    "end": 3926.707,
    "text": "The Diablo Canyon map is what we would consider meaningfully complete.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3926.727,
    "end": 3933.141,
    "text": "We still have to clip a few strings off of it because we pretty much stopped when the grant ran out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3933.121,
    "end": 3934.683,
    "text": " You can just go to our website.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3934.704,
    "end": 3954.054,
    "text": "You can also go to some of our if you go to our website and go to libraries, you can see like in the AI section, for example, some of the maps that we've been releasing, which are more like topical and like related to the zeitgeist of what people are debating, which is more of just a demo that we're making progress in automation and less of like a this is a representation of the debate space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3954.876,
    "end": 3957.66,
    "text": "Our data is not currently open source yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3957.64,
    "end": 3960.384,
    "text": " Um, but like we're thinking about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3960.805,
    "end": 3967.936,
    "text": "Um, like the sincere inquiry into truth is like the responsibility of like the entire community and it should be something that is commonly held.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3968.537,
    "end": 3971.061,
    "text": "Um, but we're like an absolutely tiny organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3971.101,
    "end": 3975.428,
    "text": "We're basically like two full-time people and then like four part-time people slash volunteers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3975.488,
    "end": 3977.01,
    "text": "And we've kind of been that way for a little while.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3977.471,
    "end": 3981.778,
    "text": "So like managing open source projects, it's like, we only have so much bandwidth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3981.898,
    "end": 3983.901,
    "text": "If we were to get like large scale grants,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3983.881,
    "end": 3997.148,
    "text": " we would be happy to open source like a lot of this and like do more community stewardship in like um you know collectively building out agentic systems and models and stuff like that but just like we're our tiny team we're doing our work we'll get to open source eventually",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3999.98,
    "end": 4004.086,
    "text": " And you know, like I said, it's the wild west, things are evolving, things are improving every single day.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4004.547,
    "end": 4015.543,
    "text": "That's part of the motivation is not wanting to make too big of a claim like this is the perfect representation of the debate space, which it never will be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4016.264,
    "end": 4028.923,
    "text": "But as we're evolving, as more and more tools are coming out, as we can better and better reflect the human generated map that we did with Diablo more and more that, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4029.595,
    "end": 4033.523,
    "text": " will likely be available to people.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4033.563,
    "end": 4042.12,
    "text": "But it's a process of taking a new tools and trying to recreate the work that is done at that manual scale and make it automated for everybody.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4042.471,
    "end": 4045.934,
    "text": " Yeah, the fast iteration of the work that we're doing is definitely factored into it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4046.315,
    "end": 4051.379,
    "text": "And then we have found that when we demo our tools, people get so excited about them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4051.56,
    "end": 4059.127,
    "text": "So we were rolling out publicly available versions of our tools.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4059.167,
    "end": 4065.893,
    "text": "We never release these kinds of things because we're building out different aspects of the pipeline and automating and testing all of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4066.113,
    "end": 4068.816,
    "text": "But even just one small aspect of the pipeline,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4068.796,
    "end": 4077.166,
    "text": " Like the model that predicts what the top level positions are likely to be for a given question, which can help like direct research goals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4077.567,
    "end": 4080.831,
    "text": "People love that so much because they can ask a question about their life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4080.891,
    "end": 4083.755,
    "text": "Like people would ask things like, what are the ethics of polyamory?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4083.895,
    "end": 4086.558,
    "text": "Or like, why should I give a TED talk or something like that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4086.879,
    "end": 4093.707,
    "text": "And it'll just like make a prediction about the map of the spectrum of beliefs and then generate arguments across varying different categories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4093.687,
    "end": 4099.356,
    "text": " So that's a tool we were just going to make available for people to play with and use because every time we demo it, people get really excited.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4099.396,
    "end": 4103.222,
    "text": "And there's other tools like a little fact-checking model that we built that works pretty well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4103.322,
    "end": 4107.509,
    "text": "And it's like we've had a relationship with the International Fact-Checking Network in the past.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4107.529,
    "end": 4109.432,
    "text": "It'd be really great to get those tools in their hands.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4109.753,
    "end": 4112.357,
    "text": "So some things come out at different times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4112.477,
    "end": 4115.041,
    "text": "But yeah, it's a lot of bandwidth limitation on our end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4119.428,
    "end": 4119.508,
    "text": "Hmm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4120.957,
    "end": 4130.422,
    "text": " Well, I guess as we wait for any final questions in the chat, like where are you going to continue going towards?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4131.345,
    "end": 4131.605,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4131.686,
    "end": 4134.493,
    "text": "I mean, so basically our roadmap is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4134.659,
    "end": 4141.591,
    "text": " The short-term roadmap is that we want to have a library system where anyone can ask a question, press a button, and then they get these graphs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4141.911,
    "end": 4154.473,
    "text": "However, we will also be a library where we're discovering what are these fundamental questions and building collections for people in case people don't have the expertise to know how much a question can buy us a specific system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4154.453,
    "end": 4180.242,
    "text": " this data can then go into decision-making models like i won't talk about who we're in conversations with right now but we've worked um to support different uh members in government um at the federal level in terms of creating legislation and like city level decision making so our overall mission is just to enable more free informed decisions and that means not only changing how people make decisions but also making sure people have sufficient information and context",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4180.222,
    "end": 4182.325,
    "text": " in order to make a more free decision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4182.625,
    "end": 4191.378,
    "text": "Like, there's a lot of literature out there about how you can, like, bias and, like, coerce decision-making in order to, like, achieve a specific outcome, like the more empathetic outcome or, like, what have you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4191.658,
    "end": 4209.604,
    "text": "But we're really interested in, like, can we explore the space of enabling comprehension instead of supercharging persuasion and get people to, like, have a metacognitive process of assessing all of their options and then given an assessment of their options, which is, you know, is compressed but also impeccable, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4209.584,
    "end": 4217.197,
    "text": " have it so that people make a less biased, more inclusive kind of decision, which is products that we've already piloted in government already.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4217.557,
    "end": 4227.053,
    "text": "And so our goal is in terms of our roadmap is eventually linking all the different tools together, the education with the knowledge graph, with the decision-making models, with the policy,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4227.033,
    "end": 4231.698,
    "text": " Um, you know, if you go on our website, you'll see there's a number of different programs that are listed under our program section.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4231.719,
    "end": 4243.332,
    "text": "And so something that we're not shying away from is that even though we're just, and this kind of goes back to the graphic I showed of Congress and the library of Congress, it's like, we feel like there needs to be a library of Congress that exists for the public.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4243.773,
    "end": 4249.159,
    "text": "Like the library of Congress is a premier library and they support the intelligence and policymaking of Congress.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4249.139,
    "end": 4250.902,
    "text": " But it's also available to the public.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4250.962,
    "end": 4257.353,
    "text": "So we think Library of Congress of the Internet 21st century should exist for the public, but also for decision makers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4257.613,
    "end": 4263.122,
    "text": "And that can be think tanks, activists, legislators, other like, you know, more local decision makers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4263.523,
    "end": 4269.072,
    "text": "And so getting to the point where we are informing decision making models, but also kind of seeding the field of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4269.052,
    "end": 4290.047,
    "text": " So optimal policymaking is something that we're interested in, because once you have a sufficient mapping of the problem space and the solution space, and you understand like what is quote unquote known in terms of available argumentation and evidence, and also what is, you know, quote unquote known about value conflicts, is there a way in which we could seed kind of like a new field of inquiry where we find optimal policies?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4290.027,
    "end": 4310.054,
    "text": " So it's not just majority rule majority consensus or just evidence-based It's like what could be optimal based on people's preferences and the evidence that exists and like given that my understanding is there's been some Experimentation to suggest that large language models can be extremely creative especially when compared to humans We may be able to lean on some of like I know you're shaking your head.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4310.194,
    "end": 4314.82,
    "text": "It's all debatable we may be able to lean especially in the future as these technologies are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4314.8,
    "end": 4333.922,
    "text": " um you know perhaps get better and better and potentially more creative to find like what is like that that through line that path forward so that we can solve or address some of our most complex challenges without trampling over people's rights by like a majority rule or just eliminating people's preferences by having evidence-based only hmm",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4334.459,
    "end": 4347.574,
    "text": " Well, optimal policy comes up all the time in active inference and a really key difference with the active inference approach for policy selection versus like reward reinforcement learning is like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4348.178,
    "end": 4353.084,
    "text": " The policy selection is based upon a combination of the pragmatic and epistemic value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4353.325,
    "end": 4354.827,
    "text": "That's just one way to decompose it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4355.547,
    "end": 4359.973,
    "text": "But the pragmatic value is the preferences that are being fulfilled by future observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4360.013,
    "end": 4364.399,
    "text": "Like we want to keep the radiation levels at this level, CO2 at this level, temperature, pH.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4364.759,
    "end": 4370.727,
    "text": "So those can be homeostatic preference distributions that are loose or tight.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4370.707,
    "end": 4397.676,
    "text": " then policies that do well in satisfying that get high pragmatic value and that's like the traditional understanding of optimal utility driven policy however the other component of expected free energy is the epistemic value and so that includes the information gain that's expected about future observations and like we kind of alluded to earlier the possibility of structural change of the underlying landscape",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4397.656,
    "end": 4427.562,
    "text": " like changes in the dimensionality of the landscape due to a technology or like other like nonlinear changes or distorting changes so even the most important thing pragmatically still at least has this like foot in the door for epistemic value and also have epistemic humility and together the epistemic and the pragmatic are part of the adaptive policy selection approach and that can be used to model ant nest mate you know the person broader organizations and so on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4427.947,
    "end": 4453.971,
    "text": " yeah excellent i'm so excited to hear this has been a topic that has been widely discussed that's excellent john any kind of closing-ish thoughts you know i have my own work with um cognizant and you know i was drawn my attention was drawn to society library because you know there's there's a lot of overlap i would like to just see more and more in the future",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4455.925,
    "end": 4477.584,
    "text": " Two things that we sort of talked about in this talk was one, the sort of distribution of certainty about the world state reflected in all the various people who this information is being reflected from and the notion of time as these debates evolve and change.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4477.624,
    "end": 4483.89,
    "text": "I think that's sort of essential to really accurately represent",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4484.461,
    "end": 4507.843,
    "text": " what we're doing here is that, you know, if you take any particular language model and try to use it to suss out distributed belief, it's pulling from a large set of texts that has no representation of time, unless there happens to be in each particular text like some sort of timestamp.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4507.863,
    "end": 4513.708,
    "text": "It's all coiling it together and it's treating everything as if it happened at the same time and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4515.292,
    "end": 4528.744,
    "text": " that would be a great place to go into the future is getting a representation of certainty, getting a representation of the distribution of sources within the data, getting representation of the evolution of the debate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4529.485,
    "end": 4543.257,
    "text": "And hopefully at some point doing something like a very, very live thing where it's like, rather than having a polling process where you ask a question to a group of people,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4543.49,
    "end": 4568.907,
    "text": " um where you know they're given a couple of options it's like you have a debate space in a group of people everybody just writes whatever they think and then you take that and you dissolve and compress it into a map that is pulled from all of those sources in real time rather than trying to pull from everything something that is really really reflective of a particular and exact data set um that is like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4569.562,
    "end": 4576.348,
    "text": " pulled from a group of people who are given the freedom to say whatever they want to say in relationship to that debate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4576.835,
    "end": 4582.72,
    "text": " And I'll just say that the time factor is something that we have accommodated in our manual creation of these knowledge graphs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4583.161,
    "end": 4587.665,
    "text": "So it's expressed in the claim itself or it's embedded in the metadata of the claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4588.105,
    "end": 4593.41,
    "text": "And then we also have the evolution of things over time through timelines of nodes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4593.43,
    "end": 4597.193,
    "text": "It's a specific ontological relationship is like a sequence of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4597.613,
    "end": 4601.637,
    "text": "So we do have those kinds of things, but there's plenty that we need to automate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4601.677,
    "end": 4605.34,
    "text": "The complexity of our ontology is kind of immense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4605.32,
    "end": 4615.796,
    "text": " And so we're just like one model at a time, kind of like building out all of these things to eventually like work in concert to press a button and then like structure these things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4616.217,
    "end": 4626.973,
    "text": "And again, what we determined to be relevant based on observations of how people argue and what they care about, like trying to crystallize and formalize by like deduplicating and steel manning and that sort of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4626.953,
    "end": 4634.844,
    "text": " But recognizing that time series is incredibly relevant because some things become outdated when a new piece of information defeats its relevance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4635.204,
    "end": 4636.766,
    "text": "So yeah, we've got a lot of work to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4637.327,
    "end": 4641.273,
    "text": "And so I just want to reiterate, we're a nonprofit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4641.473,
    "end": 4643.456,
    "text": "We would love support.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4643.936,
    "end": 4648.202,
    "text": "Volunteering is costly sometimes because it takes a lot of time to bring people up to speed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4648.182,
    "end": 4651.909,
    "text": " You know, when we're an open source project, hopefully we'll have all the documentation written to be easier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4652.329,
    "end": 4658.38,
    "text": "But if you have a way in which you think you can help us and you're interested in the project or just appreciate the mission, please do reach out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4661.085,
    "end": 4662.227,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4662.247,
    "end": 4662.648,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4663.209,
    "end": 4664.351,
    "text": "Hill0072.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4666.755,
    "end": 4667.055,
    "text": "See you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4667.676,
    "end": 4667.997,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  }
]