[
  {
    "start": 1.613,
    "end": 24.374,
    "text": " Hello everyone it is June 2nd 2022 and we're in week five of textbook group cohort one we're having our second discussion on chapter two and we will uh get right to the questions first just wanted to highlight the math learning group especially for those who are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 26.468,
    "end": 28.329,
    "text": " not regularly attending the meetings yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 28.709,
    "end": 36.173,
    "text": "The meetings are on 19 UTC on Wednesdays, but just with everything, don't let the synchronous time dissuade you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 36.674,
    "end": 44.098,
    "text": "We can set up other synchronous times if people want to co-work and also the resources and the modifications are all asynchronous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 44.818,
    "end": 48.44,
    "text": "So we've been doing several things in the math learning group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 49.738,
    "end": 53.279,
    "text": " First, we've been sharing important resources and categorizing them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 53.839,
    "end": 61.461,
    "text": "So if somebody wants to look at a video on something or find a textbook on something, or if you come across something useful, just add it here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 62.261,
    "end": 71.544,
    "text": "And then if you feel like leveraging the resources that you or other people have added, then you can categorize it in the table and just add a few pieces of information on it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 72.904,
    "end": 78.066,
    "text": "We have a notation table that we'll be building, especially as we get into the continuous time active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 79.281,
    "end": 89.487,
    "text": " We have some questions, less so questions about the textbook and more so just cool math questions that people are raising as they're discussing the material.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 90.615,
    "end": 93.517,
    "text": " And then we're building a math oriented overview.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 94.258,
    "end": 98.0,
    "text": "So we've gotten up to equation 2.5 in chapter two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 98.781,
    "end": 102.103,
    "text": "And this is just sort of like point by point, like what are the formalisms doing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 102.183,
    "end": 103.684,
    "text": "Where are the figures coming into play?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 103.744,
    "end": 105.345,
    "text": "How are some things related?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 106.226,
    "end": 109.648,
    "text": "And any and all note taking can be added.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 109.668,
    "end": 113.251,
    "text": "You can always add it to like unsorted notes or errata.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 114.264,
    "end": 115.725,
    "text": " And then we can categorize it later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 115.825,
    "end": 120.749,
    "text": "But this is how we develop a shared epistemic resource that's useful for everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 121.53,
    "end": 124.732,
    "text": "And we're going to come to this in the questions, so we won't go into detail right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 125.513,
    "end": 129.496,
    "text": "But equation 2.5 is the variational free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 129.956,
    "end": 135.92,
    "text": "2.6 is about expected free energy, the G. And this is a key equation and set of equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 136.461,
    "end": 142.485,
    "text": "So yesterday with Blue, Brock, Jessica, Jakob,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 143.39,
    "end": 160.314,
    "text": " We went through and line by line, we went with examples, natural language readings, questions, interpretations, and then Jakub added some derivations, like how are those three lines in 2.5 related to each other?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 160.994,
    "end": 166.836,
    "text": "How do we go from the energy and entropy formulation to the complexity accuracy formulation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 167.496,
    "end": 171.457,
    "text": "So this is the essence of understanding the equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 172.984,
    "end": 194.925,
    "text": " an infinite learning journey for everyone so whatever level whether you want to be um catching up to what has been written here or whether you see ways to reorganize it and go beyond and add more connections every single background and level of math familiarity can contribute in this way but we'll come to the more details on 2.5 in the questions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 197.461,
    "end": 206.767,
    "text": " Any just preliminary thoughts that people would like to share, they can raise their hand or write in the chat at any time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 208.509,
    "end": 215.113,
    "text": "Is there anything that anybody wants to share before we start going through the questions, starting with the most upvoted ones that we haven't addressed?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 216.134,
    "end": 226.481,
    "text": "But we'll just pause for a few seconds, tune into the Chapter 2 regime of attention, upvote any questions that you'd like to see addressed, post anything in the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 232.83,
    "end": 233.57,
    "text": " Yes, Jose.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 235.171,
    "end": 240.332,
    "text": "Yeah, I'd like to ask if there's a recording of the math sessions which you had.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 242.152,
    "end": 250.714,
    "text": "No, we record stigmergically with the traces and the notes, and we had this conversation about whether it should be recorded or etc.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 252.215,
    "end": 257.036,
    "text": "If there's enough desire, we could do something like have some unrecorded and some recorded.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 257.376,
    "end": 261.297,
    "text": "This session is obviously recorded and rewatchable here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 262.458,
    "end": 266.439,
    "text": " And we do many live streams and there is a lot of recorded material.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 267.16,
    "end": 275.282,
    "text": "And so we want to also hold a space for people who don't want to speak on a recorded version, even though everything's recorded in universe and in each other's minds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 275.963,
    "end": 281.985,
    "text": "But yes, if there's enough interest in people who want to record sessions, we absolutely will do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 283.865,
    "end": 291.088,
    "text": "We also just wanted to make sure that there was a total open math learning space where people wouldn't even have that cross their horizon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 292.796,
    "end": 294.017,
    "text": " But we did discuss that yesterday.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 297.42,
    "end": 297.781,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 298.842,
    "end": 300.063,
    "text": "Any other comments?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 303.025,
    "end": 306.889,
    "text": "People can just raise their hand with six and gather or write in the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 306.989,
    "end": 311.493,
    "text": "So we're going to just go to the questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 312.654,
    "end": 315.417,
    "text": "And there's still time to upvote during the discussions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 316.097,
    "end": 316.578,
    "text": "And we're just going to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 318.214,
    "end": 321.315,
    "text": " I upload the ones once we've discussed them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 321.875,
    "end": 326.277,
    "text": "So we'll start with the first question that we haven't discussed yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 330.018,
    "end": 332.159,
    "text": "Okay, this is from page 32.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 333.919,
    "end": 340.841,
    "text": "Policy-dependent outcomes are not immediately available, but they can be predicted by chaining together two components of the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 341.482,
    "end": 345.483,
    "text": "The first is our beliefs about how hidden states change through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 350.609,
    "end": 355.213,
    "text": " Just want to find what the second part was.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 360.838,
    "end": 363.0,
    "text": "The second component is the likelihood distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 370.466,
    "end": 373.649,
    "text": "What really changes as a result of policy selection?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 374.81,
    "end": 376.552,
    "text": "The hidden states or the outcomes?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 378.08,
    "end": 384.564,
    "text": " Bringing a jacket doesn't necessarily change the temperature, hidden state, but instead changes my observation perception of whether it's cold or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 385.605,
    "end": 389.147,
    "text": "Can we actually change hidden states with policy selection and what would be an example of this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 392.209,
    "end": 396.712,
    "text": "Does anyone want to raise their hand and give a thought on this question?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 397.372,
    "end": 400.054,
    "text": "What really changes as a result of policy selection?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 400.354,
    "end": 401.455,
    "text": "The hidden states or the outcomes?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 405.694,
    "end": 408.935,
    "text": " While people are raising their hand, I'll give one possible thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 410.235,
    "end": 412.196,
    "text": "The answer is both slash it depends.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 412.596,
    "end": 415.356,
    "text": "So bringing a jacket does change the temperature around you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 415.877,
    "end": 418.217,
    "text": "It's not just changing your perception of temperature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 418.777,
    "end": 429.28,
    "text": "So one example of changing a hidden state of temperature with policy selection would be like changing the setting on the thermostat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 430.182,
    "end": 438.287,
    "text": " that is intervening into the causal process, the generative process that's giving rise to temperature, which is giving rise to your perceptions of temperature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 439.488,
    "end": 447.774,
    "text": "And so assuming that your temperature perception is accurate, you are able to change both the temperature in the room or the temperature around you with the jacket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 448.614,
    "end": 456.039,
    "text": "And thus, because temperatures are giving rise to observations of temperature, also, you end up changing both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 456.52,
    "end": 456.7,
    "text": "Blue?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 460.766,
    "end": 489.27,
    "text": " so this was my question and i think um carl kind of possibly started to answer it on the live stream yesterday i need to like think about it more and unpack it a little bit more but like we don't actually change we change like the temperature around ourselves but like we're not going to change the thermometer reading by bringing a jacket right so there's like the yes but anyway what carl said and what might be beneficial for others to hear is that um when when you think about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 490.743,
    "end": 496.928,
    "text": " What's changing, it's like really, when you think about a hidden state, there's a causal chain underlying that hidden state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 497.008,
    "end": 502.932,
    "text": "And the same thing, like when you think about an observation, there's a causal chain underlying that observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 503.553,
    "end": 509.117,
    "text": "So like, no, I'm not going to change what my eyes tell me the temperature is, but I'm going to change what my body tells me the temperature is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 509.157,
    "end": 514.902,
    "text": "And so it depends because it's a multisensory observation, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 514.942,
    "end": 516.503,
    "text": "So which sense is going to change?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 516.583,
    "end": 520.286,
    "text": "Not my visual reading on the thermometer, but my physical perception of cold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 521.89,
    "end": 526.814,
    "text": " Also yesterday on the live stream, Thomas Parr and Carl Friston joined.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 526.834,
    "end": 530.396,
    "text": "So that was really awesome and a great one to watch, 45.1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 530.916,
    "end": 532.658,
    "text": "And we can continue on this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 533.198,
    "end": 534.359,
    "text": "Ali and then Mike.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 538.428,
    "end": 555.537,
    "text": " Yeah, I think that's what meant by the word hidden in the statement, because if it was transparency observation to any kind of perception or observation, I don't think it would be called a hidden state.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 556.617,
    "end": 564.922,
    "text": "I believe that the reason it's called as such is because it's opaque to any kind of perception or observation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 565.902,
    "end": 589.297,
    "text": " so it's kind of inherent to the universe and uh probably uh not amenable to any uh any change or action thanks mike yeah i'm not sure if i'm thinking about it the right way but i",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 590.357,
    "end": 597.561,
    "text": " Intuitively, I was thinking that policy selection would update the expected conditions or the expected state.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 598.161,
    "end": 602.283,
    "text": "So maybe adjusting the priors in a Bayesian sense.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 603.944,
    "end": 604.224,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 604.964,
    "end": 606.465,
    "text": "So we'll come to this later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 606.745,
    "end": 614.009,
    "text": "But the answer, based upon the partially observable Markov decision process, discrete and continuous time versions,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 615.233,
    "end": 620.197,
    "text": " policies, pi, intervene in between hidden states and how they change through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 621.398,
    "end": 625.342,
    "text": "Different hidden states, should they be giving rise to different observations,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 626.564,
    "end": 628.145,
    "text": " will result in different observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 628.866,
    "end": 636.351,
    "text": "So changing the thermometer policy selection is intervening in the causal process of temperature changing through time in the room, hidden state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 637.131,
    "end": 645.197,
    "text": "And if the temperature in the room is associated through the A matrix with your observations of temperature, then you will be changing your observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 645.297,
    "end": 654.003,
    "text": "And then just like Mike said, that is reflected based upon the expectations that the individual has about the observations of temperature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 654.623,
    "end": 654.744,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 655.734,
    "end": 659.599,
    "text": " They're both changing because the hidden states and the observations are linked.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 660.66,
    "end": 668.75,
    "text": "That's what it means to have a generative model or for there to be a partially observable model with hidden states and observables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 669.935,
    "end": 695.397,
    "text": " hierarchical models a given state could be in emission from a higher state and emitting a lower state and that's kind of like how the current moment is like a consequence of the past but it's a cause of the future so this is related to Bayesian modeling but using this architecture we can say that policy intervenes only in between hidden states we don't directly intervene in how observations appear",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 700.618,
    "end": 703.459,
    "text": " Any other thoughts or questions on this question?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 712.241,
    "end": 712.501,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 719.823,
    "end": 720.063,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 723.984,
    "end": 724.764,
    "text": "In Figure 2.2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 724.984,
    "end": 725.144,
    "text": "Figure 2.2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 735.353,
    "end": 746.821,
    "text": " They write, x star and x, so that's going to be generative process and generative model latent variables, hidden states, do not necessarily live in the same space of measurement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 747.662,
    "end": 754.827,
    "text": "It might be the case that hidden states in the external world take on values that lie outside the space of explanations available to the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 755.868,
    "end": 760.792,
    "text": "Conversely, it might be that the brain's explanations include variables that do not exist in the outside world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 762.261,
    "end": 768.383,
    "text": " For example, the former could be five-dimensional and the latter two-dimensional, or one could be continuous and the other could be categorical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 769.403,
    "end": 785.769,
    "text": "So what are examples people can think of where the dimensionality of the generative model, the cognitive entity, is the same as the generative process, the niche process giving rise to observations passing them to the generative model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 788.09,
    "end": 788.75,
    "text": "That's one question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 791.024,
    "end": 802.433,
    "text": " Second question, how does this approach or framing speak to the map territory debate, hashtag instrumentalism and realism?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 804.215,
    "end": 817.606,
    "text": "What papers or live streams best characterize how active inference models the action cognition perception loop and what other possibilities or models are there for the action cognition perception loop?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 818.663,
    "end": 845.725,
    "text": " would be the different strengths and limitations of these different framings and partitionings thanks um joe and then blue and then anyone else who raises their hand so i was just thinking i mean a nice case where you could say dimensionality is pretty obvious is uh board games because i was trying to anticipate what my opponent is going to play in a board game uh you know they have a limited number of possible moves and i'm",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 847.222,
    "end": 851.184,
    "text": " assuming I'm playing the same game, I'm expecting them to make some moves on the same board.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 851.204,
    "end": 857.527,
    "text": "So to me, that sounds like the dimensionality is the same because you're in this limited world.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 857.547,
    "end": 858.668,
    "text": "I don't have to know what they're thinking.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 858.708,
    "end": 860.248,
    "text": "I don't have to know what they had for breakfast.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 860.829,
    "end": 862.65,
    "text": "I don't have to know a lot of stuff.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 862.71,
    "end": 865.651,
    "text": "I'm just thinking, and I might be wrong, what moves they might make.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 868.953,
    "end": 869.193,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 869.433,
    "end": 870.013,
    "text": "Thanks for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 874.028,
    "end": 883.674,
    "text": " So with the same dimensionality, it's like if we're playing the same game, then we're playing a game where we're tracking a little cursor on the screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 884.835,
    "end": 889.819,
    "text": "The movement space within that is just the X and the Y value or just two dimensions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 890.439,
    "end": 890.699,
    "text": "And so...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 894.551,
    "end": 897.953,
    "text": " The observation is like the location in two dimensions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 898.593,
    "end": 904.096,
    "text": "And then that is the same dimensionality that inference is occurring on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 905.416,
    "end": 920.083,
    "text": "But as I'm thinking, just to add a little bit more to my comment, if I wanted to enrich it and say, oh, but I'm starting to think strategically and anticipating their next move or anticipating maybe they're bluffing or maybe I'm bluffing and I want to see if they know that I'm bluffing, we add more dimensionality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 920.143,
    "end": 923.845,
    "text": "And I guess in principle, again, you could still add that dimensionality",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 925.242,
    "end": 936.332,
    "text": " in, in, in somehow in parody with parts of the hidden states, you know, you said, I mean that I'm thinking, Oh, they think they know I'm bluffing or, um, I think they're bluffing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 936.632,
    "end": 938.454,
    "text": "You're talking again about the same thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 938.894,
    "end": 940.335,
    "text": "You don't have to know what they had for breakfast.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 940.355,
    "end": 945.36,
    "text": "You're just talking about this extra information, which isn't in the board itself, but that gets a bit more complicated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 946.761,
    "end": 947.021,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 948.362,
    "end": 948.623,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 950.464,
    "end": 951.265,
    "text": "So, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 955.868,
    "end": 956.769,
    "text": " That is a good answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 957.009,
    "end": 965.434,
    "text": "Other ones that people have written, thermostat is having the same dimensionality, like it's a temperature value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 965.854,
    "end": 966.955,
    "text": "It's a dimensionality of one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 967.755,
    "end": 974.739,
    "text": "And so then the person's generative model is also on this one dimensional temperature axis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 975.62,
    "end": 980.963,
    "text": "And then they mentioned that it could be like categorical versus continuous, so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 982.059,
    "end": 986.921,
    "text": " without going too many rabbit holes deep, we could just say temperature in the room is a continuous variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 987.381,
    "end": 993.203,
    "text": "It's like taking on a number, it could be a decimal point number between any number, zero to infinity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 995.024,
    "end": 996.245,
    "text": "The person's model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 997.17,
    "end": 1003.836,
    "text": " might be the same dimensionality, like one, but then they might be trying to make a categorical estimate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1004.256,
    "end": 1006.118,
    "text": "Is this livable or unlivable?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1006.618,
    "end": 1008.78,
    "text": "Is it hot, neutral, or cold?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1008.92,
    "end": 1010.862,
    "text": "That'd be like a three-state categorical model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1011.522,
    "end": 1022.812,
    "text": "So the generative process doesn't have to have the same dimensionality or continuous versus discreteness of the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1027.668,
    "end": 1029.309,
    "text": " Second answer for same dimensionality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1029.769,
    "end": 1032.53,
    "text": "Controls for a car have two degrees, physical degrees of freedom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1033.57,
    "end": 1040.992,
    "text": "The acceleration, the speed, whether you can hit the gas or the brake, and the direction of the front wheels controlled by the steering wheel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1042.973,
    "end": 1047.615,
    "text": "So there's like a speed dimension, and then there's a turning angle dimension.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1048.755,
    "end": 1051.496,
    "text": "This is the model that people use when controlling a car.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1052.515,
    "end": 1054.196,
    "text": " at some level of abstraction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1054.896,
    "end": 1064.401,
    "text": "And then the acceleration dimension can be acted upon through policy selections, like stepping on the gas and the brakes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1064.501,
    "end": 1067.522,
    "text": "And then it's like, well, those are two categorically different affordances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1067.562,
    "end": 1072.204,
    "text": "And then there's continuous variables inside of that categorical difference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1072.725,
    "end": 1079.908,
    "text": "And we'll talk about like hybrid control models with both categorical and continuous aspects in play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1081.812,
    "end": 1085.973,
    "text": " And in this case, like the speed of the car in the speed axis is the hidden state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1086.673,
    "end": 1089.034,
    "text": "The observable would be the speedometer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1090.995,
    "end": 1098.337,
    "text": "So again, the gas and the brake are policy selections that modify, let's say we're thinking about a train, no turning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1099.217,
    "end": 1104.919,
    "text": "Policy selection is influencing how speed changes through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1106.229,
    "end": 1112.695,
    "text": " And if you have a speedometer that's accurate, even if it's noisy, it's giving rise to observations reflecting those changes in speed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1113.716,
    "end": 1117.759,
    "text": "But gas and brake do not change the speedometer directly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1117.999,
    "end": 1120.241,
    "text": "They're changing a hidden cause, which is the speed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1122.203,
    "end": 1123.544,
    "text": "Different dimensionality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1124.866,
    "end": 1125.886,
    "text": "Rain comes from clouds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1126.307,
    "end": 1129.79,
    "text": "Simple mental model is that the darker the clouds, the more there will be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1131.111,
    "end": 1133.113,
    "text": "That's a two-dimensional generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1135.771,
    "end": 1140.774,
    "text": " So how much rain, how dark the clouds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1141.895,
    "end": 1144.496,
    "text": "And this also is going to speak to this map territory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1145.977,
    "end": 1149.479,
    "text": "Someone could say, well, there's the size of the cloud and there's also the humidity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1149.7,
    "end": 1153.722,
    "text": "So that's like maps with increasing amounts of variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1155.263,
    "end": 1159.025,
    "text": "So no one's denying the territory of the actual chaos of the cloud.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1159.706,
    "end": 1164.349,
    "text": "It's just a question of how much detail and what data we're actually treating as observables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1165.422,
    "end": 1176.066,
    "text": " and what sophistication is being taken with unobserved variables, with hidden states, which are modeled in the computer or on paper, but they're not directly observed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1177.406,
    "end": 1182.928,
    "text": "Then the mental model can be decomposed even more, and then ad infinitum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1183.729,
    "end": 1192.072,
    "text": "On the reality side, the actual generative process for weather is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1193.737,
    "end": 1220.775,
    "text": " including all the butterflies so that's a cognitive model that is two-dimensional in this case how much rain is expected and how dark is the cloud that one could make increasingly nuanced cognitive models but whatever cognitive model is being proposed the generative process is something that's like totally different cognitive model generative model map",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1221.906,
    "end": 1224.347,
    "text": " Generative process, niche, territory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1226.469,
    "end": 1228.55,
    "text": "Plants do better when they have water and fertilizer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1229.411,
    "end": 1234.394,
    "text": "Generative mental model, leaf droopiness is a sign of moisture, but leaf size and color are signs for nutrients.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1236.015,
    "end": 1240.898,
    "text": "So one could imagine like a causal graph where there's like moisture level is unobserved,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1241.687,
    "end": 1244.729,
    "text": " but it is emitting leaf droopiness as a state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1245.39,
    "end": 1248.412,
    "text": "We're observing leaf droopiness and we're using that to infer moisture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1249.172,
    "end": 1253.915,
    "text": "Whereas nutrient is an unobserved state to the visual gardener.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1254.816,
    "end": 1257.237,
    "text": "And then they're using two dimensions, leaf size and color.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1257.498,
    "end": 1259.479,
    "text": "So this is a three-dimensional cognitive model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1259.839,
    "end": 1262.941,
    "text": "Leaf droopiness, leaf size and color are observables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1263.722,
    "end": 1269.866,
    "text": "And then there's two unobserved cognitive states, nutrients and moisture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1272.437,
    "end": 1296.829,
    "text": " whatever map gets constructed that's not the plant now the gardener might then want to take an informative experiment being an optimal bayesian gardener and then measure something take something that was an unobserved in the initial model and then measure using lidar or like using some sort of sensor to understand and then that would make that data point",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1297.577,
    "end": 1305.987,
    "text": " an outcome related through some A matrix, which we're going to get to later, of the hidden state being like the true levels of copper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1306.627,
    "end": 1313.375,
    "text": "And then if we have an accurate test, we can start using the outcomes of the observed levels of copper and start flushing out our model that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1313.676,
    "end": 1313.836,
    "text": "Joe?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1317.639,
    "end": 1319.821,
    "text": " I chucked in a comment below.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1319.841,
    "end": 1320.962,
    "text": "I hope it's showing up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1321.743,
    "end": 1327.528,
    "text": "The other part of the question was asking about the map territory debate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1327.868,
    "end": 1334.053,
    "text": "And here's from the person who kind of came up with that dichotomy in the way we usually talk about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1334.093,
    "end": 1336.816,
    "text": "He says that the map and territory should have a similar structure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1336.836,
    "end": 1338.537,
    "text": "And I think that's really interesting to think about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1339.098,
    "end": 1342.741,
    "text": "If I'm making, again, moves in a board game, I might",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1343.955,
    "end": 1347.097,
    "text": " make a reduction of their mental state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1347.117,
    "end": 1351.3,
    "text": "Maybe I'm playing against a computer, for example, so I don't know that they have a mental state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1351.4,
    "end": 1359.565,
    "text": "Or maybe I'm playing against a person I happen to know as a beginner, so I know they're likely to make naive mistakes or whatever, something like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1360.005,
    "end": 1369.211,
    "text": "But I was just thinking with regard to the leaf droopiness thing, you could have all kinds of really badly structured models of plant health",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1371.661,
    "end": 1374.522,
    "text": " Maybe it relates to how recently you watered it or something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1374.542,
    "end": 1380.484,
    "text": "Well, that sounds good in general, but if it's a cactus, maybe that's a defeater to your system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1382.145,
    "end": 1392.649,
    "text": "The point being, it seemed interesting that your map should, maybe if it doesn't have exactly the same dimensionality, should still be a nice reduction of the thing you're trying to model, whatever that means.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1393.97,
    "end": 1394.23,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1396.671,
    "end": 1398.532,
    "text": "One aspect on this is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1399.54,
    "end": 1408.845,
    "text": " evolution, natural selection, dissipation in our world, sweeping off the table entities that are failing to at least be adequate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1409.966,
    "end": 1419.511,
    "text": "So in a dissipative situation that we're in, the map has to be at least good enough, otherwise the entity will fail to exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1420.011,
    "end": 1428.736,
    "text": "So that sort of closes the loop and is like we're seeing the persistent entities that are acting good enough to navigate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1429.64,
    "end": 1450.645,
    "text": " um and it's just interesting like how many the allegory of the cave to the the blind people and the elephant and realism instrumentalism and we've had many live streams uh on this especially check out number 14 on mel andrews paper the math is not the territory",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1451.405,
    "end": 1458.991,
    "text": " So this one sort of explicitly jumps in right there and tackles this issue with the FEP front and center.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1459.391,
    "end": 1461.633,
    "text": "So this is a great series of live streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1462.573,
    "end": 1471.18,
    "text": "The dot zeros are background and context where we just go over the paper in a small group, like one person or two or three people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1471.9,
    "end": 1479.442,
    "text": " And then the .1 and the .2, we usually have more of an open participatory discussion and the authors sometimes to usually join.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1479.723,
    "end": 1485.464,
    "text": "So everybody's welcome to participate in contributing to .0s as well as enjoying the .1 and the .2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1486.265,
    "end": 1496.228,
    "text": "But just so you know, when you're looking in the livestream table, the .0 is a good one to watch first because it has like the background and overview on the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1496.408,
    "end": 1497.448,
    "text": "But then like yesterday in 45.1,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1500.39,
    "end": 1506.211,
    "text": " we had Fristen and Parr join to discuss just so that people can navigate the live streams a little better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1507.412,
    "end": 1518.675,
    "text": "So we can continue asynchronously adding more thoughts on map territory and what papers and live streams and what are the possibilities for the action perception loop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1518.715,
    "end": 1523.176,
    "text": "But these are big, fun areas, but we're going to continue with the questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1526.937,
    "end": 1528.537,
    "text": "On the notion of surprise,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1530.14,
    "end": 1538.048,
    "text": " Is the agent's perception not only affected by the influence of not only its environment, but also an agent's peers?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1539.029,
    "end": 1546.336,
    "text": "So perhaps to restate, how is an agent's perception affected by its direct perception and its assessment of peers?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1547.477,
    "end": 1550.96,
    "text": "So the agent's peers are updating their beliefs in a collaborative fashion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1553.162,
    "end": 1554.283,
    "text": "What would be the extent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1555.407,
    "end": 1561.591,
    "text": " of the update to an agent's generative model of perception if the agent witnesses the annihilation of one of its peers, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1562.512,
    "end": 1563.092,
    "text": "Something like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1565.774,
    "end": 1565.995,
    "text": "Okay."
  },
  {
    "start": 1566.595,
    "end": 1567.576,
    "text": "Wildebeest from Bird Box.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1567.656,
    "end": 1578.443,
    "text": "Not going to open any video links, but perhaps we'll observe some annihilation, like some animal attacks one of the wild beasts on the right, but then the other one learns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1579.204,
    "end": 1580.885,
    "text": "So this is a great video.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1581.165,
    "end": 1582.526,
    "text": "Definitely good to watch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1585.248,
    "end": 1597.672,
    "text": " So far in the textbook, and indeed for the textbook, it's focusing on, just like we saw in Figure 2-2, it's like one entity in the niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1599.132,
    "end": 1602.093,
    "text": "The niche can consist of others like me,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1603.075,
    "end": 1624.864,
    "text": " other entities that i expect are similar to myself in terms of like the coarse-grained cognitive architecture they have or their preferences their affordances they're able to do similar things they want similar things they have similar history to some extent so um that is sometimes called thinking through other minds ttom",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1625.925,
    "end": 1638.196,
    "text": " And just to give one thought, and then anyone can raise their hand, if we were to accurately observe an agent, another peer, taking some action and then failing to exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1638.577,
    "end": 1645.403,
    "text": "We're driving on the highway, and then we observe somebody taking a policy to go off the highway, and then we see them fail to exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1646.584,
    "end": 1651.108,
    "text": "We could use that information to update our agency",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1652.366,
    "end": 1676.703,
    "text": " beliefs about the consequences of the action to drive off the highway so I believe it would be possible to implement every variation of direct perception direct perception of peers thinking through other minds Theory of Minds learning by example imitation contrarianism",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1677.87,
    "end": 1680.031,
    "text": " Every phenomena could be modeled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1680.051,
    "end": 1686.716,
    "text": "It just has to be whatever the specific model is actually about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1686.896,
    "end": 1687.056,
    "text": "Ali?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1692.346,
    "end": 1695.207,
    "text": " I have a related question about 2.5 and 2.6.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1697.627,
    "end": 1713.091,
    "text": "Well, correct me if I'm wrong, but I understand that these equations describe the behavior of a kind of rational behavior, the behavior of a rational agent.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1714.111,
    "end": 1717.192,
    "text": "Where does irrationality come into this?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1718.852,
    "end": 1720.913,
    "text": "Or, let me put it this way,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1722.236,
    "end": 1731.26,
    "text": " Can irrationality be a parameter in order to qualify these two equations, 2.5 and 2.6?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1731.52,
    "end": 1746.186,
    "text": "Or, seen from the other side, can we use these two equations to measure the extent of rationality, as a measurement of rationality?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1748.046,
    "end": 1748.947,
    "text": "Good question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1749.898,
    "end": 1778.213,
    "text": " here's one quote and we'll come to equation 2.5 and 6 as well because those are important distinguishing the generative model and the generative process is really important that's the difference between the entity and the niche it's important to distinguish them to contextualize psychological claims about the optimality of inference to the extent these claims are valid on a bayesian view is always contingent on the organism's resource so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1779.844,
    "end": 1790.728,
    "text": " I don't want to step out too far, but rationality and irrationality, it's rational to believe in X, it is irrational to believe in X, is always subjective from that speaker's perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1792.309,
    "end": 1794.47,
    "text": "Given the priors and the update rules,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1795.453,
    "end": 1799.514,
    "text": " all there is is rationality, which is to say this is just the Bayesian updating process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1800.014,
    "end": 1808.716,
    "text": "So there are maladaptive priors, ones that trend towards dissolution of the entity, but there aren't irrational priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1808.736,
    "end": 1810.616,
    "text": "There's just is what it is and how it updates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1811.256,
    "end": 1813.917,
    "text": "And then that could be inadequate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1815.617,
    "end": 1817.558,
    "text": "It could be any number of other things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1817.598,
    "end": 1823.319,
    "text": "And these are like getting into relatively complex cognitive phenomena where there could be like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1824.301,
    "end": 1825.782,
    "text": " multiple layered models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1827.104,
    "end": 1837.593,
    "text": "But I would say rationality in the Bayes process is like the cognition is Bayes optimal or modeled with a Bayesian process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1839.055,
    "end": 1848.964,
    "text": "And then sometimes the interaction of the generative model and the generative process as appropriately defined specifically is going to result in what it results in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1852.82,
    "end": 1855.001,
    "text": " But we will come to 2.5 and 2.6.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1856.002,
    "end": 1876.693,
    "text": "Okay, here, suffice to say, yes, social learning and collective behavior and emergent outcomes at the group level is something that's important, but we haven't addressed it so far in the textbook, and multi-agent models are not really addressed in the textbook that much because there's so much to understand about the kernel of the perception-cognition-action loop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1877.807,
    "end": 1883.129,
    "text": " that even though it's so important for real systems, it's not brought up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1894.175,
    "end": 1894.375,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1895.435,
    "end": 1898.056,
    "text": "Wanting to go to the equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1900.458,
    "end": 1902.519,
    "text": "Ah, the darkroom problem for many years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1903.619,
    "end": 1905.38,
    "text": "Many papes firing back and forth",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1909.366,
    "end": 1914.929,
    "text": " But let's go to the equations for our... Let me check the chat here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1915.189,
    "end": 1915.369,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1917.39,
    "end": 1917.55,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1920.611,
    "end": 1925.233,
    "text": "Variational free energy is minimized through two different possible approaches.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1926.134,
    "end": 1933.537,
    "text": "Minimizing divergence of Q and P, changing mind, and maximizing evidence, taking action, changing perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1934.157,
    "end": 1937.619,
    "text": "This is done based upon prior and present information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1942.341,
    "end": 1945.002,
    "text": " Equation 2.5, variational free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1946.423,
    "end": 1957.587,
    "text": "To plan best actions, generative models and internal policies produce simulated outcomes that can be used to estimate expected free energy as the average of the log probability of outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1959.167,
    "end": 1967.01,
    "text": "Equation 2.6, expected free energy, and there's other variants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1968.691,
    "end": 1971.092,
    "text": "In the context of planning, planning as inference,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1972.17,
    "end": 1979.432,
    "text": " Equation 2.6 provides a view of EFE that establishes consistency in measurement units of exploration-exploitation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1980.972,
    "end": 1986.393,
    "text": "The relative balance between these terms determines whether behavior is predominantly explorative or exploitative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1992.295,
    "end": 1997.016,
    "text": "In other words, dissolving the classic explore-exploit dilemma in behavioral psychology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1999.011,
    "end": 2020.208,
    "text": " what causes this balance to change i.e what controls this balance very important and interesting question perhaps we can come to equation 2.5 first and then we can come to equation 2.6 so um where we're going is the future",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2021.306,
    "end": 2046.884,
    "text": " future has several sources of in principle and in practice uncertainty observations in the future have not happened actions in the future have not happened and the causes of future outcomes and hidden states actions as well as the generative processes endogenous changes haven't occurred so there's several like fundamental and in practice",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2047.765,
    "end": 2075.657,
    "text": " limitations of the kind of precision that you can get on the future that's planning as inference it's prospective in contrast very and that's expected free energy because it's about the free energy of an expected future variational free energy f and expected free energy is g variational free energy f is in equation 2.5",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2077.179,
    "end": 2082.927,
    "text": " Variational free energy, as the question says, is based upon present and prior information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2083.669,
    "end": 2089.077,
    "text": "So variational free energy is like now casting and now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2090.896,
    "end": 2118.204,
    "text": " verging into something kind of like memory as inference we're integrating the past in the sense of our priors and the present incoming data point y and it's like a snapshot evaluation of optimal perception in the purely sensory case and if we include action within variational free energy it's taking one step optimal actions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2119.77,
    "end": 2122.552,
    "text": " But those are not necessarily like the ones that's not planning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2123.012,
    "end": 2124.993,
    "text": "That's just like snapshot decision-making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2125.893,
    "end": 2132.497,
    "text": "In contrast, 2.6 will explicitly consider policies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2132.577,
    "end": 2134.798,
    "text": "It is a function of policy, pi.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2135.879,
    "end": 2138.6,
    "text": "And so it is including planning as inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2139.121,
    "end": 2140.141,
    "text": "But first let's look at 2.5.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2148.792,
    "end": 2178.221,
    "text": " Jakob or anyone else would you like to just describe one pass what is equation 2.5 showing um i guess if you mean uh like describing say the first line of or the lines in a bit more detail",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2179.178,
    "end": 2193.209,
    "text": " Essentially, it's the energy term is just the expectation of the log of the joint probability of the data and the observation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2193.249,
    "end": 2207.24,
    "text": "So I think I don't understand quite why they changed the notation from appendix B, but Y would essentially be the S, I think, and X would be the O.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2212.338,
    "end": 2219.641,
    "text": " Yes, anyone could be taking more notes on this, but Y is the observable data and X is the hidden state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2220.442,
    "end": 2228.565,
    "text": "In the POMDP that we're going to be getting to later, X out there, the hidden state is S and O are observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2228.965,
    "end": 2241.131,
    "text": "So this is using more of a regression, familiar framework and variable notation, but this could also be written LNP of O comma S.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2242.151,
    "end": 2244.592,
    "text": " Observations and states, that's the joint distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2245.132,
    "end": 2248.814,
    "text": "Joint distribution with a comma, conditional distributions with a vertical pipe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2256.117,
    "end": 2261.46,
    "text": "The entropy term is only based on the beliefs of our hidden states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2264.541,
    "end": 2267.602,
    "text": "People were saying before that the hidden states are unobservable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2268.423,
    "end": 2270.904,
    "text": "The only thing that we can say about the hidden states are the beliefs",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2271.96,
    "end": 2274.022,
    "text": " Q about the Hidden States.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2275.303,
    "end": 2281.189,
    "text": "I don't think that the Hidden States X can ever really appear on their own.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2282.49,
    "end": 2286.014,
    "text": "Because we always need to have some kind of belief about them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2286.034,
    "end": 2286.094,
    "text": "And",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2288.021,
    "end": 2290.843,
    "text": " This was also related to a discussion we were having yesterday.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2290.863,
    "end": 2316.256,
    "text": "It's interesting that they kind of switched between the notation of entropy with H as the functional and just the pure expectation with the E because the actual definition of entropy is the expectation of the negative log of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2317.441,
    "end": 2332.287,
    "text": " whatever is the variable, which in this case is q of x. And that's actually how we get to the other two expressions with complexity and accuracy and divergence and evidence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2332.807,
    "end": 2346.652,
    "text": "And there's also a link, I think, might be wrong, to theoretical physics where free energy is essentially the kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2347.315,
    "end": 2355.877,
    "text": " cognitive statistical equivalent of the Lagrangian, which is defined as kinetic energy minus potential energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2355.897,
    "end": 2376.802,
    "text": "So we were discussing yesterday what that means in terms of the energy and entropy in this case, whether the energy is perhaps kind of the immediate cognitive kinetic energy, and then the entropy is like the potential energy or vice versa.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2379.232,
    "end": 2381.033,
    "text": " might be going off on a tangent at this point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2382.594,
    "end": 2382.914,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2383.314,
    "end": 2385.615,
    "text": "Let me just add in a few other notes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2387.016,
    "end": 2389.737,
    "text": "The variables, f is a function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2390.738,
    "end": 2392.679,
    "text": "It's the variational free energy function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2393.564,
    "end": 2399.549,
    "text": " The arguments that it is taking in are Q. That's the variational distribution that we control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2399.789,
    "end": 2402.031,
    "text": "That's what makes it a variational free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2402.611,
    "end": 2404.532,
    "text": "Q is the one that we control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2405.173,
    "end": 2408.235,
    "text": "P is the actual probability distribution out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2409.316,
    "end": 2410.177,
    "text": "Y is the data point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2411.198,
    "end": 2417.843,
    "text": "So we have on the left side of the equation, variational free energy is a function of Q and Y.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2419.153,
    "end": 2427.602,
    "text": " On the right side, we have three equal signs, and these are three values, three ways to phrase this one function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2429.344,
    "end": 2434.55,
    "text": "In the bottom here, Jakob has shown how this energy minus entropy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2436.223,
    "end": 2442.844,
    "text": " can result in the second line, complexity minus accuracy, and in the third line, divergence minus evidence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2443.584,
    "end": 2451.566,
    "text": "So that was like one really interesting thing is it's not like this is how it is, and this is a transformation, and then this is a transformation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2452.686,
    "end": 2454.186,
    "text": "Even in a sense that is also true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2454.686,
    "end": 2464.328,
    "text": "It is also probably helpful to think about this energy minus entropy formalism for what it is, which is the closest to a physics formula",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2464.636,
    "end": 2493.659,
    "text": " framing of free energy and then think about these two more statistical ontology ways of framing it complexity minus accuracy which is like very commonly brought up in the context of model fitting and divergence minus evidence also um and yeah great so blue if that sounds like a very helpful norm in the description we'll try to have like a description of the equation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2494.807,
    "end": 2512.752,
    "text": " first row says this this this this this people can type it however they want and then of course we can replace terms that are in the ontology with the special at sign and that will facilitate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2513.871,
    "end": 2524.997,
    "text": " binding equations that mention those terms, and it will facilitate translating these equations and also the descriptions into different languages, computer languages and human languages.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2526.117,
    "end": 2533.461,
    "text": "So then we can work on it in this ontological space and then make sure that it's accessible to different languages, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2535.242,
    "end": 2542.506,
    "text": "Then we thought about this example of a ball and its location in a bowl.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2543.331,
    "end": 2567.846,
    "text": " so there's a true location of where it is in the bowl x and then there's an observation of where we're observing the ball to be so and this also speaks to the quantum to classical handoff if the bowl is a swimming pool and the ball is a bowling ball after enough time it's going to be at the bottom and not moving",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2569.122,
    "end": 2582.118,
    "text": " If the bowl is like a molecular well and the ball is like an electron or like one atom, then repeated measurement is going to be entirely different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2582.679,
    "end": 2588.566,
    "text": "And as the ball and the bowl become more massive, it approaches like a classical limit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2591.055,
    "end": 2598.397,
    "text": " Little hints at the continuity between classical, statistical, and quantum and thermophysics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2599.477,
    "end": 2601.297,
    "text": "But we thought about this ball being in the bowl.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2602.278,
    "end": 2610.579,
    "text": "So, we looked at two different cases, which is when the ball is being observed in the bottom of the bowl.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2611.28,
    "end": 2616.901,
    "text": "It's like, given the generative model of the shape of the bowl and gravity,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2618.428,
    "end": 2636.935,
    "text": " um which is like a potential energy function observing the ball at the center of the bowl is like strictly the most likely thing that could have happened and then observing it up on a side is like a less likely observation um eric and then blue hi",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2638.66,
    "end": 2639.66,
    "text": " Let's see.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2639.72,
    "end": 2640.401,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2641.141,
    "end": 2643.782,
    "text": "So you mentioned that f is a function.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2643.922,
    "end": 2649.024,
    "text": "And as they put it, it's a function of a function, which is a functional.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2649.544,
    "end": 2658.248,
    "text": "So the way I think about this is that the function that it's a function of is the q. So the q is a distribution over your beliefs.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2658.948,
    "end": 2661.529,
    "text": "So I think of that as being a function that you're trying to optimize.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2661.549,
    "end": 2667.272,
    "text": "You're trying to, well, how do I figure, how do I adjust my internal belief state, the q,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2668.757,
    "end": 2671.798,
    "text": " And that's what I'm optimizing in this equation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2671.918,
    "end": 2675.639,
    "text": "And the functional says, that's what I'm trying to optimize is that function and distribution.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2676.179,
    "end": 2684.882,
    "text": "And then it breaks down into the two parts, which is your generative model P, which says, well, P says for any,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2686.567,
    "end": 2696.073,
    "text": " There's the joint probability of x. x is the internal state variable that you have a distribution over.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2696.093,
    "end": 2701.997,
    "text": "That's q. And so how do your observables and your internal states go together?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2702.538,
    "end": 2705.399,
    "text": "And then you have the entropy term, which is, well, you want to have",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2706.44,
    "end": 2719.947,
    "text": " maximum uncertainty so that if you're not constrained by your observations, you want to be as agnostic as possible about what the possible values are of your internal states or make that Q as flat as possible.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2721.687,
    "end": 2730.812,
    "text": "As flat as possible under the constraints of the observations going through your generative model P. So I guess that's the way I talk through this first line.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2732.372,
    "end": 2732.713,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2733.173,
    "end": 2733.713,
    "text": "Thank you, Eric.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2734.273,
    "end": 2735.414,
    "text": "Blue, and then Brock.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2736.9,
    "end": 2738.381,
    "text": " So, Eric, that was super helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2739.062,
    "end": 2744.186,
    "text": "I've been, like, since yesterday trying to figure out what exactly is meant by Q here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2744.726,
    "end": 2749.25,
    "text": "Like, I get, like, later on we're going to talk about Q as representing beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2749.63,
    "end": 2757.256,
    "text": "But in, like, as it's given, as it's laid out in Chapter 2, like, they don't actually define Q at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2757.276,
    "end": 2758.097,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2758.858,
    "end": 2762.622,
    "text": " Um, so I am like having a hard time up here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2762.723,
    "end": 2772.675,
    "text": "Like they describe it much like right before they get into that box, they describe Q in section 2.6 as an approximate posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2772.695,
    "end": 2772.735,
    "text": "So,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2774.986,
    "end": 2776.187,
    "text": " Approximate posterior of what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2776.247,
    "end": 2781.031,
    "text": "And like, should we denote Q as the function of beliefs here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2781.852,
    "end": 2786.797,
    "text": "Even though like there's, it's like they're skipping ahead and looping back at the same time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2786.857,
    "end": 2788.378,
    "text": "It seems like, or it feels like to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2791.761,
    "end": 2796.946,
    "text": "Q is the variational distribution where the form of the posterior has been chosen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2797.887,
    "end": 2799.048,
    "text": "So exact Bayes,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2800.402,
    "end": 2808.703,
    "text": " using matrix multiplication, basically, or sampling-based approaches to approximate Bayesian computation, like Monte Carlo, Markov chain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2809.85,
    "end": 2823.018,
    "text": " Those try to recapitulate the actual form of P. So if P is truly bimodal, then exact Bayes or sampling-based approaches would try to reconstruct that distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2823.758,
    "end": 2836.586,
    "text": "In contrast, the variational approach gains tractability because you're choosing a posterior, approximate posterior, Q, of a form that you know is going to have a tractable optimization scheme.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2837.147,
    "end": 2838.768,
    "text": "And there's message passing algorithms",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2839.622,
    "end": 2840.843,
    "text": " that can do it computationally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2841.443,
    "end": 2859.657,
    "text": "So if you choose Q to be a Gaussian, then depending on how you parameterize it, it's either gonna like be seeking the mode and go to the hump that's bigger and center around that with a variance, or it'll just spread out a lot and go over and try to cover as much probability density as it can by covering both humps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2861.28,
    "end": 2880.249,
    "text": " Okay, so the variation of free energy function F as a function of the function representing the approximate posterior Q and the data Y is equal to the negative expectation of Q given the observations X times the natural log of the probability of the joint distribution of the data and observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2880.689,
    "end": 2882.21,
    "text": "Is that the English translation of that equation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2882.25,
    "end": 2884.251,
    "text": "I think I got it, finally, after like two days.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2884.271,
    "end": 2884.991,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2885.672,
    "end": 2886.533,
    "text": " Minus.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2887.313,
    "end": 2887.674,
    "text": "Close.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2887.794,
    "end": 2890.416,
    "text": "I would say one thing I would say slightly different.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2891.097,
    "end": 2900.304,
    "text": "It's the expectation over Q, not the expectation of Q. We actually talked about that a little bit.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2900.524,
    "end": 2905.769,
    "text": "Like here, we had negative expectation over Q. And yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2908.591,
    "end": 2909.412,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2909.872,
    "end": 2910.533,
    "text": "Blue, then Brock.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2910.553,
    "end": 2910.673,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2911.169,
    "end": 2915.011,
    "text": " Sorry, the ontology terms like don't match the terms that are given in the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2915.111,
    "end": 2925.338,
    "text": "And I put in a request in the questions here if we can append the ontology because they use like data is the same as like observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2927.239,
    "end": 2930.781,
    "text": "Those are different words, but there's they're similar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2933.05,
    "end": 2946.033,
    "text": " Yeah, there's a lot of synonyms or synonymous use, and so I would hate to step on them, but also the terms aren't in the ontology at all, so maybe we should update the ontology to reflect the terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2946.853,
    "end": 2953.475,
    "text": "We will absolutely add terms into the supplemental or eventually into the core terms if that's required, but just...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2955.103,
    "end": 2959.946,
    "text": " leave a comment or email active inference at gmail to add terms to the ontology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2959.986,
    "end": 2962.968,
    "text": "If there's a term that you want to tag that's not being tagged.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2963.729,
    "end": 2964.049,
    "text": "Brock?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2968.432,
    "end": 2982.841,
    "text": "I feel like you may have indirectly answered this just now, but in the math discussion yesterday, we were talking about specifically about the distribution of beliefs over the...",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2986.511,
    "end": 3001.818,
    "text": " If x is this uncertainty term, this hidden state, what value could it possibly have?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3002.139,
    "end": 3003.279,
    "text": "Where is it coming from?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3004.5,
    "end": 3013.204,
    "text": "Or is that, so q is this distribution of beliefs, is x the belief value and that's being generated",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3015.526,
    "end": 3016.427,
    "text": " in the previous step.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3019.51,
    "end": 3035.587,
    "text": "I think we, in the bowl marble thing, like my question was, or I was just pointing out, I guess, that the hidden state is changing however it wants, perhaps below our threshold of observation.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3037.776,
    "end": 3040.597,
    "text": " that's not reflected in the equation for obvious reasons.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3040.677,
    "end": 3047.659,
    "text": "And so, but, but then where, you know, maybe it crosses a threshold and then we update or whatever, but, but where is that X coming from?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3047.719,
    "end": 3050.06,
    "text": "If it's a hidden state, do you see what I'm saying?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3050.08,
    "end": 3052.621,
    "text": "There's a kind of an ontological problem there I'm trying to solve.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3052.641,
    "end": 3053.741,
    "text": "So it's like, it's a hidden state.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3053.801,
    "end": 3056.262,
    "text": "How can I have a value or be a variable if it's hidden?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3057.462,
    "end": 3059.043,
    "text": "It's a yes, Eric.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3061.244,
    "end": 3062.124,
    "text": "I'll take a stab at that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3062.844,
    "end": 3065.225,
    "text": "So as I, as shown in the pictures, there's two hidden states.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3066.462,
    "end": 3071.884,
    "text": " There's a hidden state of the real world, and then there's a hidden state of your generative model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3073.784,
    "end": 3077.225,
    "text": "And the generative model is whatever the model is, and that's however the model was built.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3077.565,
    "end": 3082.847,
    "text": "So once you have the parameters X, then that's what you're working with until you change your model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3084.247,
    "end": 3086.188,
    "text": "So that was my epithet.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3086.868,
    "end": 3087.108,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3087.908,
    "end": 3090.109,
    "text": "And over evolutionary or developmental times,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3091.721,
    "end": 3106.524,
    "text": " You get swept off the table, if there is an adequacy at least, but in a simulation environment, you could make the x and the x star to be anything, but the hidden state is as modeled by the generative model of the cognitive entity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3108.344,
    "end": 3121.087,
    "text": "So, in the cognitive model of the entity, in the bowl example, they're modeling an unobservable, which is the location of the ball, and they're modeling an observable, which is the observation of location.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3122.116,
    "end": 3124.157,
    "text": " So both of those are in the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3124.798,
    "end": 3129.5,
    "text": "And then the generative process would be like, there's somebody with a magnet who's moving the ball around or something, or it could be anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3132.062,
    "end": 3136.324,
    "text": "We're going to have five more minutes before we close this session.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3137.144,
    "end": 3140.626,
    "text": "So what does anyone see in 2.4?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3141.447,
    "end": 3144.929,
    "text": "What is free energy minimization doing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3145.789,
    "end": 3150.312,
    "text": "And what does it mean that variational free energy is an upper bound on the negative log evidence?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3161.325,
    "end": 3166.435,
    "text": " Just one quick qualitative read is that this is what we would actually like to be minimizing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3166.956,
    "end": 3172.947,
    "text": "This is the floor we truly want to reach, would be unsurprised about observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3174.687,
    "end": 3183.23,
    "text": " However, that is intractable because we don't have access to the form or the parameterization of the true generative process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3183.91,
    "end": 3190.553,
    "text": "What is a tractable approximation, approximate Bayesian computation, is variational Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3191.113,
    "end": 3197.115,
    "text": "So here's F, Q and Y, and then this is a KL divergence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3199.119,
    "end": 3226.602,
    "text": " one vertical pipe means conditioned on like x conditioned on y x given y here probability of a hidden state being the case given a data or the other flipping which would be the probability of a given data point given a hidden state two vertical lines is in divergence notation and that's the divergence between this and that between q of x and between p of x given y",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3227.768,
    "end": 3256.894,
    "text": " so that reducing this divergence which has very nice properties in terms of its um implementation is bringing us to lower our upper bounds on what we really want to be minimizing in an attractable way so that's one aspect on free energy minimization and then um here is reframing the two ways that free energy variational free energy can be minimized through perception",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3257.864,
    "end": 3259.145,
    "text": " the updating of beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3259.846,
    "end": 3263.069,
    "text": "And we'll talk more about the continuity between like perception and learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3263.749,
    "end": 3272.237,
    "text": "Like if one observes the ball moving across the visual field, is that perception or is it parameter learning updating the location of the ball?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3272.777,
    "end": 3274.318,
    "text": "That depends on the timescale and such.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3275.199,
    "end": 3280.804,
    "text": "Or action can be taken so that the expected observations are changed to maximize evidence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3282.386,
    "end": 3284.808,
    "text": "And then in the last minutes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3286.691,
    "end": 3290.955,
    "text": " Ali asked, can a hidden state be an unquantifiable quality?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3293.476,
    "end": 3297.86,
    "text": "Like a qualia quality or like an unquantifiable quantity?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3303.07,
    "end": 3308.033,
    "text": " No, I mean, well, of course, most qualities can be parameterized.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3308.093,
    "end": 3324.902,
    "text": "But, well, perhaps we can think of a hidden state as a pure quality that cannot be fundamentally unquantifiable, and we cannot parameterize it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3325.162,
    "end": 3327.203,
    "text": "I mean, can we think of such a hidden state?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3332.557,
    "end": 3360.303,
    "text": " brock i was just gonna say the probably the quantifiable way to state that question is like are there intractable hidden states which the answer to that is like obviously yes can we get some estimate on it yes but then is that commensurate with the i you know and then is that mean it's a quality and not a quantity i don't know",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3361.556,
    "end": 3385.688,
    "text": " And also to the earlier discussion about like the dimensionality of the generative model and the generative process, the unquantifiable part could be like the baby's happiness, but then we're able to still have an inference on the happiness as a parameter X, the underlying state that's giving rise to the different sounds without necessarily knowing like the distributional form of happiness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3386.188,
    "end": 3390.511,
    "text": "But we have to have a distributional form for the variational approximation of happiness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3390.811,
    "end": 3391.051,
    "text": "Joe?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3392.421,
    "end": 3419.497,
    "text": " was just going to say i mean i think that this qualitative versus quantitative distinction is is interesting if you're thinking about like a light source you know it's a source of electrons well you could count the number of electrons but whether or not there is a light source they're a source of electrons in this framework and i'm proposing you're not counting that you're just saying there is a light source or some other dimension that's the thing we've been calling dimensions you know yes you can count the number of dimensions but given that they're all different they're not really relatable to each other",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3421.22,
    "end": 3421.48,
    "text": " Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3421.92,
    "end": 3423.041,
    "text": "Yes, very interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3424.341,
    "end": 3446.009,
    "text": "So in our final seconds, we'll just point towards 2.6, which is expected free energy, G, and its prospective, which is going to enable inference conditioned on action, X, hidden states of the world, conditioned on policy selection,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3447.13,
    "end": 3454.279,
    "text": " And that is what is going to allow comparison of different policies, which are sequences of actions over a given time horizon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3454.919,
    "end": 3462.068,
    "text": "So minimizing the divergence between two things minus some things, reframing it as a few things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3462.629,
    "end": 3462.749,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3464.394,
    "end": 3472.219,
    "text": " We didn't go as much into 2.6 as we did into 2.5 because 2.5 is an important precursor and simpler cousin of 2.6.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3473.619,
    "end": 3488.428,
    "text": "But it's like super important and we, especially to those who are here and those who are not here, we would really love over multiple cohorts when everybody will hopefully be able to join and rejoin as participant, as facilitator.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3490.129,
    "end": 3511.167,
    "text": " to be able to annotate all the equations with what they mean because what is there to be said about expected free energy without some understanding of what this is actually discussing what variables go in what is it doing how are some of them being related so we want to learn this and we can do it collaboratively if people just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3512.247,
    "end": 3520.092,
    "text": " pick and choose affordances they see, annotate some things, and then they can highlight it and say, I'm not sure about this, but I just wanted to add it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3520.152,
    "end": 3521.012,
    "text": "Can somebody improve it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3521.072,
    "end": 3521.513,
    "text": "And so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3521.573,
    "end": 3527.016,
    "text": "Like we're all there to help each other learn and improve our epistemic niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3527.036,
    "end": 3528.157,
    "text": "2.6 is expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3529.104,
    "end": 3535.047,
    "text": " there's further discussion on expected free energy, showing how it's composed of these five sections.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3535.707,
    "end": 3542.67,
    "text": "And that by like leaving some out, you get different special cases that are quite important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3543.951,
    "end": 3546.874,
    "text": " For example, leaving out this, you get this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3547.534,
    "end": 3550.197,
    "text": "Leaving out just one, you get two, three, four, five, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3550.758,
    "end": 3551.458,
    "text": "Figure two, six.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3552.299,
    "end": 3555.863,
    "text": "And then there's a summary of the low road to active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3555.923,
    "end": 3556.623,
    "text": "That's chapter two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3557.304,
    "end": 3562.269,
    "text": "So this concludes chapter two and our discussion in cohort one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3563.21,
    "end": 3567.794,
    "text": "In the coming two weeks, we're going to be discussing chapter three, the high road to active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3568.772,
    "end": 3581.141,
    "text": " It's going to take another tack and we will go through it in the coming two weeks and be addressing people's questions, but hopefully we can continue answering and addressing just wherever we see fit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3581.721,
    "end": 3586.065,
    "text": "No one's going to do it all, but we do need everybody to do some, hopefully.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3588.24,
    "end": 3590.322,
    "text": " We're going to now close recording.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3590.923,
    "end": 3592.724,
    "text": "We'll then take a one minute break.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3593.265,
    "end": 3596.468,
    "text": "And then in this room, we're going to continue with dot tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3597.369,
    "end": 3604.636,
    "text": "If you want to continue discussing the textbook or anything else, then head up to a room up and to the left.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3605.016,
    "end": 3608.68,
    "text": "But in this room, in one minute, we're going to continue with dot tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3609.0,
    "end": 3610.101,
    "text": "So thanks, everybody.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3610.141,
    "end": 3610.442,
    "text": "See you soon.",
    "speaker": "SPEAKER_01"
  }
]