[
  {
    "start": 1.567,
    "end": 29.008,
    "text": " all right hello it's February 15th 2023 we're in cohort three of the textbook group and we're in our first discussion on chapter two of the textbook so there's a lot to discuss chapter two goes hard before we go into the questions that people have raised",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 30.17,
    "end": 45.628,
    "text": " Does anyone want to just share a first recollection, something that stuck with them, or a friction, or just a sentiment, or a feeling that they had when they were reading even part of chapter two?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 49.833,
    "end": 51.975,
    "text": "You can just unmute and go for it if you want to share.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 64.105,
    "end": 92.003,
    "text": " it's awesome that so many people added questions there's going to be a lot to discuss anyone just want to give a first thought what did they what did they hope chapter two would do was there any section or like quote or what stood out when people were on the low road to active inference",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 110.596,
    "end": 140.248,
    "text": " okay let us skim in a few minutes the whole chapter and then we're going to turn to the questions and just go based upon which questions people have voted as interesting but let's just take a quick uh flyby of the low road so chapter two is going to be coming on the low road",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 141.157,
    "end": 163.452,
    "text": " so just to get a visual reminder of what we're talking about with the high road and the low road from figure 1.2 the low road is like the how showing how from bayes theorem which is so simple and tautological and contentless we get a how",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 163.786,
    "end": 183.938,
    "text": " that meets with a why which is this imperative for persistence and self-organization and they come together in the generative models used in active inference which we're going to get to in chapter four so the low road is going to talk about a lot of the how and some of the what i guess as well",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 184.762,
    "end": 207.9,
    "text": " chapter three is going to come from the high road perspective and chapter four is where we're going to come to the heart of active inference with the generative models thank you maria we'll get to 2.3 and and then feel free to address that section 2.2",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 209.112,
    "end": 210.959,
    "text": " is perception as inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 211.943,
    "end": 218.548,
    "text": "And this section gives a little bit of an overview on how even before the Bayesian brain was described,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 219.018,
    "end": 244.924,
    "text": " there was concepts of perception as inference with Helmholtz and even further back as Action Maria shared in live stream 43.0 and what active inference is doing is extending that inferential framework beyond perception to also include action that is in the title it's active inference it's about inference on perception and action",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 246.963,
    "end": 254.554,
    "text": " This is gonna be operationalized with modern statistics through what is called a generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 256.036,
    "end": 258.539,
    "text": "We're gonna come back through this, so just moving rapidly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 261.243,
    "end": 266.811,
    "text": "Probabilistic reasoning is described by this equation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 267.77,
    "end": 293.575,
    "text": " which is it'll be awesome I think as a question asked like to have this in plain language what is being described or what is being done with Bayes equation an example is introduced where a person is holding either a frog or an apple in their hand and then the object is going to either jump or not jump",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 293.723,
    "end": 317.959,
    "text": " the person has some prior beliefs about a priori prior beliefs how likely frogs and apples are in the world and they have some beliefs about what is likely to do what action an observation comes in and then one is able to have a posterior belief or a posteriori",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 318.952,
    "end": 323.359,
    "text": " of how likely they think the object is to be one thing or the other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 323.659,
    "end": 327.345,
    "text": "They've updated their prior beliefs through observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 327.906,
    "end": 341.668,
    "text": "So like the Bayesian moment is this critical moment where a new observation comes in and that in the context of a likelihood model updates the prior into a posterior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 344.365,
    "end": 372.853,
    "text": " here's an exact Bayesian inference on that scenario and for simple settings exact Bayesian inference is totally fine it turns out that for larger and more challenging statistical areas one has to use approximate Bayesian inference but what approximate Bayesian inference approximates is exact Bayesian inference",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 373.019,
    "end": 380.031,
    "text": " So this is kind of like the core of what you could do if you had infinite computational power.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 380.051,
    "end": 381.594,
    "text": "And you can do it for simple examples.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 384.439,
    "end": 393.154,
    "text": "There's a discussion of probability distributions because there's multiple probability distributions as we're dealing with probabilistic variables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 393.286,
    "end": 414.147,
    "text": " people may be familiar with the Gaussian or the so-called normal distribution or bell curve however there are other probability distributions that cover a different space on the x-axis that's called support and ultimately just have different shapes",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 415.392,
    "end": 419.436,
    "text": " So sometimes you want to be reducing your uncertainty about a bell curve.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 419.616,
    "end": 427.784,
    "text": "Other times you might want to be reducing your uncertainty about other distribution families, like waiting times.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 430.807,
    "end": 433.43,
    "text": "There's a discussion of two kinds of surprise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 434.171,
    "end": 443.34,
    "text": "There's kind of plain surprise or surprisal, which is just how surprising was that observation?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 444.198,
    "end": 464.772,
    "text": " and it doesn't imply any updating of the generative model or belief it's just like taking a look at that observation alone how surprising was it we call that surprise surprisal and it's measured in information theoretic units a gnat is like a bit",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 465.022,
    "end": 468.126,
    "text": " but a bit is like a zero or one coin flip.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 468.807,
    "end": 476.957,
    "text": "A nat is like a bit, but it's like your coin has E sides, 2.7, et cetera sides.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 477.758,
    "end": 478.8,
    "text": "So that's surprise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 478.96,
    "end": 483.246,
    "text": "Just simply how surprising is an observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 483.266,
    "end": 485.028,
    "text": "And then there's also Bayesian surprise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 485.749,
    "end": 491.316,
    "text": "Bayesian surprise also measured in nats is about how much",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 491.532,
    "end": 496.139,
    "text": " the observation updates the prior into the posterior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 496.8,
    "end": 499.865,
    "text": "So they're both measured in information theoretic units.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 499.885,
    "end": 507.498,
    "text": "Surprisal is describing how surprising an observation is with no reference to the updating.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 508.059,
    "end": 513.287,
    "text": "And the second notion of surprise is the Bayesian surprise, which is how much beliefs update.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 516.575,
    "end": 540.658,
    "text": " expectations are described in box 2.2 although conversationally we might talk about like are you expecting it to rain tomorrow an expectation of a distribution is not a prediction about how it will be in the future necessarily expectation is the just arithmetic mean",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 541.769,
    "end": 549.42,
    "text": " So it's just the center of gravity, the center of mass of a probability distribution is its expectation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 554.568,
    "end": 567.928,
    "text": "Having introduced a more general Bayesian and information theoretic perspective on just inference, it's gonna return to biology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 568.769,
    "end": 596.228,
    "text": " so maria asked what is um how does uh active inference relate with biology and psychology was that the point of section 2.3 so does anybody want to give a thought like what was section 2.3 doing or how is optimality and bayesian statistics related to biological inference either restating what they added or just adding your own angle on it",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 604.51,
    "end": 605.211,
    "text": " I'll let you go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 608.755,
    "end": 634.365,
    "text": "I think section 2.3 serves as a kind of interlude between 2.2 namely perception as action and 2.4 action sorry, perception as inference and 2.4 action as inference because before dealing with the concept of action as inference we need to be clear what",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 634.7,
    "end": 637.496,
    "text": " kind of inference we're dealing with here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 637.516,
    "end": 641.419,
    "text": "Namely, it's not just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 641.517,
    "end": 668.757,
    "text": " uh any kind of uh inference uh that's for example being discussed in uh other various uh literatures and statistics or in other areas but we're dealing with some specific kinds of bayesian inference uh which uh is one of its main characteristic is being optimal because uh to be optimal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 669.175,
    "end": 689.614,
    "text": " in this framework is a necessary condition for inference because without optimality, we wouldn't have any actionable state of knowledge",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 689.847,
    "end": 702.608,
    "text": " So that's one of the main points of 2.3, because I believe the concept of optimality is a necessary requirement for any",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 702.959,
    "end": 713.074,
    "text": " biological or even non-biological agent to act as a sentient agent in any kind of environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 713.094,
    "end": 724.25,
    "text": "So that optimality is a kind of, at least in this section, it's been described as a kind of requirement for any kind of sentient behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 724.27,
    "end": 726.613,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 726.653,
    "end": 727.234,
    "text": "Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 729.177,
    "end": 732.021,
    "text": "Great way to put it as like an interlude.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 732.693,
    "end": 753.52,
    "text": " because biological or even the kinds of active systems that aren't necessarily biological we want to talk about inference on perception but also we want to talk about inference on action and part of the unifying capacity of active inference is that perception and action",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 753.5,
    "end": 758.007,
    "text": " are going to be in service of a common imperative, which is free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 758.929,
    "end": 765.419,
    "text": "It's a really important note that optimality does not imply that it's adaptive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 765.459,
    "end": 767.483,
    "text": "It doesn't mean the organism succeeds.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 768.244,
    "end": 769.626,
    "text": "It doesn't mean it even works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 770.428,
    "end": 774.194,
    "text": "So it's really worth it to see what is meant by optimality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 774.214,
    "end": 779.322,
    "text": "Optimality is defined in relation to a cost function that's optimized",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 780.719,
    "end": 806.305,
    "text": " that's the variational free energy which is going to be related to surprise which is why surprise was brought up as important earlier so it's also unpacked a lot more in the neuropsychiatry context where instead of saying well healthy or neurotypical people have optimal inference and then it's sub-optimal inference for those who are different in this or that way",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 807.027,
    "end": 831.668,
    "text": " rather in the precision neuropsychiatry setting we can talk about bayesian inference being optimal however with different generative models the outcomes of optimal inference are going to look different if somebody has an 100 belief that it rains every day then their optimal inference",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 831.783,
    "end": 860.878,
    "text": " will lead to them believing that it rains every day so this doesn't mean society accepts doesn't mean the business succeeds doesn't mean that the model works better than any other model it is just a statement about how bayesian inference is going to unfold and as ali pointed to this is helping us um move from a perceptual inference model into a subjective",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 862.597,
    "end": 880.622,
    "text": " subject specific generative model of perception and action which can be described as sentient in the sense used by friston at all to mean adaptive and responsive to stimuli",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 883.64,
    "end": 903.117,
    "text": " figure 2.2 is going to introduce a really important distinction between the generative process and the generative model so the generative model is the cognitive agent it's there whether you think of it as they are or they have a generative model that's like a realist",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 903.097,
    "end": 927.163,
    "text": " angle or we're making a generative model for a cognitive agent that's the instrumentalist more map territory falling more on the map side so generative model is a bayesian statistical model that is being used to describe a cognitive agent the generative process",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 928.055,
    "end": 936.384,
    "text": " can be thought of as the niche that is the underlying process passing observations to the generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 937.785,
    "end": 944.833,
    "text": "The niche, the generative process, can be an active inference process itself, but it doesn't have to be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 945.594,
    "end": 948.276,
    "text": "So the generative process could just be an if-then.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 948.296,
    "end": 953.522,
    "text": "It could be any kind of logic, can have any endogenous dynamics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 954.228,
    "end": 965.125,
    "text": " However, it passes observations through the Markov blanket as sense states to the generative model, the GM.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 965.145,
    "end": 971.555,
    "text": "Section 2.4, the discussion to this point is common to all Bayesian brain theories.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 972.577,
    "end": 978.987,
    "text": "We now introduce the simple but fundamental advance offered by active inference, alarm bells ringing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 981.245,
    "end": 983.508,
    "text": " it considers action as inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 984.37,
    "end": 991.12,
    "text": "Active inference is like Bayesian brain plus pragmatic turn.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 993.824,
    "end": 996.828,
    "text": "Bayesian inference perspective on action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1000.493,
    "end": 1001.996,
    "text": "That gets unpacked a little bit more.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1003.558,
    "end": 1011.049,
    "text": "In the next two sections, we clarify the single quantity that active inference agents minimize through perception and action is variational free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1011.839,
    "end": 1033.277,
    "text": " So whereas a reward learning cognitive agents would be maximizing reward, an active inference agent as modeled as the way we're gonna be exploring in this textbook, they have two ways to approach a single imperative.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1033.297,
    "end": 1036.783,
    "text": "The single imperative is variational free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1037.742,
    "end": 1045.237,
    "text": " The two ways that variational free energy can be minimized is changing your mind and changing the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1046.259,
    "end": 1048.523,
    "text": "Perception and learning and action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1050.006,
    "end": 1055.397,
    "text": "So first, just minimizing the discrepancy between the model and the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1057.25,
    "end": 1066.088,
    "text": " At a first approximation, the common objective of perception action can be formulated as a minimization of the discrepancy between the model and the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1066.91,
    "end": 1070.297,
    "text": "Sometimes this is operationalized in terms of prediction error.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1071.323,
    "end": 1077.59,
    "text": " So here's a more classical prediction error minimization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1078.25,
    "end": 1096.529,
    "text": "This is also reminiscent of like TOTE cycles looking for deviations and then acting to resolve deviations or discrepancies between predictions of the generative model, observations coming in from the generative process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1096.89,
    "end": 1100.233,
    "text": "And then here are the two ways that discrepancies can be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1101.698,
    "end": 1124.061,
    "text": " reduced perception change belief oh I didn't think it was raining but it's wet discrepancy alarm bells surprise surprisal surprising observations so then what can be done well one can change belief so that upon the next cycle there is no discrepancy",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1124.885,
    "end": 1133.522,
    "text": " Or there are situations where action can be taken so that future observations are in line with the unchanged predictions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1134.283,
    "end": 1146.066,
    "text": "So those two pathways, perception and action, are going to come back again and again in active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1150.838,
    "end": 1176.61,
    "text": " how much should we take the idea of cycles seriously from jonathan presumably it's much more non-linear yeah that's an awesome question does anyone want to give a first thought on that there's there's there's a bunch of ways to explore this",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1176.758,
    "end": 1192.725,
    "text": " one is although sometimes we see it as a circle this is actually a very informal representation two representations or ways of thinking about it that are a bit closer to formality one",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1193.752,
    "end": 1212.25,
    "text": " going to come to in figure 4.3 and chapter 7 as well which is when you implement this computationally it's going to be like unrolled as a linear sequence so one answer is computationally you're going to unroll the ways that these variables update each other",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1213.445,
    "end": 1216.651,
    "text": " and they still may describe nonlinear functions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1217.452,
    "end": 1224.846,
    "text": "So we still can get a nonlinear function being described in various places, even if it's unrolled.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1225.667,
    "end": 1234.744,
    "text": "And then the second formal representation that helps us escape this sort of like loops situation is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1234.724,
    "end": 1261.288,
    "text": " there's going to be not as much in this textbook but in a lot of the recent work on Bayesian mechanics equations are defined for these variables circles random variables as flows on those partitioned variables so in that setting",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1261.808,
    "end": 1288.862,
    "text": " you can draw the edges about how different variables flows influence each other but it's actually like an unfolding flow that's just continuous across four different partitions that's the particular partition and so you don't need to draw any kind of like looping but the action perception loop is commonly understood and it's also very deep topic ali go for it",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1293.787,
    "end": 1317.33,
    "text": " Sorry, yeah, I think for this question, that figure from Path Integrals' Strange Kinds paper might also help to illuminate this concept of cycles and the relevance of this concept to different types of particles",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1317.8,
    "end": 1320.506,
    "text": " that have been described in this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1320.546,
    "end": 1324.956,
    "text": "So yeah, I just wanted to point it out to that diagram.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1325.557,
    "end": 1328.063,
    "text": "Yes, here's the flows on different states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1329.105,
    "end": 1330.448,
    "text": "And then the diagram.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1333.033,
    "end": 1335.599,
    "text": "Looking a little inverted, but continue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1335.619,
    "end": 1336.922,
    "text": "What would you like to say about it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1339.788,
    "end": 1350.135,
    "text": " So basically, in this paper, they've defined four different types of particles, the simplest one being inert particle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1350.908,
    "end": 1353.571,
    "text": " which doesn't have any active states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1354.452,
    "end": 1379.903,
    "text": "And as we increase in terms of complexity or increasingly more sentience behavior, we're dealing with active particles, which have active states, but as opposed to strange particles, which do possess the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1380.642,
    "end": 1387.289,
    "text": " disposition to being actually sentient particles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1387.709,
    "end": 1394.076,
    "text": "In case of active particles and conservative particles, there isn't any hidden active states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1394.657,
    "end": 1406.329,
    "text": "So that basically encompasses the different self-organizing or even non-self-organizing entities",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1406.714,
    "end": 1430.106,
    "text": " ranging from simple rocks to brains and organisms so i think that's a pretty good way to somehow frame frame all of those behaviors within that bayesian mechanical framework thank you everett",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1433.545,
    "end": 1437.511,
    "text": " I have a question of the figure 2.3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1437.671,
    "end": 1456.417,
    "text": "It looks as if there's always discrepancy, but I can also imagine that I have a perception of objects in the world, say, for example, where there isn't any discrepancy between my prediction and my sensory observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1457.098,
    "end": 1462.506,
    "text": "But that is not shown by this picture, or is it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1463.431,
    "end": 1465.474,
    "text": " the discrepancy value could be zero.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1465.494,
    "end": 1477.434,
    "text": "And especially for in silico, simple examples, like where the generative model is the exact same structure as the generative process, then the discrepancy can be zero.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1477.554,
    "end": 1481.601,
    "text": "I predicted a coin flip, heads, it came up heads, no discrepancy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1481.701,
    "end": 1482.823,
    "text": "I don't need to change my belief.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1483.423,
    "end": 1487.009,
    "text": "Maybe I'll strengthen my belief and I don't need to take any further action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1487.19,
    "end": 1488.892,
    "text": "So discrepancy value can be zero.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1488.912,
    "end": 1490.535,
    "text": "However,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1490.667,
    "end": 1515.797,
    "text": " in the context of fitting a generative model that is a coarse grained or partial representation of potentially noisy data coming in there's always going to be a non-zero discrepancy so that's why we're interested in relative discrepancy reduction",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1516.874,
    "end": 1544.13,
    "text": " but there's also contrived examples where the discrepancy could be down to zero but there are situations where whether the discrepancy is zero or low or already as minimal as it can be that there may be no perception change there may also be no action change or you could imagine observations coming in that induce large changes in belief high bayesian surprise and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1544.414,
    "end": 1566.102,
    "text": " are associated with the agent taking action thank you earlier in the case of the object jumping out of the hand or not there was equations showing exact bayesian inference plug and chug you just push the numbers through the bayesian equations",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1566.52,
    "end": 1574.03,
    "text": " Yet, exact Bayesian inference supporting perception and action is computationally intractable in most cases.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1574.711,
    "end": 1576.474,
    "text": "And they're going to describe the cases more?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1576.534,
    "end": 1585.626,
    "text": "It can just be understood coarsely as being hard to know the total state space of what could happen?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1586.416,
    "end": 1596.711,
    "text": " and it might require taking an integral or sums over functions that are very like large or intractable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1597.232,
    "end": 1601.017,
    "text": "So it can be challenging to do exact Bayesian inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1601.698,
    "end": 1610.111,
    "text": "And so one of the key moves in active inference as most currently use it today is variational inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1611.072,
    "end": 1615.258,
    "text": "It will be unpacked in chapter four when we talk more about the generative models",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1616.791,
    "end": 1629.143,
    "text": " It suffices to say that performing variational Bayesian inference implies substituting the two intractable quantities, posterior probability and log model evidence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1630.103,
    "end": 1643.196,
    "text": "So that's like what we would want to know if we had full access to information, infinite computational resources, doable for simple problems, intractable for higher dimensional state spaces and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1644.117,
    "end": 1645.718,
    "text": "We're going to replace those two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1646.626,
    "end": 1661.963,
    "text": " Posterior probability is going to be replaced with an approximate posterior called Q. And then log model evidence is going to be substituted functionally by a free energy calculation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1662.563,
    "end": 1665.747,
    "text": "This is called energy-based learning broadly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1667.028,
    "end": 1669.05,
    "text": "It's been around for decades.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1669.871,
    "end": 1675.097,
    "text": "Active inference does not invent the idea of using free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1675.381,
    "end": 1701.962,
    "text": " value on a bayesian statistical learning or inference challenge what is different is inference on action but it is not something that was generated within the active inference community it's existed for decades variational free energy variational bays is used broadly and every day active inference",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1702.01,
    "end": 1731.713,
    "text": " uses inference on action and perception that's what integrates that kind of perceptual signal processing element with the action selection control theoretic element and it uses the particular partition which is the partition of the cognitive agent from the niche to operationalize variational inference in this kind of agent-based",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1732.3,
    "end": 1746.647,
    "text": " perception cognition action loop or just scenario so it's always important as we're like learning through and again multiple coats of paint but what is actually new and different in active inference",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1747.032,
    "end": 1765.733,
    "text": " what is describing or condensing or distilling work that is totally non-contentious and has existed for decades and is being used day to day evidence lower bound and energy-based learning people will find copious examples of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1766.557,
    "end": 1776.951,
    "text": " So that's one deflationary take to use a Fristianism on active inference is doing variational Bayesian inference isn't novel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1778.473,
    "end": 1795.635,
    "text": "Unified imperatives for perception and action are also not necessarily novel, but using variational inference on the particular partition so that there can be a unified imperative for perception, cognition, action",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1795.666,
    "end": 1824.998,
    "text": " is when we actually get to active inference equation 2.5 describes variational free energy we're going to come back to that figure 2.4 gives a visual representation of how variational free energy bounds surprise so here's like what we would want to know here's how we can approximate or bound what we want to know",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1827.998,
    "end": 1850.293,
    "text": " figure 2.5 revisits that discrepancy yes ever at first yes I I have some difficulty with this bounding uh can you explain to me yes this figure uh what is meant by 3mg bounce what what bound",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1851.218,
    "end": 1875.505,
    "text": " awesome so i'll just read what someone else has already added and then anyone else feel free to like raise your hand to add more so um there's something we can't actually calculate but we can calculate something approximately we know that whatever value we get for the approximate thing the true value we're looking for is certainly lower than the thing we can calculate so we want to know the organism's age",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1875.856,
    "end": 1905.728,
    "text": " don't have any information about them but you do know the organism can never live to be over 10 years old so that's an upper bound on what you believe the age of the organism to be so surprisal so ln is the natural log so natural log and you can undo and do natural logs with exponentiation not going to go into too much detail on that but it's just an operation like whether when you see something ln and then parentheses you can",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1905.86,
    "end": 1907.662,
    "text": " take it in and out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1907.722,
    "end": 1909.463,
    "text": "We're going to talk more about logs later.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1911.365,
    "end": 1913.387,
    "text": "So this is what we would really want to know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1914.468,
    "end": 1918.632,
    "text": "How surprised should we be for a given observation?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1919.513,
    "end": 1931.864,
    "text": "Because if we knew how truly surprised to be for any given observation, we would have access to that true underlying distribution that is controlling how surprised we should be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1932.765,
    "end": 1935.748,
    "text": "Like if you don't know the range in temperature,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1936.302,
    "end": 1960.639,
    "text": " don't know how surprised to be for different observations if you knew the underlying temperature distribution you would know exactly how surprised to be with different thermometer readings what energy-based learning does again this is not an active inference ism this is energy-based learning or evidence lower bound used broadly in bayesian statistics",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1960.72,
    "end": 1981.454,
    "text": " is it constructs an approximatable functional, which is a function of a function, an approximatable functional free energy, variational free energy, equation 2.5, that's a function of our approximation, which is a function, that's why F is a functional, and data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1982.816,
    "end": 1986.222,
    "text": "So instead of trying to find the absolute function",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1986.708,
    "end": 2014.234,
    "text": " underlying surprise how surprised we should be by a data point which would entail knowing the true distribution we're going to construct this functional variational free energy that's a function of q r approximation and y the data and then this is a kl divergence the double line",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2014.4,
    "end": 2019.606,
    "text": " what is on both of the sides of the double line is what is being divergence minimized.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2020.688,
    "end": 2029.899,
    "text": "We're trying to minimize the divergence between our approximation and the true distribution conditioned on data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2031.661,
    "end": 2033.664,
    "text": "This is guaranteed to be an upper bound.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2034.705,
    "end": 2037.008,
    "text": "It's always higher than the surprise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2038.51,
    "end": 2043.816,
    "text": "And then by doing divergence minimization with KL divergence,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2044.64,
    "end": 2066.884,
    "text": " it's possible to push that upper bound lower so it's like here's how much the bank account actually has okay I know it's less than a billion because that's there's not that many of this token in the world is it less than a thousand is it less than five so it's like as you push the upper bound down",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2068.535,
    "end": 2072.06,
    "text": " you're able, this can be approximated well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2072.861,
    "end": 2082.554,
    "text": "Again, whether your startup works or whether the organism lives or whether the model's adaptive or whether it's better than any other model anyone else could ever think of, that's not this question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2083.555,
    "end": 2098.035,
    "text": "This is saying you can generate a derivative, not in terms of like a rate of change, but like a sort of corollary value based around data and our approximation",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2098.235,
    "end": 2120.8,
    "text": " that's always higher than surprise so surprise was brought in early in the chapter as a key imperative to surprise minimize but then that's intractable so we have an approximatable tractable form and that's what energy-based learning is and it's not invented in active inference",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2122.771,
    "end": 2138.569,
    "text": " but what is a little novel and different is doing energy-based learning Bayesian variational inference on action we revisit in 2.5 figure free energy",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2139.41,
    "end": 2149.782,
    "text": " And instead of it being discrepancy here, which is kind of like a prediction error minimization, that's like the T-O-T-E, like, is there a discrepancy?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2149.822,
    "end": 2151.064,
    "text": "Reduce the discrepancy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2151.684,
    "end": 2161.796,
    "text": "Well, discrepancy between the predictions and the observations, when you think discrepancy, you're thinking like, it's going to be like, I predicted a seven, I got a nine, the difference was two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2162.798,
    "end": 2164.86,
    "text": "That would be prediction error.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2165.38,
    "end": 2168.745,
    "text": " free energy is doing energy-based learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2168.905,
    "end": 2179.359,
    "text": "And so it's like a discrepancy because if the data coming in were exactly what was predicted, this divergence would be zero.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2180.04,
    "end": 2192.097,
    "text": "And this term would basically kind of functionally do what you would think a prediction error would do in the situation where the prediction matches the observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2192.819,
    "end": 2216.413,
    "text": " but it turns out to also extend in a few other ways but the reason why they showed the discrepancy first in 2.3 and then you can change perception or change your action selection and then prediction observation come together calculated discrepancy and then decisions are made cognitive decisions",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2217.71,
    "end": 2247.227,
    "text": " perception or like embodied decisions in action that change the actual generative process and then in 2.5 that gets built out a little bit beyond just prediction error type discrepancies like there's a four inch discrepancy between these two things into an information theoretic or a statistical quantity that's variational free energy",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2250.903,
    "end": 2255.969,
    "text": " Section 2.7 talks about expected free energy and planning as inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2257.651,
    "end": 2266.442,
    "text": "You can't talk about variational free energy on data points that haven't come in yet because they're future observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2267.183,
    "end": 2274.292,
    "text": "And so expected free energy G is similar and it's explored in 2.8.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2275.133,
    "end": 2277.636,
    "text": "It's similar in certain ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2278.325,
    "end": 2291.419,
    "text": " But importantly, and like we returned to this chapter after chapter, so no worries how much of these equations look fluent to you right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2291.479,
    "end": 2304.653,
    "text": "One thing is these equations have natural language representations that people can also improve, but especially like 2.5 for F.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2306.995,
    "end": 2312.723,
    "text": " you can read it and see the active inference ontology terms being used rather than variables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2312.823,
    "end": 2316.628,
    "text": "And then in 2.6, some part of it is written.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2316.648,
    "end": 2324.579,
    "text": "But these are the kinds of augmentations that are always very welcome for people to make because they help us understand.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2324.619,
    "end": 2334.673,
    "text": "Expected free energy is like variational free energy, but whereas variational free energy is real time,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2334.738,
    "end": 2363.952,
    "text": " and it's crunching our approximation with the incoming data expected free energy is calculated over policies which are sequences of action and it is going to be dealing with observations that haven't yet come in so this is where we get to policy selection in active inference by thinking about expected free energy which is like a prospective",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2364.32,
    "end": 2388.319,
    "text": " talking about the expected free energy for different possible policies which are sequences of actions there's some more discussion about special cases expected free energy when certain terms are basically zeroed out",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2390.24,
    "end": 2396.751,
    "text": " expected free energy becomes resembling other equations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2396.852,
    "end": 2399.196,
    "text": "So this is like a common technique in math.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2400.298,
    "end": 2403.884,
    "text": "You have some equation and then like you can generalize it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2404.405,
    "end": 2407.15,
    "text": "And then a special case of the general form is this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2407.33,
    "end": 2409.133,
    "text": "And then another special case might be that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2410.015,
    "end": 2411.337,
    "text": "So for example,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2413.173,
    "end": 2420.284,
    "text": " We'll come back next week or in the future to what exactly the pieces are representing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2421.245,
    "end": 2436.929,
    "text": "But one can imagine that if pragmatic value was irrelevant, then G would reflect information gain of different policies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2438.591,
    "end": 2440.935,
    "text": "If information gain were irrelevant",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2441.523,
    "end": 2449.595,
    "text": " like it were a totally discovered situation, then G would reflect purely pragmatic value.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2451.237,
    "end": 2471.327,
    "text": "So G is like a generalization, it's a unified imperative under which certain special cases resemble variously information maximizing principles or utility maximizing principles.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2473.67,
    "end": 2478.93,
    "text": " Jonathan, is there any equivalent to discounting as in an RL context?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2480.275,
    "end": 2482.745,
    "text": "Do you want to unpack what you mean there by discounting?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2482.785,
    "end": 2485.114,
    "text": "But then yes, there's definitely some angles on that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2486.478,
    "end": 2486.919,
    "text": " Yeah, sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2486.939,
    "end": 2498.057,
    "text": "So in a reinforcement learning context, there's a clear aim, which is to maximize the expected future returns, but generally that's done in a discounted way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2498.558,
    "end": 2510.578,
    "text": "And so the agent is trying to maximize the discounted expected future returns such that rewards that it gets in the future are essentially worth less than rewards that it gets in the near term.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2510.558,
    "end": 2525.393,
    "text": " So I know that there isn't the same kind of idea of rewards as there is in reinforcement learning in an active inference context, but I'm interested to know whether there is any sort of idea of discounting that states further into the future are somehow less important than states in the moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2527.756,
    "end": 2540.008,
    "text": "Yes, I'll add that question and then add in the one",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2541.524,
    "end": 2571.025,
    "text": " bristen paper it turns out that yes it's possible to get temporally discounted type behavior so like a simple way to think about that would be if the pragmatic drive were urgent then you would see small pragmatic gain being approached",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2572.017,
    "end": 2599.56,
    "text": " at the loss of future gain short time Horizon models and urgent desire drive whereas under longer time Horizons longer time preferences then you see the kind of behavior that in utility driven decision making is associated with what is called temporal discounting",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2600.705,
    "end": 2617.807,
    "text": " So the phenomena, the cognitive behavioral phenomena exists and can be recapitulated, but it is not generated with the same way that it is in other places.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2619.789,
    "end": 2622.052,
    "text": "Sure, thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2622.092,
    "end": 2624.776,
    "text": "2.9 is the end of the low road.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2626.498,
    "end": 2628.18,
    "text": "Variational free energy",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2628.532,
    "end": 2654.387,
    "text": " real time unfolding f of q and y variational free energy our approximate posterior q q that's the one we control y data just like a regression y equals mx plus b q and y discrepancy except it's a variational free energy it's real time expected free energy g of pi",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2655.447,
    "end": 2681.877,
    "text": " g is a function of policies and we're going to go into that more but it is regarding observations that haven't come in yet so it has a different structure but some rhyming with variational free energy what do they achieve together where did we get at the end of the low road",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2684.776,
    "end": 2687.281,
    "text": " So we started with Bayes' theorem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2689.144,
    "end": 2692.33,
    "text": "Generative model could be the thing jumping out of the hand.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2693.251,
    "end": 2694.333,
    "text": "Perception is inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2695.235,
    "end": 2706.295,
    "text": "That goes back to Helmholtz, but as Livestream 43 unpacks, this has been understood broadly across the world for thousands of years.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2707.895,
    "end": 2717.209,
    "text": " Predictive coding helps operationalize perception as inference because it's like top-down predictions, bottom-up sensory information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2717.669,
    "end": 2719.913,
    "text": "That's why we don't perceive our blind spot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2721.114,
    "end": 2731.73,
    "text": "To bring in action, we have to talk about perception as inference because we do care about observations, but we have to talk about observations that haven't actually happened yet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2732.631,
    "end": 2737.378,
    "text": "And we have to talk about how our actions influence",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2738.202,
    "end": 2740.424,
    "text": " which observations are likely to occur.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2741.805,
    "end": 2752.114,
    "text": "Perception and action as inference together make up the Bayesian brain, which is like some people, it means the brain does Bayesian computation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2753.074,
    "end": 2754.035,
    "text": "That's a realist take.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2754.656,
    "end": 2758.959,
    "text": "The instrumentalist take would be we use Bayesian statistics to study the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2760.24,
    "end": 2768.007,
    "text": "And where exact Bayes is intractable, we can use variational Bayes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2768.999,
    "end": 2797.588,
    "text": " energy-based learning that's the end point of the low road into active inference summary active inference is a theory of how living artifacts underwrite their existence by minimizing surprise that's what we would truly want to know surprise if you knew how surprised to be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2798.26,
    "end": 2803.307,
    "text": " you would have had to have known the actual underlying distribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2806.631,
    "end": 2807.592,
    "text": "So we usually can't do that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2808.353,
    "end": 2812.819,
    "text": "So we have a tractable proxy to surprise variational free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2813.96,
    "end": 2823.593,
    "text": "So just like we'd want to reduce our surprise because that would reflect having the most optimally trained, but not overfit belief",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2826.02,
    "end": 2831.307,
    "text": " we want to minimize a proxy that we know is an upper bound.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2831.487,
    "end": 2839.216,
    "text": "So by minimizing the upper bounds, we're getting closer and closer to what we really want to approximate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2840.798,
    "end": 2843.381,
    "text": "The two ways to do that are perception and action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2844.923,
    "end": 2850.39,
    "text": "They motivated this from a very first principles perspective",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2851.501,
    "end": 2876.867,
    "text": " and then extended what is often left only in the realm of perception into the domain of action more discussion surprise is a construct of information theory it's not necessarily equivalent to folk psychology and this comes up again and again we see it in the ontology for like half of the words",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2878.923,
    "end": 2882.207,
    "text": " These are words that are used broadly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2883.249,
    "end": 2887.054,
    "text": "Perception, action, belief, surprise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2888.155,
    "end": 2893.302,
    "text": "And sometimes they're perfectly overlapping with formal definitions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2893.423,
    "end": 2895.505,
    "text": "Other times there's a little bit of a divergence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2897.408,
    "end": 2898.89,
    "text": "And they close.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2900.092,
    "end": 2903.997,
    "text": "Perception, action, minimize, variational free energy in complementary ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2906.681,
    "end": 2907.782,
    "text": "That's real time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2908.184,
    "end": 2912.63,
    "text": " Active inference also minimizes expected free energy prospectively.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2914.472,
    "end": 2916.294,
    "text": "This completes our journey along the low road.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2917.195,
    "end": 2927.468,
    "text": "In chapter three, we traveled the high road, which reaches the same conclusion on the basis of first principles and self-organization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2928.63,
    "end": 2932.234,
    "text": "So we started from, we have a Bayesian model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2933.041,
    "end": 2961.546,
    "text": " we didn't start from organisms need to exist but it turns out by connecting surprisal to self-organization or really just persistent repeated measurement we're going to get to the same place all right in our five remaining minutes just next week",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2961.982,
    "end": 2966.17,
    "text": " we're going to return to the questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2966.19,
    "end": 2974.826,
    "text": "But I hope that it's useful to also just walk through it because definitely it takes like multiple readings and interrogatings.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2975.768,
    "end": 2979.535,
    "text": "And there's things that like you'd want to know in chapter two,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2979.616,
    "end": 3004.273,
    "text": " that are going to come up later or come up elsewhere in other papers there's just no single road or path let alone one that would be appropriate for all learners and their preferences so hopefully it was useful to like look over it and see it that way next week we're going to return a lot to the questions",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3004.372,
    "end": 3030.919,
    "text": " so if anybody wants to do addition of questions it's always great you can jump into the answers and discourse as i see many do and add things you can upvote what is interesting you can enrich what people have written by just replacing where they use a plain text with something that you know could be tagged just like that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3031.135,
    "end": 3046.072,
    "text": " So there's all kinds of ways that like wherever chapter two is sitting with you now, either by generating new questions in discourse, you can add notes on chapter two here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3046.112,
    "end": 3056.063,
    "text": "And then also in the math group, which we haven't been super active on, we've done some laying out of just the mathematical skeleton.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3057.275,
    "end": 3060.732,
    "text": " of chapter two as an example of how that could be done.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3060.873,
    "end": 3065.496,
    "text": "So, but in our closing minutes, just if we could have any closing thoughts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3083.077,
    "end": 3109.81,
    "text": " just all anyone can raise their hand but um so in in relation to the temporal discounting in reinforcement learning ali also wrote reinforcement learning models opposed to act inf are not applicable to perceptual tasks that do not involve rewards or show significantly variable behavior so there's there's a lot there in situations where pragmatic value isn't a key imperative",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3111.46,
    "end": 3115.926,
    "text": " even if that's just a sub-task, like isocating is driven by information gain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3116.507,
    "end": 3125.659,
    "text": "Yes, our eyes dwell on what might be seen as rewarding, but it's information gain that is the imperative for the isocating.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3126.52,
    "end": 3138.295,
    "text": "And so where pragmatic value or reward or utility functions are either non-existent or flat, reinforcement has a hard time",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3138.595,
    "end": 3143.179,
    "text": " And that leads to all these contrived reinforcement bonuses and novelties.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3143.259,
    "end": 3145.221,
    "text": "Oh, maybe we'll pay him for this and we'll do that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3146.041,
    "end": 3154.469,
    "text": "And significantly, and learning that reward function is very difficult.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3155.49,
    "end": 3167.64,
    "text": "And learning that reward function, especially in like a partially observable or dynamic or volatile environment, ultimately you need to reward the learning anyway.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3168.447,
    "end": 3179.707,
    "text": " So then you end up coercing what we would just call epistemic value into a reward learning framework.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3179.727,
    "end": 3191.248,
    "text": "So why not just have a generalization of reward learning where in fully observed situations, pragmatic value can be unabashedly pursued",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3192.173,
    "end": 3220.054,
    "text": " but in partially observable environments or where the generative model is a simplified or coarse-graining structure relative generative process, why not just authentically pursue the epistemic value, which is what you can do with G, but can only be done in a contrived or an ad hoc way if you have reward as your unified imperative.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3225.772,
    "end": 3248.168,
    "text": " that's not to say reinforcement learning models are not effective that again that the agent can't play chess or that the startup wouldn't work it's just to be clear that the the adequacy of a model in the world is an empirical question and especially in um a textbook the points are often being made in principle",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3258.813,
    "end": 3283.791,
    "text": " great well again thanks for all these questions i hope that we can um rejoin next week with some thoughts and resources and other questions added in there's just going to be a lot of fun ways to take these different questions",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3286.403,
    "end": 3302.556,
    "text": " we'll come back to them so thank you everyone and if you want um in the following hour you can come to the discord and we're just going to continue just talking and chilling about education so thank you and farewell",
    "speaker": "SPEAKER_03"
  }
]