[
  {
    "start": 2.36,
    "end": 4.202,
    "text": " All right, welcome back, everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6.764,
    "end": 8.907,
    "text": "We're in cohort seven, chapter seven.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10.588,
    "end": 16.334,
    "text": "So for some of us, this will be our first time on seven, others not, not so first.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 18.636,
    "end": 25.183,
    "text": "But where would anyone like to begin with a specific quote or question about seven?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 25.223,
    "end": 28.446,
    "text": "Or how did anybody take seven?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 28.566,
    "end": 30.308,
    "text": "Or where do they see seven in the book?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 43.012,
    "end": 51.644,
    "text": " Maybe I'll say I listened to the video of the last session, the evening session where Andrew talked about chapter seven.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 52.345,
    "end": 63.079,
    "text": "And so what interests me and I'm still struggling how to code things like free energy principle and how to, you know, how all the math works, et cetera.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 63.059,
    "end": 67.105,
    "text": " But and he did he did help explain that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 67.125,
    "end": 86.813,
    "text": "But what I got from these sections was that they progressively are looking at modeling different parts of mental life and showing that in each case, you know, the this apparatus can be used to model that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 87.314,
    "end": 89.978,
    "text": "And so in my case, like so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 89.958,
    "end": 107.781,
    "text": " basically like perceptual processing, like deducing an intended signal, the T maze with the rat, like decision-making planning, epistemic versus pragmatic, and then information seeking with the ISACAD, seeking position where you can get it, kind of yielding a streetlight effect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 107.761,
    "end": 126.647,
    "text": " and then learning a novelty so this synthetic worm exploring its environment changing the generative model and then finally like hierarchical or deep inference uh words and versus sentences putting that together on separate time scales so so what it seems like is that um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 126.897,
    "end": 153.647,
    "text": " you end up you know you you see oh i could use active inference for modeling this um and then um you do things of you know whatever sophistication you can and so i'm interested maybe in the opposite to say okay i'd like to develop a cognitive model i think that i'm gonna have like a continuous part and a discrete part like a procedural continuous mind and a discrete declarative mind",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 153.627,
    "end": 162.359,
    "text": " Then I'm going to maybe wonder how they discover critical points, navigate them, have a language of critical points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 163.321,
    "end": 180.865,
    "text": "I guess I'm just still learning about the active inference, but I'm trying to pick up on that connection between having a mental process or experience in life you're trying to model and then thinking, okay, where does prediction error come in?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 180.945,
    "end": 182.908,
    "text": "I guess that's probably what it's about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 182.888,
    "end": 208.812,
    "text": " that's where i'm at right now thank you awesome summary anyone else want to give some thoughts on seven or like a section or a quote or a figure or equation that they want to jump to um i mean figure 7.2 with the the plots about uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 209.787,
    "end": 212.231,
    "text": " The listener are a little confusing, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 213.714,
    "end": 217.14,
    "text": "I'm not sure what I'm seeing in the first column of panels there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 218.743,
    "end": 223.03,
    "text": "Maybe someone with some more insight could kind of walk us through what these panels are showing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 224.673,
    "end": 227.678,
    "text": "Yeah, it's a great point because this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 227.759,
    "end": 230.584,
    "text": " Chapter is the discrete setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 231.165,
    "end": 237.275,
    "text": "But then it's like, wait a minute, why are there continuous traces here with a discretized model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 238.177,
    "end": 245.97,
    "text": "So these are kind of like some modeling outputs from the SPM MATLAB scripts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 246.929,
    "end": 252.801,
    "text": " Um, but yeah, we, we can definitely get, and also it doesn't help that they're black and white.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 252.861,
    "end": 253.543,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 253.923,
    "end": 258.192,
    "text": "So it's a little bit like, well, but are we expected to, I mean, how can you trace?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 260.276,
    "end": 263.503,
    "text": "So I agree they're, they're not super informative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 265.981,
    "end": 268.223,
    "text": " Do you know at least what they're meant to be showing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 268.424,
    "end": 269.885,
    "text": "Oh, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 269.965,
    "end": 280.956,
    "text": "I could say the main idea, if you show the diagram there, if you go up to the diagram, the main idea is that there's an amateur musician playing some of the notes wrong.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 283.259,
    "end": 291.067,
    "text": "But if you go to the screen, someone's listening and they know what the melody should be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 291.107,
    "end": 294.03,
    "text": "It should just go done, done, done, done, and then done.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 294.01,
    "end": 309.205,
    "text": " So when the musician misplays it, which would be the lower right, they misplay it, but the person who has the idea of what the melody should probably be, they interpret it, well, it really was meant to be that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 309.285,
    "end": 312.492,
    "text": "It's the intended signal as opposed to the actual signal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 312.725,
    "end": 336.049,
    "text": " and so active inference is able to you know if you have a strong enough matrix where the pattern is so insistent that you know it's gonna survive the truth uh then um then it can model that so yeah okay and what's happening with these figures specifically so top left posterior probabilities about each note",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 336.029,
    "end": 338.854,
    "text": " So what's happening here is basically how confident are we?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 338.914,
    "end": 344.024,
    "text": "Each of these is a different note, but they can't be determined.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 344.805,
    "end": 357.548,
    "text": "So it's like in time point one, and also it doesn't help that it's kind of offset here, but it's sort of getting at there being like the most likely one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 358.422,
    "end": 379.182,
    "text": " is on the top so that's one with the highest posterior probability which is kind of selected if you only get one selection and then on the lower left is the the prediction errors over time so like you can see there is a higher prediction error when the incorrect note is played",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 379.87,
    "end": 380.791,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 381.812,
    "end": 383.514,
    "text": "But each line, though, is what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 383.914,
    "end": 386.216,
    "text": "It's opposed to your probability about a note?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 386.236,
    "end": 386.336,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 386.637,
    "end": 386.917,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 387.477,
    "end": 394.144,
    "text": "So it's like the latency, there's one spot for what's the true note being played.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 394.664,
    "end": 397.447,
    "text": "Like, we're going to receive a one-hot observation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 397.887,
    "end": 401.311,
    "text": "Like, we either hear note 1, 2, 3, or 4.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 402.552,
    "end": 408.898,
    "text": "That's coming in with a vector that looks like 1, 0, 0, 0 for the first note, like in this situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 409.57,
    "end": 413.497,
    "text": " Then we have a prior belief distribution over those four.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 414.298,
    "end": 424.795,
    "text": "So we could have a uniform belief over the four, 0.25, 0.25, 0.25, 0.25, or you could have 93, 3, 3.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 425.517,
    "end": 425.617,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 427.4,
    "end": 433.57,
    "text": "So then the relationship between the skewedness of your prior",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 434.09,
    "end": 440.697,
    "text": " And the attention to the sensory input is what dictates belief updating, which is when the prior becomes the posterior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 441.458,
    "end": 446.643,
    "text": "So in the extreme case of no attention, it's like the observation didn't even come in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 447.064,
    "end": 448.566,
    "text": "You just carry your prior forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 449.246,
    "end": 456.975,
    "text": "In the extreme case of total attention, you just basically update your posterior to whatever the observation was.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 457.755,
    "end": 460.198,
    "text": "And then everything in between is like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 461.984,
    "end": 464.648,
    "text": " attention-weighted belief updating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 465.569,
    "end": 471.358,
    "text": "And so there could be some value of attention where this is exactly what would be heard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 472.72,
    "end": 475.244,
    "text": "But in that point, you don't even need to do Bayesian statistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 475.785,
    "end": 478.368,
    "text": "You just do descriptive statistics on incoming information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 479.35,
    "end": 480.692,
    "text": "Yeah, or the converse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 481.153,
    "end": 491.468,
    "text": "So when you're looking at like the trace of your simulation, at each time point, you have the belief distribution over possible notes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 492.089,
    "end": 520.915,
    "text": " again even though it's only like one latent state dimension it's a distribution it's a categorical distribution over four options and so this is kind of like plotting the again we could replicate and color these lines to trace them more clearly but like we can see that in this s3 moment here's where it's sort of most mixish",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 521.215,
    "end": 544.995,
    "text": " there's just a little bit of weird stuff happening but to investigate it more we'd want to um run it but this is like this and that's why it's built up this way because again chapter six is kind of the recipe okay so just just to be clear so on the on the plot so like let's take one of these lines for example say that the top line um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 545.617,
    "end": 567.81,
    "text": " yeah that one right there that is not a curve so this is going to correspond to the probability of the posterior probability that it's I don't know note one and then there's a corresponding line at the bottom where that where those where they bifurcate right is that the so like uh like at the split around like 0.3 do you see that on the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 568.769,
    "end": 577.622,
    "text": " I'm really not sure because there's, there's a flat line at zero and one, which might just be like graphical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 577.942,
    "end": 578.323,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 578.343,
    "end": 579.224,
    "text": "I think it's just, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 579.405,
    "end": 584.772,
    "text": "I think then there's one, two, three, four, five, six, seven, eight notes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 584.792,
    "end": 585.093,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 585.514,
    "end": 587.076,
    "text": "Well, there's four notes, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 587.496,
    "end": 587.757,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 588.518,
    "end": 590.861,
    "text": "So what I'm not sure what the eight lines are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 590.881,
    "end": 598.152,
    "text": "So I, is it like, is it like one of the lines corresponds to the posterior probability that it's not the note that we're talking about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 599.684,
    "end": 625.05,
    "text": " know i i i'm not sure what it's what it's meant to be showing i agree and i'm not sure if though if there's eight notes like in the scale and they're like tending to zero here which is why at the end but then why why would you have high posterior probability belief in multiple notes at the end right i mean it looks like they're meant to be something to one so i think it it would have to be like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 625.672,
    "end": 630.147,
    "text": " Like what, like two of the, like the lines come in pairs basically, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 630.582,
    "end": 632.925,
    "text": " Because otherwise it's not summing to one, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 633.486,
    "end": 635.568,
    "text": "It's like an upper and a lower.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 635.628,
    "end": 639.753,
    "text": "And maybe they don't sum to one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 639.773,
    "end": 643.117,
    "text": "They don't sum to one if you look at the third column.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 643.878,
    "end": 647.162,
    "text": "They definitely don't sum to one, but then it's not a probability distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 647.402,
    "end": 652.689,
    "text": "What they look like, they look like error bounds, like from below and from above.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 652.769,
    "end": 657.855,
    "text": "Like, how confident are you that you hear what you're hearing, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 658.443,
    "end": 680.181,
    "text": " and somehow like with the third one the upper confidence just drops like uh i don't think you know we're not sure we can't be sure because there's a goof here so yeah again we should investigate it more i agree that this is not super clear also it could be if it's a posterior probabilities about each note",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 680.87,
    "end": 684.337,
    "text": " then it could be, there could be eight notes possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 684.377,
    "end": 694.678,
    "text": "But then it's like, at this moment, it's like there's an 80% chance it's note one, 70%.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 697.063,
    "end": 699.368,
    "text": "So that doesn't sum to one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 702.385,
    "end": 708.55,
    "text": " Because I was thinking, yeah, that's why I was thinking like, if you take that, that 80% example, there might be a corresponding line down below.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 708.59,
    "end": 710.672,
    "text": "That's around like the 20%.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 710.732,
    "end": 714.355,
    "text": "That's supposed to be like the, like the, not that note line, you know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 714.375,
    "end": 716.697,
    "text": "So it would sum to one, but is that not what it is?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 717.338,
    "end": 718.999,
    "text": "Yeah, I, I, I agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 719.039,
    "end": 721.221,
    "text": "And also just again, the fact that it's continuous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 721.702,
    "end": 721.962,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 722.302,
    "end": 724.224,
    "text": "And it has like different dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 724.404,
    "end": 727.587,
    "text": "It's just, it's part of the trace of mat lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 729.308,
    "end": 729.508,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 729.528,
    "end": 731.43,
    "text": "In the discreet setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 733.418,
    "end": 752.929,
    "text": " this doesn't really come into play but it's yeah i i agree like it's not very clear okay so i'm not alone in that that's good to know yeah and and it especially just because this kind of gradients",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 754.428,
    "end": 775.691,
    "text": " method, the continuous gradient sub time step scale gradients, which can happen, but that's not the calculations that are needed for a discrete calculation, which is just a Bayesian belief updating, which is just done in one shot in this case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 779.715,
    "end": 781.617,
    "text": "But yeah, like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 782.913,
    "end": 808.228,
    "text": " this chapter the first two examples are kind of like two of the core tools in thinking about perception and action models it's they're really really critical just to structurally understand that there's observations that are emitted from a latent state",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 808.327,
    "end": 830.115,
    "text": " There could be seven dimensions of S projecting onto one O, or it could be the other way around, any configuration, and there's some intermediator A that is able to take a latent state distribution and project it onto an observation distribution and vice versa.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 830.618,
    "end": 840.392,
    "text": " So that's the sort of bifacing nature of A, that it can be used in its generative capacity or in its recognition capacity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 841.514,
    "end": 844.358,
    "text": "You need a latent state prior to kick this whole thing off.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 845.68,
    "end": 850.947,
    "text": "And it's usually shown with three, but really it's just two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 852.289,
    "end": 856.896,
    "text": "It's really just, you kick it off and then you're only looking at one transition step",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 859.154,
    "end": 864.781,
    "text": " And then where you transition to becomes the prior distribution on the next moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 865.902,
    "end": 877.276,
    "text": "So even though there is a trace of observations, we don't model observations as causing successive sequential observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 878.378,
    "end": 884.385,
    "text": "We model changes happening in an unfolding latent space that emit observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 886.913,
    "end": 894.507,
    "text": " And then action enters the picture in choosing the transition operations in the latent state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 895.408,
    "end": 904.605,
    "text": "Like those are sort of key pieces that are at a very high structural level important for this type of modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 904.705,
    "end": 905.226,
    "text": "Anders?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 906.404,
    "end": 911.491,
    "text": " And those latent spaces are kind of states, I mean, are generally kind of imaginary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 911.691,
    "end": 912.553,
    "text": "Like it's right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 912.573,
    "end": 926.252,
    "text": "I mean, like that's partly it's usually not necessarily like exactly real, but it's more like that's what's either modeled by the modeler or modeled by the organism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 927.076,
    "end": 930.321,
    "text": " but is that basically a good way to look at it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 930.361,
    "end": 932.885,
    "text": "Like they're not intended necessarily to be real.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 933.305,
    "end": 935.188,
    "text": "Let's say it's a temperature situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 936.23,
    "end": 944.442,
    "text": "The agent's model is like the true underlying temperature, but it's the agent's model of the true temperature and the observations they're getting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 945.583,
    "end": 954.737,
    "text": "So it's not the generative process, how it's described in the book, of like the quote, real temperature in the simulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 955.19,
    "end": 977.468,
    "text": " so yes this is like these are all variables within the agent's cognitive model and then there's another which is also our model because we're modeling the agent it's like a okay we're both modeling together as friends yes and that's that is brought up in chapter nine that's the metabasian perspective",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 978.19,
    "end": 993.347,
    "text": " which is we are outside of the agent's generative model, proposing that as a map of a cognitive territory, which is itself mapping a reference outside of itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 995.149,
    "end": 1007.202,
    "text": "But there's another degree of modeler freedom in saying, well, there could be aspects of the environment of the agent that the agent doesn't even know about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1008.38,
    "end": 1011.724,
    "text": " So that and I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1014.667,
    "end": 1020.073,
    "text": "I think that that's a key thing for discrete language, like how why discrete language works at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1020.113,
    "end": 1034.59,
    "text": "It's because different people modeling, you know, basically a similar situation are going to come up with similar answers, even though they're, you know, even though those latent states are all not real, but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1034.57,
    "end": 1037.354,
    "text": " but they're real in the sense that you're going to get similar answers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1037.734,
    "end": 1041.519,
    "text": "And they're going to get discrete answers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1041.86,
    "end": 1044.423,
    "text": "So you found the similar critical points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1044.964,
    "end": 1049.25,
    "text": "So I think that's the wonder of discrete communication.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1051.894,
    "end": 1052.234,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1053.556,
    "end": 1064.07,
    "text": "That tension with continuous discrete comes up in so many guises, both in the treatment of time and in the treatment of the state spaces themselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1065.164,
    "end": 1074.438,
    "text": " So here we have in chapter seven, basically a focus though with some spice added, discrete state space, discrete time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1075.46,
    "end": 1082.852,
    "text": "So again, confused by these traces, there's not necessarily differentiability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1083.873,
    "end": 1086.818,
    "text": "There's just snapshot-based discrete updating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1087.619,
    "end": 1092.707,
    "text": "In the continuous state space, but the advantage of the discretization",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1092.873,
    "end": 1112.248,
    "text": " is first off it's very easy to understand the computational resourcing and when it comes to action selection it's easy to roll out counterfactuals like chess trace search chapter eight brings in the continuous time and continuous state space mathematics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1120.75,
    "end": 1127.166,
    "text": " But yeah, we can go to another section or we can look at the specification in PyMDP.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1129.39,
    "end": 1138.219,
    "text": " Um, or, or I wanted to ask, uh, is there an open source, like a version of MATLAB, like Octave, will that open work these files or not?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1139.26,
    "end": 1145.626,
    "text": "There's a standalone download of SPM that runs without a MATLAB license.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1146.487,
    "end": 1151.211,
    "text": "There is Octave, which is like a patched open source MATLAB.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1152.453,
    "end": 1154.875,
    "text": "I've never run SPM in Octave.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1156.795,
    "end": 1170.177,
    "text": " So that's why in the sort of post 2018-ish period, there was movement just away from MATLAB, but it still is used by many people and many models that are in there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1170.197,
    "end": 1182.077,
    "text": "But of course, any language can emulate any language, but using Python and Julia,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1183.087,
    "end": 1185.09,
    "text": " and a lot of other languages.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1185.111,
    "end": 1192.103,
    "text": "It's taking us closer more to the data science pipelines that are in the other packages that are relevant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1193.726,
    "end": 1201.018,
    "text": "So I would say the best place to look for this is in the PyMDP documentation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1203.783,
    "end": 1206.107,
    "text": "That's why it's called PyMDP.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1206.644,
    "end": 1215.12,
    "text": " PyMDP is not trying to be a generic model of all base graphs, kind of in the spirit of Rx and Fur.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1216.964,
    "end": 1223.016,
    "text": "The agent is literally defined almost exactly according to the textbook.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1223.036,
    "end": 1225.42,
    "text": "The same TMA's situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1227.684,
    "end": 1229.007,
    "text": "But this is exactly...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1230.725,
    "end": 1234.49,
    "text": " how it's laid out with agents and the ABCDE.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1235.571,
    "end": 1236.512,
    "text": "It just goes through them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1238.034,
    "end": 1243.801,
    "text": "Categorical distribution on A. B matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1244.802,
    "end": 1246.124,
    "text": "That's how you encode the movement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1247.545,
    "end": 1248.026,
    "text": "Preference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1250.809,
    "end": 1252.311,
    "text": "Prior and hidden states, D.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1259.058,
    "end": 1266.209,
    "text": " And here, ABCD are specified.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1268.372,
    "end": 1274.721,
    "text": "And then when you, all there is to run, and POMDPs have been around for decades.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1276.043,
    "end": 1280.45,
    "text": "They're not always fit using a variational or an expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1283.434,
    "end": 1285.858,
    "text": "But this is basically what the loop is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1288.201,
    "end": 1294.55,
    "text": " You get the observation from, in this case, from the location in the grid world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1298.416,
    "end": 1300.479,
    "text": "Belief updating on the latent state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1300.559,
    "end": 1302.842,
    "text": "What is my true location occurs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1303.703,
    "end": 1311.434,
    "text": "So that's inference of the latent states given the observation index and the A matrix and your prior distribution on latent states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1312.836,
    "end": 1313.938,
    "text": "So that's belief updating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1315.184,
    "end": 1319.332,
    "text": " That's the sense-making, that's the perception, that's the inbound, that's the music listening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1320.334,
    "end": 1324.443,
    "text": "Then there's going to be action selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1326.747,
    "end": 1331.978,
    "text": "First, expected free energy is calculated for each possible action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1332.65,
    "end": 1334.414,
    "text": " So that's for the given time horizon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1335.196,
    "end": 1348.448,
    "text": "It's going to ask if I were to do that sequence of events, whether it's just one action, like one time step planning, or whether it's multiple time steps of planning in the discrete case,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1349.575,
    "end": 1359.368,
    "text": " Each of those chains of actions will be unrolled in terms of their expected effects on latent states via the B matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1360.149,
    "end": 1364.374,
    "text": "And then those get unfolded into the expected observation distributions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1365.396,
    "end": 1371.904,
    "text": "Those expected observation distributions are evaluated in terms of their epistemic and pragmatic value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1372.525,
    "end": 1375.75,
    "text": " Pragmatic value, how well would those observations align with my preferences?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1376.492,
    "end": 1380.418,
    "text": "Epistemic value, what would be the expected information gain from those observations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1381.46,
    "end": 1388.572,
    "text": "Those scores constitute the G vector, which lines up with your policy options.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1390.054,
    "end": 1394.922,
    "text": "Those scores in G, which don't have like an intrinsic meaning,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1396.032,
    "end": 1401.299,
    "text": " are used to reweight the policy prior into the policy posterior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1402.22,
    "end": 1419.023,
    "text": "So policy prior is what you're believing that you're apt to do before the observation gets reweighted according to expected free energy values relatively and renormalized with a softmax so that it stays as a probability distribution over actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1421.026,
    "end": 1425.432,
    "text": "One action is chosen from the policy posterior distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1427.403,
    "end": 1429.506,
    "text": " That is going to be the selected action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1430.687,
    "end": 1440.639,
    "text": "And then at the end of this cycle, it kind of clicks ahead to the next latent state belief.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1441.36,
    "end": 1448.068,
    "text": "And then that will be used here in the next cycle as beliefs about states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1452.214,
    "end": 1454.997,
    "text": "So that's one procedural way",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1455.196,
    "end": 1461.104,
    "text": " to have the sort of imperative style for describing a perception action loop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1464.689,
    "end": 1467.653,
    "text": "But there's other orderings that could be possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1469.716,
    "end": 1472.239,
    "text": "Like you could do different orderings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1472.6,
    "end": 1473.381,
    "text": "I'll just say that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1474.723,
    "end": 1477.406,
    "text": "So that's why there's a lot of degrees of modeler freedom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1479.309,
    "end": 1484.376,
    "text": "Because this is not, it's not like this is the only way to model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1485.368,
    "end": 1509.469,
    "text": " the handling and that's even within this simple single observation single action setting but that's how it works in pi mdp which is basically what is described in the textbook nice that's super helpful um what did you mean by other orderings like orderings of what um like there's um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1511.339,
    "end": 1518.93,
    "text": " This is kind of a classic, like observation comes in, update beliefs, choose an action based upon the updated beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1519.851,
    "end": 1531.828,
    "text": "But for example, you could have a time step situation where it's like at the beginning of each time step, the agent chooses an action based upon what it believes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1532.568,
    "end": 1538.175,
    "text": " and then gets an observation and uses that in the next time step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1538.916,
    "end": 1539.197,
    "text": "I see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1540.058,
    "end": 1548.269,
    "text": "So that would be, you know, and then especially if you're dealing with in this example, there's basically only two operations happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1549.45,
    "end": 1553.135,
    "text": "The state inference and the policy inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1553.155,
    "end": 1557.902,
    "text": "So those are kind of the two main categories of orderings, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1557.922,
    "end": 1558.803,
    "text": "Which one do you update first?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1558.843,
    "end": 1561.967,
    "text": "And it totally makes sense to update the observation first.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1563.533,
    "end": 1577.734,
    "text": " as you get more kinds of variables in play and more cognitive mechanisms, there become more ways to imperatively specify the ordering of the loop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1579.536,
    "end": 1584.023,
    "text": "Like if there was a read and write to memory, if there was an attention element,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1585.167,
    "end": 1588.712,
    "text": " if there was a policy search, all these different features.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1590.013,
    "end": 1611.04,
    "text": "And then what's really interesting and what kind of returns the focus to the high road and the low road is like the free energy principle is describing the physics of flows across these graphs, not in discrete time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1612.437,
    "end": 1621.987,
    "text": " but it can be discretized, but as this sort of unfolding simultaneous flow in terms of belief updating on this graph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1623.95,
    "end": 1636.183,
    "text": "So, and the way RxInfer kind of aims to handle that is with reactive message passing sort of on-demand, just-in-time node updating,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1636.282,
    "end": 1639.726,
    "text": " But even then, that's not happening continuously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1639.766,
    "end": 1649.116,
    "text": "It could be happening rapidly or infrequently, but it is happening in, especially on digital computers, at some point, everything is gonna be discretized in a way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1651.118,
    "end": 1662.711,
    "text": "So figuring out what the duty cycle is for the agent, and that's where you get like the TOTE,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1663.147,
    "end": 1666.855,
    "text": " Like, this is sort of an older, like, test, operate, test, exit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1668.639,
    "end": 1679.862,
    "text": "This is one, like, you know, whatever it sort of seems like esoteric or strange to be talking about the ordering of perception action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1679.882,
    "end": 1682.067,
    "text": "It's like, there's tote.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1683.295,
    "end": 1687.78,
    "text": " And then of course there's the OODA loop, which is another discretized way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1687.84,
    "end": 1692.325,
    "text": "And that has been connected with active inference as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1692.405,
    "end": 1712.087,
    "text": "So just when you get down to building on the low road, which is what chapter seven and eight and everything, the whole second half of the book is about, you get down to like these details about which variables are exactly undergoing which operations and which orderings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1713.113,
    "end": 1740.572,
    "text": " that's not something that the framework is opinionated on but it is something that's required to have operating code yeah if so um i remember that like one of the central that's well to me anyway at the time that i read it it seemed like a central tenant uh was that what active inference sort of does was is is that it um sort of like flips the way that an agent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1740.89,
    "end": 1768.888,
    "text": " uh perceives the world in that instead of waiting for the observation to come in and then making a prediction about what they're seeing they make a prediction first about what they think they're going to see right and then they take the observation and it's the prediction error that like kind of cascades through the system right so is is that like a different order that you're talking about or is that uh kind of set in the way that it works that question makes sense yeah yeah totally so like um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1770.337,
    "end": 1794.117,
    "text": " a few ways to go about this if you have a sequence of alternating you know belief updating and then action updating you know or latent state belief updating action state updating at some point which one happened first right just alternating and so it it doesn't really matter but then when you think about the injection of an observation that's kind of what we're just exploring like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1794.755,
    "end": 1824.711,
    "text": " observation belief action observation belief action was how the pi mdp had it as opposed to observation action you know so once you get to three or more you do get different sequential possible orderings as well as at the level of the simulation where okay now we have the like for example if we look at the open ai gym environment so this is a discrete environment where every time step",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1825.417,
    "end": 1852.774,
    "text": " um whatever it's called now but every time step like there's getting gets an action sends back so it's a kind of call and response style but when it's one agent one in one environment you could do that or you could have it send two and then one back or something like that but um then you kind of point to like this idea that that the agent is is like action as fulfilled prediction",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1858.238,
    "end": 1861.162,
    "text": " Planning proceeds by inferring an action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1862.083,
    "end": 1862.283,
    "text": "What?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1863.585,
    "end": 1864.026,
    "text": "The agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1865.628,
    "end": 1867.29,
    "text": "It feels in charge of nothing, but.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1868.311,
    "end": 1871.535,
    "text": "There's still like, I can't understand you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1874.219,
    "end": 1879.866,
    "text": "Your audience putting out a little bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1882.029,
    "end": 1884.853,
    "text": "Um, the, uh, the, uh, the organ.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1885.998,
    "end": 1911.347,
    "text": " is in charge by making predictions all the time like even if it knows nothing then it predicts that it knows nothing but typically it knows a lot about its environment and it's uh you know that that that knowledge is stable and just it's reporting minor changes to that you know within that environment yes like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1913.588,
    "end": 1924.092,
    "text": " Yes, there's the sort of like inner agency of like, it's not just taking punches from the environment, even just when it comes to sensemaking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1924.132,
    "end": 1927.159,
    "text": "So just thinking about the first 7.1 example,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1928.101,
    "end": 1934.569,
    "text": " each observation is meeting what can be thought of as like an active prediction, but it's the prior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1934.829,
    "end": 1941.437,
    "text": "The prior is being brought to the table and meeting the observation, and that is the Bayesian updating moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1942.178,
    "end": 1950.448,
    "text": "So there's that element, which is, it's not just processing inbound information, but there's this sort of active listening approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1951.129,
    "end": 1954.733,
    "text": "And then that goes further when we actually consider",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1955.81,
    "end": 1962.378,
    "text": " overt action, especially action in terms of what is expected to be perceived.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1963.66,
    "end": 1969.667,
    "text": "And then the agent is unsurprised when the consequences of action are what it expects to be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1970.548,
    "end": 1975.274,
    "text": "Surprise enters when the consequences of action are not what was expected.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1977.216,
    "end": 1981.041,
    "text": "So that kind of centers action in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1983.13,
    "end": 1988.358,
    "text": " setting what is the envelope of observations that would or wouldn't be surprising.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1990.261,
    "end": 2006.525,
    "text": "But because it's so general and we describe rocks and other kinds of abstract boundaries, it's hard to personify it or apply too much of a psychological lens to the generic case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2006.545,
    "end": 2008.648,
    "text": "But in cases that are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2009.827,
    "end": 2023.752,
    "text": " able to have that kind of psychological projection that's exactly that's how we compose expressions in the active inference ontology to make structured models for those phenomena",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2027.663,
    "end": 2041.303,
    "text": " And one difference that comes up in cognition, I think that's very much the case where you're always predicting, so you can always be surprised and you can always deal with that surprise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2041.804,
    "end": 2046.01,
    "text": "But in the case of emotion, you have expectations",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2045.99,
    "end": 2051.22,
    "text": " And so if those aren't met, you may feel surprised or if they're met excited or sad or happy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2051.881,
    "end": 2058.193,
    "text": "But in the case of, I would say, like fright or disgust, you refuse to make expectations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2058.313,
    "end": 2062.641,
    "text": "You know, there's certain things that happen that you refuse to expect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2062.721,
    "end": 2067.971,
    "text": "And so then somehow you're dealing with a different situation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2068.692,
    "end": 2069.854,
    "text": "It's a different game.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2075.639,
    "end": 2076.18,
    "text": " That's interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2076.2,
    "end": 2078.105,
    "text": "What do you mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2078.125,
    "end": 2089.896,
    "text": "You refuse to make an expectation in cases where what we're like, well, this is this is a simple, this is a simple model of emotion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2089.916,
    "end": 2091.64,
    "text": "But if",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2092.362,
    "end": 2095.086,
    "text": " I have a theory, you know, and it's confirmed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2095.666,
    "end": 2097.469,
    "text": "I'm excited, you know, if it's about the real world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2097.97,
    "end": 2100.213,
    "text": "If it's not confirmed, I'm surprised.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2100.233,
    "end": 2100.894,
    "text": "Oh, what happened?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2102.235,
    "end": 2110.827,
    "text": "But if things matter to me, then it's not just excited, surprised, or I'll be happy or I'll be sad, you know, I may be devastated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2110.807,
    "end": 2136.342,
    "text": " but if something happened on the outside and i didn't expect it because it was too fast or too weird or just too some kind of i just didn't want to have that expectation those are the things that are frightening you see so those are or vice versa if it's on the inside and i just refuse to make certain expectations or they're just too sudden or they're too weird uh those are the things that are disgusting",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2136.727,
    "end": 2143.254,
    "text": " So that's an emotional model, but it says that in the emotional world, it works a bit different than in the cognitive world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2147.038,
    "end": 2165.957,
    "text": "Yeah, some of the citations and work on emotions and exactly that, like when the rate or type of change of a primary model, that is where certain emotional phenomena could be modeled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2166.157,
    "end": 2187.99,
    "text": " And, but again, how you actually, what phenomena you choose, like for example, if we were doing a body temperature example, it's like maybe if the first derivative of surprise through time, or like the time rolling average of surprise is low, even if our body temperature is going up and down, our anxiety level is low.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2188.971,
    "end": 2191.675,
    "text": "But then if there's rapid changes,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2192.262,
    "end": 2206.623,
    "text": " there's a second level model or a model that's taking it as observation, the first or the second derivative of the changes in surprise and body temperature, that that could be associated with an anxious response.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2208.426,
    "end": 2212.532,
    "text": "And maybe to say like active inference is active by nature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2213.035,
    "end": 2241.692,
    "text": " So in these situations, you may refuse to have a generative model, you know, of certain kinds, because that's not the generative model you want to live by, you know, or so, then when things go outside that you just resolve to passive inference, you just throw up, you just throw up, or you just, you just lay down and die, or just, you know, you go into some kind of reflex modes where there is no generative model, you're just acting, you know, passively passive inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2244.102,
    "end": 2246.689,
    "text": " I don't know if there's no generative model in that situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2246.709,
    "end": 2260.086,
    "text": "A person looking at that in an observation setting, it's not like just because a squirrel has a flight or fight, it doesn't cease to have a generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2262.175,
    "end": 2289.364,
    "text": " um the well that's like no i guess so the thesis would be that in certain situations you don't need a generative model you just need to act and you just act as your program you don't need to learn you're just going to you know you're just going to but i think that is still a different model right it's just that you have maybe a different like a like like a refined or um confined set of actions that you could take as a result of whatever you're perceiving right",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2289.833,
    "end": 2297.146,
    "text": " Yeah, no, like, for example, like death, like, I don't have a model of my death, I don't think about it, it's not healthy to think about death, you know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2297.867,
    "end": 2301.293,
    "text": "So typically, like, you would not want to model certain things like that at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2301.373,
    "end": 2302.235,
    "text": "You just don't touch them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2302.816,
    "end": 2312.753,
    "text": "They just know that you do have a, I don't know, like a state that is a reaction to death or thinking about death or in fact,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2313.053,
    "end": 2326.455,
    "text": " in your case the state would be not thinking about death right exactly so if i'm that's still part of your generative model i think well what i'm trying to say is that there's something more to life than just a generative model right",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2327.262,
    "end": 2328.524,
    "text": " There's the territory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2329.265,
    "end": 2331.368,
    "text": "I mean, this is just there's the territory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2331.488,
    "end": 2339.86,
    "text": "This is the thing, ethology, behavioral scientific approach to modeling cognitive systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2340.0,
    "end": 2350.435,
    "text": "But it's like, yes, there's an infinite number of points that are sort of corollary, like that maps are not territories restated in any number of important ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2352.659,
    "end": 2361.829,
    "text": " like the structure of the observations coming in from the thermometer does not have to be anything having to do with what the cognitive model of the agent as set up by a given individual is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2364.793,
    "end": 2378.008,
    "text": "And that's sort of the refuge of the instrumentalists because it's like, here's our proposal for how to reduce our uncertainty about this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2380.503,
    "end": 2381.905,
    "text": " Do you have another tool?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2382.987,
    "end": 2385.39,
    "text": "What other tools are in trade-offs with this one?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2388.835,
    "end": 2405.7,
    "text": "Whereas the realist is actually looking to wrestle on that more ontological reality mapped dimension about things as they are rather than more of the statistical",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2407.57,
    "end": 2435.721,
    "text": " approach to modeling perception and behavior as perceived which is why but that's part of this fascinating view from the inside view from the outside dialectic because people will bring up first-person phenomenological experiences and there's so much work on neurophenomenology and cognitive modeling from first-person perspective whereas in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2436.832,
    "end": 2445.843,
    "text": " behavioral science and entomology and things like that, it's not waiting for some kind of first-person report.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2451.429,
    "end": 2456.715,
    "text": "And I think there's a dialogue between the continuous mind and the discrete mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2456.755,
    "end": 2460.78,
    "text": "There's a procedural continuous mind that just does its thing reflexively.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2461.351,
    "end": 2464.175,
    "text": " But it looks... They're helping each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2464.335,
    "end": 2467.6,
    "text": "And so there's this discrete mind that's managing this generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2467.681,
    "end": 2477.195,
    "text": "And it basically is able to... And somehow they're able to do... But sometimes the discrete mind just lets go and it just goes into continuous mode wherever things tumble.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2479.639,
    "end": 2482.303,
    "text": "Well, that's sort of what is laid out here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2483.204,
    "end": 2485.287,
    "text": "But this whole thing is a generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2485.307,
    "end": 2490.615,
    "text": "So it's not like there's any utility as far as I'm seeing it just to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2490.764,
    "end": 2514.932,
    "text": " district the whole thing is the generative model and now whether it's done in a more habitual fashion or it engages in a discretized tree-based policy rollout or some other proposal for like recurrent switching between different modes however it's accounted for that accounting is the generative model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2518.895,
    "end": 2529.681,
    "text": " but it can engage in completely, you could say, well, I have a generative model where at the top level there's a switch and it's counting apples and then it switches to counting oranges.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2530.893,
    "end": 2545.286,
    "text": " I guess the presumption that I'm making is I'm drawing the line not between an organism and its environment, but between the organism's internal mind and then it's whatever mind it has that represents that environment, like the unconscious.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2545.346,
    "end": 2548.649,
    "text": "So on a human being, like it'd be the conscious and the unconscious, there's a gap.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2548.669,
    "end": 2551.291,
    "text": "That's what's being modeled with all of this framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2552.652,
    "end": 2559.398,
    "text": "So the unconscious is really just part of the world, so to speak, and you're trying to talk to your unconscious.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2560.373,
    "end": 2586.617,
    "text": " manager you know relate to your unconscious perceive it and and act on it yeah like the b matrices in the teammates example in chapter seven it's like these are the mouse's beliefs about location contingent upon it doing what and then that in this case gets just sort of faithfully enacted by the environments",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2586.749,
    "end": 2588.25,
    "text": " but that part is not emphasized here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2589.031,
    "end": 2606.247,
    "text": "But then there's situations like the windy grid world, which is a classic grid world kind of variance where you have that kind of up, down, left, right movements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2607.728,
    "end": 2614.174,
    "text": "And then there's wind that blows it like zero or one or two cells.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2614.357,
    "end": 2636.365,
    "text": " in that situation or icy grid world where it slides occasionally so but but the agent's model might not it might be like whoa now i'm over here so it doesn't even know about wind or ice it's just like oh but i want to expect to be here i expect to get information if i go here but yes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2637.425,
    "end": 2639.467,
    "text": " So that's something in the triangle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2639.487,
    "end": 2643.712,
    "text": "I talked about the triangle language, geometry language I'm doing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2643.752,
    "end": 2659.529,
    "text": "And then I realized a good way to do it that's in this spirit is that the participant, the agent or the triangle creator, the one who's looking for these triangle centers, they only understand triangles in terms of integer lengths.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2659.75,
    "end": 2662.032,
    "text": "So it's basically like rational numbers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2662.012,
    "end": 2664.156,
    "text": " So they don't have a concept of the real number.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2664.718,
    "end": 2669.087,
    "text": "So they're trying to find the center, which may not exist as a rational number.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2669.287,
    "end": 2674.578,
    "text": "And so that's the kind of like it's already in a paradoxical situation where it's trying to do something basically impossible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2674.598,
    "end": 2678.607,
    "text": "So it'll do it as good as it can, and then it'll move on to another task, let's say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2679.168,
    "end": 2679.869,
    "text": "So that's a nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2680.29,
    "end": 2683.176,
    "text": "So it's nice that it can enter into the model that way, naturally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2684.017,
    "end": 2708.421,
    "text": " oh yeah like let's just say there was a super sharp preference for to land on the number 10. um and but you had the policy you could only move up or down by 50 to 80. so you were just sort of like overshooting and then undershooting overshooting and undershooting um and then you could have another level of the generative model that was about task switching",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2708.401,
    "end": 2725.358,
    "text": " And there's different ways to do task switching or like going back to the the the playing dead example, like you can either have stay as one of the actions in a one layer model up, down, left, right, stay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2726.639,
    "end": 2732.685,
    "text": "Or you could have a two level model where the top one is a binary decision to move or stay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2733.406,
    "end": 2737.75,
    "text": "And then within move, there's four actions like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2738.843,
    "end": 2740.285,
    "text": " Those are all different maps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2741.607,
    "end": 2747.896,
    "text": "And again, which map you make of the city depends on what you want to do with it, who's funding you, all these different kinds of questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2749.298,
    "end": 2759.432,
    "text": "What cognitive model you make is contingent upon what you want to account for, what you do and don't want to be surprised by.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2759.452,
    "end": 2766.842,
    "text": "And especially when it comes to these cognitive functions and modeling them, like...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2767.953,
    "end": 2786.502,
    "text": " where these models sit from mainly taking in data even though the in in theory these are totally just two two directions in the same window especially when we get to chapter nine with the empirical data analysis",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2786.752,
    "end": 2797.977,
    "text": " But sometimes the model is set up to be taking in data and the modeler is interested in the parametric estimates at the ends.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2799.796,
    "end": 2813.249,
    "text": " So to use this framework to model, let's say, human experience, whatever I would find interesting, I think it seems like the crucial thing is to discover, well, what is the prediction and what is the error?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2814.27,
    "end": 2820.216,
    "text": "Because is that how I have to think in terms of in order to apply this active inference framework or are there other concepts I have to worry about?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2824.28,
    "end": 2825.922,
    "text": "You don't have to worry about anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2826.931,
    "end": 2829.394,
    "text": " I want to worry about something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2830.336,
    "end": 2834.501,
    "text": "I think it's relevant to look at if we're thinking in discrete time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2835.042,
    "end": 2848.18,
    "text": "But figure 4.3 shows the isomorphic nature of the continuous and the discrete time generative model kind of meta family units.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2848.75,
    "end": 2859.585,
    "text": " Again, these can be nested, composed, concatenated, all those kinds of category, theoretic operations are possible, but this is the motif, which is like, what is the unfolding state space?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2861.288,
    "end": 2865.534,
    "text": "What observables are sloughed off of that unfolding state space?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2866.695,
    "end": 2870.1,
    "text": "And then what are the interventions in that unfolding state space?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2872.645,
    "end": 2878.06,
    "text": " So there's sort of simplification cases where it's like, there's only one action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2878.742,
    "end": 2883.154,
    "text": "So just it unfolds according to just a Markov chain without policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2883.194,
    "end": 2884.798,
    "text": "It's just a Markov process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2885.42,
    "end": 2900.607,
    "text": " And then you go, okay, well, what if there were multi-way options, like in the sort of Wolfram computing ontology and the multi-way compute where there's like different bifurcating possibilities from a given position, then it's a Markov decision process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2901.368,
    "end": 2909.503,
    "text": "And then if the observable is the chain unfolding itself, you don't need a partial observability elements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2909.618,
    "end": 2930.597,
    "text": " then if you want to model sensory ambiguity or some kind of degenerate or or non-linear or ambiguous mapping between the true unfolding dynamics and observables to a given measurement maker then you need something like an a matrix",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2934.07,
    "end": 2938.596,
    "text": " So if I could just interject there for a moment, because there's not much time left, and I have to go at 9.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2939.157,
    "end": 2943.202,
    "text": "Speaking of the A matrix, can we go to figure 7.4?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2944.563,
    "end": 2946.346,
    "text": "Yeah, these matrices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2947.567,
    "end": 2953.275,
    "text": "They're not too complicated, but maybe we can just kind of go through each one and just be very clear about what they are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2953.996,
    "end": 2960.344,
    "text": "So the caption, anyway, says... I think it's a typo in the caption, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2962.086,
    "end": 2962.947,
    "text": "It says...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2964.074,
    "end": 2973.222,
    "text": " It says each element of these matrices is the probability of the outcome illustrated at the end of the row, conditioned on the context being one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2974.203,
    "end": 2977.045,
    "text": "And being the location indicated by the row.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2979.487,
    "end": 2982.089,
    "text": "So there should be the context being one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2982.129,
    "end": 2987.414,
    "text": "Here's where it would have been clear if it was written as a one, but there's two contexts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2987.834,
    "end": 2990.356,
    "text": "This is context one with the food on the right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2991.077,
    "end": 2993.659,
    "text": "This is context two with the food on the left.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2995.411,
    "end": 3007.066,
    "text": " So here, flipping back and forth, we see basically, we see these two are flipping and this 298 is flipping.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3007.967,
    "end": 3011.251,
    "text": "So basically there's two A matrices in this example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3012.533,
    "end": 3014.495,
    "text": "There's what context?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3016.418,
    "end": 3017.72,
    "text": "What context is one in?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3019.242,
    "end": 3020.423,
    "text": "That's A2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3021.382,
    "end": 3024.726,
    "text": " And then there's what location am I in?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3025.387,
    "end": 3026.268,
    "text": "That's A1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3028.251,
    "end": 3029.433,
    "text": "Okay, so that's confusing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3029.453,
    "end": 3033.258,
    "text": "I thought the context meant what the rat saw the queue to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3034.9,
    "end": 3035.18,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3035.401,
    "end": 3036.021,
    "text": "The queue to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3036.142,
    "end": 3036.422,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3036.862,
    "end": 3038.565,
    "text": "The context is where this thing actually is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3039.025,
    "end": 3043.471,
    "text": "There's kind of two scenarios, two actual scenarios.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3044.613,
    "end": 3044.733,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3044.753,
    "end": 3048.638,
    "text": "When the context is unknown, that's this one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3050.474,
    "end": 3054.999,
    "text": " Okay, so let's read off one of these columns just so that we can understand it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3055.239,
    "end": 3062.387,
    "text": "So like in cell one and A2, this is the probability that the rat is going to be in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3064.129,
    "end": 3065.571,
    "text": "So I think it's a typo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3065.591,
    "end": 3069.455,
    "text": "So it should be that the rat is going to be in the state indicated by the column, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3072.098,
    "end": 3076.843,
    "text": "Given that there's no context or that what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3077.924,
    "end": 3079.146,
    "text": "If I'm in the start location.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3079.846,
    "end": 3080.447,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3080.714,
    "end": 3083.298,
    "text": " I am sure that I don't know the context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3084.059,
    "end": 3084.98,
    "text": "Don't know the context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3085.0,
    "end": 3085.1,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3088.585,
    "end": 3091.089,
    "text": "If you're in the bottom location.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3091.349,
    "end": 3094.533,
    "text": "I'm going to find out what the context is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3098.84,
    "end": 3099.921,
    "text": "So...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3102.719,
    "end": 3104.382,
    "text": " Then you do know the context then.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3104.462,
    "end": 3114.36,
    "text": "Yeah, that gets injected in when it does go there, when it discovers R. So then when it goes to the bottom, this is where A1 comes into play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3114.921,
    "end": 3115.041,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3115.062,
    "end": 3120.692,
    "text": "When I get to the bottom in the context one, this is the difference between these two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3122.175,
    "end": 3122.275,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3122.295,
    "end": 3125.2,
    "text": "Then I find out that the Q is R.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3128.437,
    "end": 3134.624,
    "text": " Okay, so it's the probability that you find out that the cues are when you're, when you, hold on, sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3134.644,
    "end": 3135.745,
    "text": "This is the observation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3135.765,
    "end": 3141.691,
    "text": "And each observation, we're getting two features from the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3141.811,
    "end": 3142.692,
    "text": "This is the no food.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3144.154,
    "end": 3146.677,
    "text": "Sorry if I said that this was the no context earlier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3146.997,
    "end": 3149.179,
    "text": "This is neither food nor not food.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3149.86,
    "end": 3150.501,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3150.521,
    "end": 3151.682,
    "text": "This is yes for food.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3152.263,
    "end": 3153.364,
    "text": "This is no for food.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3155.099,
    "end": 3159.325,
    "text": " So starting position, I'm sure I'm in the starting position and there's no food.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3160.106,
    "end": 3168.036,
    "text": "Bottom, I'm sure that is telling me the Q is R and there's no food.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3172.482,
    "end": 3175.767,
    "text": "Okay, so let's go to row two because that's where something interesting is happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3176.087,
    "end": 3176.468,
    "text": "This one?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3176.808,
    "end": 3180.313,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3180.814,
    "end": 3181.194,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3181.294,
    "end": 3184.178,
    "text": "My belief is that if I go left...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3185.474,
    "end": 3192.044,
    "text": " that there will be a 2% chance of finding food and a 98% chance of no food.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3194.026,
    "end": 3195.749,
    "text": "If I go right, vice versa.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3197.532,
    "end": 3202.639,
    "text": "Right, but it's all given that the Q is on the right, that the Q points to the right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3202.822,
    "end": 3224.847,
    "text": " yes so so does the rat know that the q points to the right yes so in this case it would have had to have learnt that that r means this and l means this okay so we assume so i think that's what i was missing so it's already been trained it's already been trained on the kit",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3225.451,
    "end": 3225.992,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3226.072,
    "end": 3226.913,
    "text": "See, I didn't, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3226.933,
    "end": 3231.017,
    "text": "I thought I had to like go down first and get the cue and then make a decision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3231.498,
    "end": 3233.46,
    "text": "There's no learning in this model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3235.042,
    "end": 3235.342,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3235.362,
    "end": 3239.467,
    "text": "So it just, so we assume that the rat has seen or knows or learned the cue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3239.507,
    "end": 3241.008,
    "text": "Exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3241.028,
    "end": 3244.492,
    "text": "And this is the whole, you know, journey.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3245.133,
    "end": 3252.782,
    "text": "Are we studying the learning acquisition of the cue or are we just looking at forward inference on a behavioral trial given learning?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3253.202,
    "end": 3253.883,
    "text": "Given learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3253.903,
    "end": 3254.243,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3254.263,
    "end": 3254.884,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3255.134,
    "end": 3277.243,
    "text": " cool okay um thanks all again like there was daylight savings in some places but the place of reference look at the utc time in the coda look at the calendar events the utc time is not changing the calendar events don't change so that's where you'll see everything so good thank you thank you bye",
    "speaker": "SPEAKER_01"
  }
]