[
  {
    "start": 6.933,
    "end": 8.275,
    "text": " Alright, hello, welcome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8.556,
    "end": 10.378,
    "text": "It's August 19th, 2025.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 11.28,
    "end": 21.135,
    "text": "We're in Actinth stream, guest stream one, 17.1, with Robert Stamps, who will be presenting on control strategies and predictive coding using magnetic noise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 22.237,
    "end": 31.371,
    "text": "Thank you for joining, Robert, and looking forward to this presentation and then discussion with...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 36.177,
    "end": 38.779,
    "text": " Close the YouTube on your side, Robert.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 60.14,
    "end": 62.522,
    "text": "Should I just begin now?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 63.886,
    "end": 68.452,
    "text": " Well, thank you for this invitation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 68.512,
    "end": 87.919,
    "text": "Maybe I should give you a little bit of a background of how I ended up doing this research, getting interested into this problem, because I'm primarily a condensed matter physicist, computational in theory primarily.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 88.726,
    "end": 111.814,
    "text": " and my area of specialization has been in magnetic materials and spin systems in general but I've been doing this for quite a while and about I would guess 25 years ago I was more or less starting my career I was in Australia at the time and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 112.368,
    "end": 118.457,
    "text": " I also came across a paper, it was about the theory of flocking, and I found that very interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 119.539,
    "end": 131.977,
    "text": "And that led to one thing and led to another thing, and eventually I found myself co-supervising a PhD student who was working with an expert in psychology on psychophysics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 132.198,
    "end": 138.527,
    "text": "And they were looking, doing experiments and analyzing experiments on a primate visual system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 138.929,
    "end": 143.473,
    "text": " And what I found striking was some of the mathematics we were doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 143.513,
    "end": 156.305,
    "text": "We were heavily influenced by, I think, about that time, in fact, just recently a Rowan Ballard paper had come out, and it was heavily influenced by the structural form of the mathematics we were doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 156.325,
    "end": 163.871,
    "text": "And it mapped directly back onto some of the things I was thinking about doing with magnetic systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 163.891,
    "end": 166.894,
    "text": "At that time, people were just starting to develop",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 167.667,
    "end": 187.583,
    "text": " a fabrication technique which would allow them to make new kinds of magnetic materials and that's what I'm going to discuss today and it occurred to me at that time I remember very clearly that when that technology matured it seemed to me like it would be an ideal one to try and implement some sort of neuromorphic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 187.799,
    "end": 188.961,
    "text": " designs in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 189.542,
    "end": 192.327,
    "text": "And indeed, that is exactly what has panned out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 193.068,
    "end": 196.934,
    "text": "And so I'll tell you a little bit about that and what the state of the field is now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 198.197,
    "end": 203.766,
    "text": "But that explains more or less how I began my interest in this kind of cross-disciplinary",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 203.746,
    "end": 204.367,
    "text": " field.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 205.228,
    "end": 216.203,
    "text": "And just to put the story back into context, then about three years ago, I had a sabbatical and I decided to go back to Australia and visit that group and see what had happened.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 216.564,
    "end": 220.289,
    "text": "And that's when I came across Friston's papers in Active Inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 220.629,
    "end": 224.514,
    "text": "And I actually didn't make head or tail of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 224.555,
    "end": 227.899,
    "text": "And so I thought, well, I better put it into some context I can understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 227.959,
    "end": 229.281,
    "text": "And",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 229.43,
    "end": 234.102,
    "text": " to try and understand exactly what predictive coding and active inference are about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 235.004,
    "end": 239.616,
    "text": "And that helped me, and that's where this work emerged from, trying to understand that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 240.438,
    "end": 242.343,
    "text": "So let me begin then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 243.125,
    "end": 245.852,
    "text": "So I'll just explain these pictures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 246.777,
    "end": 255.158,
    "text": " This is just a schematic of using nanomagnets with an active inference to control some process and then you feed back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 255.178,
    "end": 262.175,
    "text": "And this is a schematic of the sort of nanoparticle arrays which are in this control box.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 262.235,
    "end": 263.318,
    "text": "This is my",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 263.298,
    "end": 292.832,
    "text": " idealized spin system and what this is at the very end I could show you it's a model which is a bit more sophisticated but it actually tries to model properly the properties of real magnetic materials and the point of it was to demonstrate that one could implement certain algorithms inside a magnetic context like this so to begin let me introduce myself the people I work with here",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 294.365,
    "end": 299.412,
    "text": " focus primarily on studying both theoretically and experimentally nanomagnets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 300.053,
    "end": 308.305,
    "text": "The experimental parts are led by my colleague Professor von Lierop, and these are students who involved one way or another in some of the works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 308.445,
    "end": 311.129,
    "text": "Some of it overlaps with what I'm going to show you today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 311.189,
    "end": 320.202,
    "text": "And these are just illustrations of some of the different systems which other people and which we also have looked at over the years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 321.204,
    "end": 323.427,
    "text": "Each of these represent a little magnet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 324.065,
    "end": 324.761,
    "text": " But...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 325.415,
    "end": 328.518,
    "text": " Before I explain all of that, let me give you a little bit of an outline.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 330.159,
    "end": 332.521,
    "text": "This is just an inspiration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 332.782,
    "end": 337.025,
    "text": "It's a wonderful, beautiful picture of a fly larva.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 337.045,
    "end": 347.275,
    "text": "And you can see all the neurons here are close packed and they expand out as the fly, as it grows into a fly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 347.935,
    "end": 355.422,
    "text": "But the efficiency and the minimal amount of connections and yet what the fly can do is really quite amazing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 355.402,
    "end": 380.937,
    "text": " and that's a little bit of what trying to discover in all of this so for the first thing first thing i'll start with is an introduction to what i mean by magnetism and nanomagnets and why i think this might be a possible platform at least for some key aspects of what i think is called predictive coding",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 380.917,
    "end": 405.979,
    "text": " and then i'll give some examples active inference and tracking and some other examples as well and then finally when i talked about these real systems and more sophisticated models that demonstrate material specific properties then i have some micromagnetic examples that's what they call it so let me start with a quick overview of magnetism and nanomagnets",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 406.398,
    "end": 408.483,
    "text": " and some key definitions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 408.603,
    "end": 411.731,
    "text": "So I apologize if you've seen all of this before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 413.195,
    "end": 418.568,
    "text": "But it just gives us a way of defining terms in a common way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 419.273,
    "end": 438.531,
    "text": " so what is a nanomagnet well just means it's a little piece of magnetic material this is a real picture the particles themselves are smaller than a micrometer there may be 100 200 nanometers in length and half that size and width",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 438.967,
    "end": 442.872,
    "text": " And an example material would be an iron nickel compound.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 443.593,
    "end": 445.295,
    "text": "And the shape is what matters here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 445.315,
    "end": 463.557,
    "text": "The shape is such that they tend to align as all the magnetization pointing in one direction or the other direction, but always along this axis that minimizes the energy of the magnetic atoms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 463.891,
    "end": 469.881,
    "text": " So at lower temperatures, then they form this magnetization and it tends to align along an axis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 469.961,
    "end": 472.666,
    "text": "So it can be fairly well controlled just by the shape.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 473.167,
    "end": 478.976,
    "text": "And the lithography has been developing steadily over the last 20 years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 479.577,
    "end": 482.963,
    "text": "So one can even make smaller, well-defined particles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 482.943,
    "end": 501.222,
    "text": " Now the nice thing about it, by being able to make many of these particles and place them in close proximity to one another, is that these little magnets interact with one another just by stray magnetic fields, the same sort of magnetic fields that holds a magnet to a refrigerator door.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 501.472,
    "end": 511.228,
    "text": " But what it does then is, depending on which way the magnet in the magnetic particle is oriented, it always likes to be north-south.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 511.368,
    "end": 524.509,
    "text": "So if I draw little arrows to represent which direction of magnetization the particle is, they always try to order in a way that minimizes the stray field energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 524.489,
    "end": 546.193,
    "text": " uh which is represented by these little bar magnets i've drawn schematically over here and so to be north south like that means that they if they're placing in this direction they like to be anti-parallel that minimizes their energy whereas if you place them at a corner like this then they'll form a corner and try to make a chain",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 546.545,
    "end": 550.29,
    "text": " The point is there is an energy associated with their interaction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 550.691,
    "end": 555.197,
    "text": "They can adjust their orientation to minimize that energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 555.657,
    "end": 564.209,
    "text": "And that's sort of the basis starting point for where I think this overlaps with the predictive coding algorithm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 565.711,
    "end": 575.083,
    "text": "So the shape just means they have arrows along one direction and you can place them close together and then they behave like little toy magnets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 576.278,
    "end": 587.993,
    "text": " Now, the freedom and flexibility of the lithography which has developed over the years is you can place them in all sorts of interesting geometries where these interactions can compete.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 588.31,
    "end": 613.93,
    "text": " and the name of that field is artificial spin ice and it is motivated by a residual entropy that was predicted by paulie for water ice the way that the polarization the distribution between plus and minus charges would order just in regular water ice it is frustrated it competes it cannot find its minimum minimum energy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 614.23,
    "end": 621.209,
    "text": " And one can engineer that and study the frustration by putting these particles in certain arrangements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 621.269,
    "end": 626.383,
    "text": "This arrangement is one where there's a two-fold degenerate ground state",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 626.617,
    "end": 647.882,
    "text": " forms net anti-ferromagnet meaning there's a cancellation of all the magnetic moments this one where you just rotate everything a little bit prefers a ferromagnetic orientation so there's a net magnetic moment others which can be engineered are not really in either of these classes they are instead they're called topological ordering",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 648.858,
    "end": 654.363,
    "text": " So I'm going to talk about primarily this ferromagnet one just to illustrate the key ideas here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 654.844,
    "end": 667.016,
    "text": "Before I do that, as I was telling you before, my interest in this area, I was thinking that someday people are going to develop these magnetic arrays once I have the technology for neuromorphic application.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 667.096,
    "end": 676.165,
    "text": "And indeed, that has been seen in the last five years where there are primarily reservoir computing algorithms have been implemented.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 676.448,
    "end": 680.975,
    "text": " And one of the motivations, in fact, the prime motivation for this is the power efficiency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 681.636,
    "end": 694.396,
    "text": "So if we think about a conventional semiconductor-based logic computer, the information is moved around by charge currents, and charge currents lose energy through dual heating, through resistance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 694.977,
    "end": 703.03,
    "text": "So all the heat that's generated by the CPU is just wasted energy for moving charges around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 703.01,
    "end": 708.696,
    "text": " Information in a magnetic system can be encoded in the direction of little arrows I just talked about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 709.236,
    "end": 719.927,
    "text": "The energy involved in reversing these little arrows can be, in fact, as small as is allowed thermodynamically, in principle, the Skolpa-Landauer limit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 720.728,
    "end": 727.735,
    "text": "And this is not just a factor of two or three more efficient, it is orders of magnitude more efficient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 728.137,
    "end": 731.163,
    "text": " than what can be done by moving charges around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 731.784,
    "end": 742.804,
    "text": "So that is one of the prime motivations for trying to implement some of the very computationally heavy activities associated with machine learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 743.29,
    "end": 745.374,
    "text": " And that's motivated this field.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 746.035,
    "end": 747.278,
    "text": "There's some other things too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 747.318,
    "end": 751.767,
    "text": "You can start thinking about modifying individual elements and states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 752.528,
    "end": 758.7,
    "text": "Next Horizon is actually being able to do this in three dimensions and people are making strides toward that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 759.121,
    "end": 763.83,
    "text": "So it's an interesting area and it has the promise or at least the potential.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 764.131,
    "end": 774.798,
    "text": " of introducing a non-semiconductor and conventional platform, which is particularly power efficient for conventional and non-conventional computing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 776.202,
    "end": 776.723,
    "text": "So,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 777.968,
    "end": 795.792,
    "text": " make use of all that there's some basic concepts so i'll begin with this design here of a spin system now it prefers to align at in its lowest energy configuration such that there is if you add up the little arrows there will be a net magnetic moment meaning there will be a net",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 795.772,
    "end": 818.691,
    "text": " number of arrows which don't cancel out these cancel out in that direction but this group of four those add and there's four different ways to do that it could be these two adding and these cancelling and what we care about is the average direction of the arrow which is the average magnetization so I define a magnetization then as an average and it will be a thermal average",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 818.671,
    "end": 841.54,
    "text": " and where these little sigmas represent the individual spins making up the magnetization and this can be averaged over the entire material and so if you do that you would measure then the average magnetization the way these superimpose with one another so that you'll have a magnetization curve which would look as a function of temperature",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 841.52,
    "end": 856.76,
    "text": " They all, for a ferromagnet, like to lie in the same direction, or nearly lie as you increase temperature, but at some critical temperature, spins will start reversing and point in another direction, and that reduces the magnetization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 857.721,
    "end": 864.65,
    "text": "And the rate at which this happens we call a susceptibility, and statistically that's actually a correlation function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 865.151,
    "end": 869.637,
    "text": "Those two things are important because those are the two things which I will try to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 869.617,
    "end": 890.055,
    "text": " convince you overlap directly into a predictive coding scheme and just enable it then the magnetization to act as a platform for implementing this sort of thing so the next bit that's important is to recognize how the magnetization",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 891.487,
    "end": 894.852,
    "text": " evolves over time, the processes involved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 895.473,
    "end": 907.493,
    "text": "So if I consider a whole lot of these little magnets, whatever geometry it is in, I can adjust the orientation with a magnetic field, which I might apply externally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 907.733,
    "end": 915.165,
    "text": "So I might generate a magnetic field either through another magnet or a coil or something like that and apply it to this array.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 915.145,
    "end": 944.038,
    "text": " and that if it's strong enough it will tend to align all the magnetizations as much as they can in the direction of that field now if i reduce that field and i have a finite temperature there'll be a reduction in the number of spins or elements which like to point in their original direction and some of them will start to favor alignment with the field in its new direction",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 944.018,
    "end": 961.605,
    "text": " and so there might be a region which is pointed oppositely the others so you can see there's a net reduction in the magnetization and as i increase the magnetic field in this new direction this region grows at the expense of the other region until when i get to a large enough field everything is pointing in the opposite direction",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 962.125,
    "end": 968.573,
    "text": " The point I want to make here is this is all happening in time and it can be observed in real time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 968.833,
    "end": 983.29,
    "text": "So here's an example of an experiment that was done on such a system where they start the magnetization in one direction, then apply a small field to give it another direction and then watch what happens as it evolves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 983.27,
    "end": 999.269,
    "text": " And so microscopically what happens is all the spins were oriented one way and then one starts to reverse and that causes or makes it more probable that another spin nearby will reverse, which makes it more probable that yet another spin will reverse until they all reverse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 999.59,
    "end": 1004.856,
    "text": "This all happens in real time and there's a statistical probability of each of these reversals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1004.876,
    "end": 1011.724,
    "text": "So that time that it occurs in always changes a little bit, but it is a stochastic process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1011.704,
    "end": 1033.24,
    "text": " and each reversal is sampling the configuration space but it's always looking for a way to minimize its energy so it's always trying to relax into a lowest energy configuration so that sets me now to where i can talk about the overlap with predictive coding um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1035.397,
    "end": 1044.367,
    "text": " Everybody here, I think, knows much more about this than I. I've been struggling to understand the logic behind it, but I think I've got a better idea now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1045.268,
    "end": 1051.255,
    "text": "If we think about two variables associated... I think of it this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1051.355,
    "end": 1061.906,
    "text": "If I'm looking at the visual system, which I'm a little bit more familiar with, and I throw an object in the air, my eyes are following it, but they're doing it in a semi-random way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1061.987,
    "end": 1063.328,
    "text": "They're saccadic eye motion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1063.848,
    "end": 1088.438,
    "text": " and they're they tend to where am i going to look in the next instant is going to depend on what i've perceived in the previous instance and so there's a lot of information there there's velocity position all of that but i'm going to to look in an area where it's probably more probable to find the object in the next instant so there's two things going on i have a perception",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1088.418,
    "end": 1100.098,
    "text": " and i have some expectation or belief of where it's and what i'm interested in or what my neurons are interested in is a probability distribution relating these two quantities",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1100.703,
    "end": 1103.247,
    "text": " And that's where the whole theory begins.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1103.728,
    "end": 1114.828,
    "text": "So I've got some sort of input data, and I've got some sort of belief state of my neurons, and I'm going to say there's some sort of mapping, and it's not a perfect one-to-one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1114.928,
    "end": 1115.809,
    "text": "It's stochastic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1115.849,
    "end": 1120.838,
    "text": "There's a certain randomness on both sides of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1120.818,
    "end": 1150.588,
    "text": " and i'll say that that non there's a non-linear function mapping it or it can be non-linear mapping say my perception to a belief with a bit of random noise as well or maybe my next belief the transition to my next belief is also going to be a non-linear mapping or linear it can be linearized as well but it's some sort of mapping some function i don't necessarily know what that function is and moreover this can be in a hierarchical system so like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1150.568,
    "end": 1168.999,
    "text": " the original Raoul Ballard paper where a lot of this was described in terms of vision is a layered system where there's an image input from the back of the eye and then that feeds forward into regions of the brain",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1168.979,
    "end": 1183.039,
    "text": " feed forward differences between the expectation and what was perceived, and then a prediction of which way maybe the eye ought to move next, or it would involve that, and it would keep going up the ladder and back and forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1183.846,
    "end": 1206.023,
    "text": " but i think that the main idea is that each layer tries to minimize locally its error function and match up the predictions with the perceptions at each layer and so this this is a little bit different i think than a lot of global oriented machine learning algorithms that are maybe a bit more familiar with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1206.728,
    "end": 1230.745,
    "text": " um one other thing too when i gave my example about tracking an object there's a lot of information being gathered in each time interval and that includes position but it also includes velocity and accelerations can in principle be any order of dynamics and so in addition to having a hierarchical uh layering",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1230.725,
    "end": 1249.476,
    "text": " uh one can also envision a kind of a lateral hierarchy if you want and so i call that dynamic ordering and that that is i think the idea that that friston uh introduced uh back in the in the late to to around 2008 and so on and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1250.468,
    "end": 1258.756,
    "text": " The idea that evolves from all of that is I now have new indices that complicate my states and my perceptions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1258.816,
    "end": 1262.459,
    "text": "They're indexed by layer and by dynamic order.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1262.96,
    "end": 1278.214,
    "text": "But the time evolution of my beliefs then, with this dynamic information, also introduce a term over here, but they're governed primarily by this relaxation of some energy function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1278.194,
    "end": 1290.567,
    "text": " and that tends to uh that's the free energy idea that you're trying to to find an extremal value and it's this gradient which is most interesting for me",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1290.952,
    "end": 1296.121,
    "text": " for what guides this, because that's where I can map that onto the magnetic system most easily.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1296.622,
    "end": 1315.255,
    "text": "And I put a little note here that this is a Langevin-type equation, but it can be also derived in a physics context where most physicists would be familiar with the Fokker-Planck equation for the distribution, the time evolution of a joint distribution function, and these equations emerge naturally from that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1316.534,
    "end": 1321.183,
    "text": " Here's how we do it with predictive coding then in magnetization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1321.825,
    "end": 1324.53,
    "text": "So I've got my state variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1325.733,
    "end": 1328.659,
    "text": "You might call them the hidden states and the more visible states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1329.2,
    "end": 1334.29,
    "text": "They're indexed by layer in the hierarchy, but also by dynamic order.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1334.27,
    "end": 1350.642,
    "text": " And I'm going to say that I'm going to translate this statement of a nonlinear mapping between the visible and hidden states through these g and f functions, I'm going to translate them into measurements",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1350.773,
    "end": 1380.527,
    "text": " on a magnetic system and the magnetic system is a magnetization something which responds where i put a field on it that field is a function of these variables these state variables and the magnetization is what responds or how the system responds to that magnetization as i said earlier system is always trying to find a way to minimize its mechanical energy and its entropy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1381.047,
    "end": 1403.848,
    "text": " maximize its entropy subject to whatever that constraining field is so if i can sample that that's why i put these angular brackets it's a stochastic sampling then i get a measure of the system trying to relax as it must to a more energetically favorable configuration and i just in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1404.301,
    "end": 1410.775,
    "text": " interpret that relaxation as an instantaneous value of the visible and hidden states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1411.738,
    "end": 1421.82,
    "text": "So this is all done at some finite temperature T and the trick then is to figure out what this field is and then make a measurement of the magnetization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1421.952,
    "end": 1446.778,
    "text": " And so my Langevin equation then, with this gradient of this error term or energy, translates into a transition rate for my state variables, here the belief, subject to this term, which is effectively a force guiding the magnetization toward a lower energy state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1448.598,
    "end": 1461.066,
    "text": " So the terms that appear just for some details and how the mapping occurs, the field, which is the all important thing that's acting on the magnetization is a gradient of some energy function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1461.527,
    "end": 1468.362,
    "text": "And that energy function is the lowest order expression for that is a difference between this nonlinear mapping and the average.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1468.342,
    "end": 1487.025,
    "text": " of my state whether I'm at whatever layer I'm in and at whatever order I'm in and that defines my effective field the terms which appear then there's a some parameter a precision which in my magnetic system goes like an inverse temperature",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1487.512,
    "end": 1517.113,
    "text": " and magnetization which is my f function and the derivative of that f function which is my susceptibility so all these two things they can get from a measurement uh i do it computationally but they could not can be done through measurements uh we do that for data recording for example magnetic data recording all the time and this is the quantity then that tells me how my state variables will evolve in time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1518.275,
    "end": 1520.758,
    "text": " So the algorithm is really actually quite simple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1521.439,
    "end": 1535.679,
    "text": "At each time step, I sample my magnetization on some magnetic array where I've subjected it to a field, which is a function of whatever the previous values for the state variables were.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1535.699,
    "end": 1545.092,
    "text": "Then having measured that magnetization, I get new values for my state variables and I calculate fields and I repeat the process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1546.068,
    "end": 1548.152,
    "text": " So it's nothing more than that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1549.174,
    "end": 1554.745,
    "text": "It's the same thing we used to do with magnetic recording, still do do with magnetic recording.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1555.346,
    "end": 1560.796,
    "text": "You have information on a magnetic material, you read it, but you can also write it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1561.517,
    "end": 1562.239,
    "text": "You just repeat it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1563.161,
    "end": 1568.11,
    "text": "So it's really quite simple, and it's an old, fairly well-established technology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1568.663,
    "end": 1574.471,
    "text": " What's different is doing it on micrometer size patterns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1574.592,
    "end": 1575.853,
    "text": "Well, that's not different either.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1577.896,
    "end": 1578.697,
    "text": "Here's an example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1579.378,
    "end": 1585.768,
    "text": "So here's a three layer network with three dynamic nodes who would correspond to three different magnetic arrays.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1587.03,
    "end": 1594.3,
    "text": "And I would apply a field separately to each one of these arrays in my updates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1594.516,
    "end": 1603.791,
    "text": " And then I just make a measurement of the magnetization from each of these nine arrays, feed it back in to get nine more fields and just keep iterating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1604.712,
    "end": 1609.339,
    "text": "That's my implementation of the Longin equations that govern the predictive coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1610.581,
    "end": 1611.483,
    "text": "And that's how it works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1612.865,
    "end": 1618.314,
    "text": "It really is kind of simple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1618.334,
    "end": 1619.275,
    "text": "Here's an example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1619.575,
    "end": 1623.299,
    "text": " So I've done one which is fairly recent, actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1624.1,
    "end": 1625.482,
    "text": "It's not dynamic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1625.502,
    "end": 1626.864,
    "text": "It's just the layering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1627.324,
    "end": 1629.547,
    "text": "I modeled it on the Rao Ballard paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1630.528,
    "end": 1632.771,
    "text": "But it's a simple one-dimensional version.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1633.512,
    "end": 1637.076,
    "text": "So I have an image with one dimension.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1637.336,
    "end": 1639.799,
    "text": "It's just a sinusoid, so I got a feature in it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1640.64,
    "end": 1643.864,
    "text": "And I don't have very many nodes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1643.944,
    "end": 1646.207,
    "text": "I think this was like 30 or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1646.693,
    "end": 1675.283,
    "text": " and then i reduce it to my first active layer mu1 which i think had something like 18 nodes and then i reduce it down to six nodes in mu2 and a bit more feature extraction with mu3 and then for mu3 i can do a reconstruction now over here mu1 and mu3 don't look very good",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1675.263,
    "end": 1697.119,
    "text": " that's because i'm doing it at high temperature my original image looks like that and the reconstruction looks like that when i lower the temperature because remember you know i get a critical point where the magnetization disappears when i lower the temperature well quite a different picture here's my input data here's my first layer it's learned it pretty well",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1697.588,
    "end": 1723.174,
    "text": " Here's the second layer which is extracting some features learned from this and more refinement at this layer Then I reconstruct from this layer the full image and it matches pretty well, but that's at low temperature So this just illustrates I think where the magnetic System you can actually see what it is actually doing something and it's through this nonlinear function and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1724.673,
    "end": 1729.803,
    "text": " Another example, this is now one which includes the dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1730.144,
    "end": 1731.587,
    "text": "So it's a tracking example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1732.709,
    "end": 1739.062,
    "text": "And I was inspired, there was a thesis written by Millage, I think it is, it's quite nice thesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1740.084,
    "end": 1744.012,
    "text": "And in his chapter three, he did something like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1744.092,
    "end": 1745.074,
    "text": "I thought that was quite nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1745.114,
    "end": 1746.597,
    "text": "So I implemented it here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1747.538,
    "end": 1750.483,
    "text": " And this is a sinusoid.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1751.003,
    "end": 1758.014,
    "text": "And I give into it because I've got three dynamic orders as well as three hierarchical orders.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1758.775,
    "end": 1763.743,
    "text": "So I have a velocity and acceleration and an acceleration to the acceleration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1764.644,
    "end": 1771.735,
    "text": "And that input data then is represented here with my phi.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1771.775,
    "end": 1774.339,
    "text": "And then this is the layer one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1774.657,
    "end": 1777.2,
    "text": " and it's following the sinusoid quite nicely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1777.26,
    "end": 1782.806,
    "text": "This is the layer two, which is using a visible layer from here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1783.246,
    "end": 1791.495,
    "text": "By the way, I'm following a paper, the formalism I'm using is by Buckley, so I have that hierarchy that they've used.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1792.416,
    "end": 1795.7,
    "text": "So this is their visible and their hidden notation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1795.82,
    "end": 1797.542,
    "text": "These are errors on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1797.522,
    "end": 1827.495,
    "text": " and it's following quite nicely so that was curious how this what's being learned if anything so i tried a non-periodic input so i would just at each position choose randomly a velocity so sometimes go up or down it's a one-dimensional example and you see it does pretty well following even that random force choices in velocity so i ran it for some time and then i turned off the signal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1827.475,
    "end": 1852.251,
    "text": " so I turned off my input here and as you can see the hidden states however they keep going on looks like they learned a trajectory from the most recent steps and so it appears that it did learn to predict which way the system was going to go and yet you can see here it makes very quick corrections but here there's no input data and it will eventually come back down to that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1852.231,
    "end": 1857.521,
    "text": " And a lot of stuff is being filtered at the higher layers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1857.582,
    "end": 1860.167,
    "text": "They respond a bit more quickly than the lowest layer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1860.287,
    "end": 1869.565,
    "text": "And that's all consistent too with the observations that different time scales are happening at different hierarchical layers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1872.025,
    "end": 1874.91,
    "text": " Active inference, which I haven't done yet, but it's here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1874.97,
    "end": 1877.414,
    "text": "This is this example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1878.315,
    "end": 1885.967,
    "text": "So it's what I showed you on the very first slide, nanomagnet control, feedback to a process, and then information coming back to the nanomagnets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1886.068,
    "end": 1890.034,
    "text": "And again, this is just repeating what was done in the Buckley paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1890.014,
    "end": 1915.313,
    "text": " uh the active inference part is this a so we have the we've associated then some change in the process uh which appears then as a new function in this e function and this appears in the in the perception part so i look at how that is changing and adjust whatever this a signal is based on what is believed by the nanomagnets",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1915.293,
    "end": 1927.953,
    "text": " And the target here is a linearized f function, but I'm still using an average over that linear f function from my simulating it with my thermal magnets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1928.433,
    "end": 1932.66,
    "text": "So introduced into that function is a target value, Td.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1932.64,
    "end": 1943.542,
    "text": " And what that means is the system is going to try and align its perceptions through A with its belief that it ought to be at a temperature Td.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1944.343,
    "end": 1951.257,
    "text": "And this function that is going on in the process is unknown to the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1951.237,
    "end": 1980.214,
    "text": " uh so it has to it can't know the function it just has to adjust its position with mu in such a way as to get the data coming back into the nanomagnet to give it a value of td so this target here is the green line and here is the measurement is the orange and the belief is the blue and you see it starts off over here far away from the target and then it oscillates and exponentially decays down",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1980.194,
    "end": 2006.657,
    "text": " uh until it hits the target and this is the other bit of information that's coming in that's that's the temperature this is the rate of bit change of the temperature with respect to to whatever this this value uh x is that it's sending to a and uh so it's got these two bits of input which is just the position and and the velocity whoops backwards and then this is the error function",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2006.637,
    "end": 2024.848,
    "text": " and i found it actually useful to see this as a trajectory so that if i look at the belief in blue which is really what my spins are doing and the perception that's coming back in which is my phi and they're starting off here and then the perception",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2025.098,
    "end": 2047.68,
    "text": " is slowly coming around and oscillating into its target value here and you see that the blue which is the stochastic magnets they're oscillating as well but doing quite a bit more jumping around but they also then find their center of gravity at the target point um this is just a note that rather than doing the simulation i can actually",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2047.795,
    "end": 2055.688,
    "text": " capture most of what's going on here with a simpler approximation, which is quite common in magnetic systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2055.728,
    "end": 2059.976,
    "text": "It's a Brillouin function, which allows me to introduce temperature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2059.996,
    "end": 2066.226,
    "text": "And you see it gives me the same qualitative features that I had with the actual magnetic system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2067.893,
    "end": 2079.15,
    "text": " This is another thing, which is that system below before was just for three dynamical orders and one layer, one hierarchical layer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2080.291,
    "end": 2086.24,
    "text": "There are parameters which matter, these precisions on two sets of terms which appear in my effective energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2086.675,
    "end": 2108.447,
    "text": " um i can get rid of the oscillations by adjusting these parameters so what i did was i basically built an active inference acting on the acting inference if you will so i built another network again with magnetic spins and their job however was to measure the free the energy uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2108.613,
    "end": 2120.833,
    "text": " the energy cost of the first layer which is interacting with the process over time so they were running much slower and then try to minimize that energy by feeding back to these parameters",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2121.1,
    "end": 2123.963,
    "text": " the lambda z and lambda omega.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2124.523,
    "end": 2126.685,
    "text": "And so this was the first iteration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2126.706,
    "end": 2127.767,
    "text": "It just got started.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2128.267,
    "end": 2129.528,
    "text": "But now I collected data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2129.548,
    "end": 2137.316,
    "text": "And then there was feedback from this active inference acting on the acting inference, which got fewer oscillations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2137.396,
    "end": 2144.463,
    "text": "And as I repeat this through this learning exercise, you see it gets quite good near the end after about eight or nine repeats.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2144.963,
    "end": 2146.845,
    "text": "And it just goes smoothly to the target.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2146.885,
    "end": 2148.627,
    "text": "So it's adjusted these parameters",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2148.961,
    "end": 2155.072,
    "text": " relative to the starting point to take it exactly to the target without a lot of searching around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2158.979,
    "end": 2161.544,
    "text": "The last thing I'll mention is this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2161.804,
    "end": 2163.848,
    "text": "We're done with fairly simple models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2164.773,
    "end": 2170.0,
    "text": " That is, simple spins, real magnets that people can make are not that simple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2170.62,
    "end": 2178.511,
    "text": "Although I did demonstrate you can use a fairly straightforward mean field theory to get the essential behaviors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2179.111,
    "end": 2181.715,
    "text": "But that's a far cry from actually making a device.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2182.436,
    "end": 2184.418,
    "text": "So there are tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2184.398,
    "end": 2191.142,
    "text": " for trying to simulate better, more accurately, more realistically, magnetic nanoparticles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2191.423,
    "end": 2192.486,
    "text": "So I applied those tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2192.547,
    "end": 2196.079,
    "text": "And they can be done at finite temperatures, it's just a different algorithm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2196.211,
    "end": 2210.194,
    "text": " And it's called micromagnetics, and I can put in parameters which are measured and known for materials, iron, nickel being one of the compounds, and various variants of those compounds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2210.654,
    "end": 2216.504,
    "text": "But there are things that people can actually make lithographically into the kind of designs which I was showing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2217.886,
    "end": 2220.21,
    "text": "So I chose one with 16 spins.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2221.068,
    "end": 2244.848,
    "text": " and in this kind of a geometry so it's much simpler kind of system than what I was showing before and I did this tracking exercise but now call it a PID controller this is what it would look like electronically what I did was the same thing except it would be done with 16 spins and it did the same sort of targeting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2244.828,
    "end": 2272.708,
    "text": " adjustment and oscillates around here where I'm now measuring directly the magnetization through my micromagnetic simulations and then adjusting those for the applied field which then is feeding back into my imaginary thermostat over here another application of the 16-spin system if I say feed in an input function which is a sinusoid and a cosine",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2272.975,
    "end": 2290.656,
    "text": " for my two dynamical orders, I can move the system of my 16 spins such that from one initial condition to another which I specify will correspond to an average magnetization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2291.717,
    "end": 2298.865,
    "text": "That average magnetization is nothing more than the average number of spins pointing to the right or up and down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2298.946,
    "end": 2305.078,
    "text": " And I can pick then a set of states by picking my starting points and my final points.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2305.178,
    "end": 2312.953,
    "text": "I can target a little subset of states where the magnets, specific magnets, are pointing in one direction or the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2312.993,
    "end": 2320.127,
    "text": "So I can pick examples of this has a certain magnetization, this has a certain magnetization, this has a certain magnetization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2320.107,
    "end": 2329.797,
    "text": " corresponding to the alignment of the spins, I can choose those states with some precision just by picking my initial and final conditions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2331.093,
    "end": 2347.683,
    "text": " The final one is just an example that what is a computationally hard problem in the field, which is if you have a real nanoparticle, some finite size with a lot of different kinds of more complex interactions, how do you reverse it in a very, very short time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2348.464,
    "end": 2350.688,
    "text": "And this algorithm works rather nicely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2350.853,
    "end": 2363.187,
    "text": " It reverses a magnetization from pointing up here to pointing down there by applying a pulsed, shaped pulsed field in the right directions, moving the field as well, which is a really difficult problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2364.509,
    "end": 2368.994,
    "text": "You can't solve that very easily using any of the tools that people have at the moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2370.676,
    "end": 2371.117,
    "text": "And that's it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2373.079,
    "end": 2374.401,
    "text": "That's my short summary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2374.961,
    "end": 2380.708,
    "text": "I think maybe nanomagnets, and I think a broad class of systems probably,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2381.482,
    "end": 2394.529,
    "text": " provide natural platforms for predictive coding by making this sort of mapping onto the magnetization or whatever the order parameter is and the susceptibility, which are all temperature dependent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2395.505,
    "end": 2397.168,
    "text": " There are also stochastic processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2397.288,
    "end": 2401.154,
    "text": "They are minimizing a physical free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2401.534,
    "end": 2414.695,
    "text": "And you can just map the two onto this, apparently, and constrain the system to evolve along a trajectory, which we would recognize then in an active inference example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2415.518,
    "end": 2424.127,
    "text": " I'm also particularly interested in systems which are complex and like glasses and spinning glasses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2425.028,
    "end": 2429.954,
    "text": "Some of these display all sorts of various odd and not very well understood dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2430.514,
    "end": 2438.683,
    "text": "And I'm wondering about whether or not there's some avenues into those studies by employing this sort of a methodology, if you will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2441.086,
    "end": 2443.348,
    "text": "That's it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2446.045,
    "end": 2446.847,
    "text": " Thank you, Robert.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2447.81,
    "end": 2448.492,
    "text": "That was awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2450.498,
    "end": 2453.246,
    "text": "Anyone watching live, please write any questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2453.667,
    "end": 2460.747,
    "text": "First, Vladimir, please feel free to give any opening remarks and ask any questions you have first.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2461.52,
    "end": 2465.768,
    "text": " Yeah, this is a very interesting presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2466.109,
    "end": 2469.215,
    "text": "And I have several questions for this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2469.235,
    "end": 2475.788,
    "text": "So what your system, I see that it works and it can do calculations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2475.968,
    "end": 2481.739,
    "text": "What you said, predictive coding is mostly doing computation with the matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2481.719,
    "end": 2492.756,
    "text": " And in this system, I think this is the main part that it is based on the mean field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2493.136,
    "end": 2502.951,
    "text": "So that you are using Langevin equations and this is going to the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2502.931,
    "end": 2525.513,
    "text": " uh free energy minima and so to go to the minima and uh this system just learned uh the path and that's what you have this gradients towards the minimum and so this is the basis of the system the why it can be predictable and then how you can uh calculate",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2527.248,
    "end": 2528.27,
    "text": " Yes, this is correct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2528.35,
    "end": 2530.374,
    "text": "Yeah, that's exactly it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2530.894,
    "end": 2532.377,
    "text": "That's why I think it's rather general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2532.397,
    "end": 2535.262,
    "text": "It could be taken outside of magnetic systems as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2535.342,
    "end": 2536.304,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2536.324,
    "end": 2537.887,
    "text": "So this is quite general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2537.907,
    "end": 2539.429,
    "text": "So you are at equilibrium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2539.45,
    "end": 2547.844,
    "text": "So you have several local minima and you can even make those changes within the minima.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2547.864,
    "end": 2548.125,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2548.145,
    "end": 2549.948,
    "text": "So, for example, if you have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2550.468,
    "end": 2558.723,
    "text": " system with several minima and the kinetic barriers so that's can you also incorporate this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2559.395,
    "end": 2563.221,
    "text": " Well, that's kind of what motivated all of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2563.241,
    "end": 2567.106,
    "text": "As I mentioned at the end about glasses, which would be exactly that sort of system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2567.807,
    "end": 2570.251,
    "text": "And it's not really at equilibrium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2570.531,
    "end": 2572.334,
    "text": "And that's what makes it interesting, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2572.394,
    "end": 2582.128,
    "text": "Because this evolution, the Langevin equation evolution, especially with the dynamic orders, is tracing a path through phase space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2583.003,
    "end": 2585.909,
    "text": " And this is introducing constraints on that path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2586.39,
    "end": 2597.652,
    "text": "So I'm wondering, what I'd like to know is, does the landscape, the energy landscape, is this a way of studying it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2598.654,
    "end": 2600.117,
    "text": "What role does it play?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2601.059,
    "end": 2601.7,
    "text": " Yeah, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2602.141,
    "end": 2611.514,
    "text": "So basically, if you have several local minima and those switches, it may be quite interesting for computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2612.074,
    "end": 2617.201,
    "text": "So if those kinetic barriers are too high, then you are too stable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2617.582,
    "end": 2619.525,
    "text": "It will be not possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2619.625,
    "end": 2623.11,
    "text": "And if it's too low, it's also unstable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2623.19,
    "end": 2624.772,
    "text": "So this kind of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2624.752,
    "end": 2650.32,
    "text": " And another thing that would be also interesting to see how you can do for these non-equilibrium systems, which are not based on this relaxation or this lunging, but maybe going towards... I don't know if it's interesting to explore this direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2650.84,
    "end": 2652.563,
    "text": " it's completely non equilibrium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2653.284,
    "end": 2660.114,
    "text": "Like I say, glasses and John.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2660.374,
    "end": 2662.537,
    "text": "That's exactly what I would like to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2662.958,
    "end": 2663.779,
    "text": "So far, I haven't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2664.22,
    "end": 2672.813,
    "text": "I mean, one of the reasons I chose a spin the ice as a model system is you you can engineer the landscape to some extent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2674.295,
    "end": 2678.241,
    "text": "Yes, you can have multiple, multiple energy states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2679.102,
    "end": 2680.324,
    "text": "And I have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2681.03,
    "end": 2686.326,
    "text": " I've explored it numerically primarily, trying to see the consequences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2686.346,
    "end": 2695.292,
    "text": "I found some oddities, some things, but I haven't made sense of it yet, honestly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2697.01,
    "end": 2712.741,
    "text": " And have you tried it to... This system is a small size, so you can have a very big number of those particles, of those spins, and these big numbers,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2712.721,
    "end": 2734.577,
    "text": " may lead to some different scale so that you can do not only just explore a minimum but you can maybe use it as a on something called a completely different scale so if you if you have access to such a big number of uh interacting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2735.063,
    "end": 2735.744,
    "text": " particles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2736.525,
    "end": 2744.513,
    "text": "So you have like an Avogadro system that may lead to some new phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2746.796,
    "end": 2747.817,
    "text": "I wonder that too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2748.457,
    "end": 2752.081,
    "text": "I mean, computationally, it starts to become very difficult.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2753.122,
    "end": 2762.252,
    "text": "And we're kind of moving in that direction, trying to be able to treat larger systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2762.654,
    "end": 2766.932,
    "text": " But it starts to become very demanding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2768.619,
    "end": 2769.201,
    "text": "For what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2769.422,
    "end": 2772.033,
    "text": "To control it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2772.053,
    "end": 2773.137,
    "text": "To simulate it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2774.197,
    "end": 2803.022,
    "text": " over a sufficiently long time scales yeah but if you leave it to evolve by itself so you because you want to always like external control but you what it does yes but if you just switch by itself so just to self-revolve that's it i'm not yeah i'm not sure i'm following uh how would you what would you look at how would you set up that problem",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2803.762,
    "end": 2812.634,
    "text": " So, for example, you measure the properties, for example, unification, susceptibility of the whole system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2814.436,
    "end": 2826.332,
    "text": "But you don't provide the program, what it should calculate, but the system makes itself organized into some states by itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2829.656,
    "end": 2830.377,
    "text": "I see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2833.867,
    "end": 2840.057,
    "text": " So for example, I played around a little bit with this idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2840.077,
    "end": 2857.866,
    "text": "If I have, I mean, instead of a large system, maybe I have many smaller systems, which I run simultaneously on the same problem, but I let each one follow its own path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2858.977,
    "end": 2881.947,
    "text": " and so for example i think i was playing this when i showed you an example of the tracking where i'm using an active inference to adjust my parameters to optimize parameters for the tracking if i have several systems simultaneously doing this and letting them adjust their own parameters so to speak",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2882.517,
    "end": 2896.597,
    "text": " Then I have, I think I was trying to think about which one of them is going to give me a state which is the one I want to feed back to my process, because I can't feed back all of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2896.617,
    "end": 2910.837,
    "text": "So I've got 2000 different systems which are all trying to predict an outcome, but only one of those is going to actually feed back to my process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2911.154,
    "end": 2912.615,
    "text": " which one do I choose?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2913.757,
    "end": 2923.406,
    "text": "So I can make a, create a probability of which one, maybe the one that is closest, that predicts closest to the target value has the highest probability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2924.307,
    "end": 2929.672,
    "text": "So I could choose which system to follow based on that probability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2929.692,
    "end": 2934.777,
    "text": "So I'm sort of sampling between all my different systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2934.837,
    "end": 2936.959,
    "text": "Is that sort of what you're thinking of in a way?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2937.715,
    "end": 2963.352,
    "text": " But if you consider that interaction, not calculation in a normal way that you provide a program or you design all and control external control, but the material what you have interact with the environment and adjust the parameters without even providing these instructions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2967.82,
    "end": 2972.841,
    "text": " I'll ask a question from the live chat, or I think I hear you on Vladimir.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2972.881,
    "end": 2977.982,
    "text": "I'm imagining one scenario where just stimuli are presented to a material.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2978.536,
    "end": 3002.94,
    "text": " and it could just be like sound vibrating sand and the sand pile never or maybe it's like an ultimate unsupervised learning but how much of this is the design for situation specific topologies like circuit design like and it's is it more like an asic",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3002.92,
    "end": 3031.037,
    "text": " and it's more restricted to a certain kind of inference or how do you think about what functions it can perform or is it a general computer like a processor even if you could only do it very slowly like you play game of life that kind of stuff if it's just like a smaller hard drive with a spatialization element",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3039.893,
    "end": 3042.196,
    "text": " Maybe this is relevant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3042.276,
    "end": 3042.697,
    "text": "I'm not sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3042.717,
    "end": 3045.52,
    "text": "There's this thesis by Millage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3047.242,
    "end": 3051.347,
    "text": "In this chapter, he did an image learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3051.748,
    "end": 3056.374,
    "text": "It was like learning the MNIST digits.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3057.195,
    "end": 3061.7,
    "text": "But he also had an interesting comment about hallucinating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3062.501,
    "end": 3066.306,
    "text": "If he gave it a partial or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3067.214,
    "end": 3077.328,
    "text": " really a minimal amount of input, the system came back and filled in missing gaps in a way which was a bit surprising.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3078.69,
    "end": 3087.341,
    "text": "So it was like the system was self-organizing into a response to something it couldn't categorize very well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3087.642,
    "end": 3088.643,
    "text": "I thought that was intriguing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3088.663,
    "end": 3093.61,
    "text": "I didn't really know what that was saying, but it seemed interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3096.509,
    "end": 3111.361,
    "text": " Yeah, that makes me think of a free energy minimum being possibly a local or global minima, but still being very far off from some other measure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3111.581,
    "end": 3115.75,
    "text": "I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3117.434,
    "end": 3127.988,
    "text": " Another one example, which I don't understand, but I found very interesting, there were these papers, a few papers by Friston on a duet for one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3128.008,
    "end": 3131.212,
    "text": "I don't know if you know these papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3131.352,
    "end": 3135.658,
    "text": "It was about birdsong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3136.9,
    "end": 3146.833,
    "text": "And I think in one of them, if I remember correctly, it was almost as if there was one system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3148.282,
    "end": 3174.137,
    "text": " uh but then it was modeling it as if it were also two systems so we have one which is singing and then it stops and the other one picked up the song uh and reproduced a lot of it that that almost seems a little like that as well it's kind of in that category it's learned that it's following it but it's responding then because it it's it's it's up in this higher layers and comes back down",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3177.037,
    "end": 3179.182,
    "text": " I'll ask a question from the live chat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3179.623,
    "end": 3186.378,
    "text": "Burt wrote, I did not understand the step from the predictive processing feedback loop to active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3186.839,
    "end": 3189.245,
    "text": "Can you explain how to add in action?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3189.305,
    "end": 3190.668,
    "text": "What are the affordances?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3193.033,
    "end": 3195.619,
    "text": "This one, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3197.843,
    "end": 3204.291,
    "text": " So what I have in this case, do I have all the equations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3206.214,
    "end": 3212.943,
    "text": "So there are two streams of input to the nanomagnets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3213.623,
    "end": 3221.033,
    "text": "One is the temperature, and one is the rate of change of the temperature when you adjust a parameter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3222.616,
    "end": 3237.096,
    "text": " And the parameter, this X, is essentially the rate of change of the perception with respect to whatever value of A is in terms of the magnets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3238.018,
    "end": 3246.109,
    "text": "So it's adjusting A in a way that is proportional to, this turns out to be an error term,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3246.781,
    "end": 3265.347,
    "text": " uh on on the prediction and what is measured and then this coefficient just measures the the response essentially uh that this system is going to to react with uh so it's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3265.613,
    "end": 3295.536,
    "text": " I've got a single layer and then there's the system down here which is providing information so it's a feed forward but then this is a feedback is what the a value is so it's trying to minimize a discrepancy between the belief and the perception by adjusting some parameter x and all it knows is it changes this parameter x and there's a response that leads to a new response from the process",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3295.516,
    "end": 3320.173,
    "text": " so if it changes it gets worse then the signs on that term change and so it pushes it in the other direction i don't know if that does that answer the question so you mentioned the frustration and the study of frustration so it's kind of like there's one alignment where it's a minimum a global or local minima",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3321.554,
    "end": 3345.385,
    "text": " which can be designed to be a con or modeled as a convex optimization at least locally and then that the system could be like the magnet is pointing north and the compass is aligned and so then that's a static state or the magnetic field could be rotating or there could be other forces on the compass needle",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3345.787,
    "end": 3374.14,
    "text": " and then the overall like tension or frustration is basically like the the relative mal-fitness so that's the downhill tension reducing force that at least locally the the compass is going to reduce its the gradient is going to go one way or it's exactly at a flat point and then it just is static unless there's some other output and then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3375.318,
    "end": 3404.143,
    "text": " to the physical part so then maybe to end the first question about what the affordances are in the lab what kinds of physical measurements and interventions can you do well for the magnetic system the kind of measurement you would do is measure the magnetization a simple way to do that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3404.714,
    "end": 3415.484,
    "text": " is if you've got a coil of wire and you move the magnet by it, the field which passes through the wire induces a current and that can be measured.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3416.365,
    "end": 3418.227,
    "text": "So that's sort of the basis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3418.247,
    "end": 3422.731,
    "text": "There's other ways to measure magnetization, but that's kind of a simple, straightforward one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3423.833,
    "end": 3430.519,
    "text": "You mean the mechanics of measuring the magnetic particles, or is this a different question?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3431.95,
    "end": 3435.016,
    "text": " Yeah, just what do the measurements look like?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3435.456,
    "end": 3446.837,
    "text": "Is it, um, is it, and then what can you make, can you change the fields with spatial and temporal precision?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3449.382,
    "end": 3467.712,
    "text": " yeah those are there's different techniques and different technologies in being developed as we speak but the maybe the simplest way to visualize them that they're typically some sort of variant of these kind of tape recorders which",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3467.692,
    "end": 3475.741,
    "text": " Here you've got a coil, creates a field, and that generates a particular magnetic order, just like what you've just described.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3476.602,
    "end": 3494.222,
    "text": "Or you have some way of, maybe it's another coil, or there's various devices which are sensitive to magnetic fields, and you move that device over a region of magnet and it measures that as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3494.202,
    "end": 3502.71,
    "text": " it can be done sometimes optically for example some of the i think i pointed out the neuromorphic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3503.011,
    "end": 3506.976,
    "text": " It's the same problem in this reservoir computing schemes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3507.697,
    "end": 3522.435,
    "text": "They actually use a combination of microwaves and there's also scanning probe techniques to look locally and globally at the configuration of the spins.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3523.556,
    "end": 3530.925,
    "text": "So there's a whole myriad of different ways that depend very much on the system and the materials involved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3532.964,
    "end": 3535.489,
    "text": " Where do you see it being used?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3536.09,
    "end": 3547.412,
    "text": "Is it like a research element or a data center piece or is it something that would be functional in a phone or something in a house?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3548.928,
    "end": 3562.586,
    "text": " Well, one of the ideas, the motivation behind this is to try and find applications of materials that are much more efficient than transistors and CMOS technologies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3563.447,
    "end": 3567.212,
    "text": "So there are different avenues you can pursue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3567.272,
    "end": 3571.057,
    "text": "One of those is pure stochastic probabilistic generation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3571.157,
    "end": 3575.222,
    "text": "It takes a fair amount of resources to generate a random number.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3575.32,
    "end": 3581.448,
    "text": " or pseudo random number, but you can do that with a magnetic system quite readily.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3581.689,
    "end": 3582.43,
    "text": "I'm very good at that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3583.591,
    "end": 3589.079,
    "text": "So people are also developing that as a technique and that's for also applications to probabilistic computing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3590.04,
    "end": 3598.071,
    "text": "And there may be many applications that if you can make it portable enough, you could do on your phone or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3599.485,
    "end": 3604.941,
    "text": " data centers for different machine learning algorithms for compression, like image compression.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3606.044,
    "end": 3613.545,
    "text": "I don't know that much about machine learning, but I guess language models and transformers",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3613.947,
    "end": 3635.226,
    "text": " where it's... I do believe I read a white paper from a group where they were arguing that maybe active inference could also go and find application in those directions as well, so it's active inference as opposed to attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3637.729,
    "end": 3641.372,
    "text": "But I think that's fairly recent, so I don't know if that's...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3641.504,
    "end": 3666.887,
    "text": " what direction or what exactly is meant by that Vladimir do you want to ask another question no I think it was quite clear that this is I think which is a very interesting study and in the materials it is not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3667.205,
    "end": 3669.908,
    "text": " yet this direction is very new.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3670.028,
    "end": 3675.594,
    "text": "I think it's not yet very... how to compute with matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3675.814,
    "end": 3677.416,
    "text": "It's a quite new direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3677.717,
    "end": 3682.622,
    "text": "And that's one of the examples how it can be realized experimentally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3683.102,
    "end": 3689.91,
    "text": "Because in many discussions in the publications, there is a lot of theoretical concepts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3690.29,
    "end": 3694.495,
    "text": "For example, this active inference and other theoretical concepts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3694.475,
    "end": 3697.439,
    "text": " how it should be done and how it can be realized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3697.539,
    "end": 3704.408,
    "text": "But experimentally, very few examples which are really implemented.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3704.749,
    "end": 3708.994,
    "text": "And this is one of those examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3709.014,
    "end": 3713.32,
    "text": "I think this is of this approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3713.34,
    "end": 3716.584,
    "text": "This is a demonstration among the first, I think this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3718.707,
    "end": 3720.87,
    "text": "Well, I have a question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3721.188,
    "end": 3723.232,
    "text": " for you also Vladimir, if that's all right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3723.954,
    "end": 3731.369,
    "text": "I mean, I think you work with you, I think I saw through some of your publications work with nanoparticles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3731.61,
    "end": 3740.428,
    "text": "And do you work with materials that have some sort of polarization or something analogous to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3741.168,
    "end": 3745.097,
    "text": " There was mostly a mean field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3745.778,
    "end": 3755.82,
    "text": "It's one of the directions that's also how to go to the equilibrium and how to minimize the free energy in general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3755.98,
    "end": 3760.51,
    "text": "So this is for example, for interaction with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3760.49,
    "end": 3776.895,
    "text": " membranes and biological systems there is also quite a big study so this thing goes in this direction and now what we're building the network for materials with intelligent materials",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3777.365,
    "end": 3787.143,
    "text": " And here, in one of the directions, what we were trying to do is to build a discovery engine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3787.384,
    "end": 3798.765,
    "text": "And also with Daniel involved in this, how to also for this field of materials, how to find concepts, for example, how to make",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3798.745,
    "end": 3816.315,
    "text": " uh the uh those materials uh intelligent and what are the uh phenomenological concepts so on a very uh high level so what do you need a memory you need uh computation you need to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3816.717,
    "end": 3827.814,
    "text": " what is the time scale, so the system should change, and what is the short term, what is the long term, and this depends on the relaxation time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3828.214,
    "end": 3841.594,
    "text": "So kind of this, because it doesn't matter what is the system, but you can already see how it can behave, because as you see, this is based on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3841.574,
    "end": 3848.947,
    "text": " thermal energy, minimization of the energy, and there are very fundamental concepts which are driving, driven them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3849.127,
    "end": 3858.904,
    "text": "And their realization, it already can be captured from one system to another system, and you can even map it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3859.866,
    "end": 3865.776,
    "text": "And see, this is also your system of magnets, what you see, it's quite general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3865.756,
    "end": 3882.212,
    "text": " the mechanism is quite general can be applied to another system so this basically the idea of this work is how to make those connections between different fields or different materials and if you and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3882.192,
    "end": 3896.051,
    "text": " The major problem there is that you don't have reliable experimental systems which are demonstrating it because there is a lot of theoretical concepts how it can be done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3897.152,
    "end": 3903.481,
    "text": "But you need to have this demonstrable, falsifiable results.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3903.541,
    "end": 3907.146,
    "text": "And I think this is how you show it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3907.747,
    "end": 3910.09,
    "text": "It can be used for other systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3911.943,
    "end": 3914.947,
    "text": " This is kind of, it can be much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3914.967,
    "end": 3915.488,
    "text": "Thanks, Vlad.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3915.608,
    "end": 3925.582,
    "text": "I'll add like one kind of connection there that arising from your talk is how do we think about the aspects or the capacities or reliability?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3925.602,
    "end": 3927.004,
    "text": "What to even measure?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3927.044,
    "end": 3935.335,
    "text": "How to have a useful engineering and in silico and in material flexible?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3935.315,
    "end": 3956.614,
    "text": " so that you can study different approximations and more field-like models and more point-like models so that you can do normal statistics on it and kind of port or have a good assembly language type connection kind of between like pro like the analogy between",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3956.999,
    "end": 3985.774,
    "text": " processor instructions and the digital compute so then it's like what is the approach to map different materials and systems to their functions and then that's where these cognitive ontologies like precision attention belief updating learning all of those kinds of cognitive ontological terms become mappable from materials",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3985.754,
    "end": 4002.683,
    "text": " Where with that sort of team and work, it was interesting to look at the method sections and look at the parameter spaces of where methods have or haven't been done, like which grid sizes have been done.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4003.658,
    "end": 4019.187,
    "text": " It's just a really high dimensional space, but possibly could be navigated interestingly to understand where there might be, where is something like a material that emulates a given function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4020.635,
    "end": 4041.867,
    "text": " Where is that all like what is the status of being able to make that and then understand that within a structured parameterized experimental space to prioritize different experiments and perform meta analysis to understand how like just all all these different pieces.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4044.665,
    "end": 4046.712,
    "text": " So, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4046.752,
    "end": 4054.978,
    "text": "Just to add a little from what I've seen from that project and where this sort of talk takes me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4056.19,
    "end": 4064.545,
    "text": " Well, I think I'd be very excited if someone would actually try to test this in one form or another, this idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4064.565,
    "end": 4077.186,
    "text": "I think, yes, you could maybe, I chose magnets just because I'm familiar with them, but I mean, other platforms might be easier technically to implement some example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4077.427,
    "end": 4080.392,
    "text": "I think the PID controller is a nice one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4080.372,
    "end": 4082.555,
    "text": " because it's close to an application.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4082.576,
    "end": 4095.396,
    "text": "It's used in an enormous number of things, from industrial control to cruise control on your car, for example, or just a thermostat for your home.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4095.476,
    "end": 4101.566,
    "text": "I mean, some practical device demonstration might be motivational in a sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4103.529,
    "end": 4105.111,
    "text": "Magnets may not be the best way to do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4105.152,
    "end": 4106.734,
    "text": "Maybe there are other systems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4107.406,
    "end": 4122.787,
    "text": " Or you could envision something analogous, liquid crystals, or something which has a non-trivial response in ordering, and yet subject to thermal processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4124.489,
    "end": 4134.342,
    "text": "I know that even in some conventional memory technology, for example, is something which",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4134.794,
    "end": 4151.257,
    "text": " over 10 or 15 years has developed slowly, but it's kind of in that direction, a material platform where you have something which has a transition function, which would play the role, say, like the F function, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4152.779,
    "end": 4154.842,
    "text": "People do look in that direction as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4155.243,
    "end": 4164.075,
    "text": "And economics is the motivator there, is to try to find more powerful, efficient solutions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4164.342,
    "end": 4169.127,
    "text": " replacements for what one does with transistors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4170.588,
    "end": 4178.416,
    "text": "But I mean, in trying to find implications for something like predictive coding, you've got lots of examples from nature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4178.436,
    "end": 4182.36,
    "text": "You can get devices that could do something similar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4182.38,
    "end": 4189.827,
    "text": "Is there a software toolkit or a production...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4190.954,
    "end": 4191.957,
    "text": " possibility?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4192.058,
    "end": 4202.432,
    "text": "Like how would we, what kind of modeling can others engage with from this work or production of these objects?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4204.15,
    "end": 4231.862,
    "text": " uh experimentally uh i'm not sure yeah like are they synthesizable by yes you or how do they get synthesized or designed or what open source or technical documentation exists to design the in silico models or or to make them physically well i mean mainly",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4232.382,
    "end": 4247.961,
    "text": " In my experience anyway, if you have an idea of something that could be measured is to convince someone who has the laboratory able to do it to invest a few years of their time and graduate students into making it happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4248.38,
    "end": 4258.451,
    "text": " So that's a little bit what I tried to do with this paper is demonstrate that, yeah, there would be a possibility of making these things using existing technologies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4260.894,
    "end": 4261.555,
    "text": "It could be done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4262.496,
    "end": 4263.457,
    "text": "And someone may try it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4265.079,
    "end": 4272.026,
    "text": "But that would be just one example out of, I think, a new big possibilities, big problem, possibility space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4273.768,
    "end": 4278.133,
    "text": "Great ideas of other systems, which might be easier to realize",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4281.151,
    "end": 4284.757,
    "text": " Well, I think in this one, that's one of the reasons I chose it for this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4285.879,
    "end": 4291.908,
    "text": "We have laboratories here can make nanoparticles and they do study spin glasses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4292.169,
    "end": 4294.933,
    "text": "We may be able to do something in that direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4303.306,
    "end": 4305.109,
    "text": "Yeah, it's very fascinating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4305.47,
    "end": 4308.795,
    "text": "Connor Hines and others have worked on the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4310.26,
    "end": 4318.38,
    "text": " spin glass system a little bit as well and so finding that that that sort of a uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4319.93,
    "end": 4342.039,
    "text": " isomorphism between a generative model which can be emulated with distributions and maybe on batch data that works that works fine but then being able to have those calculations which it's very small set of them possibly or or even just one like gradient minimization methods alone",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4343.386,
    "end": 4371.452,
    "text": " and have aspects of that computation, just like sometimes we amortize from the matrix to the neural network, and then go one layer into basically off-sourcing some of what appears to be the signal processing and action selection-like features of systems and have that based upon the material's properties.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4372.613,
    "end": 4397.237,
    "text": " and then co-design well then what symbolic aspects complement the materials properties that might handle what otherwise seems to be variants that needs to be soaked up by an algorithm within just like the big data processing framework",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4403.09,
    "end": 4409.115,
    "text": " I think the spin glass, I think you mentioned the paper on spin glasses and active inferences, Heinz, I think it was.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4409.996,
    "end": 4425.59,
    "text": "Yeah, that's an interesting one, because one wonders, is there a way of approaching that sort of a problem from a different perspective, which is less coming up with a device or an algorithm, but it's just a way of thinking about things, which I do wonder about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4425.63,
    "end": 4433.097,
    "text": "Maybe a direction to look would be in active systems, which is, I think, becoming",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4433.077,
    "end": 4437.723,
    "text": " I mentioned this paper about bird flocking years and years ago, but that kept up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4438.905,
    "end": 4451.542,
    "text": "And I think the modern name for this is active systems, falls under that rubric probably, where you think about particles which have almost like an attached motor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4451.922,
    "end": 4455.287,
    "text": "And then how do they, what's the hydrodynamics of such a system?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4456.111,
    "end": 4468.868,
    "text": " But I do wonder then if this way of thinking, way of modeling, wouldn't be quite a natural approach in some aspects of that kind of a more complex system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4470.651,
    "end": 4476.619,
    "text": "The question for me, though, is how to use this analysis in a way which is illuminating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4478.601,
    "end": 4479.603,
    "text": "I'm not sure I know yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4480.784,
    "end": 4483.207,
    "text": "I mean, I did get some insight in the exercise here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4483.227,
    "end": 4484.008,
    "text": "I didn't mention it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4484.048,
    "end": 4485.19,
    "text": "I didn't talk about it, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4485.895,
    "end": 4495.708,
    "text": " I found it useful to take these equations that govern this PID.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4496.629,
    "end": 4501.595,
    "text": "It's a set of three Langevin coupled equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4502.456,
    "end": 4515.733,
    "text": "And if I look at it from a physics point of view as a set of equations, which are not stochastic, but let's suppose we just take those differential equations and study their spectral response.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4516.557,
    "end": 4532.642,
    "text": " then by choosing my a function as simply as possible, one can show that the system of equations is oscillatory with an exponential decay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4533.28,
    "end": 4539.487,
    "text": " That's not really surprising, it's just an oscillating system that responds in a well-defined way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4540.027,
    "end": 4555.504,
    "text": "What is surprising is that it will go asymptotically toward the target, whatever you set the target at, but when you introduce noise into the system, it finds it much more quickly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4556.685,
    "end": 4561.11,
    "text": "And that helped me understand how these equations are working.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4561.512,
    "end": 4563.935,
    "text": " They're not mysterious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4565.156,
    "end": 4574.747,
    "text": "They're just a mechanical response, if you will, but it's introducing the noise, which actually makes it work better and faster.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4576.069,
    "end": 4577.43,
    "text": "That surprised me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4579.012,
    "end": 4591.266,
    "text": "So that was maybe an insight I can take to be looking at other systems, which are relaxation dynamics, which are non-trivial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4591.988,
    "end": 4597.513,
    "text": " The noise matters quite a lot, the magnitude and how it's introduced.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4598.834,
    "end": 4599.755,
    "text": "That is interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4602.277,
    "end": 4605.14,
    "text": "So that's a direction I wonder about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4605.18,
    "end": 4610.425,
    "text": "And the same with your question, Vladimir, about a system that might have a rather complex landscape.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4610.805,
    "end": 4619.413,
    "text": "I think that's interesting as well in terms of how that evolves on a longer time scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4620.322,
    "end": 4636.97,
    "text": " And this is also related, for example, if your example with the noise, the stability of those systems, because it is possible to design theoretically some system, but experimentally it will not be stable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4637.231,
    "end": 4644.523,
    "text": "And this is the major problem that how to control it, that it will not fall apart.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4644.503,
    "end": 4651.29,
    "text": " the noise may destroy the properties.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4651.43,
    "end": 4654.674,
    "text": "And how do you control it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4656.636,
    "end": 4657.457,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4658.538,
    "end": 4667.488,
    "text": "But you showed that above a certain temperature, the functions of noise or temperature variance of one kind or another, there's the right amount.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4667.948,
    "end": 4672.333,
    "text": "So that's conveniently framed as precision or cognitive attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4672.313,
    "end": 4681.124,
    "text": " And then I think the biggest theoretical mapping is that there's no interpolation of a reward secondary function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4682.125,
    "end": 4697.725,
    "text": "You're able to directly have a physical analogy, at least where the analytic form of the free energy functional in silico can be designed to reflect what was already transferred from the physics or inspired from the thermo and the information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4698.726,
    "end": 4701.51,
    "text": "So the theory mapping",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4701.49,
    "end": 4708.761,
    "text": " to the materials, like Vladimir pointed out, is really an exciting edge that your work is pushing along.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4710.084,
    "end": 4712.007,
    "text": "So it's awesome to hear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4713.789,
    "end": 4721.602,
    "text": "There is a certain range of parameters when the system is behaving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4722.163,
    "end": 4726.89,
    "text": "It can compute, and it is stable, and it can behave.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4726.87,
    "end": 4751.19,
    "text": " but those parameters are not obvious how to find this window of all these parameters temperatures and uh all the distances and everything that you have uh this control parameters they should be in a narrow range that it has sense and this is very difficult to find",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4751.356,
    "end": 4759.19,
    "text": " And that kind of connects to the active inference for active inference that you talked about, like intelligent selection of materials properties.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4760.392,
    "end": 4764.399,
    "text": "So thank you again for the work and for sharing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4764.46,
    "end": 4772.554,
    "text": "Hope that people are interested and learn more and you and your colleagues are welcome to share more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4774.559,
    "end": 4775.502,
    "text": " Well, thank you very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4775.663,
    "end": 4781.644,
    "text": "It was nice to learn about the work that you're doing and the discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4783.31,
    "end": 4784.775,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4785.498,
    "end": 4785.919,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  }
]