[
  {
    "start": 6.977,
    "end": 34.484,
    "text": " all right hello and welcome everyone this is the course active inference for the social sciences in 2023 it's august 30th or maybe a different date depending on where you are and today we're in the semiotics and semantics section we'll be hearing a lecture from lorena zaganzerla and then we're going to have a little bit of a discussion so lorena thank you a lot for joining and off to you for the lecture",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.641,
    "end": 36.981,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 37.342,
    "end": 38.463,
    "text": "Hello, everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 40.365,
    "end": 42.226,
    "text": "I'm based in Australia.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 42.447,
    "end": 43.307,
    "text": "Yeah, I'm Lorena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 43.628,
    "end": 46.551,
    "text": "I'm doing actually my PhD in philosophy here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 46.571,
    "end": 50.074,
    "text": "I work in cognitive sciences and philosophy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 50.134,
    "end": 53.417,
    "text": "I work with concepts and notions of information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 54.498,
    "end": 56.18,
    "text": "So I'm very interested in...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 57.674,
    "end": 78.661,
    "text": " foundational understanding of cognitive sciences and information and how this these kind of things cash out and this is why I was interested in talking about semantics and social cognition to see how these things catch out and have a few ideas on how semiotics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 79.588,
    "end": 82.01,
    "text": " can be compatible with active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 82.71,
    "end": 91.477,
    "text": "And I try to organize a little bit of this semiotic notion and active inference to see if they pan out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 92.098,
    "end": 92.718,
    "text": "Maybe they don't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 92.978,
    "end": 94.379,
    "text": "So let's see how it goes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 97.021,
    "end": 101.365,
    "text": "So let's talk about active inference, formal semantics, and social cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 105.268,
    "end": 105.788,
    "text": "What's up there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 107.498,
    "end": 109.003,
    "text": " Okay, I cannot move my slides.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 109.866,
    "end": 110.267,
    "text": "Now I can.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 111.711,
    "end": 111.852,
    "text": "So...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 113.126,
    "end": 118.31,
    "text": " I will first have a very short introduction for you guys I have out here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 118.71,
    "end": 119.491,
    "text": "So what are you going to do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 119.531,
    "end": 120.692,
    "text": "Like, we have a short introduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 121.092,
    "end": 133.521,
    "text": "I'm going to talk a little bit of theories of meaning, and then we're going to talk a little bit the free energy principle and active inference and how shared symbols and social cognition can be taught together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 133.541,
    "end": 138.225,
    "text": "I bring one case that I find interesting, and then we draw some conclusions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 139.065,
    "end": 145.99,
    "text": " So let me know what you think in the comments and after we can have a little discussion or in the next session.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 148.411,
    "end": 148.591,
    "text": "So.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 151.872,
    "end": 159.818,
    "text": " The background introduction that I want to first point to is we're talking about biological agents and how they act.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 160.338,
    "end": 177.33,
    "text": "So we're always thinking in terms of biological agents acting to express in ways that express informational sensitivities to context-dependent relevance to their environment and things that involve communities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 178.086,
    "end": 192.057,
    "text": " However, how this very minimal way of talking about what motivates and what is relevant to people becomes stable enough as a self-sustaining pattern of interactions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 192.357,
    "end": 195.34,
    "text": "Like, are they stable and how they become that stable?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 195.46,
    "end": 203.406,
    "text": "So how can those information sensitivities ground values, norms, and goals consistently and over time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 204.855,
    "end": 210.239,
    "text": " assuming that those values and goals are necessary for meaningful interactions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 210.8,
    "end": 214.202,
    "text": "So we have two-line motivations to behavior, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 214.222,
    "end": 215.423,
    "text": "That's not really obvious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 215.863,
    "end": 220.007,
    "text": "And ultimately, how meaning is brought about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 220.827,
    "end": 228.413,
    "text": "I don't think I'm going to answer that, but I want to point to some directions and how people have been thinking about these questions over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 230.326,
    "end": 246.484,
    "text": " uh so the problem of meaning has a brief account right like traditionally approaches of uh to cognition localized meaning inside individual organisms and more specifically inside their minds so meaning pertains to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 248.506,
    "end": 250.187,
    "text": " I mean, the content and this kind of thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 250.368,
    "end": 255.171,
    "text": "So many have, however, like many have a developmental history.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 255.251,
    "end": 264.137,
    "text": "So it's hard to catch those two things together if it's inside people's minds, how it can have an evolutionary and developmental history.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 265.738,
    "end": 272.583,
    "text": "Assuming that many are seeing things that we can learn over time and they happen in shared context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 272.703,
    "end": 276.706,
    "text": "They don't happen out of nowhere, in a vision from nowhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 278.979,
    "end": 285.214,
    "text": " In a sense, we can say that it's not really trivial that conventionalized words",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 286.704,
    "end": 295.792,
    "text": " Like, for example, the conventionalized meaning of a word, for instance, cat means catch, have evolutionary histories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 296.112,
    "end": 297.914,
    "text": "One thing does not come from the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 298.655,
    "end": 302.017,
    "text": "We need a broader understanding to cache this meaning out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 302.758,
    "end": 305.06,
    "text": "And that's where I'm stepping from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 305.22,
    "end": 306.822,
    "text": "Like, that's my grounding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 306.882,
    "end": 312.707,
    "text": "Like, we need to cache these things out in terms of community of language users.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 315.339,
    "end": 316.62,
    "text": " which brings a problem, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 316.66,
    "end": 322.503,
    "text": "We have goals and values that can be defined in terms of those communities and you have material and embodied factors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 322.923,
    "end": 334.049,
    "text": "So how these two things are together or how goals and values affect and motivate material and embodied agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 336.701,
    "end": 341.623,
    "text": " To answer this kind of question, over time, there are a few preferred ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 341.983,
    "end": 346.545,
    "text": "I will do a brief overview of some theories of meaning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 346.965,
    "end": 355.268,
    "text": "They usually, in terms of cognitive sciences and any philosophy of mind, that's what I'm interested in, how they get it out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 355.308,
    "end": 361.911,
    "text": "They usually try to think of those things in terms of syntax, like concerns with form,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 362.831,
    "end": 376.061,
    "text": " as an abstract organizing kind of rules, a type of grammar, and how the order of things and how the logical unfolding of those symbols, how they become meaningful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 378.062,
    "end": 382.005,
    "text": "But syntax itself is not really enough to cash out meaning in semantics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 382.525,
    "end": 388.349,
    "text": "So then in that sense, syntax evolve into a field that we call semantics, in which meaning",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 389.181,
    "end": 395.423,
    "text": " and mental content are organized throughout this instructional syntax.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 396.803,
    "end": 410.188,
    "text": "Then we have propositional knowledge and truth conditions in which allows this organizational story of meaningful words to make sense and they're going to point out into the outside world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 411.263,
    "end": 412.524,
    "text": " And we have a third option.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 412.684,
    "end": 420.989,
    "text": "It's not so new, but it's not so famous, which is semantics, or more importantly, I will focus on biosemantics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 422.89,
    "end": 429.334,
    "text": "It concerns with the use of symbols, like how they bring about meaning in terms of pragmatics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 430.334,
    "end": 439.58,
    "text": "And that will be a little bit different, and we'll catch it out in different terms in relation to its peers, like semantics and syntax.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 440.765,
    "end": 443.646,
    "text": " Well, syntax is pretty clear in terms of being rules, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 443.746,
    "end": 446.327,
    "text": "So what do semantics talk about?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 446.347,
    "end": 450.929,
    "text": "So talk about mental content, about intentionality, about mental representations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 451.649,
    "end": 459.011,
    "text": "In a sense, we have semantics that have specific key concepts that reference truth conditions and denotation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 459.531,
    "end": 469.655,
    "text": "So if you have mental content and if you put these meanings inside the organism, it has to refer to something else and how this cognitive penetration happens, like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 470.492,
    "end": 486.816,
    "text": " How can meaning come about inside the mind and how that refers to something outside in the world and how this observational viewpoint of you thinking about something in front of you can be actually true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 486.956,
    "end": 497.018,
    "text": "So we need, we need true conditions that denote this specific relationship and that is represented like it's in terms of mental content.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 500.37,
    "end": 504.035,
    "text": " Contemporarily, there's very ways of catching this up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 505.396,
    "end": 506.358,
    "text": "That can be functional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 506.438,
    "end": 513.467,
    "text": "That can be more an internalized, mental-specific type of representations grounded in vehicles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 513.487,
    "end": 514.688,
    "text": "It's a very rich discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 515.109,
    "end": 516.571,
    "text": "And I don't want to go into all that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 516.591,
    "end": 517.772,
    "text": "I just want to point it out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 518.433,
    "end": 533.006,
    "text": " that science and neuroscience use those terms to study and to build models that relates to mental representations in terms of neural representations, because it kind of makes sense for us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 533.086,
    "end": 537.05,
    "text": "Like brain activity, you can see them in terms of what happens",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 538.231,
    "end": 546.336,
    "text": " by studying human beings and by studying animals and how these mental representations relate to something that happens in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 546.457,
    "end": 556.183,
    "text": "You can see that one behavior elicits specific activities and they have a correlational relationship.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 557.136,
    "end": 560.919,
    "text": " And that is highly debated, but there we go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 560.959,
    "end": 565.162,
    "text": "We have many types of cashing out neural representations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 565.923,
    "end": 577.332,
    "text": "And concerning to this relationship of stimuli and the interpretation of these stimuli and how they motivate action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 579.847,
    "end": 590.358,
    "text": " That's already a very much weaker claim in relation to mental content and things being inside organisms, but it is still in the same line of reasoning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 592.4,
    "end": 601.45,
    "text": "And there is also biosemiotics, which I want to focus a little bit more, because it concerns the use and interpretation of signs and symbols.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 602.23,
    "end": 608.658,
    "text": " which also emphasizes the embodied nature and the situated nature of meaning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 609.179,
    "end": 615.707,
    "text": "So you don't have meaning without those practices and without the use of embodied agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 617.87,
    "end": 626.657,
    "text": " We have to reject the idea that meaning are abstract symbols or they're going to be something that has to be in your mind and refer to something outside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 627.077,
    "end": 629.499,
    "text": "They're going to only exist in this type of relationship.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 630.06,
    "end": 638.266,
    "text": "And they can take many forms, including chemical signals like visual clues, behavior, words, like the word cat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 638.546,
    "end": 642.65,
    "text": "You can have and how you organize the word cat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 643.03,
    "end": 646.493,
    "text": "They are all symbolic and that fits also in that kind of structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 647.509,
    "end": 660.281,
    "text": " So they are very important for communication, obviously, because we do communicate in terms of pointing to the same shared notions of symbols in words and also other types of symbolic meaning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 662.002,
    "end": 663.824,
    "text": "And we coordinate life around them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 664.064,
    "end": 668.789,
    "text": "So living systems are then here characterized by semiotics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 670.033,
    "end": 674.655,
    "text": " by their ability of creating and interpreting and using these symbols in terms of their practices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 675.096,
    "end": 690.183,
    "text": "The fathers of biosemiotics started probably in the 19th century, and Uxgul is one of the most famous representatives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 690.683,
    "end": 698.447,
    "text": "Currently, we can find new authors like Hoffenmayer or Baker.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 700.871,
    "end": 715.017,
    "text": " So I try to organize a little bit in a specific model, in a type of model, in a visual story, how these two types of understanding meaning are being applied in terms of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 717.148,
    "end": 719.85,
    "text": " series of meaning historically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 720.271,
    "end": 727.256,
    "text": "So in biosemiotics, we have the pragmatics and you have the practice and they relate to dynamics and context dependent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 727.717,
    "end": 737.165,
    "text": "So you can see here on the top of the screen how agent, we have the agent relationship with its psychological and social aspects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 737.945,
    "end": 745.41,
    "text": " and bias semiotics is somewhat concerned with how correlation leads to prediction and beliefs and that leads to expectations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 745.931,
    "end": 763.282,
    "text": "And we also have other types of theories like bias tele-semantics and theories of computational syntax that tries to understand the dynamics and the mechanism of these relationships.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 766.004,
    "end": 792.203,
    "text": " and they are not really crossing each other they are not in the same um they're not talking about the same necessary things so how can these things be brought together that's when we i was thinking how we can bring this free energy principle and active inference in terms of those relationships so well",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 793.749,
    "end": 802.255,
    "text": " The free energy principle and active influence as we know and have been talking about probably in the past two classes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 803.516,
    "end": 807.439,
    "text": "It's a model that is interesting for that because it has like very minimal assumptions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 808.039,
    "end": 815.725,
    "text": "So it starts off from the idea that organisms act to maintain themselves in their expected biological and cognitive states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 816.245,
    "end": 819.708,
    "text": "So you're always talking, you're modeling and you're using",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 820.288,
    "end": 839.7,
    "text": " in these mathematicals to ground biological agents in a very embodied sense and they do so by minimizing their free energy right so they have these metabolical states that have to be minimized in terms of expenditure in terms of uncertainty given that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 840.848,
    "end": 843.111,
    "text": " the long-term average of free energy is entropy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 843.131,
    "end": 847.157,
    "text": "They want to minimize their uncertainty in terms of their metabolic states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 847.337,
    "end": 854.768,
    "text": "What that entails is that they have a specific range of states they want to stay in, like minimally to stay alive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 854.868,
    "end": 856.831,
    "text": "To stay alive, you have to do a bunch of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 858.168,
    "end": 863.714,
    "text": " things as a human being, but every single embodied agent would prefer to stay alive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 863.774,
    "end": 880.731,
    "text": "So there are some preferred basic states that will define how action will be taken first to maintain the metabolical states and how that coordinates with the environment, which entails that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 883.419,
    "end": 907.66,
    "text": " organisms and agents can be described in those terms, like an active inference tries to bring out those minimal assumptions in mathematical terms that try to express how reducing the probability of these non-anticipated states or states that are not favorable to maintaining the minimal metabolical needs will be reduced.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 908.881,
    "end": 930.962,
    "text": " And that can be cashed out in terms of a generative model, as we've been saying throughout the past actions, how this generative model sets specific times and organizes around specific parameters that can be described as trying to maintain those parameters within reasonable range.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 933.817,
    "end": 955.88,
    "text": " so by minimizing free energy on average and over time the system will self-organize so we'll bring out the parameters of its internal states that occupy a limited number of possible states we will set into a specific range that will then be that will be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 957.72,
    "end": 961.403,
    "text": " used as somewhat the base and the guide for this behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 961.784,
    "end": 967.529,
    "text": "You have two kinds of dynamics happening here, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 968.009,
    "end": 969.71,
    "text": "That's what I want to talk about a little bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 970.211,
    "end": 977.777,
    "text": "So we have then a phenotype that exists in a specific type of states, but that will have to coordinate two different kinds of dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 977.837,
    "end": 981.36,
    "text": "They're going to be stated here as complementary, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 981.681,
    "end": 983.963,
    "text": "You have closed states and have belief updated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 984.503,
    "end": 1000.593,
    "text": " So, with flow states, you have one type of modeling, which is the non-equilibrium steady state that is intrinsic, it's named here intrinsic information geometry, and you have belief updating that can be treated as extrinsic information geometry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1000.933,
    "end": 1005.136,
    "text": "And those are different types of modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1006.483,
    "end": 1011.305,
    "text": " or the different types of thinking about those processes that's most important, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1011.926,
    "end": 1021.11,
    "text": "So in terms of flow states, we can talk about a dynamical system and how you settle and self-organize specific parameters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1021.15,
    "end": 1033.376,
    "text": "And in terms of belief updating, we will be talking about Bayesian mathematics and Bayesian cognition and specific ways of cashing out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1034.657,
    "end": 1046.905,
    "text": " how an agent will change and behave over time in relation to the dynamics that is set into place in this state space of possible actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1049.884,
    "end": 1063.798,
    "text": " So, while dynamical systems will explore temporal and contextual dependence between environment and agent, we'll set this specific state space that has temporal dimension and has contextual dimension.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1064.318,
    "end": 1073.748,
    "text": "And once this state space is sort of established, we have more or less, it's a more or less deterministic approach",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1075.256,
    "end": 1092.967,
    "text": " to what what can possibly unfold so how changes changes and how behavior can be cashed out in terms of non-deterministic behavior and that is defined by a different type of probabilistic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1094.647,
    "end": 1100.148,
    "text": " thinking, which is the Bayesian mechanics of belief updating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1100.609,
    "end": 1111.451,
    "text": "So we have then a process of belief updating throughout weighted interactions within this range of possible states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1112.231,
    "end": 1120.673,
    "text": "So we do have dynamics and we do also have Bayesian process unfolding together in terms of mechanisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1122.972,
    "end": 1132.34,
    "text": " And with that, we do have mathematical statements providing a unifying perspective on formal approaches connecting behavior and dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1133.26,
    "end": 1139.605,
    "text": "So that's what active inference should be bringing about as a novelty in relation to older",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1140.726,
    "end": 1149.093,
    "text": " forms of understanding organisms, which can either cash things out in terms of behavior or in terms of dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1149.713,
    "end": 1157.159,
    "text": "So trying to bring these two things together is quite interesting to understand how symbols and what is semantics, for instance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1158.02,
    "end": 1162.383,
    "text": "So that's the question I will be asking right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1162.844,
    "end": 1164.365,
    "text": "Let's talk a little bit about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1166.081,
    "end": 1177.844,
    "text": " I'm drawing here from a quite interesting paper from Maxwell-Harmstead and Inejipolito.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1178.484,
    "end": 1183.086,
    "text": "Is free energy principle a principle for formal semantics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1183.986,
    "end": 1186.387,
    "text": "So what would be formal semantics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1186.467,
    "end": 1187.567,
    "text": "It sounds like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1189.008,
    "end": 1189.849,
    "text": " an oxymoron, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1189.929,
    "end": 1191.67,
    "text": "Like how semantics can be formal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1191.91,
    "end": 1193.051,
    "text": "How can you formalize it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1193.131,
    "end": 1195.512,
    "text": "So semantics, the theory of meaningful things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1196.173,
    "end": 1199.034,
    "text": "So how can that be empty of content?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1200.315,
    "end": 1210.142,
    "text": "Well, it has a few principles in which you can explain what formal semantics should, how a formal semantics should be understood.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1211.26,
    "end": 1223.42,
    "text": " First off, we have Bayesian formalism that does not necessarily have to commit to classical notions of representations, which are propositional in nature, have propositional semantic content.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1223.52,
    "end": 1225.403,
    "text": "So the idea is that you can",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1226.67,
    "end": 1232.033,
    "text": " you can use the notion of a representation in a way that is not necessarily contentful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1232.073,
    "end": 1233.553,
    "text": "So how that's going to be?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1234.434,
    "end": 1238.536,
    "text": "So under the free energy principle, representations can be formal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1238.616,
    "end": 1241.177,
    "text": "That's the argument they are bringing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1241.577,
    "end": 1251.782,
    "text": "Under the physics of flow, specifically dynamical system theories and information geometry, you can have these mathematical statements that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1252.563,
    "end": 1270.244,
    "text": " only represent possible specific ways of interacting, how these correlations will affect each other over time in this variational-based type of cashing out mathematical functions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1272.461,
    "end": 1288.846,
    "text": " In the sense we can talk about representation, how we can be understood under this formalism and what they are saying is that they are best understood as internal structures that enable the system to parse out their sensory sensitivities or the sensory streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1289.686,
    "end": 1298.309,
    "text": "So to organize them in specific parameters and also in the terms of their own Markov blankets and in their blanket states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1302.231,
    "end": 1326.24,
    "text": " Which is interesting here, which is the new genealogy of this paper, is that grounding the mathematical model in these mathematical properties of the system will avoid grounding these properties in terms of the properties of symbols and thematics in abstract or subjective notions of meaning, but in possible ranges of action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1328.737,
    "end": 1351.714,
    "text": " So summing up, what we had before was a type of computational model that had specific components that does not allow for the intelligibility of a cognitive component, which is intention, which is motivation, which context brain computer metaphors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1352.215,
    "end": 1357.339,
    "text": "We have new and cognitive activity often seen as a transfer of symbolic information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1358.288,
    "end": 1371.394,
    "text": " And cognition is a snapshot of this transfer, so it's totally dependent of that kind of symbolical transfer, which is really difficult to explain how that's going to be biologically plausible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1372.114,
    "end": 1382.438,
    "text": "And there's a lot of effort trying to do that, so if you're interested in this, there's a very vast wealth of literature, but they have to answer to this problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1384.571,
    "end": 1391.076,
    "text": " How the mind and brain needs to produce an impromptu response to inputs of the external environment all the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1392.657,
    "end": 1400.964,
    "text": "And the idea of this formal semantics, the author is trying to explain, is trying to include this component into the model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1401.124,
    "end": 1404.487,
    "text": "So you have a deflationary model about content.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1405.097,
    "end": 1415.464,
    "text": " So we have a formal semantics, we have semantics without content, interestingly, and formulated as a variation of free energy functional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1416.045,
    "end": 1423.75,
    "text": "So those structures that embody those processes correspond to states in the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1425.391,
    "end": 1430.975,
    "text": "And we also have the ecological component that can be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1432.81,
    "end": 1446.46,
    "text": " formalize in terms of this dual informational geometry that we, these two densities, probabilistic densities, one from the dynamics and one from the Bayesian describing behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1451.143,
    "end": 1451.643,
    "text": "And now what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1451.783,
    "end": 1455.686,
    "text": "So how can active inference be compatible to biosymmetics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1455.786,
    "end": 1459.029,
    "text": "Can it be actually compatible or is it even necessary?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1462.151,
    "end": 1462.351,
    "text": "Well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1464.679,
    "end": 1484.968,
    "text": " Active inference is a very general framework and then it does not really give us the tools to understand how encoding can happen in terms of symbols, how they can be broadcasted into collective action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1486.429,
    "end": 1489.67,
    "text": "Because prediction alone does not explain how do they come about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1489.81,
    "end": 1491.131,
    "text": "So in this sense,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1493.267,
    "end": 1510.054,
    "text": " We do have meaningful correlations that refer to the dynamics of one or two or more systems in terms of informational geometry that needs to be cashed out with predictive value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1510.154,
    "end": 1513.796,
    "text": "So how is this possible?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1516.345,
    "end": 1519.786,
    "text": " Well, we can talk about that in terms of shared attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1520.106,
    "end": 1524.508,
    "text": "That's one form of this kind of model to catch this out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1524.648,
    "end": 1532.291,
    "text": "So we have active inference capturing relevant statistical relations between environment and aging, and why",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1533.356,
    "end": 1551.923,
    "text": " We are, why I'm trying to think about here is how biosemiotics offer tools for disinformational sensitivities and statistical relations to catch symbols in terms of use and interpretation within communities of language users.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1553.904,
    "end": 1554.204,
    "text": "Hello.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1556.809,
    "end": 1560.191,
    "text": " And that can only happen, in this sense, via directed action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1560.332,
    "end": 1572.58,
    "text": "So the problem now will turn into how is it possible to specify the factors that are sufficient to constrain action and direct that into specific .",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1585.899,
    "end": 1595.306,
    "text": " about is european forestry i'm picking this example from a very like this different in this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1597.529,
    "end": 1607.892,
    "text": " I really recommend this story about how coordinated action, how states coordinate specific collective actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1608.512,
    "end": 1610.172,
    "text": "But that's not the point that I want to talk here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1610.272,
    "end": 1618.934,
    "text": "So here, let's unfold that a little bit in terms of the design of scientific forestry and think about scientific forestry as a practice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1620.279,
    "end": 1632.044,
    "text": " and a practice that has an organizing principle that will be the main important articulating story that can",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1635.287,
    "end": 1660.907,
    "text": " connect together how agriculture layouts plantations in specific ways and how collect collective farms will make specific choices in terms of this organization and how villages can structure themselves around one specific notion or one specific organizational principle and how everything can be calculated to make",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1662.094,
    "end": 1691.356,
    "text": " one's one type of practice which is agriculture is very general more legible and more manipulable for different kinds of communities so in that we will both manipulating the very concrete aspects of the land the terrain the products the workforce so it has a very encompassing effect over time and in a very concrete um in a very concrete sense",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1693.706,
    "end": 1718.222,
    "text": " And interestingly, when you talk about European forestry and how European forestry was modeling the terrain and how it was catching out value of these terrains, they were not trying to do that, to successfully depict the full range of diversity of the actual social activity and the actual activity of agriculture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1719.142,
    "end": 1747.568,
    "text": " or the richness of the vegetation or they are not even trying they didn't intend to do that that was not the point of this kind of modeling turned into a practice right those models generally represent specific slices of nature that were interesting for one specific official observer and that point is really important because that will",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1749.529,
    "end": 1758.436,
    "text": " how all these communities and how the terrain and how the forest will unfold over time within this specific perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1759.998,
    "end": 1769.406,
    "text": "So I bring here a quote that I really, really like because it tries to flesh this out in simple terms and very useful ones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1770.967,
    "end": 1774.63,
    "text": "So thinking that exaggerating only slightly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1776.087,
    "end": 1791.707,
    "text": " One might say that the interest in forest was resolved through one fiscal specific single number, which was the revenue that yielded from the timber that was extracted annually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1792.728,
    "end": 1793.869,
    "text": " Well, that's okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1793.889,
    "end": 1794.809,
    "text": "That's understandable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1795.21,
    "end": 1796.05,
    "text": "That's intelligible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1796.11,
    "end": 1800.573,
    "text": "And that happens every day in terms of how we understand our economy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1800.673,
    "end": 1813.022,
    "text": "But what is interesting about this quote is that the best way to appreciate how heroic was this constriction of vision is to notice what falls outside the field of vision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1814.574,
    "end": 1825.162,
    "text": " So what is missing from that is not the organizational principle of timber being valuable, but everything that was not there or was being excluded.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1825.562,
    "end": 1831.487,
    "text": "Trees and bushes and plants that hold little to no potential for that purpose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1831.787,
    "end": 1837.972,
    "text": "So missing out of that is flora diversity, foliar, fruits, etc., twigs and branches.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1838.172,
    "end": 1843.756,
    "text": "Missing out of that are insects and small animals, depending on this diversity, all this diversity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1845.754,
    "end": 1851.979,
    "text": " ecological organization falls out of the organizational principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1852.359,
    "end": 1855.362,
    "text": "And that has very concrete consequences that we still suffer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1855.802,
    "end": 1865.77,
    "text": "We still live in the height of this climate crisis that also starts from this kind of thinking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1866.17,
    "end": 1871.915,
    "text": "So it has really very material consequences for us and had for them at the time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1872.617,
    "end": 1887.258,
    "text": " If you read more about it, you know that the timber, by trimming and domesticating nature so much, like decreased in quality and then eventually decreased in value, which prompted them to try to reorganize that kind of storage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1889.301,
    "end": 1894.344,
    "text": " And what I want to call attention with the example is that also it brings some specific ways of talking about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1894.464,
    "end": 1900.507,
    "text": "It brings vocabulary that only exists in terms of this type of practice specifically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1901.127,
    "end": 1907.17,
    "text": "So this vocabulary constrains nature in a way by pruning what cannot be used",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1909.131,
    "end": 1926.825,
    "text": " so it generates more than a legible nature but then way of making nature intelligible and intelligible in a very specific certain way and we make that happen in terms of symbolizing things in specific terms but the symbols they don't exist in themselves they exist only in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1928.197,
    "end": 1951.199,
    "text": " organizing this social practice around them so when you replace nature with a term called natural resources we are doing exactly that it's specifying from a generalized notion of nature like flora and fauna becomes something valuable becomes a commodity but not everything right it trims",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1952.762,
    "end": 1953.203,
    "text": " practice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1953.803,
    "end": 1956.346,
    "text": "It separates competing species from valuables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1956.406,
    "end": 1963.954,
    "text": "So plants are symbolized as crops and what is the competing species are symbolized as weeds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1964.034,
    "end": 1972.662,
    "text": "They are not necessarily crops or weeds or anything like that in nature but they are that for the way we talk like that because we practice",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1973.985,
    "end": 1997.245,
    "text": " agriculture in a certain way that also help that that's the same for insects or small animals that consume these interesting crops so the material effect of that and how that only gains traction in the practice over time and how you have specific intention that has unintended consequences",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1999.053,
    "end": 2006.96,
    "text": " are necessarily here situated, contextualized, and embodied in terms of trimming specific types of attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2007.54,
    "end": 2025.836,
    "text": "And this attention will only shift to try to repopulate insect population, for instance, when you realize that this practice brought this specific effect in a certain way that affects the value of our understanding of nature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2029.218,
    "end": 2039.925,
    "text": " And that generates exactly a type of social coherence and social coordination, and how constraints create this coherence, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2043.448,
    "end": 2057.177,
    "text": "Well, now let's talk back again about formal semantics, while this formal semantics and negative inference sort of embeds one type of mathematical formalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2059.95,
    "end": 2066.072,
    "text": " symbols can only be grounded in specific concrete practices or in action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2066.993,
    "end": 2082.817,
    "text": "So, while active inference can be used as a tool to explain social understanding, it does do that in terms of generalized synchronization, okay, in a model of cognition that can be inactive and dynamic, but is still very general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2083.517,
    "end": 2085.418,
    "text": "In terms of biosemantics, we can",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2086.889,
    "end": 2102.3,
    "text": " think of it as a framework that might be compatible with active inference in terms of explaining the materiality of the environment in a non-reductive, in a non-reductionist way that tries to retain some naturalistic credentials.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2103.14,
    "end": 2114.348,
    "text": "So how the conventions are affecting and effecting the embodied agent in terms of forming those symbols and cashing out those epistemic values.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2117.77,
    "end": 2117.933,
    "text": " And.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2121.024,
    "end": 2148.635,
    "text": " Well, social interaction in this sense is not reduced to prediction, because in this sense the prediction will not be primitive, but it will be a result of a specific participatory construction of the social scene over specific organizational principles and actions that through the synchronization of this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2149.315,
    "end": 2171.972,
    "text": " generative models or the synchronization of those agents that can be described in terms of those generative models gain predictive value and when you model them then you have this type of understand the value of prediction in those senses so that allows",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2174.754,
    "end": 2199.494,
    "text": " That allows us to say that social actors in this sense can behave as if they have a generative model that synchronizes with that symbolic state of affairs, allowing them to understand each other's behaviors or to develop approximates of informational sensitivity or responsiveness to the same symbols and goals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2200.615,
    "end": 2208.399,
    "text": " They are approximate because they're obviously not going to be the same, but they have the same approximate orientation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2209.279,
    "end": 2213.941,
    "text": "So, in this sense, we don't have ever a view from nowhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2214.381,
    "end": 2229.388,
    "text": "We don't have ever this view that is only cashed out in terms of specific types of minds, but you also have types of minds shaped in terms of these very concrete organizations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2235.239,
    "end": 2240.643,
    "text": " That happens in a community like for humans, at least it happens in community of language users.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2241.223,
    "end": 2254.593,
    "text": "So the relationship with symbolic cues helps to select attention at that specific time as well pruning what should be ignored in socially constructed environments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2255.253,
    "end": 2264.8,
    "text": "So within a specific community of language users, some types of actions will be desirable and will be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2265.663,
    "end": 2273.306,
    "text": " deemed as true in that specific type of community and can be only evaluated under those terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2274.266,
    "end": 2282.069,
    "text": "So you can provide reasons for actions in that specific context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2282.749,
    "end": 2293.193,
    "text": "And you can talk about how rational that action is in terms of the conditions set by those communities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2298.656,
    "end": 2309.245,
    "text": " And that brings us to the idea that human cognition in this sense is never decoupled from these cultural norms that pushes and orients them over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2310.346,
    "end": 2324.018,
    "text": "So in no scale of behavior, and that's the interesting thing, and that's why active inference can be an interesting tool to model this type of human communities and this type of behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2324.929,
    "end": 2334.212,
    "text": " because it can come from the very dynamics, the very basic of dynamics to specific types of perception and scale up and more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2338.253,
    "end": 2354.137,
    "text": "So when you have the problem of symbols, like in these two decoupled possible community of users and symbols and embodied agents and things that do not combine, we can try to model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2354.847,
    "end": 2366.416,
    "text": " our agents in a way that we don't have this problem anymore because you're trying to include that very component into the model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2369.178,
    "end": 2378.085,
    "text": "So in this sense, we have active inference used as tools to explain social understanding, as generalized synchronization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2379.086,
    "end": 2380.407,
    "text": "And in understanding others,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2381.505,
    "end": 2406.343,
    "text": " in that sense because of this generalized synchronization model and assumed by those types of organizational principles we can also engage in terms of niche construction so we have a more or less deterministic way of understanding the nature of symbols because the more",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2407.165,
    "end": 2414.047,
    "text": " we interact and approximate, synchronize with the environment, we change the environment that might change us back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2414.187,
    "end": 2419.989,
    "text": "So you have an open system that is always and everywhere situated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2420.009,
    "end": 2424.75,
    "text": "And it can be modeled then with this type of predictive value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2425.871,
    "end": 2426.071,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2428.547,
    "end": 2444.806,
    "text": " That's more or less what I had in mind, and that's how I was trying to think about biosemiotics and a possible relationship with pre-energy principle and the formalisms of active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2446.347,
    "end": 2449.251,
    "text": "And yeah, I think this is it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2458.675,
    "end": 2459.015,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2459.115,
    "end": 2459.796,
    "text": "Thank you, Lorena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2459.816,
    "end": 2469.322,
    "text": "I'll just organize things a little in my room, but thank you very much for this excellent lecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2470.623,
    "end": 2476.147,
    "text": "Just as a kind of warm up, how did you come to see it this way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2477.216,
    "end": 2496.921,
    "text": " What brought you to this general question of semantics and how do you see that on your own path and see what other comparable or analogous approaches have been done in terms of a meta-analysis and proposal related to the naturalization of semantics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2501.481,
    "end": 2504.063,
    "text": " I think it's kind of hard to naturalize semantics, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2504.103,
    "end": 2506.485,
    "text": "I think there's a lot of effort in doing that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2506.705,
    "end": 2517.354,
    "text": "And it might be that if you think differently about how we naturalize those values, we might have better answers instead of trying to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2518.712,
    "end": 2525.317,
    "text": " instead of trying to fit the agent into the model, you try to fit the model into the agent, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2526.878,
    "end": 2527.999,
    "text": "I think that was the motivation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2528.059,
    "end": 2532.482,
    "text": "I think that's the interesting part of bio semantics in that sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2532.762,
    "end": 2534.643,
    "text": "It tries to make less assumptions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2535.604,
    "end": 2541.688,
    "text": "When you start from a hardcore assumption or model assumption, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2541.728,
    "end": 2546.412,
    "text": "That semantics is only within the mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2547.233,
    "end": 2549.855,
    "text": " then we have a very hard time trying to explain that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2550.616,
    "end": 2560.303,
    "text": "If you assume less about that, you might bring different types of explanations, of course, but they might be very, they'd be more interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2560.463,
    "end": 2574.194,
    "text": "I was trying to see how that actually, how that looks like when you bring these two things together in the terms of active inference and free energy principle, if that works, if that is possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2574.214,
    "end": 2576.956,
    "text": "I don't know if that answers your question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2581.88,
    "end": 2597.293,
    "text": " So wondering about that fundamental question and then coming across active inference or how elsewhere have people brought in the more formal and technical into this question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2598.535,
    "end": 2601.257,
    "text": "What do you mean by more like formal and technical?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2603.951,
    "end": 2604.791,
    "text": " Can you repeat that please?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2604.831,
    "end": 2623.978,
    "text": "Yeah, how does active inference help us or have continuity or difference with previous ways that people have connected the technical part from the, yeah, what you described as the formal semantics embeds the mathematical formalism and then the symbols are grounded in specific action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2624.638,
    "end": 2628.44,
    "text": "So has that been played out in other technical frameworks?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2629.599,
    "end": 2633.721,
    "text": " Well, we do have technical frameworks that try to organize that in terms of an activism, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2633.922,
    "end": 2635.603,
    "text": "And autopoietic and activism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2636.043,
    "end": 2644.428,
    "text": "But then we just have in these terms, the notion of symbols sometimes get loosely described.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2644.488,
    "end": 2646.569,
    "text": "And I think these guys are not really interested in that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2646.909,
    "end": 2649.11,
    "text": "I think they're trying to describe something else, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2649.811,
    "end": 2658.456,
    "text": "Or you can have some specific types of computational that, like, if you really buy into the mind computational things,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2659.482,
    "end": 2661.123,
    "text": " brain and computational mind metaphor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2662.224,
    "end": 2669.611,
    "text": "Then you have a hard time also to explain how semantics are built into that computation, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2670.572,
    "end": 2673.495,
    "text": "I don't think anyone has a very strong answer to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2673.755,
    "end": 2676.697,
    "text": "You have to really buy into the idea of information processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2677.543,
    "end": 2680.945,
    "text": " And that's what brought me a little bit to that thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2681.405,
    "end": 2687.529,
    "text": "If you buy into the metaphor of information processing, then you need to have semantics within the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2688.15,
    "end": 2695.754,
    "text": "If you try to lose a little bit this notion, if you try to understand process and information in different terms, what happens?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2696.775,
    "end": 2699.377,
    "text": "I think that was more or less the question that I was trying to ask.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2700.197,
    "end": 2724.618,
    "text": " and if active inference and biosemiotics can because they have less assumptions in terms of what happens inside the processing information content in the mind if that can if can if that can bring interesting like answers or if you can use as a model to organize behavior",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2728.274,
    "end": 2744.564,
    "text": " And there's another point that also brought me to this type of thinking was trying to understand how active inference can include the historicity of the agent, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2744.584,
    "end": 2753.129,
    "text": "Because I think that something comes across debated in active inference, how you bring novelty into the state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2753.269,
    "end": 2757.212,
    "text": "Like once you define that state space, the state space is more or less deterministic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2758.809,
    "end": 2761.091,
    "text": " because everything will happen within that specific range.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2761.171,
    "end": 2767.555,
    "text": "So how does novelty comes within this type of modeling?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2768.716,
    "end": 2770.177,
    "text": "So how can you explain that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2771.218,
    "end": 2772.579,
    "text": "If it does, I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2772.599,
    "end": 2779.804,
    "text": "It's more like an exploratory question that I was trying to make and see how that pans out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2780.105,
    "end": 2782.086,
    "text": "I actually also don't have an answer for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2785.848,
    "end": 2794.117,
    "text": " If you take seriously some more inactive claims that you need history of interactions to understand how agents behave.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2794.378,
    "end": 2796.98,
    "text": "You cannot understand agents without that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2797.601,
    "end": 2802.607,
    "text": "So how does active inference answer this question specifically?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2807.336,
    "end": 2809.378,
    "text": " I think that's still kind of debated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2809.398,
    "end": 2814.722,
    "text": "I'm not sure if there's new developments in this specific topic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2815.322,
    "end": 2817.764,
    "text": "But I remember, I think, two years ago was like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2819.651,
    "end": 2828.475,
    "text": " Specific papers from Di Paolo, I think, laying down a forking path, specifically focusing on that in the formalisms and etc.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2829.035,
    "end": 2835.217,
    "text": "So I don't know if these two things can bring a little bit of more to the conversation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2835.758,
    "end": 2836.138,
    "text": "Maybe not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2838.594,
    "end": 2855.788,
    "text": " this is great I'll just ask some some more general questions you're adding a lot with these thoughts so you said that social interaction in this account is not reduced to prediction so how would you unpack that and how would you relate this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2859.229,
    "end": 2878.162,
    "text": " i don't know exactly what term of art would go here but this kind of social epistemology that active inference provides us in contrast to say predictive processing so how is it that that we would or wouldn't reduce something to prediction and then what is it that active inference brings into that discussion",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2880.015,
    "end": 2890.384,
    "text": " Yeah, well, I think I have two points in that, like active influence in that sense has like a type of modeling that tries to include all the time and everywhere the embodied agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2890.464,
    "end": 2899.371,
    "text": "Like if you take seriously the idea of the model, the generative model is always accurately modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2900.737,
    "end": 2901.858,
    "text": " that specific agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2902.678,
    "end": 2908.62,
    "text": "And because it cannot be true or false that the model is, your current state is like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2909.181,
    "end": 2914.643,
    "text": "Like even if you are not feeling really well, you just know that you're not feeling well in relation to something else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2915.063,
    "end": 2923.367,
    "text": "And that story is still very accurate to your state's condition right now, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2924.147,
    "end": 2925.388,
    "text": "So the prediction,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2926.821,
    "end": 2938.283,
    "text": " it gains traction socially, at least in that sense, not in the specific detail of predictive processing, I think, because I think that's more complicated, but socially, in social cognition, at least.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2939.124,
    "end": 2953.947,
    "text": "We can talk about this predictive value, I think it's a more interesting way to do that, because the example that I use in terms of catching out symbols, we are using something that was meant in...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2955.41,
    "end": 2962.012,
    "text": " to make something intelligible that have very bad consequences that were not even close to be predicted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2963.073,
    "end": 2970.035,
    "text": "So in that sense, and how these consequences happen, the prediction cannot be there everywhere and all the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2970.055,
    "end": 2974.017,
    "text": "The prediction in this has an orientation as well, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2975.177,
    "end": 2980.139,
    "text": "So that's going to unfold only in terms of the orientation, but that's not all encompassing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2982.17,
    "end": 2985.451,
    "text": " So, well, what does that say about a prediction?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2985.491,
    "end": 2991.373,
    "text": "That's why I was trying to think of it as not being a primitive, but something that comes along with these dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2995.595,
    "end": 2996.215,
    "text": "But yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2997.695,
    "end": 3007.559,
    "text": "Well, this is a very deep and prescient point that because the causal structure of the world changes, historicity, agents change, they learn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3008.618,
    "end": 3012.761,
    "text": " and they attend, and then the niche changes with StigmaG and niche modification.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3012.801,
    "end": 3021.468,
    "text": "So because things really do change through time, then just training a data set at one time point",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3022.774,
    "end": 3037.771,
    "text": " And then using that same generative model and carrying it forward, it's like picking a speed and a direction when you're on a winding road and just saying, all right, now let's turn on cruise control right now and just keep going in this direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3037.811,
    "end": 3038.832,
    "text": "It's working right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3040.934,
    "end": 3057.983,
    "text": " so then to connect that to the legibility of the forests as the causal model changed and externalities were not taken into account and so on all these different features you brought in so now is active inference and cognitive modeling cognitive technologies",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3058.982,
    "end": 3074.595,
    "text": " increasing our legibility of perception cognition and action through surveillance technology and other mechanisms such that there could be slash we expect there to be also",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3077.81,
    "end": 3103.213,
    "text": " hidden Dynamics and externalities that we are also failing to see when we make some aspects of cognitive systems legible in the way that research in the neurosciences is happening towards yeah I think in this sense like if you're trying to do that you cannot have a no we are like in a model it encompasses everything right it would be non-informative",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3104.289,
    "end": 3107.957,
    "text": " In terms of when you do that, you have one interested thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3108.137,
    "end": 3109.561,
    "text": "You're interested in something, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3109.981,
    "end": 3114.331,
    "text": "You have one thing in mind when you're trying to flesh out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3115.785,
    "end": 3117.246,
    "text": " in terms of cognitive modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3117.566,
    "end": 3125.29,
    "text": "So how that applies to these more all-encompassing situations, I think that model is how I'm trying to ask this question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3125.671,
    "end": 3129.353,
    "text": "So you can model them in this sliced sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3129.513,
    "end": 3134.135,
    "text": "And that's what we do as scientists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3134.236,
    "end": 3136.097,
    "text": "And that's how we learn about things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3138.101,
    "end": 3144.344,
    "text": " that only way of seeing that very specific model is not all encompassing for all answers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3144.644,
    "end": 3150.808,
    "text": "So how can you use that in comparison to other situations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3150.828,
    "end": 3153.209,
    "text": "So how can you integrate this type of thing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3153.269,
    "end": 3153.649,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3154.33,
    "end": 3157.551,
    "text": "I don't have an answer for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3157.611,
    "end": 3162.194,
    "text": "I don't know if we do have an answer for this type of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3163.615,
    "end": 3191.37,
    "text": " question currently but I think it's a very valid question to ask because also in the terms of sometimes applying that socially that sort of reifies in a way and that it becomes an organizing principle that becomes somewhat reified so keep an eye for this kind of metaphorical use like assuming a little bit that all this talk can be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3193.089,
    "end": 3202.101,
    "text": " metaphorical and it can be interesting and useful to catch them out in these terms because we don't have other ways to talk about them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3202.121,
    "end": 3208.31,
    "text": "So how we don't reify them and how they are, you know, because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3211.024,
    "end": 3217.768,
    "text": " I'm having a hard time to get there, but I think I'm making the point of people criticizing the causal primacy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3218.129,
    "end": 3233.297,
    "text": "So when you reduce these complex systems to one single cause, cashing out everything that organizes these complex systems in one primal cause, then you are losing the complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3234.118,
    "end": 3235.379,
    "text": "However, if you don't do that,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3236.547,
    "end": 3240.17,
    "text": " How can you slice it out to understand the system?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3240.831,
    "end": 3250.079,
    "text": "So I think that's the two tensions here that I'm kind of trying to propose as a question instead of an answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3252.014,
    "end": 3256.778,
    "text": " I don't know if that makes sense, but I think, yeah, I hope people continue that discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3257.619,
    "end": 3262.463,
    "text": "I'm going to build on that just to kind of maybe circle around that because it's really important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3262.503,
    "end": 3268.488,
    "text": "So in the forestry case, the realist perspective, again,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3269.409,
    "end": 3285.917,
    "text": " using retrocasting the way we or contemporary discussions some of them in the active inference and free energy principle space are the realist says that region of land is just economic potential it is a natural resource that becomes a kind of handle",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3287.202,
    "end": 3305.071,
    "text": " the instrumentalist perspective takes a step back and says it's as if that piece of land is a natural resource so yeah the territory is indescribable and there's still a space for mystery but then when the proxies come out because policies are being selected the as if",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3306.095,
    "end": 3313.478,
    "text": " in some ways carries similar consequences to the actual, because they, and they may totally agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3313.698,
    "end": 3326.984,
    "text": "And the realists and the, and the instrumentalists might be like, yeah, it is economic potential or represents, or it could be treated as such, or it could be engaged with as such like that cognitive diversity can align on the social policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3328.504,
    "end": 3334.369,
    "text": " that then connects to these broader social questions and histories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3335.009,
    "end": 3338.612,
    "text": "And so it's kind of interesting, like what work does this instrumentalism do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3338.652,
    "end": 3340.153,
    "text": "Like, oh, it's just a principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3342.014,
    "end": 3344.376,
    "text": "What work does it do and what doesn't it do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3344.917,
    "end": 3355.245,
    "text": "And the ways that science and technical engineering fields are and aren't deployed alone or together with other considerations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3356.746,
    "end": 3358.007,
    "text": "Yeah, that's very interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3358.047,
    "end": 3358.227,
    "text": "Like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3358.826,
    "end": 3366.432,
    "text": " In the sense that either if you're realist or instrumentalist about that, like if you think like models are not either true or false, they're just models, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3366.573,
    "end": 3371.897,
    "text": "They might have views and they might be capturing real properties.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3372.157,
    "end": 3382.226,
    "text": "But the problem is in this conversation, even when you push them, like you have realists and have instrumentalists try to like loosen up a little bit these assumptions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3383.615,
    "end": 3389.456,
    "text": " They still come, they still end up refining those principles and taking them to be more or less true or false.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3390.477,
    "end": 3390.677,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3391.317,
    "end": 3392.597,
    "text": "Well, that's kind of a plot twist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3392.917,
    "end": 3395.258,
    "text": "It's like you're appealing to what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3395.698,
    "end": 3403.14,
    "text": "Surprise minimization as unifying the diversity responses that the realist and instrumentalists do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3403.18,
    "end": 3411.142,
    "text": "So then does that make surprise or cognitive inertia like the err principle where the maze just ends?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3411.843,
    "end": 3418.348,
    "text": " and it explains itself, or how does that play in a pluralistic scientific setting?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3420.49,
    "end": 3426.574,
    "text": "Yeah, you can have a third answer to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3426.594,
    "end": 3438.503,
    "text": "I think the answer that I try to give is more eliminativist in the sense that it eliminates the causal primacy of these two modes of answering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3441.277,
    "end": 3453.363,
    "text": " When you think, I'm thinking, I have in mind now, like actually just to try to make sense of that, when you think about biological information, you can think about biological information as being real world, as being metaphorical and instrumental.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3454.324,
    "end": 3465.09,
    "text": "Or you have these guys like Susan Oyama or Richard Lewontin, they try to bring some, they are against this cause of primacy, they try to advocate for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3466.13,
    "end": 3494.679,
    "text": " systems that do have that but they have like a lot of more going on so that that cannot be the only answer because those systems is not everywhere scientifically cash they don't have to be everywhere that so for example going back to the to the forest forestry so the realist is going to say that territory is valued property and the the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3496.081,
    "end": 3504.104,
    "text": " In the sense, the instrumentalist can look as if, and it can be used as if, but it's not necessarily value property.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3504.124,
    "end": 3505.164,
    "text": "It doesn't matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3505.445,
    "end": 3514.568,
    "text": "You can say like, well, this terrain is seen from one perspective as value property, but it also has other uses around them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3514.988,
    "end": 3525.252,
    "text": "So you had to be more inclusive of this diversity because the only organizational principle around that specific terrain is not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3526.483,
    "end": 3532.351,
    "text": " only to generate value, or if it does, this value doesn't have one single output.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3532.952,
    "end": 3535.716,
    "text": "It can have more than one output in terms of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3537.256,
    "end": 3551.629,
    "text": " very specific terms, you can catch it out very materially, this terrain that has to provide monoculture has to provide also value for the diversity of the fauna and the diversity of the flora around it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3552.21,
    "end": 3555.873,
    "text": "And that is not included in the model because that's not what the model is done for.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3556.114,
    "end": 3559.016,
    "text": "The model has its specific use and that's fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3559.997,
    "end": 3562.78,
    "text": "However, that does not reduce the terrain to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3564.515,
    "end": 3589.694,
    "text": " and well when you're talking about cognition that might be more complicated but i think it's easy it's an easy way to talk about this causal primacy when you talk about uh forestry because we are very much now experiencing this climate crisis and we see these things happening right now and how difficult because this this type of thinking is built over time and so well",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3590.865,
    "end": 3594.006,
    "text": " fixed in the way we see things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3594.266,
    "end": 3597.748,
    "text": "And we are understanding how hard it is to change that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3598.128,
    "end": 3602.469,
    "text": "It's a paradigm shift that needs to happen for that to change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3603.59,
    "end": 3607.391,
    "text": "It's not necessarily the model that is right or wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3607.551,
    "end": 3609.812,
    "text": "It's just how you understand and apply them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3612.338,
    "end": 3614.759,
    "text": " So there are pragmatics into that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3614.799,
    "end": 3620.582,
    "text": "It's not only an instrumental, but it has something that the instrumentalist take does not capture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3620.662,
    "end": 3631.066,
    "text": "And I don't know how to cast it out in one single word, but that's what biosemantics was offering, the idea of practice and pragmatics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3631.627,
    "end": 3636.669,
    "text": "I don't know if it's the whole story, but it's another point into that story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3639.42,
    "end": 3647.049,
    "text": " A lot of great points all connect that note of pragmatism to a little bit of the active inference formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3647.789,
    "end": 3655.318,
    "text": "So when it comes to policy selection, behavior selection, some but not all cognitive entities can act as if",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3655.919,
    "end": 3682.681,
    "text": " they're calculating expected free energy so these are the active the truly active entities whether they're simple or whether they're sophisticated they do planning expected free energy is how those agents are being modeled as if they're making decisions and it consists of the pragmatic and the epistemic value that's how these different policies are evaluated and so I see two angles or windows that that supports",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3683.823,
    "end": 3708.235,
    "text": " least from my non social sciences background a new kind of meeting in the middle there so first is the expansion of pragmatic value under the principle that surprise minimization or bounding is the imperative right there in the pragmatic value it doesn't have to be just body temperature or financial income we can expect and prefer",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3709.446,
    "end": 3712.195,
    "text": " ourself to be learning new things or meeting new people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3712.697,
    "end": 3715.606,
    "text": "And so we can load into the pragmatism",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3717.128,
    "end": 3724.414,
    "text": " different goals that under a narrower definition of utility or pragma have not traditionally been included.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3724.434,
    "end": 3731.78,
    "text": "So I think that first way is it speaks to a more inclusive concept of utility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3732.18,
    "end": 3739.406,
    "text": "You might say, I'm also de-risking on forest fires alongside the timber and already you have now plural pragma.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3739.966,
    "end": 3742.288,
    "text": " So I think that's the kind of crossover.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3742.748,
    "end": 3751.173,
    "text": "And then the deeper and second, and not saying there's only two ways that the conversation continues, we have epistemic utility in terms of epistemic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3751.974,
    "end": 3762.101,
    "text": "And so the balance and the weighting between pragmatic value and epistemic or learning-oriented activity overall helps control...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3763.667,
    "end": 3778.113,
    "text": " a dynamic balance with just like how tight is the grip and the preference overall and maybe we have uh some preference for timber to be exported from a region",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3779.113,
    "end": 3796.471,
    "text": " but we really don't know we don't have long-term modeling we don't have deep causal analysis and so we're going to put five percent on the pragmatic extraction and other pragmatic features and leave the rest of the policy in an exploratory mode",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3797.583,
    "end": 3825.431,
    "text": " and come to a blend that's not just on the the spectrum from explore to exploit which is how this has been approached in like cognitive sciences previously it's like this is the third thing where policies that are on the frontier of exploring and exploiting rise to the top through their contributions to pragmatic and epistemic value and we made the model so that isn't to say that that is what's happening on the ground or maybe that's just the instrumentalist perspective",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3828.632,
    "end": 3835.921,
    "text": " Yeah, but if it's an instrumentalist perspective, it might be a good one, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3836.161,
    "end": 3841.407,
    "text": "In the sense, the idea of inclusion is kind of the interesting one, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3841.627,
    "end": 3847.114,
    "text": "Because if you reify this notion of maximization, because you can use that in certain ways to understand",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3847.93,
    "end": 3850.392,
    "text": " What happens when you're modeling something?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3850.812,
    "end": 3853.314,
    "text": "What is the limit of that maximization?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3853.374,
    "end": 3858.899,
    "text": "So you can model agents as if maximizing utility, for instance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3859.639,
    "end": 3868.847,
    "text": "But maximizing utility is something that needs to be balanced out with the utility of everyone around them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3868.947,
    "end": 3871.789,
    "text": "And that's not trivial how that happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3872.19,
    "end": 3873.651,
    "text": "And even if it does,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3874.46,
    "end": 3885.005,
    "text": " And even if it were trivial, it's not something that maps out completely identically with, oh, every single agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3885.045,
    "end": 3888.227,
    "text": "They don't, that's not, there's not going to be, there's going to be diversity there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3888.827,
    "end": 3895.251,
    "text": "So how do you make that notion more inclusive and less reified in that sense?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3895.791,
    "end": 3904.115,
    "text": "Because then if the more you reify, the more you single it out into around only one general type of understanding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3905.029,
    "end": 3918.995,
    "text": " So when you think them more individually, then you kind of lose, you, you lose that strength of this one single principle organized, like the one single way of catching out utility.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3919.235,
    "end": 3920.516,
    "text": "That's not the principle, like, sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3922.517,
    "end": 3934.202,
    "text": "So I think that's like, speaks a lot with like the, the type of instrumental use and the type of pragmatism and how the time, the types of application of this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3935.828,
    "end": 3936.689,
    "text": " practices, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3937.009,
    "end": 3942.215,
    "text": "Remember, in the sense of the scientific forestry, it's also a practice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3942.375,
    "end": 3944.397,
    "text": "It's not something that is true in itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3945.338,
    "end": 3947.08,
    "text": "It's true in terms of practice, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3947.12,
    "end": 3950.284,
    "text": "In terms of applications, in terms of building communities around them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3950.844,
    "end": 3954.288,
    "text": "So without this use, they have no grounding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3957.506,
    "end": 3974.854,
    "text": " yeah one really strong and salient point that i got from the lecture was about generalized synchrony and it's almost funny that we have to advocate or delineate generalized synchrony because the alternative the absence of generalized synchrony",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3975.919,
    "end": 3999.956,
    "text": " is just like kind of like an ideal gas it's like there wouldn't be regularities in society we wouldn't be clustered in space or in time we wouldn't have information and communication and we wouldn't have what differentiates a society or a group or civilization or a colony or whatever from literally anything else",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4001.115,
    "end": 4009.376,
    "text": " So generalized synchrony is almost like all of the space between nothing and anything happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4010.577,
    "end": 4013.877,
    "text": "And then it supports all these different scenarios.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4014.017,
    "end": 4020.678,
    "text": "We could have this kind of mind in this kind of brain and this kind of environment and this kind of niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4021.258,
    "end": 4026.199,
    "text": "And so we can talk about the ant colony forging algorithms that work in the desert.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4026.919,
    "end": 4030.06,
    "text": "And there might be mutual non-exhausted",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4031.425,
    "end": 4059.442,
    "text": " open-ended change of algorithms and what works in a different setting and with humans we have the sophistication and the history and the scope and the scale and all of these metas and weaving with is and ought and our own forward going direction which is really the moment where it goes from being a forensic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4060.555,
    "end": 4084.848,
    "text": " sociology to the real-time sense-making and action selection based upon our cognitive models in the broader sense which includes humans and non-human agents but it's like that's when it goes from being more than just an understanding when that understanding translates to an action policy and they do then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4088.268,
    "end": 4090.609,
    "text": " it matters as much as anything does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4093.35,
    "end": 4105.355,
    "text": "Yeah, one of the criticisms of the active inference, I think, is that it's too general to single out specific constraints that orient action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4106.215,
    "end": 4114.038,
    "text": "That's what I saw, thinking about how symbols are brought about in community of language users.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4116.047,
    "end": 4129.772,
    "text": " Assuming that the symbols are only meaningful throughout these histories and practices can help us to apply this type of general story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4132.983,
    "end": 4138.664,
    "text": " navigating specific epistemic communities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4138.704,
    "end": 4144.025,
    "text": "And I think that's the work that Mahó is going to bring along in terms of epistemic communities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4144.065,
    "end": 4145.565,
    "text": "And then you single out in them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4145.766,
    "end": 4155.367,
    "text": "So you have these communities of language users in which specific practices create specific orientations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4157.588,
    "end": 4159.108,
    "text": "Yeah, one thought on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4160.436,
    "end": 4178.952,
    "text": " asking like what does uh active inference or linear regression or some other method again this is who knows is this just deep esoteric instrumentalism but asking what does it have to say about this symbol what is what does active inference have to say about the letter e in english",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4181.26,
    "end": 4192.586,
    "text": " Can it be as simple as to say that that's a category error and that you could make a toy example or a pedagogical example where symbol one and symbol two oscillate in a multi-agent simulation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4193.206,
    "end": 4206.273,
    "text": "Or you could make a generative model for an alphabet and leave it abstract, but you're never going to connect to the historiosity and the real enactment of the English letter E unless you're confronting...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4207.85,
    "end": 4212.576,
    "text": " the minute particulars and the actual embodiment of that letter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4213.818,
    "end": 4222.85,
    "text": "And then there's different core screenings, different iterated modeling decisions, different questions about how do you include and participate in a different stage of the scientific process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4222.89,
    "end": 4225.233,
    "text": "But it's like, you're in the specifics at that point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4226.42,
    "end": 4230.463,
    "text": " Active inference doesn't have an opinion on the letter E because we wouldn't want it to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4230.483,
    "end": 4233.205,
    "text": "It would be too opinionated about the wrong things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4233.245,
    "end": 4240.511,
    "text": "It'd be making assumptions and bringing axioms into play that would be extremely constraining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4242.972,
    "end": 4250.776,
    "text": " And so it remains general as a framework and the free energy principle even more slash differently so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4251.436,
    "end": 4255.218,
    "text": "But when we get into the actual, that's where we're connecting the real systems of interest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4255.879,
    "end": 4267.404,
    "text": "But how can we make claims and advance them socially about systems of interest when we're not even, it's like comparing bridge building as a concept with this bridge right here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4268.765,
    "end": 4272.567,
    "text": "It's a little bit like a category disconnect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4275.993,
    "end": 4300.263,
    "text": " yeah well it depends on also how you single out some things they are not they're just you just don't do that because they're just not interesting enough right there's nothing like that comes out of it in terms of this bridge right here in a single how did you put it again like your category of bridges in this bridge right here",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4300.851,
    "end": 4301.151,
    "text": " Right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4301.852,
    "end": 4307.635,
    "text": "When you do that, you can learn something about the category in terms of this single one right here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4309.016,
    "end": 4310.697,
    "text": "But it's not exhaustive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4312.037,
    "end": 4313.778,
    "text": "That's, I think, one point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4313.838,
    "end": 4316.44,
    "text": "It's not exhaustive and it's not right or wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4316.52,
    "end": 4317.681,
    "text": "It might be better than",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4320.239,
    "end": 4326.8,
    "text": " I think the idea like you can make some comparisons in terms of like predictive value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4326.82,
    "end": 4329.821,
    "text": "You can have like better or worse ways of doing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4330.581,
    "end": 4332.261,
    "text": "And then it gains more utility.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4333.901,
    "end": 4342.883,
    "text": "Okay, connecting this to also this non-exhaustive nature and where the power of a generalizable framework is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4343.423,
    "end": 4347.684,
    "text": "Let's talk about the category of Golden Gate Bridges in San Francisco.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4348.504,
    "end": 4352.386,
    "text": " So there's only one actual bridge there, but we're generalizing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4352.446,
    "end": 4358.929,
    "text": "And so somebody makes a state space and says, well, I'm exploring if there was more than two end to end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4358.949,
    "end": 4370.354,
    "text": "So they're exploring the state space of topologies of bridge and someone else is exploring the state space of color and somebody else is exploring the state space of traffic dynamics and someone else is combining two of them or combining all three of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4371.194,
    "end": 4376.717,
    "text": "And then that's the conversation is which map of this category of state spaces is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4378.14,
    "end": 4382.363,
    "text": " category of adjacent possibles as we chose to model it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4383.803,
    "end": 4388.847,
    "text": "And if you don't include traffic flow, don't be surprised that it's not going to take that kind of data or make that kind of prediction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4389.667,
    "end": 4393.83,
    "text": "And some variables matter and some matter in combination and some don't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4394.45,
    "end": 4405.176,
    "text": "But when we model, we kind of build these regions or adjacencies to the actual, which is where the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4408.757,
    "end": 4418.829,
    "text": " And then we have an adjacent possible as modelers and sense makers, including absurd counterfactuals and state spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4419.73,
    "end": 4422.373,
    "text": "And then the state spaces are mobilized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4426.698,
    "end": 4428.7,
    "text": "Yeah, in a way, but if you talk about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4429.304,
    "end": 4452.9,
    "text": " like specific type of engineering yes and that since they are mobilized and they are not true or false you can use false models that is to function that's not like you can you have specific uses of things that you know they're not really true like the thing that tolerate totally hilarious uh type of modeling the uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4454.881,
    "end": 4476.688,
    "text": " social uh the solar system there's two years that you navigate you know in the desert even though it's not really accurate but if you want to go from a to b it helps you to do that that's a different thing right like it doesn't it's not true or false but when you think about agents in terms of like and if bringing back to the idea of uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4478.087,
    "end": 4493.197,
    "text": " symbols being only cashed out in terms of community of users that have histories and they are made useful, they are made meaningful in terms of their practices, then you don't have ever this disconnect, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4493.697,
    "end": 4499.041,
    "text": "You can think about this cognition as always connected to these specific types of practicing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4499.361,
    "end": 4507.286,
    "text": "You can even single out some moments of it and try to see what you learn from this kind of slice of time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4508.956,
    "end": 4525.467,
    "text": " But when you think about the whole story of the cognitive system, if you're going to really think of it in terms that it's valuable, you cannot disconnect from the state, let's say, the state space of its practice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4528.469,
    "end": 4528.85,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4528.95,
    "end": 4534.454,
    "text": "Well, do you have any closing thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4535.728,
    "end": 4545.512,
    "text": " thoughts or what are you looking forward to with the discussion section and the rest of the course just by way of wrapping up and letting people know any other thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4546.772,
    "end": 4552.394,
    "text": "Yeah, it would be cool to explore these ideas that we've been actually bringing along here, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4552.594,
    "end": 4564.639,
    "text": "How we can go with that like instrumentally realistically or how can we understand this general synchronization of the model in terms of specific",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4565.928,
    "end": 4585.443,
    "text": " instantiations and how informative they are is that really interesting or how can these things be actually reified in terms of modeling and if that happens does that have any specific consequences actually or not right maybe not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4588.829,
    "end": 4610.884,
    "text": " awesome well very ambitious and excellent lecture so thank you very much lorna and yeah talk to you just keep in mind i was just like trying to ask these questions i don't also have those answers like it's i i found very little about active inference and semiotics like produced i found like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4611.724,
    "end": 4627.163,
    "text": " a few papers so that's very exploratory actually so you also are invited to think of these things and explore a little bit them further if it's possible yeah cool epic all right thank you learn i see you in a couple of weeks farewell see you",
    "speaker": "SPEAKER_01"
  }
]