[
  {
    "start": 10.233,
    "end": 11.134,
    "text": " Hello and welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 11.394,
    "end": 13.376,
    "text": "Welcome to Act-Inf Lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 14.157,
    "end": 20.104,
    "text": "We're in live stream number 21.04 on April 27th, 2021.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 20.945,
    "end": 25.81,
    "text": "And today we are in the fourth of a series of conversations with John Boyk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 25.95,
    "end": 29.934,
    "text": "So John, it's been really awesome to get to know about you and your ideas and work",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.515,
    "end": 59.194,
    "text": " with you on these jam boards so as i sort of set things up for a second and share the jamboard link with the live chat go ahead and just re-catch us up and then i'll meet you on the first slide in just a minute okay sounds good thanks uh so my name is john boyk i'm a courtesy faculty at oregon state university um and the series of discussions that we've been having is on the is on a paper a series of papers that i just published in the journal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 60.634,
    "end": 81.413,
    "text": " sustainability it's a three-part series the topic is well the title is science-driven societal transformation parts one two and three so we've this is our fourth get-together here and we're just finishing up our discussion of the last in that series part three which is the subtitle design",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 82.93,
    "end": 97.614,
    "text": " And we covered quite a bit in that paper, part three, but now today we're going to focus on just one aspect of that, which is the leader framework, local economic direct democracy association framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 98.154,
    "end": 103.756,
    "text": "This is a, I'm terming it a prototype of design for new societal systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 104.556,
    "end": 110.378,
    "text": "And as a reminder to listeners, we're talking about the de novo design of new societal systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 111.459,
    "end": 114.501,
    "text": " specifically using a club model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 115.201,
    "end": 127.728,
    "text": "So the societal systems for a club, the club is a small community somewhere, something larger than say a thousand volunteer participants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 128.728,
    "end": 133.171,
    "text": "That's how the series itself proposes an R&D program.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 134.431,
    "end": 136.873,
    "text": "And that's the strategy for change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 141.203,
    "end": 146.524,
    "text": " community level in cooperation with the global scientific community who is working on the technical aspects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 148.385,
    "end": 168.37,
    "text": "Then field trials occur at the club level and if the new systems deliver as promised and they promise substantial improvement in social and environmental quality, economic security and various things like that, then the idea is that the club model would grow and spread and spread to new locations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 169.352,
    "end": 176.414,
    "text": " and new testing and new trials and eventually would spread on a near global basis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 178.234,
    "end": 180.275,
    "text": "So, are we on slide one yet?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 181.175,
    "end": 182.136,
    "text": "We're ready on slide one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 183.576,
    "end": 188.177,
    "text": "Okay, so that's just our list of discussions we've had.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 188.217,
    "end": 192.318,
    "text": "You can check out the links there for the previous YouTube videos.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 195.059,
    "end": 197.52,
    "text": "And slide two, if you would go there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 200.051,
    "end": 202.792,
    "text": " is just where to go for more information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 202.892,
    "end": 215.136,
    "text": "So my website for this project is called principledsocietiesproject.org, and it gives links to the series, gets some background information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 216.136,
    "end": 222.858,
    "text": "Actually, on there is a live or interactive model of the leader framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 223.018,
    "end": 229.4,
    "text": "So a big part of what we'll be talking about today is actually on the website if you want to run the model yourself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 231.636,
    "end": 258.169,
    "text": " so there you go there for more information and then third slide so today's topic again is the lead of framework local economic director democracy association these are ideas from my 24 uh 2014 book called economic direct democracy that book is available for free on the website or if you want to spend money you can go to amazon and buy it there",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 261.989,
    "end": 268.733,
    "text": " And along with that book, I published a simulation model of the leader framework, or at least parts of the leader framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 269.454,
    "end": 275.858,
    "text": "And that is in the International Journal of Community Currency Research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 276.478,
    "end": 277.899,
    "text": "So links are there for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 278.779,
    "end": 283.502,
    "text": "And again, all of these links are available on the Principled Society's project website.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 287.364,
    "end": 287.965,
    "text": "Okay, so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 288.692,
    "end": 296.62,
    "text": " Now, why would I want to discuss, this is slide four, why would I want to discuss the LIDA framework in this three-part series?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 297.22,
    "end": 297.861,
    "text": "A few reasons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 298.101,
    "end": 310.173,
    "text": "One is that the LIDA, the design of the LIDA framework, maybe you should say that the LIDA framework is intended as an integrated societal systems architecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 310.822,
    "end": 312.864,
    "text": " or what I've been calling a cognitive architecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 313.524,
    "end": 329.956,
    "text": "The idea behind this whole series, behind this work, is that a society, large or small, is a cognitive organism, and its societal systems, which, for example, economic systems, legal systems, governance systems, etc., act as a cognitive architecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 330.337,
    "end": 335.661,
    "text": "So when discussing the idea of societal transformation, my focus here is on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 336.956,
    "end": 349.02,
    "text": " creating new societal systems, de novo societal systems, de novo design, so that they function as cognitive systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 349.38,
    "end": 352.462,
    "text": "They facilitate societal cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 355.042,
    "end": 358.944,
    "text": "And this is a fitness-based, evidence-based R&D project.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 359.024,
    "end": 363.805,
    "text": "So the idea would be that you could assess how well one design works",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 365.899,
    "end": 367.28,
    "text": " is doing over another design.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 368.041,
    "end": 374.585,
    "text": "And eventually communities could choose designs that function very well and are fit for purpose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 375.786,
    "end": 379.568,
    "text": "All right, so the LIDDA framework embodies the cognitive viewpoint.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 380.389,
    "end": 387.774,
    "text": "It also was designed to be implemented via the club model, which I talk about in part two of the series.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 388.732,
    "end": 390.073,
    "text": " That's the strategy for change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 390.914,
    "end": 392.115,
    "text": "Number three is here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 392.275,
    "end": 395.197,
    "text": "The reason is that it involves integrated systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 395.597,
    "end": 402.342,
    "text": "So in the series, I talk about six overarching systems, legal, governance, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 403.083,
    "end": 408.266,
    "text": "And the LIDAR framework integrates most of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 408.286,
    "end": 414.711,
    "text": "And finally, there's a published simulation model available, at least for some economic aspects of the LIDAR framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 415.412,
    "end": 417.033,
    "text": "And at the time, and I",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 423.527,
    "end": 427.348,
    "text": " ANOVO ECONOMIC SYSTEM THAT I'M AWARE OF.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 427.368,
    "end": 431.429,
    "text": "NUMBER FIVE.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 433.49,
    "end": 433.75,
    "text": "ALL RIGHT.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 434.03,
    "end": 442.313,
    "text": "SO I'LL GET INTO THE, WE'LL TALK A LOT ABOUT THE SIMULATION TODAY AND A LITTLE BIT ABOUT THE, YOU KNOW, THE STRUCTURE OF DELITA.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 442.973,
    "end": 445.374,
    "text": "BUT LET ME JUST OFFER A FEW WARM-UP THOUGHTS.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 448.575,
    "end": 452.696,
    "text": "THE DELITA ECONOMY IS NOT",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 453.098,
    "end": 456.761,
    "text": " like what we face in normal economy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 457.121,
    "end": 458.422,
    "text": "It's fundamentally different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 459.443,
    "end": 467.99,
    "text": "And in particular, it is a democratic, it is a cognitive architecture, as I've said, and it is deeply democratic and transparent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 468.69,
    "end": 480.179,
    "text": "So in the leader economy, money, there is money, both the national currency in America, the dollar, and a local digital currency that I call the token.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 481.209,
    "end": 490.412,
    "text": " So those two currencies are used as a voting tool in a highly transparent, fair, and deeply democratic process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 491.372,
    "end": 497.154,
    "text": "And as we talked about last time, money is already used as a voting tool in our world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 498.334,
    "end": 504.856,
    "text": "It's just that it is a non-transparent, non-democratic voting tool for the most part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 504.956,
    "end": 510.398,
    "text": "Some people have billions of votes in the economic system and then other people have just a small number of votes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 511.488,
    "end": 516.492,
    "text": " So the leader framework makes that voting function explicit and fair and democratic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 517.993,
    "end": 522.858,
    "text": "The emphasis of the simulation we'll be talking about in a moment is on the economic system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 522.898,
    "end": 535.928,
    "text": "But as I mentioned, the leader framework encompasses almost all six overarching systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 536.369,
    "end": 537.69,
    "text": "This simulation is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 544.162,
    "end": 565.162,
    "text": " and uh this so this first one simply looks at the economic aspects aspects because that was the simplest to do for me at the time um so money is used as a voting tool and it's and voting occurs in two arenas it occurs in local markets so i buy some product from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 569.363,
    "end": 574.966,
    "text": " And it also occurs in the financial system, what I call the crowd-based financial system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 575.907,
    "end": 577.468,
    "text": "And we'll talk a lot about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 577.588,
    "end": 586.413,
    "text": "But essentially, individuals contribute a certain amount of their income to the crowd-based financial system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 586.974,
    "end": 595.539,
    "text": "And then once their money is in the crowd-based financial system, the CBFS, then they get to choose how that money is used.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 595.899,
    "end": 598.781,
    "text": "So in a sense, they get to vote for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 599.465,
    "end": 609.431,
    "text": " They offer their votes for how the community is, what the community wants, what the community wants to fund, what kind of jobs the community wants to fund, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 612.853,
    "end": 626.001,
    "text": "So if you had an economic system in which money was used as a voting tool, well, it would be fairly undemocratic unless incomes and wealth were somehow equal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 626.943,
    "end": 633.867,
    "text": " So over time, uh, the effect of the leader is to, um, equalize income and wealth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 635.428,
    "end": 638.349,
    "text": "And I'll show the, show the results of that in a minute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 638.469,
    "end": 640.63,
    "text": "The latest simulation runs 28 years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 640.731,
    "end": 652.577,
    "text": "And as you'll see at the end of that 20 year period, everyone who has joined the club, uh, is enjoying an equal level of an equal and high level of income wealth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 654.162,
    "end": 660.947,
    "text": " And lastly, the LIDA framework is designed to focus on motivations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 661.427,
    "end": 670.894,
    "text": "That is, any new system developed in this R&D program, the goal is to have that system be fit for purpose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 671.674,
    "end": 677.118,
    "text": "And as we've talked about, the purpose of a society, the purpose of societal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 679.867,
    "end": 697.073,
    "text": " implicit person purpose of a societal systems is to facilitate societal cognition and to, and thus to, uh, ensure that the organism, the society, uh, maintain achieves and maintains a high degree of vitality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 698.714,
    "end": 702.055,
    "text": "So the, uh, any new systems developed should be fit for purpose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 702.935,
    "end": 708.437,
    "text": "And, um, and if they're fit for purpose, almost by definition, they will,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 709.019,
    "end": 714.62,
    "text": " facilitate cooperation because cooperation and communication is a part of cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 715.54,
    "end": 726.923,
    "text": "So the LIDDA framework rewards barriers to cooperation and with the idea that it makes cooperation so easy that cooperation becomes the default behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 727.843,
    "end": 729.543,
    "text": "And it also focuses on motivations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 729.883,
    "end": 737.545,
    "text": "It does not reward people for non-cooperative behavior, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 738.3,
    "end": 743.184,
    "text": " And that is in contrast to our existing systems, which I call native systems in the series.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 743.825,
    "end": 759.398,
    "text": "But in native systems, I am for paying my workers a very low wage, for example, for taking advantage of my workers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 760.859,
    "end": 763.021,
    "text": "The society would reward me greatly for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 763.181,
    "end": 765.003,
    "text": "And that doesn't occur in the leader framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 765.555,
    "end": 768.317,
    "text": " partly because income and wealth are equalized over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 769.698,
    "end": 783.046,
    "text": "Thus, the motivation to participate in the economic system of Alita, or we can also call it a club model, is not personal gain, but community well-being, well-being of the larger organisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 786.73,
    "end": 790.052,
    "text": " I just have one question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 790.732,
    "end": 795.715,
    "text": "Are the members of a club, are you thinking spatially co-located?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 795.975,
    "end": 798.577,
    "text": "Are they remotely located?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 800.037,
    "end": 802.399,
    "text": "Yes, locally in space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 803.66,
    "end": 809.723,
    "text": "And it is perhaps possible to have a club that is distributed over space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 811.172,
    "end": 813.232,
    "text": " But I didn't start that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 813.252,
    "end": 817.693,
    "text": "I mean, that maybe could be something that's added later, but I'm focusing now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 817.753,
    "end": 823.194,
    "text": "It's the easiest thing for me, has been the easiest thing for me to focus on the local market, local area.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 824.674,
    "end": 831.156,
    "text": "But there's reasons why the local area is important because many decisions actually are local.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 831.316,
    "end": 836.176,
    "text": "Like who will pick up my garbage and where will that garbage go is a local decision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 837.297,
    "end": 838.637,
    "text": "Many of the decisions, many of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 840.066,
    "end": 843.349,
    "text": " Our quality of life is largely a local issue, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 844.93,
    "end": 847.772,
    "text": "My economic security is largely a local issue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 848.793,
    "end": 866.706,
    "text": "And obviously, being close in space allows a greater opportunity for community building and gathering and seeing face-to-face and communicating face-to-face and getting to know each other and building a deep sense of friendship and community that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 868.168,
    "end": 872.309,
    "text": " But yes, in the future, communities might be extended in some way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 872.569,
    "end": 884.353,
    "text": "And as a matter of fact, the idea with the leader framework or the idea with the club model is that the initial focus would be on developing the tools and systems for clubs for the project.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 884.993,
    "end": 889.614,
    "text": "And then that would land systems for club networks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 891.435,
    "end": 895.076,
    "text": "So that would be by definition non-local",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 896.141,
    "end": 900.523,
    "text": " you know, non-local engagement because clubs might be in different areas of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 903.844,
    "end": 905.044,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 905.244,
    "end": 905.504,
    "text": "So.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 908.245,
    "end": 911.847,
    "text": "Is that right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 912.767,
    "end": 914.768,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 915.068,
    "end": 925.812,
    "text": "So there's in the bottom left of that slide, over in the bottom left of that slide, I'm listing the six overarching systems that I talk about in the series.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 927.677,
    "end": 930.579,
    "text": " And you will see that all buttons are deleted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 931.08,
    "end": 937.565,
    "text": "So I would imagine that if this were developed further, that health would also be included, but I just haven't included it yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 939.246,
    "end": 949.054,
    "text": "So very briefly, the seven integrated components, the first three, I call them collectively the token exchange system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 949.254,
    "end": 955.719,
    "text": "Again, the token is the local currency, and it travels in parallel with the national currency, with the dollar locally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 957.289,
    "end": 960.252,
    "text": " There's a token monetary system that creates and destroys tokens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 960.272,
    "end": 963.894,
    "text": "There's the crowd-based financial system, which I mentioned already.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 964.855,
    "end": 971.22,
    "text": "That, to be clear, that CBFS handles both the national currency and the token.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 971.84,
    "end": 976.003,
    "text": "It issues to local businesses and nonprofits.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 976.904,
    "end": 979.746,
    "text": "It issues donations, interest-free loans, and subsidies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 980.006,
    "end": 984.51,
    "text": "And these are all transparent through democratic decision-making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 985.521,
    "end": 989.703,
    "text": " And it also has a nurture arm that people contribute to and members contribute to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 990.264,
    "end": 994.646,
    "text": "And that nurture arm provides income for not what I call not in workforce members.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 995.026,
    "end": 1004.491,
    "text": "So when I say that the LIDA achieves income equality over time, I mean for every single member.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1004.771,
    "end": 1008.073,
    "text": "So you can think of it as every member family or however you want to think of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1009.073,
    "end": 1010.654,
    "text": "But regardless,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1013.302,
    "end": 1017.586,
    "text": " workforce, ill, not ill, employed, not employed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1017.606,
    "end": 1025.853,
    "text": "In that sense, it's a little bit like a universal income, only it's a very high income.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1026.693,
    "end": 1028.975,
    "text": "Same income that everyone is enjoying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1029.696,
    "end": 1030.777,
    "text": "I'll show you that in just a minute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1031.838,
    "end": 1036.302,
    "text": "And then number three in the TES token exchange system is the market system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1036.442,
    "end": 1039.464,
    "text": "So these would be local markets that are members.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1040.854,
    "end": 1049.059,
    "text": " And a part of the, some of the new businesses that are developed by the leader would are called principal businesses, principal businesses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1049.559,
    "end": 1053.241,
    "text": "And that's a very special business model, unique to the leader.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1054.221,
    "end": 1060.045,
    "text": "Kind of like a nonprofit, kind of like a hybrid between a nonprofit and a, and a regular for-profit business.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1062.106,
    "end": 1066.668,
    "text": "Um, number four, there's a property rights system that goes along with this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1066.948,
    "end": 1069.61,
    "text": "Uh, for example, um, a club.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1070.188,
    "end": 1073.73,
    "text": " Alita would have an IP pool for intellectual property.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1074.27,
    "end": 1081.594,
    "text": "And the club could also manage other properties, could manage real estate properties, for example, or any kind of property.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1083.015,
    "end": 1088.358,
    "text": "So it would be democratic decision-making for property management also.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1088.378,
    "end": 1094.681,
    "text": "There'd be some restrictions on the sale of principal businesses, kind of similar to nonprofits.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1095.716,
    "end": 1098.098,
    "text": " And there would be high transparency throughout.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1098.198,
    "end": 1108.766,
    "text": "So the community would know, if the community is using money as a voting tool, the community would need to know what's happening with their votes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1109.166,
    "end": 1112.309,
    "text": "What are the choices that the community is making with money?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1113.049,
    "end": 1115.631,
    "text": "And so the flow of money would be highly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1118.895,
    "end": 1121.978,
    "text": " Um, number five is an information and incentive system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1121.998,
    "end": 1134.628,
    "text": "Uh, this would include, for example, in education programs, reputation system, the fitness and indexes that we've talked about, which allow the community to understand itself, how it's doing, what's going to happen next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1135.288,
    "end": 1138.251,
    "text": "Uh, how, how, what is the quality of the design that we're using?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1138.311,
    "end": 1139.532,
    "text": "Could we improve our design?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1139.552,
    "end": 1148.339,
    "text": "Uh, and along with fitness indexes, the last one there's computer and other kinds of forecasting and assessment methods that would help a community to understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1149.11,
    "end": 1151.892,
    "text": " what are the trends and how is the system working and how are we doing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1154.294,
    "end": 1156.296,
    "text": "Number six is a collaborative governance system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1156.656,
    "end": 1161.84,
    "text": "And that has three branches, administrative, legislative and judicial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1161.98,
    "end": 1164.762,
    "text": "So that then covers the legal system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1165.863,
    "end": 1168.065,
    "text": "And finally, number seven is purpose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1168.285,
    "end": 1174.93,
    "text": "And we've already talked in each of these discussions, we've talked about the importance of purpose",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1175.743,
    "end": 1188.066,
    "text": " and how purpose follows worldview and design and metrics follow from purpose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1191.307,
    "end": 1193.807,
    "text": "Okay, so next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1193.827,
    "end": 1196.088,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1197.868,
    "end": 1204.53,
    "text": "All right, so now we'll spend most of the rest of this discussion on the simulation model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1206.084,
    "end": 1211.288,
    "text": " Cause I think that'll, that'll be most, that'll make the description of the leader framework most clear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1211.728,
    "end": 1216.792,
    "text": "And again, uh, the, the, this is, this is a first simulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1216.812,
    "end": 1221.615,
    "text": "Um, it's, it's intended to introduce the, the leader framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1222.396,
    "end": 1229.161,
    "text": "Um, and also just to describe some general concepts of token dollar used dollar as the national currency, if you don't mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1229.775,
    "end": 1248.959,
    "text": " token dollar flow, and the third aim of this on the left paragraph there is to demonstrate at least conceptually that income equality can be achieved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1250.793,
    "end": 1263.418,
    "text": " that there's some parameterization of this model that you can choose parameters such that this goal of income equality can be achieved at the end of the simulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1264.118,
    "end": 1267.64,
    "text": "The simulation lasts for about 28 years, I believe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1268.9,
    "end": 1273.602,
    "text": "So this is not, you know, the concept behind the LIDA",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1278.992,
    "end": 1297.594,
    "text": " it grows from there it injects like in the very first year maybe just a few members will will join and the lita injects a small amount of tokens as the as the local currency into the economy and makes some very small changes and then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1301.741,
    "end": 1330.232,
    "text": " year makes another few people join and make some bigger changes still and the the growth of the leader occurs exponentially fast now I would like I would like to say that that the functions of the leader how it how it works how it achieves these aims how it achieves income equality for example this would all be worked out far in advance before any field trial ever occurred so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1330.796,
    "end": 1346.979,
    "text": " what would actually happen is there would be say, you know, who knows hundreds or more of simulations or papers, or at least let's say a large number of simulation and papers on a variety of topics would be finished before any community was ever asked to participate in this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1347.259,
    "end": 1355.701,
    "text": "So once that body of knowledge is developed, then perhaps the, the, the program would say, okay, what is there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1355.821,
    "end": 1360.722,
    "text": "Are there any communities in the world that would be interested in participating in a field trial?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1361.661,
    "end": 1368.965,
    "text": " And if you did participate, here's the list of benefits that you might expect over, say, a two-year field trial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1369.925,
    "end": 1371.506,
    "text": "Income levels will increase.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1371.706,
    "end": 1373.106,
    "text": "This is what's going to happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1373.167,
    "end": 1377.008,
    "text": "This is how participation will increase.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1377.088,
    "end": 1383.511,
    "text": "This is, you know, the trajectory would be laid out through a variety of simulations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1384.632,
    "end": 1390.915,
    "text": "So everyone should know what they're getting involved in, what they expect from this, and there should be no surprises from the field trials.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1392.52,
    "end": 1398.525,
    "text": " Now, that doesn't mean that the community has no choice in their behaviors and what they do with the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1398.545,
    "end": 1403.989,
    "text": "The community drives the system, but the system is designed such to achieve its purpose, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1404.089,
    "end": 1404.73,
    "text": "Fit for purpose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1407.012,
    "end": 1408.413,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1408.493,
    "end": 1421.263,
    "text": "So on the left there, I just want to emphasize that this simulation conveys broad, low-level, low-resolution design intentions for an actual",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1421.721,
    "end": 1422.781,
    "text": " token exchange system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1422.841,
    "end": 1426.422,
    "text": "So I'm not predicting that a token exchange system would work like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1426.843,
    "end": 1434.545,
    "text": "This is rather an illustration of the concept of the token exchange system and the leader framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1436.005,
    "end": 1445.768,
    "text": "And obviously this simulation can and hopefully will be followed by a large number of other simulations that are progressively more sophisticated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1447.009,
    "end": 1451.47,
    "text": "This is in many respects a fairly simple",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1452.08,
    "end": 1456.402,
    "text": " simulation, and there is tremendous room to expand it and improve it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1458.683,
    "end": 1460.004,
    "text": "But it's still useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1460.884,
    "end": 1470.329,
    "text": "And in particular, that's because I made the simulations stock flow consistent, which means that no no monies come out of thin air, it's all",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1472.44,
    "end": 1475.801,
    "text": " If money leaves one agent, then another agent receives it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1476.281,
    "end": 1478.601,
    "text": "So all the flows of money are accounted for.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1479.122,
    "end": 1486.144,
    "text": "And just that alone allows one to say that, okay, logically, mathematically, this all adds up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1488.364,
    "end": 1493.366,
    "text": "And lastly, I would say that this is what I call a semi-realistic simulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1493.976,
    "end": 1499.659,
    "text": " That is, starting income levels resemble real income levels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1499.919,
    "end": 1501.861,
    "text": "Tax rates resemble real tax rates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1505.102,
    "end": 1507.804,
    "text": "Thus, the initial conditions are so unrealistic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1508.993,
    "end": 1511.694,
    "text": " But again, the simulation is very simple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1511.794,
    "end": 1519.096,
    "text": "So I start with a semi-realistic initial setting, and then certain things don't change over the years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1519.456,
    "end": 1524.437,
    "text": "The only thing that actually changes is just what pertains to the LIDA itself, the members themselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1524.977,
    "end": 1536.521,
    "text": "So if you don't join in the simulation, if you don't join the LIDA over a period of years, then your income stays just what it was, and nothing really changes for you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1536.561,
    "end": 1537.841,
    "text": "You keep the same job, and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1538.308,
    "end": 1540.929,
    "text": " keep the same family and things just move ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1543.111,
    "end": 1544.611,
    "text": "Can I ask a question here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1545.412,
    "end": 1545.912,
    "text": "Yeah, please.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1546.833,
    "end": 1549.214,
    "text": "OK, you can address it now or later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1549.574,
    "end": 1553.476,
    "text": "But what is the relationship between your simulation and game theory?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1554.097,
    "end": 1557.698,
    "text": "And what is the relationship between your simulation and active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1559.74,
    "end": 1559.88,
    "text": "OK.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1565.635,
    "end": 1568.918,
    "text": " Okay, so this is an agent-based model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1569.898,
    "end": 1585.21,
    "text": "So that means, you know, between the lines, that means that there are individual agents that make decisions of what they want to do, and that determines how the history of the simulation goes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1587.39,
    "end": 1596.332,
    "text": " In a highly sophisticated agent-based models, the agents themselves might be very complex and they might make decisions about complex situations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1597.152,
    "end": 1609.515,
    "text": "And since this is just a simple introductory model, the agents are relatively simple, like for example, a family, and they make fairly simple decisions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1609.815,
    "end": 1612.516,
    "text": "And the main decision they make",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1613.934,
    "end": 1619.256,
    "text": " in this simulation is whether or not to become members in any given year.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1620.296,
    "end": 1621.657,
    "text": "Does a family want to become a member?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1622.177,
    "end": 1629.159,
    "text": "Secondly, they'll make a decision on how they choose a wage option, which is a construct that I'll talk about in a minute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1629.839,
    "end": 1633.401,
    "text": "So there's not very many decisions that individuals will make here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1633.541,
    "end": 1636.202,
    "text": "So it is like a game theory, but it's a very simple game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1637.462,
    "end": 1640.003,
    "text": "And later simulations could be made much more sophisticated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1640.994,
    "end": 1653.38,
    "text": " And in relation to active inference, I might say that I created the book and the simulation model long before I was aware of what active inference was.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1654.68,
    "end": 1659.862,
    "text": "So neither the book nor the simulation model mentions the cognitive aspects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1660.483,
    "end": 1665.365,
    "text": "And that came a little bit later in my development and as the project developed in my mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1668.886,
    "end": 1695.606,
    "text": " one could easily imagine how active influence might fit into this for example you as i said a community is considered to be a organism it's understood as an organism a cognitive organism so just like every organism it has to fulfill its intrinsic purpose which is to maintain and achieve vitality and it and it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1696.678,
    "end": 1706.242,
    "text": " In the active inference scheme, it receives information from its world through its senses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1706.902,
    "end": 1708.162,
    "text": "It updates its models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1708.262,
    "end": 1709.303,
    "text": "It chooses actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1709.643,
    "end": 1710.884,
    "text": "That changes the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1711.364,
    "end": 1720.487,
    "text": "And then it receives new sensations based on the changed world and perhaps updates its model further or chooses a different set of actions or continues with the same action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1723.206,
    "end": 1728.007,
    "text": " That's how active inference works for an organism, but that's how active inference would work for a community too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1728.027,
    "end": 1730.027,
    "text": "The community senses information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1730.187,
    "end": 1735.028,
    "text": "It decides, you know, it learns what it can learn from the current sensations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1735.669,
    "end": 1740.41,
    "text": "It makes decisions about what it'll do next in a variety of ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1740.89,
    "end": 1743.49,
    "text": "What will it do with its solid waste?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1743.55,
    "end": 1745.251,
    "text": "How will it generate energy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1745.711,
    "end": 1746.891,
    "text": "What will it fund next?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1748.698,
    "end": 1750.439,
    "text": " What businesses will it fund?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1750.479,
    "end": 1751.78,
    "text": "What nonprofits will it fund?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1751.84,
    "end": 1753.12,
    "text": "What is its targets?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1753.16,
    "end": 1754.341,
    "text": "Does it adjust its targets?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1754.841,
    "end": 1763.785,
    "text": "So these are all decisions that the organism of a community would make as it tries to achieve and maintain vitality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1764.666,
    "end": 1775.791,
    "text": "And fortunately, since this is a fitness-based, evidence-based program, the community would know at every moment how it's doing, what its indexes are, its indexes for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1781.015,
    "end": 1782.736,
    "text": " nexus for uncertainty about the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1783.977,
    "end": 1803.912,
    "text": "So as it tries, as the community tries to reduce uncertainty about its essential variables, then, you know, it would have an immediate feedback as far as like scores about how it's doing and those scores and that information could help it then to update its models or, and choose the same or different actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1805.293,
    "end": 1806.814,
    "text": "And so that's the, that's how",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1814.092,
    "end": 1839.665,
    "text": " part of this say just a principal business and the principal businesses the principal business could also be thinking about its cognition in terms of active inference it to gathers information and then makes makes adjustments and learns and chooses actions and another example is the crowd-based financial system itself this is a decision-making work",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1843.41,
    "end": 1848.293,
    "text": " And that whole structure could be modeled using ideas from active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1850.735,
    "end": 1851.015,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1851.095,
    "end": 1858.441,
    "text": "It's interesting how you developed the idea and applied basically the evolution of computational modeling to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1858.861,
    "end": 1864.905,
    "text": "And that helped a few things maybe come out into relief, like that multi-scale aspect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1864.925,
    "end": 1872.811,
    "text": "And then also the fact that you're pursuing not the maximum GDP, not the total divided by the number of people,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1873.311,
    "end": 1879.434,
    "text": " which you're maybe going to get a higher average with one billionaire and everyone else at zero, but that's not the pursuit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1879.774,
    "end": 1887.138,
    "text": "It's actually a uncertainty minimizing trajectory policy sequence that's starting to sound a lot like active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1887.178,
    "end": 1888.959,
    "text": "So it's kind of cool how it dovetails together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1890.62,
    "end": 1891.02,
    "text": "Right, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1891.06,
    "end": 1894.562,
    "text": "This is, these are, these are, you know, these are probabilistic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1894.802,
    "end": 1899.425,
    "text": "You could say the community is developing a probabilistic model of what will happen next, what will happen to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1901.308,
    "end": 1903.729,
    "text": " And that fits in very well with the active inference scheme.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1903.85,
    "end": 1906.972,
    "text": "And individuals in the community are developing a generative model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1907.939,
    "end": 1910.7,
    "text": " of how I see the world and what will happen next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1911.32,
    "end": 1932.768,
    "text": "And as a matter of fact, since anticipation is so important in cognition, the individuals in the community, individual organizations such as businesses and the community as a whole would be developing anticipatory models, whether those are formal models in computers or whether they're informal models in their minds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1934.248,
    "end": 1939.851,
    "text": " about how I see the world and how I see what will happen next if A, B, and C happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1940.532,
    "end": 1954.639,
    "text": "So all of that information, that full anticipatory capacity of individuals and organizations and the community as a whole can be taken into account in the LIDA, can be used in the LIDA for its own good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1960.542,
    "end": 1961.803,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1962.023,
    "end": 1962.503,
    "text": "Slide eight.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1963.304,
    "end": 1963.424,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1963.68,
    "end": 1964.0,
    "text": " Are we there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1964.941,
    "end": 1965.181,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1965.881,
    "end": 1966.162,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1966.202,
    "end": 1978.03,
    "text": "So this image on the right really captures much of the simulation and much of the idea of the LIDA as far as the token exchange system goes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1981.992,
    "end": 1993.06,
    "text": "And before I describe it, I just want to emphasize once again that the token exchange system is just one part of the LIDA, and there's other parts that are not in this simulation at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1994.145,
    "end": 1997.787,
    "text": " Well, the governance system is not in the simulation at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1998.287,
    "end": 2000.349,
    "text": "So this is just flows of currency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2000.949,
    "end": 2005.091,
    "text": "And this figure one on the right describes how that works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2006.852,
    "end": 2013.236,
    "text": "To simplify this a little bit, let's just look at the arrows in blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2014.556,
    "end": 2017.518,
    "text": "And the arrows in blue are both tokens and dollars that flow together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2018.939,
    "end": 2021.02,
    "text": "And we could start at organizations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2021.733,
    "end": 2031.18,
    "text": " These are the agents of the model, the five agents, organizations, persons, CBFS, rest of counties, which is the rest of the world, and government, which is local government.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2034.163,
    "end": 2043.73,
    "text": "Just looking at the blue lines, we see there's kind of a circle being made between organizations, persons, CBFS, and then again to organizations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2043.87,
    "end": 2047.673,
    "text": "And that's essentially how things flow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2050.045,
    "end": 2057.346,
    "text": " Organizations, persons are employed at organizations and organizations pay wages to persons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2057.787,
    "end": 2061.947,
    "text": "Persons spend money back into organizations when they buy goods and services.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2062.667,
    "end": 2074.049,
    "text": "Persons support the CBFS with contributions and the CBFS supports persons in particular, not in workforce persons with what I call nurture support.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2075.81,
    "end": 2076.95,
    "text": "The CBFS",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2079.156,
    "end": 2107.716,
    "text": " also provides loans subsidies and donations to organizations and the organizations pay back the loan principle i might add that the the concept of loans here is uh is the token itself is designed to be a non-inflationary currency and loans are offered interest-free so what you don't see here in this circle i just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2108.035,
    "end": 2111.436,
    "text": " described, what you don't see is investment for profit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2111.776,
    "end": 2118.517,
    "text": "That does not occur in the system, especially with relation to principal businesses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2118.577,
    "end": 2125.759,
    "text": "It doesn't occur and obviously doesn't occur with nonprofits because nonprofits are, by definition, not for profit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2126.259,
    "end": 2132.44,
    "text": "So if I'm a person, I receive wages from my employer or maybe I'm self-employed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2132.6,
    "end": 2134.001,
    "text": "I sell things to the other persons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2136.65,
    "end": 2141.233,
    "text": " I have to contribute a certain fraction of my income to the CBFS.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2142.354,
    "end": 2153.521,
    "text": "And once it's in the CBFS, organizations will apply to the CBFS for loans or subsidies or donations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2154.502,
    "end": 2160.586,
    "text": "And along with my fellow colleagues in the CBFS, I have a pool",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2161.8,
    "end": 2166.283,
    "text": " And I can decide, you know, I like that idea that this new business wants to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2166.323,
    "end": 2172.828,
    "text": "They're going to make a new light bulb or they're going to make a, this is funding for a small organic farm or whatever the situation might be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2174.029,
    "end": 2177.632,
    "text": "I might like what they're doing and I might see value in it for the community.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2179.993,
    "end": 2184.877,
    "text": "Again, this is, the investments are not related to profit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2184.897,
    "end": 2190.341,
    "text": "So I'm not thinking the way I would think in today's world in the native economy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2190.802,
    "end": 2199.365,
    "text": " If I have money in the native economy, I'm thinking, where can I put my money that will return to me the greatest gain, personal gain in finances?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2200.145,
    "end": 2216.39,
    "text": "In this system, I'm asking, since personal profit is not part of the picture, I'm asking, where can I put my money that will receive the greatest gain in terms of fitness scores and community well-being?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2217.531,
    "end": 2220.632,
    "text": " and quality of life for myself and my children.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2221.973,
    "end": 2230.535,
    "text": "So those are the kinds of topics that become pertinent then when the personal profit motive is taken out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2232.596,
    "end": 2243.979,
    "text": "So again, in relation to the native economy, the government, say the US government, also makes subsidies to various businesses, but here,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2247.634,
    "end": 2249.955,
    "text": " All these choices are deeply democratic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2252.275,
    "end": 2259.977,
    "text": "Given that incomes are more or less equal, everyone has more or less the same amount of money in the CBFS, same amount of currency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2260.497,
    "end": 2274.66,
    "text": "So everyone has essentially equal say in which businesses get funded, which businesses, whether they get subsidies or whether they get donations or whether they get loans.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2275.821,
    "end": 2277.001,
    "text": "And the reason for subsidies",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2277.617,
    "end": 2283.218,
    "text": " rather than loans and donations, might be that, for one thing, you have to pay back a loan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2283.638,
    "end": 2297.822,
    "text": "So if a community wanted to support, say, a bakery, and they thought that this bakery is really great, they're not making a lot of money, so they're not going to be able to really pay back loans very well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2298.82,
    "end": 2303.664,
    "text": " And maybe even they're operating at a loss, but there's just such a great community resource.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2303.824,
    "end": 2315.734,
    "text": "And we just love this little bakery so much that we would like to give this bakery a subsidy so that it can continue to operate, even though it's losing money every year.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2316.294,
    "end": 2317.875,
    "text": "That would be one example of a subsidy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2317.975,
    "end": 2327.303,
    "text": "Or there might be, we want to subsidize a hospital or we want to subsidize any operation that perhaps is not actually making money and couldn't pay back a loan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2327.864,
    "end": 2334.887,
    "text": " On the other hand, maybe some business is doing well and we would be willing to support it, but we want to give it a loan instead of a subsidy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2335.527,
    "end": 2339.949,
    "text": "Donations really apply more to nonprofits and subsidies really apply more to businesses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2340.769,
    "end": 2341.99,
    "text": "Can I just give a thought on that, John?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2342.09,
    "end": 2342.41,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2345.174,
    "end": 2365.811,
    "text": " It's like if a person who's granting money has $10,000 and they're deciding whether they want to be the one who gets to decide where the $10,000 go or whether they're going to give it to the cafe who's going to spend it potentially at other local businesses and allocate it a different way and the employees are already taken care of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2366.451,
    "end": 2391.329,
    "text": " it's going to contribute to a public good especially a locally um defined one and so it's like yeah i'll let them spend my ten thousand dollars that i was just going to give away anyway right right right yeah so so that raises a really a good point that that i wanted to make is that what's really happening here even though it's currency that's circulating what's really happening here is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2392.549,
    "end": 2398.771,
    "text": " It's just a way to ensure that everyone gets the same amount of votes in this economic arena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2400.172,
    "end": 2403.273,
    "text": "And what people are voting for is not so much money.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2403.393,
    "end": 2406.134,
    "text": "Money isn't the resource.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2406.234,
    "end": 2412.096,
    "text": "Especially in a mature leader, the money is circulating, as I'll show later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2413.982,
    "end": 2416.043,
    "text": " So it's, so it's not really a shortage of money.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2416.103,
    "end": 2418.904,
    "text": "Like how will we get the money for this or where will the money come from?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2418.964,
    "end": 2419.545,
    "text": "It's not that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2420.145,
    "end": 2424.267,
    "text": "It's using money as a voting tool to allocate other resources.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2424.727,
    "end": 2436.453,
    "text": "Like if I give a, um, if I support a bakery, say with, with a loan or a subsidy, what I'm saying is I'm, I'm voting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2440.333,
    "end": 2442.213,
    "text": " spent in this bakery.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2442.574,
    "end": 2448.495,
    "text": "I want this bakery to employ these people, and I want the bakery to provide this service to the community.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2448.995,
    "end": 2455.917,
    "text": "So I'm voting for the service and the allocation of resources that are embodied in this bakery.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2456.377,
    "end": 2458.918,
    "text": "Or it could be a hospital, or it could be anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2460.978,
    "end": 2464.239,
    "text": "But that's what we're really voting for, is how we spend our time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2464.899,
    "end": 2467.86,
    "text": "What do the humans in this, what do the members",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2468.964,
    "end": 2476.387,
    "text": " in their life, in their 24 hours a day and seven days a week or whatever, in their year, how do they spend their time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2476.447,
    "end": 2478.107,
    "text": "How do we want to spend our own time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2478.447,
    "end": 2481.768,
    "text": "What jobs do we want to work in as a community?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2482.789,
    "end": 2483.789,
    "text": "How do we want to spend our time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2483.829,
    "end": 2486.37,
    "text": "Do we want to be employed by nonprofits?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2486.49,
    "end": 2488.971,
    "text": "Do we want to be employed by regular businesses?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2489.011,
    "end": 2491.171,
    "text": "Do we want to be employed by principal businesses?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2493.991,
    "end": 2507.001,
    "text": " the evolution of this economy is the decision-making process of a community to decide how it wants to spend its time and where it wants to put its focus and what kind of conditions it wants to operate in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2510.124,
    "end": 2510.384,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2511.645,
    "end": 2516.889,
    "text": "So that's a little bit of an introduction to the flow of tokens and dollars together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2518.871,
    "end": 2521.373,
    "text": "Maybe I will say one more thing before we get off this is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2522.691,
    "end": 2550.998,
    "text": " suppose that um and this might be obvious from things i've already said but i just want to emphasize it but suppose that me suppose that me and a group of people in the cbfs decide like hey it would be really cool to have a bicycle manufacturer in our town so so together you know the the 12 of us or the 50 of us or the 100 of us decide like yeah let's support this bicycle business now every it's natural that not all businesses are going to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2551.505,
    "end": 2554.267,
    "text": " make it, you know, some are going to fail and that's natural and good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2554.527,
    "end": 2563.674,
    "text": "A community would want to take some choice, some chances and fund some things that maybe even, you know, a reasonable chance it will fail, but if it doesn't fail, it would be great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2565.136,
    "end": 2569.239,
    "text": "So, so we fund a bicycle business and it fails after a few years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2570.3,
    "end": 2570.58,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2571.46,
    "end": 2571.741,
    "text": "Fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2572.902,
    "end": 2575.023,
    "text": "The same money is still circulated in the community.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2575.083,
    "end": 2578.606,
    "text": "Nothing's really changed now with what has changed, however,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2579.292,
    "end": 2589.054,
    "text": " is the allocation of human resources that were allocated to the bicycle business now can be allocated someplace else because the bicycle business doesn't exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2589.774,
    "end": 2595.036,
    "text": "And in the meantime, those employees might become then not in workforce members, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2595.076,
    "end": 2596.936,
    "text": "They maybe don't have a job for a short period.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2597.536,
    "end": 2605.538,
    "text": "So they go from the unemployed category in the person's box to the unemployed and not in workforce box.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2605.558,
    "end": 2608.079,
    "text": "And fine, their income doesn't really change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2608.099,
    "end": 2608.139,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2610.006,
    "end": 2615.149,
    "text": " They were, you know, they're not out in the street, and neither is the business owner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2615.229,
    "end": 2617.791,
    "text": "The guy who did the whole thing, he's not out in the street.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2618.211,
    "end": 2622.013,
    "text": "His income hasn't really changed too much, especially if he's a principled business.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2623.274,
    "end": 2624.295,
    "text": "So he's fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2624.615,
    "end": 2625.916,
    "text": "The employees are fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2625.976,
    "end": 2627.057,
    "text": "Everybody's taken care of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2627.537,
    "end": 2628.958,
    "text": "The community took a chance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2629.078,
    "end": 2630.759,
    "text": "They said, hey, this would be a good experiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2630.799,
    "end": 2632.08,
    "text": "Let's have a bicycle shop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2632.58,
    "end": 2639.004,
    "text": "It didn't work out, but now we'll just reallocate those resources to something else, some other decision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2644.946,
    "end": 2661.636,
    "text": " So, you know, the funny, when I try to explain this to people, and I'm using terms money and currency, it's really, it's difficult for some folks to get past their interpretation, the common interpretation of what money and investment and currency means.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2662.437,
    "end": 2670.662,
    "text": "And this is, as I said earlier, this is a leader economy, but it's not like any kind of economy that we think of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2671.584,
    "end": 2673.365,
    "text": " This is really just a decision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2673.405,
    "end": 2674.665,
    "text": "This is a cognitive system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2674.945,
    "end": 2681.707,
    "text": "In short, this is the description of a cognitive system that a certain flow of that is uses what I call a currency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2681.727,
    "end": 2689.81,
    "text": "If I can make a point on that, John, it's like if you use the metaphor of money, a lot of times people debate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2691.512,
    "end": 2695.154,
    "text": " characteristics like fungibility or store value or transfer value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2695.454,
    "end": 2706.219,
    "text": "But if we think organismally and we think about, let's say, blood flow or neural information or hormonal signaling, like the goal of the muscle cell is not to accumulate insulin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2706.679,
    "end": 2709.821,
    "text": "It's to use it as a cue to know when to change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2710.421,
    "end": 2718.885,
    "text": "And so if you think about information flow, blood flow, no cell needs to hang on to the red blood cells and capture things around it because it's part of a bigger plan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2719.545,
    "end": 2722.367,
    "text": " So I think that that's a really nice attribute you captured.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2723.567,
    "end": 2724.968,
    "text": "Yeah, excellent analogy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2724.988,
    "end": 2727.109,
    "text": "And that's very much what the leader framework is like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2727.149,
    "end": 2737.955,
    "text": "It's kind of like a body, kind of like an organism that requires the different cells in that organism to receive blood and food and information and other things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2738.894,
    "end": 2746.199,
    "text": " So, and also on that point, when I say money is used as a voting tool, even more broadly, it's used as an information tool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2746.4,
    "end": 2749.702,
    "text": "So the community is exchanging information when they exchange money.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2752.244,
    "end": 2759.95,
    "text": "Still on slide eight, I've explained now the blue lines, the token and dollar flows, but I haven't explained the green lines.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2760.55,
    "end": 2767.135,
    "text": "So this new club in this model,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2768.69,
    "end": 2774.591,
    "text": " Uh, as in, as in all models for new clubs, the community remains part of the larger world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2774.711,
    "end": 2778.952,
    "text": "It's there's no, the club is not segregated from the rest of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2778.972,
    "end": 2783.613,
    "text": "Uh, apart apart from the rest of the world, it is engaging in all the normal stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2783.653,
    "end": 2785.393,
    "text": "It's paying taxes to the government.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2785.473,
    "end": 2794.075,
    "text": "It's purchasing products from member member organizations, but also from non-member organizations and amazon.com or, you know, whoever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2794.881,
    "end": 2797.842,
    "text": " So, you know, it's participating in the normal way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2797.962,
    "end": 2803.843,
    "text": "And this leader framework or the club framework is another layer of organization on top of the normal world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2806.123,
    "end": 2808.924,
    "text": "So these green lines are showing how dollars are flowing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2809.624,
    "end": 2814.065,
    "text": "And again, this is a simplification of the real world, but it gives the idea still.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2814.525,
    "end": 2820.506,
    "text": "So persons are paying the dollars in taxes, paying their taxes in dollars, I should say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2821.306,
    "end": 2824.687,
    "text": " And the government is also giving some income support to unemployed persons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2824.867,
    "end": 2826.807,
    "text": "That also happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2827.627,
    "end": 2832.988,
    "text": "The government is giving dollars in the form of grants and subsidies and contracts to local organizations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2833.768,
    "end": 2843.37,
    "text": "And local organizations, and I created this as a kind of a simplification, but local organizations are exchanging goods and services with the rest of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2843.43,
    "end": 2846.971,
    "text": "So dollars leave the community when a local organization",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2850.213,
    "end": 2851.434,
    "text": " some far distant business.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2852.655,
    "end": 2863.704,
    "text": "And at the same time, organizations outside of the club, outside of the county are purchasing things from the member organizations too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2865.326,
    "end": 2873.252,
    "text": "So that's a simplified version of how dollars are flowing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2873.753,
    "end": 2876.715,
    "text": "And obviously now we got a problem because we have,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2878.266,
    "end": 2899.65,
    "text": " our first challenge maybe you could say one challenge is to somehow design this system so to reach the aim in number three there that income is becomes more equal over time but now we have the problem of we've created this this local currency the token and we have to pay taxes on income to the government",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2900.493,
    "end": 2902.754,
    "text": " And we can't pay taxes and tokens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2902.774,
    "end": 2903.894,
    "text": "The government's not going to take it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2904.674,
    "end": 2923.899,
    "text": "So we got an immediate challenge of like, how do we make this thing work so that every individual has enough dollars to pay the taxes it needs to pay and organizations have enough dollars so they can purchase goods outside the county in dollars.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2924.599,
    "end": 2927.1,
    "text": "And yet the whole thing can grow and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2930.52,
    "end": 2931.12,
    "text": " How does that happen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2932.361,
    "end": 2939.403,
    "text": "Another question, design question, is how do you make this thing good enough that anyone wants to join?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2940.343,
    "end": 2943.764,
    "text": "Fine, I've drawn this picture here of conceptually how it works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2943.864,
    "end": 2950.926,
    "text": "But if I don't receive anything materially from joining, why would I join?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2954.109,
    "end": 2956.851,
    "text": " in actuality, there might be lots of soft reasons to join.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2956.911,
    "end": 2968.878,
    "text": "I might feel like I'm more a part of the community, or I might feel like my voice is heard more, or I might feel that by joining, we're able to make better decisions together about things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2969.538,
    "end": 2974.661,
    "text": "But in this simulation, I wanted something a little more substantial than that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2975.542,
    "end": 2980.705,
    "text": "So in the simulation, I made the rule that a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2981.957,
    "end": 2989.438,
    "text": " person will join, a family will join this if it increases their income, and they won't join if their income doesn't go up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2991.059,
    "end": 2994.039,
    "text": "So that becomes the challenge then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2994.079,
    "end": 3010.202,
    "text": "How do you inject enough tokens and get a good enough circulation of tokens and dollars in this membership such that my income goes up from joining, or at least most people's income, everyone that joins, their income goes up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3010.908,
    "end": 3014.39,
    "text": " And then how many people have to join to make this thing work?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3015.971,
    "end": 3022.916,
    "text": "Like 2% of the population in 30 years, or 50% of the population, or 90% of the population?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3023.356,
    "end": 3023.917,
    "text": "What does it take?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3024.417,
    "end": 3027.559,
    "text": "So these are all the questions that we're going to dive into next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3031.762,
    "end": 3033.223,
    "text": "First, a few assumptions, just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3036.263,
    "end": 3037.423,
    "text": " how this whole thing works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3038.444,
    "end": 3040.385,
    "text": "The not-in-workforce population is static.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3040.465,
    "end": 3045.067,
    "text": "I think it's, whatever it is, 36% or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3045.327,
    "end": 3052.43,
    "text": "There's just a big, as in the normal world, a big chunk of people don't participate in the workforce.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3052.67,
    "end": 3056.431,
    "text": "They're disabled or they just stay home and don't work or whatever reason.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3060.133,
    "end": 3060.573,
    "text": "I chose a 7%.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3060.613,
    "end": 3062.894,
    "text": "Let's see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3062.914,
    "end": 3064.935,
    "text": "I think the unemployment rate starts at about 7%.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3067.13,
    "end": 3067.71,
    "text": " Something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3069.952,
    "end": 3075.655,
    "text": "Everyone in the county is adults and grouped into two-person families, just for simplicity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3076.276,
    "end": 3078.857,
    "text": "So household income and family income are synonymous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3079.338,
    "end": 3082.8,
    "text": "The purchasing power of the token is taken to be equal to that of the dollar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3082.88,
    "end": 3086.262,
    "text": "So when you hear token, think value of our dollar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3087.282,
    "end": 3088.883,
    "text": "And structural unemployment is 1%.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3089.244,
    "end": 3093.086,
    "text": "So you can't get much below that, no matter what you do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3094.538,
    "end": 3097.9,
    "text": " And all employed persons work full time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3097.94,
    "end": 3100.162,
    "text": "Just a few assumptions to make this simulation simple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3100.722,
    "end": 3103.844,
    "text": "And again, later simulations could be more complicated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3105.165,
    "end": 3105.846,
    "text": "Give a thought there, John.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3107.587,
    "end": 3107.707,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3108.989,
    "end": 3132.136,
    "text": " there's almost two extremes for the token one is actually something that was tried in my little town of Davis California with the Davis dollar which was a one-to-one US dollar it was a stable coin before there was stable coins and so then they pegged the local currency it didn't end up continuing um it's not active to this day but it was a pegged coin and then the other alternative would be like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3132.996,
    "end": 3161.73,
    "text": " a token that essentially people could they could make an nft out of it or they could go full crypto and they could inflate it and speculate on it do all sorts of leveraging if it was really being traded on the open market so there's kind of a continuum between a total protected in-group currency something that's pegged to a national currency all these other options for the tokenomics so it's really um it's a it's an interesting starting point but i hope others when they're viewing this see that there's a lot of space for experimentation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3163.041,
    "end": 3165.703,
    "text": " Yeah, great points.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3166.023,
    "end": 3170.006,
    "text": "And yes, there's a tremendous amount of space for experimentation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3171.788,
    "end": 3179.774,
    "text": "And on that note, I want to emphasize that I'm thinking of this as kind of a prototype concept, just to generate ideas, just to give an example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3180.854,
    "end": 3186.619,
    "text": "The goal of the R&D program, if it were funded, is that...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3187.981,
    "end": 3199.564,
    "text": " it would evaluate and help to evaluate, facilitate the evaluation of any number of designs and any number of design components that maybe are interchangeable or can be mixed and matched.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3200.244,
    "end": 3201.804,
    "text": "So this is just one concept.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3202.104,
    "end": 3215.267,
    "text": "And I would hope that over a period of years, many concepts are tested, obviously tested first in simulations and in bench scale studies and things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3215.748,
    "end": 3217.408,
    "text": "And then if the ideas are really good,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3218.095,
    "end": 3220.597,
    "text": " than also in field trials in real communities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3221.277,
    "end": 3230.142,
    "text": "Now, having said that, though, I do want to emphasize that, again, this is a science-based, evidence-driven program.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3230.783,
    "end": 3235.425,
    "text": "So it's not just a question of, hey, what do you guys want to do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3235.465,
    "end": 3236.346,
    "text": "Well, we want to do this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3236.486,
    "end": 3237.587,
    "text": "And what do you guys want to do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3237.627,
    "end": 3238.447,
    "text": "Well, we want to do this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3239.848,
    "end": 3245.511,
    "text": "You actually have to show that your design is good or better than others, or at least",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3247.455,
    "end": 3273.808,
    "text": " describe how this design compares to another design in terms of the fitness metrics in terms of fulfilling the purpose of a system so there's a general general agreed upon a concept of system fitness and system and fitness metrics uh how to there's a generally agreed upon uh path to assess a system and then any design that is you know that is uh that is good relative to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3277.58,
    "end": 3280.022,
    "text": " then, you know, that's the idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3280.082,
    "end": 3284.565,
    "text": "Like any conceivable design that improves fitness is a good one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3286.606,
    "end": 3287.187,
    "text": "That's one point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3287.267,
    "end": 3292.611,
    "text": "Now you also, just on the currency, I wasn't actually going to talk about this, but like you brought it up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3292.651,
    "end": 3293.171,
    "text": "So here we go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3294.532,
    "end": 3297.234,
    "text": "You, I think you mentioned two kinds of currencies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3297.394,
    "end": 3300.736,
    "text": "One is kind of a potentially speculative currency like Bitcoin.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3301.657,
    "end": 3307.081,
    "text": "Another is a currency backed by the, say the US dollar or something, you know, like you have, everyone has to,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3307.551,
    "end": 3311.254,
    "text": " put in a dollar, and then they get a dollar out of a local currency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3312.195,
    "end": 3315.078,
    "text": "My concept for the LIDA is neither of those.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3315.798,
    "end": 3325.747,
    "text": "So the concept here is that the LIDA is, there's a word for it that's escaping me right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3328.029,
    "end": 3329.951,
    "text": "It is just simply created out of thin air.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3330.979,
    "end": 3331.939,
    "text": " It's an accounting system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3332.599,
    "end": 3334.68,
    "text": "So in the same... Crypto.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3334.7,
    "end": 3335.0,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3335.64,
    "end": 3337.521,
    "text": "Also crypto is by fiat too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3337.701,
    "end": 3339.061,
    "text": "It's by computational fiat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3340.061,
    "end": 3340.361,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3340.761,
    "end": 3342.682,
    "text": "So this is by no computation though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3343.162,
    "end": 3348.903,
    "text": "This is just fiat because we need more tokens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3349.283,
    "end": 3350.923,
    "text": "So this is an accounting system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3351.784,
    "end": 3358.185,
    "text": "And obviously there's a limit to how much tokens you can create because the concept here is that the token holds the value of about a dollar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3358.826,
    "end": 3364.47,
    "text": " So if you created 10 billion tokens and flooded the community on day one, the token would be worthless.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3365.351,
    "end": 3371.856,
    "text": "It can only be created to the degree that it can be engaged with and employed in the circulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3371.976,
    "end": 3374.899,
    "text": "It's all about circulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3375.119,
    "end": 3377.461,
    "text": "And in particular, it's not speculative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3377.681,
    "end": 3381.964,
    "text": "So you cannot sell, in this system, you cannot sell your tokens to anyone else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3383.005,
    "end": 3386.227,
    "text": "That's because in this system, I wanted people to be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3388.067,
    "end": 3391.29,
    "text": " you know, engaged, you know, this is like a voting system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3391.331,
    "end": 3401.601,
    "text": "I wanted people to be engaged in the voting or community choices and just wouldn't be right if I sold my votes to some other third party and gave them a whole bunch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3402.222,
    "end": 3407.988,
    "text": "That doesn't mean I can't entrust, like in the CBFS,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3411.067,
    "end": 3440.153,
    "text": " organization that says like an investment group in a sense a social investment group that says hey we've been watching you know we pay a lot of attention we we model the success of businesses and the needs of the community and if you entrust tokens to us and dollars to us we will choose good investments for them that we feel are best and you know improve the community well you can do that that's fine you know that's all great but you can't sell your tokens to anybody",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3444.369,
    "end": 3468.568,
    "text": " or scholar or otherwise but that's just that's just this design so as you said you know other designs would work differently and you could model out which ones improve the fitness of the community best both current fitness and anticipated fitness all right number slide 10. yep um so uh some additional notes um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3469.95,
    "end": 3480.081,
    "text": " As I said earlier, one of the aims of the simulation was to show a way, a logical way in which incomes can grow and equalize over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3480.741,
    "end": 3485.446,
    "text": "But another way to say that is that Alita essentially pays people to become members.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3485.646,
    "end": 3487.008,
    "text": "I mean, that's how the simulation works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3487.128,
    "end": 3491.072,
    "text": "If their income goes up by becoming a member, then they become a member.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3494.575,
    "end": 3496.576,
    "text": " So that's a good selling point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3496.896,
    "end": 3508.585,
    "text": "If Alita has started up in my community and I realize that by joining my income goes up, well, that's a good reason why I might want to join.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3512.828,
    "end": 3516.33,
    "text": "Another thing is that we'll talk about three constructs here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3516.37,
    "end": 3518.912,
    "text": "That's kind of the machinery that makes this whole thing go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3519.392,
    "end": 3522.795,
    "text": "It's the income target, the token share of income, and the weight.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3527.398,
    "end": 3534.108,
    "text": " I already mentioned that Alida can create as many tokens as it can productively use, limited by inflation concerns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3535.45,
    "end": 3537.513,
    "text": "The simulation goes for 28 years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3538.013,
    "end": 3540.557,
    "text": "The first 15 of that, I termed the growth period.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3541.052,
    "end": 3545.515,
    "text": " And this is when the number of participants in the community is rising.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3545.535,
    "end": 3549.238,
    "text": "The number of tokens generated by the community is rising.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3549.258,
    "end": 3554.742,
    "text": "The club itself, the LIDA, is expanding in all ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3555.342,
    "end": 3559.305,
    "text": "And it reaches its peak at about 15 years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3559.865,
    "end": 3566.83,
    "text": "And as it turns out, that's 90% of the local population end up joining the LIDA, again, because their income goes up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3568.436,
    "end": 3573.038,
    "text": " And then the following years, the 13 years following that are called the post-growth period.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3573.418,
    "end": 3582.842,
    "text": "And that's just an equalization period where everything kind of settles out in time and reaches a kind of a homeostasis point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3587.885,
    "end": 3588.525,
    "text": "Let's see here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3588.645,
    "end": 3596.409,
    "text": "Oh, and on the right, with regards to the LIDA, we can talk about family income pre- and post-CBFS, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3596.449,
    "end": 3596.909,
    "text": "So if",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3598.784,
    "end": 3609.51,
    "text": " If you're required to contribute a certain fraction of your income to the CBFS, well, then obviously your pre-CBFS income will be higher than your post-CBFS income.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3610.55,
    "end": 3617.354,
    "text": "When I do comparisons here, I'm really making comparisons on the post-CBFS income.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3617.374,
    "end": 3621.016,
    "text": "So you can think of that as really pre-tax take-home income.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3623.277,
    "end": 3623.637,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3624.017,
    "end": 3626.158,
    "text": "And maybe the last thing to talk about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3626.579,
    "end": 3626.879,
    "text": "Oh, go ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3627.466,
    "end": 3654.749,
    "text": " one funny note on that is depending on the uh governing tax body and how they regulate whether a certain kind of crypto transaction is taxable or not every transaction of a token could be considered taxable I'm not a lawyer obviously and this is the future but I'm just saying that depending on what kind of overarching tax structure exists it could completely make or break this total structure from making it tax-free to making it something that grinds to a halt",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3656.505,
    "end": 3665.488,
    "text": " Oh, if this was tax-free, the token was tax-free, if I could get income as tokens tax-free, then this whole system is gonna work like a charm, I would say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3666.048,
    "end": 3672.23,
    "text": "I've designed it under the assumption that everyone will have to pay taxes on the tokens that they receive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3672.91,
    "end": 3678.952,
    "text": "So that's the more conservative assumption and it holds true and we'll show how it all works out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3681.133,
    "end": 3684.214,
    "text": "I do want to emphasize that this,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3688.356,
    "end": 3699.999,
    "text": " the structure of the leader and the way the CBFS works and the contributions to it and things like that, it's not dependent on the goodwill of members.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3700.039,
    "end": 3704.16,
    "text": "These all occur because of the rules of the club.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3704.3,
    "end": 3707.381,
    "text": "So if you want to become a member, here are the rules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3707.621,
    "end": 3711.722,
    "text": "There's a variety of rules that you follow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3711.822,
    "end": 3714.903,
    "text": "And what some of those rules are in code",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3715.478,
    "end": 3717.82,
    "text": " what your contributions to the CBFS will be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3718.22,
    "end": 3725.466,
    "text": "Again, once you put the money in there, then you get to choose, you know, largely you get to choose how that money is spent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3727.727,
    "end": 3730.049,
    "text": "All right, on to Eli.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3732.431,
    "end": 3732.571,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3733.372,
    "end": 3736.995,
    "text": "So I mentioned that there's three constructs that sort of drive this whole thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3737.595,
    "end": 3739.036,
    "text": "And the first is the income target.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3740.257,
    "end": 3745.321,
    "text": "I also mentioned that simulations would be available long before the first field",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3745.905,
    "end": 3747.386,
    "text": " no trial ever occurs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3748.106,
    "end": 3755.469,
    "text": "So in these simulations, the community that's being simulated would choose an income target.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3755.649,
    "end": 3768.574,
    "text": "And that income target is a increasing level of family income up to a certain plateau and then it levels off.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3769.614,
    "end": 3773.336,
    "text": "So that path, the expected path of that increase in income",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3773.763,
    "end": 3784.69,
    "text": " family income is part of the design of the leader and it's, and different communities could choose slightly different, uh, um, um, functions or paths to get there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3785.17,
    "end": 3795.197,
    "text": "But that's the concept that the, that everyone knows in advance how we're going to get to this, uh, plateau level, you know, how many years it'll take at what rate for example, like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3796.277,
    "end": 3800.64,
    "text": "Um, uh, second, uh, construct is the wage option.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3801.581,
    "end": 3802.041,
    "text": "And, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3802.679,
    "end": 3804.4,
    "text": " This is to address a certain problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3804.6,
    "end": 3815.107,
    "text": "So, for example, I'm in a family, my husband and wife team, and I make a lot of money and my wife is not working, as an example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3815.788,
    "end": 3825.594,
    "text": "Well, then she could join the LIDA and be included in the Not in the Workforce group, and she could get a high income just from being a member of the LIDA.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3826.121,
    "end": 3831.505,
    "text": " But I'm going to stay outside the LIDA because I'm making a ton of money anyway, and I don't need the LIDA.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3831.565,
    "end": 3834.947,
    "text": "So the best choice for us would be I stay out of the LIDA.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3835.047,
    "end": 3838.589,
    "text": "She joins the LIDA, and our income goes up considerably because of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3839.43,
    "end": 3845.714,
    "text": "But that would be a little bit of a freeloading situation, and it wouldn't be good for the LIDA as a whole.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3845.814,
    "end": 3848.796,
    "text": "So to prevent that kind of thing, there's two wage options.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3850.395,
    "end": 3871.086,
    "text": " if our family income is, as this income target rises at any given year, if our income target is above it, or if our income, say I'm working in some business, if our income is above the current year target, then we choose wage option one and the club",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3873.735,
    "end": 3878.276,
    "text": " will give us a stipend, you know, above our normal income in tokens, a small stipend.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3878.336,
    "end": 3888.318,
    "text": "So we get a little bit of, we're doing well, we have a lot of money because our income is high and we join and we get a small amount of tokens that we can play with in the CBFS and stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3889.078,
    "end": 3898.519,
    "text": "On the other hand, if we, our family has a low income, lower than the target and we join, then we receive the whatever current year income target is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3898.599,
    "end": 3902.02,
    "text": "So in the first year that might be low, but each year it increases",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3904.485,
    "end": 3915.29,
    "text": " And by the time the simulation is over, everyone essentially is choosing this wage option number two and is receiving the current year income target at its plateau.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3917.091,
    "end": 3918.652,
    "text": "That's a little bit about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3918.912,
    "end": 3922.874,
    "text": "And then I should say that the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3926.263,
    "end": 3931.464,
    "text": " set of families whose initial income is below the 90th percentile.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3932.064,
    "end": 3934.064,
    "text": "I consider those the target population.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3934.464,
    "end": 3940.866,
    "text": "And as we'll see, the LIDA increases incomes for 90% of the population.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3941.306,
    "end": 3946.167,
    "text": "And it's that 90% that joins the LIDA by the end of the simulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3947.967,
    "end": 3953.668,
    "text": "And there's also a token share of income target, TSI target, that is in any given year.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3954.83,
    "end": 3974.208,
    "text": " know how are the dollars and tokens uh you know what is like if i'm going to purchase goods in by local community and local businesses how many tokens am i going to give relative to dollars that's also a design parameter okay slide 12.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3976.631,
    "end": 3982.133,
    "text": " One question is, you mentioned a two-person household where one person had a high income and one person didn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3982.793,
    "end": 3986.714,
    "text": "And then you said it'd be free riding if one person joined and the other didn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3986.754,
    "end": 3990.595,
    "text": "But what about one person wanting to join who doesn't have an income?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3990.775,
    "end": 3992.576,
    "text": "I mean, where does that play in?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3995.265,
    "end": 4001.369,
    "text": " Oh, that doesn't play into this simulation because for simplicity, I assume that everyone was in a two person family.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4001.829,
    "end": 4007.212,
    "text": "Obviously, in a more sophisticated simulation, you would have young adults that are single and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4007.693,
    "end": 4011.955,
    "text": "So that the simulation just doesn't have that level of sophistication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4012.416,
    "end": 4017.519,
    "text": "But I would argue, though, that I'm showing by the simulation the main concepts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4025.538,
    "end": 4029.079,
    "text": " where there's actually one person families and things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4030.219,
    "end": 4030.819,
    "text": "But good point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4032.92,
    "end": 4036.46,
    "text": "Okay, so in a moment, I'm gonna show you some of the results of the simulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4036.52,
    "end": 4041.141,
    "text": "And just keep in mind that that's a simulation for 100,000 people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4042.642,
    "end": 4054.664,
    "text": "And I'm using for initial income values and income distribution, I'm using data, US Census data for 2011 for Lane County, Oregon, from the US Census.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4055.918,
    "end": 4064.001,
    "text": " So that's how I'm making this semi-realistic in part, is I'm trying to mimic the distribution that was in Lane County, Oregon in 2011.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4064.962,
    "end": 4070.164,
    "text": "And then that's to start with, that year zero, and then every year it changes as it changes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4070.804,
    "end": 4074.446,
    "text": "And if you never become a member, then your income stays at that same level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4076.566,
    "end": 4081.248,
    "text": "Obviously not considering inflation in this model, it's just a simple model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4081.348,
    "end": 4082.449,
    "text": "And so we're kind of,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4083.661,
    "end": 4086.302,
    "text": " it's named the concept of inflation for the moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4088.103,
    "end": 4092.344,
    "text": "Um, and it, and it could be easily added in a more sophisticated simulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4093.284,
    "end": 4103.048,
    "text": "Um, uh, as far as other ways to make this semi-realistic, I, as at the bottom of the left-hand side there, I choose a tax rate that is a reasonable tax rate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4103.488,
    "end": 4110.17,
    "text": "There's a bunch of other, uh, uh, uh, parameters that I chose to be reasonable parameters of what I could",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4111.977,
    "end": 4113.238,
    "text": " What's a reasonable tax rate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4113.858,
    "end": 4114.919,
    "text": "What's a reasonable tax rate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4114.999,
    "end": 4123.864,
    "text": "Oh, I chose for individuals, I chose 90% of adjusted gross income, you know, and then everyone gets a $2,500 deduction and, you know, things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4124.645,
    "end": 4128.567,
    "text": "So like in the ballpark, that's what I'm arguing is that these things are in the ballpark.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4130.949,
    "end": 4137.272,
    "text": "And again, a more sophisticated simulation could look at a broken, you know, like a more complicated tax rate or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4138.813,
    "end": 4139.954,
    "text": "I also look, for example,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4144.881,
    "end": 4146.922,
    "text": " to nonprofits just in dollars, just regularly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4147.502,
    "end": 4149.964,
    "text": "And I chose a percentage of income for that, too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4150.444,
    "end": 4154.066,
    "text": "Things like that, just to kind of get semi-realistic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4154.146,
    "end": 4159.009,
    "text": "And it turns out that the simulation is not very sensitive to those parameters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4159.449,
    "end": 4162.991,
    "text": "So they can be changed a bit, and the simulation should show the same results.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4163.871,
    "end": 4171.216,
    "text": " Now, on the other hand, there's some token exchange system-specific parameters, and they definitely drive how this whole thing works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4171.737,
    "end": 4175.219,
    "text": "There's some of them I mentioned for the constructs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4175.259,
    "end": 4180.724,
    "text": "There's the formula as how the income target rises every year.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4181.684,
    "end": 4184.286,
    "text": "That makes a big difference, and so do some of the others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4184.927,
    "end": 4189.59,
    "text": "The amount that people contribute to the CBFS makes a difference, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4191.291,
    "end": 4193.433,
    "text": "And speaking of the amount they contribute to the CBFS,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4196.633,
    "end": 4200.714,
    "text": " There's the nurture category, for example, the subsidy category, the loan category, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4201.295,
    "end": 4204.876,
    "text": "And there's what I call earmarks for all of those in this simulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4205.056,
    "end": 4214.139,
    "text": "Like a certain percent of income goes to subsidy group in CPFS, a certain percent goes to lending, a certain percent goes to nurturing, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4215.319,
    "end": 4222.442,
    "text": "I called it nurturing, by the way, is because I wanted to convey the idea of the community is nurturing itself through this process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4227.506,
    "end": 4246.792,
    "text": " votes from like from their employer so again money is a voting tool okay all right initial employment rate is seven percent unemployment rate is seven percent and the initial fraction of employees who work in nonprofit organizations is about seven percent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4247.932,
    "end": 4261.959,
    "text": " Now, when a community, say the LITA existed and the community was getting together and kind of forming to use a LITA, they would have to make all kinds of decisions of like, what kind of income target function are we gonna use?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4261.999,
    "end": 4266.481,
    "text": "How many years do we think it'll take to reach our full capacity?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4266.501,
    "end": 4270.783,
    "text": "There'd be a whole bunch of decisions like that to make.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4271.303,
    "end": 4275.625,
    "text": "And one of them would be how many, what kind of makeup of the,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4278.567,
    "end": 4279.868,
    "text": " organizations do we want?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4280.648,
    "end": 4282.149,
    "text": "Should we all work for nonprofits?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4282.709,
    "end": 4286.852,
    "text": "What if 90% of us, the membership, actually work for a nonprofit?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4287.312,
    "end": 4288.753,
    "text": "That's kind of an interesting question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4288.793,
    "end": 4290.714,
    "text": "And I would argue that this will work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4291.194,
    "end": 4304.862,
    "text": "The community could choose fairly extreme values and should work as long as the system continues to function as a cognitive system and as long as the community is using it to solve their actual problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4304.982,
    "end": 4305.122,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4305.737,
    "end": 4317.683,
    "text": " If the community wanted to have most everyone work in the nonprofit sector and wanted the nonprofit sector to grow food for the community and provide services to the community, it could do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4317.943,
    "end": 4320.405,
    "text": "I think it could do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4320.625,
    "end": 4326.408,
    "text": "If it instead wanted to fund principal businesses to a large degree and nonprofits to a smaller degree, it could do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4326.588,
    "end": 4331.39,
    "text": "So again, this decision-making process is a way for a community",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4333.925,
    "end": 4340.73,
    "text": " wants to be, what flavor it wants its economy to be, where it wants its individuals to work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4341.031,
    "end": 4352.7,
    "text": "Like, you know, being a member of a community like this, I would want to choose jobs that are useful to me and to others and that I would want to work in, you know, like whatever those would be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4353.936,
    "end": 4368.739,
    "text": " But an interesting thing, though, is if a community chose to fund a large part of its workforce in nonprofit sectors, it could have, say, a large number of biologists out repairing forests and streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4368.879,
    "end": 4374.139,
    "text": "And it could have a lot of forest workers repairing things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4374.399,
    "end": 4380.621,
    "text": "There could be a substantial amount of ecological regeneration funded from this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4381.281,
    "end": 4382.361,
    "text": "But there could be other things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4382.441,
    "end": 4383.461,
    "text": "It's whatever the community",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4383.902,
    "end": 4390.225,
    "text": " feels is going to increase its fitness, its capacity, its well-being, its quality of life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4390.865,
    "end": 4396.288,
    "text": "The community can choose not only which jobs to fund, but what kinds of jobs, what kinds of organizations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4398.729,
    "end": 4399.069,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4399.889,
    "end": 4400.349,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4401.25,
    "end": 4403.051,
    "text": "On to the next slide, 13.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4404.131,
    "end": 4406.492,
    "text": "So this is the way the simulation occurs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4406.672,
    "end": 4408.913,
    "text": "And it goes in annual steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4409.814,
    "end": 4411.034,
    "text": "And each year, the first step",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4413.88,
    "end": 4419.942,
    "text": " as new members are added according to this expected participation rate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4421.042,
    "end": 4440.628,
    "text": "And some of those people who are already working in what I call lead of funded new jobs, LFNJ, that is, you know, the lead of funds and organization, but that organization might go bust and then those people would lose their lead of funded new jobs and they switch over then to the unemployed or not in workforce category.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4442.239,
    "end": 4446.321,
    "text": " So, uh, number two, every year, some people lose their jobs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4446.341,
    "end": 4447.542,
    "text": "Some members lose their jobs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4448.443,
    "end": 4455.887,
    "text": "Uh, the, the number three, the CDFS makes nurture payments to those people who are not in the workforce who are unemployed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4455.907,
    "end": 4462.25,
    "text": "Um, uh, I'm just going to not going to go through each of these.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4462.611,
    "end": 4464.692,
    "text": "Um, but I will mention number five.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4464.712,
    "end": 4470.435,
    "text": "Um, so the leader has injected tokens into the economy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4470.984,
    "end": 4472.445,
    "text": " You can't pay taxes with tokens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4472.945,
    "end": 4478.209,
    "text": "So by definition, dollars have to come from elsewhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4479.57,
    "end": 4488.176,
    "text": "Another factor is that in a poor community, it may have a shortage of dollars relative to the rest of the world, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4488.756,
    "end": 4492.659,
    "text": "Other areas in the country might have a higher percentage of dollars in circulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4493.639,
    "end": 4498.683,
    "text": "So somehow this club, this leader has to pick up dollars from elsewhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4499.386,
    "end": 4504.809,
    "text": " in order to fund its, you know, in order to achieve the level of income that it's aiming to achieve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4505.549,
    "end": 4519.797,
    "text": "And it does that by one main process, and that's by having a kind of a sophisticated bi-local program.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4520.397,
    "end": 4527.081,
    "text": "That is, it's the community is supporting local businesses,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4528.824,
    "end": 4534.506,
    "text": " and spending a good chunk of its resources in the local businesses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4535.366,
    "end": 4539.067,
    "text": "And then by definition, that money is not flowing out of the community.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4539.107,
    "end": 4540.588,
    "text": "It's staying in the community longer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4540.668,
    "end": 4542.249,
    "text": "It's circulated in the community longer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4542.969,
    "end": 4552.392,
    "text": "And the community obtains dollars from elsewhere by adjusting its trade balance with the rest of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4553.712,
    "end": 4554.833,
    "text": "So one of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4559.642,
    "end": 4562.544,
    "text": " would be tracking is what is our trade balance with the rest of the world?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4562.604,
    "end": 4563.165,
    "text": "How are we doing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4563.205,
    "end": 4568.989,
    "text": "Are we adjusting our trade balance as necessary to bring in the dollars that we want?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4569.689,
    "end": 4583.239,
    "text": "And in this simulation, as you'll see, the families actually reach what would be considered a very high income from this, the 90th percentile of starting income.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4583.979,
    "end": 4587.602,
    "text": "So the families would receive quite a very high income",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4588.337,
    "end": 4589.958,
    "text": " And that would include tokens and dollars.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4590.798,
    "end": 4596.54,
    "text": "And as it turns out, the dollar portion of that is about the national average.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4596.6,
    "end": 4606.865,
    "text": "If you looked at all incomes in the US, that community ends up, in a sense, obtaining its fair share of dollars.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4607.525,
    "end": 4615.848,
    "text": "So if every community in the country were to do this, there wouldn't be a shortage of dollars because those dollars would just be more equally dispersed everywhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4617.731,
    "end": 4618.512,
    "text": " That's kind of important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4618.672,
    "end": 4629.06,
    "text": "What you would not want to do in some R&D program is design a system so that a small community can do exceptionally well at the expense of everybody else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4629.401,
    "end": 4630.962,
    "text": "So that's not what this is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4633.104,
    "end": 4637.508,
    "text": "So number five was that you adjust the trade balance as part of these steps every year.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4638.228,
    "end": 4640.89,
    "text": "And again, this is a very simple simulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4640.93,
    "end": 4643.993,
    "text": "So at the end of each year, all the individuals spend whatever",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4652.0,
    "end": 4656.783,
    "text": " And finally, number seven, individuals may pay taxes to governments in dollars.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4658.625,
    "end": 4659.585,
    "text": "Yeah, so that's it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4660.406,
    "end": 4661.927,
    "text": "So that's kind of the steps you get there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4661.947,
    "end": 4664.089,
    "text": "That's how it sort of works mechanically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4664.689,
    "end": 4667.651,
    "text": "Here's some of the parameters that I used.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4668.091,
    "end": 4671.574,
    "text": "Over on the left are the kind of general parameters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4672.414,
    "end": 4675.997,
    "text": "Excuse me, those are the targets for the community.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4676.037,
    "end": 4678.719,
    "text": "So the income targets, both starting and ending values.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4680.018,
    "end": 4683.62,
    "text": " Uh, and this is for the growth period, which is a 15 year period.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4684.2,
    "end": 4693.563,
    "text": "So the, uh, uh, uh, income target starts low at the, essentially at a, like a, uh, what would might be called a minimum wage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4693.723,
    "end": 4693.904,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4695.064,
    "end": 4700.366,
    "text": "And then it rises up to, uh, over almost 110,000 tokens in dollars.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4700.786,
    "end": 4704.448,
    "text": "So 110,000 family income in currency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4705.108,
    "end": 4707.909,
    "text": "And, uh, that is the 90th percentile of starting values.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4709.158,
    "end": 4716.682,
    "text": " So by the way, I've already said that every year the club essentially pays people to join.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4717.242,
    "end": 4724.806,
    "text": "So obviously, in year one, it's not asking anyone to reduce their income down to the minimum wage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4725.306,
    "end": 4729.428,
    "text": "So no one is asked to lose income in this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4731.809,
    "end": 4733.81,
    "text": "People join because their income increases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4734.311,
    "end": 4738.653,
    "text": "Now, some people might join because they just want to be a part of the community, part of the LIDA.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4739.307,
    "end": 4744.249,
    "text": " And their income would increase, too, if they're above the income target that year.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4744.529,
    "end": 4748.07,
    "text": "Their income would increase by a small stipend paid in tokens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4748.15,
    "end": 4757.553,
    "text": "So even if I'm making $1 million, I can join, and I can receive some tokens, and I can participate in CBFS and other things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4759.014,
    "end": 4760.714,
    "text": "So that was the table on the left.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4760.794,
    "end": 4765.636,
    "text": "And the table on the right are some of the earmarks that I use in this particular simulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4766.266,
    "end": 4769.427,
    "text": " And you might notice that the highest earmark there is for the nurture arm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4769.687,
    "end": 4780.59,
    "text": "So a good chunk of my kind of raw revenue coming in, my raw income, a good chunk of that, almost 40%, is going to the nurture arm of the CBFS.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4781.21,
    "end": 4785.171,
    "text": "And that's paying, again, for anyone who's unemployed or not in the workforce.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4786.012,
    "end": 4794.834,
    "text": "And other than that, some of my income goes to the lending arm, some goes to principal businesses, some goes to nonprofits, goes to subsidies of various kinds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4795.489,
    "end": 4798.411,
    "text": " goes to donations for nonprofits and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4798.832,
    "end": 4819.007,
    "text": "And I also have, obviously, if I'm putting money into this lending function, then I'm building up a kind of a savings account in the CBFS that if people are paying back my loans, then every year I'm maintaining a good chunk of money in the CBFS itself, kind of like a savings account.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4821.409,
    "end": 4823.491,
    "text": "I think, yeah, that's about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4824.138,
    "end": 4829.442,
    "text": " there's a couple of rules of thumb that I realized in trying to find parameters that actually make this thing go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4829.922,
    "end": 4837.708,
    "text": "And the one rule of thumb is the nurture arm has to have a high enough earmark so that that actually functions as, as it's supposed to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4838.489,
    "end": 4849.837,
    "text": "And, and also the donations earmark for local nonprofits has to be high enough so that any nonprofit that I fund can actually pay its employees the, the, the, the,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4854.821,
    "end": 4864.865,
    "text": " By the way, a principal business, one of the things that demarks a principal business is that it pays no higher than the final income target.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4864.905,
    "end": 4870.427,
    "text": "So the final income target is about $107,000 tokens and dollars.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4871.387,
    "end": 4875.969,
    "text": "And a principal business would never pay someone more than that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4875.989,
    "end": 4882.812,
    "text": "And ideally, most people who join a principal business would become members and I think they all would become members and participate in the lead itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4884.219,
    "end": 4889.183,
    "text": " So that's a few things that distinguish a principled business.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4890.184,
    "end": 4900.514,
    "text": "And obviously, a community would want to fund principled businesses because this is a business model that is designed to support the leader and club model itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4900.775,
    "end": 4902.737,
    "text": "So it's designed to support the community.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4903.533,
    "end": 4909.076,
    "text": " And if I were voting in the CBFS, I would really, you know, like I value being a member.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4909.176,
    "end": 4917.561,
    "text": "I value my community and I want my, I want this thing to work and I want, I want to receive the benefits that this system is promising.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4918.161,
    "end": 4929.608,
    "text": "And the, and the way to get there, or one way to get there is to mostly fund principal businesses so that they are serving the community in the way, kind of like a nonprofit serves a community.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4930.628,
    "end": 4931.609,
    "text": "Uh, and, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4932.327,
    "end": 4935.51,
    "text": " And they're paying wages that are consistent with how this whole thing works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4936.411,
    "end": 4940.995,
    "text": "And they're really being responsible to the community via this business model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4941.756,
    "end": 4952.525,
    "text": "And it's really in my best interest to support principled businesses with subsidies and donations and loans and things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4952.745,
    "end": 4956.509,
    "text": "Not that there's no room for regular businesses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4957.109,
    "end": 4957.35,
    "text": "There is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4965.836,
    "end": 4966.236,
    "text": " All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4966.256,
    "end": 4972.758,
    "text": "Yeah, that's it for parameters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4973.318,
    "end": 4973.938,
    "text": "Next slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4973.978,
    "end": 4975.958,
    "text": "Now we're going to start looking at what actually happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4979.519,
    "end": 4982.48,
    "text": "We have about 20, we have about 35 minutes left.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4982.54,
    "end": 4984.34,
    "text": "I think we're going to get right through the end of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4984.38,
    "end": 4987.821,
    "text": "So I may have to go a little faster as we get to the end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4988.461,
    "end": 4992.482,
    "text": "So the first slide on the upper left is the fraction of the county population.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4992.93,
    "end": 5001.272,
    "text": " And you can see in that blue line, that's the rate at which people, the participation rate, which is decided in advance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5001.332,
    "end": 5002.852,
    "text": "You know, this is what we expect to happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5003.592,
    "end": 5006.553,
    "text": "And there it goes straight up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5007.193,
    "end": 5009.613,
    "text": "And then it reaches the plateau after 15 years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5009.713,
    "end": 5015.695,
    "text": "So that's after 15 years, 90% of the county population has joined the LIDA.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5016.135,
    "end": 5017.915,
    "text": "And they've done so because their income has gone up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5018.817,
    "end": 5032.723,
    "text": " Uh, the, the, if I were, if I were, if I were a member of a citizen in the county and I didn't have a job, well, for sure, I would want to join the leader because I'm going to get, my income is going to go way up if I joined the leader relative to not joining the leader.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5033.384,
    "end": 5046.95,
    "text": "So, uh, I account here for every, not every unemployed person or not in workforce person to, to, uh, to actually, uh, uh, join the leader so they can be part of the, you know, receive funding from the nurture arm of the CBFS.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5049.521,
    "end": 5051.562,
    "text": " Down below that, there's the income target.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5052.102,
    "end": 5054.183,
    "text": "The income target is the blue line.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5054.283,
    "end": 5059.527,
    "text": "Again, after 15 years, it reaches a plateau of about 110,000 tokens and dollars, and then it levels off.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5061.368,
    "end": 5066.391,
    "text": "And again, I want to emphasize that at that level, every community in the country could do this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5066.451,
    "end": 5068.312,
    "text": "This is not preclusive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5068.612,
    "end": 5071.034,
    "text": "If one community does it, that doesn't mean that others can't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5071.654,
    "end": 5076.217,
    "text": "Every community could achieve these levels based on the assumptions of the model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5077.754,
    "end": 5081.575,
    "text": " On the right is the fraction of income over the years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5081.735,
    "end": 5086.017,
    "text": "So fraction in, let's just look at the green line.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5086.057,
    "end": 5088.658,
    "text": "The green dotted line is the token share of income target.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5089.198,
    "end": 5093.279,
    "text": "So in the early years, that's a very low fraction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5093.399,
    "end": 5095.38,
    "text": "Most of the income is in dollars.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5095.8,
    "end": 5099.762,
    "text": "And then it rises over the years to eventually reach about 35%.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5100.502,
    "end": 5106.504,
    "text": "So at the end of the simulation, about 35% of income is in tokens and the rest is in dollars.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5109.008,
    "end": 5112.609,
    "text": " And then the fund starts with the bottom right graph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5113.029,
    "end": 5114.749,
    "text": "This is the average family income.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5115.809,
    "end": 5116.61,
    "text": "Starts at about $40,000.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5116.81,
    "end": 5120.11,
    "text": "That is from the census data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5121.25,
    "end": 5121.791,
    "text": "Starts at about $40,000.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5122.451,
    "end": 5127.292,
    "text": "And you can see what happens with the blue line over the period of 15 years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5127.552,
    "end": 5130.312,
    "text": "It more than doubles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5130.672,
    "end": 5132.113,
    "text": "So family income more than doubles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5132.133,
    "end": 5134.713,
    "text": "It reaches the 90th percentile of starting income.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5136.004,
    "end": 5143.468,
    "text": " The red dotted line is showing the similar thing, only it's including the money that people have in their savings account in the CBFS.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5143.528,
    "end": 5149.651,
    "text": "So there's a two person family, each has contributed a maximum of 30,000 to the savings account.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5149.691,
    "end": 5156.594,
    "text": "So on top of this high income families also have $60,000 in savings in the CBFS.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5159.616,
    "end": 5165.159,
    "text": "You might notice that all the growth is happening during the first 15 years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5166.035,
    "end": 5171.977,
    "text": " But you can tell from the blue line, the family income line at the bottom graph, that there's a little bit of a lag.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5172.018,
    "end": 5180.601,
    "text": "It takes a little bit of time for the whole thing to actually reach its maximum family income.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5181.021,
    "end": 5183.482,
    "text": "And that happens about year 28 or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5184.363,
    "end": 5194.667,
    "text": "I might also mention, too, that in this simulation, I was just trying to find kind of reasonable parameters and a growth period and things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5195.16,
    "end": 5197.663,
    "text": " such that it would all make sense and would work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5197.723,
    "end": 5204.432,
    "text": "And we're not expecting the community to change in year one, suddenly everything changes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5204.452,
    "end": 5205.253,
    "text": "It wouldn't be like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5205.273,
    "end": 5206.735,
    "text": "It would tend to grow slower.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5207.196,
    "end": 5211.742,
    "text": "But having said that, you could think of the simulation as what might happen in the first LIDA.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5213.018,
    "end": 5219.063,
    "text": " But imagine that there's already a hundred leaders or 200 or 500 leaders around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5219.543,
    "end": 5221.405,
    "text": "It's really clear how these things work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5221.445,
    "end": 5223.606,
    "text": "There's lots of data coming in from leaders all over.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5223.987,
    "end": 5226.128,
    "text": "It's clear that incomes are rising and the,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5227.276,
    "end": 5231.578,
    "text": " interest by the general population is growing very rapidly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5232.218,
    "end": 5243.984,
    "text": "Like suddenly it's a new thing and everyone wants to join because everyone's income goes up and their empowerment goes up and their sense of community goes up and they're aligning their purpose with some greater good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5244.545,
    "end": 5245.265,
    "text": "It feels good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5246.225,
    "end": 5248.907,
    "text": "There's a whole variety of benefits that come from being a member.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5249.367,
    "end": 5253.409,
    "text": "So someone wants to start a club in another city,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5254.432,
    "end": 5257.333,
    "text": " And suddenly there's a tremendous interest on day one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5257.533,
    "end": 5259.334,
    "text": "Well, then all of this would go a lot faster.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5259.554,
    "end": 5261.175,
    "text": "It wouldn't necessarily take 15 years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5261.215,
    "end": 5263.636,
    "text": "It might go in half that time or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5267.998,
    "end": 5269.098,
    "text": "On slide 16.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5270.959,
    "end": 5272.839,
    "text": "On the left is the unemployment rate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5273.0,
    "end": 5275.581,
    "text": "As I mentioned, it starts at about 7% in the county.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5276.081,
    "end": 5284.084,
    "text": "And you can see that after about 15 years, the county achieves full employment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5284.986,
    "end": 5295.769,
    "text": " So, uh, that all works well, the lead is generating jobs and whether they're nonprofit jobs in the nonprofit sector or for-profit sector, the unemployment rate, everyone's being engaged that wants to be engaged.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5296.049,
    "end": 5299.551,
    "text": "Now keep in mind that a certain percent stay out of the workforce.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5299.771,
    "end": 5305.893,
    "text": "And I just chose a typical percent, whatever that was 36% or something so that not everyone is working.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5306.033,
    "end": 5310.554,
    "text": "Some people are doing other things, non-formal jobs or whatever term you might want to use them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5310.97,
    "end": 5312.411,
    "text": " You know, everyone's engaged somehow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5312.691,
    "end": 5316.652,
    "text": "People are actively engaged in their lives and in their community.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5316.732,
    "end": 5322.735,
    "text": "But some people who are in the workforce, the unemployment rate is very low.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5324.095,
    "end": 5329.518,
    "text": "And the unemployment rate in the club itself reaches its lowest level after 10 years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5329.618,
    "end": 5333.339,
    "text": "It just takes a little while for the rest of the county to catch up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5334.28,
    "end": 5338.981,
    "text": "On the left, this is the before and after snapshot of what family incomes are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5340.603,
    "end": 5345.144,
    "text": " upper graph shows the distribution from the census data on day one or day zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5345.964,
    "end": 5352.365,
    "text": "And the bottom graph shows the same thing on the 28th year of the simulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5352.765,
    "end": 5361.027,
    "text": "And you can see that essentially everyone in the county, 90% of the people in the county are making the income target, which is just over 100,000.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5362.207,
    "end": 5366.668,
    "text": "So it goes from a highly unequal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5368.251,
    "end": 5372.833,
    "text": " income to a almost completely equal income over the period of 28 years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5375.735,
    "end": 5377.035,
    "text": "Let me ask a question, John.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5377.075,
    "end": 5386.46,
    "text": "So I still see that between 350 and 400, there's still the 10% who don't join, ostensibly because they would stand to lose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5387.56,
    "end": 5387.72,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5388.321,
    "end": 5389.521,
    "text": "So how do you take- That's correct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5389.581,
    "end": 5389.821,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5389.961,
    "end": 5391.282,
    "text": "They wouldn't join because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5393.101,
    "end": 5407.99,
    "text": " sorry, just how do you take the other 90% and make their average value something with fewer people working productive jobs, having a higher average than 80% that's below 100K in the top graph?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5412.293,
    "end": 5413.474,
    "text": "If I understood the question, it's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5414.198,
    "end": 5424.406,
    "text": " kind of what do you do with the 10% who don't join and do, is there some kind of, do their income somehow equalize over time or do they, like what happens?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5425.011,
    "end": 5427.233,
    "text": " Well, let me just ask again, because they don't change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5427.273,
    "end": 5444.689,
    "text": "So ignoring the 10% whose income does not change, how do you take the bell curve right side here, which has an average below 100,000, and then by reducing the variance, also increase the mean while potentially having fewer people with income generating jobs?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5445.209,
    "end": 5450.594,
    "text": "Just how does the extra USD per year come into this system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5455.706,
    "end": 5456.146,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5456.286,
    "end": 5460.447,
    "text": "Again, I'm not sure if I understand the question, but how does the extra U.S.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5460.467,
    "end": 5461.567,
    "text": "dollars come into the system?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5461.647,
    "end": 5463.768,
    "text": "That's through balancing of the trade deficit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5464.308,
    "end": 5469.529,
    "text": "So that's how the new dollars come in that weren't there before, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5469.629,
    "end": 5479.271,
    "text": "So what this club is doing essentially is adjusting its trade balance with the rest of the world such that it's getting its fair share of dollars.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5479.891,
    "end": 5483.532,
    "text": "And the dollar income of the club",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5484.056,
    "end": 5489.489,
    "text": " equals the average dollar income of the US at the end of the simulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5491.394,
    "end": 5492.497,
    "text": "Did that answer your question?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5494.942,
    "end": 5510.053,
    "text": " So it's predicated on basically a locally positive economy that's generating a trade excess to get more USD because you need more USD to pay that number of people, 100,000 versus between zero and 100,000.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5510.934,
    "end": 5521.582,
    "text": "And so even though fewer are making potentially productive jobs, fewer are not in the workforce, there's so many more USD coming in that we can raise the income for them and everyone else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5521.662,
    "end": 5523.524,
    "text": "I'm just saying that that's built in, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5524.364,
    "end": 5524.945,
    "text": " That's built in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5525.005,
    "end": 5525.165,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5525.445,
    "end": 5526.106,
    "text": "That's all built in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5526.386,
    "end": 5526.546,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5527.166,
    "end": 5527.306,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5527.967,
    "end": 5533.311,
    "text": "Now you're not, what I thought you were originally asking is what do you do with the other 10% of what happens to them?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5534.092,
    "end": 5541.838,
    "text": "We'll talk about that in a moment, but I'm going to argue that their incomes actually fall towards this, this plateau of around 110 too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5542.758,
    "end": 5545.821,
    "text": "I think social pressure, social pressure would ensure it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5547.142,
    "end": 5548.843,
    "text": "That would be one, that would be one thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5548.863,
    "end": 5549.984,
    "text": "And there's some other reasons too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5552.146,
    "end": 5552.386,
    "text": "Well, we,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5552.827,
    "end": 5554.748,
    "text": " We might as well talk about it now since we're on the topic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5556.349,
    "end": 5565.313,
    "text": "So let's suppose that I own a franchise of a corporation, say McDonald's or something, could be anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5566.154,
    "end": 5569.536,
    "text": "And I take in money from the local community.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5569.576,
    "end": 5577.96,
    "text": "They spend money to buy my food, but then I'm sending money outside of the community because I'm paying franchise fees and other things, corporate fees and other things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5578.672,
    "end": 5580.433,
    "text": " So some of my money's leaving the community.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5580.453,
    "end": 5581.914,
    "text": "I'm paying low wage workers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5581.954,
    "end": 5589.758,
    "text": "And that's what makes this whole model work is that I can get low wage workers to sit behind the counter and make hamburgers or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5590.798,
    "end": 5593.92,
    "text": "Now, what happens when there's no low wage workers to choose from?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5594.0,
    "end": 5595.2,
    "text": "Like everyone's joined the leader.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5595.4,
    "end": 5597.702,
    "text": "Everyone who I would have paid 30,000 a year, 40,000 a year is now making 110,000 a year.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5601.348,
    "end": 5602.869,
    "text": " Where does my workforce come from?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5603.089,
    "end": 5609.233,
    "text": "How is my business model going to even function if I don't have a low-income pool to draw from?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5610.373,
    "end": 5615.216,
    "text": "So my business model is going to be strained, to say the least.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5615.837,
    "end": 5616.737,
    "text": "It won't work very well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5616.817,
    "end": 5617.818,
    "text": "It's changing the game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5617.838,
    "end": 5622.54,
    "text": "It's changing the foundations of how the normal business works in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5626.005,
    "end": 5636.673,
    "text": " And not only would people not be available because the leader would be paying higher incomes, higher wages, but those people should be enjoying their jobs a whole lot more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5636.733,
    "end": 5644.619,
    "text": "They would understand that they're helping the community by working in the bakery or wherever they're working.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5644.659,
    "end": 5648.542,
    "text": "It's part of a community effort to raise the fitness of the community, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5648.582,
    "end": 5649.643,
    "text": "Like we're all in this together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5651.444,
    "end": 5652.365,
    "text": "And I'm getting a voice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5654.162,
    "end": 5655.083,
    "text": " by becoming a member.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5655.664,
    "end": 5662.731,
    "text": "So there's lots of reasons I would want to be a member, and very few reasons I would want to be a low-paid worker at McDonald's or anywhere else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5664.473,
    "end": 5665.554,
    "text": "And that's another reason.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5665.594,
    "end": 5670.199,
    "text": "And the third reason is there's the IP commons that I mentioned earlier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5671.812,
    "end": 5675.633,
    "text": " So there's all these, you know, the leader has now funded all these new businesses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5675.673,
    "end": 5689.676,
    "text": "Some are technical businesses, some other businesses, but there's all kinds of property being generated in particular intellectual property that, uh, that is shared amongst the membership amongst the club and maybe even between clubs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5690.537,
    "end": 5700.639,
    "text": "So suddenly there's this enormous advantage to, to principal business or to, uh, to a member of businesses, to becoming members, because you get this, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5702.677,
    "end": 5705.619,
    "text": " volume of free intellectual property.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5706.459,
    "end": 5714.384,
    "text": "And standard businesses that are outside of this do not have access to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5715.085,
    "end": 5718.867,
    "text": "They have to pay royalties to get that IP stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5719.488,
    "end": 5720.308,
    "text": "So that's another reason.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5721.849,
    "end": 5726.892,
    "text": "And I think there's actually still one more reason that I want to talk about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5728.693,
    "end": 5730.074,
    "text": "Well, a successful community...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5731.843,
    "end": 5744.253,
    "text": " a successful community would have many leverage points and many ways to draw income in and an unsuccessful community would have no one wanting to help them except for the U S government paying USD, which I also saw in the model, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5744.293,
    "end": 5746.895,
    "text": "That the USD is providing by the government.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5746.955,
    "end": 5752.48,
    "text": "So it's like welfare at the country level and also at the community level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5753.38,
    "end": 5753.56,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5754.061,
    "end": 5754.301,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5754.321,
    "end": 5755.662,
    "text": "So imagine that's a good point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5755.742,
    "end": 5760.586,
    "text": "And imagine how that's going to affect, say a county government, a good,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5761.917,
    "end": 5790.06,
    "text": " county level governance or state level governance or even federal governance what if it didn't have to pay like all this unemployment insurance and all these other things the fees that the government has to pay you know when people are when people need help right all these programs uh and the and all of it is being taken care of at the community level by by leaders and clubs like leaders so the so there would be actually like in that sense you would expect that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5791.372,
    "end": 5816.623,
    "text": " state and go and national governments might actually like this concept you know because it's reducing their liabilities you know it's especially at the local government the local government as I said the local tax revenues are double in this in this simulation so you know the county government might go like hey good idea this is if this could work this is a great idea and the individuals might say hey this works this is a great idea my income is gonna double",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5817.945,
    "end": 5818.185,
    "text": " Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5818.285,
    "end": 5818.745,
    "text": "Fantastic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5819.766,
    "end": 5821.246,
    "text": "Just a bit on income.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5821.666,
    "end": 5826.307,
    "text": "Obviously, with this, the lower your starting income, the more you benefit from this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5826.387,
    "end": 5838.251,
    "text": "So if you happen to be someone at day zero where your family income is fairly low, yours is going to have the greatest rise compared to someone who's already making, say, mid-level income or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5838.771,
    "end": 5839.431,
    "text": "But it doesn't matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5839.451,
    "end": 5842.772,
    "text": "It's like the rising boat catches everybody by the time it gets up to the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5848.23,
    "end": 5849.933,
    "text": " Some more results on slide 17.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5851.414,
    "end": 5858.243,
    "text": "On the upper left-hand corner, you can see how much money is circulating in this CBFS.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5861.808,
    "end": 5867.032,
    "text": " I want to emphasize again that this is a community of 100,000 people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5867.072,
    "end": 5868.813,
    "text": "This is a small community, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5868.873,
    "end": 5874.276,
    "text": "So this small community is now circulating $6 billion in currency annually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5874.697,
    "end": 5879.76,
    "text": "That's $6 billion that it has to choose about, like, what jobs do we create?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5879.9,
    "end": 5881.781,
    "text": "What nonprofits do we support?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5882.342,
    "end": 5883.202,
    "text": "What do we want?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5883.262,
    "end": 5884.543,
    "text": "What kind of parks do we want?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5884.643,
    "end": 5885.884,
    "text": "What is the road quality?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5885.984,
    "end": 5887.265,
    "text": "How is our hospital system?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5887.305,
    "end": 5890.207,
    "text": "Like, whatever decisions this community needs to make,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5890.717,
    "end": 5892.599,
    "text": " It's got $6 billion in currency to play with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5893.2,
    "end": 5894.841,
    "text": "So an enormous amount.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5896.063,
    "end": 5901.668,
    "text": "And that should be enough for the community to make whatever choices it wants as far as what are we going to do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5901.688,
    "end": 5902.449,
    "text": "How are we going to get there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5902.469,
    "end": 5904.431,
    "text": "How are we going to improve our quality of life?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5909.616,
    "end": 5913.1,
    "text": "And maybe just on that note, I will mention again, we've already said this, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5914.131,
    "end": 5917.854,
    "text": " There's no club that's an entity in and of itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5918.394,
    "end": 5928.922,
    "text": "As clubs start to form and develop, there would also be along with them networks of clubs that are forming and developing that are also a cognitive system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5929.022,
    "end": 5941.211,
    "text": "So the cognitive system is playing, the cognitive architecture is playing out at the local level at a club, and it's playing out between clubs as clubs need to make decisions about how they're going to solve larger problems, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5941.986,
    "end": 5947.49,
    "text": " So again, no club is in this for its own good and only its own good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5949.611,
    "end": 5950.351,
    "text": "Clubs are connected.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5951.232,
    "end": 5952.753,
    "text": "This is a greater good project.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5954.441,
    "end": 5961.026,
    "text": " Um, the bottom left, uh, these are how the workforce gets divided over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5961.526,
    "end": 5966.77,
    "text": "So on day zero, most of the workforce is in the regular standard businesses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5967.191,
    "end": 5970.493,
    "text": "Almost 90, 97% is in a regular standard business.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5970.533,
    "end": 5975.016,
    "text": "A little bit is in the nonprofit sector and obviously zero is in the principal business sector.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5975.577,
    "end": 5982.562,
    "text": "But after, after the period of 28 years, it achieved some different balance of the core course.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5983.155,
    "end": 5989.716,
    "text": " And I just want to say again, that whatever balance that is, it's a balance that the community chooses in advance, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5989.756,
    "end": 5991.477,
    "text": "So this, it just didn't play out by itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5991.577,
    "end": 5994.737,
    "text": "These are based, these are all based on the community decisions all along the way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5995.157,
    "end": 6004.539,
    "text": "Like we want this community wants to achieve a 50%, uh, you know, to split its workforce, uh, 50% into the nonprofit sector or 40% or 80% or 90% or whatever it wants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6010.032,
    "end": 6013.194,
    "text": " Um, upper right graph are the donations made to nonprofits.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6013.234,
    "end": 6015.676,
    "text": "These are dollar donations apart from the CDFS.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6016.376,
    "end": 6020.719,
    "text": "And I'm just using a, like a fraction of income goes to donations, like a general fraction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6021.379,
    "end": 6025.322,
    "text": "And you can see that, uh, donations to local nonprofits more than double.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6025.802,
    "end": 6031.946,
    "text": "So, you know, this, at least, uh, in theory, this whole system is like a boom for county governments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6032.086,
    "end": 6033.907,
    "text": "It's a boon for the nonprofit sector.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6033.927,
    "end": 6036.529,
    "text": "Uh, it's a boon for the education sector.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6037.365,
    "end": 6041.169,
    "text": " Uh, and then everyone else's income is going up and unemployment's going down too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6041.269,
    "end": 6050.197,
    "text": "So like who loses the only people that are losing from this whole thing are the people who hold enormous economic power on day zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6050.878,
    "end": 6053.04,
    "text": "You know, like those people aren't really gaining from this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6054.021,
    "end": 6062.349,
    "text": "And if lots and lots of clubs were to, you know, lots and lots of cities were to implement clubs and this actually happened in scale, you know, distributed at scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6063.086,
    "end": 6083.515,
    "text": " then the real losers, in a sense, would be those who are quite wealthy to begin with, like billionaires, say, or multimillionaires, because their incomes would probably drop, as I've mentioned, over time, only because of social pressures and because they can't get people to work in their businesses and things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6084.363,
    "end": 6087.425,
    "text": " But at the same time, everyone's well-being increases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6087.525,
    "end": 6088.806,
    "text": "So it's not like anyone loses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6088.926,
    "end": 6090.086,
    "text": "Everyone wins here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6090.186,
    "end": 6097.05,
    "text": "Like the world is, you know, all communities are more empowered to solve their real problems that matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6097.111,
    "end": 6104.035,
    "text": "This is a cognitive system aimed at achieving sustainability and thriving into the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6104.135,
    "end": 6107.497,
    "text": "So there really isn't anybody that loses from this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6107.537,
    "end": 6111.399,
    "text": "There's just some apparent losers, you know, and not very many of them at that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6114.034,
    "end": 6116.416,
    "text": " The lower graph on this, I won't say too much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6116.456,
    "end": 6118.957,
    "text": "I'll just explain the blue line there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6119.378,
    "end": 6123.28,
    "text": "This is the number of tokens that are generated by the community.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6123.34,
    "end": 6130.744,
    "text": "So obviously in the early years, for the first 15 years, you're generating tokens because you're growing in this growth period.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6130.784,
    "end": 6133.886,
    "text": "And then after that, the tokens are just circulating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6134.367,
    "end": 6137.648,
    "text": "And importantly, they don't circulate outside of the membership.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6137.789,
    "end": 6141.891,
    "text": "So if I'm a standard business, there's no one can, oh, that's the other reason why.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6142.506,
    "end": 6153.429,
    "text": " why clubs and club businesses would grow is that if you're not a part of the club, people can't spend their tokens at your establishment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6153.849,
    "end": 6160.63,
    "text": "So I might be a local business and I don't want to participate and that's fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6160.811,
    "end": 6164.651,
    "text": "It all goes as it goes, but everyone else's incomes are increasing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6164.751,
    "end": 6168.792,
    "text": "Part of that income is in tokens and those people can't spend their tokens at my establishment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6169.273,
    "end": 6170.813,
    "text": "The only way they can is if I joined the,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6171.493,
    "end": 6174.474,
    "text": " If I join the club, then they can spend their tokens at my establishment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6179.355,
    "end": 6180.015,
    "text": "Page 18.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6180.715,
    "end": 6183.036,
    "text": "And I think this is the last of the results I was going to show.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6184.316,
    "end": 6186.737,
    "text": "This is the results just for the local government.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6186.817,
    "end": 6188.757,
    "text": "This is tax revenues for the local government.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6189.437,
    "end": 6190.778,
    "text": "The red is the tax receipts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6190.918,
    "end": 6196.819,
    "text": "So for this Lane County, I estimated that it starts at about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6197.944,
    "end": 6219.985,
    "text": " billion dollars annually in revenues and it more than doubles by the end of the simulation so their tax revenues go way up and you can imagine what counties would want to do with you know if their revenues tax revenues doubled you can imagine they could put that to very good use uh okay and just some final remarks on these last two slides",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6222.363,
    "end": 6225.924,
    "text": " And this first one is something that we just were touching on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6226.684,
    "end": 6229.705,
    "text": "What happens to the other 90% that don't join the leader?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6231.165,
    "end": 6243.368,
    "text": "So I would argue that in the long run, even that 10% that has very high incomes would see their incomes move closer to the target income for the leaders.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6244.408,
    "end": 6246.549,
    "text": "And that's for all the reasons that we just mentioned,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6249.864,
    "end": 6253.565,
    "text": " business owners don't receive the benefit of tokens because they can't accept tokens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6254.266,
    "end": 6259.987,
    "text": "There's social pressures to belong to the club because it's in everyone's benefit for people to belong to the club.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6261.008,
    "end": 6265.689,
    "text": "The IP is, there's an IP pool that people have access to if they join the club.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6266.789,
    "end": 6269.41,
    "text": "So like a number of reasons, maybe there was one other that we talked about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6271.491,
    "end": 6275.032,
    "text": "So you would think that, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6276.263,
    "end": 6282.207,
    "text": " This is the new, you know, like if this is happening, then it's like who uses a typewriter anymore, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6282.768,
    "end": 6283.428,
    "text": "Hardly anybody.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6284.109,
    "end": 6287.851,
    "text": "And it's because computers work better for typesetting, you know?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6289.893,
    "end": 6290.813,
    "text": "This is a technology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6291.013,
    "end": 6292.434,
    "text": "That's another way to say that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6292.474,
    "end": 6293.455,
    "text": "This is a technology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6293.555,
    "end": 6295.356,
    "text": "This is a decision-making technology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6296.157,
    "end": 6298.819,
    "text": "And it's both a soft and a hard technology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6299.379,
    "end": 6300.52,
    "text": "Education is part of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6300.54,
    "end": 6303.202,
    "text": "There's, you know, there's all these components to it, but it's a technology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6303.921,
    "end": 6305.785,
    "text": " And, uh, you know, that's what happens in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6305.845,
    "end": 6307.167,
    "text": "A new technology springs up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6307.328,
    "end": 6309.031,
    "text": "It's, it's far better than the old one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6309.192,
    "end": 6312.419,
    "text": "And then suddenly the old one is toast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6313.851,
    "end": 6318.194,
    "text": " Well, the old one becomes subsumed into conflict at a higher level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6318.274,
    "end": 6321.296,
    "text": "So you could have different chains that are competing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6321.376,
    "end": 6336.266,
    "text": "So the idea that still... One part for me is that just thinking about evolutionary transitions and individuality, it raises the level of conflict to another level up from what we've seen before with everything that politically and game theoretically would come with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6336.647,
    "end": 6340.97,
    "text": "And the second piece is I don't update my priors based upon...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6341.63,
    "end": 6342.951,
    "text": " models without parameter sweeps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6343.471,
    "end": 6346.773,
    "text": "So it's hard to look at a given layout and imagine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6346.893,
    "end": 6353.396,
    "text": "But it's something that we actually use as a North Star for people who are on that political journey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6353.696,
    "end": 6354.917,
    "text": "They might see that as beneficial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6355.357,
    "end": 6363.061,
    "text": "But as you're pointing out, people who don't see it as beneficial are not going to join until the incentive structures are restructured for them or that will happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6363.841,
    "end": 6364.902,
    "text": "Yeah, absolutely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6366.161,
    "end": 6367.482,
    "text": " and everyone's learning from this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6367.522,
    "end": 6370.584,
    "text": "So, you know, the communities, the world is learning from this, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6370.684,
    "end": 6375.207,
    "text": "And the world is learning over time, whether this is even a good idea or not, is this whole system work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6375.767,
    "end": 6383.752,
    "text": "And obviously if it doesn't work, if it doesn't produce these benefits that are, that are, that are expected in advance, if it doesn't do that, then it doesn't work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6383.832,
    "end": 6386.814,
    "text": "And then no one would join because it's a stupid system, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6386.834,
    "end": 6389.056,
    "text": "Or it has flaws that need to be fixed or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6389.876,
    "end": 6392.578,
    "text": "So, uh, yeah, everyone's learning together and, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6393.323,
    "end": 6398.066,
    "text": " And, uh, there could be numerous trials going on of different systems at the same time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6398.126,
    "end": 6399.387,
    "text": "And, you know, try it for the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6399.928,
    "end": 6404.13,
    "text": "Everyone can be trying to figure out what works best in this, what kind of systems work best.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6404.491,
    "end": 6408.033,
    "text": "And, um, yeah, all of that's happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6408.073,
    "end": 6410.855,
    "text": "It's evolving as, as we go, it's evolving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6411.455,
    "end": 6418.42,
    "text": "But the important thing is, is that this is a framework to facilitate societal cognition, you know, at the local level, at the club level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6419.181,
    "end": 6419.621,
    "text": "And, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6421.135,
    "end": 6430.682,
    "text": " If we think of our societal systems as cognitive systems, then it's a perfectly reasonable question to ask, what kinds of system designs work best?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6431.102,
    "end": 6435.365,
    "text": "And that's what this whole R&D program is aimed at, just asking that question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6435.485,
    "end": 6448.654,
    "text": "Of all conceivable designs, which kinds of designs might most facilitate societal cognition and therefore achieve the intrinsic purpose of a society, which is to thrive now and in the future?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6449.334,
    "end": 6450.435,
    "text": "So what designs?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6451.88,
    "end": 6455.504,
    "text": " And you can imagine all kinds of trials to help answer that question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6457.806,
    "end": 6458.307,
    "text": "Next slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6458.327,
    "end": 6459.668,
    "text": "And this is the last one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6460.689,
    "end": 6461.731,
    "text": "Just a few remarks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6461.751,
    "end": 6463.032,
    "text": "I've touched on this already.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6464.133,
    "end": 6466.696,
    "text": "But an organism is agile, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6468.197,
    "end": 6469.499,
    "text": "Among other things, I have legs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6469.559,
    "end": 6470.7,
    "text": "I can run from danger.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6470.74,
    "end": 6471.421,
    "text": "I can do things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6471.481,
    "end": 6472.502,
    "text": "I can change my behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6473.492,
    "end": 6476.138,
    "text": " As a community, we can change our behaviors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6476.178,
    "end": 6482.292,
    "text": "We can do whatever we need to do to achieve whatever task is in front of us, or at least achieve most tasks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6483.103,
    "end": 6485.524,
    "text": " But in particular, Alita is agile.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6485.944,
    "end": 6486.644,
    "text": "It is flexible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6486.764,
    "end": 6488.564,
    "text": "It can choose what jobs it funds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6488.904,
    "end": 6497.126,
    "text": "And suppose that 10 years into a new club, some big thing happens or some new challenge that wasn't anticipated, it just arose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6497.626,
    "end": 6500.227,
    "text": "Well, this is decision-making under uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6500.267,
    "end": 6501.667,
    "text": "That's the whole concept of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6502.087,
    "end": 6505.048,
    "text": "This whole system facilitates decision-making under uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6505.526,
    "end": 6509.988,
    "text": " Something new has happened, now the community has to respond to this new set of conditions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6510.508,
    "end": 6516.091,
    "text": "It can change its makeup of what businesses it funds, what organizations it funds, who does what.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6516.571,
    "end": 6521.714,
    "text": "It can change how many people work in the nonprofit sector versus for-profit sector.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6522.214,
    "end": 6532.479,
    "text": "It can essentially use, it can vote to focus its attention and its resources, human and otherwise, on whatever problem it needs to focus its attention on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6532.639,
    "end": 6534.24,
    "text": "So it's agile by design.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6535.086,
    "end": 6539.828,
    "text": " And part of that, by the way, is having fairly equal income.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6539.928,
    "end": 6550.494,
    "text": "So in our native system, if I'm a billionaire, it is really hard for the society to allocate my billions of dollars for some worthwhile project, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6551.074,
    "end": 6556.657,
    "text": "Because of the private property laws, that's my private property and you can't use it, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6557.317,
    "end": 6563.66,
    "text": "But if everyone's income is equal, then everyone is participating in that redistribution",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6568.05,
    "end": 6592.497,
    "text": " to the community so uh a community empowers businesses with with funding for example and it's important that it can retract that uh support when necessary so the the design of this whole system is such that there that things can change uh rapidly if need be and the community can redirect its attention to whatever problem it needs to address",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6594.044,
    "end": 6605.307,
    "text": " Again, the next one there is that the main resource is not money, it's human attention and energy and also to some degree natural resources.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6605.407,
    "end": 6614.129,
    "text": "But the real purpose of money is simply to allocate human attention and human energy and resources into those problems that actually matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6615.817,
    "end": 6630.981,
    "text": " And lastly, again, the leader can, because of its agility, because members are choosing what kinds of jobs to make, what sorts of businesses, what sorts of economy it wants, it can choose any flavor of an economy it wants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6631.081,
    "end": 6636.223,
    "text": "It creates the jobs that it wants to work in and the kinds of jobs that people want their children to work in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6636.983,
    "end": 6645.145,
    "text": "So it can do whatever it wants as long as it functions as a cognitive system and as long as it actually meets the essential needs of the organism, of the community.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6646.491,
    "end": 6667.1,
    "text": " and that is it in a nutshell or not in a nutshell that's it in those long there's the uh there's the the blueprint haiku for the nutcracker it is a few levels upstream but that's why it's fun to have these open-ended discussions and just allow um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6669.182,
    "end": 6687.621,
    "text": " you've worked on for so long to flow out just hear how you're laying it out and maybe in closing out this little discussion as we head into the next two weeks with the group discussions how would somebody get involved or where can somebody come into play after seeing this or reading the papers",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6689.77,
    "end": 6697.194,
    "text": " Oh, well, I can be reached through the website, principledsocietiesproject.org, and there's other resources there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6697.314,
    "end": 6701.796,
    "text": "So one start would be just to familiarize yourself with the material a bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6703.057,
    "end": 6706.139,
    "text": "But we have a mailing list, so people can just join the mailing list.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6706.179,
    "end": 6712.562,
    "text": "And as things progress and as opportunities arise, then we can use our mailing list to contact people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6714.325,
    "end": 6718.446,
    "text": " This whole series is written to the scientific community.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6719.007,
    "end": 6721.908,
    "text": "So that's my target audience for the series of papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6722.108,
    "end": 6729.83,
    "text": "And I'm hoping that I can entice the scientific community to pick up this topic as a worthwhile topic of study and endeavor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6730.751,
    "end": 6740.774,
    "text": "Can we, as a scientific community, address these issues, create designs, test designs, identify fitness",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6745.08,
    "end": 6768.632,
    "text": " describe how community cognition works and what is how it works best and the conditions you know necessary are we are we ready to to pick up this topic and i'm hoping the answer is yes because it looks rich to me and on so many levels could be extremely valuable to society and obviously it's aimed at societal transformation and it's already quite clear that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6769.116,
    "end": 6777.719,
    "text": " that different groups, academic and otherwise, generally understand that bold change is necessary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6777.799,
    "end": 6779.7,
    "text": "So this is one form of bold change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6780.32,
    "end": 6791.184,
    "text": "Now, academics in particular, please do reach out if you think, if there's any number, if you have some funding, there's any number of small studies that could be done immediately.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6792.624,
    "end": 6797.926,
    "text": "This simulation could be expanded in a number of ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6798.976,
    "end": 6809.879,
    "text": " A study could be done just looking at, just asking the public what they think of deep transformation and what they would think of income equality or what they, you know, like laying out some possibilities to the public.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6810.099,
    "end": 6825.862,
    "text": "Or if you were in media, whether that's literature or music or movies or documentaries or whatever, please contact me because just getting the word out to the public that transformation in this sense might actually be viable and possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6834.755,
    "end": 6835.717,
    "text": " So that's important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6835.877,
    "end": 6843.29,
    "text": "So if you got any idea about how to, an idea of how to contribute to this effort, then great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6843.851,
    "end": 6845.033,
    "text": "You know, some, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6847.679,
    "end": 6852.582,
    "text": " it's like either they can read it now and send you a note or hear about it later or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6853.663,
    "end": 6855.704,
    "text": "So over it goes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6857.366,
    "end": 6863.79,
    "text": "John, thanks so much for these awesome sessions though, because it was great reading the papers and great to go through them again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6864.07,
    "end": 6869.874,
    "text": "And we'll all be looking forward to speaking with you on the upcoming Tuesdays at 7 a.m.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6869.974,
    "end": 6870.334,
    "text": "Pacific.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6870.995,
    "end": 6871.956,
    "text": "So we'll talk to you soon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6872.216,
    "end": 6872.536,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6873.777,
    "end": 6874.978,
    "text": "I really appreciate the opportunity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6876.018,
    "end": 6876.639,
    "text": "Absolutely, John.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6876.819,
    "end": 6877.039,
    "text": "Talk to you",
    "speaker": "SPEAKER_00"
  }
]