[
  {
    "start": 12.839,
    "end": 28.551,
    "text": " okay hello everyone welcome to the active inference lab to an active inference live stream with john boyk this is going to be great it's our second of these interactive discussions on the sequence of papers that john has written",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 29.552,
    "end": 35.456,
    "text": " And today we're going to be hearing about motivation and strategy as well as active inference, of course, a lot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 35.956,
    "end": 37.657,
    "text": "So I'm Daniel Friedman.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 37.837,
    "end": 47.443,
    "text": "I'm a postdoc in California, and I'm going to pass it to John to introduce himself, lead us into this second discussion while I share the Jamboard link with our live participants.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 47.823,
    "end": 50.465,
    "text": "So, John, thanks again for coming on and please take it away.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 51.985,
    "end": 52.606,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 52.646,
    "end": 54.127,
    "text": "Daniel, thanks for having me on again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 54.147,
    "end": 54.587,
    "text": "This is great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 55.746,
    "end": 56.427,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 56.447,
    "end": 57.567,
    "text": "So my name is John Boyk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 58.308,
    "end": 63.571,
    "text": "I'm a courtesy faculty at Oregon State University Environmental Sciences graduate program.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 64.872,
    "end": 67.614,
    "text": "And we're here in this series of talks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 67.694,
    "end": 76.0,
    "text": "This is the second in the series to talk about the series of three papers that I recently published in the journal Sustainability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 76.5,
    "end": 83.805,
    "text": "The topic is societal transformation, in particular, the de novo development of new societal",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 88.766,
    "end": 89.246,
    "text": " and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 90.967,
    "end": 99.412,
    "text": "And last week, as maybe you can see on the Jamboard now, last week we started with the first part, which was on worldview.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 100.152,
    "end": 104.754,
    "text": "The topic, the title is Science-Driven Societal Transformation Part One, Worldview.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 105.675,
    "end": 117.341,
    "text": "And we didn't actually get through that, so we're going to pick up a few tail end ideas there and then hopefully start on the second paper, Part Two, which is subtitled Motivation and Strategy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 121.8,
    "end": 124.821,
    "text": " encourage people to download the papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 124.881,
    "end": 129.081,
    "text": "They're open access, so everyone can get them for free.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 131.662,
    "end": 132.882,
    "text": "Page two, perhaps?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 135.283,
    "end": 135.423,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 136.303,
    "end": 136.603,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 137.583,
    "end": 146.265,
    "text": "So just for more information about the project, about the links for the papers, for other links, there's a bunch of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 147.736,
    "end": 150.057,
    "text": " little articles that you could look at if you're interested.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 150.117,
    "end": 151.557,
    "text": "There's also an interactive model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 151.597,
    "end": 158.099,
    "text": "You could go to the Principled Societies Project website, and the address is given there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 158.179,
    "end": 161.06,
    "text": "So further information, if you need it, you can find it there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 163.06,
    "end": 163.32,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 163.521,
    "end": 163.781,
    "text": "Three?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 165.381,
    "end": 166.221,
    "text": "All right, three.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 167.102,
    "end": 167.422,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 167.942,
    "end": 174.924,
    "text": "All right, so we didn't get through the first, through the paper all the way in our first talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 176.744,
    "end": 181.688,
    "text": " So there's a few things that I'd like to catch up on before we move on to paper part two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 183.21,
    "end": 189.335,
    "text": "We touched on active inference in our last talk, but we didn't really get around to discussing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 189.355,
    "end": 195.26,
    "text": "So I want to say a few words about active inference itself, a little bit of a description about it for those who are not familiar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 196.401,
    "end": 204.388,
    "text": "And then we have the topics of cooperation and communication and the concept that complex organisms have complex needs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 205.501,
    "end": 223.169,
    "text": " And then on to some practical implications, and this is really the main thing I wanted to finish up with, is that in part one, I provide some kind of high-level sort of abstract concepts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 223.809,
    "end": 229.872,
    "text": "And I would imagine that the reader in certain places might be wondering, why are we discussing this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 230.192,
    "end": 234.054,
    "text": "What does this have to do with actually building new societal systems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 234.094,
    "end": 235.054,
    "text": "So I want to talk about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 235.882,
    "end": 245.11,
    "text": " a little bit of the practical implications of all of this kind of abstract, all these abstract notions that we've been working with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 245.65,
    "end": 252.576,
    "text": "So I would like to just recall just a few ideas from our last talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 253.376,
    "end": 259.001,
    "text": "And one is that, I claim at least, that a society has an intrinsic purpose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 260.042,
    "end": 264.806,
    "text": "And by intrinsic purpose, I really mean a biological purpose",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 267.054,
    "end": 268.135,
    "text": " eons of evolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 268.815,
    "end": 273.258,
    "text": "And that intrinsic purpose is the same purpose that every living organism has.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 273.378,
    "end": 279.021,
    "text": "So every living organism has this purpose, whether that's a bacteria or a human.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 279.361,
    "end": 287.166,
    "text": "And then I also claim that society is an organism that can be seen as an organism, can be viewed as an organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 287.926,
    "end": 291.108,
    "text": "And a society has the same intrinsic purpose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 291.268,
    "end": 294.63,
    "text": "So if our task is to develop new",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 298.9,
    "end": 300.822,
    "text": " are we and who are we building this for?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 301.502,
    "end": 309.368,
    "text": "And what is the purpose of if we were to build a new societal system, new economic system, for example, what would be the purpose?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 310.868,
    "end": 318.672,
    "text": " And if we know the purpose, then we can take the remaining, the next step and say, okay, we know what an economic system is supposed to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 318.732,
    "end": 320.613,
    "text": "We know what a governance system is supposed to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 321.233,
    "end": 325.615,
    "text": "So is this new design, design A, design B, is it fit for purpose?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 326.175,
    "end": 340.022,
    "text": "That's the concept is that if we're going to design new societal systems de novo from scratch, then we ought to have an idea of what they are supposed to do and then how we might measure their fitness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 340.478,
    "end": 350.323,
    "text": " So that we can determine, did we, did we create something that is fit for purpose and which one of these options, which one of these designs might be more fit for purpose than others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 351.443,
    "end": 351.703,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 351.723,
    "end": 353.504,
    "text": "So that's, that's kind of where we're going here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 354.245,
    "end": 369.792,
    "text": "And, uh, so the, the, uh, I claim that the intrinsic purpose of a society and organism, any organism or any organism is to achieve and maintain vitality, which is accomplished through, uh, largely through cognition and cooperation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 371.465,
    "end": 376.508,
    "text": " And so to maintain and achieve vitality for who?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 377.608,
    "end": 381.81,
    "text": "And that who I claim is the extended self.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 381.83,
    "end": 392.776,
    "text": "So the extent this, all of us are enmeshed in our world, enmeshed in our environment, enmeshed in a society with each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 392.796,
    "end": 400.06,
    "text": "And if we're speaking of a body, then the extended self is those",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 401.235,
    "end": 407.479,
    "text": " interactions with this necessary and vital interactions with the rest of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 407.599,
    "end": 420.766,
    "text": "So the extended self then is the self that extends to other people to, to societies to other societies to the environment, the local environment, the global environment, the biosphere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 421.646,
    "end": 427.67,
    "text": "So then in that sense, then if our purpose is to achieve and maintain vitality,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 428.695,
    "end": 440.761,
    "text": " Our purpose is to achieve, achieve and maintain vitality for that larger extended self that really goes all the way to the biosphere where all of life is in this together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 440.841,
    "end": 442.701,
    "text": "All of life is connected in one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 443.782,
    "end": 452.746,
    "text": "And and all of life is doing this thing, doing this thing of acting to achieve and maintain vitality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 453.646,
    "end": 456.828,
    "text": "And over eons of evolution, we get this amazing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 458.112,
    "end": 475.005,
    "text": " world of life and whales and Sequoia trees and ecosystems and all these T trees talking to fungi in the ground and plants talking to each other and beads doing their thing with flowers and each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 475.165,
    "end": 485.873,
    "text": "And I mean, it's just like amazing coordination and communication and cooperation happening between species and within a species and within a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 487.182,
    "end": 487.882,
    "text": " all of ourselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 489.343,
    "end": 506.468,
    "text": "So I would say that if we're going to create a better society or create new systems that lead to a better society, then the task will be to fulfill our intrinsic purpose, which in a way means to simply get with the program.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 507.429,
    "end": 511.13,
    "text": "That is, get with the program of what all of life is doing around us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 511.93,
    "end": 514.951,
    "text": "Just align with what life is doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 516.156,
    "end": 519.818,
    "text": " And then we will, you know, we'd be off to a good start if we can do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 521.219,
    "end": 523.26,
    "text": "All right, so that's the purpose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 523.6,
    "end": 530.284,
    "text": "And then at the bottom of that slide, I just highlight the word wisdom because it is reasonable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 530.304,
    "end": 536.527,
    "text": "You know, we think of wise action as something that is, you know, widely beneficial and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 538.793,
    "end": 544.845,
    "text": " action that is aware of the needs of others and is useful action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 545.726,
    "end": 547.249,
    "text": "But that is what we're talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 547.269,
    "end": 548.051,
    "text": "We're talking about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 550.01,
    "end": 578.387,
    "text": " of of taking actions that help to fulfill our intrinsic purpose and really by definition i would say that would be wise actions so in that sense we're aiming at a wisdom society a society where wisdom is valued and discussed and sought after and you know and and hopefully one in which uh individuals and groups and others institutions that act",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 583.582,
    "end": 587.563,
    "text": " Okay, so I do ask the question there at the bottom, can wisdom be rigorously defined?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 587.603,
    "end": 600.885,
    "text": "Now, often it's a term that is just generically applied to actions that some people feel are useful or appear to be useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 601.466,
    "end": 609.347,
    "text": "But if we're going to build new societal systems and we're going to have some sense of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 610.043,
    "end": 631.292,
    "text": " fitness for these systems, and the systems are in some way supposed to help us to act with wisdom and to facilitate action with wisdom, then perhaps there is some way actually to rigorously define wisdom or to know when actions are wise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 632.112,
    "end": 636.114,
    "text": "And I would say then that leads us right into the concept of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 637.274,
    "end": 637.634,
    "text": "Because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 640.166,
    "end": 659.369,
    "text": " active inference, we might say that actions that reduce uncertainty and maintain, you know, reduce expected uncertainty about our thriving or survival or survival into the future, those are beneficial actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 659.689,
    "end": 662.35,
    "text": "And then again, by definition, they're wise actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 662.45,
    "end": 669.031,
    "text": "So there might be some way to actually talk about wisdom in the same sentence as fitness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 670.414,
    "end": 695.57,
    "text": " the two concepts two concepts concepts must be closely related okay john can i ask i have two things i wrote down so one was cognition and when we talk about multi-scale cognition especially with a computational or a modeling bent it's easy to get caught up with cognition being a really mechanical process but i liked how you brought it to wisdom",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 696.13,
    "end": 707.016,
    "text": " And so it's like, if we're gonna be a cognitive system or if that's a framework we're taking, are we gonna be calculators and just do zero through nine calculations or will there be wisdom in the system?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 707.276,
    "end": 715.641,
    "text": "And that kind of brings me to the question, which is clarifying wisdom is a big opportunity, but also there are risks and uncertainties.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 716.021,
    "end": 723.245,
    "text": "So here in 2021, looking forward potentially to some type of wisdom transformation,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 724.105,
    "end": 727.268,
    "text": " what can we cling to and how can we follow wisdom?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 727.288,
    "end": 730.691,
    "text": "Because it sounds like a great idea, but then how will we know it in the mist?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 731.632,
    "end": 732.152,
    "text": "Right, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 732.653,
    "end": 736.156,
    "text": "Okay, so I'll talk to your first point first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 737.217,
    "end": 737.617,
    "text": "Excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 737.677,
    "end": 750.329,
    "text": "So I want to emphasize that we're not talking about building a society of robotic, you know, linear thinking, logical thinking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 750.962,
    "end": 774.695,
    "text": " organisms you know that's not really what humans are anyway that's what no organisms are you know we every organism has uh you know some degree of complexity of of its of itself and uh humans are very complex and we'll talk about the complexity of human needs in a moment but this it's life is not all about logic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 776.054,
    "end": 789.018,
    "text": " And it is partly about, you know, a good share of it is about heart and intuition and all the other emotion and all the other aspects that come to play in what it means to be human.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 789.959,
    "end": 802.943,
    "text": "So I'll repeat something I had said earlier too, is, you know, if we are to build better societal systems, better societies, those would be societies that would help us",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 804.264,
    "end": 810.449,
    "text": " Help us be true to ourselves more, true to our hearts more, true to our deepest longings more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 811.209,
    "end": 821.157,
    "text": "So I'm certainly not talking about building a society of people doing logic or computational logic or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 821.237,
    "end": 822.458,
    "text": "It's not at all what this is about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 822.618,
    "end": 831.605,
    "text": "This is about being more human, more ourselves, more capable of making wise decisions, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 832.286,
    "end": 832.426,
    "text": "Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 832.867,
    "end": 857.586,
    "text": " And I think some of these ideas from over that have been developed, say in the last 10 years of science, ideas from complex systems science, ideas from cognitive science, ideas from active inference, ideas from evolutionary biology and some others, we're in a much better position today to be talking about how might we do this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 857.666,
    "end": 861.85,
    "text": "How might we build systems that actually recognize the full",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 862.509,
    "end": 885.734,
    "text": " human the full society the full the full interactions and then and then help provide guidance of how that how that might best be done right yeah just one quick point on that is people have talked about general systems theory and about how we could simulate or choose utilitarian outcomes or all these different ideas that have been percolating for truly thousands of years in many cultures",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 886.474,
    "end": 887.094,
    "text": " What's different?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 887.375,
    "end": 899.681,
    "text": "Well, in your pocket, there's something that can simulate not the universe, but it can do calculations that complement human abilities in a really potentially beneficial way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 899.981,
    "end": 900.502,
    "text": "That's different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 901.062,
    "end": 908.486,
    "text": "It's on a continuum with other extended cognitive elements like books and communications, telecommunications, media, and things like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 908.886,
    "end": 913.95,
    "text": " But we're in a computational and a conceptual phase that's totally novel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 914.45,
    "end": 922.416,
    "text": "And so we need to consider classical critiques like it can't be done, it won't be done amidst the truly ongoing changes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 923.116,
    "end": 924.758,
    "text": "That's right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 924.918,
    "end": 928.02,
    "text": "Exponentially expanding critiques.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 928.66,
    "end": 930.201,
    "text": " capacities for computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 930.902,
    "end": 932.883,
    "text": "But your point is very well taken.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 933.544,
    "end": 938.307,
    "text": "Again, I do not mean that we're going to have computers deciding our every action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 938.327,
    "end": 939.568,
    "text": "That's not at all what I'm talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 940.028,
    "end": 951.777,
    "text": "I'm talking about becoming more human and using the tools that we have available to extend our computation and help us to understand better the complexities of the world around us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 953.308,
    "end": 966.693,
    "text": " Right, so this is humans taking advantage of all the tools they have to become more themselves and better and wiser and better decision-making, better decision-makers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 968.273,
    "end": 975.196,
    "text": "Okay, so that's what we're gonna cover today, this first part, and then we'll move on to part two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 975.216,
    "end": 977.156,
    "text": "All right, next slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 977.897,
    "end": 978.397,
    "text": "All right, four.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 980.658,
    "end": 982.879,
    "text": " So this is a slide on active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 982.939,
    "end": 989.061,
    "text": "And I just want to, again, for those who maybe are not too familiar with the concept, I want to give a kind of a brief overview.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 990.501,
    "end": 990.822,
    "text": "Excellent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 991.562,
    "end": 999.424,
    "text": "Carl Friston, obviously, is one of the main forces behind this concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 999.444,
    "end": 1001.725,
    "text": "He's been working on it for well over a decade now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1004.753,
    "end": 1009.516,
    "text": " There's a little image there on the left of the slide that I'll just say a few words about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1009.997,
    "end": 1024.906,
    "text": "So we can talk about two components to the universe, the universe at large, and then some individual that is, in some sense, separate from the universe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1026.367,
    "end": 1026.527,
    "text": "Right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1031.544,
    "end": 1055.694,
    "text": " is something that is that can be demarcated from the rest of its background so for the moment we'll say there's we're going to draw a circle around the individual and then the rest of the world is going to be outside that circle so the rest of the universe has hidden states it has a you could say it has kind of a gym in a sense a generative model of how it works how it functions when it is when it has",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1059.306,
    "end": 1061.447,
    "text": " is acted upon by an individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1061.587,
    "end": 1062.788,
    "text": "It responds in some way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1062.808,
    "end": 1065.19,
    "text": "In a sense, it has a model to do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1066.51,
    "end": 1072.134,
    "text": "And the individual has a model of what the individual, how it understands the larger picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1072.634,
    "end": 1075.576,
    "text": "Now, obviously, the universe is bigger than a human mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1075.656,
    "end": 1081.819,
    "text": "So there is no way that a human mind is ever going to understand every little detail about the universe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1081.879,
    "end": 1082.98,
    "text": "That's impossible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1083.886,
    "end": 1098.336,
    "text": " So a human then, or really any individual, is faced with this problem of trying to act in a universe that is far more complex, far more complicated, and dangerous at times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1099.357,
    "end": 1103.14,
    "text": "So how do you act under uncertainty?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1103.42,
    "end": 1105.741,
    "text": "That's the problem of humans and other organisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1105.902,
    "end": 1108.143,
    "text": "How do you make good decisions under uncertainty?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1108.503,
    "end": 1110.525,
    "text": "And that's certainly the problem for society too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1115.498,
    "end": 1125.144,
    "text": " So, uh, a, uh, when we talk about separating the individual from the rest of the universe, we're talking statistically, we're talking about independence from the rest of the universe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1125.944,
    "end": 1131.308,
    "text": "And in this line of thinking, uh, that independence is granted by what's called a Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1132.668,
    "end": 1138.472,
    "text": "So the individual knows its own beliefs or it has its own beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1139.25,
    "end": 1144.957,
    "text": " And it can choose actions and it can receive sensations from the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1145.297,
    "end": 1150.383,
    "text": "So it can act and it can observe the result of its actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1151.307,
    "end": 1172.311,
    "text": " and then the universe on the other half universe is impacted by actions and then changes in some way has some dynamics and then that leads to sensations for the individual and then the individual receives those sensations so we have kind of a circular pattern going on here where the uh the individual acts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1175.148,
    "end": 1180.331,
    "text": " say it this way, the individual receives sensations after some action, receives sensations from the universe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1181.031,
    "end": 1183.112,
    "text": "And then it can do really one of two things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1183.212,
    "end": 1188.254,
    "text": "It can alter its beliefs about the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1188.415,
    "end": 1192.457,
    "text": "Maybe the sensations tell the individual that it was wrong in some way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1192.517,
    "end": 1198.64,
    "text": "So maybe one option then is for the individual to update its beliefs about the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1198.82,
    "end": 1200.22,
    "text": "That's new here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1201.181,
    "end": 1203.262,
    "text": "Or it can take some kind of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1203.922,
    "end": 1210.506,
    "text": " to better fit its experience to how it understands the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1210.566,
    "end": 1218.51,
    "text": "So if I'm cold, if my sensation is being cold, my action might be to put on a coat so that I don't freeze to death.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1220.291,
    "end": 1230.617,
    "text": "I can bring the world, try to align the world with what I expect the world to, what I expect of myself, what I expect of my own condition, and how I expect the world to act.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1231.3,
    "end": 1235.244,
    "text": " So that's kind of the two options we have available.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1235.324,
    "end": 1239.507,
    "text": "We can update our understanding and beliefs about the world, and we can choose actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1240.568,
    "end": 1243.551,
    "text": "So that's really the gist of what that picture is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1244.111,
    "end": 1255.621,
    "text": "And then over on the right-hand side, I have a few equations that sort of puts that into kind of a formulative way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1256.062,
    "end": 1257.363,
    "text": "So the first one that was just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1261.147,
    "end": 1274.395,
    "text": " But the concept is that because I'm an individual and because I don't, I can't actually know what the generative process of the universe is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1274.955,
    "end": 1279.978,
    "text": "I can only know my sensations and my actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1279.998,
    "end": 1285.482,
    "text": "I would like to reduce the surprise that appears.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1286.122,
    "end": 1290.445,
    "text": "Like I don't, you know, it's surprising to me if I'm cold and sick and hungry and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1291.999,
    "end": 1294.12,
    "text": " I don't want those kinds of surprises.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1294.3,
    "end": 1298.222,
    "text": "I want some certainty about me existing into the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1300.163,
    "end": 1303.725,
    "text": "But the trouble is, I don't know what the world's model is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1304.065,
    "end": 1308.127,
    "text": "So I have to essentially create my own version of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1308.688,
    "end": 1312.81,
    "text": "That's the density Q in this model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1314.071,
    "end": 1318.273,
    "text": "I'm going to create my best guess as to how the universe works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1319.299,
    "end": 1324.72,
    "text": " And the universe has the density P in this equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1326.34,
    "end": 1332.422,
    "text": "And I'm going to do something actually that is not really common in data science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1332.462,
    "end": 1338.023,
    "text": "So if any data scientists are listening, you ought to be probably very familiar with these concepts already.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1338.483,
    "end": 1340.923,
    "text": "This is a variational inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1341.223,
    "end": 1344.044,
    "text": "So it's a technique widely used in data science to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1344.622,
    "end": 1354.844,
    "text": " solve problems and that's the central idea is you have some complicated density P and you don't really know how to deal with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1355.104,
    "end": 1363.626,
    "text": "So you instead choose a much simpler density Q that is better behaved and then you work with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1363.747,
    "end": 1369.868,
    "text": "And the whole idea is if you bring Q closer and closer to P,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1370.814,
    "end": 1376.937,
    "text": " then you'll be closer and closer to actually having a model, a real model of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1377.638,
    "end": 1393.206,
    "text": "So just in that term for the elbow, the evidence lower bound, it's called in data science, there's a KL term, a KL divergence term, and that just simply means that term will go to zero as P and Q come closer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1394.987,
    "end": 1397.108,
    "text": "And the other term there, log P,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1399.353,
    "end": 1404.136,
    "text": " Uh, that is really, uh, just, uh, the negative of that is called surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1404.896,
    "end": 1426.188,
    "text": "So, uh, um, you, the agent, uh, would like to reduce the surprise that it, it, uh, uh, recognizes experiences and, uh, and doing, and one way to do that is to, uh, is to also bring the,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1426.704,
    "end": 1428.325,
    "text": " the densities P and Q closer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1428.405,
    "end": 1441.53,
    "text": "So you get a good model of the universe and you act in a way that is consistent with your understanding of the universe and you update your beliefs as necessary to have a better model of the universe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1442.07,
    "end": 1451.813,
    "text": "And if you do all of that, your surprise about how the universe acts and your surprise about maintaining yourself into the future will be reduced.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1453.8,
    "end": 1477.251,
    "text": " So that functional is called a free energy functional, and the whole concept in active inference is to use this action updating, observing from the universe what the sensations are, and then going in a circle and updating an action, and updating an action, updating an action observation, updating an action observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1481.754,
    "end": 1484.495,
    "text": " The idea is to reduce dysfunctional free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1485.756,
    "end": 1494.04,
    "text": "And that, Friston would say, claims that this is what all organisms are doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1494.06,
    "end": 1495.101,
    "text": "This is what life is doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1495.121,
    "end": 1502.064,
    "text": "And if this doing so leads to really all the structural diversity that we",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1504.105,
    "end": 1533.04,
    "text": " in our universe the ecologies and ecosystems and organisms and cooperating cells within a human body and all of that is has become what it has become through a process through this free energy minimization process so in a sense if we wanted to somehow talk rigorously about wisdom",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1534.033,
    "end": 1546.358,
    "text": " It would be in some sense, at least from this perspective, it would be wise actions and learning activities and explorations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1547.438,
    "end": 1554.581,
    "text": "Wisdom is the kind of equivalent to reducing expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1554.601,
    "end": 1558.282,
    "text": "I just want to make just a few other notes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1564.143,
    "end": 1569.368,
    "text": " So what we really want to do is reduce expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1570.068,
    "end": 1582.499,
    "text": "Like what will happen, you know, a tiger is running at me, I could run, I could fight, I could jump on a car, I could jump in a car, I could do all these things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1582.599,
    "end": 1586.823,
    "text": "I have these options, paths, these paths I could take, these decisions I could take.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1587.884,
    "end": 1591.287,
    "text": "Which of them is going to be best for me in the long run?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1592.478,
    "end": 1593.139,
    "text": " Or in the short run.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1593.86,
    "end": 1601.388,
    "text": "And so that requires expectations of free energy over possible decisions in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1601.829,
    "end": 1603.411,
    "text": "And that becomes quite complicated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1603.431,
    "end": 1609.758,
    "text": "None of that is really in this slide, but I do want to realize that that's there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1611.482,
    "end": 1619.065,
    "text": " John, I wanna lock in two really key points that you touched on here and then ask a question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1619.666,
    "end": 1625.088,
    "text": "So the first thing you said on this slide is active inference is about the reduction of uncertainty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1625.708,
    "end": 1639.895,
    "text": "So that's in direct contrast with the human as an economic maximizer or an optimizer of the reward, or that we're trying to do some sort of optimization, maximization on an outcome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1640.695,
    "end": 1644.756,
    "text": " It's a process based reduction of uncertainty that Active Inference highlights.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1645.256,
    "end": 1648.357,
    "text": "And so, of course, you're highlighting the outcomes that we want to see.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1648.397,
    "end": 1651.778,
    "text": "Those are our values, our preferences and our predictions, we hope.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1652.218,
    "end": 1661.281,
    "text": "But we're going about it with a process based and uncertainty reduction based lens rather than simply like numbers going to go up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1661.641,
    "end": 1662.401,
    "text": "We got to get there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1662.721,
    "end": 1664.042,
    "text": "So that's the richness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1664.722,
    "end": 1671.226,
    "text": " of just, if nothing else, all the critiques of active environments aside, to focus on the process and the reduction of uncertainty is really powerful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1671.626,
    "end": 1677.389,
    "text": "And the second lock-in is you immediately went from the reduction of uncertainty to collective behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1677.849,
    "end": 1682.412,
    "text": "And it's like, there's things that the brain knows that a neuron doesn't, like how to speak English.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1683.072,
    "end": 1686.734,
    "text": " And there's things the colony knows and does that the ant nest mate doesn't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1687.315,
    "end": 1695.941,
    "text": "So part of this is about realizing, well, there's things surely society knows with all of our diversity and all of our different skills that an individual doesn't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1696.761,
    "end": 1703.145,
    "text": "So what does it look like to take that seriously that the cognitive systems are not just nested internally?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1703.245,
    "end": 1707.889,
    "text": "Like, well, the brain, the brain region, the neural circuit, the neuron, the organelle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1708.149,
    "end": 1712.892,
    "text": "Yeah, you can go down, but you can go out and it's not just a cope.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1713.672,
    "end": 1716.413,
    "text": " And so what that looks like is a really important point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1716.473,
    "end": 1724.536,
    "text": "So the two things there, reduction of uncertainty with active inference and multi-scale cognitive systems, and it's really important points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1726.276,
    "end": 1727.337,
    "text": "Good, or can I ask the question?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1728.137,
    "end": 1729.297,
    "text": "No, excellent, excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1729.357,
    "end": 1729.878,
    "text": "Yeah, go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1730.038,
    "end": 1734.979,
    "text": "I'm just trying to catch up because you say a lot of awesome points in each of these breakdowns.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1735.019,
    "end": 1735.84,
    "text": "And the question is really...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1736.94,
    "end": 1744.083,
    "text": " What kinds, this is on the Jamboard, what kinds of social processes or data are promising for active inference modeling?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1744.463,
    "end": 1754.407,
    "text": "Let's just say now, maybe in the future we'll license other deployments, but right now, like what kind of data would you be curious to collect or find out about?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1754.727,
    "end": 1761.43,
    "text": "We may talk about it later in the economic or social context, but what kind of data types are we thinking about making active inference models of?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1763.129,
    "end": 1786.766,
    "text": " yeah okay so to answer that question I'm going to ask that question in about two more slides so I'm going to ask that very question to you and to the viewers out there but I can give you just one example okay we can come back to it but go for an example yeah I'll give one example because I also want to emphasize something else that you also",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1793.038,
    "end": 1819.496,
    "text": " that if we're talking about expected uncertainty that implies that we are anticipatory so I just want to underline that every organism is anticipatory every organism is doing this reducing free energy and you know from this view and that requires anticipation of what the future will be and so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1823.003,
    "end": 1835.209,
    "text": " So anticipation, or you might call it forecasting, forecasting is central to our well-being, our continued existence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1836.05,
    "end": 1843.114,
    "text": "I'm forecasting that if I see a tiger coming towards me, that I'm going to be its lunch if I don't do something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1843.354,
    "end": 1849.777,
    "text": "So if we don't think clearly about what's going to happen next,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1850.468,
    "end": 1853.785,
    "text": " then cognition is there is no hardly any cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1856.01,
    "end": 1884.867,
    "text": " yeah just one one short comment on that is anticipation and anticipatory systems has been discussed in many other contexts like cybernetics and active inference helps us walk from this very simple beginning you said okay there's an inside and outside if you don't have that you know need to think a little bit more clearly about the system or something like that but we can start with the simplest and then we can build it out to the sophisticated affective inference with the affective charge and all these other modern models",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1885.447,
    "end": 1892.77,
    "text": " But we're starting with this loop, which is why we always come back to these kinds of figures and why it's really important that you're making it at this level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1894.41,
    "end": 1894.63,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1895.171,
    "end": 1895.371,
    "text": "Good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1896.491,
    "end": 1913.177,
    "text": "So just so we can ask the question, all right, if the situation is, you know, tell me, like, what kinds of things would us want to be good at forecasting?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1915.56,
    "end": 1927.53,
    "text": " Actually, I'll ask this question in a few slides so we don't have to go too far into it now, but let's just take, say, governance or leaders, political leaders.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1927.73,
    "end": 1934.336,
    "text": "If a political leader is good at understanding what's coming next, what the future is going to be, then great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1934.376,
    "end": 1937.158,
    "text": "Then the political leader can say, hey, we better do something because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1937.904,
    "end": 1965.511,
    "text": " if we don't this thing is going to happen right but as a society today do we actually remember those predictions do we in any way like you know score accuracy of people's predictions or the predictions of science or the predictions of organizations is there like how does society today remember remember that predictions have been made and now the future is has",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1966.676,
    "end": 1983.045,
    "text": " evolved and come about and how, who was good at, who was good at anticipating the future, who, who excels, uh, uh, what, what, what, what organization or political group or whatever, who who's been really good at understanding what's going to come next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1983.185,
    "end": 1983.385,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1984.166,
    "end": 1995.412,
    "text": "So that's just, I'll just leave that open question because it gets the mind working out that you can think of all kinds of ways that we don't do a good job of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1996.262,
    "end": 1998.512,
    "text": " of remembering and anticipating today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1999.378,
    "end": 2027.176,
    "text": " just to ask a question from the chat um someone wrote does john use active inference mathematical framework in his work for merely descriptive purposes so potentially as opposed to generative or like real-time decision making so where does where are you right now or where do you want to be with uh respect to using active inference to describe simulate make decision support etc right right yeah a good question so uh and maybe maybe the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2032.722,
    "end": 2035.785,
    "text": " So the series has just been published.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2036.425,
    "end": 2046.233,
    "text": "The series proposes a R&D program that society could undertake.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2047.294,
    "end": 2049.396,
    "text": "And it is conceptual at the moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2049.856,
    "end": 2051.498,
    "text": "The whole program is conceptual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2051.518,
    "end": 2052.438,
    "text": "It's not been funded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2052.518,
    "end": 2054.16,
    "text": "I mean, you're",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2054.815,
    "end": 2056.176,
    "text": " In a sense, you're looking at it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2056.276,
    "end": 2056.896,
    "text": "This is it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2057.116,
    "end": 2062.679,
    "text": "It's the three papers and our conversation and whatever other people have to add to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2064.259,
    "end": 2065.14,
    "text": "This is where we're at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2065.44,
    "end": 2079.106,
    "text": "We're obviously focusing or I'm focusing now on the big picture conceptual ideas because that has to happen before you actually get into the nuts and bolts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2079.806,
    "end": 2080.847,
    "text": "How do we use this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2084.121,
    "end": 2109.707,
    "text": " But I would guess and I would expect that if this project moves forward, then at some point we'll be talking about the numerous ways that society uses information and how it remembers and how it anticipates and what models might be used for different kinds of anticipation and, you know, how do the nuts and bolts of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2115.39,
    "end": 2118.772,
    "text": " And I hope we get a chance to go there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2118.792,
    "end": 2119.713,
    "text": "That would be fantastic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2120.813,
    "end": 2123.115,
    "text": "We'll lay it out as likely, and then we'll make it happen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2123.195,
    "end": 2123.535,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2123.555,
    "end": 2125.096,
    "text": "There we go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2127.618,
    "end": 2127.898,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2127.998,
    "end": 2129.419,
    "text": "So that's that slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2129.439,
    "end": 2130.319,
    "text": "Let's go on to the next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2130.8,
    "end": 2131.2,
    "text": "Sounds good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2131.24,
    "end": 2131.48,
    "text": "Five.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2132.941,
    "end": 2133.581,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2133.682,
    "end": 2136.924,
    "text": "And maybe two before we move off the last slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2137.544,
    "end": 2143.808,
    "text": "I do want to say that Active Inference has this wonderful part of it that I'm very attracted to,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2144.511,
    "end": 2167.058,
    "text": " And that is that it provides a way for an organism acting in its environment to play it by ear, to learn as it goes, to have a process of learning and a goal for learning and action that can evolve over time, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2167.398,
    "end": 2171.999,
    "text": "So if we were going to program an active inference robot, we would not be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2175.809,
    "end": 2177.069,
    "text": " do that, five points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2177.489,
    "end": 2183.071,
    "text": "Now, find a way to act in the world where you maximize the number of points you can get.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2183.591,
    "end": 2184.451,
    "text": "It's not really like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2184.591,
    "end": 2195.833,
    "text": "And the world is, in a real setting, the world is far too complex for someone to pre-program how many points you get for certain activities or reaching certain goals, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2195.913,
    "end": 2202.915,
    "text": "So an intelligent agent has to be able to alter its understanding of the world",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2203.459,
    "end": 2205.581,
    "text": " and its goals at the same time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2205.601,
    "end": 2207.262,
    "text": "And we'll talk about this again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2207.302,
    "end": 2217.189,
    "text": "But to balance exploitation of what it knows already, to use what it knows about the current situation, and exploration, jumping into new",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2218.286,
    "end": 2223.908,
    "text": " new unknowns, considering new proposals, considering new rearrangements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2223.928,
    "end": 2242.173,
    "text": "So active inference and really the structural development and evolution of all of life and ecosystems and cells and communications between organisms and all of that is kind of built on this balance between exploitation and exploration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2246.121,
    "end": 2273.48,
    "text": " um you could even think of that in terms of like in modern day society to a degree you could even think of it in terms of liberal political versus conservative political in their best sense that is you know conservative political might be more more interested in relying on tradition and exploiting the current knowledge and perhaps a liberal might be more interested in exploring new ideas and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2274.019,
    "end": 2283.868,
    "text": " and taking leaps into the unknown to learn something new and do something better, to improve a process, to change a process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2285.249,
    "end": 2296.64,
    "text": "So decision making is very much a balance between those two exploitation, exploration, and active inference provides a mechanism by which that can occur quite naturally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2297.685,
    "end": 2323.267,
    "text": " and i won't even go into detail to say that an action model and reducing uncertainty on that helps you act in unknown unknowns i think it's something exactly unknown unknowns that's correct yeah of which there are plenty all right now slide five uh uh this is i guess this is following up on active inference just a bit um and i think we've talked on most of these things uh the um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2325.83,
    "end": 2326.93,
    "text": " Yeah, I think we have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2327.29,
    "end": 2328.731,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2328.831,
    "end": 2331.272,
    "text": "The whole point is to resolve expected uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2332.333,
    "end": 2332.533,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2332.593,
    "end": 2333.093,
    "text": "Okay, good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2333.673,
    "end": 2334.093,
    "text": "Next slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2334.553,
    "end": 2334.814,
    "text": "Six.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2337.955,
    "end": 2338.275,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2338.455,
    "end": 2343.637,
    "text": "I just want to touch just a few ideas on cooperation and communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2346.399,
    "end": 2351.141,
    "text": "Actually, cooperation and communication go hand in hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2351.881,
    "end": 2353.942,
    "text": "They may have even evolved together possibly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2355.379,
    "end": 2363.521,
    "text": " So cooperation really is almost the rule in our world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2364.161,
    "end": 2368.282,
    "text": "Life cooperates in so many ways, so many ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2368.382,
    "end": 2378.825,
    "text": "And the more we study it, the more we realize how deep the cooperation is within a species, between species, between trees and fungus, within ecosystems, between ecosystems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2385.64,
    "end": 2406.593,
    "text": " it's just cooperation is everywhere and as i said last in our last show if you want evidence of it that is if you want mind-blowing evidence of cooperation to just think of your own body the trillion or so cells that are cooperating to for you to be what you are right so um it's a cooperation exists everywhere and it is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2407.913,
    "end": 2409.715,
    "text": " nearly impossible without communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2409.935,
    "end": 2412.877,
    "text": "Like, you cannot cooperate with someone if you don't communicate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2413.237,
    "end": 2417.721,
    "text": "And the richer the communication, at least potentially, the richer the cooperation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2419.783,
    "end": 2423.866,
    "text": "And obviously, by cooperation, I mean, by communication, I mean honest communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2426.568,
    "end": 2429.25,
    "text": "Dishonest communication is hardly communication, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2429.451,
    "end": 2429.991,
    "text": "So we're talking",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2438.164,
    "end": 2448.067,
    "text": " Um, so it's interesting though, that, you know, like to take your body, for example, you have all these trillion cells and they don't have to cooperate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2448.307,
    "end": 2457.489,
    "text": "I mean, there's, you know, they can not cooperate and sometimes they don't cooperate with each other and they can act independently to some degree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2457.629,
    "end": 2457.87,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2458.45,
    "end": 2466.512,
    "text": "So there's always throughout the universe, there's this tension between, uh, what cooperation provides",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2468.029,
    "end": 2492.976,
    "text": " and what the individual you know what the individual might want to how it might want to behave if it were just left to its own to its own right so why would anything cooperate and and the kind of the big picture answered that question is because it reduces expected uncertainty it's again it reduces free energy so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2493.752,
    "end": 2499.016,
    "text": " by cooperation, an organism can assure itself of survival.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2499.116,
    "end": 2501.298,
    "text": "It can make its survival easier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2501.438,
    "end": 2503.099,
    "text": "It can make communication easier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2503.279,
    "end": 2507.142,
    "text": "It can, you know, have all these benefits, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2508.443,
    "end": 2518.751,
    "text": "So nevertheless, every given moment is this, there's this tenuous balance between, you know, do I continue to cooperate in this sphere or not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2518.771,
    "end": 2520.072,
    "text": "And who is, and at what,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2524.875,
    "end": 2526.536,
    "text": " to what extent do I cooperate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2526.556,
    "end": 2537.501,
    "text": "Do I cooperate within my family and or in my community and or in my society and or between societies?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2537.581,
    "end": 2541.242,
    "text": "At what level am I interested in cooperating?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2542.183,
    "end": 2542.383,
    "text": "And the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2543.373,
    "end": 2569.931,
    "text": " know the answer the general answer that question is i am interested in cooperating at every level in which uncertain my uncertainty is reduced my my vitality is ensured my uncertainty is reduced right so across the layers across scales but we do see this examples of when cooperation fails and one example that i like to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2576.215,
    "end": 2586.281,
    "text": " transform cells start to not cooperate with their milieu, with their tissues, with their environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2587.922,
    "end": 2598.468,
    "text": "So my question for listeners is, so we have an idea of what cooperation means, and then what is the opposite of cooperation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2600.769,
    "end": 2601.89,
    "text": "Like you might think,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2602.699,
    "end": 2602.919,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2602.939,
    "end": 2605.641,
    "text": "Well, the opposite of cooperation is selfishness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2606.502,
    "end": 2616.749,
    "text": "And I would, I would suggest, you know, maybe in certain circumstances that seems pretty clear, but in a more general sense, maybe that's not the opposite of cooperation, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2618.29,
    "end": 2630.399,
    "text": "Maybe, maybe there's almost always cooperation and what changes is the extent of self of the agent or, you know, the organism that's that, that has taken the action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2631.219,
    "end": 2631.76,
    "text": "For example,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2633.035,
    "end": 2637.438,
    "text": " Cancer cells cooperate with, you know, they cooperate with each other at least.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2639.54,
    "end": 2646.365,
    "text": "So, um, and they, and they might cooperate within their, you know, within their very small tumor milieu.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2647.486,
    "end": 2650.188,
    "text": "There's a lot of communication that happens between cancer cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2650.288,
    "end": 2654.531,
    "text": "Once a cancer forms, there's tremendous communication that goes on between cancer cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2656.072,
    "end": 2662.277,
    "text": "So maybe it's not, maybe it's not so useful for us to think of cooperation versus selfishness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2663.399,
    "end": 2670.262,
    "text": " but rather cooperation as a scale, scales of cooperation in extent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2670.802,
    "end": 2683.307,
    "text": "Like, am I cooperating with my immediate family, or am I cooperating with societies that are far-flung and halfway across the world, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2683.487,
    "end": 2686.108,
    "text": "To the degree that we understand ourself",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2686.687,
    "end": 2690.05,
    "text": " to be extended, we are cooperating with ourself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2690.591,
    "end": 2692.633,
    "text": "I mean, you have to understand that, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2693.233,
    "end": 2704.564,
    "text": "If I understand that I am part of this environment, this ecology, then any actions I take to benefit the ecology are actions that I take to benefit myself, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2704.664,
    "end": 2709.108,
    "text": "So if my sense of self is extended out to the world,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2709.755,
    "end": 2712.376,
    "text": " to the, or to the degree that it's extended up to the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2712.956,
    "end": 2721.498,
    "text": "I am interested in cooperating with myself to better myself, to reduce my overall uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2721.638,
    "end": 2721.818,
    "text": "Right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2722.718,
    "end": 2730.08,
    "text": "So cancer perhaps is, it's not really a matter of being selfish, perhaps like I can't, you know, people say cancers are really selfish.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2730.1,
    "end": 2736.521,
    "text": "They're just gonna, they're just gonna, um, um, you know, only pay attention to what's good for them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2737.54,
    "end": 2738.98,
    "text": " Yeah, but they're cooperating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2739.0,
    "end": 2740.401,
    "text": "They're cooperating with a smaller group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2740.701,
    "end": 2748.163,
    "text": "And because they're cooperating with a smaller group and because their extent of self is reduced, their capacity for cognition is reduced.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2748.923,
    "end": 2765.787,
    "text": "And, you know, we're talking, we're just kind of anthropomorphic here, but, you know, they would have, a small tumor would have a more difficult time understanding the long-term effects, their long-term effects, because their cognitive apparatus",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2766.385,
    "end": 2783.033,
    "text": " is to a small set of cells versus the human body, which has the full cooperation of the brain and the feet and the hands and the understanding and the capacity to use your mouth to ask others what's going to happen next, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2783.073,
    "end": 2794.059,
    "text": "So the more you extend into the world and are cooperating with the world, the larger your cognitive capacity, the larger your problem-solving capacity, and the better you will be at",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2795.017,
    "end": 2806.74,
    "text": " understanding in the long term, you know, the outcomes of your actions and how that's going to affect your own, you know, how it's going to affect you as an individual and you as an extended self.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2807.62,
    "end": 2808.26,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2808.68,
    "end": 2822.423,
    "text": "So I got a little off there, but you know, I'm just saying cooperation is everywhere and it's all about communication and shared computational capacity and shared decision-making the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2822.961,
    "end": 2823.922,
    "text": " potential for more",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2828.888,
    "end": 2830.99,
    "text": " cognitive capacity and better decision-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2831.65,
    "end": 2831.871,
    "text": "Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2832.631,
    "end": 2842.6,
    "text": "The only point I'd make here as a ant researcher and have thought about conflict and cooperation across scales is that it's really a story we're telling about a certain outcome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2843.0,
    "end": 2847.524,
    "text": "Like when the white blood cell eats a cancer cell, is that altruism at the higher level?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2847.625,
    "end": 2849.006,
    "text": "Is it a conflict at the lower level?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2849.446,
    "end": 2855.091,
    "text": "So it's a scale dependent and it's often a perspectival narrative that we're telling about what cooperation is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2856.352,
    "end": 2858.653,
    "text": " And it's just like yin and yang.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2858.974,
    "end": 2862.215,
    "text": "There's a compliment between what we call cooperation and communication.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2862.335,
    "end": 2864.056,
    "text": "They're like the good guy and the bad guy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2864.116,
    "end": 2868.999,
    "text": "They come into existence when we have fitness and free energy to dissipate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2869.439,
    "end": 2872.341,
    "text": "So we need a story that allows us to act",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2873.081,
    "end": 2897.297,
    "text": " in that gray zone instead of um getting fatalistic about competition or getting utopian about cooperation because this is not going to be necessarily a smooth and lovey-dovey ride with cooperation nor is it in the body so it's like a very nice nuanced way and that's why we fall back to active inference rather than an ism or a specific metaphor of choice like the selfish gene",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2898.311,
    "end": 2898.951,
    "text": " Right, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2899.211,
    "end": 2899.532,
    "text": "Excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2899.832,
    "end": 2899.992,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2900.292,
    "end": 2919.962,
    "text": "And just to just to underline that this project is not about asking people to behave like super altruistically or something like that, or to cooperate, you know, beyond what would be natural, that that would never work, it would fail, it would fail, because that's not what that's not how it works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2920.162,
    "end": 2921.403,
    "text": "That's not how what life is doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2921.423,
    "end": 2922.583,
    "text": "That's not how life is working.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2923.124,
    "end": 2925.805,
    "text": "So you know, we just really just need to be be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2926.46,
    "end": 2940.772,
    "text": " set up our systems, set up our processes, set up our societal decision making, you know, ways we go about making decisions, and just align ourselves with what we actually are and what life is actually doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2940.852,
    "end": 2945.716,
    "text": "And that means that there is a continual conflict between cooperation and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2946.98,
    "end": 2952.923,
    "text": " you know, not cooperation, between kind of an individualism and a more cooperative stance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2952.983,
    "end": 2966.488,
    "text": "That's just like there's an ongoing conflict between exploitation and exploration, between, you know, conservative and liberal, between old information, the value of old information and the value of new information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2966.548,
    "end": 2971.37,
    "text": "This is a, all of this is a dance, it's a dynamic dance, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2972.19,
    "end": 2973.851,
    "text": "So, but there is a sweet",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2976.558,
    "end": 3001.459,
    "text": " place to hover a sphere to hover in where you're balancing old and new exploitation exploration conservative liberal you're balancing them and because you're on that in that sweet spot in that critical area you're able to do about the best that any organism could do",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3004.184,
    "end": 3008.507,
    "text": " and the magnificence of life is the proof of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3010.749,
    "end": 3011.049,
    "text": "Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3012.891,
    "end": 3014.872,
    "text": "Through seven, speaking of life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3016.434,
    "end": 3016.654,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3017.134,
    "end": 3029.404,
    "text": "So in our last talk, I had mentioned that complexity is, you can think of it, at least in a certain way, you can think of it as problem-solving capacity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3030.293,
    "end": 3038.937,
    "text": " Organisms complexify, environments complexify, ecologies complexify in order to solve ever more difficult, challenging problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3040.257,
    "end": 3050.622,
    "text": "So it is not true that complexity is just a path to chaos and failure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3051.622,
    "end": 3052.543,
    "text": "Systems do fail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3052.563,
    "end": 3054.143,
    "text": "I mean, obviously that does happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3054.303,
    "end": 3055.804,
    "text": "There's complex systems that can fail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3063.76,
    "end": 3065.781,
    "text": " So humans are complex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3065.881,
    "end": 3068.702,
    "text": "Of all the organisms on the planet, we're pretty complex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3068.823,
    "end": 3072.104,
    "text": "We have complex brains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3072.164,
    "end": 3075.226,
    "text": "We have complex cognitive processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3075.306,
    "end": 3082.469,
    "text": "We think about what might happen in 1,000 years, and we're concerned about what might happen in 1,000 years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3083.009,
    "end": 3088.892,
    "text": "That's enormously complex, say, compared to a bacteria that doesn't have a central nervous system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3090.653,
    "end": 3092.434,
    "text": "So because we're complex,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3095.247,
    "end": 3098.968,
    "text": " organisms in general, that the more complex an organism is, the more complex its needs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3101.369,
    "end": 3107.771,
    "text": "The more feelers it has out in the universe, the more extended it is into the universe in a sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3108.592,
    "end": 3110.532,
    "text": "And that is certainly true for humans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3110.632,
    "end": 3114.874,
    "text": "And this table has some needs according to Maslow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3114.974,
    "end": 3121.276,
    "text": "And I just want to mention these as an example, not that these are the needs we should focus on, but just as an example of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3122.561,
    "end": 3125.644,
    "text": " I think he has maybe nine or eight or nine of there, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3126.344,
    "end": 3132.55,
    "text": "But affection, we want to be loved and we want to love both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3133.831,
    "end": 3135.373,
    "text": "We want to share friendships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3135.453,
    "end": 3137.154,
    "text": "It makes us happy to do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3137.274,
    "end": 3138.636,
    "text": "We want to be creative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3138.656,
    "end": 3140.477,
    "text": "We want to create things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3140.497,
    "end": 3141.919,
    "text": "We want to build skills.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3141.999,
    "end": 3144.241,
    "text": "We want to have freedom to associate things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3144.697,
    "end": 3171.09,
    "text": " with whom we want to associate and freedom to move about and look around and poke around and look under things we we you know we want to participate we want to cooperate we we want to understand we want to learn learning is fun you know hopefully learning is fun we we want the rest when we're tired we want to get some exercise we want to move about you know we need to relax sometimes like all these things",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3172.094,
    "end": 3183.74,
    "text": " uh, this is, these are, if we can call these core human needs, these speak to something that I've, I think briefly mentioned the last, uh, talk, which, which is called essential variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3184.421,
    "end": 3194.766,
    "text": "So if an organism is, if its purpose, intrinsic purpose is to maintain vitality into the future, well, you know, what, what are those variables?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3195.504,
    "end": 3223.805,
    "text": " that are important in maintaining vitality you know like you can think you can think of a few important things right off the top of the bat like fresh water to drink you know clean air to breathe the food to shelter you know like you could start to think of what some of these essential variables might be but i would like to suggest that some of these core human needs somehow fit into the concept of essential variables humans need to be humans need affection you we will be sick",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3224.358,
    "end": 3226.82,
    "text": " if we don't have affection, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3226.94,
    "end": 3228.802,
    "text": "We will be sick if we don't have freedom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3229.322,
    "end": 3230.343,
    "text": "We will be ill.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3232.004,
    "end": 3242.993,
    "text": "And we won't be able to, and we won't be able to solve, we won't be able to be good problem solvers in our environment if we're hampered by lack of meeting essential variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3243.594,
    "end": 3245.615,
    "text": "We'll be worse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3250.559,
    "end": 3253.962,
    "text": "So the point of all that is when we think about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3256.232,
    "end": 3276.288,
    "text": " a complex organism like a human, we can think about complex needs and then we can think about, okay, so now it's starting to become clear when we're reducing uncertainty, we're reducing uncertainty about these essential variables, which might touch on things like the eight or so, nine core needs that I'm listing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3276.849,
    "end": 3281.833,
    "text": "So I want to, for example, I want to have, I don't want to be uncertain that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3282.993,
    "end": 3288.414,
    "text": " I will be loved in the future or that I'll have food to eat or that I'll be able to move about freely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3288.514,
    "end": 3292.235,
    "text": "I would like to be fairly certain that I'm going to have those freedoms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3292.255,
    "end": 3293.696,
    "text": "I'm going to have these needs met.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3295.676,
    "end": 3301.077,
    "text": "Again, then we're not talking about some big computational calculator thing for this project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3301.337,
    "end": 3303.138,
    "text": "This is about heart and soul.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3303.922,
    "end": 3308.706,
    "text": " being a human, even more human than society allows us to be today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3308.866,
    "end": 3311.188,
    "text": "Like, you know, society is not set up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3311.488,
    "end": 3319.854,
    "text": "Our society is not set up to focus on providing for these complex human needs, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3320.294,
    "end": 3321.255,
    "text": "I mean, we have poverty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3321.275,
    "end": 3324.498,
    "text": "We have billions of people in poverty in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3325.318,
    "end": 3332.244,
    "text": "And that's already, like, all kinds of needs are not met because someone doesn't have the, you know, the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3333.834,
    "end": 3341.616,
    "text": " financial capacity to do what they need to do, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3341.636,
    "end": 3350.938,
    "text": "So we can, there's one last thing on this slide, this little phrase that I like to use is the solving problems that matter, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3351.598,
    "end": 3354.218,
    "text": "So society might solve all kinds of problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3354.278,
    "end": 3360.72,
    "text": "For example, if I work for a manufacturer that is producing some like, you know, let's say,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3363.504,
    "end": 3374.907,
    "text": " some commercial relatively useless product that people are buying because commercialism is pushed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3378.068,
    "end": 3382.549,
    "text": "Maybe I'm solving the immediate problem of making an income so that I can pay my rent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3382.649,
    "end": 3386.67,
    "text": "But beyond that, am I solving problems that matter?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3387.35,
    "end": 3388.251,
    "text": "I don't have a good example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3388.331,
    "end": 3389.131,
    "text": "Maybe someone else does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3396.255,
    "end": 3411.64,
    "text": " something useless there was a book there was a book there was a book about that a while ago and they had a phrase but i forget exactly what his phrase was well i don't know if it was a family-friendly phrase but i think i know it but yeah i don't think it was i hesitate to say it because it wasn't family friendly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3413.575,
    "end": 3419.859,
    "text": " You know, it's like, you know, whose team, our team, like that kind of a call and response, like which problems, the ones that matter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3420.099,
    "end": 3421.96,
    "text": "I mean, then what does it mean to matter?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3422.08,
    "end": 3424.102,
    "text": "Well, that's our preferences and our affordances.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3424.842,
    "end": 3431.967,
    "text": "And then as far as cases where the work or the problem doesn't matter, there's times where the person might think that the problem matters.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3432.407,
    "end": 3439.972,
    "text": "But when you pull back, it's actually a nonlinear response where even if it does matter, the issue that they're concerned about,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3440.672,
    "end": 3443.755,
    "text": " that their effort may not be the most efficacious.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3444.355,
    "end": 3446.517,
    "text": "And this isn't going to go back to another optimization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3446.557,
    "end": 3461.329,
    "text": "You must be engaged in the most efficacious because we're actually putting space for play and identity and participation, understanding all these attributes that aren't just some simple cybernetic like action selection, but it's really important to keep this as our guiding light.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3461.369,
    "end": 3462.209,
    "text": "It's the problems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3462.349,
    "end": 3465.832,
    "text": "And those are the salient ones, the ones that matter, but we need to be informed by our values.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3466.513,
    "end": 3467.153,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3467.173,
    "end": 3469.075,
    "text": "And obviously we're talking high level here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3469.095,
    "end": 3469.215,
    "text": "We're,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3469.5,
    "end": 3479.522,
    "text": " we're trying to give a context for this whole thing of what could society be and how would we go about measuring fitness and w you know, what is this society supposed to accomplish and for whom?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3480.422,
    "end": 3486.723,
    "text": "And then we have to talk about the, you know, these, these high level concepts because they can be guides for us, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3486.783,
    "end": 3498.906,
    "text": "So the, just the phrase solving problems that matter, it can be a useful guide because it reminds us, Oh yeah, what, what matters and what am I doing with my life and what are we doing in society with our lives?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3499.528,
    "end": 3502.369,
    "text": " Are we doing things, are we solving problems that matter?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3502.389,
    "end": 3507.07,
    "text": "And obviously there's a whole bunch of enormous problems that we're not solving, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3508.49,
    "end": 3510.51,
    "text": "Like climate change and other things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3511.83,
    "end": 3528.774,
    "text": "If society was solving problems that matter, there would be like enormous armies of biologists and other people, ecologists and field workers and all kinds of people focusing on the problems that matter most.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3530.095,
    "end": 3531.496,
    "text": " for happiness and survival.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3531.576,
    "end": 3553.191,
    "text": "And currently in today's world, you know, that is heating up to be climate change and biodiversity loss and, you know, ecological destruction and pollution and groundwater depletion and like all the things that were pushed, you know, all the damage we've done to our world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3554.652,
    "end": 3558.034,
    "text": "Certainly cleaning those problems up ought to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3559.051,
    "end": 3560.352,
    "text": " among the problems that matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3561.713,
    "end": 3563.474,
    "text": "Okay, so there we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3563.494,
    "end": 3566.957,
    "text": "I think one last thing on this slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3567.037,
    "end": 3578.465,
    "text": "So over in the bottom right, I bring the topic of culture in, and I just want to just say a word about culture from an active inference viewpoint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3579.145,
    "end": 3586.851,
    "text": "So, you know, at its best, culture is a remembering of what is important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3588.666,
    "end": 3604.77,
    "text": " to teach not only to teach new people, to teach new young adults as they mature what's important, but also to offload some of the computational burden that individuals would otherwise face.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3604.85,
    "end": 3608.691,
    "text": "So if I have to figure out everything for myself from scratch as an organizer,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3614.088,
    "end": 3629.871,
    "text": " For me, if my peers point me in the right direction, give me some indication of what's dangerous, what's not dangerous, what's important, what's not important, give me some guidance, I can learn so much faster if I have some good guidance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3630.212,
    "end": 3634.773,
    "text": "Also, if I can just rely on culture to like, okay, my culture does this thing,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3637.552,
    "end": 3650.777,
    "text": " And I'm not going to maybe even think about it too deeply because I'm, you know, like if my culture is good, it's maybe reflecting in some capacity this importance of putting attention on those things that matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3651.718,
    "end": 3665.403,
    "text": "So now we've now talked about two important things here, actually, culture and how culture relates to to reduction of uncertainty overall, and then also attention and the role of culture in directing attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3665.871,
    "end": 3668.692,
    "text": " So those are themes that we'll be coming back on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3669.392,
    "end": 3671.112,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3671.212,
    "end": 3676.654,
    "text": "So attention and essential variables, you know, like those go together, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3676.694,
    "end": 3684.696,
    "text": "If we're not paying attention to essential variables, then our whole free energy minimization thing is not functioning correctly, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3684.896,
    "end": 3687.857,
    "text": "Because we have to put attention on those things that are important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3689.458,
    "end": 3689.658,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3690.898,
    "end": 3691.098,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3691.502,
    "end": 3691.742,
    "text": " Next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3692.182,
    "end": 3692.502,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3692.542,
    "end": 3699.305,
    "text": "So now we get to the slide where I get to ask you and any listeners, like, what does this mean practically?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3699.445,
    "end": 3701.305,
    "text": "So we've talked about all these high level concepts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3701.345,
    "end": 3709.308,
    "text": "We've given some context for, you know, for who we are and what we might need and what a societal system is supposed to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3710.309,
    "end": 3714.41,
    "text": "And those were all fairly high level discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3714.49,
    "end": 3720.292,
    "text": "And now maybe it's time just to talk a little bit about what that might actually mean in a practical sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3721.863,
    "end": 3724.644,
    "text": " So the title of the slide is Practical Indications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3724.704,
    "end": 3728.886,
    "text": "But down at the bottom, I have also known as, how do you solve problems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3728.966,
    "end": 3730.367,
    "text": "Because the two are the same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3730.807,
    "end": 3731.647,
    "text": "This is the question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3731.667,
    "end": 3732.248,
    "text": "How do we solve?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3732.388,
    "end": 3734.028,
    "text": "How do we solve problems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3734.649,
    "end": 3740.291,
    "text": "How do we focus on, if we're good at solving problems, how do we do it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3747.183,
    "end": 3760.746,
    "text": " And obviously, if we're going to build new societal systems, we want to build societal systems that help us, that facilitate our problem-solving capacity, facilitate our capacity to reduce uncertainty, expected uncertainty, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3761.246,
    "end": 3769.948,
    "text": "So I'm just going to list some things, and maybe on the first read of this, we can just acknowledge, like, okay, yeah, that's how we solve problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3770.509,
    "end": 3772.329,
    "text": "Number one there, we gather data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3773.709,
    "end": 3776.61,
    "text": "We sense our world, you know, obviously, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3777.742,
    "end": 3782.103,
    "text": " That's how an organism solves a problem and even knows that there's a problem to solve for that matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3782.883,
    "end": 3786.124,
    "text": "And we remember, we remember what we did maybe last week or last year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3786.144,
    "end": 3787.844,
    "text": "We remember how we solved something before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3787.904,
    "end": 3792.365,
    "text": "We remember that this situation is dangerous and we might want to avoid it in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3792.505,
    "end": 3796.066,
    "text": "So we remember, remember, we anticipate or make forecasts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3796.826,
    "end": 3804.067,
    "text": "And we've already talked about the importance of anticipation for cognition in any organism and cooperate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3804.107,
    "end": 3805.688,
    "text": "We cooperate with those around us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3806.388,
    "end": 3806.968,
    "text": "We have a,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3807.568,
    "end": 3808.989,
    "text": " problem to solve and we get some help.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3809.029,
    "end": 3810.93,
    "text": "Maybe we solve it together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3811.03,
    "end": 3812.191,
    "text": "We work together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3812.251,
    "end": 3813.311,
    "text": "We build a house together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3813.371,
    "end": 3816.914,
    "text": "We build a jumbo jet together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3816.954,
    "end": 3818.134,
    "text": "We do all these things together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3818.194,
    "end": 3819.335,
    "text": "We farm together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3819.355,
    "end": 3825.139,
    "text": "So cooperation is one way to solve a problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3825.279,
    "end": 3827.1,
    "text": "And then what does cooperation entail?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3827.12,
    "end": 3832.383,
    "text": "Well, it requires that we maybe as a group, we reward",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3841.989,
    "end": 3855.116,
    "text": " about cooperation and it's pretty, you know, there's some really good ideas, pretty clear ideas, basic ideas of when, how do you actually facilitate cooperation and what makes cooperation go down the toilet, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3855.217,
    "end": 3868.244,
    "text": "So if your communication really helps cooperation, rewarding pro-social behavior, transparency helps cooperation, fairness helps cooperation, like all these, we know all these things, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3868.885,
    "end": 3873.288,
    "text": " from common experiences in life and also from studies in game theory and other fields.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3874.75,
    "end": 3879.934,
    "text": "So solve a problem, we cooperate, we communicate, we direct attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3879.954,
    "end": 3881.095,
    "text": "There's that word attention again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3881.115,
    "end": 3883.236,
    "text": "We direct our attention to those things that matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3885.458,
    "end": 3889.221,
    "text": "We learn from our actions and observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3889.401,
    "end": 3895.186,
    "text": "So we update our models of things when we realize like, oh no, I guess the world doesn't work that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3896.007,
    "end": 3902.969,
    "text": " I should, I should learn something, but the world is a little more, it works differently than I was anticipating or had thought before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3903.99,
    "end": 3906.631,
    "text": "Uh, and then we act to reduce expected uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3906.691,
    "end": 3915.734,
    "text": "We experiment, we, we, we have goal directed activities or actions where we try to, that's the exploitation aspect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3915.794,
    "end": 3920.536,
    "text": "And then we also have the exploration aspect action for epistemic gain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3920.656,
    "end": 3924.417,
    "text": "And again, then we have this exploration versus exploitation trade off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3925.978,
    "end": 3929.24,
    "text": " So I'm just saying what I think everyone already understands.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3929.28,
    "end": 3930.341,
    "text": "I'm just making a list here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3930.761,
    "end": 3933.683,
    "text": "But now the question is, okay, fine, so that's how we solve problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3934.024,
    "end": 3939.767,
    "text": "How do each of these play out in a societal system setting?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3941.268,
    "end": 3954.417,
    "text": "So, you know, I think if we wanted to, we won't because we don't have time, but I think if we wanted to, we could list like 500 ways any of these play out or maybe should play out or could play out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3955.069,
    "end": 3958.79,
    "text": " in a healthy society, a society that's good at solving problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3959.73,
    "end": 3961.15,
    "text": "I had already mentioned one earlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3961.25,
    "end": 3975.833,
    "text": "So let's just say on the topic of anticipation, wouldn't it be reasonable to somehow remember and pay attention to who is good at anticipating the future?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3978.815,
    "end": 4004.913,
    "text": " certain political figure or, you know, certain organization is, is that turns out to have a really good track record of accurately predicting what's going to happen next, well, then maybe we want to pay attention to them and pay more attention to them to then to others who have a terrible track record of, of predicting what's going to happen next, you know, like if a politician says, Oh, if you do this, if you do a then B is going to happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4005.413,
    "end": 4006.534,
    "text": "Well, you know, if",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4006.957,
    "end": 4013.501,
    "text": " By and large, those kinds of predictions are wrong, then, you know, politicians probably not worth much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4015.502,
    "end": 4017.243,
    "text": "But not just in politics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4017.604,
    "end": 4021.486,
    "text": "Obviously, we anticipate and, like, for example, that's what science does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4021.626,
    "end": 4027.81,
    "text": "Science is, you know, awash with trying to figure out how the world works and what's going to happen next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4028.482,
    "end": 4056.305,
    "text": " and uh so so that's another area that we could you know a healthy society might really support the scientific uh you know the scientific endeavor and pay attention to what scientists are saying like for example with climate change and other things you know if the whole scientific world is saying hey this is serious you gotta pay you gotta do something about it well then maybe a healthy society would actually do something about it right um honesty and honesty i'm just picking out the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4058.488,
    "end": 4063.291,
    "text": " for numerous hours about how any of these might play out in a real setting, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4064.892,
    "end": 4076.438,
    "text": "Honesty, so look at the amount of dishonest information or manipulated information that is flowing around us today in this world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4076.458,
    "end": 4079.419,
    "text": "You know, why is that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4079.88,
    "end": 4086.023,
    "text": "I mean, obviously a healthy society would want to share honest and valid information,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4087.583,
    "end": 4090.486,
    "text": " Let's call it quality information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4090.726,
    "end": 4092.788,
    "text": "Good models are built on quality information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4093.648,
    "end": 4098.453,
    "text": "So here's a question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4098.613,
    "end": 4103.437,
    "text": "Why in our world, why is there so much disinformation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4104.638,
    "end": 4114.947,
    "text": "And I would suggest that at least some of it is due to the fact that individuals and organizations, corporations are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4116.425,
    "end": 4124.969,
    "text": " fantastically rewarded for putting out dishonest information, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4125.41,
    "end": 4126.931,
    "text": "I mean, just think of a thief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4127.071,
    "end": 4142.819,
    "text": "I can call you up in a phone scam and if I can convince you that I'm your bank and I need your account number, then I can have enormous rewards for being dastardly dishonest to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4143.755,
    "end": 4144.795,
    "text": " But, but it's true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4144.855,
    "end": 4160.801,
    "text": "I mean, maybe that's an extreme example, but it's true in just ordinary examples of business and life that one can be rewarded greatly or being fairly dishonest or, you know, putting out something less than quality information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4161.381,
    "end": 4170.864,
    "text": "And then you gotta, then you gotta ask, okay, well then if, if then, you know, like we don't want, society doesn't want to reward antisocial anti,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4172.408,
    "end": 4176.31,
    "text": " anti-transparent, anti-honest behavior?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4177.191,
    "end": 4182.134,
    "text": "How would a society reward pro-social, honest behavior?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4183.715,
    "end": 4186.137,
    "text": "Maybe a society could become more transparent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4186.157,
    "end": 4189.499,
    "text": "So transparency, obviously, would be a part of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4189.74,
    "end": 4193.042,
    "text": "But I'm sort of honing in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4193.062,
    "end": 4197.605,
    "text": "I don't know if you can tell, but I'm sort of honing in just on this little question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4198.368,
    "end": 4203.692,
    "text": " about how do we reward behaviors in this world as a society?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4204.293,
    "end": 4218.584,
    "text": "And then that suddenly brings up the question of how does an economic system work and how do we view money and how do we view income and how do we use money and income in our lives?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4219.304,
    "end": 4226.59,
    "text": "And is there some way that we could reinvent an economy and reinvent money so that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4231.01,
    "end": 4241.778,
    "text": " whatever we need to reinvent so that we're actually day to day, moment to moment, we're rewarding cooperative pro-social behavior and honest behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4242.038,
    "end": 4243.439,
    "text": "So like, how do we do that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4244.56,
    "end": 4249.343,
    "text": "Now I have some ideas on how to do that, but that's in the part three of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4249.383,
    "end": 4250.344,
    "text": "So we'll get to them later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4251.425,
    "end": 4254.687,
    "text": "So I don't want to go much further on this, but I'm just suggesting that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4255.539,
    "end": 4266.824,
    "text": " that we could spend, you know, each of these could raise a hundred ideas of how to, what we could do in a healthier society to improve our capacity for group problem solving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4268.444,
    "end": 4269.245,
    "text": "Nice points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4269.785,
    "end": 4270.625,
    "text": "Good for nine?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4271.766,
    "end": 4275.307,
    "text": "Yeah, I always think I am, but hold on one second.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4276.127,
    "end": 4279.989,
    "text": "On the right-hand side of slide eight are a few other ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4280.069,
    "end": 4284.631,
    "text": "So, you know, obviously we've done",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4287.728,
    "end": 4316.123,
    "text": " measuring the fitness of them so um you know how do we how do that's a that's also a general answer to this question of how do we build a society that is more fit well we actually measure things that are important and we score them and we share that information widely so we know how we're doing so we know so we can evaluate either our systems or our organizations or our institutions or society at large or those kinds of things so metrics are important",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4317.413,
    "end": 4319.855,
    "text": " I already mentioned science and critical thinking are important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4319.875,
    "end": 4322.297,
    "text": "So that touches on the educational system, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4322.317,
    "end": 4332.666,
    "text": "A healthy educational system would really value critical thinking and would train individuals to be critical thinkers at an early age, I would think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4332.986,
    "end": 4336.649,
    "text": "And then obviously then removing the barriers to cooperation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4337.129,
    "end": 4341.133,
    "text": "This society has enormous barriers to cooperation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4341.393,
    "end": 4342.254,
    "text": "I might want to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4343.547,
    "end": 4346.189,
    "text": " Here's just one example out of what could be a million examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4346.569,
    "end": 4356.534,
    "text": "Say that I wanted to use my life's energy, my work time, my 40 hours of work a week to make the world a better place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4356.694,
    "end": 4367.219,
    "text": "I want to jump in and I want to, I don't know, let's say I want to teach kids, little children.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4367.799,
    "end": 4369.66,
    "text": "Maybe I want to be a good teacher.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4371.08,
    "end": 4371.581,
    "text": "Well, that's great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4371.701,
    "end": 4372.181,
    "text": "Fantastic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4373.143,
    "end": 4377.744,
    "text": " But if I do that, I have to pay a financial penalty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4379.244,
    "end": 4381.005,
    "text": "I could become a banker instead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4381.025,
    "end": 4383.205,
    "text": "So suppose those are my two choices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4383.265,
    "end": 4388.066,
    "text": "I could become a banker or a finance person or something, or I could become a teacher.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4388.386,
    "end": 4394.328,
    "text": "Well, society is going to reward me greatly for being a banker or a finance person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4395.068,
    "end": 4398.989,
    "text": "And it's going to not reward me very well for being a teacher.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4401.502,
    "end": 4402.703,
    "text": " I might want to cooperate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4402.783,
    "end": 4406.006,
    "text": "I might want to work for the betterment of humankind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4406.066,
    "end": 4409.81,
    "text": "But if I do, there's a good chance I'm going to be relatively poor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4410.451,
    "end": 4412.012,
    "text": "You know, like I pay a heavy price for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4412.453,
    "end": 4414.915,
    "text": "And that's just a barrier to cooperation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4415.556,
    "end": 4425.085,
    "text": "We should design systems so that cooperation becomes the default, easy, no, like duh, duh, do it this way because it's good for everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4425.145,
    "end": 4425.786,
    "text": "It's good for you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4425.806,
    "end": 4425.866,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4426.941,
    "end": 4427.982,
    "text": " Sure, you want to teach?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4428.022,
    "end": 4428.902,
    "text": "Well, great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4429.022,
    "end": 4429.482,
    "text": "Come on in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4429.542,
    "end": 4434.085,
    "text": "Here's opportunities for you to teach, and you're not going to pay a penalty for becoming a teacher.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4434.945,
    "end": 4436.546,
    "text": "This is going to be easy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4436.646,
    "end": 4440.588,
    "text": "If you want to be a teacher and help young children learn better, great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4440.628,
    "end": 4445.711,
    "text": "Here's wonderful opportunities, and you're not going to have to pay a penalty for doing that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4445.771,
    "end": 4447.992,
    "text": "We're going to actually just the opposite.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4448.012,
    "end": 4449.292,
    "text": "We're going to reward you for doing that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4450.953,
    "end": 4454.675,
    "text": "Okay, now we're done with slide nine or slide eight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4456.075,
    "end": 4457.455,
    "text": " That was good tonight.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4459.136,
    "end": 4459.256,
    "text": "OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4460.116,
    "end": 4475.619,
    "text": "So the only thing I really want to say about this slide is that this concept of the societal systems as a cognitive architecture, probably somewhere in the literature, there's something talking about that in some sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4475.679,
    "end": 4483.601,
    "text": "But I think maybe, I don't know if it's as kind of like pointed as I'm making it in this series.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4484.378,
    "end": 4495.583,
    "text": " And there and there really is no name for what is what is the name for the set of societal systems that helps the society that facilitates societal cognition?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4495.963,
    "end": 4497.064,
    "text": "What is the name of that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4498.344,
    "end": 4501.746,
    "text": "And there isn't a name, you know, it's it's not an economic system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4501.786,
    "end": 4507.008,
    "text": "And it's not a governance system, because that's just those are just some systems that are that have their own connotations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4507.128,
    "end": 4513.051,
    "text": "So what is the name of this whole set of integrated systems that helps society to think?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4514.13,
    "end": 4515.231,
    "text": " Well, there is no name.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4515.431,
    "end": 4517.412,
    "text": "I mean, there is no formal name.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4517.532,
    "end": 4522.255,
    "text": "And so you can't look at if you're going to search in the literature on this topic, there's no there's no term to search for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4523.015,
    "end": 4526.958,
    "text": "And so I thought maybe it'd be useful if I try to suggest some terms at least.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4527.498,
    "end": 4536.783,
    "text": "And I suggest the term societal cognitive architecture for the general the general idea that societal systems are a cognitive architecture for society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4538.404,
    "end": 4540.426,
    "text": "But then for the more specific",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4541.53,
    "end": 4554.557,
    "text": " developing de novo systems to be good at facilitating societal cognition, I suggest the term SAILS, Societal Active Inference and Learning Systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4555.597,
    "end": 4560.28,
    "text": "I mean, maybe there's some other better term, I don't know, but I threw together this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4561.0,
    "end": 4568.404,
    "text": "So it's SAILS that I'm interested in developing, new designs of societal systems that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4572.315,
    "end": 4573.857,
    "text": " facilitating societal cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4576.08,
    "end": 4587.437,
    "text": "So, you know, if one of these terms catch on, maybe then in the future we'll be able to, if we're interested in the topic, we can actually do a search on Google and we'll find, you know, a hundred papers or a thousand papers on some of these topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4587.745,
    "end": 4589.386,
    "text": " Well, just one quick note on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4589.406,
    "end": 4609.995,
    "text": "It points to the need for improved cognitive architecture, such as knowledge management tools that help us collaborate and find information semantically, like information is for our experience, because you're right, it is fragmented and therefore unproductive across truly different disciplines and different jargons, different languages as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4610.335,
    "end": 4616.278,
    "text": "Unscanned documents, things that are just only on someone's notepad, just it's all over the place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4617.987,
    "end": 4627.334,
    "text": " Right, and sometimes a thing doesn't really exist until you name it, and then it sort of exists for the larger, it can exist for the larger society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4627.374,
    "end": 4632.838,
    "text": "So I'm naming this because maybe if we name it, we can talk about it, you know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4633.999,
    "end": 4634.919,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4634.999,
    "end": 4643.445,
    "text": "The other problem there is like when I go to, it would be much easier for me to just throw out a term like cognitive social, cognitive societal architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4643.906,
    "end": 4646.408,
    "text": "And if people understood that term, then I wouldn't have to spend a half hour",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4647.546,
    "end": 4670.096,
    "text": " to explain what it is that i'm talking about right so terms terms can help if we have a shared understanding of what their meaning is what what is not sales because it's a you know what is what's not part of the function of the body how do we differentiate what is apart from that instead of this just being the one-to-one wrapper around economics governance legal etc etc",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4671.348,
    "end": 4671.888,
    "text": " Right, right, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4672.089,
    "end": 4672.489,
    "text": "Good point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4672.709,
    "end": 4684.838,
    "text": "And I really my, my, my use of the term sales, I'm suggesting it for use, really in this de novo design, you know, process of creating new systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4684.898,
    "end": 4695.807,
    "text": "So quite true, the the, you know, the cognitive, the concepts of cognition that we've been talking about, they are universal,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4696.761,
    "end": 4712.144,
    "text": " So it is true that we're kind of focusing on just sales as a term for the kind of R&D project, R&D projects to move forward that might look at the de novo designs of new systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4713.124,
    "end": 4715.585,
    "text": "Just the pun, traveling salesperson.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4719.886,
    "end": 4720.506,
    "text": "It's a problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4720.546,
    "end": 4721.966,
    "text": "You know, it's a hard problem, actually.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4723.847,
    "end": 4725.147,
    "text": "The traveling salesperson problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4727.233,
    "end": 4727.673,
    "text": " Yes, it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4731.075,
    "end": 4731.415,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4731.495,
    "end": 4737.918,
    "text": "So with that, we are ready to move on to the actual talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4739.827,
    "end": 4740.307,
    "text": " Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4740.648,
    "end": 4741.448,
    "text": "Drum roll, please.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4741.688,
    "end": 4742.189,
    "text": "Drum roll.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4742.289,
    "end": 4744.77,
    "text": "Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4744.81,
    "end": 4748.092,
    "text": "The second part, you know, this is a different media.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4748.472,
    "end": 4754.516,
    "text": "We're kind of spilling above and beyond what you've wrote in the papers because the three papers are the version of reference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4754.957,
    "end": 4755.937,
    "text": "That's where people will cite.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4755.997,
    "end": 4759.94,
    "text": "But actually in this increasingly digitized and citable world,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4760.58,
    "end": 4771.609,
    "text": " Perhaps the things that you're sharing with us, as well as even the anonymous content that people produce on a jam board or live chat, like this all becomes part of how we produce our uncertainty and act.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4772.609,
    "end": 4772.81,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4772.97,
    "end": 4773.39,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4773.47,
    "end": 4779.755,
    "text": "And, and hopefully it becomes part of the record and part of the useful record for, for moving forward on some of these concepts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4781.109,
    "end": 4794.715,
    "text": " Okay, so part one was all about worldview, there was, you know, high level discussions, high level topics about what creates worldview, and how what kind of worldview would be useful in the setting for developing new systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4794.835,
    "end": 4803.999,
    "text": "And then now we're moving on to the more nuts and bolts of things a little bit more in the sense of why are we even motivated to transform and, and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4807.532,
    "end": 4833.281,
    "text": " we do want to develop new systems what kind of strategy you know what like it's it's not enough just to come up with some great design it has to be viable in the sense that it can be implemented there has to be some way to actually use these ideas actually live these ideas and if there's not then we're sort of wasting our time so strategy is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4837.944,
    "end": 4838.604,
    "text": " R&D program.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4842.407,
    "end": 4862.119,
    "text": "So yeah, so I'm going to be in part two, I talk about really, I try to argue a given narrative in part two, that I try to argue that transformation is prudent, given the risks we face, attractive given its potential benefits, and achievable, given the current political, financial and social constraints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4862.359,
    "end": 4864.54,
    "text": "So that's what I hope to accomplish in this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4865.281,
    "end": 4866.862,
    "text": "And that's what I hope to accomplish in this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4867.901,
    "end": 4869.582,
    "text": " this talk too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4870.882,
    "end": 4871.142,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4871.242,
    "end": 4875.744,
    "text": "So on the question of motivation, like why transform?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4876.604,
    "end": 4879.426,
    "text": "We touched on some of these ideas in our first talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4880.626,
    "end": 4889.109,
    "text": "But I would just like to point out that we face a host of extremely difficult problems, climate change being one of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4890.53,
    "end": 4895.312,
    "text": "Climate change, biodiversity loss, groundwater depletion, soils depletion,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4897.879,
    "end": 4902.962,
    "text": " poverty, financial uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4902.982,
    "end": 4907.165,
    "text": "In that sense, debt might play into that role.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4907.185,
    "end": 4915.931,
    "text": "If you make a list of all the very serious problems that humanity faces, it's kind of a long list.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4916.371,
    "end": 4918.752,
    "text": "Migration, and then one problem causes another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4918.892,
    "end": 4922.715,
    "text": "So climate change is certainly likely",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4923.482,
    "end": 4937.565,
    "text": " almost certainly will increase the number of refugees trying to cross borders, people living without homes that are fleeing areas that don't have enough water or are not livable or things like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4937.645,
    "end": 4951.447,
    "text": "So one problem causes the other, and what everyone is fearful of happening is that you have this collection of 10 or 20 really serious problems, and then something happens to flare one of them up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4952.0,
    "end": 4956.462,
    "text": " And then suddenly that problem, you know, transfers to other problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4956.542,
    "end": 4960.843,
    "text": "And then you have, uh, just one, you know, like everything's connected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4960.943,
    "end": 4968.646,
    "text": "So if one part of our global society gives sway, it could be that, uh, everything starts to kind of fall apart.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4969.666,
    "end": 4975.588,
    "text": "So, uh, there is a fear of that and there is a need to address these problems independently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4975.808,
    "end": 4978.469,
    "text": "And then also in a holistic sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4979.298,
    "end": 4987.84,
    "text": " And I would like to emphasize that these problems we face are, in a sense, symptoms, not really problems in and of themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4987.94,
    "end": 5004.465,
    "text": "They're symptoms of a failure of society up to today, a failure to address the needs of the society, a failure to reduce uncertainty, a failure to do exactly what we were talking about in the previous part of this talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5005.413,
    "end": 5009.455,
    "text": " Right, so climate change is because we fail to take action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5009.516,
    "end": 5013.498,
    "text": "We've known about climate change for 60 years, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5013.558,
    "end": 5029.968,
    "text": "I mean, like it's been in the scientific world, like in a major way, major agreement on the implications and the basic processes and what it means to society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5030.048,
    "end": 5032.93,
    "text": "That's been talked about, there was, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5034.997,
    "end": 5048.279,
    "text": " the scientific world was on this 30 years ago and talking about it and writing papers and having, you know, so, so we didn't, society didn't listen and it didn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5048.359,
    "end": 5057.021,
    "text": "And I would say it didn't listen for a reason because if it had listened to those warnings, it society would have had to have changed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5058.061,
    "end": 5064.222,
    "text": "And there are elements of society that are doing well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5064.961,
    "end": 5072.387,
    "text": " and are maybe not so interested in changing behaviors and especially changing power distributions, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5072.587,
    "end": 5090.082,
    "text": "So the people that, the powers that more or less guide society were not interested in dealing with our serious problems because they have gotten worse over the last 50 years or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5090.646,
    "end": 5092.247,
    "text": " These problems have amplified.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5092.267,
    "end": 5095.828,
    "text": "If you don't solve a problem, it tends to fester and get larger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5095.848,
    "end": 5097.368,
    "text": "That's exactly what's happened.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5098.049,
    "end": 5106.672,
    "text": "Now we're at the period of not only will climate change, you know, is climate change going to affect the GDP?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5107.092,
    "end": 5107.592,
    "text": "That's the yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5118.288,
    "end": 5124.249,
    "text": " Or if not millions or billions of people, it's life and death for our species.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5124.729,
    "end": 5135.652,
    "text": "We have to deal with this in some kind of bold way or we won't have children on this planet in, you know, whatever, in 50 years, 100 years, 200 years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5136.472,
    "end": 5137.332,
    "text": "Humans won't be a thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5138.472,
    "end": 5146.034,
    "text": "So that's how I say that because that's how badly society has failed us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5146.676,
    "end": 5150.458,
    "text": " We are at the brink of falling off a cliff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5151.378,
    "end": 5157.321,
    "text": "Maybe we already fell off a cliff and we just don't quite realize it yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5157.982,
    "end": 5164.325,
    "text": "What kind of healthy organism puts itself and commits suicide?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5164.425,
    "end": 5166.125,
    "text": "What healthy system commits suicide?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5166.586,
    "end": 5167.266,
    "text": "None, really.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5168.307,
    "end": 5168.987,
    "text": "Only the phoenix.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5169.927,
    "end": 5171.268,
    "text": "Yeah, only the phoenix, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5172.003,
    "end": 5174.684,
    "text": " And, you know, maybe it worked out for that one okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5174.704,
    "end": 5178.764,
    "text": "It sort of rose, I guess, and maybe we'll do the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5178.864,
    "end": 5189.887,
    "text": "But, you know, my point is that the serious problems we face are all symptoms of our lack of cognitive capacity at the societal level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5191.707,
    "end": 5197.088,
    "text": "And there have been solutions to all these problems for decades.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5205.115,
    "end": 5228.063,
    "text": " distribution of power in society and they're just people weren't willing to do that okay so um so in this paper that well on this call for transformational change so i am i'm trying to i'm calling for transformational change right now but i'm not alone so this this idea of we need bold change this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5230.919,
    "end": 5260.019,
    "text": " most of the scientific world really and most of the global policy making world and a large section of the global public is all realizing that we are in deep trouble and we need to change not incrementally not slowly but rapidly and deeply and across every aspect of society so i'll just use the words this is uh from the 2019 global assessment from the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5261.135,
    "end": 5279.685,
    "text": " IPBES, the UN, as they, in their words, they say current national global programs are insufficient to avoid, you know, and they call for a transformational change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5279.705,
    "end": 5289.451,
    "text": "They use the word transformational and they define it as a fundamental system wide reorganization across technological, economic, social factors,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5289.881,
    "end": 5292.162,
    "text": " including paradigms, goals, and values.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5292.222,
    "end": 5314.814,
    "text": "I mean, essentially, you know, enormous fundamental change in how we understand ourselves, how we understand the world, how we behave, what we do for a living, how industry works, how consumerism works, what products we make, how we recycle, like how much energy we use, how, where we get our energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5315.911,
    "end": 5328.885,
    "text": " So I think maybe, I don't wanna put words in the UN's mouth, but I think maybe they were really still kind of talking about, you know, like improving current systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5335.209,
    "end": 5364.669,
    "text": " steps within our governance systems we can take bold steps within our economic systems financial systems we can do better there's ways that we can do better I would like to very much agree with that there are ways we can do better we should we should I would I would put that under the category of reform we should do everything in our power to reform the existing systems because that is the quickest bang for the buck I mean we can do more that isn't imperative that we act and put our energies behind",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5365.859,
    "end": 5378.101,
    "text": " reforming as best we can the existing systems, working within existing systems and reforming them so they can do a better job so that we can reach some kind of transformation even within existing systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5378.981,
    "end": 5383.582,
    "text": "But this proposed R&D program and my interests are beyond that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5384.002,
    "end": 5393.324,
    "text": "So I'm not, you know, my interest here is not in reform, not in improving capitalism, for example,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5394.422,
    "end": 5395.904,
    "text": " or representative democracy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5396.004,
    "end": 5403.289,
    "text": "It is in building de novo systems from the ground up that are fit for purpose as we've been talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5404.65,
    "end": 5409.674,
    "text": "So, you know, that's what I mean when I say societal transformation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5409.734,
    "end": 5415.418,
    "text": "I mean shifting to building, testing, and shifting to new systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5415.999,
    "end": 5422.844,
    "text": "And, you know, we're familiar with these kind of concepts when we download software in the software world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5423.67,
    "end": 5426.591,
    "text": " Uh, there, the terms are usually, uh, updates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5426.831,
    "end": 5429.771,
    "text": "So like, you know, I'm going to update my software, minor improvement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5429.791,
    "end": 5432.552,
    "text": "I'm going to upgrade my software to a new version.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5432.572,
    "end": 5434.833,
    "text": "I'm going to get, you know, version four instead of version three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5434.933,
    "end": 5436.853,
    "text": "So that's kind of like big reform.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5436.953,
    "end": 5438.013,
    "text": "I'm going to get an upgrade.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5439.434,
    "end": 5440.134,
    "text": "Then migration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5440.194,
    "end": 5444.095,
    "text": "So I'm going to do, I don't even like this, this company or this product.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5444.115,
    "end": 5445.835,
    "text": "I'm going to switch to open source.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5446.42,
    "end": 5450.542,
    "text": " and I'm gonna use the Linux operating system or some other, I'm gonna do something else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5450.603,
    "end": 5453.904,
    "text": "I'm gonna use some entirely new system because the old one really doesn't work very well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5454.465,
    "end": 5467.352,
    "text": "So my focus is on this, you know, is on migration, the testing development and implementation of de novo design societal systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5470.074,
    "end": 5473.336,
    "text": "Okay, so I think, you know, and science driven,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5477.222,
    "end": 5477.542,
    "text": " attitude.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5479.103,
    "end": 5483.345,
    "text": "Okay, so lots of people calling for transformational change, and that's what this paper is about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5483.405,
    "end": 5487.067,
    "text": "Transformation understood as migration to new systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5489.728,
    "end": 5504.855,
    "text": "On slide 12, I think maybe, I mean, others might disagree, but I think maybe this is the first series in the literature that, in the science literature, that really lays out an R&D program that aims to tackle this de novo design of new systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5506.234,
    "end": 5509.736,
    "text": " I don't, I've not seen any others that are kind of comparable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5509.876,
    "end": 5516.06,
    "text": "So I think we're maybe, you know, paving new ground here, perhaps, at least I hope.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5519.501,
    "end": 5528.046,
    "text": "I want to emphasize something we talked about in the last talk, that this is, we're talking about second-order science as opposed to first-order science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5528.757,
    "end": 5532.778,
    "text": " So first-order science, again, is what we normally think of as science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5533.699,
    "end": 5534.819,
    "text": "Someone is doing experiments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5534.839,
    "end": 5537.28,
    "text": "They're detached from the experiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5537.78,
    "end": 5539.781,
    "text": "The scientist is detached.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5539.841,
    "end": 5540.401,
    "text": "They set it up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5540.421,
    "end": 5541.662,
    "text": "They let the experiment run.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5542.102,
    "end": 5543.362,
    "text": "They don't interfere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5543.402,
    "end": 5545.363,
    "text": "They just record what happened.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5545.443,
    "end": 5547.664,
    "text": "And hopefully, they gain some knowledge from doing so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5548.444,
    "end": 5549.344,
    "text": "Fantastic stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5549.424,
    "end": 5552.385,
    "text": "Most of science is all first-order science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5552.405,
    "end": 5553.086,
    "text": "It's wonderful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5553.726,
    "end": 5557.207,
    "text": "But for these kinds of problems, for this kind of problem that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5563.948,
    "end": 5592.073,
    "text": " requires what is called second-order science and there's a in my series I cite the work by phase you know on this topic and that's a great article I recommend that to everyone it's in the paper so you can get it there but he describes what they actually said hey it's a long list of authors describe what they mean by a second-order science and why it's important and they just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5599.83,
    "end": 5600.791,
    "text": " learning to learn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5600.971,
    "end": 5610.24,
    "text": "We're learning to build new systems that help us to learn and build new systems, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5611.021,
    "end": 5612.763,
    "text": "We want to excel at learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5612.803,
    "end": 5614.204,
    "text": "That's the whole concept of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5614.424,
    "end": 5620.21,
    "text": "We want a society that excels at learning and problem solving and adaptation, and we're",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5620.908,
    "end": 5625.629,
    "text": " And we're in the process of learning to build new systems that produce this effect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5625.689,
    "end": 5629.671,
    "text": "So it's kind of a meta learning science, meta learning process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5630.051,
    "end": 5636.653,
    "text": "And just in general, the second order science is the focus is on process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5636.733,
    "end": 5637.953,
    "text": "The effort is value driven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5637.973,
    "end": 5643.475,
    "text": "And the scientists are participants along with stakeholders who together learn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5645.806,
    "end": 5654.753,
    "text": " So it's quite different from first-order science, and it's exactly the kind of science I think that is necessary for this larger meta-learning project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5656.534,
    "end": 5661.898,
    "text": "In the paper, I talk about six overarching systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5661.998,
    "end": 5664.48,
    "text": "I just want to say that's what we're focused on here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5664.941,
    "end": 5670.125,
    "text": "So economic, governance, legal, health, analytical, and educational systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5670.145,
    "end": 5671.686,
    "text": "Those are the ones I've chosen to focus on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5672.33,
    "end": 5681.192,
    "text": " And each of them can be split down further, like in my terminology, the economic system also includes a monetary system and a financial system and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5682.213,
    "end": 5684.633,
    "text": "And each of these can be split down further.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5685.274,
    "end": 5686.334,
    "text": "So that's what we're doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5686.394,
    "end": 5694.836,
    "text": "We're trying to develop designs for each of these that are integrated, not just, hey, let's just build a new economic system and leave everything else and change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5694.856,
    "end": 5696.297,
    "text": "We'll do the economic system first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5696.697,
    "end": 5699.217,
    "text": "That's not the point of the process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5699.277,
    "end": 5701.218,
    "text": "The idea is how can we build a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5706.69,
    "end": 5723.458,
    "text": " helps us to achieve these goals and it's really a nice dovetailing with development is what organisms do that's embryonic development or colony level development or the niche being modified so it's like research and development research information foraging um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5724.434,
    "end": 5733.797,
    "text": " whatever we want to think about information foraging to mean here with research or just search, but it's like we already have design latent within potentially even the structures we have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5734.257,
    "end": 5740.519,
    "text": "So how are we going to pull out of the tailspin if that's what we're in to build towards developing a healthier trajectory?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5741.159,
    "end": 5741.559,
    "text": "That's right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5741.799,
    "end": 5750.141,
    "text": "We're in the process of evolution, you know, and every organism is evolving exactly as you said and developing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5750.201,
    "end": 5751.802,
    "text": "So we're just being a part of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5754.108,
    "end": 5759.209,
    "text": " And, you know, quite a sensible part of that, I might add, too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5759.269,
    "end": 5766.791,
    "text": "It's kind of like, oh, we're faced with severe problems that we might have a masked eye off of humans or go extinct because of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5766.851,
    "end": 5767.891,
    "text": "So let me think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5767.911,
    "end": 5768.931,
    "text": "What would be a good idea?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5769.711,
    "end": 5772.212,
    "text": "Oh, let's think about doing things differently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5772.252,
    "end": 5774.932,
    "text": "Let's try to build a different way to live our lives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5775.312,
    "end": 5778.613,
    "text": "You know, that's just kind of like, duh, that's a good idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5778.993,
    "end": 5783.034,
    "text": "Let's find a better way to live our lives and be more cooperative and have a healthier world",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5783.404,
    "end": 5784.305,
    "text": " That's an excellent idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5786.787,
    "end": 5790.75,
    "text": "OK, so this is kind of a warm-up to what's coming in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5790.871,
    "end": 5793.153,
    "text": "I speak a lot about local community.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5793.573,
    "end": 5796.616,
    "text": "And I just want to emphasize, or I want to explain what that means a little bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5797.136,
    "end": 5805.604,
    "text": "So for one thing, I call society an organism or a superorganism and a cognitive organism at that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5806.624,
    "end": 5810.708,
    "text": "And by society, I mean really a society",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5812.756,
    "end": 5817.377,
    "text": " I'm interested in local communities for some reasons that will become clear shortly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5818.557,
    "end": 5839.301,
    "text": "Local community might be just like a fraction of a city, not even a full city and not even a political body, not like a formal political body, but a group of people who in this case are particularly interested in participating in trying out and field testing and using some of these new systems that we're talking about developing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5840.545,
    "end": 5853.373,
    "text": " Uh, you know, let's say, uh, when I say, uh, local community, let's say, uh, a group of a thousand people or more could be, could be larger, but not, not necessarily even a city and certainly not a nation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5857.575,
    "end": 5857.875,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5857.915,
    "end": 5865.38,
    "text": "So, um, so I said that the UN and others are, this is slide 13 that the UN and others are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5866.276,
    "end": 5879.388,
    "text": " have come out with strong language calling for transformational change, which I think, again, you know, for many folks involved there, I think maybe their idea really is more what I would call reform.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5879.988,
    "end": 5881.109,
    "text": "Again, very, very important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5882.39,
    "end": 5886.274,
    "text": "But it might help here to talk about why reform might not be enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5886.634,
    "end": 5889.997,
    "text": "Like why, you know, if the UN and other agencies and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5890.458,
    "end": 5895.903,
    "text": " Other groups are really putting up some great proposals for reform and improvement of existing systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5896.503,
    "end": 5899.225,
    "text": "Why am I interested in developing new systems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5899.285,
    "end": 5900.626,
    "text": "Why don't we just do reform?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5901.267,
    "end": 5903.729,
    "text": "If that'll do the trick, why bother with more?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5905.09,
    "end": 5914.658,
    "text": "And there's numerous reasons that I lay out in paper number two of why I think transformation, new system development is necessary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5916.219,
    "end": 5918.421,
    "text": "And to start with,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5920.345,
    "end": 5941.825,
    "text": " And as we've kind of been saying here, you can look at the world and the problems that we face with climate change and biodiversity loss and others, and you can suspect that current systems are incapable, maybe incapable of preventing widespread catastrophe and securing our continued vitality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5943.482,
    "end": 5947.585,
    "text": " Really, the report card doesn't look good for existing systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5947.625,
    "end": 5961.716,
    "text": "They've done a rather crappy job of protecting the human health and the environment to the extent that we now face perhaps in our lifetime or soon after perhaps a mass die off of humans or even extinction of humans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5963.457,
    "end": 5970.222,
    "text": "So why would we think that they're capable now suddenly of acting differently?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5972.119,
    "end": 6001.8,
    "text": " good excellent to do reform i don't want to talk anyone out of the reform efforts because they're absolutely important but i am suggesting that maybe we should have a plan b in case plan a doesn't work out so well so uh you know transformation this is a this is a plan b in a sense and in the end might turn out to be better than plan a even if reform is useful and helpful plan b might turn out to be the better bet so you kind of catch it on both ends there",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6003.137,
    "end": 6015.788,
    "text": " So I'll just talk about a few things I mentioned in the paper of why evidence of current systems being incapable of preventing a widespread catastrophe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6015.888,
    "end": 6017.489,
    "text": "So one is the Paris Agreement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6018.11,
    "end": 6020.852,
    "text": "And then this is quoting from one of the UN studies, I believe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6021.573,
    "end": 6029.179,
    "text": "It says, ambitions are broadly consistent with cost-effective pathways that result in a global warming of about three degrees by 2100.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6034.292,
    "end": 6042.956,
    "text": " So in a practical sense, if the Paris Agreement were interactive, that's sort of where it would lead to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6042.976,
    "end": 6052.12,
    "text": "It is clearly, it is maybe an important agreement, but not enough, not nearly enough, it looks like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6053.061,
    "end": 6059.544,
    "text": "And if indeed we were to reach about three degrees centigrade change from historical levels,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6061.176,
    "end": 6069.782,
    "text": " That's already in the iffy category of like, you know, how do humans, do we even have a civilization if we reach three degrees?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6069.803,
    "end": 6070.903,
    "text": "You know, it's an iffy question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6070.923,
    "end": 6075.387,
    "text": "Maybe we do, maybe we find a way to deal with it and get by, or maybe we don't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6075.427,
    "end": 6077.229,
    "text": "Maybe that's already way too much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6079.43,
    "end": 6086.016,
    "text": "And also, the reform efforts don't adequately address certain structural problems that we face.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6091.897,
    "end": 6094.759,
    "text": " income and wealth divisions in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6096.96,
    "end": 6114.371,
    "text": "Most of the reform efforts are not looking at how we can not have billionaires, but rather have everyone more or less equally engaged in the economic sphere and in a sense, having economic power to make decisions in this world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6115.925,
    "end": 6127.811,
    "text": " So even if reform efforts are useful and good, I hope they are, maybe they won't be enough and maybe they won't even touch deeply on some topics that really need to be addressed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6129.612,
    "end": 6145.34,
    "text": "So I argue, this section covers several pages, but in the end I argue that even if reform efforts are useful and helpful and they're successful for what they're shooting for,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6145.831,
    "end": 6152.215,
    "text": " they're still likely to leave societies hampered in their capacity to learn and adapt with many unsolved problems to address.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6153.055,
    "end": 6165.883,
    "text": "For example, even right now, even at one, wherever we're at, I'm not sure what degree we're at right now over historical levels, but still below two degrees, maybe we're 1.3, I don't know what it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6167.404,
    "end": 6173.147,
    "text": "Already there's nations that are, you know, there's island nations that are not able to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6173.936,
    "end": 6181.418,
    "text": " handle this, you know, like people are already starting to have to relocate and every indication is that that's just going to become worse and worse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6182.298,
    "end": 6200.964,
    "text": "So even if we keep it below 1.5 degrees or we keep it below 2 degrees, the warming, we're going to have severe problems, social problems, economic problems, environmental problems, ecologic problems, and somehow we're going to have to deal with this harsher world",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6202.19,
    "end": 6209.034,
    "text": " than even harsher than today, you know, more dangerous than today and more strained than today, more stressful than today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6209.934,
    "end": 6219.579,
    "text": "And I'm suggesting that the best way to deal with a future world that is stressful and uncertain, highly uncertain and difficult is to become really good at problem solving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6220.479,
    "end": 6222.56,
    "text": "Isn't, I mean, that's how you would go about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6222.62,
    "end": 6225.682,
    "text": "That's, you would be, if you can, you would become really good",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6226.286,
    "end": 6232.987,
    "text": " at acting in an uncertain world and making wise decisions so that you don't have to suffer any more than is necessary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6237.488,
    "end": 6248.31,
    "text": "Yeah, so that's, you know, like there would be, even if reform is successful, it would still be useful to develop, to become better at problem solving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6249.611,
    "end": 6251.871,
    "text": "And I think that there's great opportunity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6254.056,
    "end": 6266.439,
    "text": " as a whole society hasn't even really tried to become a good problem solver, like, you know, in a, in a focused science driven way, we've never really put our mind to this and we can put our mind to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6267.039,
    "end": 6269.899,
    "text": "And I think that would be tremendous improvements that we could make.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6269.919,
    "end": 6278.421,
    "text": "That's, you know, that's why I wrote the series is because I think we could do so much better than we're doing today, which is not very well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6280.221,
    "end": 6283.302,
    "text": "Um, let's see anything else on this slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6287.185,
    "end": 6287.705,
    "text": " Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6289.167,
    "end": 6307.219,
    "text": "Down in the lower right-hand corner, I have a kind of a long list of things that we need to do and I won't read it now, but you know, we basically have to remake everything from what we make, how we make it, how we use it, where it goes, how it's disposed of, how we treat each other, how we cooperate, who we cooperate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6307.299,
    "end": 6314.845,
    "text": "I mean, just like deep transformation from across every aspect of human life and human social life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6315.605,
    "end": 6315.985,
    "text": "So, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6317.008,
    "end": 6329.899,
    "text": " you know, to me at least, it's inconceivable that existing systems could even come close to the level of transformation that is actually not only needed, but would be beneficial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6330.619,
    "end": 6336.724,
    "text": "Like, it would be really beneficial if societies became good at problem-solving and adaptation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6337.245,
    "end": 6343.35,
    "text": "And it's pretty much inconceivable, to me at least, that existing systems and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6350.56,
    "end": 6351.041,
    "text": " beneficial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6353.743,
    "end": 6356.246,
    "text": "I think this is really great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6357.247,
    "end": 6361.711,
    "text": "I'm just looking for a natural pause point for where we would want to be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6362.552,
    "end": 6367.737,
    "text": "What do you think about doing 14, going through it, taking our time, and then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6368.812,
    "end": 6390.215,
    "text": " this r d program being the pickup point for our third session i know we're going slow you're going on some great boomerangs so it's awesome but let's walk through leaving somebody at the end of the second discussion what would an r d program be that would meet the scope and the type of these challenges and then three is going to be like you want to know what it is go there",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6390.996,
    "end": 6391.176,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6391.256,
    "end": 6397.32,
    "text": "And I think for listeners, Daniel and I have been talking about, you know, there's a lot of material to unpack here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6397.38,
    "end": 6406.985,
    "text": "So I think we're going to have more than three videos, but we'll figure out what the dates will be for them so that we can go through the whole thing, you know, carefully.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6407.486,
    "end": 6407.786,
    "text": "Perfect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6408.926,
    "end": 6409.127,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6409.167,
    "end": 6411.968,
    "text": "So we'll end on slide 14 then.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6411.988,
    "end": 6418.592,
    "text": "And maybe to start, I would just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6424.974,
    "end": 6430.098,
    "text": " proposal for a new R&D program aimed at de novo development of new systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6432.08,
    "end": 6436.263,
    "text": "But other people might come up with another proposal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6436.364,
    "end": 6443.63,
    "text": "Like, you know, mine maybe is just one of many possible ways to go about the R&D program for new proposals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6444.07,
    "end": 6452.217,
    "text": "And I would welcome, I would hope even, that it would be fantastic if there were, you know, 20 projects happening around the world",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6453.015,
    "end": 6465.399,
    "text": " I've aimed at this same thing and that we, and that each of these projects was cooperating with each other so that we can learn from each other and, and move forward, you know, in the most efficient and useful, most useful way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6466.82,
    "end": 6480.264,
    "text": "So that's one of the reasons that I made this desert data list is like, what would be if other, if, if, if there's going to be multiple R and D programs, or even if it's just my, this, just this one that I put out,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6481.095,
    "end": 6506.288,
    "text": " know what what would be a good what what has to be included in the r d program you know what which which what should be there so that we would know that it's a you know like a reasonably complete one and so that we could we could compare r d programs so if i propose this one and someone else proposes another one we can compare say on number five uh number five develops new integrated systems that span all six of these major societal systems economic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6508.508,
    "end": 6530.747,
    "text": " if someone else proposes one that it's only focused on economic systems well there's a way to just distinguish between the two r d programs so that's uh that's that's part of my purpose here of laying this out and then it's also also the purpose that um you will see as you read the series that i i talk about each one of these so this is just in a sense it's a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6531.573,
    "end": 6534.635,
    "text": " It's a index to the larger series.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6535.075,
    "end": 6542.219,
    "text": "And also one point is that a scientist might say, you need to do A, B, and C to really study, you know, the mosquito's wing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6542.499,
    "end": 6545.921,
    "text": "And then of course they measure A, B, and C. So of course they solve the mosquito's wing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6546.301,
    "end": 6558.768,
    "text": "But actually you're laying out a protocol for evaluating policy across scales and then putting up almost like a retort to yourself, at least initially, that you believe could be held against this rubric.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6559.128,
    "end": 6579.39,
    "text": " like a report card and then again where a policy is better on 0.5 or 11 or whatever it be we can make that decision in a way or we can version the rubric so this isn't just setting the target or painting the target texas sharpshooter paint the target after you wrote the paper hypothesizing after the results are known harking this is like laying out where we do want it to go",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6580.327,
    "end": 6580.968,
    "text": " Right, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6581.468,
    "end": 6581.908,
    "text": "Exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6582.128,
    "end": 6589.774,
    "text": "And, and I hope that that we refined it together as a community refined this list so that we hone it better even.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6592.035,
    "end": 6598.3,
    "text": "Maybe there's some things I left out or some things I should have said, or things I said I didn't need to say who knows, but I'm sure it could be improved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6599.681,
    "end": 6605.765,
    "text": "So we don't have much time and I won't go I won't go into detail on these but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6606.189,
    "end": 6610.951,
    "text": " Maybe I'll just, just to give a flavor, I'll just talk about a few scattering here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6612.992,
    "end": 6622.617,
    "text": "So obviously, number one, if you're talking about an R&D program, it might help to actually provide some information about the scale of the intended effect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6622.677,
    "end": 6631.721,
    "text": "I mean, are we thinking that this R&D program is going to build new systems for one particular city or for a nation or for whatever?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6638.331,
    "end": 6639.432,
    "text": " if it's successful, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6639.612,
    "end": 6640.253,
    "text": "What is the scale?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6640.533,
    "end": 6641.194,
    "text": "And what are the costs?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6641.254,
    "end": 6641.814,
    "text": "What are the risks?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6642.175,
    "end": 6644.257,
    "text": "How much money is this whole thing gonna take?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6644.497,
    "end": 6649.281,
    "text": "And we'll talk about that, money we'll talk about in the next talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6651.243,
    "end": 6654.206,
    "text": "Based on second order science, which I've mentioned already,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6654.836,
    "end": 6656.896,
    "text": " Number three, it has a theory of change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6656.936,
    "end": 6662.998,
    "text": "Like, fine, you tested a new system, you built it, you get great computer simulation models, great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6663.438,
    "end": 6664.758,
    "text": "Now, what do we do with it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6665.098,
    "end": 6671.7,
    "text": "How would you ever take that idea and make it real, implement it in a real society somewhere?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6672.56,
    "end": 6673.52,
    "text": "How does that work?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6673.96,
    "end": 6676.52,
    "text": "And where is the blowback going to be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6676.56,
    "end": 6679.201,
    "text": "Where is the pressure going to be against it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6679.241,
    "end": 6680.021,
    "text": "What might go wrong?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6681.622,
    "end": 6683.822,
    "text": "So that should be in there, theory of change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6684.386,
    "end": 6711.964,
    "text": " Number five, it develops integrated, I claim that it's important that it develops integrated systems across all six of the major ones, because if it doesn't, if you build a governance system independent from an economic system and you're still using the old economic system, it's not gonna work very well, because they're gonna be at odds with each other, not integrated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6715.689,
    "end": 6717.91,
    "text": " Six describes the purpose of a siloed system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6717.93,
    "end": 6719.191,
    "text": "What in the world is this supposed to do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6719.251,
    "end": 6720.632,
    "text": "How do we know it even worked?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6720.732,
    "end": 6722.113,
    "text": "What have we measured fitness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6722.593,
    "end": 6728.557,
    "text": "What was it supposed to accomplish and how can we evaluate it on what it did accomplish or what it's supposed to?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6729.814,
    "end": 6754.542,
    "text": " um how does cognition play like in this whole series as well focused on societal cognition maybe some other ph maybe some other r d program doesn't even use the word cognition maybe they have an entirely different way to think about what a society is and how it does and what the purpose is so if so you know it'd be good to say so uh makes the work freely available to the public so that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6766.198,
    "end": 6771.361,
    "text": " It's not a proprietary project at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6771.501,
    "end": 6777.084,
    "text": "Number eight, it develops flexible options that the public can choose from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6777.564,
    "end": 6779.625,
    "text": "There is no one size fits all solution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6779.645,
    "end": 6781.266,
    "text": "I mean, that wouldn't be very wise at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6782.166,
    "end": 6786.208,
    "text": "Societies have to have flexibility in how they act, what they implement, what they choose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6787.329,
    "end": 6792.532,
    "text": "So hopefully the program would develop a smorgasbord of ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6793.237,
    "end": 6796.199,
    "text": " possibilities that could be useful in different settings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6799.842,
    "end": 6801.783,
    "text": "Number 11 addresses the cultural changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6801.823,
    "end": 6805.306,
    "text": "What kind of educational changes, for example, would be necessary to make this work?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6806.006,
    "end": 6809.589,
    "text": "There would be substantial ones, actually, because you build a new system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6809.609,
    "end": 6820.076,
    "text": "For one thing, you would have to explain or educate people on how the new system even goes together and how it works and how would you know if it's not working, you know, all those kinds of questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6823.082,
    "end": 6830.984,
    "text": " Number 12, if new systems are implemented in multiple locations, is that information shared between them?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6831.064,
    "end": 6832.344,
    "text": "How does that work?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6833.484,
    "end": 6845.286,
    "text": "Is each independent or are they communicating or is this all part of a larger plan to have multiple tests going on at the same time or are those just independent things that come and go as they do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6849.195,
    "end": 6854.517,
    "text": " Obviously, number 13, develop systems that are fair and just and that is reasonable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6856.137,
    "end": 6860.158,
    "text": "And number 14, what are the expected impacts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6860.258,
    "end": 6870.401,
    "text": "When you do simulations for this new system, how does it look for energy use and waste generation and climate change and biodiversity loss?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6871.021,
    "end": 6874.362,
    "text": "What are we going to get if we build these?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6874.402,
    "end": 6875.082,
    "text": "How is it going to go?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6875.102,
    "end": 6877.403,
    "text": "What is the likely outcome of these things?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6878.302,
    "end": 6886.611,
    "text": " So that's just a few ideas, a few topics that would be important to address in any R&D program, and I've tried my best to address them here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6886.731,
    "end": 6899.484,
    "text": "And even in just three papers, you know, like some of these are addressed in just a few sentences or a few paragraphs somewhere in the papers because, you know, you would really need a book, I think, or a series of books to really do a thorough job on all of these.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6900.114,
    "end": 6913.977,
    "text": " Well, you know what I kind of saw almost when you have this list is like a GitHub or a versioned open source repository where people can fork the rubrics they like, they can add more challenges, they can go into detail.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6913.997,
    "end": 6914.957,
    "text": "What do you mean by fair?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6915.317,
    "end": 6916.278,
    "text": "What do you mean that they're just?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6916.558,
    "end": 6920.639,
    "text": "Well, those are things that we actually inactive inference we can get down to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6921.039,
    "end": 6923.579,
    "text": "And that's not to say that we're going to be carving out the human.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6923.679,
    "end": 6926.32,
    "text": "It means that we're going to be designing for ourselves.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6927.02,
    "end": 6928.101,
    "text": " and for whoever's on board.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6928.262,
    "end": 6932.927,
    "text": "And just like the shipmakers make it for those who are on the ship, but the ship is part of society.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6933.487,
    "end": 6935.45,
    "text": "There's going to be a ship with sails.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6936.351,
    "end": 6941.196,
    "text": "So I think there'll be such interesting conversations because really you could...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6942.017,
    "end": 6946.478,
    "text": " fractal into yeah, seven, what is the role of information?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6946.638,
    "end": 6950.398,
    "text": "I mean, I went to a conference today on only a fragment of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6950.799,
    "end": 6955.599,
    "text": "So of course seven is going to be a big topic, but it's, it's, it's third order science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6956.1,
    "end": 6962.161,
    "text": "Well, you did with laying out the second order criticism paradigm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6963.101,
    "end": 6966.181,
    "text": "So it's quite interesting to read about and learn.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6966.941,
    "end": 6967.201,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6967.221,
    "end": 6970.022,
    "text": "You know, speaking of, uh, speaking of a repository,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6971.576,
    "end": 6977.5,
    "text": " At the very least, you need a language and a means of communications that you can convey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6977.88,
    "end": 6983.023,
    "text": "If I have an idea for new systems, I need to convey that to the rest of the world in some way to convey it to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6983.103,
    "end": 6986.124,
    "text": "Maybe you have your own idea of what a new system would look like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6986.164,
    "end": 6987.325,
    "text": "How do we convey that idea?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6987.445,
    "end": 6997.891,
    "text": "How do we convey a complicated idea to each other so that we know what each other is talking about, and then we can start to do tests on them or figure out which one works better in what situations?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7001.503,
    "end": 7022.594,
    "text": " a way to communicate a way to present the information so that we can understand what each other is saying just one kind of closing metaphor or at least thought that comes to mind is like let's say two people like a movie one person said i love the special effects the other one says the special effects were super cheesy i thought the story the other person says i didn't even i don't like movies but i like the book",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7023.214,
    "end": 7026.096,
    "text": " So everyone can like the movie, and the point is they're aligned on action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7026.196,
    "end": 7027.557,
    "text": "They might even want to hang out together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7027.597,
    "end": 7028.778,
    "text": "They might be part of a fan club.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7028.798,
    "end": 7031.099,
    "text": "They might have a product related to the movie.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7031.439,
    "end": 7040.726,
    "text": "But if the problem is framed as, okay, come to consensus on why you like this movie, we cannot personalize the solution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7041.506,
    "end": 7047.19,
    "text": "So everybody can have a different understanding of why they like the movie that's playing out in front of our eyes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7047.93,
    "end": 7051.473,
    "text": "And if it's about which part of this movie do you like or not like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7052.253,
    "end": 7053.714,
    "text": " we're going to be arguing a lot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7054.335,
    "end": 7056.436,
    "text": "And if it's like, which movies should we watch?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7057.397,
    "end": 7062.001,
    "text": "Potentially that's a different question or how should we reduce uncertainty about the movie that we should watch?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7062.521,
    "end": 7065.944,
    "text": "There's a lot of ways to frame it that I would hope would be new.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7066.965,
    "end": 7067.665,
    "text": "Yeah, I think so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7067.925,
    "end": 7068.386,
    "text": "I think so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7068.526,
    "end": 7069.847,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7071.528,
    "end": 7071.728,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7071.768,
    "end": 7075.511,
    "text": "Maybe we should leave it there and we'll pick up more next time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7079.134,
    "end": 7080.955,
    "text": "John, thanks so much again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7082.253,
    "end": 7086.014,
    "text": " I'm going to just re-upload this video in case there's any weirdness with the live stream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7086.034,
    "end": 7097.276,
    "text": "So it'll be high quality and just we'll be in touch about planning these upcoming sessions, but we will know that we will meet next week on April 20th at 3 p.m.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7097.797,
    "end": 7104.018,
    "text": "Pacific PDT for the third session of N of bleep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7104.878,
    "end": 7105.178,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7105.258,
    "end": 7105.678,
    "text": "Sounds good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7105.818,
    "end": 7106.539,
    "text": "See you later, John.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7106.759,
    "end": 7107.019,
    "text": "Peace.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7107.259,
    "end": 7107.499,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7107.739,
    "end": 7107.939,
    "text": "Bye.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7108.059,
    "end": 7108.239,
    "text": "Bye.",
    "speaker": "SPEAKER_02"
  }
]