[
  {
    "start": 2.123,
    "end": 28.924,
    "text": " All right greetings thank you everyone for joining we're in our second discussion on chapter four let's just jump to it um anyone can write a question in the chat or raise their hand or just like unmute and go for it and it could be like anything you remember from the chapter or like a part you liked or were curious about or just any any question that you want to jump in with",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 42.185,
    "end": 60.227,
    "text": " like any any section that people prefer just on immune just any page any section oh Aaron go for it so all um I I was really scratching my head trying to compare figure four four with figure four six um there's like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 62.266,
    "end": 66.334,
    "text": " a very large amount of overlap between the two sets of diagrams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 66.815,
    "end": 72.225,
    "text": "But there's like some very so I feel like there was like a clear parallel set up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 73.527,
    "end": 75.21,
    "text": "There are some edges that are different between the two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 75.371,
    "end": 79.819,
    "text": "And I was like trying to understand, like, what are those changes mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 79.799,
    "end": 91.593,
    "text": " And in both cases, I think especially the left-hand side diagram is virtually identical between 4.4 and 4.6.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 91.613,
    "end": 93.935,
    "text": "I think I have the numbering right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 95.617,
    "end": 106.65,
    "text": "But yeah, I don't know if that's too much to fit into a question, but I thought the difference there must be meaningful, but I couldn't make sense of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 107.727,
    "end": 121.517,
    "text": " it's a great question like for sure on first pass it's like two cities like maybe there's some differences in which roads and what's connected to what but at a first pass like they are both very very similar um so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 122.932,
    "end": 124.896,
    "text": " A few things are being shown here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 126.458,
    "end": 131.127,
    "text": "To kind of give context on this question, let's pull back to figure 4-3.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 132.229,
    "end": 138.46,
    "text": "So here we see this kind of like Rosetta Stone figure with a Bayesian graph.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 138.44,
    "end": 165.088,
    "text": " for the discrete time model and a bayesian graph for the continuous time model on the bottom they're kind of being like laid out like this to emphasize their structural similarity even though they're treating time differently which we can return to but the top is treating variables in terms of discrete sequences of events whereas the continuous time is treating it in terms of higher and higher derivatives of a given um variable x",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 165.642,
    "end": 178.628,
    "text": " The important thing, though, that makes these similar, other than their structure, is that in a Bayes graph, you have edges are variables, and then the nodes are variables, and the edges are causal connections.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 180.151,
    "end": 184.9,
    "text": "Okay, so now we get to a Bayesian message passing scheme.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 185.251,
    "end": 199.424,
    "text": " So one of the really cool things about a Bayes graph is because the edges represent the sparsity of causal connections in the model, you only need to consider edges that are local to a node.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 199.845,
    "end": 205.33,
    "text": "So it's like the traffic at a node is strictly and entirely defined by the edges leading in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 206.992,
    "end": 211.596,
    "text": "So when constructing a given Bayesian model,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 212.285,
    "end": 220.152,
    "text": " you specify the kind of causal architecture of the world, and then messages are passed between the variables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 220.317,
    "end": 236.999,
    "text": " So this is going to be a slightly different base graph than the figure 4.3, but it's going to emphasize how certain kinds of architectures pass certain messages to each other, and then how that enables different kinds of computations to happen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 237.56,
    "end": 239.783,
    "text": "Like there's a difference variable here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 239.843,
    "end": 244.249,
    "text": "So like right off the bat, even though we see some variables that were...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 244.229,
    "end": 271.587,
    "text": " in figure 4.3 like pi and s there's also different variables like the um epsilon and the the item um okay so two things are being highlighted in this figure 4.4 on the left is going to be about hierarchy and nesting on the right is going to be about unfolding dynamics through time",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 271.988,
    "end": 282.358,
    "text": " So the motif on the left that describes the nesting is going to be like each unit of four is kind of like a level in a nested hierarchical model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 283.339,
    "end": 289.185,
    "text": "And basically what's happening is the E is calculating an error, like epsilon for error.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 289.866,
    "end": 297.473,
    "text": "And then those errors are being passed up to a higher order in the graphs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 297.453,
    "end": 314.871,
    "text": " so that is like a kind of classical predictive processing architecture we have strictly stacked levels and then what's happening within each level is it's doing a differencing and then passing the errors up that's the hierarchical motif",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 315.914,
    "end": 328.236,
    "text": " the dynamical motif is going through time so this one actually has more similarity to the discrete time in 4.3 and here it's kind of like a predictive processing but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 328.705,
    "end": 357.987,
    "text": " emphasizing the dynamics here's the sequence of observations coming in current time step the future time step past time step and then each of those observations are kind of meeting in the middle and calculating an epsilon based upon the collision of the incoming observation and then the hidden state prediction so like the epsilon would be zero if the hidden state prediction was exactly what the observation was and then those are getting passed on up",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 359.452,
    "end": 389.155,
    "text": " um okay then 4.6 here the only difference is that the again the very similar shapes with like the motif of four and the passing up but now we're in the continuous time setting so that's why there's um more variables like we see in the continuous time world um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 391.818,
    "end": 411.801,
    "text": " and now rather than representing the past present and future time step just like the top here past present and future time step in 4.6 now they are representing different orders of the generalized coordinates of motion",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 412.051,
    "end": 414.895,
    "text": " So the first, the second, and the third derivatives.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 415.656,
    "end": 429.476,
    "text": "So 4.4 and 4.6 are kind of like transposed from figure 4.3, the top and the bottom, but now it's representing each of those halves in terms of the message passing that it reflects computationally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 432.099,
    "end": 436.426,
    "text": "So what's cool about it is it shows, again, a deeper similarity between these two kinds of models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 436.646,
    "end": 441.653,
    "text": "What's kind of challenging about it is it's introducing new notation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 441.953,
    "end": 444.738,
    "text": " and it's not exactly the same model as before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 460.445,
    "end": 463.35,
    "text": "Any thoughts on that or more on that question?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 463.45,
    "end": 465.413,
    "text": "Or it could be a different question that anyone has?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 486.773,
    "end": 488.598,
    "text": " We can go to any any part of four.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 488.658,
    "end": 496.076,
    "text": "Or like any any can just anyone can just unmute and go for it or write in the chat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 496.417,
    "end": 497.239,
    "text": "Yes, TCC.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 513.149,
    "end": 540.051,
    "text": " it's kind of like parallax in vision like chapter four is presenting the generative models of active influence so in terms of where we are in the textbook like chapter one introduced it chapter one two and three approached active inference from the low road and the high road and then chapter four is like actually the kernel of active inference and then the discrete and the continuous time are going to be unpacked more in chapter seven",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 540.284,
    "end": 566.325,
    "text": " the discrete and chapter eight for the continuous time however here they're being really like tightly juxtaposed and interwoven again that speaks to a really deep point which is that time can be handled either in discrete or continuous fashion in active inference that's cool deep point what's challenging is that even when they're discussing similar",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 566.491,
    "end": 587.368,
    "text": " kind of cognitive functionalities the notation is very different between the two forms it would be confusing in a different way if the exact same notation was used because it wouldn't be clear whether we were talking about the discrete or the continuous time however this is kind of like a second set of vocabulary",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 589.677,
    "end": 618.182,
    "text": " we couldn't use exactly the same because some of the variables are slightly different but like using y for observations in the continuous time and then using o for observations in discrete time that's just how they do it in this chapter so it's kind of like they're introducing both time treatments",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 619.04,
    "end": 647.815,
    "text": " and emphasizing again and again and again that both of these are like two flavors and then they are going to revisit it in the dedicated chapter seven and chapter eight but it's kind of like a double-barreled chapter because they're introducing generative model not in terms of like well here's a simpler generative model now we're going to go to more complex they're introducing like a dual stream like the two simplest forms",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 655.878,
    "end": 661.382,
    "text": " But anyone can just unmute and go for it, or we can look at the chapter four questions or whatever people prefer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 669.918,
    "end": 671.821,
    "text": " Okay, if no one else has, I'll go again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 671.861,
    "end": 678.73,
    "text": "I'm confused also about the structure of policy variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 679.471,
    "end": 688.843,
    "text": "Like, okay, so like a hidden state, an observed state, whatever, like I can like sort of acknowledge those as sort of like things that exist in like some not fully specified space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 690.065,
    "end": 695.572,
    "text": "Policy, especially because I think it's like trying to call back to reinforcement learning literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 696.013,
    "end": 699.317,
    "text": "Like, I feel like in some...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 699.567,
    "end": 701.31,
    "text": " What's the type of that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 701.33,
    "end": 717.2,
    "text": "If you were to describe the space in which a policy, either the discrete version, the pi, or the continuous version, the v, what that lives in, or if you were to implement it in a program, what the type associated with that is?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 717.461,
    "end": 718.723,
    "text": "What's its shape?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 718.703,
    "end": 719.424,
    "text": " Great question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 720.005,
    "end": 722.95,
    "text": "Pi is a list of all policies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 723.37,
    "end": 727.256,
    "text": "So it's always a vector and it always sums up to one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 727.897,
    "end": 732.625,
    "text": "And that's really the critical move that allows us to talk about the likelihood of a policy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 733.426,
    "end": 744.423,
    "text": "That's why habit is the prior on policy and then expected free energy updates are prior on policy into a posterior because the shape of that variable is a list that sums to one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 744.643,
    "end": 746.466,
    "text": "So it's a probability distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 746.902,
    "end": 751.599,
    "text": " So affordances are the actions that can be taken in a moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 752.342,
    "end": 757.34,
    "text": "So if we're like in a grid world, the affordances will be like up, down, left, right, stay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 758.023,
    "end": 758.886,
    "text": "So it'll be like five.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 760.385,
    "end": 771.258,
    "text": " Then if we're only a single time step agents, affordances are the same as policy space because we're only selecting the next action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 771.839,
    "end": 773.321,
    "text": "So let's say we have five options.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 773.922,
    "end": 778.648,
    "text": "If we had an even prior across those five, it'd be like 0.2, 0.2, 0.2, 0.2.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 778.868,
    "end": 784.755,
    "text": "And then that could be sampled from or updated into a policy posterior action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 785.562,
    "end": 795.354,
    "text": " If we're talking about an agent that does planning, then the shape of pie is affordances raised to the power of the time steps.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 796.295,
    "end": 802.163,
    "text": "So if we have five affordances and then we're doing two time steps, then pie is 25 long.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 802.763,
    "end": 804.706,
    "text": "It's up, up, up, down, upright.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 804.746,
    "end": 808.11,
    "text": "And so it's all of the two way combinations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 808.293,
    "end": 815.087,
    "text": " So that's the kind of exponential explosion with policy planning, which we can come back to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 815.207,
    "end": 820.979,
    "text": "But at a first pass, the important things about PI are that it's a list.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 820.999,
    "end": 824.907,
    "text": "It sums to one, which is what makes it a probability distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 825.728,
    "end": 829.997,
    "text": "And it's a distribution over policies that the agent is selecting from.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 832.728,
    "end": 856.845,
    "text": " just just to clarify or check my understanding so um then whenever we see like uh v with the tilde representing a trajectory over policies like that is maybe should be regarded as something that's like because it's exponential and like uh unbounded number of steps is like not something that we should consider like concretely representable in a program",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 859.255,
    "end": 887.659,
    "text": " interesting so the the continuous time setting doesn't do explicit planning it does so the the pew mdp at the top here this is where we have the kind of classical computer science exponential tree search like more and more discrete combinations you know if you had five time steps deep you'd have five to the fifth discrete options it's kind of like a chess algorithm",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 887.943,
    "end": 917.157,
    "text": " um in the continuous time setting planning is not explicit like let's just say that we had some wild function that we were trying to approximate when doing this kind of a taylor series approximation like evaluate the function at zero and then take the first derivative so let's just say we stopped there we're just going to evaluate the function and then look at the local slope that already expands to everywhere",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 918.132,
    "end": 926.161,
    "text": " That doesn't mean it's going to be accurate everywhere, but basically the Taylor series does expand no matter how many levels deep you go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 926.201,
    "end": 932.868,
    "text": "It already implicitly includes basically infinite future planning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 935.13,
    "end": 941.497,
    "text": "But for explicit planning in a tree like setting, that's where the discrete time comes into play.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 947.003,
    "end": 948.004,
    "text": "In, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 949.739,
    "end": 978.48,
    "text": " in this page um thomas parr's discussion so early implementations were in the continuous state space because this has the most similarity with like bayesian filtering approaches then people started wondering well how do we get sequential dynamics then they moved into this kind of coupled dynamical systems space",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 978.612,
    "end": 983.838,
    "text": " but then that was only getting so far because there wasn't an explicit representation of planning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 986.261,
    "end": 989.666,
    "text": "Then they moved into the discrete planning environments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 991.708,
    "end": 1001.38,
    "text": "Those branches kind of came back together by nesting the continuous dynamics at the lower level with the discrete dynamics at a higher level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1002.201,
    "end": 1006.206,
    "text": "So you could do a lot of work in the continuous space,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1006.996,
    "end": 1014.969,
    "text": " And then also have that like wrapped by a discrete planning step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1014.989,
    "end": 1017.753,
    "text": "That's like a little bit about how the timeline worked.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1018.274,
    "end": 1024.604,
    "text": "But just to summarize, in the discrete setting, this is the most like classical planning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1025.806,
    "end": 1029.492,
    "text": "In the continuous setting, you don't have planning as such.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1030.674,
    "end": 1032.717,
    "text": "It's kind of like you have a car going around a turn.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1033.372,
    "end": 1040.142,
    "text": " In the discrete time world, it's trying to estimate all the branching paths it could take.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1041.424,
    "end": 1046.411,
    "text": "In the continuous time world, the driver's like, I'm turning 20 degrees to the left.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1047.833,
    "end": 1050.456,
    "text": "That's like the first derivative of my turning angle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1050.476,
    "end": 1051.778,
    "text": "And then I'm just, I'm holding to that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1052.86,
    "end": 1054.042,
    "text": "And then that curve continues.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1054.682,
    "end": 1059.97,
    "text": "So it's not explicitly saying at seven time steps from now, here's where I expect to be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1060.827,
    "end": 1063.171,
    "text": " So it's the strength and the weakness of the discrete time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1064.454,
    "end": 1069.664,
    "text": "The weakness is that there's an exponential explosion of the tree, just like a chess algorithm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1070.445,
    "end": 1082.869,
    "text": "But the strength is that you can actually talk about the difference between up, up, up, up, up, down, and up, up, up, up, up, right, which you couldn't really get except by going super deep in the continuous space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1086.359,
    "end": 1099.98,
    "text": " So they both have these kind of like strengths and weaknesses, and then that is resolved or addressed by building hierarchical nested models that have components that have continuous treatment of time and components with discrete times.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1116.785,
    "end": 1118.487,
    "text": " Good call.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1118.608,
    "end": 1119.028,
    "text": "Let's see.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1119.97,
    "end": 1125.117,
    "text": "In page 73.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1129.183,
    "end": 1132.447,
    "text": "Yes, someone else has already added this, but yes, good call.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1133.088,
    "end": 1135.652,
    "text": "There's several typos in the book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1139.918,
    "end": 1140.058,
    "text": "Thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1145.827,
    "end": 1175.04,
    "text": " we can go to any of the written questions or like just any any remark about anything that we've gotten up to or just like anything anything active related we could totally go for it because chapter four is just it's kind of like the heart of active inference um albeit described in a very um notational way",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1186.512,
    "end": 1188.054,
    "text": " David or anyone go for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1189.656,
    "end": 1201.853,
    "text": "Yeah, I was just wondering if there's any relationship to the partial gamma function in regards to how the branching seems to work and fit backwards.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1202.054,
    "end": 1210.225,
    "text": "Like if you're mapping back up through the stack of the decision tree that maps back to the initial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1210.205,
    "end": 1222.025,
    "text": " I just didn't see any of the math there in the chapter, but I've seen some correlation in some of the math that I've been working on recently.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1222.085,
    "end": 1227.775,
    "text": "So if you go further down, there's a section on branching.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1234.37,
    "end": 1263.988,
    "text": " and the relation yeah so behavior near branch point and the relation between the branches so i was just wondering if um if that fits in or if my intuition on the the correlation is incorrect there it's an interesting connection i don't know about like this analytic family but a few thoughts are inactive inference we're treating every moment as a branch point so that is the control",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1264.475,
    "end": 1290.516,
    "text": " decision slash question is the branch point is defined by the affordances that can be taken at that point and so there's some um you know there's some kayaking down the river where no matter which way you branch it's like you're going to get kind of brought back in so like the long-term consequences don't matter but then there's other moments where to to go a little bit one way or the other is going to diverge",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1291.947,
    "end": 1296.795,
    "text": " So that is kind of like you have the agents on the kayak and they have the behavioral branch point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1297.416,
    "end": 1306.372,
    "text": "But of course, just knowing that they can tilt left or right doesn't tell you about like the river, which is kind of like the actual process unfolding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1307.574,
    "end": 1315.187,
    "text": "So I'm not sure exactly how that would connect, but the function is a branch point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1320.01,
    "end": 1329.683,
    "text": " another another possible connection there is like in this chapter we're seeing like the basic kernel like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1329.747,
    "end": 1355.248,
    "text": " the minimal essential model that describes um either you know in either these time treatments but then there's all kinds of other cognitive functionalities like what's known as sophisticated active inference is where in the moment you're not just planning um or trying to estimate like what will i be doing and what will i see but you can also",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1356.14,
    "end": 1380.004,
    "text": " project out what will I be thinking then about the past so again that explodes the state space even further but it allows for like sort of prospective retrospective but that that kind of phenomena is not here but it's like a modification on this base model",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1381.132,
    "end": 1388.602,
    "text": " Yeah, I guess I was seeing it more in terms of the primes and the double primes on the bottom set.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1388.842,
    "end": 1400.017,
    "text": "And maybe that was just my miscorrelation of just misreading the terminology as it's represented for the lower states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1400.037,
    "end": 1404.243,
    "text": "So you see Y prime and then Y double prime there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1405.905,
    "end": 1409.029,
    "text": "That's the first derivative and the second derivative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1411.692,
    "end": 1412.033,
    "text": " Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1412.053,
    "end": 1426.414,
    "text": "But in order to move back, like if you were, if you were collapsing back into the initial kernel stage, wouldn't it have to still step through those premises in that order?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1426.895,
    "end": 1429.819,
    "text": "Or would it all collapse at the same exact time?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1432.28,
    "end": 1440.453,
    "text": " Matt Bolian- Again there's a lot to this question, I mean what i'll say is the role that three plays here the B matrix kind of conventionally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1441.014,
    "end": 1453.555,
    "text": "Matt Bolian- This is a transition operator that's describing how things change from time step to time step, whereas the three operator in the continuous setting is describing as we go to the right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1454.737,
    "end": 1457.882,
    "text": "Matt Bolian- The derivative and as we go to the left the integral.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1458.183,
    "end": 1463.31,
    "text": " So like you said, you have to walk back through the premises step by step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1464.192,
    "end": 1469.119,
    "text": "From 10 time steps forward, you can go 10, 9, 8, 7, let's just say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1469.74,
    "end": 1472.524,
    "text": "But you can't skip from 10 to 8.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1473.885,
    "end": 1477.531,
    "text": "At the very least, you would need a different transition operator to apply backwards.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1478.272,
    "end": 1482.638,
    "text": "Similarly, you might be able to go from x double prime",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1482.905,
    "end": 1509.942,
    "text": " take the integral and then take the integral again but you couldn't take a double integral in one jump that wouldn't be the same as these integrals okay but it's kind of like yeah there's other ways to take it like the computational irreducibility angle which is like there might be a shortcut to just apply the double integral in one step",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1510.647,
    "end": 1514.012,
    "text": " But then there's also probably equations that you can't apply a double integral.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1516.616,
    "end": 1527.492,
    "text": "And in a way, by doing a double integral in one step, you've just made a single, or by going two time steps backwards here, you've just taken one of a different kind of step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1528.501,
    "end": 1541.66,
    "text": " Okay yeah cuz I ran into something recently that resolved into a five integral and that's where I got confused as to how that was even possible and i'm still trying to to work through the math a little bit to understand.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1544.444,
    "end": 1548.45,
    "text": "But that's kind of out of the scope, so I don't want to take too much time out of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1552.852,
    "end": 1576.935,
    "text": " if you're looking at something that's that's a really long sequence you might be able to have statistical power to talk about like the fifth derivative but you could simulate trajectories and then just plot the first derivative plot the second one plot and so on and then you'll just find that maybe there's interesting Dynamics of higher orders or maybe not",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1577.692,
    "end": 1581.136,
    "text": " And then the empirical way that you could ask, like, how important are they?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1581.177,
    "end": 1591.65,
    "text": "Okay, so we make a real simulation that has five actual derivatives of influence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1591.67,
    "end": 1597.398,
    "text": "And then we make a subset models that have all five that should be able to recover 100% of the variance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1598.099,
    "end": 1600.141,
    "text": "And then you test the one with four, three, two, one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1601.062,
    "end": 1605.729,
    "text": "And there's situations where even if there's really five, the first derivative covers 99% of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1606.409,
    "end": 1607.631,
    "text": "Or there might be ones where",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1607.915,
    "end": 1609.384,
    "text": " The higher derivatives do matter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1612.283,
    "end": 1612.947,
    "text": "Okay, thanks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1640.382,
    "end": 1668.246,
    "text": " here just just again just to connect it here's just evaluating the point so to say that you know this is the this is like the true sea levels for the next 24 hours or this is the real temperature in the room so it's like if you can only have one number the best thing you can do is just say what is the temperature right now and that's this kind of first approximation and then if you were to have a second number you could say okay what's the temperature in the room and then what's the slope",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1669.34,
    "end": 1675.97,
    "text": " And then if you had another number, you could say, okay, what's the temperature right now and the slope and how fast it's changing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1677.011,
    "end": 1681.618,
    "text": "And so that process is the Taylor series expansion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1683.28,
    "end": 1698.182,
    "text": "So that's the kind of way that they talk about it in approximating functions is you can keep on adding more and more approximating terms, but it can get unwieldy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1699.58,
    "end": 1724.592,
    "text": " and you still get and yeah there's other things to say but this but I guess I'll just say this dash line does go off to Infinity like you could evaluate that dash line at this point but it'd be like way way way down and then like one of the issues with using the um Taylor series is you don't know how good or how bad the dash line is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1725.871,
    "end": 1732.821,
    "text": " Rupert Clayton, Except by then doing the laborious work of checking against the actual function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1732.841,
    "end": 1745.019,
    "text": "Rupert Clayton, So, like here it's like it actually is doing really well but it's not telling you it's doing well, you would just find out by checking but then over here it's going to be doing certainly bad but it's not like it's going to throw up a yellow flag and tell you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1745.059,
    "end": 1746.141,
    "text": "Rupert Clayton, um.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1747.319,
    "end": 1770.31,
    "text": " I guess my question in terms of that dotted line trending to infinity is, is that assumptive or is that, you know, provable in the sense that we just can't see past a certain state because it's, you know, a hidden state or is it calculable past that hidden state that it is going to be infinite?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1771.451,
    "end": 1775.757,
    "text": "The dashed line is very well behaved because it's a polynomial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1775.922,
    "end": 1781.509,
    "text": " It is this polynomial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1781.529,
    "end": 1783.892,
    "text": "Here's the first order polynomial, just a constant.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1785.114,
    "end": 1787.096,
    "text": "Here's the second order.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1787.236,
    "end": 1790.661,
    "text": "It's a linear y equals mx plus b, basically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1791.522,
    "end": 1793.685,
    "text": "mx plus b intercept.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1794.826,
    "end": 1797.469,
    "text": "Now we're in the quadratic polynomial setting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1798.19,
    "end": 1804.258,
    "text": "So it has all the kind of simple behavior of polynomials.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1804.778,
    "end": 1810.203,
    "text": " which is what makes it a well-behaved approximator for arbitrarily unruly functions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1813.987,
    "end": 1815.569,
    "text": "But it doesn't tell you how good it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1819.052,
    "end": 1821.775,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1821.795,
    "end": 1830.904,
    "text": "Also just note, like, on the pragmatic side, PyMDP, the Python Active Inference Toolkit, is only in discrete time at this point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1831.863,
    "end": 1839.191,
    "text": " Brett KenCairn, So a lot of to translate some of it over to because i'm starting to work a little bit with kiss kit or i'm trying to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1839.471,
    "end": 1846.179,
    "text": "Brett KenCairn, To understand to try and you know use some of the functions there with quantum gates but that's a little bit beyond.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1846.559,
    "end": 1854.988,
    "text": "Brett KenCairn, To try and utilize that as a tool so i'm trying to put it together a little bit and then I just got a little bit confused over the last few days, putting some things together so.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1855.188,
    "end": 1858.172,
    "text": "Brett KenCairn, i'll keep looking at it appreciate it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1859.673,
    "end": 1860.334,
    "text": "Brett KenCairn, Oh all good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1862.474,
    "end": 1877.392,
    "text": " Okay, anyone else just unmute and go for it or feel free to type of question, or we can look at the upvoted questions here or any question that was written in the chapter six or cohort six questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1882.679,
    "end": 1883.52,
    "text": "Okay, not specific.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1916.018,
    "end": 1920.704,
    "text": " I think it's worth to kind of pull back a step and look at figure 4.2.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1922.186,
    "end": 1934.503,
    "text": "Figure 4.2 is really helpful because it kind of builds intuition for what these Bayes graphs are in terms of like, here's a situation on top left with one hidden state and one observable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1935.565,
    "end": 1938.228,
    "text": "Like there's a real temperature in the room and then there's a thermometer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1939.189,
    "end": 1943.275,
    "text": "Here's the situation with one hidden state and two observables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1943.795,
    "end": 1967.71,
    "text": " here's a situation with two contributing factors and one observable like two things that contribute to a disease prevalence and here's a chain of causation so these are like these are the kinds of things people say like there was traffic because it was a sports game and a Friday night it's like okay that's this situation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1970.997,
    "end": 1993.545,
    "text": " or it was a Friday night so there was a sports game so there was traffic but those are the kinds of things that people talk about when they use language to describe causal sequences in the world and then these variables can be like anything like the observable could be any modality of observation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1994.69,
    "end": 2023.077,
    "text": " then the hidden states can be any latent causal factor including things that don't like actually exist in the world like without arguing too much about whether temperature actually exists in the world you can have latent causes that are just totally proposed for better and for worse but this maps onto like a huge fraction",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2023.343,
    "end": 2034.012,
    "text": " of the kind of statistical inferences that are done.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2038.143,
    "end": 2061.045,
    "text": " this also is kind of like if if we had like a mind map and we were just like drawing out causal factors for what we cared about like this is kind of intuitively how you would do it like if one thing was causing multiple outcomes you'd draw it like this if there was multiple things contributing to cause an observation you could draw it like that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2062.342,
    "end": 2088.855,
    "text": " so this is kind of like where we touch with more intuitive notions of cause and then that is going to get deployed in this setting where we're talking about the causal relationships between observations hidden states and actions those are the big players here and that's being unfolded through time",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2090.27,
    "end": 2104.949,
    "text": " But those are the things that we want to connect in our unified model of perception, cognition, and action is to a first approximation, perception, cognition about hidden states and action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2106.551,
    "end": 2110.736,
    "text": "That's why those are like the major nodes in the white circles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2115.542,
    "end": 2118.606,
    "text": "Has someone tried to implement this for like motor control?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2120.797,
    "end": 2145.572,
    "text": " yes um motor control has been approached from the human motor control perspective like handwriting and movement of the arm and things like that and also the robotic motor control setting at the kind of gross level like where to move within the warehouse and at the finer scale like robotic arms and things like that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2148.657,
    "end": 2152.16,
    "text": " Dan, wasn't that related to what the Hitachi group covered?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2154.523,
    "end": 2156.985,
    "text": "I just thought that might be a good video to point to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2157.025,
    "end": 2169.477,
    "text": "Yeah, good call.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2169.717,
    "end": 2169.958,
    "text": "Thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2170.018,
    "end": 2173.121,
    "text": "That was guest stream 75.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2174.902,
    "end": 2177.685,
    "text": "So here was a robotics video.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2178.29,
    "end": 2202.103,
    "text": " in silico so it was not physical robots it was a simulation of robots but but this is um a group that's working with physical robots and then they um the visualizations that they show in the in the stream were pretty interesting and provocative I think in the sense like it it um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2203.805,
    "end": 2210.231,
    "text": " it shows how multi-agents and also how social norms come into play.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2212.294,
    "end": 2216.398,
    "text": "So here we have basically the red agent is the active inference agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2217.459,
    "end": 2221.383,
    "text": "And then it's gonna be like coming on the opposite direction of the sidewalk.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2222.344,
    "end": 2224.146,
    "text": "Here, it's an altruistic other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2224.546,
    "end": 2230.572,
    "text": "So the green one has the goal of making the red one go as little out of the way as possible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2231.378,
    "end": 2239.629,
    "text": " Ricks, Whereas the selfish green one is trying to minimize its path.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2239.649,
    "end": 2251.986,
    "text": "Ricks, So those are kind of ways in which people implement like even these kind of social heuristics into the preference distributions and the action tendencies of different agents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2255.341,
    "end": 2259.145,
    "text": " And that's kind of the journey that chapter six takes us on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2259.165,
    "end": 2270.619,
    "text": "So that's kind of why the book can be read in many orders, because as it's written linearly, the first five chapters are like a ton of information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2270.639,
    "end": 2271.92,
    "text": "That's the epistemic component.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2272.001,
    "end": 2279.549,
    "text": "And then the second half of the book, starting with chapter six, is like, well, here's the recipe for building the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2280.23,
    "end": 2281.512,
    "text": "Like, what are we modeling?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2281.572,
    "end": 2282.313,
    "text": "Why are we doing it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2283.234,
    "end": 2284.335,
    "text": "What form...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2284.957,
    "end": 2314.677,
    "text": " should we use figure 4.3 so just the way the textbook is written it kind of shows us a lot of the tools in the workshop and then we get the recipe in chapter six but another way to do it and of course if you go through many times then it doesn't really matter as much where you began but another way to to go about it is start with the system of interest like a system that you're familiar with or curious about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2315.298,
    "end": 2337.728,
    "text": " and then start to reverse engineer like what are the observations here like who's observing what i mean i could explore even in his starbucks like who's observing what what are the actions that different agents are taking what preference distributions do they have you know some people want this level of sweetness or this um kind of coffee",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2338.096,
    "end": 2359.881,
    "text": " So that's like the kind of low road approach is starting more with an actual system and then building up to what formalisms come into play rather than like learning all the math equations and then just hoping that something like crystallizes out of nothing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2363.645,
    "end": 2364.646,
    "text": "Thank you, Cheryl.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2364.887,
    "end": 2366.989,
    "text": "I'm going to bring this in and let's look at it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2386.055,
    "end": 2415.741,
    "text": " awesome yeah these are great points um like well you know the the brain is a system of systems so like if we here this could be like this is like our let's just say this is our portfolio of models i mean",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2416.21,
    "end": 2421.818,
    "text": " the brain entertains multiple causal hypotheses about events.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2424.062,
    "end": 2425.824,
    "text": "So it is a system of systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2426.766,
    "end": 2429.169,
    "text": "And these are, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2430.131,
    "end": 2431.533,
    "text": "Go ahead.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2431.553,
    "end": 2435.679,
    "text": "I guess I meant it's not a system of just internal systems.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2436.44,
    "end": 2439.845,
    "text": "And that's where I get mixed up.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2440.106,
    "end": 2444.412,
    "text": "I mean, it's the whole of it, the whole experience in the world.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2444.729,
    "end": 2446.351,
    "text": " We are not just brains.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2446.712,
    "end": 2447.933,
    "text": "We are in ecosystems.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2448.013,
    "end": 2449.635,
    "text": "We're in social systems.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2449.756,
    "end": 2451.638,
    "text": "We're in, you know what I'm saying?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2453.541,
    "end": 2453.841,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2455.804,
    "end": 2460.009,
    "text": "It's like, it's such a great and essential point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2460.49,
    "end": 2472.205,
    "text": "That's why we focus so much on the action perception loop, which initially seems kind of esoteric, but then we start to see that like all agents around us are involved in it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2472.404,
    "end": 2501.145,
    "text": " then the only way to account for that kind of like dynamic co-creation with the environment and the agent is to think about the interface every time step like if you're on a run or if you're driving you can't just focus on well just ignore the perception for the next time steps or just ignore the actions for the next time steps like action and perception are always happening the agent can't opt out of those happening",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2502.138,
    "end": 2505.201,
    "text": " And so it is a joint entanglement with the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2506.983,
    "end": 2514.65,
    "text": "And that's like, that's exactly what has to be kind of modeled to have a holistic model of even just a rat in a team.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2517.052,
    "end": 2517.573,
    "text": "Correct.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2518.674,
    "end": 2519.254,
    "text": "So you're right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2519.455,
    "end": 2519.895,
    "text": "I like it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2520.155,
    "end": 2528.263,
    "text": "I like the systems in systems within systems model, but we can only work with what we can work with at a time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2528.53,
    "end": 2539.881,
    "text": " That does infer a certain amount of reductionism, though, as if I understand it at this level, I will understand it at the more, at the larger level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2539.921,
    "end": 2544.193,
    "text": "So that's an assumption that we bring to this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2546.57,
    "end": 2554.604,
    "text": " Yeah, again, you know, there's no single order for going through active inference, but figure 9.1 kind of captures that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2554.624,
    "end": 2558.271,
    "text": "Like here in the center is the top of figure 4.3.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2558.752,
    "end": 2560.415,
    "text": "So this is the rat in the teammates.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2561.256,
    "end": 2563.38,
    "text": "That's the subject of our study.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2564.103,
    "end": 2592.203,
    "text": " here's the scientists in the lab so what we choose to present as stimuli are observations for the rat but they were choices by us and then the choices of the rat become observations for us and so you could close your analysis here and say well it's just a rat in a laboratory or you could model the building around the laboratory and you could ask like how does that context matter",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2592.402,
    "end": 2600.276,
    "text": " And then you could ask, well, how confident are we that the rat behavior in the lab is like it is in the fields?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2602.66,
    "end": 2605.946,
    "text": "There's laboratory setups that it probably transfers and there's ones where it doesn't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2606.847,
    "end": 2612.337,
    "text": "But just making the model of the rat behavior in the lab does not guarantee transfer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2614.4,
    "end": 2617.566,
    "text": "And that's why the system of systems is so important.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2621.073,
    "end": 2621.634,
    "text": " Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2622.034,
    "end": 2622.315,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2622.335,
    "end": 2622.835,
    "text": "I love that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2623.076,
    "end": 2624.217,
    "text": "But I'm not in chapter nine.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2624.558,
    "end": 2625.899,
    "text": "Metabazine inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2625.959,
    "end": 2626.7,
    "text": "Oh, my gosh.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2627.742,
    "end": 2629.684,
    "text": "I don't even know I'm going to get out of chapter four.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2630.165,
    "end": 2630.826,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2631.266,
    "end": 2631.787,
    "text": "So I'll wait.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2632.068,
    "end": 2632.648,
    "text": "I'll wait there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2632.748,
    "end": 2633.89,
    "text": "But I do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2634.11,
    "end": 2634.931,
    "text": "I do have a question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2634.991,
    "end": 2638.816,
    "text": "Have you ever heard of Marilyn Monk, who's also at UCL?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2640.639,
    "end": 2642.581,
    "text": "She's a molecular biologist.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2643.282,
    "end": 2648.329,
    "text": "She has a really interesting theory on",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2649.946,
    "end": 2651.79,
    "text": " uh, cause consciousness.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2656.318,
    "end": 2656.719,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2657.08,
    "end": 2661.709,
    "text": "And, and, um, she takes the systems all the way from Adam to cosmos.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2662.25,
    "end": 2670.486,
    "text": "That's what, that's what got me thinking about what we're doing here in this, in this book, but a very interesting model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2675.798,
    "end": 2696.575,
    "text": " that's cool like definitely some people are going that kind of like multi-scale like down to as small and fast as you can imagine like quantum and then up on through the cosmological and then this seeing this part here that reminded me of a really great book on evolution in four dimensions which is like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2697.01,
    "end": 2723.592,
    "text": " there are genetic epigenetic and metabolic and cultural and symbolic inheritances and there's situations where one explains all of the variation but there's situations where it explains not so it's not like you can just have this in principle battle and say oh well you know epigenetics wins or symbolic variation wins it's like the the field has been sketched",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2724.044,
    "end": 2750.963,
    "text": " and then the empirical question is what matters where and how and then what but those are questions to address for specific systems in practice they're not questions that can be addressed you know dusted off once and for all in principle yeah yeah yeah yeah yeah yeah I mean all right yeah there's hope for me there's hope for me then there always is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2753.542,
    "end": 2756.245,
    "text": " It's, I mean, it's, it's fun and it's a learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2756.645,
    "end": 2765.255,
    "text": "There's so many things that, that connects because like we're talking about the systems that we talk about elsewhere.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2765.275,
    "end": 2772.764,
    "text": "So when we talk about organisms, we're, we're, we're talking about the same, we're not talking about some other system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2773.825,
    "end": 2778.63,
    "text": "And this is more like a lens that we bring to systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2780.332,
    "end": 2780.532,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2780.552,
    "end": 2781.834,
    "text": "A lens we bring to systems.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2782.835,
    "end": 2782.975,
    "text": "Mm-hmm.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2784.592,
    "end": 2808.118,
    "text": " another way to think about that is like active inference says less so we can say more but it's not like active inference is gonna you know it's not a slot machine it's not gonna deliver us like an account of a psychiatric or a social situation i mean the textbook is what it is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2808.993,
    "end": 2814.362,
    "text": " Like, numbers are just there for people to count things, let's just say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2814.382,
    "end": 2818.449,
    "text": "So these models exist for us to analyze cognitive systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2819.37,
    "end": 2831.911,
    "text": "But if active inference already had an answer about how cognitive systems are, that would curtail it from being used to explore diverse intelligences and open-endedness of creating new things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2833.814,
    "end": 2833.914,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2835.297,
    "end": 2835.557,
    "text": "Got it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2837.41,
    "end": 2866.27,
    "text": " that's why like yeah thank you that's why chapter four gives us the like degenerative model it's like this is like the linux kernel or like the software system but it's like but what do i do with a computer it's like well chapter five here's people using it to study mammals but in chapter four we see it in kind of its pure form in the general or in the abstract form",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2869.878,
    "end": 2893.557,
    "text": " which is like both sometimes very frustrating or it feels like it's like a mega infinite learning journey but all of the connection from active to any system we make that connection that connection is not for us to find hmm",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2912.116,
    "end": 2917.902,
    "text": " Dan, could you go back really quick for me to the chapter was scroll down.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2917.922,
    "end": 2924.91,
    "text": "I think it was five where you had gone down to consciousness related to that were introduced.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2925.55,
    "end": 2929.715,
    "text": "The differential between animal and trees.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2933.859,
    "end": 2937.583,
    "text": "This quote here or plants, yes, sorry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2938.677,
    "end": 2950.594,
    "text": " so in terms of they have no brain so they're called plants but in the in the context of the tree itself isn't that wouldn't that be considered um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2951.772,
    "end": 2962.625,
    "text": " In the same way that show was just talking about different layers of the brain, where the tree structure itself right has its own branches and nodes that are still connected in the same field.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2963.145,
    "end": 2978.944,
    "text": "That may grow around but again you're also dealing with different dynamics, where those systems will still interact given how close they are for fitness of reaching the sun, you know variably if another leaf is over another day, for example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2979.835,
    "end": 2981.137,
    "text": " I totally agree.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2981.257,
    "end": 2985.984,
    "text": "It's the kind of quote that a mammal said.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2986.004,
    "end": 2990.751,
    "text": "I think about this paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2992.013,
    "end": 2995.739,
    "text": "This is my PhD advisor and a colleague, a framework for plant behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2995.939,
    "end": 3000.105,
    "text": "And I mean, now this is more of a common perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3000.963,
    "end": 3030.75,
    "text": " but um there is some question whether the words to describe animal behavior such as the word behavior or foraging can be applied to the activities of plant i mean is a root tip not foraging for nutrients in a niche oh it's slow okay but not to itself it's slow to a person running around but um some people say oh plants don't have behavior they're just there but they do have behavior",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3031.523,
    "end": 3056.232,
    "text": " and then active influence helps us say yeah here's the affordances they have and the time scales over which they have them but you couldn't say like something you know it doesn't have behavior just because it doesn't have a kind of behavior right well that's it go ahead go ahead sorry go ahead no go ahead sure I'm sorry",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3057.528,
    "end": 3070.461,
    "text": " I was just saying that behavior assumes consciousness and Oxford Dictionary defines it as the state of being aware and responsive to one's surroundings.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3070.481,
    "end": 3074.705,
    "text": "So if you, like Marilyn Monk, she talks about awareness is sensing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3075.366,
    "end": 3084.075,
    "text": "So if we say sensing and responsive to one's surrounding, then we have to say plants have a consciousness according to Oxford Dictionary.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3085.0,
    "end": 3107.498,
    "text": " so what you're what you're saying about the leaf and the tree and the root tip um brings the word consciousness here which is problematic for me because it has no end i mean what doesn't sense and respond so again they even rocks do that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3108.693,
    "end": 3138.261,
    "text": " that's that's these are the mega philosophical questions like does pancognitivism the idea like we approach all things as cognitive systems or that they truly are cognitive systems does pancognitivism imply panpsychism is there something it's like to be anything because all things are engaged across the interface in sensing and adapting",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3138.342,
    "end": 3159.22,
    "text": " even something that's inert it still is bounded by an interface and there's still something on the other side of the interface even if it's just a cup of water but then is there something it's like to be a cup of water because it'd be different if the cup of water weren't there so it's doing something in relationship to its niche",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3160.432,
    "end": 3168.719,
    "text": " And so that's people looking for continuums where it looks like they're sharp distinctions and looking for sharp distinctions amidst the continuum.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3169.18,
    "end": 3174.224,
    "text": "Like it has to have a higher order awareness, like it has to be aware that it's aware.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3175.786,
    "end": 3179.889,
    "text": "Like our attention is not only about target of our attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3180.57,
    "end": 3183.452,
    "text": "We're also aware that we're paying attention to something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3184.894,
    "end": 3188.717,
    "text": "And this is where so many of the people bring in like meditation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3188.832,
    "end": 3212.089,
    "text": " the mindfulness connections and then some people use that to differentiate or distinguish human cognition from other types other people deploy like literally the same formalisms to argue for the continuity of human cognition and then this has been oh yeah go ahead",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3212.828,
    "end": 3221.336,
    "text": " Has there been discussion around how much our senses contribute to our cognitive function?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3221.456,
    "end": 3229.443,
    "text": "I mean, just as a mind experiment, if you took a human brain and you put it into a dog's body, would we start thinking like a dog more?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3237.35,
    "end": 3242.194,
    "text": "Like, people have thought wild stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3244.351,
    "end": 3268.57,
    "text": " well I mean just to come at that from a different perspective I was thinking about this the other day in terms of cybernetics right like if we get to a point where we're able to do a full transplant of you know a mind for example into a cybernetic system wouldn't that be the same argument you know would would you have the same kind of organ rejection for example um but it would would it be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3269.528,
    "end": 3278.679,
    "text": " And I guess that would be very assumptive at this point, but like, would the, the false body reject the mind or would the mind reject the false body in that sense?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3280.802,
    "end": 3289.393,
    "text": "I was speaking out more from this perspective of, you know, how necessary is it for intelligence or like general intelligence?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3289.513,
    "end": 3299.265,
    "text": "Like, you know, do we want, if we want to get to higher levels of intelligence, do we need a, an embodiment system that, you know, senses the world",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3300.832,
    "end": 3328.054,
    "text": " um in a complex way that we have yeah i think we have like a hundred thousand like stencils receptors or something for our body and it's continuously feeding into our body through many different layers and you know maybe that's something that's crucial to you know the feelings and emotions that we have um yeah because there's theories where you know like our our stomach itself contributes to our you know cognitive function so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3329.333,
    "end": 3337.623,
    "text": " You know I wonder if there's been discussion there from your conference the norm in active influence Community, because the you know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3340.947,
    "end": 3344.311,
    "text": "This Community seems to think more about you, I think the holistic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3347.875,
    "end": 3350.498,
    "text": "yeah just the bigger picture in terms of intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3353.768,
    "end": 3357.652,
    "text": " So I did my PhD at the University of Virginia in the United States.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3358.634,
    "end": 3366.402,
    "text": "And there was a little known secret there of a guy who studied near-death experiences, reincarnation from all over the world.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3366.943,
    "end": 3368.264,
    "text": "Ian Stevenson was his name.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3369.306,
    "end": 3373.13,
    "text": "They didn't even really talk about him until years and years, decades later.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3375.052,
    "end": 3376.354,
    "text": "He was a well-known secret.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3376.494,
    "end": 3382.881,
    "text": "But his point was that consciousness can exist without a body and even without a brain.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3383.755,
    "end": 3386.059,
    "text": " And at that time, it really got me.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3386.079,
    "end": 3386.8,
    "text": "Yeah, there it is.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3387.782,
    "end": 3390.346,
    "text": "It really got me to thinking about this whole idea of truth.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3392.069,
    "end": 3397.537,
    "text": "There is a scientific model of truth in which, of course, this is done by humans.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3398.439,
    "end": 3402.105,
    "text": "But before there were scientists, there were still people seeking truth.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3402.886,
    "end": 3405.831,
    "text": "And even in active inference, they're called the mystics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3406.655,
    "end": 3417.569,
    "text": " And then I think in our day, you know, there are poets who kind of intuitively or think deeply about something, but it's still a search for truth.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3418.43,
    "end": 3430.165,
    "text": "So I think for me, it has been useful to acknowledge these different ways and perspectives and modalities and not think one is greater than the other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3434.262,
    "end": 3435.083,
    "text": " That's a great point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3435.103,
    "end": 3436.044,
    "text": "There's so much to say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3436.585,
    "end": 3442.532,
    "text": "It reminds me of like, there's the parable of the blind people and the elephants, and they're like touching different parts of the elephants.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3443.133,
    "end": 3450.001,
    "text": "Okay, now we could kind of modify that into one person can see, one can hear, one can smell, one can talk.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3450.622,
    "end": 3459.133,
    "text": "So there's different modalities that have not just touching a different part of the body, but they're actually getting like a different wavelength.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3459.153,
    "end": 3462.717,
    "text": "They're getting totally different modalities of the elephants.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3462.899,
    "end": 3467.569,
    "text": " That's one interesting component.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3468.01,
    "end": 3476.689,
    "text": "And then one other point is like, so earlier you asked like, what is the role of the sensation of perception in intelligence?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3477.293,
    "end": 3500.652,
    "text": " There's a ton of answers, but one answer that like Adam Saffron and others have pursued is the kinds of relationships that our sensory apparatus require to solve help us build architectures that reflect the structure of our reality, like grid cells in the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3500.632,
    "end": 3522.167,
    "text": " those evolved because we were moving in spaces with certain geometries but then those became later utilized for other kinds of arbitrary cognitive navigation or like having hierarchically nested perceptual apparatus it arose to do",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3522.957,
    "end": 3533.999,
    "text": " something that it was repurposed to do later because that motif is so effective at the kind of statistical challenge that it evolved to solve or address.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3536.024,
    "end": 3542.537,
    "text": "And there's probably no end to those motifs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3542.557,
    "end": 3542.637,
    "text": "Wow."
  },
  {
    "start": 3548.354,
    "end": 3569.299,
    "text": " yeah it's super it's like chapter four so hard this is where it has to take us can i i know over time can i ask like a very fine grained question to zoom all the way back in yeah yeah um so i i kept getting confused in the text by some of the conventions in the math um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3569.515,
    "end": 3574.801,
    "text": " are bold faces and our serifs versus sans serifs meant to mean anything?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3574.941,
    "end": 3596.367,
    "text": "So if you look at equation 4.11, for example, we have caps serif F equals bold pi times bold sans serif F. And I looked around, I couldn't figure out like what, if anything, are those like changes in the specifics of how things are rendered meant to indicate?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3598.743,
    "end": 3600.045,
    "text": " I'm totally with you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3600.566,
    "end": 3612.608,
    "text": "That's one reason why having the written equation form, I feel like is really vital.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3613.67,
    "end": 3621.645,
    "text": "Because even experts will not be able to converge upon this kind of a description.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3622.199,
    "end": 3624.583,
    "text": " without looking at the same page.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3625.384,
    "end": 3627.988,
    "text": "There's just too many ways to read even the equations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3628.028,
    "end": 3633.075,
    "text": "And that's even before you get into like bold and italics and like font and stuff like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3633.115,
    "end": 3649.86,
    "text": "It looks like bold is only mentioned one time in the supplement or Appendix B referring to it as being like a sufficient statistic, but I don't think that's how it's being used above.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3650.043,
    "end": 3675.645,
    "text": " i feel like bold is being used to describe whether it's a vector or not but i i i don't know and like faced with that dauntingness of trying to sift through where they or if they define it for like typographical phenomena that i don't even necessarily know the name of that's why",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3675.743,
    "end": 3681.268,
    "text": " I'm very excited for ontology-driven natural language descriptions of the equations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3681.969,
    "end": 3686.332,
    "text": "And then we can render them to look however we want.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3687.293,
    "end": 3694.4,
    "text": "So we could render them with a full English word, or we could render it with a full non-English word, or we could use a Python variable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3694.46,
    "end": 3703.708,
    "text": "Because I don't... Even if you could dig to the bottom and find out if they defined how they use the notation...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3705.477,
    "end": 3707.439,
    "text": " other papers are going to do different notation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3708.24,
    "end": 3712.004,
    "text": "So it'd be kind of like a local victory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3714.267,
    "end": 3717.731,
    "text": "Yeah, at this point, I would be satisfied, or I would be helped by local victory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3718.091,
    "end": 3720.894,
    "text": "There's like a couple of pages where they like seem to use this distinction a lot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3720.934,
    "end": 3722.997,
    "text": "And I was like, not following their choices at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3724.678,
    "end": 3728.963,
    "text": "But But yeah, I appreciate that, like a shared resource, like helps create some clarity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3730.305,
    "end": 3733.748,
    "text": "But yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3733.769,
    "end": 3735.13,
    "text": "Okay, equation for 11.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3737.253,
    "end": 3757.202,
    "text": " uh yeah as an example and then like above and below this there's a few there's like a number of others that are uh i think intending to use the same distinction and i i have to assume that the authors had some purpose in mind so i don't think it's just like matrix versus vector versus scalar",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3782.258,
    "end": 3786.724,
    "text": " And the question is, what does the bold typing versus the italics mean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3787.525,
    "end": 3794.794,
    "text": "What does the bold mean, and what does the serif versus sans serif mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3794.814,
    "end": 3795.134,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3802.023,
    "end": 3806.648,
    "text": "And if no one knows, I guess no one knows, and that's the state of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3806.748,
    "end": 3809.752,
    "text": "What do you mean by sans serif?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3809.772,
    "end": 3811.995,
    "text": "You mean this F versus this F?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3812.549,
    "end": 3820.937,
    "text": " Right, so they are distinguished by the bold feature, but other things are also distinguished by the bold feature, but not by the serif versus anserif change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3823.299,
    "end": 3834.149,
    "text": "Okay, it seems like we always have a co-occurrence of bold and straight, and italics is never found as bold.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3836.652,
    "end": 3842.117,
    "text": "So I'm tempted to say that bold and straight means sufficient statistics of,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3843.143,
    "end": 3847.367,
    "text": " whereas the italics is referring to the underlying variable as it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3848.208,
    "end": 3857.298,
    "text": "But we can literally just write the question down in one of the rows, and then whatever we can't resolve, we can email Fristen at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3858.319,
    "end": 3859.1,
    "text": "Okay, fair enough.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3859.12,
    "end": 3859.56,
    "text": "Thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3863.024,
    "end": 3863.324,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3866.107,
    "end": 3866.307,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3866.327,
    "end": 3866.427,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3866.568,
    "end": 3871.733,
    "text": "I mean, I dream of the day when we can mouse over",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3872.742,
    "end": 3897.889,
    "text": " and have multiple modalities of what these are and and like have someone says i want to mouse over and see examples someone else says i want to mouse over and see like the programming variable i don't know if there's another way to make like a fixed artifact that that could speak to so many people in so many different situations",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3901.868,
    "end": 3902.309,
    "text": " Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3903.331,
    "end": 3903.632,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3903.652,
    "end": 3907.079,
    "text": "Well, interesting times.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3907.099,
    "end": 3914.375,
    "text": "I'd end coding exercises that I can go through to understand these equations better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3917.663,
    "end": 3920.569,
    "text": "Yes, I'd go over the code page.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3920.785,
    "end": 3925.551,
    "text": " Here's several dozen code examples.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3926.331,
    "end": 3941.689,
    "text": "Like when you see, and then also I would highly recommend the PyMDP documentation because like when it's shown as the Bayes graph and it's like, it seems like, again, it seems like it's gonna be like this math and analytical thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3941.709,
    "end": 3948.177,
    "text": "But when you go to active inference from scratch, you define A, B, C, D,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3949.203,
    "end": 3960.979,
    "text": " And then you have all of the steps, all of the utility functions are defined, and then you have the active inference loop.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3964.224,
    "end": 3971.093,
    "text": "And then once you've gotten to here, here's active inference loop A, B, C, D, and the environment and the time horizon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3972.473,
    "end": 3986.366,
    "text": " So if you've run up at the equations and or you want to try a little bit more of like a bottom-up computer science or computer engineering approach, this can be really clarifying.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3987.927,
    "end": 3990.47,
    "text": "But those are very useful with PyMDP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3992.571,
    "end": 3997.196,
    "text": "But any of the code examples will be fun or useful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3997.876,
    "end": 4000.759,
    "text": "However, PyMDP and RxInfer",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4001.245,
    "end": 4004.128,
    "text": " have the best documentation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4007.292,
    "end": 4011.477,
    "text": "So, and we're here to make the material more pedagogical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4012.198,
    "end": 4023.011,
    "text": "So if there's like a example that you're excited about, like literally let's have the authors do a live stream or let's make the code better annotated or documented or whatever we need to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4026.095,
    "end": 4028.097,
    "text": "Um, did they have any examples where they're doing, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4028.853,
    "end": 4054.945,
    "text": " active influence on just some basic um basic predictions like i don't know maybe temperature or yes like um the uh rx inferred documentation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4056.916,
    "end": 4085.944,
    "text": " has has like a range of examples um ranging from like like don't worry about something being too simple truly like even the examples um of coin flipping are a great place to start but this is a ton of information about all kinds of examples and then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4088.135,
    "end": 4093.702,
    "text": " Usually the people who are making the packages are focused on making the package, if not like working three jobs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4094.583,
    "end": 4098.107,
    "text": "So if something's missing, I mean, change the world or change your mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4098.948,
    "end": 4104.635,
    "text": "So if you think there could be a cool example, that's what we're doing here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4105.236,
    "end": 4107.699,
    "text": "So I hope that we can make it if it's not already there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4112.285,
    "end": 4112.525,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4112.545,
    "end": 4113.146,
    "text": "Wow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4113.166,
    "end": 4114.227,
    "text": "That was chapter four.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4116.586,
    "end": 4123.477,
    "text": " The next two weeks, we'll come back for chapter five and look at more examples in the mammalian nervous system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4125.3,
    "end": 4136.197,
    "text": "And then we'll have just a final meeting, kind of catch up, hopefully get people's feedback and connect on projects and just see where things are at in the Institute and the ecosystem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4136.918,
    "end": 4138.701,
    "text": "So thank you all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4139.402,
    "end": 4140.103,
    "text": "See you next time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4141.245,
    "end": 4141.685,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4141.705,
    "end": 4142.086,
    "text": "Bye-bye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4142.106,
    "end": 4143.147,
    "text": "Thanks, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4143.168,
    "end": 4143.488,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  }
]