[
  {
    "start": 6.718,
    "end": 9.62,
    "text": " Hello and welcome to the Active Inference Institute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9.8,
    "end": 16.544,
    "text": "This is ACT-INF guest stream number 60.1 on October 18th, 2023.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 17.425,
    "end": 21.827,
    "text": "Today should be a great and very exciting presentation and discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 22.808,
    "end": 30.233,
    "text": " Kristen Whittle is here and will be presenting on reflections and implications of a naive attitude to architecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 30.794,
    "end": 34.096,
    "text": "There will be a presentation followed by a discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 34.336,
    "end": 37.999,
    "text": "So if you're watching live, please feel free to write any comments in the chat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 38.739,
    "end": 45.304,
    "text": "Otherwise, thank you so much for joining and really looking forward to this work being shared.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 48.171,
    "end": 48.932,
    "text": " Thank you, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 51.593,
    "end": 55.656,
    "text": "It's a great pleasure being able to present to you and your audience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 57.317,
    "end": 71.647,
    "text": "And just as we were maybe talking, the journey towards arriving here to talk to you has been a very, very interesting one and one that's really been undertaken since I was a young person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 74.669,
    "end": 93.247,
    "text": " it's thrilling and exciting to be able to talk about the work that we've been doing as a studio and kind of seeing where the touch points and points of influence and interest to you and your audience come into this conversation about our sort of artistic work, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 93.647,
    "end": 94.908,
    "text": "So what I wanted to do is to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 96.798,
    "end": 125.677,
    "text": " um maybe explain what we're just about to see uh before showing it um what it is is a kind of an assemblage of work that's been undertaken since i was probably 22 um and and it goes into a lot of practical uh work that um has now been completed um real large-scale buildings etc so it's kind of part theoretical part kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 126.938,
    "end": 149.577,
    "text": " trying to understand as a curious person where i'm at and trying to evolve a maybe a strong systematic view on architecture because i guess the way i see it is that architecture is a bit lost um and in a sense there's an idea implicit in the work which is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 150.7,
    "end": 169.992,
    "text": " kind of remind ourselves the purpose of architecture in a kind of pre-industrial form and then looking towards the future, towards a very sophisticated future that we have in front of us and trying to synchronize that with a very humanist substrate, a humanist philosophy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 171.644,
    "end": 197.694,
    "text": " So the reason why I called the talk a kind of evocation about naive architecture, it actually comes back to some readings that we've been doing that Carl Jung evolved out of readings that he'd had from Schiller, the German writer and philosopher, about...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 200.715,
    "end": 203.697,
    "text": " ways in which artistic production occur.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 204.157,
    "end": 216.704,
    "text": "So one would have, for instance, one production of art stemming from a natural source almost, which he referred to as naive art.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 218.425,
    "end": 242.095,
    "text": " and or a naive approach to art and the other which is a what he referred to as a sentimental view or a sentimental approach which is more that you're standing away from nature and looking upon it and choosing which direction to evolve in an objectifying the direction so the first thing to say is that our work really stems from",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 243.015,
    "end": 263.469,
    "text": " an extrapolation of nature through our work in a kind of intuitive instinctive manner um and then maybe post-rationalization or more theoretical explorations after that but the very basics of it come from a more intuitive approach and i think is very exciting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 266.121,
    "end": 272.885,
    "text": " So the primary function is this kind of relationship between a human being and space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 273.445,
    "end": 281.49,
    "text": "So having done a lot of work in health, become very, very interested in how the environment affects emotion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 282.61,
    "end": 299.178,
    "text": " um um and later on we'll sort of be talking about how free energy coherence works with the brain and things like this but but the essential kind of exciting area is this relationship between a human being emotion feeling and space and the environment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 300.078,
    "end": 316.792,
    "text": " And so our work is, I guess, coming from a kind of slightly utopian perspective, seeking to reconcile the maybe lack of connection in the modern world to the physical environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 316.912,
    "end": 321.395,
    "text": "That's this kind of reward matrix that sits outside of our bodies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 322.336,
    "end": 337.396,
    "text": " um to generate an architecture which is full of meaning and nooks and hooks and alcoves if you like emotional alcoves which hook us into this kind of positive feedback loop so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 338.497,
    "end": 350.604,
    "text": " we see our extrapolation of our cognitive creative processes being something to do with how nature and feedback and cognition works at a fundamental level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 350.664,
    "end": 362.191,
    "text": "So I'm very interested in exploring this with you and your audience later on is how creativity is a sort of manifestation of cognition, full stop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 364.972,
    "end": 373.696,
    "text": " So with architecture, the interesting thing about architecture is it's really associated with other people and it requires you to be an empath.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 374.496,
    "end": 381.559,
    "text": "So the big thing here is when you meet a client who's got a problem, you're really trying to solve their problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 382.419,
    "end": 390.202,
    "text": "And that problem is manifold in different, has different sort of concepts associated with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 390.302,
    "end": 393.484,
    "text": "But I'm specifically interested in the wellbeing aspect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 394.504,
    "end": 418.4,
    "text": " um of how they themselves or their cohort that's living inside their buildings how they behave and how well they feel once a building's been built so architects are extroverts and i guess through the process of capturing the spirit of an environment that's hopefully regenerative",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 419.978,
    "end": 442.391,
    "text": " What we are now working on is embodying that regenerative philosophy into a kind of code, which is a complex code interwoven and made complex because it's fairly wide ranging and doesn't like being in the boundaries of strict code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 442.651,
    "end": 452.716,
    "text": " philosophical guidelines, if you know what I mean, it kind of ranges across live data and wanders around that matrix kind of freely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 453.656,
    "end": 466.263,
    "text": "The process of embodiment is more to do with how the process of experimentation and scoring works at an intuitive level in order to get very good architectural results happening after that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 467.205,
    "end": 483.319,
    "text": " So essentially interested in the life journey and how people grow and get nurtured over time in their environments, whether that's the intimate environment of their personal life, their family lives, or the institutional lives that they have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 486.55,
    "end": 502.017,
    "text": " So without being kind of institutionalizing, I'm interested in the modularity, if you like, of people and the way that their cognition behaviors work at a sort of neurobiological level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 502.777,
    "end": 507.779,
    "text": " I'm interested in how idiosyncrasy comes about within that system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 508.54,
    "end": 518.904,
    "text": "And I'm interested in how those idiosyncrasies can manifest into an idiosyncratic architecture to basically create positive feedback loops.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 522.655,
    "end": 538.547,
    "text": " So somehow within this, there's a correlation between how cognition works, which I see as the foundation to creativity, and then how the making process works associated with that and perfecting the making process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 539.328,
    "end": 549.376,
    "text": "And then obviously, what the lived experience of those environments is, and then how does that feedback work to go back into cognition and creativity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 550.467,
    "end": 555.15,
    "text": " So I guess some references here might be useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 557.031,
    "end": 573.603,
    "text": "The work that Smuts did at the same time as when Jung was working in Basel, trying to evolve a complex, holistic approach to the mind and body has been instrumental in the work that we do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 574.964,
    "end": 594.262,
    "text": " um so in a sense uh one takes that sort of expansive infinitely expensive kind of perspective of the universe being fed into us and then us emitting that universe that sort of overall large-scale complex process that's always happening",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 595.103,
    "end": 609.784,
    "text": " it's somehow our creative process is captured within that so i i use that as a bit of a reference point um and i'd like to just i guess put a a shout out here to to corbusier because um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 611.485,
    "end": 634.054,
    "text": " even though he he manifests the scientific and maybe um definitely institutional um and scientific approach to the modular human modular his focus was really on the body um his artistic maybe intuitive side was maybe interested in the mind but the systems and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 635.694,
    "end": 651.602,
    "text": " modernistic rationale that he produced in the 20th century had a massive effect on cities globally and ultimately kind of fell over post-brutalism into a kind of failure of architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 652.323,
    "end": 664.749,
    "text": "I see the work that we're doing is somehow an evolution of the modular and a much more complex and diverse manifestation of the modular.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 666.303,
    "end": 689.855,
    "text": " So I guess coming back to Carl Jung again, it would be necessary for me to say that if you go along with this story of naivety and processing nature, that one of those processes is to do with the archetypal image and the sort of using the archetypal image as some sort of foundation for the work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 690.575,
    "end": 698.139,
    "text": " So if this sort of stream of consciousness is available to you, that's one of the latching points of the work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 698.319,
    "end": 706.904,
    "text": "And the question then becomes, how do you utilize that as a sort of febrile substance to manifest new things?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 707.524,
    "end": 711.706,
    "text": "So not necessarily reproducing memory as an exact thing,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 713.047,
    "end": 735.426,
    "text": " thing in and of itself it's more associated with the creative utility of the archetype as a substrate to tap into and then applying different processes onto that and because of that let's say use of that substrate we're able to get into a kind of deep relationship or a deep conversation with the public",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 737.304,
    "end": 748.352,
    "text": " So I think the reason why this is kind of important at this moment in time is, you know, the question about data, what data informs architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 749.612,
    "end": 756.997,
    "text": "Typically, it's been ergonomic, fact based information that's determined by spatial mathematics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 758.318,
    "end": 784.263,
    "text": " um an ergonomic programming of space like utility uh efficiency and those sorts of concepts um i'm sort of more interested in the pre-industrial which is more to do with scale um the idea of rooms the idea of enclosure and connection uh to other people um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 785.484,
    "end": 789.096,
    "text": " and what sort of spatial configurations allow for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 790.409,
    "end": 802.976,
    "text": " So the question I have is really how do we use data in that sense, you know, outside of the engineering-based, mathematical, scientific, modernistic platform for data?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 803.697,
    "end": 810.481,
    "text": "So which I think causes institutionalization, which has been seen as a failure in architecture and failure in society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 810.541,
    "end": 817.765,
    "text": "So we're sort of, we've never recovered really from the failure of the institutionalization of architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 818.405,
    "end": 825.947,
    "text": " So we're now at the point with large data and AI to question what gets assembled from here on in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 827.247,
    "end": 835.369,
    "text": "And how do we evolve something that's got the nuance, complexity, freedom of our organic selves in a kind of artificialized system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 836.689,
    "end": 847.872,
    "text": "So I'm very interested in individuation, both as a creative person, but also creating environments that allow for other people to be individuated and for allowing that ecosystem to dominate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 849.269,
    "end": 876.217,
    "text": " So I'm therefore interested in industrial experimentation or experimentalism and how mass customization can occur using new manufacturing techniques like additive manufacturing, for instance, and in a sense, democratizing the design process to allow everyone to be an artist, to be an architect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 877.93,
    "end": 893.595,
    "text": " But anyway, so to kind of unpack what we would do typically is rather than go on a linear journey, which is a fact based, reduced, simplistic architectural journey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 894.415,
    "end": 911.325,
    "text": " like a plus b equals c we go on a circular kind of coiling journey uh it's certainly moving forward but information's coming in from different vantage points continually throughout the process and i guess we've we've ended up being very efficient at this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 912.305,
    "end": 938.917,
    "text": " um but it allows us to have kind of oppositional trajectories coming into the design journey it allows us to see things objectively as well as subjectively using qualitative and quantitative information and building things and destroying things on a journey of creation so things die certain things live the living things get tested and might die and it evolves in that sort of way okay so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 940.949,
    "end": 954.137,
    "text": " If you're looking at maybe the definitions of creativity, it would probably centre on how creative processes end up creating new things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 957.515,
    "end": 963.681,
    "text": " it's not so to speak about mimicking, it's about creating new things that have a function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 964.421,
    "end": 975.712,
    "text": "And I guess from our perspective, this coiling process is the foundation to that invention process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 976.493,
    "end": 981.617,
    "text": "Where somehow you yourself, because you yourself are connected into that information process,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 982.638,
    "end": 993.229,
    "text": " that by necessity what comes out of it traps the external world into that internal world and gets affected by that journey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 993.75,
    "end": 998.114,
    "text": "So it's sort of a trap for society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 999.436,
    "end": 1001.378,
    "text": "But the main objective is for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1004.882,
    "end": 1032.758,
    "text": " one to achieve what I would call coherence, which is, which definitely comes back to free energy and active influence where you can essentially map and see the world moving forward in a coherent way, latch onto it and for it to feedback meaning and reward into your life, and therefore extend, you know, longevity and improve livability, those sorts of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1034.935,
    "end": 1059.929,
    "text": " so um by sort of going in that direction what what we need to do is to kind of assess what the well of knowledge uh plus memory uh plus ambition uh what what sort of constitutes that domain so what we've done in our own way is to assemble",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1061.209,
    "end": 1074.693,
    "text": " trajectories and a kind of taxonomy, a working taxonomy that ranges between social and political principles to scientific and technological principles and art and architectural principles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1075.253,
    "end": 1079.414,
    "text": "And that essentially forms a kind of rosette, which we call deep learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1080.094,
    "end": 1087.016,
    "text": " And that's the kind of foundation that has existed for me since childhood and obviously is a dynamic assembly process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1087.637,
    "end": 1088.957,
    "text": "So that's the kind of scaffold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1089.737,
    "end": 1103.242,
    "text": "And then if you imagine taking that living scaffold to a project, we then create a dynamic relationship between that scaffold to a client.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1104.042,
    "end": 1128.537,
    "text": " and the projections and information that we get to and from a client as well as to and from a site so a site would for instance constitute how where the sun moves how it moves around a site where the wind blows what's the ecology of the site um and in a city what are its neighbors what's the social backdrop to a site",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1130.477,
    "end": 1139.916,
    "text": " It's also about people, obviously, and it's about monitoring and assessing people and how they are coming and going within a site's curtilage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1140.842,
    "end": 1149.344,
    "text": " So you're sort of assembling that very broad and complex picture that essentially forms that nugget of truth, which we've defined as feeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1150.165,
    "end": 1153.246,
    "text": "And so we trust our feelings about a site.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1153.606,
    "end": 1161.408,
    "text": "Now, it sounds naive talking about feelings in architecture, and there's no sort of, I don't believe there's any sort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1162.408,
    "end": 1181.748,
    "text": " academic construct that's been developed throughout feelings um it's been sort of chipped away in in rationalist principles in post-modernist theory but um the idea of a feeling is is obviously if you're trusting your instincts is a very complex um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1184.105,
    "end": 1212.047,
    "text": " model of of truth that's a truth to you and so if you're able to form a layered understanding about how that feeling is constructed you're then able to um i guess talk about it openly with your studio and with your clients and start utilizing it and testing it more pragmatically um so what we've done is to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1215.674,
    "end": 1226.561,
    "text": " is to then layer that out from initiation phases all the way through schematic delivery and post occupancy phases of projects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1227.842,
    "end": 1232.865,
    "text": "So that feeling concept is the nugget that everything is tested against.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1233.466,
    "end": 1236.308,
    "text": "And so when we get to the end of the process,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1237.308,
    "end": 1240.99,
    "text": " we're measuring against what that original feeling was and asking questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1241.03,
    "end": 1243.692,
    "text": "Does it feel like what we felt like at the beginning?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1243.712,
    "end": 1245.052,
    "text": "How does it differ?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1245.413,
    "end": 1247.774,
    "text": "And what do other people think about that feeling?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1248.514,
    "end": 1250.836,
    "text": "And I guess it's probably important for me to say",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1251.943,
    "end": 1262.432,
    "text": " The curiosity that underpins all of this started because the work that was happening ended up being very well fitted to the client's prerogatives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1262.472,
    "end": 1267.736,
    "text": "And I would have a situation quite commonly where a client would say to me, how did you read my mind?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1267.976,
    "end": 1274.922,
    "text": "Like, how are you able to comprehend what our needs were when there was a lot of unspoken truth about a project?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1276.873,
    "end": 1283.015,
    "text": " How were you able to encapsulate what our desires were in a project?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1283.275,
    "end": 1284.115,
    "text": "How is that possible?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1284.955,
    "end": 1289.417,
    "text": "And or in the sense of in the hospital, why does the hospital feel right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1289.477,
    "end": 1290.557,
    "text": "Why does it feel good?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1290.717,
    "end": 1291.937,
    "text": "Why is it restorative?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1292.617,
    "end": 1294.318,
    "text": "Like, how have you been able to achieve that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1295.138,
    "end": 1297.319,
    "text": "And because of these questions that came at me,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1298.579,
    "end": 1315.708,
    "text": " i decided back in 2019 to study it to work out why it was happening what fed it what underpinned it so that's kind of what why i'm here really talking to daniel um and i guess what i've realized is that um that the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1317.168,
    "end": 1330.993,
    "text": " the perception model that I've just talked about in terms of feeling has obviously a corollary or an association with memory and anticipation, so projection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1331.693,
    "end": 1343.737,
    "text": "And somehow in a very complex neurological process, we're capturing that data and then we're able to project it into architectural models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1343.957,
    "end": 1344.698,
    "text": "So if you imagine",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1345.538,
    "end": 1362.983,
    "text": " cognition project like intuitive cognition projecting scenarios to help guide your body through space what i do as an architect is i actually make models of that projection and i then test those models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1364.053,
    "end": 1371.741,
    "text": " in order to get the perfect model, the thing that's the most coherent model for me and for the situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1372.062,
    "end": 1375.725,
    "text": "So it's a situationally specific, coherent model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1376.066,
    "end": 1377.227,
    "text": "That's what I'm searching for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1377.547,
    "end": 1379.409,
    "text": "And that's what I build at the end of the day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1380.631,
    "end": 1381.652,
    "text": "So it's based on feedback.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1382.392,
    "end": 1386.657,
    "text": "So we would call it an embodied holistic code for architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1387.927,
    "end": 1399.689,
    "text": " Okay, so based on the idea that we are all modular people in the sense that the foundation for us all, our neurobiological foundations are common.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1401.435,
    "end": 1403.856,
    "text": " before they become idiosyncratic, so to speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1405.397,
    "end": 1407.338,
    "text": "I'm sure you'll correct me on all that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1409.059,
    "end": 1414.622,
    "text": "So anyway, so but it's fair to say that we are all living beings, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1414.842,
    "end": 1423.106,
    "text": "And we have all of these normal, instinctive, kind of primitively derived",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1424.161,
    "end": 1425.663,
    "text": " things that we do in life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1426.184,
    "end": 1428.266,
    "text": "And this is what unifies us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1428.847,
    "end": 1438.34,
    "text": "So as an architect, it's important for me to know how these actions work, because they actually underpin how the functioning capacity for building works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1439.687,
    "end": 1447.634,
    "text": " But it's also true to say that in the work we are trying to reduce anxiety, not invoke anxiety.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1448.155,
    "end": 1458.164,
    "text": "We're trying to create harmony rather than invoke complexity to the point where it creates new pathologies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1458.664,
    "end": 1459.685,
    "text": "We're trying to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1461.687,
    "end": 1480.366,
    "text": " harmonize our existence in cities specifically and in contemporary cities this is where we go drastically wrong because the human being is never at the center of the conversation uh with regards to a development it's always a spreadsheet driven exercise and this is where we go wrong",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1482.754,
    "end": 1488.639,
    "text": " So our work begins with studying how this works, how these kind of human environment works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1488.879,
    "end": 1491.201,
    "text": "These are Carsten Holler's art piece.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1492.802,
    "end": 1497.286,
    "text": "It's kind of objectifying the social domain of a restaurant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1499.229,
    "end": 1502.57,
    "text": " which is very evocative, but it's a basic process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1502.63,
    "end": 1505.19,
    "text": "And this is again, humble me with an iPhone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1506.05,
    "end": 1524.074,
    "text": "What I try to do all the time every day is to document what I would call nooks where people are settling and where people are seeking to settle in certain domains, whether that's to socialize or to have the sort of intimate moments of self-reflection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1524.574,
    "end": 1526.054,
    "text": "How do we move through cities?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1527.608,
    "end": 1536.012,
    "text": " So what I'm always doing is photographing basically cities and people, and that forms the foundation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1537.312,
    "end": 1545.436,
    "text": "So I call that, and again, this is a very unacademic terminology, learn, dwell, nooks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1546.716,
    "end": 1548.297,
    "text": "So I've worked out that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1550.262,
    "end": 1566.552,
    "text": " my fascination with photographing these things stems from the fact that i i'm learning something from what i'm looking at and that's why i'm drawn to them and then also it's conflated with the idea that i want to live in that environment so there's something about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1567.728,
    "end": 1576.69,
    "text": " the domain that I'm photographing that combines and conflates learning something and living in somewhere that's going to be good for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1577.37,
    "end": 1578.991,
    "text": "So there's a conflation of those two things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1579.691,
    "end": 1587.553,
    "text": "So our work's very much about the assemblage and collecting of that rationalised domain of lived well knocks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1590.354,
    "end": 1594.857,
    "text": " So we're always fascinated with how matter, for instance, assembles itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1595.217,
    "end": 1605.624,
    "text": "So this is an aerial photograph of a region of northern Victoria, a desert region of northern Victoria, which defines this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1606.545,
    "end": 1620.933,
    "text": " It's an irrigation colony called Mildura, which is a desert region that became an agricultural agrarian society that was all to do with growing food for the city of Melbourne.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1621.674,
    "end": 1628.938,
    "text": "But if you look at it from on top, you get to see the literal translation of those ecosystems being played out by the patterns of nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1629.558,
    "end": 1632.44,
    "text": "So it's the patterns of nature that we're interested in here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1633.28,
    "end": 1642.344,
    "text": " We're interested in how we sanctify our existence through symbolic constructs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1642.444,
    "end": 1644.305,
    "text": "This again goes back to the archetypes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1645.005,
    "end": 1654.409,
    "text": "We're interested in materials that a deep understanding about the kind of exacting expression of nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1655.35,
    "end": 1657.531,
    "text": "This is we have some fascinating trees in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1659.693,
    "end": 1682.775,
    "text": " victorian australia and um i became fascinated in trees when i did the royal children's hospital um they're always a foundation pillar for me anyway um materials that maybe are transformative materials that are ambiguous especially drawn to those sorts of materials materials that have maybe a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1684.625,
    "end": 1691.268,
    "text": " handcrafted and slightly sublime complex process that's created them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1692.789,
    "end": 1701.474,
    "text": "Materials that have used literal tree trunks in buildings that maybe have an unusually primitive quality to them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1702.89,
    "end": 1718.301,
    "text": " as well as highly elaborate expressions of roomness and threshold that we see in classical architecture, or humble, quiet domains that have an atmosphere of living dwelling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1720.662,
    "end": 1723.284,
    "text": "There's a sort of livingness to an environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1723.865,
    "end": 1728.268,
    "text": "So I'm interested in these subtleties and then amplifying those subtleties in architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1728.968,
    "end": 1743.395,
    "text": " The idea of intimacy and privacy in a public domain, the nooks of a doorway entry, or this, I guess, almost cinematic memory that's embedded into cities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1746.517,
    "end": 1753.621,
    "text": "The organic growth of cities, the bricolage of cities, how growth happens with different personalities and how they form organic constructs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1754.882,
    "end": 1762.787,
    "text": " or basic symbolic archetypal classical city terminology, like here at Pizzeria in Italy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1765.769,
    "end": 1768.631,
    "text": "And also the organic scaled",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1770.776,
    "end": 1790.864,
    "text": " mid-scale cities that you see in Europe that have consolidated that intimate relationship to space, solid and void, and creating spatial constructs where you have external rooms and internal rooms and the idea of those spaces aggregating social activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1791.664,
    "end": 1794.51,
    "text": " So all of those things are overall fascinations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1794.57,
    "end": 1799.36,
    "text": "And I put them in because they are just long-term fascinations, which are always being recorded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1799.781,
    "end": 1801.584,
    "text": "It's a kind of like a background noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1803.535,
    "end": 1819.59,
    "text": " So the origins of the work go back to SIARC, I think, when I was studying in SIARC in Switzerland in America, where I think I was fascinated by the idea of coexisting realities in structures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1819.81,
    "end": 1824.194,
    "text": "So I call this the hyperrealism of live reality, okay?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1825.62,
    "end": 1837.51,
    "text": " So this, for instance, is a sculptural piece that I did about creating a new construction out of an old construction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1837.67,
    "end": 1850.862,
    "text": "So looking at how an old building's column and beam structure was working and how the association of the original thought of that structure",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1851.764,
    "end": 1856.99,
    "text": " which was used, the drawings, if you like, the drawings were the perfect model of that structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1857.43,
    "end": 1862.896,
    "text": "Then you have the actualised construction, which is slightly different than the idealised one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1863.596,
    "end": 1869.483,
    "text": "And then you have maybe the course of time and organic processes changing that structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1870.043,
    "end": 1876.745,
    "text": " And then, of course, you have your memory and projection that's pushed onto that when you experience it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1877.165,
    "end": 1890.949,
    "text": "So this idea of having an assemblage of all of those realities made material into a structure, I became fascinated by that in order to form a truer basis for architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1891.309,
    "end": 1892.67,
    "text": "So that's kind of like back in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1894.23,
    "end": 1908.94,
    "text": " the early 90s and then that sort of morphed into looking at architecture more like a body so looking at the more organic substrate of architecture being much more similar to a body",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1910.621,
    "end": 1917.144,
    "text": " and looking at how a molding process around the body and create a replicatable architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1917.865,
    "end": 1929.612,
    "text": "So in a sense, a primitive version of a data fed architectural model being built as a modular system, but replicating more of a kind of bodily expression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1931.673,
    "end": 1936.856,
    "text": "So forming a very intimate relationship between body architecture and making a very ambiguous",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1939.193,
    "end": 1964.224,
    "text": " relationship there rather than a sort of um inside outside or dualistic relationship this is much more blurred um so that i guess indicates maybe an artistic and curious mind being played out as a young architect and then fast forward that into reality into professional work",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1965.084,
    "end": 1987.349,
    "text": " um i started to work um back in 2007 2008 in in healthcare projects and this was one of my first projects um uh it was it's for the most acute um hair center for mental health patients in a kind of lower socioeconomic district of melbourne called dandenong and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1988.289,
    "end": 2005.534,
    "text": " What we assembled here is an idea of deinstitutionalizing a mental health hospital by using the house as the model for the building and assembling essentially those like about 30 houses around different courtyard spaces and making everything out of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2006.314,
    "end": 2018.904,
    "text": " primarily recycled timber, and then changing the relationship between the building and the people inside, but also the people inside the building and the public.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2019.424,
    "end": 2022.106,
    "text": "So deinstitutionalizing all of those relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2022.967,
    "end": 2037.197,
    "text": " and normalizing those sorts of things where people would probably walk past the building and think it was a health spa or some i don't know health hotel but in fact it's actually treating the most acutely in need patients inside",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2038.567,
    "end": 2044.856,
    "text": " And then using the courtyards as a kind of natural oasis to feed positive energy into those people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2045.737,
    "end": 2055.65,
    "text": "So there's these buildings that are closed in and around courtyard spaces that focuses the energy towards the courtyard.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2056.631,
    "end": 2077.244,
    "text": " and each courtyard is designated differently and that sort of relationship is more like a cloister so it's more like a kind of classical cloister monastic cloister where peace of mind and mindfulness comes about through that focus on that singular um place of peace right so we're using here materiality",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2079.385,
    "end": 2094.794,
    "text": " Nature that somehow getting in between the building and the footpath, and then the focus of nature on the inside to reassign the relationships between those people's minds in and of themselves, but also their minds in relation to the outside world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2096.618,
    "end": 2117.591,
    "text": " So these are how these sketches and ideas got translated into spaces that changed the more hard-edged relationship of buildings to nature, private realm to public realm, into much more of a harmonised, fluid, sequential, picturesque,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2118.371,
    "end": 2130.145,
    "text": " sequences of space where we're able to bring in a more what I would call a soft fascination rather than a hard fascination reality for those people inside the building.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2133.942,
    "end": 2146.467,
    "text": " So you can see, for instance, the almost beach-like environment around the building that forms the border, the framing of the building before you get to the actual public realm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2146.867,
    "end": 2153.43,
    "text": "So it's a kind of like an imposition of raw nature, raw bush into the public realm that helps to harmonise these people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2154.443,
    "end": 2169.971,
    "text": " And another project that came about slightly later is a very prestigious physicist in Melbourne who needed to have a domain where he could work and do his algorithms, his experimentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2170.952,
    "end": 2177.675,
    "text": "And he had a space that was in a very urbanized environment on a very harsh street edge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2178.396,
    "end": 2179.676,
    "text": "So we created a cabin",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2181.566,
    "end": 2183.668,
    "text": " for him in the city in a shop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2185.249,
    "end": 2194.415,
    "text": "So essentially, Wong had, I don't know whether you can see my cursor, but there was a sort of street on the bottom edge of this image.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2194.515,
    "end": 2196.377,
    "text": "This is the plan of how we built it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2197.277,
    "end": 2200.66,
    "text": "There was a street on the bottom edge with a lot of passing traffic and people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2202.193,
    "end": 2219.845,
    "text": " And in order to kind of recalibrate the space so that it worked to generate a positive regenerative environment for him, we entered from the back and we arranged a sequence of entry spaces that were essentially black box experiences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2220.726,
    "end": 2239.253,
    "text": " that would kind of launder the urban fog or the urban pain of the city, the hard fascination of the city, launder that out of his body before coming into this timber domain where he would rebuild and connect into the truth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2239.673,
    "end": 2245.495,
    "text": "That was the overall kind of existential phenomenological journey that we were setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2246.727,
    "end": 2251.069,
    "text": " So as we were walking into the space, we were walking through these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2252.953,
    "end": 2264.781,
    "text": " deep kind of lost spaces that were all black with a scrunchy kind of floor covering, different acoustics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2265.542,
    "end": 2267.903,
    "text": "And then you would go through this door towards the light.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2268.383,
    "end": 2282.533,
    "text": "It would open up to you and you'd be bathed in this kind of warm light where each of the timber elements retained its organic, crusty, you know, wabi-sabi-esque character.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2283.974,
    "end": 2308.304,
    "text": " And, you know, it worked such a, it worked so well for him, he's never kind of, I mean, he's always been extremely supportive of the fact that I did this, because he was kind of, it proved to me that on a one to one level, if you listen to someone's needs, you can then create an environment that has a major effect on them psychologically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2311.507,
    "end": 2322.711,
    "text": " Okay, and then part of the journey, and this is part of the kind of rational trajectory of the work, we worked with a very preeminent company called BHP Billiton.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2322.731,
    "end": 2326.912,
    "text": "It's the world's largest mining company to do their headquarters in Melbourne.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2327.712,
    "end": 2347.481,
    "text": " and in this project we're able to change the relationship between how a corporate office worked in a city and how the relationship between in a sense an institutionalized corporate entity and the footpath the streetscape and the history could co-evolve so that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2349.302,
    "end": 2368.459,
    "text": " what's typically a very dry and alienating environment could somehow evoke the past, the memory of a place and create a different material reality and material associations for everyone who uses the building.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2369.079,
    "end": 2373.042,
    "text": "And this project sat on an old site that used to be a theater.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2374.264,
    "end": 2376.607,
    "text": " And it sat in the district of the city.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2376.647,
    "end": 2378.229,
    "text": "It used to be a manufacturing district.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2378.71,
    "end": 2383.676,
    "text": "So they used to make fancy goods, like they used to make jewelry and watches and things like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2384.357,
    "end": 2389.123,
    "text": "So what we wanted the building to be is some sort of jewel-like project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2391.229,
    "end": 2395.411,
    "text": " that spoke about that and sort of heroicized that history.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2396.011,
    "end": 2401.252,
    "text": "We brought that into the spatial construct that linked the two streets that bounded the site.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2402.192,
    "end": 2415.136,
    "text": "And we created this kind of sequential journey that detuned people from the busyness into the quietness through the use of natural materials.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2420.979,
    "end": 2433.475,
    "text": " And you can see here at the back of the site how the warehouse district gets mapped into the structure and embedded in a slightly different way using cut glass to make it more ceremonial and exotic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2434.591,
    "end": 2437.032,
    "text": " And that's how the project kind of sits in the city.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2437.552,
    "end": 2441.013,
    "text": "And you can see the echoes of the relationship between the Gothic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2442.534,
    "end": 2444.494,
    "text": "There's a river also sits down here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2444.994,
    "end": 2455.958,
    "text": "So there's somehow a relationship between the environment, the Gothic, the river, and the past, all sort of assembled into an architectural approach that's specific to that site.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2458.572,
    "end": 2478.163,
    "text": " In terms of residential work, we also have been working on some very interesting edge conditions in the city of Melbourne, where we've been able to explore the tall building typology and how tall buildings can work as civic buildings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2479.924,
    "end": 2486.888,
    "text": "And this is an edge of the city where lots of parades have happened in the past, edged by parkland.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2488.522,
    "end": 2493.825,
    "text": " old buildings that were built in the sort of mid 1800s using stone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2495.667,
    "end": 2504.933,
    "text": "And so what we were keen on doing here is establish a new architecture that's away from the glass curtain wall driven",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2509.219,
    "end": 2530.699,
    "text": " way of making things and return the city back to heavy materiality and extruding what would normally be a palazzo-scale, mid-scale building into a taller building so that essentially your physical experience of the public realm was about continuity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2531.52,
    "end": 2552.999,
    "text": " but then also the expression of the building on the skyline because cities are seen from afar our city here is a big city in a very flat on it's one of the world's largest basalt planes so it sort of erupts out of that basalt plane so buildings can seem can be seen from afar we wanted to signal what the city was about from a distance",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2554.621,
    "end": 2561.065,
    "text": " using a different approach and then connected into this sort of edge condition of the city.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2561.105,
    "end": 2575.016,
    "text": "So you're very much taking part in the activation of streets and the definition of street edges and seeing architecture more as a kind of passive tool for containing space and defining edge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2577.066,
    "end": 2588.35,
    "text": " But then also creating nooks, in this case, kind of cave-like nooks around the edge of the building where you feel the weight of the city around you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2589.99,
    "end": 2592.371,
    "text": "This is a photograph of how that edge condition works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2595.956,
    "end": 2614.982,
    "text": " So embodiment, perhaps go back to this, embodiment is more about, and I guess what I was trying to establish here is sometimes you're trying to rationalise from memory and from a kind of fact-based, almost like a simple trajectory to create a building.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2615.522,
    "end": 2621.184,
    "text": "Other times you're trying to capture an emotion that's perhaps more complex and evasive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2622.624,
    "end": 2624.465,
    "text": "So I call this process more like embodiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2625.899,
    "end": 2647.479,
    "text": " And this is a process that we use for the new Australian embassy, which is just being finished in Washington, DC, just about to be opened, where we were looking at how a material like copper can establish itself as the material to denote a country.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2649.338,
    "end": 2671.346,
    "text": " and the experiences of that material in the city of Washington, which has a very sort of ceremonial and hard to grasp institutional reality, and to kind of insert something that was much more open, deinstitutionalized, welcoming,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2672.407,
    "end": 2684.183,
    "text": " and also textured in such a way that it drew or created meaning for people outside of the building but also as you come into the building what those experiences were of about Australia.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2684.783,
    "end": 2689.129,
    "text": "So we're looking very much in drawing experiences in plan form",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2690.532,
    "end": 2703.983,
    "text": " and then using the copper to evoke this mysterious ecology of Australia that's particularly evident in the ephemeral salt lakes that you see in the desert regions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2704.703,
    "end": 2710.448,
    "text": "So if you ever fly over Australia, it's just the most beguiling experience that you'll never forget.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2711.189,
    "end": 2715.372,
    "text": "And it was trying to establish a dialogue with that for people in Washington.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2717.169,
    "end": 2720.171,
    "text": " And that's a picture on top of Uluru.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2720.471,
    "end": 2727.754,
    "text": "And you get to see the kind of monumental, modular monumentality of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2729.335,
    "end": 2737.959,
    "text": "And we wanted to establish something that was kind of rock-like or big and bulky and solid, and then insert these fissures into it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2738.059,
    "end": 2739.179,
    "text": "And these are some of those sketches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2740.68,
    "end": 2741.4,
    "text": "So this is again,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2744.136,
    "end": 2750.759,
    "text": " It's interesting kind of working remote from another city and inserting a piece of a country's DNA into another city.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2751.259,
    "end": 2762.724,
    "text": "But here we're kind of looking at the dimension, the dimensional reality of the building and how texture can get worked into a building from outside to inside.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2763.964,
    "end": 2768.606,
    "text": " and how nature can establish itself in different ways, different experiences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2769.447,
    "end": 2779.871,
    "text": "So breaking down the form of the building, and then we started to look at, because we had to, what machines and technology would be able to produce the material that we wanted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2779.971,
    "end": 2781.052,
    "text": "So we actually get into...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2782.092,
    "end": 2794.649,
    "text": " uh how the heating of the copper would work and how we would create what kind of organic replication so a process of making material that has a lot of idiosyncrasy associated with it but that's replicatable",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2795.834,
    "end": 2812.389,
    "text": " So we use this heating machine, a top down heating machine, which the material will be rolled through and establish this polychromatic kind of burnt finish within which we had just an infinite amount of variegation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2812.649,
    "end": 2813.23,
    "text": "Very beautiful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2815.475,
    "end": 2832.577,
    "text": " So this whole process evolved around the making of the building, around using that polychromatic finish to create an echo of Australia on the outside of the building that would stay silent but beguiling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2835.009,
    "end": 2840.05,
    "text": " And the way that those different panels were used was to create a kind of inflection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2840.71,
    "end": 2848.872,
    "text": "And that inflection that we had on the facade was coming through from the rhythms of the forests that interspersed in the desert.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2849.772,
    "end": 2859.974,
    "text": "And that was kind of mapped onto these sequences onto the building, which then became kind of fractionalized and more granular the closer you got to the building.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2866.966,
    "end": 2873.609,
    "text": " And we would study that in virtual reality now because we're able to, and we're able to add the environment around it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2873.629,
    "end": 2885.193,
    "text": "So you're able to choose your time of day, all those finishes, and you have a much more closed loop reality when you're designing now that can get very much close to the finished position, the finished state in advance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2885.493,
    "end": 2896.198,
    "text": "So we're able to have a much more exacting feedback loop design system to embed those feelings and emotions into a structure and get it right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2896.818,
    "end": 2907.79,
    "text": " So this is the kind of flickering and ambiguous layering that I was trying to talk about earlier in a natural forest, eucalypt forest in the high country.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2909.502,
    "end": 2918.286,
    "text": " And then that would come into the workplace environment through a sequence of, there's two atriums that are co-located.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2918.407,
    "end": 2920.548,
    "text": "One's a public atrium, one's a private atrium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2921.188,
    "end": 2926.07,
    "text": "The private atrium is a hub for all of the different disciplines in an embassy to come together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2926.631,
    "end": 2928.332,
    "text": "And so what we're trying to create here is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2929.552,
    "end": 2942.321,
    "text": " um it's all made out of timber and that timber is being used to infuse the environment with an association with australia in particular the light the striated light",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2943.456,
    "end": 2953.019,
    "text": " and the raw timber working together and the spatial sequence being kind of open and expansive and tall like a eucalypt tree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2953.339,
    "end": 2961.361,
    "text": "So a eucalypt tree is super tall, has a big open canopy and it has this small leaf kind of delicate light that comes through it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2961.721,
    "end": 2966.263,
    "text": "So all of those feelings we're trying to trap into a workplace setting that we know both",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2968.103,
    "end": 2972.425,
    "text": " symbolizes Australia, but also is healthy for people inside the building.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2972.505,
    "end": 2978.527,
    "text": "So this is about healthy workplace philosophy being used as a ceremonial gateway to Australia.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2979.548,
    "end": 2981.188,
    "text": "And these are the further images of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2982.008,
    "end": 2985.99,
    "text": "And that's as it currently stands just about to be opened.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2987.671,
    "end": 2996.834,
    "text": "And that's the copper standing five blocks north of the White House at the sort of edifice of Australia in Washington.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3001.015,
    "end": 3003.28,
    "text": " So as I guess we were developing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3006.158,
    "end": 3007.739,
    "text": " a human focused approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3007.799,
    "end": 3013.601,
    "text": "We also, you can't escape your responsibilities to the environment, planetarily speaking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3014.202,
    "end": 3026.708,
    "text": "So we also worked with aspects of the circular economy and looking at how a temporary building can utilize wood in the form of paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3027.528,
    "end": 3031.31,
    "text": "So we created an artwork stroke building, a temporary museum,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3032.15,
    "end": 3036.907,
    "text": " for the National Gallery of Victoria in a competition entry, which",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3038.408,
    "end": 3065.404,
    "text": " um looked at making a timber modular gallery with paper rooms running through it so the paper which has obviously traditionally been used as a as a an element that you would draw on or paint on but in this case the paper is used as a building material so the building material itself is or the space itself is the canvas",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3066.56,
    "end": 3075.605,
    "text": " And because of its translucent nature, we were looking at how the environment around the building would map on to those spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3075.866,
    "end": 3085.971,
    "text": "So in a sense, what you're walking into is a spatial, immersive spatial experience of the environment moving around the room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3087.472,
    "end": 3101.92,
    "text": " through the sun's movements, mapping different realities, whether it be trees or the framing of the building, into that room, and for that environment to change over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3101.96,
    "end": 3109.024,
    "text": "So with the rain and the sun, the actual degradation of that environment would also be present in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3109.944,
    "end": 3136.593,
    "text": " and then also you're able to infuse the um we used to use primitive days in australia the glue that comes out of eucalypt trees to combine with ash to create a kind of cement so the idea of using those different natural glues to create smells eucalypt smell for instance is used as an antiseptic you can use um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3138.658,
    "end": 3163.124,
    "text": " paper material like a kind of sponge that can emit smells and almost create a kind of natural outdoor environment inside you know what i mean so we we were interested in developing those naturalized experiences in cubic spaces",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3164.884,
    "end": 3169.627,
    "text": " And then basically collapsing the whole building and recycling it and making it into a book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3169.867,
    "end": 3171.068,
    "text": "That was the whole concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3171.088,
    "end": 3174.711,
    "text": "So it was a pop-up building that was made into eventually a book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3176.652,
    "end": 3177.773,
    "text": "We've also been working in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3180.268,
    "end": 3203.87,
    "text": " in asia this is a project we did in south korea two years ago and this is a um an embodiment project where we essentially understood it is in seoul um that the city of seoul is like 80 percent of south korea is made out of granite uh mountains so it's a very mountainous country",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3204.791,
    "end": 3211.354,
    "text": " But Seoul is in a kind of delta, but it's surrounded by these granite monolithic hills.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3211.854,
    "end": 3216.957,
    "text": "And the hills are used for people to escape the city.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3217.277,
    "end": 3222.059,
    "text": "So they go up the hill, the mountain, and they see a different future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3222.119,
    "end": 3223.199,
    "text": "They see a different life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3223.319,
    "end": 3226.201,
    "text": "They get connected to nature, and then they go back into the urban realm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3226.801,
    "end": 3250.672,
    "text": " so what this project was about is encapsulating that natural getaway type space but bringing it into the city to change the dialogue about what a city could be in the future so we we would let's say decode those sorts of things and apply it to personality types whether it be a company personality type or individual",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3251.877,
    "end": 3278.989,
    "text": " we decoded a process of how those mountains came into being and how the geometry of those kind of geo-like, I think they're called tor structures, how they're formed and how they've been ceremonialized and celebrated through Korean art, through Asian art, you know, the whole,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3280.566,
    "end": 3284.149,
    "text": " idiosyncrasy of a piece of beautiful piece of stone or a piece of wood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3285.65,
    "end": 3299.823,
    "text": "And also, I didn't know this at the time, but Serpa is also the world center for these Neolithic structures, which in fact were hollowed out and used as primitive buildings, primitive",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3303.905,
    "end": 3305.606,
    "text": " ceremonial places, let's call them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3306.706,
    "end": 3321.572,
    "text": "So this relationship between the landscape and the identity, the cultural identity of South Korea as seen through this geological construct being made into an office building that provided this health benefit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3322.112,
    "end": 3328.935,
    "text": "So how did those health experiences work on a hillside walking up and how could we translate those experiences into a building?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3329.855,
    "end": 3348.884,
    "text": " so we we having absorbed all of that we would then go into sketch mode and track that geometry and communicate that geometry into plans and into elevations and then into experiences of how you would approach a building what's it look like at night as well as daytime",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3350.359,
    "end": 3356.322,
    "text": " How does the ground plane, car parking, roadway work with the subterranean retail?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3357.582,
    "end": 3362.864,
    "text": "How do all these relationships work if you follow that geometry?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3364.085,
    "end": 3374.189,
    "text": "To create a holistic kind of social tower construct, this kind of living version of the mountain brought into the city.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3378.07,
    "end": 3391.537,
    "text": " And in terms of breakout spaces, this is especially relevant today when we have a question mark about work and about what an office building is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3392.958,
    "end": 3399.281,
    "text": "What we're trying to say here that an office building isn't focused necessarily about work, and it's certainly not home, it's something else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3399.961,
    "end": 3425.867,
    "text": " and the something else thing is this sort of natural experience or place of elation place of joy where you go to to get enlightened so the idea of the building being a kind of tool for enlightenment to generate better ideas more progressive ideas and using nature to achieve that those links so that's what all this is about it's about sort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3428.449,
    "end": 3455.07,
    "text": " uh well in some sense it's sentimental but it's it's trick having gone through the process of embodying those physical experiences on site trips that we did and photographing that and studying the cultural identity it's then allowing us to then create that matrix of experiences into a form which go top to bottom across the building and form a different dialogue with the public realm",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3457.0,
    "end": 3463.161,
    "text": " So very much a building that changes throughout the day and forms different dialogue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3463.542,
    "end": 3483.766,
    "text": "Now, in terms of formulas, and I think formulas are a very relevant topic, the first formula that we put together was for the new Royal Children's Hospital here in Melbourne, 2007, which was opened by the Queen, where instead of, let's say, forming a kind of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3488.032,
    "end": 3494.341,
    "text": " That's sort of how to call it an artificial accord with the children who are being",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3497.401,
    "end": 3503.425,
    "text": " dealt with within the environment of the Royal Children's Hospital, we saw them really as small adults as opposed to children.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3504.045,
    "end": 3509.828,
    "text": "So we saw them as sophisticated people just like adults.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3510.449,
    "end": 3519.154,
    "text": "So the first issue was to not create a language for the building that was going to be somehow derogatory or form a poor",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3520.56,
    "end": 3536.182,
    "text": " poor support structure that's a poor support scaffold for the children so we wanted a sophisticated structure that could again elaborate that internal world of the child think about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3536.983,
    "end": 3559.368,
    "text": " how illness works in children who are stuck in their beds for say a month bed bound and institutionalized and and that sort of fearful relationship between doctor patient patient in big billion dollar hospital change all of those relationships so that it's no longer an institution but a place where you again not at home",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3560.208,
    "end": 3562.349,
    "text": " You're not in a hospital, you're somewhere else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3563.19,
    "end": 3564.751,
    "text": "You're in a place of enlightenment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3565.231,
    "end": 3568.733,
    "text": "And it's that enlightenment which improves your health and restores your energies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3570.325,
    "end": 3588.693,
    "text": " So seeing children differently than what we're told to think of children as being these sophisticated creatures that are curious about the world and cognitively assembling their world every day, just like we are, and forming identities in the same way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3589.434,
    "end": 3596.417,
    "text": "So we sort of created what might be called the first health code, solutogenic health code for a hospital.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3597.64,
    "end": 3605.886,
    "text": " And we didn't just use the solutogenic concepts that came from Aaron Antonovsky, which are all about coherence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3606.747,
    "end": 3619.376,
    "text": "We brought in concepts of evidence-based design, which stem from Roger Ulrich's work on natural light, and then looking onto nature, the Kaplan's work on soft fascination and nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3620.396,
    "end": 3623.418,
    "text": " and their concepts of attention restoration theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3624.099,
    "end": 3631.103,
    "text": "And we looked into Reggio Emilia schools in Italy, and we perhaps added another two or three concepts on top of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3631.543,
    "end": 3636.706,
    "text": "And we used the assemblage of blended formulas to create the hospital.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3637.267,
    "end": 3642.11,
    "text": "So it's not strictly about either evidence-based design or solutogenics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3642.19,
    "end": 3644.191,
    "text": "It's about an assembly or diversity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3647.25,
    "end": 3655.256,
    "text": " But essentially we're creating an environment that was made into an adaptable building, but the environment was the driver.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3655.597,
    "end": 3671.709,
    "text": "And the environment was there to form an escape from habitual activities and that would form a kind of soft interface, a soft and reflective interface that would retain your attention effortlessly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3672.63,
    "end": 3675.332,
    "text": "So this is all about kind of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3677.947,
    "end": 3693.153,
    "text": " capturing a quality in a building that is very similar to the qualities that you would have walking through a park where you're continually drawn into detailed areas and where you see the movement of light and air and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3694.093,
    "end": 3708.196,
    "text": " the general ecology as a living environment surrounding you um and washing through you so the idea of having a kind of soft washing of a soft environment how do you go about making a hospital out of that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3709.352,
    "end": 3710.973,
    "text": " So we systematize that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3711.013,
    "end": 3734.687,
    "text": "This is just a diagram of how the solutogenic process works in terms of building coherence from the focus on building intimate spaces, as well as public spaces, as well as family spaces, changing the relationship between how care goes from being you going to the care to the care going to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3735.387,
    "end": 3758.449,
    "text": " so the model of care here is about doctors and nurses in the healthcare system going to the child not the other way around um so it's complex in and of itself and that was a major tool for how we designed the building but then we're always cognizant of the natural nourishment that we get from natural light natural air currents uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3759.57,
    "end": 3762.832,
    "text": " pointing, for instance, the building towards the sun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3763.132,
    "end": 3771.436,
    "text": "So we embedded the circadian rhythm into the building and essentially made a building that was very similar to forest therapy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3772.057,
    "end": 3781.481,
    "text": "By mapping the journey through a park and translating that into a building, we would naturally have a good environment for people to be in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3782.242,
    "end": 3788.045,
    "text": "So this is the first time that we're really starting to focus on the pathways between the mind",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3789.065,
    "end": 3806.488,
    "text": " and the environment and how it changes our hormonal structures are so how it affects our central nervous system etc to produce positivistic results so this kind of linking between the environment and the body the mind and the body and architecture for the first time was established for us",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3807.83,
    "end": 3816.532,
    "text": " So in terms of intuition, the idea was to, we had an urban edge condition, but a fabulous park that we designed a building into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3816.572,
    "end": 3828.514,
    "text": "So what we were seeking to do is to push the building and migrate the building into the park, migrate urban form to point it towards the sun so that the building ended up pointing due north.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3829.094,
    "end": 3835.735,
    "text": "And by doing that, we're able to create parkland around the majority of the building.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3837.354,
    "end": 3861.474,
    "text": " And then what we're doing is embedding through drawing experiences of that parkland setting onto the outside of the building and through experiences of entering and walking through the building and then focusing in on the child in the bed and what their own experiences of self fascination could be within that environment to make sure they're restored as best as possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3862.455,
    "end": 3867.618,
    "text": " So we created effectively a model of salutogenesis into a building.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3867.658,
    "end": 3868.459,
    "text": "This is a $1.2 billion project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3868.479,
    "end": 3869.56,
    "text": "It had 2,500 rooms inside this building.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3874.83,
    "end": 3891.338,
    "text": " And we were dealing with all ages because it had researchers, you know, doctors, nurses, researchers that all ages focused around children who would start their journey within the Royal Children's Hospital as babies and perhaps still be going there as adults.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3891.759,
    "end": 3894.18,
    "text": "So we had to deal with all of the age groups in the building.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3894.2,
    "end": 3900.303,
    "text": "This is just a focus on how the night and daytime use of the building works in relation to nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3901.693,
    "end": 3909.439,
    "text": " The celebration, the historical cultural celebration of nature in its kind of picturesque Australia, naturally picturesque.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3910.559,
    "end": 3914.242,
    "text": "It's like a country garden and using those features in the building.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3914.982,
    "end": 3918.885,
    "text": "This is a picture of that picturesque landscape in Victoria.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3919.326,
    "end": 3923.589,
    "text": "This is our site before it was built on, which used to be a cricket pitch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3924.329,
    "end": 3928.416,
    "text": " And the cricket pitch points due north, interestingly, points due north.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3928.816,
    "end": 3931.04,
    "text": "And that became where we put our street.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3931.5,
    "end": 3938.992,
    "text": "And we created a street that would form the central social connection device through the building.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3940.718,
    "end": 3952.943,
    "text": " So this was us mapping qualities, visceral, textural, warm and inviting qualities of the park before we designed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3953.263,
    "end": 3959.825,
    "text": "So we're studying how the layers of soft fascination work, how shadows work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3961.246,
    "end": 3963.548,
    "text": " What's the sort of geometry of a tree?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3964.268,
    "end": 3967.23,
    "text": "What's that strange ergonomic quality of the trees?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3968.211,
    "end": 3969.312,
    "text": "How they cluster together?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3970.053,
    "end": 3972.374,
    "text": "What sort of light comes through a tree?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3973.075,
    "end": 3975.376,
    "text": "How does a bark texture work?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3975.617,
    "end": 3978.539,
    "text": "And what's the tone or quality of that tree?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3978.559,
    "end": 3984.043,
    "text": "So all of this was documented before we started to design.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3986.28,
    "end": 3991.104,
    "text": " And then we were embedding those experiences into circumstances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3993.186,
    "end": 3995.368,
    "text": "We developed up a colour palette out of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3996.129,
    "end": 4006.599,
    "text": "We created walls that reflected the kind of layered soft fascination, light quality of the park.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4007.423,
    "end": 4009.185,
    "text": " We went into great detail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4009.245,
    "end": 4019.315,
    "text": "This is almost like a one to one study of an edge of glass and how dots and patterns and soft curves were being used to evoke that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4020.196,
    "end": 4029.466,
    "text": "And then we created a bunch of experiences throughout all of the two and a half thousand rooms that evoke that those experiences into architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4030.507,
    "end": 4050.483,
    "text": " principally on the basis that the relationship between you as a person looking out into nature was a healthy one and nature was brought to life through the sun and what we're essentially doing is trapping the sun nature energy and bringing that into the building that was the essential relationship",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4051.963,
    "end": 4053.485,
    "text": " And then we were personalizing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4053.645,
    "end": 4064.997,
    "text": "So avoiding institutionalized replication, we were interested in having each of the 2,500 rooms different to one another as well, which is a pretty high order of complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4066.218,
    "end": 4071.104,
    "text": "This is the plan of the inpatient unit, which was shaped as an organic star-shaped",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4072.425,
    "end": 4074.106,
    "text": " for practical functional reasons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4074.826,
    "end": 4083.853,
    "text": "But because we did that, we're able to break the experiences of the nurse station relationships with the children into smaller packets of space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4084.794,
    "end": 4095.662,
    "text": "And then we were able to open up the corridors into collective space rather than corridor space to make more of a home and a kind of focus point for the different spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4095.702,
    "end": 4099.285,
    "text": "So I guess what I'm trying to say without going into great detail is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4099.745,
    "end": 4118.728,
    "text": " within each of the spaces either at a very microscopic detailed material matter perspective or spatially speaking how rooms relate to corridors or how a building relates to a park all of those the different scales they were all treated with the same level of care",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4121.278,
    "end": 4137.098,
    "text": " Again, focuses on, again, associated with the soft fascination, how this kind of dot matrix that was encircling the building, how it resonated with the eyes and how it would change with time of day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4137.839,
    "end": 4138.759,
    "text": " that would come to life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4139.42,
    "end": 4152.064,
    "text": "We used energy saving techniques to surround the building with these glazed sun canopies that were made out of coloured glass, made out of dots of different colours and different shapes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4152.984,
    "end": 4174.126,
    "text": " and because we're able to map the trees outside into this space the and because we're making these sun canopies out of glass we're able to create a kind of transcendent experience of the edge of the building that was bringing that energy deep into the heart of where the children were living and this is how the external building",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4175.027,
    "end": 4175.688,
    "text": " came about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4175.708,
    "end": 4184.175,
    "text": "So we're literally translating the foreground of nature and wrapping it into the building to form a blurred relationship between building and landscape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4186.396,
    "end": 4189.078,
    "text": "So it's very firmly embedded into the landscape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4189.179,
    "end": 4191.28,
    "text": "It's an extrapolation of the landscape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4193.182,
    "end": 4199.167,
    "text": "So in terms of the geometry, it started with the tree geometry and you can see this in the shadows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4200.094,
    "end": 4217.986,
    "text": " But then if you look at those kind of arms that are coming out of the tree, we wanted to utilise that geometry for how we constructed the larger spaces, whether it be waiting spaces or the bridges or the textures in the internal cladding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4218.866,
    "end": 4238.352,
    "text": " how these bridges that came in and out of the different functional areas of the building would crisscross the street and how they would assemble themselves into these kind of nooks or torsion sculptures that were very similar to the outside world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4240.845,
    "end": 4263.002,
    "text": " so whether it's an area of compression or a concept about the scale of an object like the scale of a bridge or the scale of a of a of a staircase how those large-scale pieces would relate to a child's mind's eye in even though you're in a large space these large-scale pieces",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4263.743,
    "end": 4275.808,
    "text": " were being assembled to kind of deinstitutionalize, but also form a sympathetic relationship to the scale of a child and the joy of a child's mind's eye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4278.269,
    "end": 4291.134,
    "text": "And on the outside, just looking at how the sunshades, again, would replicate the pattern language of the trees into a kind of foliage",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4292.423,
    "end": 4296.965,
    "text": " that changed color and patina depending on the time of day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4298.625,
    "end": 4302.246,
    "text": "So that was kind of very interesting process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4302.646,
    "end": 4305.707,
    "text": "And after, I guess, we finished it,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4309.068,
    "end": 4315.31,
    "text": " it changed my paradigm or changed my thinking of architecture as being a tool for health, full stop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4316.071,
    "end": 4327.675,
    "text": "So since then, since 2007, all of the work that I've been doing has been associated with health and seeing cities as generators for health.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4331.497,
    "end": 4336.559,
    "text": "And so once you get to that position, you then start to think, well, is nature...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4338.07,
    "end": 4345.716,
    "text": " or our job in translating nature all associated with the natural world like a rural park and using self fascination?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4346.236,
    "end": 4352.341,
    "text": "Or is it something that's more associated with human psychology and the nature of being human?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4353.262,
    "end": 4364.471,
    "text": "And I guess the latter concept came into being kind of more recently with work that we're again doing in South Korea, which we call trans buildings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4365.683,
    "end": 4372.396,
    "text": " which are less simple translations of nature, which actually focus more on human nature in buildings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4373.478,
    "end": 4375.0,
    "text": "And this project was in Itaewon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4376.583,
    "end": 4378.267,
    "text": "And it was a project for a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4380.111,
    "end": 4395.443,
    "text": " a private members club and you probably know Soho House and buildings of such life in big cities where members come together in private realms to celebrate big members.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4395.903,
    "end": 4402.068,
    "text": "What we were doing here is changing that paradigm and forming a private members club that was much more public.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4403.804,
    "end": 4408.787,
    "text": " So unpacking a singular building and making it into a kind of civic domain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4409.447,
    "end": 4412.589,
    "text": "So creating public space out of a private building.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4413.569,
    "end": 4423.034,
    "text": "And then in the site, forming a different relationship between buildings and their environment, making a more ambiguous relationship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4424.054,
    "end": 4428.696,
    "text": "So the buildings were seen as sculptures and kind of like non-buildings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4431.214,
    "end": 4435.73,
    "text": " They were broken down into pieces, so it became a district as opposed to a building.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4436.949,
    "end": 4452.298,
    "text": " And what we were trying to do again is to change the psychological relationship between the people inside the building and the building itself, but also the members of the public who are looking onto the building and forming a questioning relationship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4452.838,
    "end": 4459.502,
    "text": "So kind of imbibing an existential crisis, if you know what I mean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4459.943,
    "end": 4464.826,
    "text": "So seeing a building as being a partner in the journey of existence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4465.646,
    "end": 4488.317,
    "text": " in the crisis of existence and the questioning of existence um and not necessarily being a utopia but being kind of just a living piece of city and we're also interested in how the new world of virtual reality is coming into being so trying to establish a building that can go into the metaverse as well so we co-located",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4488.897,
    "end": 4501.906,
    "text": " the idea of a new virtual building with an existing building to form a more hyperreal form of architecture, which I'll come on to perhaps later in the conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4502.346,
    "end": 4517.797,
    "text": "But the environment was a very interesting context where we had the most international district of Seoul, a place fraught with social friction,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4519.908,
    "end": 4524.411,
    "text": " A dishevelled environment that was very popular came to life at night.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4525.172,
    "end": 4536.939,
    "text": "So a lot of kind of non-likeable features in a very broad sense that naturally come about in cities and embracing that rather than critiquing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4537.92,
    "end": 4544.144,
    "text": "But trying to form very beautiful cinematic environments which were highly evocative",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4545.339,
    "end": 4554.614,
    "text": " making buildings that were charged with that kind of psychological tension, using materials that were hard to describe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4555.656,
    "end": 4557.559,
    "text": "So in this case, it was 3D printed wood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4559.504,
    "end": 4567.326,
    "text": " and seeing the building as an outside face, but having a completely different internal world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4567.346,
    "end": 4572.447,
    "text": "So sort of, in a sense, evoking what we're like as people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4572.507,
    "end": 4584.03,
    "text": "We have an external appearance, but we have a highly complex and changing internal world, forming similar relationships in a building, and then making a building that was ambiguous as to what it looked like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4586.491,
    "end": 4587.151,
    "text": "Having gone through...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4589.508,
    "end": 4592.23,
    "text": " an interest in this essay by J.G.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4592.31,
    "end": 4596.952,
    "text": "Ballard, his fabulous written piece on the Garden of Time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4597.993,
    "end": 4616.003,
    "text": "We then started to, we don't have time to go into that, but we then got into translating all of that into art pieces, which then came into physical experiences of the buildings disappearing underground and the exploration of an underground world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4617.392,
    "end": 4630.105,
    "text": " So essentially arriving at an assemblage of buildings, half of which are above ground, half of which are below ground, appearing as these concrete, simple prismatic volumes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4634.289,
    "end": 4637.312,
    "text": "And quite stern and monolithic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4641.744,
    "end": 4664.803,
    "text": " and using water at the base of the buildings to cleanse the buildings and the environment, to then looking at how the internal world worked as a more organic place, and, contrary to the prismatic volumes on the outside, looking at a much more bodily-like sequence of spaces on the inside.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4666.553,
    "end": 4677.616,
    "text": " So whether you're arriving at the retail or the rooms within the private club or arriving by car, you're sort of arriving inside a body and having a very different relationship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4678.296,
    "end": 4693.501,
    "text": "And then the two worlds then connected and we started to look at how windows worked in the building, how the concrete would reduce to fabric, would transcend and change into glass and how different relationships were working through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4694.261,
    "end": 4710.909,
    "text": " different spaces and how that would become organically expressed into different sorts of thresholds which were more more bodily type thresholds to form a building that was kind of half building half body",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4718.601,
    "end": 4725.844,
    "text": " And then looking at how the concrete in the evening would then recede back to become a more translucent material.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4727.204,
    "end": 4736.828,
    "text": "So the idea of the buildings kind of being more translucent during the nighttime and solid during the daytime and having that ephemeral quality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4740.874,
    "end": 4765.544,
    "text": " And now, lastly, we've been working on the new hydrogen economy in South Australia in a place called Waiala, looking at how to use new materials like green steel, how to repurpose industrial buildings, but looking at how principally the ecosystem, how the industrial ecosystem can create a more humanised",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4768.374,
    "end": 4792.39,
    "text": " urban world so we've got we're on the edge here of looking at how the urban reality of this new city is going to grow because of hydrogen energy how the relationship between energy the earth manufacturing and urbanization triangulate into a more holistic paradigm by looking at all of the different ecosystems being embedded into one another",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4793.567,
    "end": 4812.658,
    "text": " So starting with nature and the natural reality of the site, the ecology of the site, how the ecology has been manifest into structures, whether it be old timber piers or old existing buildings into a kind of embedded memory of the site.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4814.185,
    "end": 4836.004,
    "text": " we're recording in a sense what the memory the cultural ecological memory is of the site and then we're translating that into a shape language an experiential language that then overlays into the new housing project that we're doing to generate experiences that capture those",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4837.344,
    "end": 4843.806,
    "text": " that sort of existing experience and manifest into a bolder, bigger identity for the city.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4844.306,
    "end": 4847.027,
    "text": "So these are sketches as they translate into new house.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4849.147,
    "end": 4860.09,
    "text": "So sort of balance between the sculptural world of found objects on a beach made into a piece of architecture, forming a new city out of all of those embedded memories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4863.516,
    "end": 4873.623,
    "text": " So I guess Daniel and the audience, if we've got any audience left, what all of that constitutes is a kind of flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4874.084,
    "end": 4881.229,
    "text": "And the reason why I presented you like that is it represents a kind of intellectual, theoretical, practical, artistic flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4882.169,
    "end": 4884.752,
    "text": " that represents how creative cognition works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4885.773,
    "end": 4898.044,
    "text": "And I guess the overall ambition is that because of that coiling process, we end up with a much more coherent and friendly human celebratory world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4898.585,
    "end": 4900.787,
    "text": "And that's a world that we all need and deserve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4907.486,
    "end": 4924.377,
    "text": " wow i guess i would have said i'm not sure where the spiral ends but of course it doesn't end yeah it doesn't end absolutely yeah well please continue",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4927.662,
    "end": 4944.458,
    "text": " I mean, from my perspective, I see the institutionalization of the world of architecture, the world of property development, the world of law, the world of politics, the world of industry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4946.922,
    "end": 4959.92,
    "text": " having behaved poorly, let's say, in the past, or perhaps, narcissistically speaking, evolving systems that serve their own ends in their own ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4960.621,
    "end": 4982.876,
    "text": " But we're now sort of in an environment where we can actually bring all of those pieces together and to form a self-reinforcing, self-improving networks and thoughts and processes that can actually inform and manifest a better physical world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4983.877,
    "end": 4996.889,
    "text": " So it does mean that as an artist, architect, you are interested in politics, you are interested in industry, you are interested in AI, for instance, because you're interested in consilience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4997.27,
    "end": 5005.137,
    "text": "You're interested in tying together the different disciplines, just like how nature works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5005.958,
    "end": 5007.62,
    "text": "You're in dialogue with the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5008.891,
    "end": 5016.294,
    "text": " So in a sense, all of this is, is naive in the sense that all that is, is a replication of natural process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5022.216,
    "end": 5034.001,
    "text": "It was an incredible presentation and I have many pages of notes, but first to kind of lead into that, I would love to hear about your engagements and encounters with Carl Friston at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5037.422,
    "end": 5044.228,
    "text": " Well, like here, I went through a very similar kind of presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5044.288,
    "end": 5046.09,
    "text": "And I guess what was interesting, I didn't know",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5047.199,
    "end": 5057.629,
    "text": " how it would resonate, or whether it would, whether it's just me fantasizing that it had something to do with free energy and active inference, but I had a very strong hunch that it did.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5057.649,
    "end": 5070.121,
    "text": "And I guess what I'm what I got from it that very, very much indeed does correlate very strongly with the embedded principles",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5070.862,
    "end": 5099.394,
    "text": " that carl's work is all about and um i think he was very pleased uh to see it being translated in this discipline in this way um and i felt relieved to be quite to be quite honest you daniel talking to someone of the stature and caliber of someone someone like carl um to be able to talk directly with him and the people around him who are all excellent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5100.515,
    "end": 5103.979,
    "text": " was extremely fascinating and beautiful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5103.999,
    "end": 5110.146,
    "text": "I mean, I see it as a kind of the way, I just see it as the way forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5111.548,
    "end": 5114.111,
    "text": "And I'm excited to understand how it can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5115.742,
    "end": 5134.972,
    "text": " translate into a process in a way, not in artificializing that process, naturalizing it, but able to encapsulate the complexity logically so that people can understand, can get on board, so we can deinstitutionalize this logic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5135.859,
    "end": 5139.144,
    "text": " and spread the word, if you know what I mean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5140.126,
    "end": 5144.312,
    "text": "Spread it around and encourage participation and experimentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5147.498,
    "end": 5154.982,
    "text": " So I got the kind of, if you know what I mean, the collapse of boundaries in the conversation with Carl.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5156.403,
    "end": 5159.265,
    "text": "Because it can go into all areas, of course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5159.765,
    "end": 5160.946,
    "text": "It goes into all areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5161.446,
    "end": 5166.449,
    "text": "I'm just showing how it translates in the way I do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5171.812,
    "end": 5182.135,
    "text": " I think it needs a long time to kind of just sit there and discussions to spring from here, you know, to spring, to get going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5183.075,
    "end": 5185.316,
    "text": "I see this spinning into all sorts of different areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5185.396,
    "end": 5187.957,
    "text": "So, I mean, at the moment we're looking at",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5190.04,
    "end": 5193.864,
    "text": " how to utilize this in coding terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5194.564,
    "end": 5196.946,
    "text": "So I'm interested in computation and statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5197.607,
    "end": 5201.611,
    "text": "I'm interested in urbanism, like making new cities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5202.912,
    "end": 5208.977,
    "text": "So how we translate this into we're building a $200 billion new rail loop around the city of Melbourne.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5209.438,
    "end": 5215.884,
    "text": "How this can translate into new districts and new cities and how we can break down this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5218.504,
    "end": 5232.323,
    "text": " between new things and, I don't know, new cities, which are typically unfriendly, unloved and unwanted into being coveted",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5234.383,
    "end": 5237.025,
    "text": " people aspiring to move into these things, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5237.185,
    "end": 5238.586,
    "text": "And we never got that right, ever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5239.646,
    "end": 5243.069,
    "text": "I mean, since Paris, you know, we've never got it right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5243.629,
    "end": 5263.722,
    "text": "So the idea is to actually, is to get something finally up and running, which represents an opportunity to do something at a regional level, a local cultural community level that perpetrates evolution at different scales in different areas through a process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5266.172,
    "end": 5267.072,
    "text": " kind of open source.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5270.773,
    "end": 5271.973,
    "text": "Very fascinating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5272.133,
    "end": 5289.898,
    "text": "Again, there's so many places that I want to just touch on because I think you do present so many contact points and ways of expressing that will resonate with active inference enthusiasts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5290.798,
    "end": 5294.479,
    "text": "And I guess the starting point is...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5295.45,
    "end": 5318.936,
    "text": " the learned well nook so yeah you were taking those measurements because they were informative you were updating your cognitive model from your sensory input and that changed your generative model it also may have been actionable information it may have been folded through an iterated realized process back into the design and then fundamentally",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5319.972,
    "end": 5322.133,
    "text": " that's an attracting space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5322.193,
    "end": 5324.633,
    "text": "It's an attractor or a dwell space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5325.114,
    "end": 5339.398,
    "text": "Just like if you had a landscape and you were shaking up a ball on the landscape, it would dwell as you turn down the temperature and slow down the shaking, it would dwell probabilistically according to the features of that landscape.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5339.998,
    "end": 5346.64,
    "text": "And that concept of attractor points, attracting sets, and then also wandering sets and moving points",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5347.712,
    "end": 5368.586,
    "text": " nooks which is something that may be able to happen in a digital space or it might be a mobile element or movement is all just a question of over what time frame that idea of the attracting set and of things existing by virtue of what their attracting set is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5369.938,
    "end": 5395.591,
    "text": " that's the heart of the free energy principle so starting with the dwell on a surface and then i'm sure there must be a point in the design where it's like so we saw 50 this and 50 that do we want to carry that forward or are we looking for like 80 20 or do we want 40 40 20 with a new affordance being introduced through landscape modification",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5396.591,
    "end": 5399.054,
    "text": " It completely fluently touches on it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5399.094,
    "end": 5409.324,
    "text": "And I just love that learned well photography, because I think probably many of us with cameras in hand now have our own little peculiar brand of photography.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5409.384,
    "end": 5410.585,
    "text": "And then what does that say about us?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5411.866,
    "end": 5412.066,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5413.167,
    "end": 5414.929,
    "text": "Daniel, what do you think about this whole...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5416.937,
    "end": 5439.736,
    "text": " world that that sits in terms of free energy, active inference and how cognition works in relation to creative process, creative cognitive process, as let's say creative cognitive process being kind of symbolic representation of cognitive processes as a sort of exploration as a projection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5440.316,
    "end": 5441.157,
    "text": "What do you think about that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5442.964,
    "end": 5448.705,
    "text": " Well, we may have to revisit it multiple times, but here's what I wrote down, perhaps touching on it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5449.346,
    "end": 5465.329,
    "text": "You showed a image of a photograph of some metal that reflected the idealized and the actualized construction of the I-beam coming together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5465.349,
    "end": 5466.51,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5466.69,
    "end": 5467.57,
    "text": "And that...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5468.886,
    "end": 5476.796,
    "text": " both of them had differences that were materialized differences through time and weathering and context.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5477.357,
    "end": 5478.298,
    "text": "And it was an assemblage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5478.338,
    "end": 5480.281,
    "text": "So there was like all of this richness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5480.341,
    "end": 5482.984,
    "text": "And I thought, wow, it's an I-beam.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5483.345,
    "end": 5484.826,
    "text": "That's like the self.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5485.027,
    "end": 5486.228,
    "text": "That's like the I-beam.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5486.989,
    "end": 5499.075,
    "text": " And then there's a comparison of the idealized I, even of just approximately idealized I, like I could be standing up right now or I could pick up that object.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5499.855,
    "end": 5514.863,
    "text": "That kind of idealized, counterfactual, adjacent possible, the abductive, the associative, the creative that exists in our liminal proximity of the I. And it's like, and then...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5515.763,
    "end": 5534.812,
    "text": " It's all about the image that was shown with this sometimes horrific, but sometimes beautiful juxtaposition of the real and the actual I, or moving it a little bit out of psychology, like the real and the actual self model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5535.753,
    "end": 5538.554,
    "text": "And then our calibrator on that is variational free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5539.995,
    "end": 5540.175,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5540.195,
    "end": 5540.275,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5546.343,
    "end": 5555.293,
    "text": " But you know, this kind of... How do you say it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5556.154,
    "end": 5557.155,
    "text": "The concept of the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5558.689,
    "end": 5580.575,
    "text": " the talk was about naive architecture or naive approach which is a kind of you as vessel for that complexity so you're sort of living manifestation of that complexity as a person as a human being you're not you know i'm not a tree i'm not a plant i'm a human being but that cognitive process",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5582.006,
    "end": 5606.182,
    "text": " and natural biology and the coincidence of those two realities being brought together as a cognitive process that manifests that expression of the, well, it's sort of the first loop is you absorbing and then expressing, and then the expression becomes the physical manifestation of that thought process being the substrate that you live in, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5606.262,
    "end": 5610.665,
    "text": "So that whole Churchillian concept of, you know, buildings make,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5612.148,
    "end": 5624.635,
    "text": " you know, we make buildings, building make us, that whole loop system, you know, it's obviously been proven to be right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5625.155,
    "end": 5628.317,
    "text": "And cities can either be pathogenic or salutogenic, you know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5629.996,
    "end": 5656.025,
    "text": " what how many cities in today's world in modern sense are syllogogenic cities none you know you go you'd have to go back to the villages and towns and blah blah which which are very much um tight manifestations of humanity in in a sense in a physical manifestation sense um and the abstracted",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5658.109,
    "end": 5666.532,
    "text": " I would call it Excel spreadsheet logic where you take one element and then extrapolate cities out of that one element, loses all of that nuance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5667.732,
    "end": 5686.138,
    "text": "So now being in a situation where we understand that nuance and we understand the importance of that nuance, there are elements but also links in that nuance matrix that we can almost calibrate and we can capture them, we can embody them, we can recreate them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5687.136,
    "end": 5705.242,
    "text": " And now we've got this kind of opportunity within that sort of febrile matrix of stuff that's in part facts, that are math-based facts, in part just visual reflections or actual photographs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5708.223,
    "end": 5713.645,
    "text": "But we're now able to kind of like bring all of that together as a sort of more complex arrangement of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5715.069,
    "end": 5725.838,
    "text": " to manifest something as the new paradigm that forms that sort of partner in our cognitive process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5727.64,
    "end": 5735.066,
    "text": "That's not an enemy to our cognitive process that forms the coherence and the natural.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5735.387,
    "end": 5737.328,
    "text": "It's our natural place, if you know what I mean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5737.368,
    "end": 5740.111,
    "text": "It's the sort of Heidegger space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5740.291,
    "end": 5741.592,
    "text": "It's the place of dwelling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5745.014,
    "end": 5746.334,
    "text": " Yeah, a lot of angles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5746.674,
    "end": 5751.656,
    "text": "It's the William Blake dialectic songs of innocence, songs of experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5752.336,
    "end": 5755.357,
    "text": "But I want to connect, again, the visual representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5755.417,
    "end": 5760.298,
    "text": "What do these visual, what even are we looking at?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5760.898,
    "end": 5765.48,
    "text": "It's something I asked myself probably on two thirds of the slides.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5765.56,
    "end": 5769.661,
    "text": "I was like, is this, if there wasn't a person in the frame, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5770.014,
    "end": 5772.177,
    "text": " I was like, is this a microscope?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5772.297,
    "end": 5773.218,
    "text": "Is it VR?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5773.338,
    "end": 5774.34,
    "text": "Is this aerial footage?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5775.061,
    "end": 5780.808,
    "text": "And sometimes probably even if then later on, oh, that's four trees.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5781.189,
    "end": 5782.21,
    "text": "But it's like, but is it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5782.831,
    "end": 5786.776,
    "text": "And all of that richness of the temporally thick,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5787.978,
    "end": 5812.75,
    "text": " interpretive process and also the relationship between like the synchronous audio visual and the eye saccades a lot of other features that we can quantify um there was a scale freeness or a scale ambiguity a system ambiguity and the mathematics of active inference and the free energy principle are scale free or we could say scale friendly which is to say they don't",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5813.652,
    "end": 5835.021,
    "text": " host or hinge on any specific or particular system or scale it's not a framework about brains but it can be used to paint or express models of brains and so that meta-theoretical position which may",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5836.147,
    "end": 5846.654,
    "text": " have more resonance with the creative encounter or the kind of like massively collaborative and global projects that you described.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5847.334,
    "end": 5860.322,
    "text": "That setting from a praxis angle, especially with augmented and synthetic intelligence, may come to be closer to the process of active inference modeling than 1995 or 2015 writing a statistics program.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5865.424,
    "end": 5867.605,
    "text": " Yeah, I think so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5868.345,
    "end": 5869.146,
    "text": "I'm with you on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5869.446,
    "end": 5870.106,
    "text": "I think it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5870.647,
    "end": 5883.453,
    "text": "I think it's really, it's kind of experimental, actual experimentation of the free energy, the world of free energy and the successes of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5884.334,
    "end": 5885.814,
    "text": "We can see and experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5886.675,
    "end": 5887.655,
    "text": "That's the joy of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5888.035,
    "end": 5894.599,
    "text": "And I think I also would like to say that with studying how creative people",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5895.677,
    "end": 5921.276,
    "text": " process works you're almost peering inside free energy as well i mean i this is just me talking and i don't know speaking whether i'm right on this or not but it just feels to me that it's a rich source of um information to unpack that actually could provide some really good strong direction for the future",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5922.89,
    "end": 5951.446,
    "text": " the the piece that really left an impression on me that makes me think you you said right there the successes the realized successes successes only in principle are hypothetical the real ones are real and you mentioned in the copper for the washington dc building that you wanted to make it idiosyncratic yet reproducible and that's like the magic quadrant",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5952.56,
    "end": 5967.467,
    "text": " Like we have technologies of reproducibility without idiosyncraticity, plus externality, plus affective pathology, et cetera.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5968.588,
    "end": 5977.212,
    "text": "And so this quadrant or space with the idiosyncratic and reproducible, and then it was like, it's a top-down heating machine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5978.512,
    "end": 5981.674,
    "text": "And so in some ways, the realized material artifact",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5983.027,
    "end": 6001.495,
    "text": " becomes like the crucible or the eye of the needle where the generative process, the process that leads to the artifacts deposition or accretion or however it's built, it's a demonstration of the sense-making and the aesthetics and the technical capacity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6001.695,
    "end": 6006.117,
    "text": "It's like, wow, they brought that rock from here to here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6006.977,
    "end": 6009.998,
    "text": "And then did they do it this way or that way?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6010.098,
    "end": 6011.039,
    "text": "And people today,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6013.14,
    "end": 6040.877,
    "text": " discuss and debate how did they do that building how did they do that building and so it's like the archetypal logistics operational setting construction physical construction is the tip of the iceberg of the physical and informational supply chain and all of those for those who have the generative models to see we look at the obelisk from rome and that is like a big",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6042.305,
    "end": 6062.109,
    "text": " rock and it ripples for those who have knowledge of that setting but also the footprints of an animal to another animal or the pheromone of one ant nest mate to another ant nest mate or all these other like infinite last miles and those are all yes ands with each other",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6063.717,
    "end": 6072.416,
    "text": " they're not in contradiction to each other and neither is it a contradiction to have a unified way to discuss and approach that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6073.772,
    "end": 6074.012,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6075.492,
    "end": 6085.575,
    "text": "So within your work and within the studies of active inference, how are you critiquing or unpacking modernity in cities, in buildings?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6085.815,
    "end": 6092.517,
    "text": "How is the world of active inference being explored in the physical domain?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6092.777,
    "end": 6094.618,
    "text": "Or is it being explored?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6095.698,
    "end": 6102.88,
    "text": "But when it is being explored, how sophisticated or long-term has the research been?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6105.175,
    "end": 6106.796,
    "text": " All great questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6106.896,
    "end": 6117.061,
    "text": "The first thing that came to mind is that there's been some work on the affective and the physiological and the interoceptive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6118.242,
    "end": 6132.97,
    "text": "And while there has been, for example, models of movement within a maze, to really get to the point of a simulated model",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6135.43,
    "end": 6160.118,
    "text": " being more than just an intuition pump, which can be more than enough itself, but for it to be more than that really at this point in time requires a team professional effort that to the few extents it is happening is probably happening in proprietary settings, but we do everything we can to highlight the open source capacities",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6161.777,
    "end": 6163.659,
    "text": " And the kinds of models that people are building.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6163.679,
    "end": 6176.347,
    "text": "I think one setting that is pointed to a lot, but also has not received that much empirical or open source work is like ecosystems of shared intelligence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6177.408,
    "end": 6184.833,
    "text": "Instead of just talking about the physicality of the Internet of Things or IoT or everything in that space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6186.184,
    "end": 6197.214,
    "text": " being able to integrate the spatial and the ergonomic, like you pointed to earlier with efforts to provide something like a meter stick, but we're not just looking for distance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6197.274,
    "end": 6201.518,
    "text": "We want something to calibrate the construction or the architecture process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6202.038,
    "end": 6206.822,
    "text": "And at hand was the industrial or potentially modern system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6207.803,
    "end": 6212.567,
    "text": "And then what I saw right from the beginning of the presentation was like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6213.9,
    "end": 6234.583,
    "text": " yearning for a compliment or a juxtapose or the shadow of that and affective cognitive science now being able to kind of square that circle or however you want to think about that where it's like well we could organize our project around people's sense of narrative fulfillment",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6235.899,
    "end": 6237.98,
    "text": " And that could have disastrous ecological consequence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6238.3,
    "end": 6240.68,
    "text": "So let's care about the narrative and the ecological.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6240.78,
    "end": 6242.36,
    "text": "Okay, but then the business might not exist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6242.661,
    "end": 6244.661,
    "text": "All right, bring it into the generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6246.161,
    "end": 6249.062,
    "text": "What do people think about what we have now?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6249.842,
    "end": 6251.643,
    "text": "And that must iterate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6251.843,
    "end": 6253.543,
    "text": "That must be intermodal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6254.543,
    "end": 6257.284,
    "text": "And so that allows the imbuing of...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6258.556,
    "end": 6282.277,
    "text": " all these different aspects that that for me were evoked when you talked about like soft attention whereas in science and technology and math which was only one-third of your three-piece pie a soft attention can be a boon for a beginner",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6283.149,
    "end": 6284.069,
    "text": " in scoping out the space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6284.809,
    "end": 6293.611,
    "text": "It can also be a pleasure and a tool for an expert who's able to have a soft background and then sharpen attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6295.731,
    "end": 6300.352,
    "text": "But to be useful, one has to be on the other side of that innocence and experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6302.032,
    "end": 6312.014,
    "text": "And that's a tough learning curve because there's, and no one is ever gonna be able to have all of the hard attentional regimes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6312.895,
    "end": 6313.735,
    "text": " There are just too many.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6313.755,
    "end": 6317.137,
    "text": "It's just like trying to know every language or like, no, it's like, it doesn't even make sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6317.197,
    "end": 6320.759,
    "text": "It's not even preferable, like for any number of reasons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6321.999,
    "end": 6323.98,
    "text": "And then it's like, well, so what do we do?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6324.02,
    "end": 6337.627,
    "text": "But it's like, but there we are scratching our heads, talking about how we're going to create living re and make it work physiologically, if not far, far more than physiologically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6339.359,
    "end": 6353.211,
    "text": " as a group, as a team, as probably discussions have always happened leading to the enculturated and lovable structures that we love.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6355.913,
    "end": 6360.838,
    "text": "And so I love how you use words, it's fantastic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6364.961,
    "end": 6382.713,
    "text": " See, I would sort of say that diversity, that what is enabled to get hold of, to grab in, bring in to a creative process, if you have a porous or agile process, allows you to bring anything in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6383.774,
    "end": 6389.718,
    "text": "Always made me feel as though when a project came about, I would always say, well, there's a million buildings here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6390.158,
    "end": 6391.939,
    "text": "Which one do we want to build?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6392.22,
    "end": 6393.621,
    "text": "Which one do we want to design?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6394.361,
    "end": 6413.115,
    "text": " and that was kind of a fairly alien concept to a lot of people in my industry or in my education certainly people wouldn't want talking those terms because it had always been trapped by some cultural doctrine that one had to be a post-modernist one had to be a deconstructivist",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6413.855,
    "end": 6416.338,
    "text": " a regionalist, a modernist, this or that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6416.859,
    "end": 6429.614,
    "text": "There was always some sort of virtuous theoretical underpinning to something that was determining what you were basically institutionalizing what things should be like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6430.555,
    "end": 6456.528,
    "text": " for for whatever reason for power influence money whatever it is we were trapping a process thing um codifying it and then telling everyone that they had to be in that box whereas what we're talking about now is totally liberated it's totally free for being what it it should be so my yearning for craft my yearning for vernacular architecture",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6457.734,
    "end": 6480.475,
    "text": " my yearning for that hard to describe soft granular environment that I like so much in the old world in inverted commas or or seen in agrarian structures um I can now talk about in terms of how professionals talk to one another how teams are made how um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6484.406,
    "end": 6493.549,
    "text": " The intangible has now become sort of tangible through the ability of talking about it in terms of free energy, neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6493.91,
    "end": 6498.951,
    "text": "It's enabled us to actually bridge the gap between qualitative and quantitative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6499.172,
    "end": 6504.854,
    "text": "And that's the joy of it, of being able to go from an artist wandering in the bulrushes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6505.894,
    "end": 6524.591,
    "text": " feeling utopian, but creative and curious, manifesting things to really having a quantifiable opinion about something and being able to capture it, compartmentalizing it without losing the nuances, compartmentalizing it and explaining it to someone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6525.171,
    "end": 6528.634,
    "text": "And then, you know, it'd be like sort of engaging someone to design your house.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6529.335,
    "end": 6533.098,
    "text": " Quite often what would happen, you'd end up with arguments with your architect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6533.538,
    "end": 6536.4,
    "text": "You'd end up with something that you didn't want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6536.42,
    "end": 6545.987,
    "text": "You probably went through some sort of mood board analysis or gave him some sort of brief or them some sort of brief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6546.828,
    "end": 6550.791,
    "text": "But there's always been this hard boundary between what you want as a person",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6551.651,
    "end": 6554.733,
    "text": " and what someone else is giving to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6554.753,
    "end": 6566.382,
    "text": "And I think what this is enabling is a soft sort of navigation or translation or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6569.858,
    "end": 6590.323,
    "text": " arbitrage this sort of soft and giving arbitrage between you and the environment you and someone else you and a large corporation that enables both parties to come together around a common set of values that enables that negotiation of the arbitrage to work in everyone's interests",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6591.496,
    "end": 6606.322,
    "text": " So I think what sits underneath all of this, it's translating, yes, into an architectural placemaking philosophy and place being a kind of maybe closely associated with coherence, I would say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6606.462,
    "end": 6611.784,
    "text": "But anyway, the idea of it being a negotiation tool, I love that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6612.564,
    "end": 6620.887,
    "text": "I love the environment as being an expression of truthful, coherent arbitrage of relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6625.009,
    "end": 6625.429,
    "text": " Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6625.789,
    "end": 6643.753,
    "text": "And synchrony, generalized synchrony with the environment, not lockstep with the environment, but synchrony like turn-taking and meaningful dialogue and alignment with our environment, our built environment, information architectures, our social architectures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6644.633,
    "end": 6646.214,
    "text": "And I think this is something that...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6647.014,
    "end": 6675.603,
    "text": " hopefully we'll see unfold in so many different ways is like, how do we hold the moment, like the aesthetic moment, the lived, the humble home environment moment or whatever moment, the affective moment outside or even before we even quantify the affective or the cognitive, like the real primal moment",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6676.624,
    "end": 6681.166,
    "text": " And it's like, maybe one day we'll have tools soft enough to touch.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6682.286,
    "end": 6683.467,
    "text": "I don't think we have them today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6683.927,
    "end": 6689.269,
    "text": "So what is one thing that we can do and maybe not even regret ever looking back?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6690.487,
    "end": 6695.668,
    "text": " something like create a buffer or a container for the vital moments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6697.169,
    "end": 6711.493,
    "text": "And so it's like, let's just make sure everyone's at the workshop on time and that this is the way that they like it and all these features and be very thoughtful and mindful and value aligned up to the moment of the craft.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6712.506,
    "end": 6718.088,
    "text": " And then if there's more to say, it may be right to say it and impose then and constrain then.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6718.829,
    "end": 6726.932,
    "text": "But if there's nothing more to say after you've like brought everyone to the dance, then that would also be fine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6728.484,
    "end": 6735.808,
    "text": " And so then the challenge is like, but you have to make a building, like you're being paid for a building.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6736.149,
    "end": 6749.877,
    "text": "And then there has to be that received public or civic experience that is not like, oh, we'll watch this two hour live stream and check out this or that analytical framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6751.558,
    "end": 6753.319,
    "text": "There has to be the real direct.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6753.719,
    "end": 6755.32,
    "text": "And I mean, those are the kinds of,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6756.88,
    "end": 6781.971,
    "text": " knots and tangles that it's just amazing to hear your your journey and your way around they're kind of i call them i call i've just written this down actually a nook machine i think what what i do is like nook machines and so i think by helping the world by creating nook machines",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6783.143,
    "end": 6794.411,
    "text": " we end up generating a more truthful, honest, coherent, amplified, truthful kind of expression of how we want to live with all of the different instincts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6795.64,
    "end": 6819.439,
    "text": " activities that we do every day right and it's kind of like the enabling of all of those activities whether we want personalized in you know intimate moments or expressive outward moments but the health of a human being being that sort of inner and outer world being being enabled to effortlessly assemble every day",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6820.32,
    "end": 6836.8,
    "text": " uh melodies and that sort of idea of a building let's say an environment capturing a multitude of different feelings not a singular feeling but a multitude of layered feelings to create melodies and so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6838.385,
    "end": 6845.849,
    "text": " Often what happens in symbolic architecture is you're really drilling down in the guardrails of a singular emotive reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6846.61,
    "end": 6849.551,
    "text": "And, you know, none of us live in that singular emotive reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6850.732,
    "end": 6853.834,
    "text": "And we don't want to live in a single modality like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6854.434,
    "end": 6861.418,
    "text": "So that sort of multiplicity of modalities sets that sort of complex melody together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6861.838,
    "end": 6882.454,
    "text": " thing and i think that's that's what we're really talking about is through that communal process or that iterative self-improving process which absorbs contrasts and works through juxtapositions we can absorb a country's voice uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6884.228,
    "end": 6888.05,
    "text": " a complex singular voice into another person's voice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6888.99,
    "end": 6900.635,
    "text": "And the beauty is that synchronicity or that moment being distilled, which then enables further conversations to happen, which is kind of what I think nature does to us naturally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6900.815,
    "end": 6903.836,
    "text": "It sort of forms that dialogue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6905.317,
    "end": 6911.279,
    "text": "And what we're missing out of cities and the physical environment is a lack of dialogue capacity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6912.802,
    "end": 6933.85,
    "text": " So this nook machine thing is really about creating porosity, a living porosity that allows people to be okay to be people, you know, because the city in a sense is telling people that they can't be themselves and that can't be good or it can't be good for us, you know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6933.87,
    "end": 6933.91,
    "text": "So,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6939.383,
    "end": 6954.863,
    "text": " I think we're getting close to having a complex modeling process that then can feed from data that we can find, let's say, to improve the modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6956.224,
    "end": 6980.444,
    "text": " but you know we're on a journey of course but we're at the point in time where we can probably get a lot closer right now in objective terms in rational terms to get that poetic feeling distilled and to be able to tweak it to be able to sort of play with it tweak it synthesize differently sounds and the music coming from it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6981.064,
    "end": 6982.285,
    "text": " before we build something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6982.626,
    "end": 6993.358,
    "text": "And then we also can start measuring those qualities after it's been made and literally feedback that information to the next project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6995.5,
    "end": 6995.781,
    "text": "Wow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6996.181,
    "end": 7000.226,
    "text": "Well, in our sort of closing-ish thoughts,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7001.385,
    "end": 7004.867,
    "text": " a close synonym for nook is also niche.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7005.328,
    "end": 7016.895,
    "text": "Like I've heard a breakfast niche and in ecology, of course, we talk about different aspects of the niche and in cognitive science to the developmental and the cognitive niche.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7017.696,
    "end": 7020.638,
    "text": "And so it's like, that's the map in the territory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7020.718,
    "end": 7024.641,
    "text": "The cognitive niche is where your belief distribution is hanging out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7025.861,
    "end": 7029.064,
    "text": "And there's a cognitive niche about the breakfast nook.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7029.969,
    "end": 7051.76,
    "text": " like we ought to have breakfast there or we're the kind of family that uses the breakfast nook for that but it's like whatever it is on the map and whatever it is on the territory with the of course digital being a complexifying factor in all of this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7052.657,
    "end": 7062.163,
    "text": " But whatever it is, let's just go with that and have a path of least action on the generative model, active inference with a free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7062.844,
    "end": 7065.225,
    "text": "And then we can talk about what we expect and what we prefer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7065.265,
    "end": 7073.851,
    "text": "Like we expect everybody for breakfast at exactly this time versus like we have loose expectations or it could be uniform across the whole day.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7074.551,
    "end": 7077.113,
    "text": "We can talk about our expectations and preferences and,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7077.973,
    "end": 7079.935,
    "text": " No appeal to a reward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7080.375,
    "end": 7088.682,
    "text": "People aren't loitering and lounging in the park for a reward function directly or per se.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7089.563,
    "end": 7101.192,
    "text": "And yet that is what the kind of quantified matrix and the reinforcement and the reward learning, which is not wrong.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7102.613,
    "end": 7104.195,
    "text": "It's just a special case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7104.235,
    "end": 7104.995,
    "text": "It's a partial...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7106.041,
    "end": 7113.371,
    "text": " constrained expression and a partial constrained regime on all sides of the blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7114.913,
    "end": 7122.604,
    "text": "And so I don't know where it all goes from there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7124.315,
    "end": 7137.229,
    "text": " But Daniel, you know, the learning dwelling nook concept, the conflation of having a synchronous, let's say, density of want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7138.84,
    "end": 7144.581,
    "text": " where you're both intrigued and curious about something, but also kind of want to be in it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7144.881,
    "end": 7146.562,
    "text": "So you're sort of learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7148.362,
    "end": 7151.963,
    "text": "As you're moving through the environment, you're seeking to learn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7153.243,
    "end": 7163.346,
    "text": "And on top of that, you're seeking to gain and arguably seeking to inhabit or dwell better or improve your chances of dwelling better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7164.464,
    "end": 7168.866,
    "text": " as some sort of effective strategy for survival.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7168.886,
    "end": 7177.43,
    "text": "I don't know whether that's true, but... It's quite actually the two components of expected free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7177.47,
    "end": 7181.992,
    "text": "You said to learn and to gain, epistemic value, pragmatic value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7182.572,
    "end": 7185.493,
    "text": "These are the two components of a unified imperative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7186.113,
    "end": 7189.975,
    "text": "And we want a high reliability setting where it's like, you're not here to learn.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7190.255,
    "end": 7191.616,
    "text": "We need this done that way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7192.868,
    "end": 7198.391,
    "text": " And then there's also the other end of the pool and there's all the dynamics and movements within.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7198.411,
    "end": 7201.833,
    "text": "And it's like, that's the palette.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7201.953,
    "end": 7203.254,
    "text": "Now, what do we want to say?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7203.274,
    "end": 7203.354,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7207.116,
    "end": 7225.138,
    "text": " yeah um and what what needs to be said comes out of the the arbitraging process uh which goes into a lot of detail because doing a building for instance takes like seven to ten years sometimes you know it's not a short process um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7227.964,
    "end": 7250.79,
    "text": " the reality is that they're kind of like codes it's like you're building an algorithm it's just it's a physical algorithm it's a physical embodiment of knowledge and that knowledge creates physical experience that people intuitively experience without you know maybe dwelling on the seriousness of it or the impact of it people are at least experiencing it and so this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7252.27,
    "end": 7262.114,
    "text": " The trouble that architecture has always had in the modern era is evaluating the power of architecture or the meaning of architecture to health and well-being and the growth of culture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7262.394,
    "end": 7264.195,
    "text": "Why is architecture important?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7264.375,
    "end": 7265.215,
    "text": "Is it important?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7266.436,
    "end": 7269.677,
    "text": "And if it is important, how do we quantify the importance of it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7273.178,
    "end": 7281.802,
    "text": "And architects and the industry tend to, if they're not maybe born into environments where they naturally get it,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7283.317,
    "end": 7304.047,
    "text": " if you're born outside of architecture in a sense, maybe you've been surrounded by industrial reality for the whole of your entire life, you may not, I'm just guessing it, but you may not fully comprehend at a bodily level what the meaning of that is and why it's important, virtuous, beneficial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7304.407,
    "end": 7304.847,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7304.867,
    "end": 7305.888,
    "text": "But... But...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7309.451,
    "end": 7312.835,
    "text": " For me, intuitively, maybe this goes back to archetypes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7313.876,
    "end": 7315.318,
    "text": "Being an artist architect,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7316.94,
    "end": 7340.81,
    "text": " looking to looking and being curious is a foundational thing for me at a personal level personality type level but so is the idea of creating structure so the idea of creating on one hand and the idea of structure on the other so creating scaffolds and so um that's my particular personality type",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7342.345,
    "end": 7366.264,
    "text": " and I feel as though it's almost my job you know it's like I've been born to do a job and I'm enacting that job I'm just trying to unpack what I would naturally urge what I've been naturally urging to do my entire life to the point where if someone says why does this space feel so good it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7368.174,
    "end": 7377.177,
    "text": " it's much more complex than just saying, well, it's got good natural light, or the acoustics are good, or it functions really well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7377.997,
    "end": 7383.439,
    "text": "There's the density of the psychological reality that people never get to talk about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7384.099,
    "end": 7387.22,
    "text": "And there's never really been a framing of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7387.24,
    "end": 7393.242,
    "text": "I mean, Heidegger's had a good bachelor, Heidegger have had a stab at it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7394.043,
    "end": 7395.283,
    "text": "But it hasn't had the sort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7398.214,
    "end": 7412.499,
    "text": " balance of dealing with highs and lows, the different tonality of life, the naive to the sophisticated, the poetic to the, I don't know, the everyday.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7412.519,
    "end": 7421.061,
    "text": "There's never really been something that systematically drawn all of those constituent elements together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7421.721,
    "end": 7426.343,
    "text": "And it's always become a dry, dried up kind of artifact, a dried up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7427.466,
    "end": 7449.291,
    "text": " almost purposeless uh lacking purpose theory that sort of begins and ends and then it's just there on a bookshelf for other people to learn about but there's never really been an active philosophy that has translated and improved continuously over time and there's something about neurobiology",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7451.502,
    "end": 7458.836,
    "text": " And the fact that it bridges into creativity in the physical environment, that is the kind of... For me, it's the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7461.238,
    "end": 7464.04,
    "text": " It's everything, really.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7465.201,
    "end": 7465.921,
    "text": "It's the moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7466.582,
    "end": 7490.597,
    "text": "This is the moment when it actually comes together and we're able to actually use these kind of golden threads and make some magic, and that magic not being some sort of accident but actually having a tangible, realisable, teachable or open-sourceable kind of reality to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7493.772,
    "end": 7497.435,
    "text": " We're just at that moment, I think, where we can begin that work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7500.837,
    "end": 7501.257,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7501.397,
    "end": 7503.859,
    "text": "Would you like to make any closing statements?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7503.899,
    "end": 7505.38,
    "text": "And then I'll make a closing statement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7506.881,
    "end": 7511.584,
    "text": "I think it's the first of a lot of conversations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7512.245,
    "end": 7515.827,
    "text": "I just think this is the primer, mate, the primer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7516.087,
    "end": 7516.928,
    "text": "So watch this space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7521.445,
    "end": 7521.865,
    "text": " Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7522.405,
    "end": 7523.386,
    "text": "I hope so.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7523.746,
    "end": 7531.51,
    "text": "This was unique in multiple ways and a delightful experience and a real journey.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7532.35,
    "end": 7542.835,
    "text": "And I'll close because you invoked a golden string with the quotation that William Blake had on his tombstone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7543.815,
    "end": 7570.708,
    "text": " constructed he wrote i give you the end of a golden string only wind it into a ball it will lead you in at heaven's gate built in jerusalem's wall very nice thank you till number 60.2 yes until next time it's been awesome thank you thank you thank you see ya bye",
    "speaker": "SPEAKER_02"
  }
]