[
  {
    "start": 6.376,
    "end": 7.88,
    "text": " Hello, welcome everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8.462,
    "end": 10.568,
    "text": "It is May 30th, 2025.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10.649,
    "end": 15.222,
    "text": "We're in Active Inference Math Stream 14.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 17.378,
    "end": 43.639,
    "text": " and here with jesse van oostrom discussing a concise mathematical description of active inference in discrete time this will be a very useful and epistemic discussion so jesse thank you for writing this paper and coming on to you to introduce it and start walking us through it yeah thank you daniel thank you for the opportunity of uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 44.311,
    "end": 61.375,
    "text": " being here and allowing me to present my paper yeah first of all i wrote this paper together with my colleague carlotta langer and my supervisor niad i we are all in hamburg at the institute of data science foundations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 62.519,
    "end": 90.433,
    "text": " And, um, yeah, about three years ago, I, um, started getting interested in active inference and, um, wanted to know really exactly, um, how it works, so to say, but this, uh, I had quite a hard time figuring this out and that's a bit why this paper came about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 91.561,
    "end": 96.008,
    "text": " And maybe I can, I also have some notes here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 98.012,
    "end": 101.257,
    "text": "So maybe I can make very specific my question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 101.337,
    "end": 117.484,
    "text": "So what I wanted to know was, okay, we have an agent who has observations O1 up to OT and has performed actions A1 up to AT minus one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 118.223,
    "end": 145.834,
    "text": " and then what i wanted to know was an agent acting according to active inference what will its action at how will it choose that and this question for me was so with the literature at the time i found it hard to really pin it down so to say so that was the first main objective of making that more clear",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 146.422,
    "end": 170.151,
    "text": " and especially also making it clear in a way that is with in notation that is very accessible to people who have studied probability theory or any other type of standard mathematics and yeah and then throughout the process a second question came up",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 170.89,
    "end": 193.455,
    "text": " so that was the following so so i will go into more detail on this later but an agent has something that's called a generative model and how to understand that is as follows so the world we can first look at the real world",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 194.043,
    "end": 204.633,
    "text": " And that is generating observations, for example, observation one world is in world state one, then observation two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 205.053,
    "end": 207.776,
    "text": "So this is all happening in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 209.097,
    "end": 210.158,
    "text": "But then an agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 210.498,
    "end": 213.742,
    "text": "So this is what we could call a generative process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 220.208,
    "end": 222.75,
    "text": "And a generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 223.169,
    "end": 251.286,
    "text": " is as follows so this this is some kind of where an agent has maybe some kind of simplified version of what's happening in the world it is representing in its brain and from that world from that some kind of simplified world state it can predict okay what kind of observations can i expect",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 251.502,
    "end": 280.564,
    "text": " um from this state and this is some kind of a very similar model and in both cases we can also actually include actions so if it acts on the world it will influence its next world some kind of simplified world state and the same also here it will also influence the real world state so this is called a generative model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 284.105,
    "end": 306.197,
    "text": " and this generative model it uses it to to choose its next action but then the second question is how does it learn how does it learn this model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 307.797,
    "end": 331.273,
    "text": " so this paper is basically we can basically divide it into two parts one part is called inference and the other part so this is we could say also action selection and another part is called learning regenerative model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 340.737,
    "end": 370.204,
    "text": " so this presentation will also be somehow divided into these two parts so i'll first go further into this first question how does the agent select its actions and then also the second later on i will go on to in the second part how this is learning the generative model and please if anything is unclear please feel free to ask questions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 370.808,
    "end": 378.625,
    "text": " If you're now in the live chat or if you're watching this later, you're also always welcome to send me an email or get in touch in another way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 380.349,
    "end": 382.112,
    "text": "If you have any questions, I'm really happy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 382.593,
    "end": 389.408,
    "text": "So I wrote this paper for people in my situation three years ago who",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 390.198,
    "end": 419.496,
    "text": " really want to know the exact mathematical details of how active inference is formulated and want some kind of an accessible easy overview and if you have any suggestions for improvement i'm also very open to hear them so yeah so that's the basic overview and what i have to say as well is that this is all as you saw also from the symbols and stuff",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 419.78,
    "end": 428.133,
    "text": " This is all happening in a discrete space, discrete observation space, action space and discrete time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 428.673,
    "end": 433.601,
    "text": "So there's a whole other literature on the continuous side of active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 433.781,
    "end": 435.964,
    "text": "I'm not going into that right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 436.705,
    "end": 438.969,
    "text": "So that's also not what this paper is about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 439.029,
    "end": 443.796,
    "text": "It's only about discrete time formulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 446.206,
    "end": 475.437,
    "text": " um yeah i'm not sure if we already should stop here for some questions or did i just continue going deeper into the yep continue thank you okay yeah so maybe so one point maybe i should spend a little bit more time on it is this idea of the generative model so um maybe i write a new one here",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 476.378,
    "end": 504.512,
    "text": " so what i think is important to emphasize that this these states s are really inside the brain so we could say this is really in the brain of the agent and from these states it's predicting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 505.994,
    "end": 507.018,
    "text": " observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 508.424,
    "end": 513.726,
    "text": "And usually this is some kind of simplified state of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 514.499,
    "end": 519.566,
    "text": " and it needs to learn these states without anyone telling it, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 519.867,
    "end": 532.304,
    "text": "So maybe in machine learning or something, you're familiar with supervised learning where you get an observation and then it might learn which state do I have to associate to it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 532.785,
    "end": 534.026,
    "text": "That's not the case here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 534.066,
    "end": 536.991,
    "text": "So the agent really needs to learn itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 537.091,
    "end": 537.351,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 537.391,
    "end": 540.135,
    "text": "What is a good state?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 541.145,
    "end": 546.092,
    "text": " to somehow encode this observation in so that I can do a useful planning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 546.132,
    "end": 549.957,
    "text": "So this is you could call unsupervised learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 549.997,
    "end": 563.816,
    "text": "And there is no way of saying, OK, the real world, for example, is generating observations and therefore this state should be somehow related to that the real world state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 566.8,
    "end": 570.004,
    "text": "Yeah, and to also maybe",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 571.064,
    "end": 597.814,
    "text": " uh make a bit more clear how it can be simplified so for example we could have an agent so we could have a world in color for example that like there's all different colors in this world but for example an agent that can only see light intensity but no color",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 597.98,
    "end": 605.155,
    "text": " We'll have also a simplified state of the world, so to say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 605.215,
    "end": 607.74,
    "text": "So this will only be black.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 608.261,
    "end": 616.258,
    "text": "We don't have gray, I see, but this is white and this is gray.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 618.955,
    "end": 624.266,
    "text": " So that's just to, um, just to emphasize this point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 624.286,
    "end": 624.547,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 624.567,
    "end": 633.606,
    "text": "This, uh, generative model is really something that's inside the brain of the agent and it can use it to, for example, plan ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 636.453,
    "end": 638.517,
    "text": "Um, yeah, then I'll go back to the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 640.083,
    "end": 663.222,
    "text": " so i will start with some notation so yeah so what we are considering is an agent which which is going through",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 663.725,
    "end": 665.307,
    "text": " capital T time step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 665.347,
    "end": 684.552,
    "text": "So it starts at time one, and has also some kind of finite time t. And it's performing actions the whole time and receiving observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 686.759,
    "end": 716.547,
    "text": " so that we can also see here so we have observations and i'm using tau the greek letter tau for any time point and t for the current time point so you'll see that appearing more often this distinction in the in the paper and we can use this subscript with the colon to have like a sequence of observations for example",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 717.877,
    "end": 721.341,
    "text": " And then very important, there's this word policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 722.362,
    "end": 727.167,
    "text": "And actually, if you come from reinforcement learning background, this has a little bit different meaning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 728.149,
    "end": 739.742,
    "text": "But here in this context, the policy is a sequence of actions, and more specifically, a sequence of future action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 739.762,
    "end": 743.085,
    "text": "So that is sometimes I find in the other literature not so clear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 744.106,
    "end": 746.489,
    "text": "But here I want to make that very specific.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 746.549,
    "end": 747.31,
    "text": "So we have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 747.813,
    "end": 776.79,
    "text": " a policy pi t and that is actions small t so there is also small t so action small t up to big t so a sequence of actions and pi will be then the whole from time point one and so usually i write a for actions that are already before performed in the past and pi for the future actions that it somehow needs to do planning on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 777.631,
    "end": 803.217,
    "text": " um yeah and we have this generative model which we write like this and so it's a probability distribution over observations and states given actions and this theta is the parameter of the of the generative model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 804.327,
    "end": 818.047,
    "text": " And in this first part, we leave this data, we leave it out in the notation because we are assuming, OK, it has learned this generative model and we're just interested in how it's using it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 818.407,
    "end": 826.639,
    "text": "And then in the second part, we will actually look at we will include it again to see how it's learning this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 828.188,
    "end": 857.402,
    "text": " yeah and then also a big part of active inference is of course that it needs to infer in what kind of state it is so what kind so it has an observation and it has this generative model and then it somehow needs to infer okay what kind of state could i be in and we use this that's also in general in the literature we use this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 857.72,
    "end": 887.153,
    "text": " letter q so for example an agent receives this observation o1 and then wants to find out okay or express its belief in which state it thinks it is and that we write for example like this so this is the belief so this is a probability distribution over states",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 887.757,
    "end": 916.093,
    "text": " and it has as information this first observation and in general that's always or we hope that it's approximately equal to the true posterior of the generative model we will go into this later some more and how it's sometimes exact and sometimes not but for now it's good to remember that this q is expressing a belief",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 916.327,
    "end": 938.402,
    "text": " about the state that the agent it's in and we sometimes so for example if we uh i can also show that here in the paper so so this is the the actual generative model here and here we have this belief over states",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 938.821,
    "end": 967.95,
    "text": " and what we are doing to make the notation a little bit more concise is to write qt for example qt of st let's say then this t is implying all the information that it has already from the past so this is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 968.673,
    "end": 996.25,
    "text": " we can also write it qst given all the observations it has made and all the actions that it has performed so this t is just saying okay we include in this belief all the information all the observations all the actions to form this belief so to say um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 999.47,
    "end": 1023.537,
    "text": " yeah so i think i have discussed now the most important things from the notation then we can i can have a break here also if there's any questions or otherwise i just continue sounds good continue thank you okay yeah",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1024.057,
    "end": 1036.013,
    "text": " So then we immediately, so that was also one of my goals of this paper, is to immediately get down to this main question, okay, which action is the agent going to perform?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1036.974,
    "end": 1040.438,
    "text": "And we immediately arrived there already.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1040.458,
    "end": 1049.49,
    "text": "So the action selection procedure can be described as follows.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1049.971,
    "end": 1053.135,
    "text": "So we have here a probability distribution",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1054.212,
    "end": 1080.574,
    "text": " over policies so policies were sequences of future actions and we say according to active inference an agent selects its next action by sampling a policy pi t from this distribution and selecting the action 80 corresponding to that policy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1081.516,
    "end": 1110.004,
    "text": " so i can write it here again so we have this distribution for now we can ignore a little bit um how exactly what exactly this um how this distribution comes about i will get to that in a minute but we can just say okay there is some kind of distribution",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1110.625,
    "end": 1137.747,
    "text": " over policies over future action sequences and we sample some kind of pi t star we sample it from this distribution so we have this pi t star which is a sequence of a t star up to a t star and then we are performing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1139.988,
    "end": 1167.025,
    "text": " this action 80 star and yeah you could say forget about the rest so this is all right i'll do it like this this is somehow uh we are not interested anymore so we are only performing this action 80 star and then we go to the next time step get the next observation and then we'll do this whole process again",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1167.477,
    "end": 1176.085,
    "text": " So this, for example, this action a t plus one is somehow discarded.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1176.165,
    "end": 1184.572,
    "text": "So for the next time step, we'll do the process again and then take the first action from that sampled policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1186.674,
    "end": 1193.38,
    "text": "And that in a very basic way is already some kind of answer to this first question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1193.6,
    "end": 1196.623,
    "text": "Okay, how is it selecting its next action?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1197.464,
    "end": 1227.049,
    "text": " and what we see is so it has received these observations and performed these actions and they also flow into this this probability distribution is dependent on this on these observations and actions and then the next question is okay how does it compute this probability distribution so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1229.965,
    "end": 1236.292,
    "text": " That would be the second question to answer if we really want to get down to how is it selecting its actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1237.453,
    "end": 1246.002,
    "text": "And then we see the main ingredient of this distribution is this function G, which is the expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1247.784,
    "end": 1252.81,
    "text": "And I have written one way of writing it, written it here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1252.83,
    "end": 1257.114,
    "text": "One question there, Jesse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1257.715,
    "end": 1258.656,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1258.788,
    "end": 1287.04,
    "text": " why is the policy conditioned on actions from the past when i don't see the a1 through t minus one explicitly entering into the unpacking and policy inference is based upon the observation coming in and how that affects the belief inference but how does or why do you have a conditioning on a as well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1288.37,
    "end": 1317.094,
    "text": " so the function g is dependent on a so in order to compute this function g we need to know which actions have we done in the past do we though yeah because it's but it's a bit hidden in the notation here so we use these past observations to perform inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1317.665,
    "end": 1345.849,
    "text": " uh about for example here our belief in future observations so in this t here in the q it's it's captured okay this is a belief about future observations but with the information from observations from the past and actions from the past it's using those to form the beliefs about the future",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1347.787,
    "end": 1377.321,
    "text": " or here for example the same for future states or here so in order to make this distribution what state will i be in in the next time step it is using some kind of belief about what state am i in in the current time step which then again depends on what actions and what observations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1377.74,
    "end": 1402.819,
    "text": " we have in the past okay so in in practice the b transition matrix embodies the expected consequences of different actions but here it's just written in terms of being conditioned upon the whole past sequence of observations and actions that like would have led to that transition matrix being learnt",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1404.976,
    "end": 1416.96,
    "text": " yeah so here we are assuming that the whole um that whole b matrix is already learned so that we can just take as given",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1418.425,
    "end": 1426.316,
    "text": " And we only use these O and this A for performing state inference, so to say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1426.677,
    "end": 1430.001,
    "text": "So we need to know somehow in what state am I now?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1430.041,
    "end": 1435.589,
    "text": "And then you can go back and think, okay, what actions did I perform in the past?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1436.711,
    "end": 1441.277,
    "text": "And then that gives you more information about what state you could be in now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1444.548,
    "end": 1456.56,
    "text": " And I wrote this very explicitly because often in other literature, this dependence is somehow completely not made clear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1456.6,
    "end": 1462.646,
    "text": "And then I find that sometimes a bit confusing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1462.686,
    "end": 1464.668,
    "text": "So that's why I wrote it very explicitly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1464.748,
    "end": 1471.855,
    "text": "Okay, in order to compute this distribution, we need this information, so to say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1472.408,
    "end": 1474.718,
    "text": " So that's why I wrote it in this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1474.758,
    "end": 1481.085,
    "text": "Does that answer your question?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1482.719,
    "end": 1505.554,
    "text": " i think so i just still i just still don't i know it's sort of a small thing but and i i see that that's it's that you've thought about it it's just i don't see any of the past time steps in the right hand side so why would the action have that you took 27 time steps ago",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1505.872,
    "end": 1520.285,
    "text": " Other than how it influences how you believe the action to work now, why would the specific memory of the action a given number of time steps ago bear into the calculation now?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1522.127,
    "end": 1532.757,
    "text": "For example, if we take this distribution, which is our belief in what state we will be in in the next time step,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1534.778,
    "end": 1545.256,
    "text": " then I think there's many situations where we can think of that it's relevant what I did two time steps before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1545.837,
    "end": 1558.879,
    "text": "So for example, if two hours ago I decided to fly to Germany, then that will still have influence on where I will be maybe the next hour.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1564.867,
    "end": 1585.088,
    "text": " But like in a grid world example, if the transition matrix is the up, down, left, right, the fact that you moved a certain way 25 time steps ago doesn't need to specifically come into play when you're thinking about the next consequences of your action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1586.85,
    "end": 1594.097,
    "text": "So let's say we have a grid world, which is just 1D, let's say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1595.697,
    "end": 1596.818,
    "text": " 1D grid world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1597.479,
    "end": 1600.062,
    "text": "You can go left or right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1603.707,
    "end": 1604.928,
    "text": "Those are the two actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1611.456,
    "end": 1620.608,
    "text": "And let's say this agent knows I'm always starting in location zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1623.711,
    "end": 1625.113,
    "text": "And...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1627.743,
    "end": 1631.689,
    "text": " Let's say it or let's say differently here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1631.729,
    "end": 1633.331,
    "text": "Let's say here is zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1633.351,
    "end": 1634.193,
    "text": "That's a bit easier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1636.196,
    "end": 1647.953,
    "text": "And then every action you did in the past will have an influence on in what location you're in now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1650.938,
    "end": 1651.158,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1651.238,
    "end": 1654.543,
    "text": "If I, for example, we are now at T equals three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1655.266,
    "end": 1663.657,
    "text": " then your location will be different if A1 is left compared to if A1 is right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1667.181,
    "end": 1672.669,
    "text": "But is it conditioned upon your current location and the consequences of action from your current location only?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1673.65,
    "end": 1681.56,
    "text": "Or is it specifically conditioned upon an action that you took in a past moment other than how that action resulted in you getting to where you are now?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1683.211,
    "end": 1686.217,
    "text": " Ah, maybe I, sorry, that took maybe very long.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1686.658,
    "end": 1692.489,
    "text": "So these actions are really the actions we performed in the past.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1692.589,
    "end": 1703.089,
    "text": "So not any random actions, but really only the one that we performed in the past.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1703.109,
    "end": 1704.612,
    "text": "Is that your question or?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1706.009,
    "end": 1708.974,
    "text": " We can continue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1709.555,
    "end": 1730.413,
    "text": "I see the past actions matter for changing where you are, and you can do other learnings and so on, but the past actions themselves don't influence where you are or your beliefs about the consequences of action, which are all that come into play in the operational calculation of G.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1732.267,
    "end": 1737.574,
    "text": " Which doesn't specifically invoke a past.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1739.016,
    "end": 1745.866,
    "text": "We can maybe postpone it to later to see if we can make it more clear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1747.468,
    "end": 1757.803,
    "text": "So maybe to get back to the... So we wanted to know, okay, what is this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1758.784,
    "end": 1760.266,
    "text": "What will be the next action?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1760.587,
    "end": 1762.189,
    "text": "Then we saw, okay, there's this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1762.76,
    "end": 1788.396,
    "text": " distribution that we sample policies from and from there we take the first action and that will be our action and then we are now looking at okay what is this function g that is used for for computing this probability distribution",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1790.485,
    "end": 1817.05,
    "text": " and that function g looks a little bit complicated so we can just now see what is all coming in to compute this this probability distribution so we see there is this this distributions q which are our beliefs about future states and future observations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1817.705,
    "end": 1826.059,
    "text": " So those are, and we will discuss later exactly how it can derive these distributions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1826.76,
    "end": 1833.331,
    "text": "And they are all dependent on our policies or the next possible actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1834.113,
    "end": 1843.729,
    "text": "So for each different policy, we'll also have different beliefs about what observations we could get in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1845.059,
    "end": 1847.101,
    "text": " So those are the main ingredients here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1847.682,
    "end": 1854.949,
    "text": "And then we have this distribution PC, which is a preference distribution of the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1855.589,
    "end": 1858.392,
    "text": "And this preference distribution, I also wrote it here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1858.993,
    "end": 1864.558,
    "text": "It's completely distinct from the generative model P. So it has nothing to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1864.618,
    "end": 1871.325,
    "text": "So P is a certain distribution and then PC is a very different distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1871.345,
    "end": 1874.188,
    "text": "So they have nothing to do with each other in that sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1874.59,
    "end": 1892.565,
    "text": " but it is a an ingredient for computing this expected free energy yeah maybe also nice to see so for example this uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1893.119,
    "end": 1900.807,
    "text": " distribution also in the paper of Lenz da Costa and others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1900.827,
    "end": 1902.629,
    "text": "We see it here in equation 10.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1903.69,
    "end": 1907.554,
    "text": "So he also describes it here and actually... We don't see it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1907.574,
    "end": 1908.515,
    "text": "It's just a black bar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1910.417,
    "end": 1910.557,
    "text": "Oh.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1912.72,
    "end": 1916.804,
    "text": "You do see the nodes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1916.824,
    "end": 1917.084,
    "text": "Right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1918.506,
    "end": 1920.848,
    "text": "No, it's just the tabs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1922.971,
    "end": 1923.412,
    "text": " And now?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1926.116,
    "end": 1927.378,
    "text": "Yeah, still just the tabs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1933.047,
    "end": 1934.99,
    "text": "Yeah, maybe reshare the screen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1936.052,
    "end": 1936.272,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1948.271,
    "end": 1949.192,
    "text": "Did something change?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1949.473,
    "end": 1949.653,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1949.733,
    "end": 1950.835,
    "text": "Okay, now we see the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1951.625,
    "end": 1952.426,
    "text": " Okay, great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1952.647,
    "end": 1953.869,
    "text": "Sorry about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1953.949,
    "end": 1955.111,
    "text": "And now you see the notes?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1955.231,
    "end": 1955.431,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1956.914,
    "end": 1958.897,
    "text": "And now you see the other paper?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1959.238,
    "end": 1960.84,
    "text": "There we go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1960.86,
    "end": 1963.505,
    "text": "So this is the paper of Lenz da Costa and others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1964.106,
    "end": 1971.157,
    "text": "And he has here the same distribution over policies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1972.219,
    "end": 1976.907,
    "text": "And then actually in Thomas Parr's book and others,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1977.815,
    "end": 1981.1,
    "text": " There the distribution is a bit more complicated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1981.12,
    "end": 1983.584,
    "text": "They also have an E and an F term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1984.505,
    "end": 1998.186,
    "text": "And I'm writing in the paper, I was planning not to go into that now, but I'm writing in the paper here also a note on why they have those terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1999.094,
    "end": 2006.782,
    "text": " But then you can at least see, okay, you can find this distribution in these.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2007.022,
    "end": 2011.726,
    "text": "I use those two as main sources for writing this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2014.169,
    "end": 2015.47,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2015.81,
    "end": 2022.357,
    "text": "So maybe people who have already studied some active inference are more familiar with what comes now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2022.377,
    "end": 2028.763,
    "text": "But I thought just to briefly discuss this expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2029.115,
    "end": 2058.21,
    "text": " and how you can think of it so we have the equation here and we see that there are two terms and this first term is a KL divergence between two distributions and this first distribution is distribution over our beliefs in what state we will be in in the future",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2058.663,
    "end": 2084.89,
    "text": " given that we have some observations that which observations are again appearing here and we compare this distribution so the beliefs about states given that we have already the observations with this distribution where we don't have the observations and so what you could say a little bit is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2085.629,
    "end": 2098.987,
    "text": " If these observations are very informative, then our belief about the state will be very different from when we don't have the observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2100.109,
    "end": 2102.312,
    "text": "So then this difference will be large.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2104.114,
    "end": 2114.488,
    "text": "But if these observations are not so informative, then these two distributions will be pretty similar and then this difference will be small.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2114.958,
    "end": 2123.187,
    "text": " So the size of this difference says, okay, how informative will these future observations be?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2123.247,
    "end": 2128.633,
    "text": "And these future observations depend again on the policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2128.773,
    "end": 2144.29,
    "text": "So we somehow take an average over what future observations do we expect, given that we have this as next actions and given that we already have some observations and actions done in the past.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2145.822,
    "end": 2151.874,
    "text": " So this first term is called epistemic value of information or information gain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2153.397,
    "end": 2158.907,
    "text": "And then the second term, we see this preference distribution here come up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2158.927,
    "end": 2166.582,
    "text": "So this is the observations that the agent would really like to make.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2166.967,
    "end": 2187.844,
    "text": " and the distribution here is the observations that it thinks it will make if it is going to do these actions and so um the higher this is basically the more likely this uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2188.702,
    "end": 2212.06,
    "text": " policy will give observations that it actually wants to have so we want this and that we see also if we go back to this equation so we see the lower the expected free energy of a policy the more likely it is that we will sample that policy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2212.647,
    "end": 2225.905,
    "text": " And we also see that the higher these two terms are because of this minus sign, the lower the expected free energy will be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2226.065,
    "end": 2231.312,
    "text": "So we want both this utility and the information gain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2231.412,
    "end": 2240.865,
    "text": "We want it to be high for a specific policy or those are policies that we are likely the agent is likely going to sample.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2242.212,
    "end": 2270.413,
    "text": " so that is one way to think about the expected free energy and then another equivalent way of writing it is the following so here we actually don't have this minus sign so these terms we both want them to be small or the the smaller they are the more likely that policy is going to be sampled and this term here is an entropy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2270.95,
    "end": 2288.402,
    "text": " and it's basically looking at the entropy or you could also say uncertainty about the observation if the agent knows the state it's in so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2288.838,
    "end": 2309.496,
    "text": " if it's in a certain state but even though it knows what state it's in it is very hard for the agent to predict what the observation will be then this entropy will be high and then so therefore also this ambiguity will be high",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2310.421,
    "end": 2319.44,
    "text": " And therefore the agent prefers to be in states that have low ambiguity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2321.364,
    "end": 2322.827,
    "text": "So that's this first term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2323.398,
    "end": 2350.198,
    "text": " and then the second term is again a kl divergence but this time between the belief that the agent has about its future observations given a certain policy compared to the observations it actually wants to have so if this difference is big then it believes it will get different observations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2350.6,
    "end": 2374.127,
    "text": " from the ones that it wants to have so that you could say is bad so this term which is called the expected complexity or risk those we wanted to be small so that's a little bit of interpretation on this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2375.187,
    "end": 2386.831,
    "text": " on this term, on this G that is used for computing the distribution for sampling the policies and therefore the actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2388.835,
    "end": 2391.34,
    "text": "So there is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2393.075,
    "end": 2400.543,
    "text": " One more thing is that we can, that is for the computation, nice, so we can make some kind of approximations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2400.603,
    "end": 2403.346,
    "text": "We will come back to that later as well in some more detail.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2403.867,
    "end": 2413.517,
    "text": "And then this g, actually, we can write it as a sum of different, of like single time step g taus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2414.638,
    "end": 2418.002,
    "text": "And that makes all the computations a bit easier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2418.742,
    "end": 2447.247,
    "text": " and i know that there's much more to write or to say about this expected free energy and where it comes from but i think that was not the aim really of this paper so then i refer you to these other sources um yeah so now we have discussed this distribution where the policies are sampled from we have discussed this g but then an important ingredient",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2447.817,
    "end": 2473.369,
    "text": " of this g of computing this g are these distributions q q t so this belief about future or about states and about observations and also in the actual often we are actually interested in these so not over sequence of states but just over one specific time point tau",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2475.222,
    "end": 2488.425,
    "text": " And I was actually thinking for this podcast not to go into this too much because I think it's relatively straightforward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2488.465,
    "end": 2492.472,
    "text": "So at least what I write here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2493.413,
    "end": 2509.637,
    "text": " because I think the philosophy of this whole approach is that we want to use some kind of Bayesian approach as much as possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2510.318,
    "end": 2521.615,
    "text": "And what I have done here is just describe exact Bayesian inference, which would be somehow the simplest way of forming beliefs about states and observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2522.101,
    "end": 2533.658,
    "text": " And then actually in more advanced literature, so to say, you could say that is some kind of an approximation of this exact Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2533.678,
    "end": 2537.203,
    "text": "So I would say you could read through this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2538.125,
    "end": 2541.93,
    "text": "I can maybe show one small example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2541.95,
    "end": 2550.403,
    "text": "So we have this generative model of our observations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2552.206,
    "end": 2568.747,
    "text": " and states given actions and you could also write this model in this way",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2578.818,
    "end": 2599.324,
    "text": " and there we see that this model factorizes so maybe i can just use what i already wrote down so we see that we can really somehow decompose it into very simple elements where we have a prior over the first observation this one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2601.11,
    "end": 2626.999,
    "text": " um we have a distribution that is telling us okay if we are in a certain state and we perform a certain action what state will be the next one and we have a distribution that is saying okay if we are in a certain state what observation do we expect to get so those are the three ingredients",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2627.317,
    "end": 2634.385,
    "text": " which are also often referred to as the maybe I write on this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2635.646,
    "end": 2639.851,
    "text": "So this is called the usually called the B matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2639.991,
    "end": 2642.113,
    "text": "This is called a matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2642.153,
    "end": 2646.738,
    "text": "And this, I think usually a D vector or something is prior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2648.44,
    "end": 2652.885,
    "text": "So those are the three ingredients for this generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2653.557,
    "end": 2682.383,
    "text": " and then for example so how you would perform um exact patient inferences for example we say okay we re so we first can express our belief in what state we are in we can just use okay that's the prior which we assumed we already had and then we then get an observation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2682.97,
    "end": 2711.121,
    "text": " so that's why this that one is referring to and that we want in this case to be the exact posterior s1 given o1 which is proportional to o1 given s1 and our so this is this a matrix",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2711.995,
    "end": 2724.453,
    "text": " and the prior, or our belief, let's say that's maybe more general, our belief about what state we were in before receiving this observation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2725.334,
    "end": 2734.628,
    "text": "So this is a very simple example of belief updating, so to say, which I describe in more detail here in the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2734.928,
    "end": 2764.716,
    "text": " and i think if you're just starting out with active inference i think it's quite nice to just think about this whole state inference in this way and think of these other approaches like minimizing some kind of variation of free energy as some kind of approximations to just doing this exact patient inference yeah and that basically concludes all the ingredients",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2765.101,
    "end": 2784.139,
    "text": " we need for describing how an agent is performing its next actions or how it's choosing which next action it's taking and so i'm skipping now over this learning part we will get into that a little bit",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2785.317,
    "end": 2791.144,
    "text": " And then here in section four, there's a completely worked out example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2791.385,
    "end": 2797.693,
    "text": "So I really recommend, so you've might also seen this, uh, in, uh, for example, Thomas Parr's book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2799.475,
    "end": 2808.266,
    "text": "Um, I've tried to make it very explicit here and very precise that you can really follow exactly what is happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2808.286,
    "end": 2813.232,
    "text": "And I invite you to just go through this example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2813.667,
    "end": 2839.658,
    "text": " so this up till here is just some kind of definition of the model and then here we say okay how it's performing the inferences how it's making these cues and then here we see we compute the expected free energy for all different policies so this is the first action this is the second action",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2840.33,
    "end": 2870.303,
    "text": " so we walk somehow through a an example episode of this mouse in this teammates which is acting according to active inference and then second time step it's updating its beliefs and then again computing expected free energy and then again selecting sampling a policy and its action so um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2870.907,
    "end": 2873.414,
    "text": " Yeah, so I invite you to go through that as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2873.434,
    "end": 2882.52,
    "text": "And what I found hard, so I looked at this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2883.8,
    "end": 2892.031,
    "text": " There is also so in order to compute, make these computations, I thought, OK, I really want to make the computation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2892.051,
    "end": 2902.885,
    "text": "So I looked into this library by MDP and also a little bit at the other one SPM, I think, which is written in MATLAB.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2904.087,
    "end": 2911.056,
    "text": "But what I found hard was that in both code bases, the actual computations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2911.559,
    "end": 2918.887,
    "text": " of what's really going on are very deep down in the code, so to say, so are not so accessible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2920.609,
    "end": 2935.206,
    "text": "And what I did was actually to write my own code to do these calculations, which is also available on GitHub.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2935.266,
    "end": 2937.769,
    "text": "So here on the first page is the GitHub link.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2938.525,
    "end": 2945.854,
    "text": " And I can and what I think is relatively nice from this code is that it's very so you see the code, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2947.496,
    "end": 2949.739,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2949.759,
    "end": 2952.402,
    "text": "So that it's relatively easy to read.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2952.622,
    "end": 2963.195,
    "text": "So, for example, there's a function sample action, which is exactly and I have also tried to refer to all the equations in the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2963.355,
    "end": 2967.3,
    "text": "So, for example, here, this is the first equation we've been talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2967.702,
    "end": 2991.82,
    "text": " this distribution over policies and here you see exactly how it's computed so we have to compute for every policy the expected free energy and in order to have the expected free energy we need these beliefs over states and then we have to take this soft max function oh i did not actually say anything about so this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2992.508,
    "end": 3022.515,
    "text": " this sigma here that's maybe good to just clarify this is the softmax function which makes just these values so we get for every pi we get a different value makes these values into a probability distribution so for every pi we have a different expected free energy we make it into a probability distribution",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3022.883,
    "end": 3043.44,
    "text": " and then we sample from it and then we take the first element basically of the policy which is our action and then we return the action so i think this code if you're just interested you can play around with it you can take some parts of it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3043.572,
    "end": 3057.177,
    "text": " you can do with it whatever you want but if maybe if the maths are not so clear for you but it's more clear in code then you can also have a look at this so it's has the same kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3057.376,
    "end": 3084.008,
    "text": " sequence as the paper so we sample an action how's the expected energy computed we need these two things info gain and utility and here we have a part about how it's updating its beliefs and that's exactly the same as what we what is described here in the state inference so this is a little bit different for example from the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3084.578,
    "end": 3109.607,
    "text": " by mdp and and spm where they use more advanced methods for doing this state inference but for easy examples i think this is really more than enough just to get a very precise idea of what is really happening and then there's also a functionality for learning which we will go into now",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3111.832,
    "end": 3117.02,
    "text": " So I think that's everything I wanted to say, at least from my side, about the inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3117.881,
    "end": 3123.49,
    "text": "So maybe if there's any questions, I'm very happy to go into those now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3128.778,
    "end": 3129.099,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3130.621,
    "end": 3137.132,
    "text": "I could maybe finish covering all the sections of the paper, and then there's a few questions in the live chat, and people can add some more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3138.694,
    "end": 3139.115,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3139.575,
    "end": 3140.016,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3140.924,
    "end": 3161.363,
    "text": " so for the second part learning um i was thinking to actually go a little bit more or to make it a bit more difficult so to say and really go into depth of where the equations come from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3162.322,
    "end": 3189.561,
    "text": " because for a long time that was actually also unclear to me and actually quite late in the process it became exactly clear of how where the the equations for learning come from and i think that's also a quite a relevant or significant contribution of this paper of this paper to present that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3190.03,
    "end": 3214.857,
    "text": " i thought it might be nice for the people who are interested also in where they come from to go in to a little bit more depth now so i would actually say that we go then to the appendix so there's here appendix b and we actually first look at a little bit simpler settings",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3215.444,
    "end": 3226.669,
    "text": " to somehow get familiar with the basics and then we go back to this setting of an agent operating in a world um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3228.91,
    "end": 3255.272,
    "text": " yeah maybe i introduce it a little bit here in the notes so i'm slightly changing notation now to avoid confusion but maybe it also makes it a bit more complex i don't know so we have now x and z and you could basically think of x as an observation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3258.577,
    "end": 3279.555,
    "text": " and z as a latent state i call it so and maybe i just i think in most cases you can also think about this as the o",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3281.56,
    "end": 3309.947,
    "text": " and this about the s so to say of the of the model but that doesn't always hold so that's why i chose to call it x and z and we first for now forget completely about this about this z and we imagine some kind of very simplistic setting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3310.214,
    "end": 3334.045,
    "text": " where we want to where we are receiving observations x and we want to somehow make a model of these received observations so we want to make some kind of probability distribution x checking which notation exactly i'm using yeah",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3336.269,
    "end": 3363.88,
    "text": " so there's some different observations we can make one up to n and we want to model the observations we make with the probability distribution which is dependent on theta",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3364.383,
    "end": 3388.872,
    "text": " and then very specifically so it is just the probability that we see an observation i given theta is theta i no so theta is a vector from theta 1 up to theta n",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3391.13,
    "end": 3409.375,
    "text": " and the learning and then you could say learning is finding this theta and what the active inference literature is suggesting is to think of this theta",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3409.844,
    "end": 3417.552,
    "text": " Also, so that is a very Bayesian kind of approach that we think of this theta also as something that we can have a belief about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3418.172,
    "end": 3439.193,
    "text": "So we can have also a probability distribution over the theta, which is somehow expressing, okay, I believe my belief about the theta, that theta i is 0.1, for example, is this number.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3440.776,
    "end": 3466.8,
    "text": " and that is again so i'm going to use the bar here that is again dependent on some kind of hyper parameter alpha and this distribution is called the dirichlet distribution which is a product over the theta i's that we raise to the power",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3467.607,
    "end": 3478.225,
    "text": " alpha minus one and so alpha is also in vector from alpha one to alpha n",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3479.892,
    "end": 3486.781,
    "text": " So this distribution, and by the way, there's another paper from Ryan Smith.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3487.222,
    "end": 3495.754,
    "text": "I think it's also in the references, which also describes this, gives a little bit more intuition about this whole process, which I think is really nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3495.774,
    "end": 3501.782,
    "text": "So I can also recommend looking at that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3504.412,
    "end": 3532.714,
    "text": " yeah but so this is basically describing our beliefs about our parameters and then just so we could say the prior belief and then we can for example we make a specific observation x star and then we can ask ourselves how is this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3534.128,
    "end": 3562.735,
    "text": " uh belief going to change if we incorporate this new information that we made a certain observation and that i'm not going to write down but we can look at here so what i just described was this so we have this distribution",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3564.014,
    "end": 3591.743,
    "text": " parameterized and this belief about our thedas and then we are interested in this posterior belief so to say after having this made this observation x star and um what we can if you work that out you see that that's again a Dirichlet distribution but then uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3592.229,
    "end": 3609.85,
    "text": " with a different alpha so we call the updated alpha we call it alpha prime and this this thing here is the indicator function",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3610.792,
    "end": 3635.618,
    "text": " which is basically um which is one when x star is equal to xi and zero otherwise so what is happening is that we increase the alpha i by one which corresponds exactly to the observation to the eye of the observation and the rest of the alpha stays the same",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3636.205,
    "end": 3651.642,
    "text": " And if we look again at this definition of the Dirichlet distribution, so we see the higher the alpha, the more weight that theta i is going to get in the probability distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3653.264,
    "end": 3662.955,
    "text": "So this is a very, I would say, elegant way of updating your beliefs about the theta when you get new observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3663.745,
    "end": 3682.658,
    "text": " And this is the general idea of how the theta is also learned in the setting that we are looking at in this POMDP, this partially observed Markov decision process setting where we have states, so hidden states, observations and actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3687.106,
    "end": 3687.947,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3688.417,
    "end": 3710.34,
    "text": " but so what we were looking at here was just a setting where we had just observations but we didn't have any latent states and now the question is what happens when we do include latent states so we can do a similar derivation so we now have two distributions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3710.742,
    "end": 3739.787,
    "text": " uh depending parameterized by two different thetas so we have a prior which is a vector over the latent states and then we have some kind of matrix which is saying okay given we have a certain latent state what's the probability of a certain observation and then we can again ask ourselves this question",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3740.425,
    "end": 3769.15,
    "text": " what happens with our belief over theta if we get an extra observation and what is actually the case here is that we get some kind of very complicated distribution which is not a Dirichlet distribution so this exact method",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3769.872,
    "end": 3772.555,
    "text": " is not so useful for updating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3772.655,
    "end": 3779.183,
    "text": "So this is more like the setting we we are looking at right where we have observations and latent states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3781.946,
    "end": 3784.569,
    "text": "So we have to do something slightly different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3785.851,
    "end": 3792.719,
    "text": "And that is that we do by the mean field approximation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3795.081,
    "end": 3796.403,
    "text": "And",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3798.492,
    "end": 3820.298,
    "text": " so what we do instead is we um let's see what how i can best continue so maybe",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3823.838,
    "end": 3845.749,
    "text": " I go very briefly to Appendix A. So in Appendix A, I describe some kind of very general, so I think most of you have already seen this, but just for the completeness, a variational free energy minimization approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3847.511,
    "end": 3848.833,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3851.058,
    "end": 3878.061,
    "text": " it's described here so we have some kind of joint distribution and we want to compute a posterior which is also the setting we had before but often this posterior is hard to compute directly so what we do then is we instead",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3878.733,
    "end": 3904.993,
    "text": " choose a family of distributions q and find so this q tildes are all element of this q and we try to find that q tilde that is minimizing this expression and that q q we call qx because it's actually dependent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3905.446,
    "end": 3925.227,
    "text": " on this x on the observation that we made and this is some kind of very general approach which is called the variational approach and that is somehow used to approximate a posterior that we can't compute directly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3925.612,
    "end": 3952.902,
    "text": " so that is described in more detail here in this appendix and also how it plays a role in active inference i think for time reasons i won't go into that much deeper now but just to describe this method at least so we use that same method also here so right now we are dealing with latent states",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3953.337,
    "end": 3958.862,
    "text": " So these Z's that we don't know, and we are dealing with the parameters that we don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3958.902,
    "end": 3968.11,
    "text": "So we somehow, but what we do know is the observation and the hyperparameters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3970.131,
    "end": 3976.116,
    "text": "And we want to find the distribution over the latents and the parameters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3976.777,
    "end": 3982.602,
    "text": "And then we use the same variation of free energy minimization approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3983.223,
    "end": 4011.222,
    "text": " where we are trying to find the queue that is minimizing this distribution and then what we do what i was also saying before often we restrict the queues that we can choose from which is and in this case we are only looking at queues which can be written as a product of these individual distributions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4011.674,
    "end": 4019.846,
    "text": " So that's some kind of an approximation that we are making here, which is called the mean field approximation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4021.548,
    "end": 4038.272,
    "text": "And if we do that, then this equation simplifies a bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4040.159,
    "end": 4069.592,
    "text": " and what we also do so this is a very important insight is that it's quite hard to minimize both of these cues at the same time because they are both influencing each other and there is a specific algorithm called the kaffee algorithm coordinate ascent variational inference algorithm which is saying okay instead of trying to find",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4069.808,
    "end": 4097.605,
    "text": " both at the same time we start by fixing one and then optimizing the other and then use that so for example we start by fixing this q theta and then find q z and then use this newly found q z to find in q theta and then you can do that iteratively and hopefully get to the optimizer",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4099.306,
    "end": 4105.893,
    "text": " And that is also exactly the approach that is used for learning in the active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4106.674,
    "end": 4115.643,
    "text": "So very specifically, we first have some kind of prior belief about our generative model, about the parameters of the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4117.065,
    "end": 4122.951,
    "text": "So we fix that belief, so to say, or those parameters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4123.285,
    "end": 4142.003,
    "text": " and with those parameters with the generative model we can do inference like we looked at before like this bayesian bayesian inference and that's also what's done here so we get some kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4142.607,
    "end": 4149.621,
    "text": " So this is a different way of describing inference in terms of variation of free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4149.661,
    "end": 4156.636,
    "text": "But what's basically what's done here is we are just trying to infer what kind of latent state are we.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4157.116,
    "end": 4161.325,
    "text": "And we have fixed the parameters Q theta.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4163.11,
    "end": 4192.965,
    "text": " so and then we have this qz so this belief about the state we are in and then we are somehow where we want to be we want to to find this distribution q theta and then we use this this fixed qz to then optimize this distribution which is only dependent somehow on q theta and the qz is fixed",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4194.751,
    "end": 4222.497,
    "text": " and if you would really want to find the minimizer you would continuously be doing this alternating these two steps and what is very important to note here is that the active inference literature is saying our update is only doing the first step so we only do the first step we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4222.966,
    "end": 4238.22,
    "text": " do one time state inference and one time we optimize this parameter, I believe, on the parameter given this state inference, and then we stop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4238.921,
    "end": 4247.088,
    "text": "So it's not exactly the same as the CAFI algorithm, but you could say it's only the first step of the CAFI algorithm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4249.03,
    "end": 4251.572,
    "text": "And so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4253.105,
    "end": 4282.251,
    "text": " here i'm describing what does that minimizer then look like and that is given by this basically the exponent of the term that's here so you can also see that if we take the exponent and we take the log we just get what's there and then it's minus what's there so that is the minimizer so to say and i'm using these terms c with the backslash to say",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4282.805,
    "end": 4301.691,
    "text": " okay these are all terms independent of the argument so we don't have to worry about them for the minimization so here we have a very specific form of the updated belief in our parameter",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4302.734,
    "end": 4331.847,
    "text": " and then we can use the fact that we are actually working with this this uh deary slave priors and this categorical model and then we can so that p here that was defined here so in terms of these thetas and in terms of these theory slays and what you see then is that this uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4332.248,
    "end": 4360.737,
    "text": " updated q after the first step in this algorithm looks like this and this is exactly again a dirichlet distribution so that's a really nice result so i didn't make any assumption that it has to be a dirichlet distribution i only said okay we do this mean field approximation but it comes out",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4361.223,
    "end": 4369.833,
    "text": " that it is, if you only do the mean field approximation, that this first step of the CAFI algorithm is again a Dirichlet distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4370.894,
    "end": 4378.063,
    "text": "So we can formulate the update again in a very elegant way like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4378.123,
    "end": 4383.53,
    "text": "So we just add something to these two updated alphas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4384.791,
    "end": 4388.175,
    "text": "And what we add exactly is the following.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4388.577,
    "end": 4414.348,
    "text": " so for example this alpha d is related to the theta d which is um which is the belief about the prior belief in the latent state and we add um we add the belief",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4414.565,
    "end": 4437.973,
    "text": " after doing the inference that we are in that state so this is in some sense a very similar update to this update here where we are just adding one for the observation that we did but now we are not adding one for observation but we adding only the belief that we are in that state to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4438.612,
    "end": 4453.549,
    "text": " to the to the original alpha and something similar here where we add the belief in the transition more or less so um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4454.373,
    "end": 4468.947,
    "text": " Yeah, I can imagine that this was a little bit fast and maybe a little bit abstract because there were not not so many examples, but I felt this for the people who really want to know, OK, where do these equations come from?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4469.027,
    "end": 4473.972,
    "text": "I think this is quite a quite a relevant contribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4475.093,
    "end": 4480.719,
    "text": "And so what I was talking about now was only this X's and Z's.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4482.1,
    "end": 4483.722,
    "text": "The notes are still there, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4485.575,
    "end": 4487.577,
    "text": " Yeah, great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4489.799,
    "end": 4500.911,
    "text": "And now we want to translate this to this setting where we are actually having this S and the A's and the O's.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4501.772,
    "end": 4505.596,
    "text": "So then the equations get even a little bit more complicated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4505.636,
    "end": 4511.803,
    "text": "So I thought it was good to have this build up to first see, okay, what is the general principle?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4511.843,
    "end": 4513.945,
    "text": "This mean field approximation and the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4514.245,
    "end": 4543.037,
    "text": " Dirichlet coming out and then you can apply exactly the same procedure to this more complicated setting where we have this full generative model and then you get this derivation here which I don't I'm not going into now but there we see again at the end that we have a Dirichlet distribution and here you see okay alpha we have to add this to the alpha",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4543.523,
    "end": 4562.899,
    "text": " we have to add this to the alpha a we have to add this to the alpha b and then we get so this is the the main part of the paper we have these updates here for the learning",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4565.242,
    "end": 4584.87,
    "text": " so yeah so for the people interested in knowing where do these learning rules come from there is this appendix b which i went through now a little bit quickly and maybe a little bit high level but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4585.492,
    "end": 4610.217,
    "text": " yeah you can look at that in more detail or ask me questions about it if you are interested in this and maybe to just link it to the other literature so here there's this is the book of thomas parr there's this appendix b23 learning and here he is coming to the same",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4611.563,
    "end": 4641.537,
    "text": " equations but using a bit different method that i found hard to follow so yeah but these these update rules they are also here and the same also in this paper let's see if the reference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4645.415,
    "end": 4645.715,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4646.697,
    "end": 4655.389,
    "text": "So here we also have these updates, but also using a different method than the one I'm using.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4655.429,
    "end": 4661.999,
    "text": "And actually this method that I am presenting is referred to me by Connor Heinz.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4662.019,
    "end": 4673.295,
    "text": "So thanks very much for pointing me to this derivation, because I think this for me at least is the most clear one I have seen so far.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4674.338,
    "end": 4703.822,
    "text": " yeah so so far about learning so there's one i would be able to if their time allows could go briefly over the appendix a but maybe we also first take some time to for questions about this learning part and i'm also fine with not discussing this appendix a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4706.384,
    "end": 4707.245,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4707.265,
    "end": 4707.566,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4708.708,
    "end": 4716.4,
    "text": "I will ask some questions that were submitted by Arun, and then if anyone else has any questions, they can go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4718.223,
    "end": 4719.605,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4719.625,
    "end": 4720.126,
    "text": "First question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4720.326,
    "end": 4734.248,
    "text": "Do you intend the accompanying repository to be a static accompaniment to the paper, or do you see it evolving, for example, adding habitual policy selection to the agent via eTensor?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4735.493,
    "end": 4751.629,
    "text": " I would say from my side, I'm not really planning on developing it further, but if people want to, I am very happy, for example, if they fork the repository, copy it,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4752.082,
    "end": 4780.131,
    "text": " in any way would be nice if you reference me if you still use it but um yeah so from my side i don't see any further developments but i would be very happy if other people want to actively start using it so please get in touch if you want to cool okay would it be possible to further document the flattening class at first with comments but ideally with unit tests",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4781.512,
    "end": 4810.557,
    "text": " yeah so that is indeed so uh maybe a good point to make about the the code so um in pi mdp uh there is some i have that also here in appendix c i think and some yeah there is some extra um kind of structure being put",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4810.891,
    "end": 4817.119,
    "text": " on, for example, these conditional probability distributions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4817.159,
    "end": 4828.495,
    "text": "So, for example, we say the location in the next time step is independent of the reward condition in the previous time step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4828.515,
    "end": 4836.325,
    "text": "And that is for the computations, it's very nice because the computations get a bit easier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4837.722,
    "end": 4857.368,
    "text": " but the code gets a lot more complicated and you don't see especially because for example here if we look at all these for example get believe next states",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4861.685,
    "end": 4863.594,
    "text": " Yeah, I think that's a good example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4864.156,
    "end": 4866.367,
    "text": "Update believe current state, something like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4869.541,
    "end": 4870.767,
    "text": "For example, this one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4872.468,
    "end": 4897.952,
    "text": " um this is very simple and elegant i would say and that is because i am ignoring that so to say in the code that that there exists these independencies and i did that on purpose to keep the code as simple as possible but what is then a bit harder is that so um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4899.198,
    "end": 4921.56,
    "text": " So what PyMDP is using is having some kind of state which is somehow multi-dimensional and then also for example",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4921.979,
    "end": 4948.746,
    "text": " the a matrix let's say which is also has is i think some kind of list so in the observation state so there's observation modality state factor so these are both have can have multiple elements so this is a list of matrices and these matrices",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4949.333,
    "end": 4976.826,
    "text": " so for each modalities let's say each modality m and this is then again some kind of tensor where we have here the observations for that specific modality but then we still have here also",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4977.548,
    "end": 4996.097,
    "text": " for every state factor a different dimension so to say and in my case what I am doing is just saying okay we just say that we the state space is let's say one dimensional",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4996.887,
    "end": 5001.312,
    "text": " And we just have S1, 1, S1, 2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5004.777,
    "end": 5006.499,
    "text": "Let's say there's two state factors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5007.12,
    "end": 5011.565,
    "text": "And I'm just putting them all into a long list.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5011.585,
    "end": 5013.607,
    "text": "So to say, so that's what I call flattening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5014.328,
    "end": 5021.097,
    "text": "And then this A matrix is just one matrix where there's all the flattened states here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5021.737,
    "end": 5022.799,
    "text": "Let's say S flat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5024.821,
    "end": 5026.303,
    "text": "And here O flat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5027.414,
    "end": 5054.485,
    "text": " that makes the the code very easy but there i do need something to translate between the pi mdp states which are somehow have these different state factors and the flat states that i am using and that is indeed i agree is not uh the best documented code so i i wrote that and then i",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5055.46,
    "end": 5064.874,
    "text": " tucked it away in this flattening class and was hoping that everyone would believe me that it works well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5065.776,
    "end": 5078.956,
    "text": "But we could talk about it because I do think it's a good point that it would be nice if it has like if you don't just have to believe me that it works, but that you can actually check it yourself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5078.976,
    "end": 5084.404,
    "text": "So maybe we can you can send me an email and we can discuss how to best",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5085.127,
    "end": 5110.932,
    "text": " to best document it yeah lots of uh little challenges with matrix format and yeah small things that uh yeah definitely okay i'll ask aaron's last last uh question here and this is kind of a good uh final discussion piece which is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5111.789,
    "end": 5117.717,
    "text": " What do you see as the next key area to tackle in terms of increasing the clarity of how active inference works?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5129.694,
    "end": 5131.176,
    "text": "Yeah, that's an interesting question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5131.196,
    "end": 5140.75,
    "text": "So I felt that with this paper, most of the questions I had were answered.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5142.637,
    "end": 5154.73,
    "text": " I'm now looking a bit together with Lance Da Costa also at how well, for example, these learning rules in practice are actually performing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5154.75,
    "end": 5170.888,
    "text": "But that is maybe different from, so I feel at least in my opinion in the paper, it's clear how they are formulated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5171.712,
    "end": 5181.004,
    "text": " So I would say, yeah, I would be open for suggestions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5181.625,
    "end": 5192.218,
    "text": "So I have answered with this paper most of the questions at least I had about how active inference works and then of course about this very specific domain of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5192.519,
    "end": 5221.058,
    "text": " discrete time domain yeah what what did you uh think or have any conversations about how this relates to the continuous and the path-based versions so i have actually only spent time with the discrete setting so um i was i think in the beginning very optimistic i thought okay first understand the discrete and then the continuous",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5221.73,
    "end": 5230.047,
    "text": " But then I first spent time on understanding it, and then I thought, okay, let me write this paper on it, which also took quite some time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5230.468,
    "end": 5234.497,
    "text": "So I actually have no experience with the continuous case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5235.178,
    "end": 5235.699,
    "text": "I'm not sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5236.18,
    "end": 5237.764,
    "text": "Lance is not here, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5239.207,
    "end": 5239.407,
    "text": "No.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5239.928,
    "end": 5241.291,
    "text": "Otherwise, we could ask him.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5242.013,
    "end": 5261.98,
    "text": " but he is more familiar with uh so i think that's more a question for him maybe he said some way able to answer that at some point cool what are your next steps or how are you gonna move forward having satisfyingly reduced your uncertainty about discrete states",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5263.293,
    "end": 5263.633,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5263.653,
    "end": 5273.685,
    "text": "So I am very interested in general in this, uh, we could maybe call it AB learning, uh, domain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5273.765,
    "end": 5277.95,
    "text": "So how is an agent actually learning these, uh, matrices?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5277.97,
    "end": 5293.047,
    "text": "So, uh, together with Carlotta, with my colleague, we were also applying this framework to study, uh, consciousness or are still busy with that and a paper about it, hopefully coming out soon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5293.634,
    "end": 5321.515,
    "text": " where we use an active inference agent and then look at how its integrated information is developing and but we saw actually in the environment that we were using that it was very hard for the agent to learn the a and b matrices or learn an a and b matrices that allows it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5321.933,
    "end": 5348.515,
    "text": " to operate well in the environment so for me that's the next big question is how what is actually are these learning rules from active inference the right ones or are there other rules that are maybe more effective and maybe more probable so that is for me a big question that i completely don't have an answer to right now but this really i find really fascinating",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5350.84,
    "end": 5351.301,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5351.681,
    "end": 5353.784,
    "text": "Any other comments you'd like to make?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5356.649,
    "end": 5379.362,
    "text": "So I think it's good to finish it here, but just to say that it's there is, there's also this Appendix A, so maybe a bit too weirdly, but I think all of free energy and active inference usually is formulated as a minimization of this variation of free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5380.574,
    "end": 5387.888,
    "text": " But starting the story from there, I find then it gets very confusing most of the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5388.469,
    "end": 5397.486,
    "text": "But I do write here in Appendix A how everything that's written in this paper can also be related to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5399.103,
    "end": 5416.268,
    "text": " to this bigger idea of minimizing a variation of free energy function so you can just read through it here perception learning and action selection how they are all related to minimizing this function just so you know that it's there",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5419.319,
    "end": 5419.9,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5419.92,
    "end": 5426.528,
    "text": "Well, again, thank you for the importance and pedagogical work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5427.108,
    "end": 5429.131,
    "text": "I look forward to many in this genre.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5431.113,
    "end": 5432.955,
    "text": "Thank you so much for the opportunity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5433.156,
    "end": 5441.706,
    "text": "And again, if anyone is has any questions or wants to reach out, please feel free to do so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5441.726,
    "end": 5442.026,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5442.607,
    "end": 5442.967,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5444.509,
    "end": 5445.09,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  }
]