[
  {
    "start": 8.924,
    "end": 37.834,
    "text": " hello welcome everyone it's march 21st 2025 and we are here with a bunch of the developers of rx infer and lazy dynamics we will be having a presentation followed by a discussion so looking forward to everyone's comments here on the panel and to anyone watching live looking forward to your questions in the live chat albert to you for the presentation and thanks everybody again for joining",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 40.16,
    "end": 69.036,
    "text": " hi hi everyone yeah thanks daniel for uh this introduction um yeah so uh for everyone my name is albert i'm a ceo of lazy dynamics which is a spin out from einhoven university of technology and lazy dynamics essentially builds uh infrastructure for developing adaptive agents such as inference agents and today i'm pleased to to have almost full lazy dynamics team here with me",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 69.674,
    "end": 93.808,
    "text": " so yeah let's uh let's get started um i must say that actually yeah this talk is uh going to be admittedly uh provocative perhaps even a click bait uh but uh yeah let's just have some fun here and actually i hope that many of active interference practitioners can relate to the pain point i'm about to discuss",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 94.548,
    "end": 100.637,
    "text": " So yeah, now I kind of expect that some people won't like the way we pose the question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 101.678,
    "end": 115.157,
    "text": "And yeah, I'm hoping, I'm actually not going to answer in the way that people might anticipate because yes, active inference is a theoretical framework, which is very elegant and very powerful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 116.94,
    "end": 121.146,
    "text": "But if you look at this from a practitioner perspective,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 121.565,
    "end": 123.147,
    "text": " it leaves much to be desired.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 123.627,
    "end": 141.607,
    "text": "So from a framework that claims to be superior to reinforcement learning, that promises to revolutionize AI, that's supposed to explain actually everything from bacterial behavior to human consciousness, what do we see in practice?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 141.647,
    "end": 146.011,
    "text": "What do people who are getting excited actually see in practice?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 147.493,
    "end": 151.217,
    "text": "Well, look at this beautiful theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 151.72,
    "end": 177.508,
    "text": " uh groundbreaking uh or like uh equations and yet uh this is sort of a typical reaction from uh from a developer so they're literally like running away and i don't think we can actually blame them uh for that because uh well we've somehow managed to take one of the most promising frameworks for the intelligent systems and make it so complex",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 177.893,
    "end": 207.327,
    "text": " that even a phd student would think twice before implementing it so and i just want to draw sort of a parallel and look at what's happening in the rest of ai yeah so five lines of code that's all it takes to access the state-of-the-art transformer models so if you want to analyze satellite imagery done want to create a conversational agent done",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 208.117,
    "end": 210.9,
    "text": " I want to synthesize a video or audio.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 211.501,
    "end": 211.741,
    "text": "Done.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 212.962,
    "end": 215.946,
    "text": "So half a page of the unique code.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 217.207,
    "end": 220.19,
    "text": "But meanwhile, implementing an active inference agent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 220.491,
    "end": 222.813,
    "text": "Well, let me just walk you through this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 222.853,
    "end": 223.634,
    "text": "So what it takes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 224.335,
    "end": 228.239,
    "text": "First, you read through hundreds of pages of dense mathematical theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 228.88,
    "end": 232.004,
    "text": "Then you spend months on implementing some custom algorithms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 232.584,
    "end": 235.708,
    "text": "Then you debug some mysterious convergence issues.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 236.569,
    "end": 237.87,
    "text": "And after all that work,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 238.93,
    "end": 265.225,
    "text": " do we have well more often than not it's going to be a teammates example or like maybe a mountain car yeah i mean come on what is what is this you just like you just made me read dozens of pages of heavy math to console me with the moving pixels on the screen right so this is quite a leap between i'm better than reinforcement learning and i can do a team is better than reinforcement learning",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 265.66,
    "end": 266.641,
    "text": " So, I mean, come on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 266.661,
    "end": 268.623,
    "text": "So we're like in 2025 now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 268.643,
    "end": 275.752,
    "text": "So the rest of AI is solving like really interesting world problems and like having really interesting demos.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 276.392,
    "end": 279.836,
    "text": "And we are still celebrating when our agents can turn left or right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 279.996,
    "end": 295.414,
    "text": "So, and truth to be told, I mean, I think my personal experience is that, yeah, like each time I'm getting to this active inference literature, it's, to put it mildly, not always very much reproducible or like half of it is not, there's not much to reproduce it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 295.765,
    "end": 316.457,
    "text": " so the point here is that this needs to be changed so uh and not just for convenience but because this complexity is i think actively holding back the entire field we are basically limiting the active inference to a tiny group of theoretical specialists when it should be in the hands of every ai developer",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 316.994,
    "end": 343.879,
    "text": " um and the saddest part actually of all these that people who used to be passionate about the theory they just give up on it and we just see it all around uh like in the community so how can we fix that how can we actually make this as accessible as transformers so for starters uh we must recognize what makes active inference agent unique yeah so well",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 344.737,
    "end": 370.778,
    "text": " according to the theory it's obviously not the inference mechanics right because the inference mechanics is same across all agents it's just free energy minimization so what's left what's left for us like these three three lines of code is basically the model and constraints so this is what um this is the only unique part this is the only like this unique three lines of code if you wish um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 371.213,
    "end": 397.356,
    "text": " uh which is which defines the agent so it's it's should be only about model definition and constraints um and that's exactly what we are trying to do with ericsson fur uh we developed the framework that we are when we are continuously developing this framework that allows you to provide a model constraints and run the inference guided by the free energy minimization",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 398.315,
    "end": 403.082,
    "text": " And I'll talk about this in the next slide a bit more.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 403.623,
    "end": 418.607,
    "text": "And what we actually can see is that once you have the framework right, or let's say almost right, because it's a development project, you can streamline the development of these agents by orders of magnitude.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 419.148,
    "end": 422.533,
    "text": "And seriously, like when I started my PhD, I spent",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 423.458,
    "end": 431.771,
    "text": " few years trying to build an audio counterpart of a T-Maze demo that people can now build in just a few hours.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 432.452,
    "end": 437.079,
    "text": "So that's kind of the order of magnitude you should think of.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 437.099,
    "end": 441.966,
    "text": "And yeah, just to zoom in a little bit on some of the examples.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 442.687,
    "end": 448.656,
    "text": "Now, basically, if you want to build a drone that does planning through inference,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 449.345,
    "end": 474.711,
    "text": " would just take about 10 lines of code to define the drone model and then like run inference to get this nice path planning um so here you see like two 3d drone uh examples one is fine in the rainy day another one is in the sunny day and another one is like 2d drone which i'm more excited about because it actually fills this reactivity aspect of our framework so you could see that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 475.282,
    "end": 499.956,
    "text": " we are changing the environment and the drone doesn't fault it continues to sort of reinfer its policies and it states in order to reach this goal no matter the environmental changes so yeah 10 lines of code so um if you want to yeah same same applies to locomotion control so there are two examples one for robotic arm another one for this uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 500.341,
    "end": 529.487,
    "text": " is the name for this uh robot i forgot but basically this swinging swinging uh monkey robot right so let's uh let's phrase it this way um so again define your model run inference um if you want to have multi-agent navigation in a dynamic environment with collision avoidance and speed constraints that would take you like 15 miles of code not uh thousands just uh 15. that's uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 530.26,
    "end": 531.746,
    "text": " Quite a boost, I would say.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 531.866,
    "end": 540.338,
    "text": "So yeah, another just a few demos from our repository.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 541.06,
    "end": 547.028,
    "text": " Again, if you want to integrate deep learning into RxInfer, it's also possible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 547.088,
    "end": 550.913,
    "text": "You can learn the dynamics and predict the future sequences all in one go.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 551.093,
    "end": 553.816,
    "text": "So it's not two separate function calls.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 553.896,
    "end": 554.597,
    "text": "You just define it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 555.078,
    "end": 557.221,
    "text": "You just call the inference within the same model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 557.501,
    "end": 560.605,
    "text": "So here's about eight lines of code.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 561.293,
    "end": 585.225,
    "text": " and yeah surely how could we avoid mentioning a better version of teammates so that's that's something not publicly available though but that's something we've been working on this kind of an agent that needs to solve a mini grid so there is an agent that needs first to locate the key then take the key then figure out that he needs to open the door and then go to the to the exit",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 585.425,
    "end": 587.828,
    "text": " So that's something that works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 588.168,
    "end": 593.975,
    "text": "This is the only example which is not publicly available yet, but it will be soon.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 594.476,
    "end": 611.736,
    "text": "And yeah, before I go into how we are doing that, I just want to say also that these examples themselves, they're hardly as impressive as reinforcement learning demos or MPC demos.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 612.121,
    "end": 633.606,
    "text": " uh but they're better than i would say this stigmatized examples of uh active inference supremacy so um yeah um i think that um it's still ongoing uh but it's it's it's going pretty fast um and um yeah so how we do it what's our approach um so we do it",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 634.328,
    "end": 663.964,
    "text": " through essentially four key innovation so that the first one is most important is like free energy minimization it's automated uh you no manual derivations uh needed for a very large class of models and they're like they're composable but that's basically why we adhere to factor graphs because a factor graphs is a very convenient underlying model representation",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 664.636,
    "end": 675.512,
    "text": " which allows us to essentially seamlessly combine different models into bigger models, or the other way around, decompose bigger models into smaller submodels.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 676.614,
    "end": 688.451,
    "text": "And another thing, of course, we adhere to asynchronous data such that we can handle and facilitate this real-time adaptation to changing environments.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 689.272,
    "end": 693.799,
    "text": "And the really key thing here is reactive message passing technology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 694.336,
    "end": 720.394,
    "text": " um and in our opinion this is the actual key to successful implementation of functional agents or like functional active inference agents um and the argument here is that see the world uh the real world i mean it doesn't start and stop at the agent's convenience so the agent must react adapt act upon in one environmental data streams so if something unexpected",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 720.526,
    "end": 747.36,
    "text": " happens and like the world always brings some some uh unexpected uh things to the yeah to you and yeah you essentially you you have to adapt so we must compute our policies we must compute our posteriors no matter the failure so that was what you could see with that little drone demo um and so this is what our implementation of um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 748.775,
    "end": 749.877,
    "text": " I think so.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 749.937,
    "end": 757.509,
    "text": "This is something that like what the other implementation of active inference aren't getting quite right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 758.591,
    "end": 766.924,
    "text": "I think actually, to be fair, most of the reinforcement learning libraries adhere also to this imperative updates of their policies and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 768.727,
    "end": 774.276,
    "text": "Nevertheless, I don't want to give the impression that the current implementation of reactive message passing works as we wish it would.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 774.678,
    "end": 775.84,
    "text": " It's super fast.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 776.361,
    "end": 780.588,
    "text": "We are beating, in terms of inference, many other frameworks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 781.189,
    "end": 785.115,
    "text": "But we also recognize how it can be improved.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 785.195,
    "end": 788.441,
    "text": "And the truth to be told, it can be improved.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 788.561,
    "end": 790.364,
    "text": "We can actually make it faster and better.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 791.045,
    "end": 792.748,
    "text": "That is something we are working on as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 793.729,
    "end": 796.694,
    "text": "So what's the state of RxInfer today?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 798.637,
    "end": 799.639,
    "text": "RxInfer is...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 800.007,
    "end": 827.078,
    "text": " was and will remain the open source library that has more than now 10 years of cumulative development time we are about 10 active developers from laser dynamics and bias lab bias lab is the laboratory where we spun out from uh and of course active inference institute uh who's helping us with the development of the graphical interface with demos like there's a really lots of help coming from active inference that we appreciate",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 827.48,
    "end": 855.495,
    "text": " um so we have over 700 uh 30 stars on github across reactive base packages and more than 300 monthly downloads now i mean that that these are not the craziest number you could think of but i think here's why these numbers actually matter they show that when despite all the barriers despite all the complexity despite having to learn",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 856.268,
    "end": 879.289,
    "text": " julia despite having to learn probabilistic programming uh people are still pushing to use active inference uh they push to use ericsson fur in general and we are seeing this uh and it just just try to imagine like if we are seeing that much um interest uh when it is hard i just want you to imagine uh what would happen when we make it easy",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 880.72,
    "end": 883.123,
    "text": " And that's kind of exactly what we are building towards.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 883.363,
    "end": 896.8,
    "text": "So before RxInfer, in the early days of my PhD, and I think even prior to that, I had to write quite some code and actually do quite some math.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 897.12,
    "end": 905.931,
    "text": "Now with BiasLab and reactive base community, we push it to the one page of model definition and like everything else is automated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 907.193,
    "end": 910.457,
    "text": "But at Lazy Dynamics, we also recognize that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 910.673,
    "end": 932.243,
    "text": " even that is too hard so even even that is uh really not going to streamline the development of active information because there is like a huge python community and like people want to integrate uh our models with with their models and support so that's what that's where lazy dynamics came in",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 932.51,
    "end": 943.347,
    "text": " So we are actually going to hide the complexity even further and wrap the models into a nice open IP available for Python, Rust, and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 943.9,
    "end": 948.505,
    "text": " So we do recognize that model specification is still hard for many users.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 948.565,
    "end": 952.308,
    "text": "So in the beginning, we will provide models for users and developers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 953.509,
    "end": 957.513,
    "text": "We will start simple, and then we will make it more and more interesting and complex.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 957.533,
    "end": 965.621,
    "text": "So with the vision of that people can actually will be able to submit their models, post their models, and we will just provide the API to trigger those.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 967.343,
    "end": 971.427,
    "text": "So a bit of teaser.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 971.795,
    "end": 973.778,
    "text": " It's not available for mass use.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 973.798,
    "end": 975.601,
    "text": "It's just something we are testing internally.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 976.742,
    "end": 978.746,
    "text": "So how that's going to look like?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 980.027,
    "end": 995.09,
    "text": "Well, so one would basically have to load the model from our pool of RxInfer models, and then run inference slash planning, take actions, and learn.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 995.11,
    "end": 1000.198,
    "text": "So we will do it now in the separate API calls for clarity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1000.567,
    "end": 1002.47,
    "text": " I mean, the mechanics under the hood are the same.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1002.49,
    "end": 1003.792,
    "text": "So it's just free energy minimization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1003.812,
    "end": 1008.68,
    "text": "We just realized that people get a hang of it faster if you just pause it like this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1009.061,
    "end": 1011.144,
    "text": "But yeah, it's a work in progress.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1012.186,
    "end": 1015.291,
    "text": "We plan to release this API in the early Q2.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1016.633,
    "end": 1022.963,
    "text": "So it won't be as flexible as RxInfer, but it will expose endpoints and we will make it better over time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1023.837,
    "end": 1049.271,
    "text": " um yeah and this is uh the team that has this ambition like this is lazy dynamics team but i must say that there are more people behind this now so there are more people behind the rx infer development uh this is just solely the lazy dynamics team uh the yeah um but there are more developers as i said outside this lazy dynamics team so uh yeah just uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1050.348,
    "end": 1063.767,
    "text": " Yeah, I think last few bites for me is that yeah, I think that active inference needs to move finally from like this beautiful beyond beautiful theory and into practical applications.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1064.348,
    "end": 1068.614,
    "text": "We are going that it's possible and the framework is indeed revolutionary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1068.634,
    "end": 1071.759,
    "text": "And I think that now it's time to make it usable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1072.58,
    "end": 1074.783,
    "text": "So yeah, thank you for listening.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1074.863,
    "end": 1079.41,
    "text": "And here I'd like to stop and actually invite people for questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1083.203,
    "end": 1084.004,
    "text": " Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1084.024,
    "end": 1084.405,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1085.026,
    "end": 1090.174,
    "text": "If any of the others here just would like to go around, say hello if they'd like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1090.935,
    "end": 1091.877,
    "text": "Any first thoughts?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1091.997,
    "end": 1094.32,
    "text": "And meanwhile, anyone in the live chat can write questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1099.949,
    "end": 1102.393,
    "text": "Which order do you want to go, Daniel?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1104.112,
    "end": 1105.616,
    "text": " I mean, I can start.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1105.696,
    "end": 1111.411,
    "text": "I think it's fantastic what Albert and the team is developing.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1112.393,
    "end": 1120.534,
    "text": "I still believe active inference is the future, also to reinforcement learning problems.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1120.514,
    "end": 1126.29,
    "text": " And it's the tool set, user-friendly tools, that's lacking.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1126.331,
    "end": 1135.958,
    "text": "So this is an initiative, I think, that hopefully will get us closer to recognition of active inference",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1135.938,
    "end": 1140.805,
    "text": " as the underlying framework for future intelligence agents.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1142.508,
    "end": 1150.1,
    "text": "And everybody is invited to contribute, to critique, to give feedback.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1150.6,
    "end": 1159.795,
    "text": "So yeah, we're very open in terms of how we should develop towards the future because we don't have all the answers ourselves.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1161.237,
    "end": 1164.662,
    "text": "But yeah, this is our push, first push.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1164.946,
    "end": 1168.711,
    "text": " to make it as simple as working with transformers.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1172.717,
    "end": 1177.644,
    "text": "Dimitri, do you want to add a few words as a core architect of Rick's Infer?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1178.765,
    "end": 1185.134,
    "text": "Well, I can only add that you're a little bit wrong saying that it's not publicly available.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1185.154,
    "end": 1187.157,
    "text": "Actually, the API is",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1187.542,
    "end": 1214.781,
    "text": " almost publicly available we have released the initial version of it we just didn't advertise it as much and it doesn't really have all the models that we have but we we are planning to release the api that albert has mentioned the server for free for now so everyone can experiment and everyone can break it as fast as possible because as soon as we fail we know how to fix it",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1215.335,
    "end": 1223.464,
    "text": " So fail-fast approach, we will deliver new models, we will test it, we will fail, we will improve.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1224.164,
    "end": 1228.949,
    "text": "And for this, we essentially need more people to try it out.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1229.97,
    "end": 1236.217,
    "text": "Because we have our internal use cases, we try it out, it works on our internal cases.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1236.918,
    "end": 1241.022,
    "text": "But there are many other people who also want to try this approach.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1241.002,
    "end": 1250.1,
    "text": " so we will co-develop the model so we'll release them for free for now for the free api and we'll see how it goes",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1256.442,
    "end": 1281.42,
    "text": " this is just the tip of the iceberg right so i think the team of lazy dynamics we have already had the pleasure to work with the api so a year ago we all didn't think it would be possible but especially with a lot of effort from the meet free we're now able to call rx for from python so this should integrate very easily with existing um reinforcement learning toolboxes out there and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1281.4,
    "end": 1283.423,
    "text": " I've already had the opportunity to play with it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1283.983,
    "end": 1288.489,
    "text": "I'm playing with it also before this live stream and I'm really enjoying it so far.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1288.75,
    "end": 1295.559,
    "text": "So basically merging the infrastructure that's available in Julia with everything that's already available in Python.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1296.5,
    "end": 1298.803,
    "text": "And I think that's just the tip of the iceberg.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1299.043,
    "end": 1301.306,
    "text": "There's a lot more in store coming up real quick.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1303.149,
    "end": 1303.369,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1303.85,
    "end": 1306.453,
    "text": "So everyone would want to try it out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1307.454,
    "end": 1310.158,
    "text": "Also just contact us, reach out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1310.898,
    "end": 1320.148,
    "text": " share contact details, whatever you want, because I think we should all adopt this approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1320.168,
    "end": 1336.146,
    "text": "Maybe just Bart, one follow-up question there, like in integrating through Python calls to RxInfer, where do you see that plugging in for somebody who wants to use it amidst the other machine learning methods they're already deploying?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1337.324,
    "end": 1338.952,
    "text": " Like what would that look like?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1338.972,
    "end": 1344.077,
    "text": "How would they conceptualize of their pipeline and where these kinds of probabilistic models would fit in?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1345.66,
    "end": 1357.453,
    "text": " I think these probabilistic models themselves are very important when you are trying to model a process that involves uncertainty or making these autonomous systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1358.113,
    "end": 1367.303,
    "text": "So in those regards, I think that's where current machine learning frameworks often lack, is that usually there's this black box neural network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1367.323,
    "end": 1368.985,
    "text": "I think personally that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1369.218,
    "end": 1399.073,
    "text": " having a probabilistic take on specific aspects being just in the latent space of a neural network right i think that could benefit a lot of enterprises and a lot of products making them more reliable and robust and because most of these products have like some back end some machine learning models already in python i think that would be amazing to integrate rx refer from julia into their existing infrastructure",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1401.635,
    "end": 1418.953,
    "text": " Just on top of that, there is an opportunity that, well, not the opportunity, there are a few demos people are trying out, is basically to connect their LLM-based agents with, to connect them to the backend of RxInfer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1420.394,
    "end": 1422.296,
    "text": "That's also something feasible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1422.977,
    "end": 1428.182,
    "text": "And apart from it, so there are many problems indeed that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1428.719,
    "end": 1446.34,
    "text": " can be tackled with probabilistic programming languages right like uh you can there are many at the table like imc and non-pyro and yeah people use them as components into their bigger like machine learning pipelines and here the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1447.028,
    "end": 1466.016,
    "text": " Well, now you basically can do it with RxInfer, just basically without leaving your Python environment, you can call RxInfer to provide you with some uncertainty estimates and confidence over the answers for other parts of your machine learning pipelines.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1468.173,
    "end": 1479.179,
    "text": " We can also add maybe here a little bit to expand how we can integrate with LLMs, because we can imagine that LLM is a source of noisy data.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1479.219,
    "end": 1484.832,
    "text": "For example, you can ask questions to LLM to give some numerical answers.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1484.812,
    "end": 1506.465,
    "text": " uh but you should not really trust it so you may you may think of it as the noisy observation of a real data so and you can create a model that takes into it into account and basically treat this as your observations and then the underlying probabilistic model will infer the real parameters of the process",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1506.445,
    "end": 1529.82,
    "text": " so i think uh yeah ericsson fair can be integrated very naturally in the existing pipeline so it shouldn't really be or it's not necessary to have just ericsson in your pipeline it can be integrated with like other data collection libraries or the existing machine learning libraries so yeah i think uh but uh",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1531.235,
    "end": 1540.271,
    "text": " It excels when you really need to create a plan given a noisy set of observation and given the model of the process.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1543.777,
    "end": 1544.098,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1545.2,
    "end": 1554.576,
    "text": "Ismail, if you'd like to add anything, and then otherwise maybe to Fraser, and then we'll go to some pre-written questions in the live chat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1556.632,
    "end": 1557.453,
    "text": " Yeah, sure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1557.473,
    "end": 1559.696,
    "text": "I'd like a couple of things to say.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1561.378,
    "end": 1581.805,
    "text": "First of all, the new RxInfo server, I think, will add extraordinary capabilities for both Python developers and for Julia developers that are struggling to find the right platform to develop agents that are not hallucinating.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1582.747,
    "end": 1586.031,
    "text": "Yeah, so for that big",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1586.011,
    "end": 1589.778,
    "text": " Many thanks to Dimitri for realizing this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1590.901,
    "end": 1608.154,
    "text": "And yeah, I would like to invite everyone who is keen on learning about machine learning and developing agents or developing models for whatever task they have in mind to try out RxInfer and",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1609.94,
    "end": 1621.29,
    "text": " engage with us their problems and their experiences, whether it's positive or negative, that will be a very valuable information for us.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1622.373,
    "end": 1624.86,
    "text": "And that's mostly it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1627.22,
    "end": 1635.295,
    "text": " If I can add, I see a little bit like a big focus on Python, but Albert didn't really focus on that much.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1635.315,
    "end": 1643.811,
    "text": "But the way we created Ericsson First Server is with the open API specification that allows",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1643.791,
    "end": 1655.086,
    "text": " to use the same API from any language that supports OpenAPI, which includes basically all languages that exist, including Julia.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1655.226,
    "end": 1671.148,
    "text": "So it is possible to use Julia for extender server or Python or JavaScript or Rust or even C. And if I'm not mistaken, even microcontrollers, they do have some sort of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1671.128,
    "end": 1690.521,
    "text": " a layer between this open api specification so it really opens doors not just for python developers but uh also from the browser we can now use our extender because javascript is also supported so it really opens doors like for experimentation in many fields",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1694.99,
    "end": 1695.391,
    "text": " Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1696.232,
    "end": 1701.96,
    "text": "Brazier, you prepared some excellent comments, so however you'd like to continue, go for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1703.462,
    "end": 1703.783,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1703.803,
    "end": 1704.123,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1704.744,
    "end": 1708.609,
    "text": "I should just clarify, I'm not a developer on RxInfer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1709.17,
    "end": 1713.977,
    "text": "I'm an open source contributor, and I'm a PhD student at Glasgow, but I'm not part of the core team.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1714.21,
    "end": 1720.939,
    "text": " So I have, I think, Daniel, what I'll do is I'll condense those questions I had down into two, hopefully just to save a bit of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1721.86,
    "end": 1725.224,
    "text": "The first question is about active inference more generally, because this talk was, well, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1725.364,
    "end": 1726.366,
    "text": "First of all, thank you for the talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1726.386,
    "end": 1727.627,
    "text": "It was very enlightening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1727.988,
    "end": 1728.528,
    "text": "It's excellent stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1728.548,
    "end": 1729.43,
    "text": "Thank you, Albert.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1730.471,
    "end": 1738.501,
    "text": "But about active inference, the problems with active inference, you know, and how Rx and For is kind of addressed to solve them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1738.902,
    "end": 1741.365,
    "text": "It seems to my mind, basically, that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1741.717,
    "end": 1744.382,
    "text": " We have issues with real-time inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1744.542,
    "end": 1747.788,
    "text": "We have issues with robust inference and scalable inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1748.41,
    "end": 1756.264,
    "text": "And then even beyond that, scaling, say, like the generative model itself to be able to take care of more sophisticated inference queries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1757.346,
    "end": 1762.476,
    "text": "Those kind of three things seem to me to be the current issues with active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1762.591,
    "end": 1764.674,
    "text": " making it real-time, robust, and reliable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1765.576,
    "end": 1774.711,
    "text": "I mean, RxInfer has effectively been kind of the best tool in the game for addressing those concerns because of its very nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1775.292,
    "end": 1783.866,
    "text": "But can anyone speak to, let's say, perhaps how continuing development of RxInfer are going to assist in those three kind of domains?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1783.886,
    "end": 1785.849,
    "text": "And I have a follow-up question about RxInfer server.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1786.43,
    "end": 1789.054,
    "text": "So I know it's very broad, but alas, I had to ask it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1789.912,
    "end": 1791.435,
    "text": " Mitr, do you want to answer which one?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1791.455,
    "end": 1792.718,
    "text": "Yeah, yeah, I can answer.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1792.738,
    "end": 1793.52,
    "text": "It's a great question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1793.6,
    "end": 1805.507,
    "text": "So right after Ericsson FUR server, what we plan, we want to change and refactor the core of Ericsson FUR.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1805.487,
    "end": 1819.956,
    "text": " to make the points that you mentioned even easier to do, even easier to scale and faster to run inference, but also to make it easier to debug and to contribute for other people.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1820.036,
    "end": 1827.31,
    "text": "Because also with the experience with you, we noticed that it's quite difficult to contribute because",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1827.29,
    "end": 1852.335,
    "text": " uh the first of all it's written in julia so not all of people know julia but also because it's uh it has been it has started as a phd project and certain parts weren't really designed very well so we will take a step back and we'll given all the knowledge that we have now and given all the feedback and given all the goals that we and other people want to achieve",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1852.315,
    "end": 1873.497,
    "text": " will redesign the the entire core of reactive mp uh and this this potentially will open the doors also to run the inference on gpus for example so that's that's how transformers basically scaled themselves right they they started to use gpus at all uh at large scale",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1873.477,
    "end": 1886.795,
    "text": " So we have big plans to improve the scalability even further and make the inference even faster and easier to maintain and debug and contribute for other people.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1889.639,
    "end": 1889.959,
    "text": "Excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1890.099,
    "end": 1893.804,
    "text": "That sounds like a small problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1896.148,
    "end": 1897.489,
    "text": "Did I cut someone else off there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1897.509,
    "end": 1898.691,
    "text": "I sensed another voice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1899.515,
    "end": 1900.777,
    "text": " Yeah, well, that was me.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1900.797,
    "end": 1902.879,
    "text": "I mean, you didn't really cut me off.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1902.939,
    "end": 1906.624,
    "text": "But yeah, perhaps I can add to that a bit.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1906.924,
    "end": 1909.127,
    "text": "I'm more of a big picture person.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1909.147,
    "end": 1920.662,
    "text": "And so maybe also for people that are just wondering about active inference and are still in other areas of machine learning, like reinforcement learning or deep learning, why would they be interested?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1920.642,
    "end": 1929.498,
    "text": " So I think most people agree that the Bayesian inference is a correct framework for dealing with uncertainty.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1930.019,
    "end": 1937.713,
    "text": "But the big thing is the computational cost and that limits us in scaling this all up, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1938.855,
    "end": 1943.123,
    "text": "So people have mentioned ideas like, well, maybe we should do planning as inference.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1943.508,
    "end": 1971.608,
    "text": " um this is possible with arcs and fur and we're working on stuff that we will probably reveal also in the next half year where i think it will be a nice surprise and how to do planning as inference and then there is a an even more broader idea that this idea that you shouldn't do bayesian inference because of the computational cost which limits the scaling i think it's almost the opposite around by um",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1972.145,
    "end": 1995.621,
    "text": " doing Bayesian inference you have access to where the uncertainties are and therefore you also have access to when you just should stop computing because you shouldn't you shouldn't compute more accurately than than than is needed right when when your data is uh when you have a large variance about your data or your variables you don't need very accurate computing so um",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1995.871,
    "end": 2025.878,
    "text": " i think once we're done with bayesian inference i mean not just lazy dynamics but the whole community is going to turn out that it is not that it's going to be because of doing it doing bayesian inference that we can do actually scale up intelligent agents to very large problems so asian inference will not be uh the the hindrance it will be a catalyst for scaling up um so that's the i think why people should get interested in uh",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2025.858,
    "end": 2030.268,
    "text": " in active infants, even if they're still in just researching at this moment.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2033.355,
    "end": 2033.676,
    "text": "How is it?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2036.522,
    "end": 2036.823,
    "text": "Excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2036.843,
    "end": 2037.424,
    "text": "Thank you, Bart.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2037.504,
    "end": 2039.108,
    "text": "I'm very, very, very",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2039.56,
    "end": 2041.422,
    "text": " keen on the entire methodology here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2041.562,
    "end": 2044.205,
    "text": "Just my last question, and then I'll open it up to everybody else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2044.745,
    "end": 2060.722,
    "text": "So about RxInfer server, I myself, I played around creating a few active inference agents, bona fide agents with RxInfer, which is currently difficult because RxInfer, it specifies the inference procedure and automates the way that that happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2060.742,
    "end": 2063.144,
    "text": "The actual design of an agent is kind of another thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2063.985,
    "end": 2065.787,
    "text": "The inference procedure is one part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2065.767,
    "end": 2070.218,
    "text": " But at the moment, I and anybody else making an agent has to do everything kind of ad hoc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2070.258,
    "end": 2074.609,
    "text": "We have to specify, well, if an action happens here, that affects the environment in some specific way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2074.669,
    "end": 2076.334,
    "text": "It's all very ad hoc and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2076.394,
    "end": 2080.063,
    "text": "So my understanding is that the agent API",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2080.398,
    "end": 2105.46,
    "text": " as part of rx and first server is going to perhaps ameliorate these issues or standardize the way in which we talk about how an action influences the environment and vice versa is is that's uh let's say a big focus of the api or is that just now a part of the api in the sense that we can now do much broader things like have endpoints in python and so on so it's kind of a larger uh concern than just this api so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2106.149,
    "end": 2108.452,
    "text": " Yeah, sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2108.472,
    "end": 2110.435,
    "text": "I think Dmitry would definitely add upon that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2110.555,
    "end": 2120.448,
    "text": "Just from my side, there is actually ongoing discussion that I forgot to mention, like in our GitHub repository about the standardizing API.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2120.468,
    "end": 2124.934,
    "text": "I think one of the things which we are also striving with our",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2125.319,
    "end": 2147.749,
    "text": " uh this ericsson first server and generally like with streamlining this development of agent is actually to standardize how the api should look like that there should be a certain function that should be triggered uh in uh well in the reactive way or in the loop if you prefer imperative style coding but there should be like really uh sort of we want to impose",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2148.067,
    "end": 2176.487,
    "text": " one way or few ways to actually doing that so yeah another thing is just want to welcome everyone to to this discussion on um uh yeah ericsson for repository where uh you fraser and like and other people from active inference institute also participated but the goal of course is uh the end goal is sort of to to bring in the key components which are needed to yeah run agents uh in the way we run transformers",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2176.467,
    "end": 2178.25,
    "text": " I mean, low code.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2182.779,
    "end": 2183.36,
    "text": "Okay, I see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2183.44,
    "end": 2183.721,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2183.881,
    "end": 2185.083,
    "text": "Well, Daniel, I'll hand it back to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2185.123,
    "end": 2186.646,
    "text": "Maybe we can look at some questions in the live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2186.706,
    "end": 2187.808,
    "text": "I'd just like to say thank you very much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2188.43,
    "end": 2189.452,
    "text": "This is an incredible project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2189.932,
    "end": 2191.596,
    "text": "I'm very enthusiastic about the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2191.696,
    "end": 2192.718,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2192.738,
    "end": 2193.018,
    "text": "Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2193.479,
    "end": 2198.188,
    "text": "I'll read some questions in the live chat, and then we'll see if we have time for some of the more",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2198.81,
    "end": 2223.653,
    "text": " pre-discussed questions or any other questions popping up okay so two questions on computational resources Indian goat wrote can you scale to large data sets and Jeff Beck wrote I would have thought that memory costs would have been the critical bottleneck for scaling care to comment and so to that I'll just sort of also add a little bit of my own computational resourcing just",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2223.633,
    "end": 2237.659,
    "text": " how do you find that storage memory and cpu cost scale is it possible to do static analysis how do you find that resourcing scales in comparison with alternative methods",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2240.727,
    "end": 2265.098,
    "text": " yeah i can start then maybe you can enroll a bit on this vqva for example how can we scale further but the when we talk about scaling and we can look at it from two perspectives the first is the amount of variables we have in the model right so i have a million of variables but all of them would say univariate variables",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2265.28,
    "end": 2269.706,
    "text": " So for this kind of scaling, Ericsson-Ferr already does a pretty good job.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2270.267,
    "end": 2278.738,
    "text": "So because we use factor graphs, and if you have a sparse connectivity, it's only limited indeed by memory in your computer.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2279.819,
    "end": 2290.714,
    "text": "And personally, I run inference for two million univariate variables, and it has been done under like five minutes or so to the state space model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2290.694,
    "end": 2309.631,
    "text": " so it was it was pretty easy but another aspect of scalability is indeed the the dimension of each individual variable so for example all the the multivariate and this is indeed this is still a hard problem so if if you have a very large state vector",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2309.611,
    "end": 2321.882,
    "text": " then indeed we need to propagate their covariances if they're gaussian and this might be tough for which uh now we prefer to use uh the qva",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2322.065,
    "end": 2325.688,
    "text": " Basically, we compress the state into a smaller dimensional state.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2325.708,
    "end": 2327.47,
    "text": "Albert can talk a little bit more about that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2329.531,
    "end": 2340.481,
    "text": "Or, for example, we use techniques similar to mean field, that when you approximate the covariance matrix with a diagonal matrix, it also reduces the memory requirements.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2342.242,
    "end": 2346.606,
    "text": "There are many, many, many, many techniques that we can use.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2346.806,
    "end": 2351.11,
    "text": "The thing is that Ericsson-Ferr doesn't really choose it for you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2351.09,
    "end": 2364.812,
    "text": " It's more like a playground for a user for now, where they can choose different approximation methods or different techniques, but RxInfer doesn't restrict you here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2365.013,
    "end": 2376.912,
    "text": "You can even try your own approximation techniques, but that would require you to write your own message passing rules, which again, we noticed that many users",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2376.892,
    "end": 2404.418,
    "text": " they cannot do that because it's it's hard yeah it's hard and it requires a lot of knowledge on how to do that yeah just to add on on that about this uh what was the question from jeff was like about this memory cost um yeah so i'm going to answer that in in three parts sort of so the first one is to use",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2405.292,
    "end": 2429.933,
    "text": " uh sorry to say that non-bayesian techniques right so or not entirely bayesian so and that's something like actually active inference community should have been doing like earlier i think so basically what you could do to scale that what mitri said you can use uh semi-bayesian approaches like rational encoders to compress",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2430.503,
    "end": 2437.47,
    "text": " to basically cast your high-dimensional vector representation into a low-dimensional vector, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2437.53,
    "end": 2441.273,
    "text": "So that's the basic thing you can actually think of.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2441.413,
    "end": 2444.636,
    "text": "You can do it also on multiple levels.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2444.816,
    "end": 2447.038,
    "text": "It doesn't have to be only in the likelihoods, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2447.058,
    "end": 2448.52,
    "text": "You can do it in the states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2448.72,
    "end": 2459.43,
    "text": "I mean, as you move in the hierarchy of your model, you can embed these variational autoencoders one after another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2459.866,
    "end": 2480.912,
    "text": " uh that's one thing uh and another thing is the downside here is that you would require pre-training right so there isn't pre-training involved uh not cool uh sometimes sometimes it's okay so uh another way of tackling that is to actually use hierarchical model representation so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2481.348,
    "end": 2502.951,
    "text": " uh you can encode your state see in uh as a sort of hierarchical multi-scale uh model uh right so you don't have to um when you have a grid world for instance you don't have to uh yeah basically model the uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2502.931,
    "end": 2523.066,
    "text": " all these uh uh components of your grid into one state right so like you will end up uh yeah so it doesn't scale well so and we know a few frameworks that adhere to that and well i think it will not progress much but if you actually manage to uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2523.687,
    "end": 2548.429,
    "text": " have sort of multi-scale representation of of this grid world right so you can have sort of like a location in terms of uh you can break it down right so first you can have a big grid world which you can divide by four elements and then you can zoom in zoom in zoom in so basically you would have sort of this granular representation of your of your state so and this scales pretty well um and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2549.168,
    "end": 2567.734,
    "text": " Another thing is like, well, it's kind of what Bert touched upon, right, is this vision going forward is indeed like to use this reactive approach to, well, to solve this scaling once and forever, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2567.774,
    "end": 2575.665,
    "text": "So it's basically the idea here is not to spend much computational resources, just basically spend as much as you can.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2576.185,
    "end": 2578.028,
    "text": "So, but",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2578.396,
    "end": 2580.98,
    "text": " Yeah, that's something work in progress.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2582.663,
    "end": 2591.277,
    "text": "Yeah, and I know if Bert, you want to add something on top of it about this computational cost, I think you have something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2591.317,
    "end": 2594.021,
    "text": "Well, yeah, I mean, we just discussed that, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2594.041,
    "end": 2605.72,
    "text": "I mean, I think ultimately a Bayesian framework will help computational costs because you have access to how much precision you want for your computations and",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2606.155,
    "end": 2621.447,
    "text": " you know that means you can stop early you can the the nice thing about the message passing process is reactive message passing is that it you can interrupt it at any time and take the result as it is and if you wait longer you get more accurate result but if you stop early",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2622.119,
    "end": 2625.424,
    "text": " then you have a less accurate result, but that may be okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2626.967,
    "end": 2631.474,
    "text": "In Bayesian framework, you have access to how accurately you want to compute.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2631.514,
    "end": 2639.067,
    "text": "At the higher levels in these hierarchical models, you don't need a lot of accuracy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2639.468,
    "end": 2645.457,
    "text": "If I want to park my car, I'm not going to worry about the centimeters of where I actually park.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2645.477,
    "end": 2648.262,
    "text": "I just want to find a parking spot.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2648.242,
    "end": 2652.269,
    "text": " I'm talking about tens, twenties of meters, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2654.813,
    "end": 2660.783,
    "text": "So it's partly in the architecture and it's partly of doing a smart inference in the end.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2661.625,
    "end": 2661.905,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2661.925,
    "end": 2663.848,
    "text": "And two more things here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2663.908,
    "end": 2665.491,
    "text": "I just realized that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2666.129,
    "end": 2695.798,
    "text": " well you it's so i've mentioned that yeah you can use non-basin approaches to train your uh say variation autoencoder but actually now there are like ways of training your uh neural networks in online manner also so it's it's uh not inherently like prohibitive like to actually uh do learning and inference and in the goal there uh yeah there are some developments in in in that part of uh of that world as well and i think",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2696.487,
    "end": 2718.208,
    "text": " uh the last piece here is that hardware for bayesian inference is also emerging so it's uh it's something that people are also working on uh it's it's not at mass scale yet but there will be hardware breakthroughs i think that would be specifically targeting this applications for of bayesian inference",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2722.542,
    "end": 2729.311,
    "text": " If there are no other comments or questions just now, I would like to follow up on this issue of hierarchical modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2729.751,
    "end": 2740.104,
    "text": "Maybe we've exhausted it just now, but it appears to me, as it does to many people, that this issue of hierarchy is going to be very important for just active inference going forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2741.726,
    "end": 2745.852,
    "text": "This is very much how biological organisms are arranged.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2745.872,
    "end": 2752.38,
    "text": "They have characteristic units that deal with their own time scales, and they're connected to some other level above and level below.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2752.36,
    "end": 2767.084,
    "text": " I know that in RxInfo you can create bonafide sub-models within other at-model blocks and so on, but I'm interested in the sort of landscape of hierarchical modeling for RxInfo in particular.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2767.104,
    "end": 2774.115,
    "text": "Are there things that you guys would like to highlight or emphasize in that regard for users like me?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2774.618,
    "end": 2787.621,
    "text": " I think, Dmitry, maybe you can just tease a bit about this idea of multi-scale or hierarchical models are available right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2787.721,
    "end": 2796.998,
    "text": "But what's not available out of the box is basically, as you said, different updating schemes for different levels.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2797.754,
    "end": 2801.118,
    "text": " So that's something Mitri can elaborate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2801.158,
    "end": 2808.686,
    "text": "That's what I mentioned about rewriting the core of Ericsson's theorem to also support this feature more naturally.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2808.706,
    "end": 2824.504,
    "text": "So I can imagine indeed that we have a really huge model with big hierarchies, but we don't really want to update deep hierarchy as often as we update, for example, the layer that is connected directly to our observations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2824.484,
    "end": 2845.868,
    "text": " uh because yeah as bert mentioned for certain tasks we we don't really need a lot of accuracy so we can we can sacrifice it there and do less accurate predictions but in the current implementation it's a bit hard to do it's like it requires a lot of hacks so we we tried it once it it",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2845.848,
    "end": 2850.495,
    "text": " In principle, it's possible to do, but it's user unfriendly.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2851.156,
    "end": 2866.978,
    "text": "So that's also one of the directions that we want to improve when you're writing Ericsson for tools to better support hierarchical models, to make it easier to initialize hierarchical model, to make it easier to support different update rates for different hierarchies.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2869.793,
    "end": 2870.234,
    "text": " Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2871.075,
    "end": 2873.378,
    "text": "I'll ask a few more questions in the chat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2874.059,
    "end": 2881.128,
    "text": "So Michael Lennon asks, the difficulty of implementation is a great provocation point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2882.97,
    "end": 2890.24,
    "text": "What have been use cases where you have seen some of the greatest benefits from your approach and what have been your most surprising findings?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2893.184,
    "end": 2893.804,
    "text": "Great question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2893.865,
    "end": 2895.767,
    "text": "I think...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2896.743,
    "end": 2923.729,
    "text": " if what what what are the grades i look so i think technically if you just go to um what was most surprising i think it's just the fact that uh you use the same technique same inference uh approach same back same back end to tackle all sorts of different problems like here there's many problems on control of course but like it goes way be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2923.996,
    "end": 2953.328,
    "text": " beyond that right so there are like some more classical examples on uh outer latent autoregressive models uh gaussian processes uh sensor fusion hand and missing data so i think the benefit of our approach in particular like first of all is that it it works close to real time and certain applications is definitely real time not everywhere uh but uh yeah i think just the uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2954.219,
    "end": 2979.872,
    "text": " like the the fact that it's so versatile in terms of different domains uh while uh kind of connecting all of them under the same uh umbrella principle right so that's that's i think uh the most powerful finding um of uh arix infer in particular uh yeah so it's also um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2980.73,
    "end": 2989.814,
    "text": " a reason why just generally this approach is not super popular, I think, in engineering communities, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2989.874,
    "end": 2996.832,
    "text": "Inference is not a big name in engineering communities because as engineers, and we are an engineering group,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2996.812,
    "end": 3020.153,
    "text": " we are used to start with a problem and then you go to the literature you find 10 possible solutions and you pick one and you change it a bit and now you have 11 solutions approaches this is entirely the other way around for every whatever the problem is we have the same approach we build a model we do inference it's one solution approach to",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3020.133,
    "end": 3022.698,
    "text": " any model, any problem, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3023.118,
    "end": 3027.927,
    "text": "So it's completely the opposite way of thinking of problem solving for an engineer.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3027.947,
    "end": 3029.53,
    "text": "And it's very hard.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3029.59,
    "end": 3032.235,
    "text": "I noticed it with the students in my class.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3032.295,
    "end": 3039.728,
    "text": "It's very hard to make that switch from one problem has lots of possible solutions to",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3040.282,
    "end": 3044.227,
    "text": " We have one solution method for all the problems.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3045.248,
    "end": 3051.496,
    "text": "That's very hard, but it works.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3051.616,
    "end": 3062.83,
    "text": "I think this is the right way, but it's going to be difficult to make that switch in engineering communities.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3064.143,
    "end": 3086.792,
    "text": " awesome just again to footnote and include some of these great questions and and welcome people into this continuing conversation and open source development so a few more okay urban avsec wrote does rx infer and if so to what extent support structure and parameter learning to train and improve models automatically",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3089.658,
    "end": 3092.645,
    "text": " Okay, so yeah, that's a good question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3093.607,
    "end": 3096.694,
    "text": "I wouldn't say that there is an automatic way of doing that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3097.456,
    "end": 3100.442,
    "text": "There are, I think, examples on structured learning to some extent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3100.543,
    "end": 3102.908,
    "text": "And look, so one thing is that people",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3103.377,
    "end": 3132.743,
    "text": " uh so sometimes people mean different things by referring to structural learning if we're talking about uh finding this kind of so sort of this discrete program search to automatically discover what is the right graph for your particular problem uh it's i think there's a lot of ongoing research uh it's not set in stone how to do it uh and uh i think we have good uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3132.993,
    "end": 3143.205,
    "text": " wouldn't say intuition, we have good understanding on how to prune the models based on this, well, essentially, Bayesian model evidence approaches.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3143.785,
    "end": 3149.512,
    "text": "So you can definitely use that within ARIX Infer, but how do you extend the model, how you grow sort of your graph?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3149.592,
    "end": 3152.235,
    "text": "I think this is still an open question and an interesting one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3153.296,
    "end": 3154.798,
    "text": "And",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3155.251,
    "end": 3183.081,
    "text": " as for another way of looking at actually structured learning right or you can think of non-parametric methods including gaussian processes for instance and those are also going to be integrated in rickson fur i think yeah hopefully this year but the idea is that yeah you can just basically discover uh this distribution over your uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3183.061,
    "end": 3209.018,
    "text": " over the functions uh that drive you that explain the dynamics of the environment so uh there's we are certainly working on that from different angles and there is also bias lab that birth is leading that uh also tackles some of these issues uh as for parameter learning yeah i think this is sort of uh i wouldn't say solved right not not nothing is like 100 solved but i think that's something we are uh good at there is no problem with uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3209.42,
    "end": 3212.583,
    "text": " parameter learning and, as I said, pruning that's available.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3212.884,
    "end": 3212.984,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3213.444,
    "end": 3213.745,
    "text": "Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3213.985,
    "end": 3214.385,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3214.405,
    "end": 3217.629,
    "text": "And batch and streaming inference for parameter learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3218.209,
    "end": 3218.99,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3219.01,
    "end": 3221.673,
    "text": "Andrew Pashaya wrote, thank you for the updates.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3222.054,
    "end": 3227.399,
    "text": "How are you currently handling multi-agent agent environment loops iteratively, e.g.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3227.459,
    "end": 3236.389,
    "text": "creating N agents at the top of the script and using loops or functions for creating and storing them as opposed to hard coding each individual agents?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3236.369,
    "end": 3244.438,
    "text": " So what kind of design patterns have you been working with or do you think are relevant for multi-agent situations?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3246.34,
    "end": 3249.383,
    "text": "Yeah, thanks for the question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3249.583,
    "end": 3254.789,
    "text": "Multi-agent is, of course, the pinnacle for all these inference problems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3255.029,
    "end": 3260.795,
    "text": "I think one way is to hack it through your loop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3261.456,
    "end": 3263.338,
    "text": "Another way is...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3264.23,
    "end": 3293.865,
    "text": " actually like what you what you see here in this multi-agent path planning is that it's a sort of a super agent so there's this kind of this sort of a meta agent that encapsulates the models of all other agents and then they share this information now the problem is that it doesn't scale well i would say because well like four agents five agents ten agents fine but then like uh you you you you get right you get it so i think",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3293.947,
    "end": 3322.35,
    "text": " uh one of the ways i mean dmitry probably can can also add upon that but uh what you could do like as for the design pattern is uh you run your agent uh for instance like speaking of this path planning so you run your agent into the you let it go into your environment and you only interact when you are in the proximity of other agents so there is not",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3322.583,
    "end": 3348.49,
    "text": " need to share any information if you are far away from each other and like once you are getting closer you can start sharing the information you can sort of uh fuse the models figure out the conflict and then just like depart so that's that's one of the things uh I can suggest but uh Andrew's question there is no uh we we didn't think of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3349.043,
    "end": 3373.178,
    "text": " how we didn't let me put it this way we didn't standardize the api ball for multi-agents so not yet all right great and one more question from live chat jeff beck wrote my question is can the parameters of the flows and the vaes be learned in rx infer or are they imported if it is learned is that by traditional gradient descent",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3374.896,
    "end": 3379.6,
    "text": " Well, I think this is, if Ismail is still here, I think he can elaborate on that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3379.7,
    "end": 3384.224,
    "text": "But you can... Yeah, maybe I can talk a bit on that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3385.766,
    "end": 3398.317,
    "text": "So it's possible to update rates or biases of the neural network that is parametrizing your VAE or your flow within RxInfer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3399.138,
    "end": 3403.722,
    "text": "However, if you want to use deep and wide networks,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3404.107,
    "end": 3410.751,
    "text": " then you need the GPU architecture that Dimitri was referring to.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3410.791,
    "end": 3413.762,
    "text": "So for small",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3414.907,
    "end": 3418.032,
    "text": " size neural networks really easy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3418.873,
    "end": 3435.7,
    "text": "You can use RxInfer to tune the weights, but for larger scales in its current weight strain outside of the model and then use these parameters for prediction purposes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3438.785,
    "end": 3448.558,
    "text": " But it is certainly possible to incorporate the training of neural networks within the model macros.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3451.238,
    "end": 3473.162,
    "text": " awesome okay in sort of our closing round here one of the pre-written questions was what are the upcoming milestones of lazy dynamics and what is your vision so just on that though or however else you want to give some last thoughts uh if each of the developers would just want to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3474.07,
    "end": 3474.952,
    "text": " Give any last thoughts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3475.012,
    "end": 3476.676,
    "text": "What are they looking forward to this year?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3476.736,
    "end": 3483.271,
    "text": "Where might we be by the midpoint of the year, by whatever milestone or timeline you want to point to?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3483.291,
    "end": 3485.677,
    "text": "And that'll be a great closing round.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3486.218,
    "end": 3489.666,
    "text": "So how about Albert and then continuing on with the developers?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3550.177,
    "end": 3556.444,
    "text": " bring this approach in particular to enterprise use.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3556.464,
    "end": 3558.807,
    "text": "So we see a lot of opportunities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3559.468,
    "end": 3561.71,
    "text": "I'm sorry, I made just an audio mistake.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3561.75,
    "end": 3563.412,
    "text": "So people might have lost audio for a few seconds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3563.432,
    "end": 3564.994,
    "text": "Could you just start again?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3566.676,
    "end": 3567.116,
    "text": "Start again?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3567.336,
    "end": 3567.997,
    "text": "Yes, sorry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3568.157,
    "end": 3569.679,
    "text": "From where?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3569.699,
    "end": 3570.12,
    "text": "All over.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3571.261,
    "end": 3572.202,
    "text": "Yeah, sorry about that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3573.211,
    "end": 3601.176,
    "text": " yeah so uh two two things then uh like first very first thing is that i i definitely want to invite uh so lazy dynamics is going to support the uh open source development of rx infer so that's our priority on the development side uh we're actually going to we're planning to run a sort of not a hackathon but the uh development uh event um co-development event",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3601.763,
    "end": 3630.758,
    "text": " uh probably this summer uh and uh yeah so i just want to invite more developers to help and testers to help with um agent development uh to help with demos uh even though you are not uh into iris and furry uh sorry active inference yet right so you're everyone is welcome and um one more thing for us i think for this year from the development perspective is of course to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3631.632,
    "end": 3652.915,
    "text": " uh bring uh to to put rx defer to the state where it becomes easier to contribute easier to contribute for uh to the sort of to the engine not just on the kind of this demo side but also to improve the engine to make it faster more scalable so that's something we are uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3653.789,
    "end": 3658.322,
    "text": " yeah, looking for, and I want everyone to, uh, invite, uh, to that venture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3658.903,
    "end": 3668.49,
    "text": "Um, and then I think from laser dynamics perspective, uh, specifically, yeah, we're, uh, inviting the partners and like forward thinking, uh, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3669.5,
    "end": 3685.563,
    "text": " people, individuals, right, who just want to connect and want to join us in this adventure of building this, well, very scalable Bayesian inference solutions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3686.364,
    "end": 3695.377,
    "text": "I think there's a lot of opportunities and possibilities for education and enterprise and yeah, you name it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3695.958,
    "end": 3699.203,
    "text": "So yeah, that's some closing words from me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3702.811,
    "end": 3716.605,
    "text": " Okay, so from the research side, I think a big issue for active inference is the computation of expected free energy and computation of policies, but minimizing expected free energy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3716.685,
    "end": 3720.83,
    "text": "And I think we're making some nice progress there.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3720.85,
    "end": 3732.582,
    "text": "And I think we will also release that this year somewhere at a conference and in the package on how to do this with RxInfer in an efficient way, of course.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3735.903,
    "end": 3745.559,
    "text": " From the development side, of course, as has been mentioned already, we are releasing a Rixenfer server for now for everyone to use, to play.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3745.579,
    "end": 3751.69,
    "text": "And as soon as it's finished, it's never finished, but of course, improve it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3751.71,
    "end": 3759.042,
    "text": "But as soon as it has some stable form, we will rewrite the core of our Rixenfer.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3759.022,
    "end": 3772.999,
    "text": " And then we also have other pending topics like integrating Gaussian processes very easily, making it very easy to use mixture models, making it easy to introduce hierarchies in the model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3773.4,
    "end": 3775.843,
    "text": "So yes, we have a lot of plans for the development.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3776.243,
    "end": 3782.01,
    "text": "We also have plans to improve the visualizations since Fraser helped a lot with that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3782.511,
    "end": 3785.755,
    "text": "And we have plans to improve that even further.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3790.578,
    "end": 3793.481,
    "text": " I think all the improvements and milestones were already mentioned.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3794.582,
    "end": 3796.564,
    "text": "So I'm not going to add more to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3796.664,
    "end": 3799.627,
    "text": "I think we already have quite a big list.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3799.647,
    "end": 3801.93,
    "text": "Nonetheless, there are a lot of surprises coming up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3802.01,
    "end": 3803.932,
    "text": "So definitely stay tuned.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3804.633,
    "end": 3807.416,
    "text": "I think we already gave a good impression of what direction we'll be working towards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3807.936,
    "end": 3810.839,
    "text": "But along the way, there will always be more cool stuff coming.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3810.919,
    "end": 3812.661,
    "text": "So definitely follow us everywhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3812.981,
    "end": 3819.268,
    "text": "And I think that already gives a good impression of what we'll be up to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3821.375,
    "end": 3841.172,
    "text": " Yeah, it's hard to add on top of what Albert Barth and all the team said, but as a personal interest, I'm very interested in stochastic differential equations and continuous time systems.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3841.152,
    "end": 3862.755,
    "text": " how we numerically approximate these systems identify their parameters and so on and this is a one of the research that we are doing also at rx and how we can integrate them so that's a big research plan for myself",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3862.735,
    "end": 3882.988,
    "text": " and yeah it's too much on the plate and we could enjoy contribution from everyone to this big plate of ideas pressure where does that take you",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3884.555,
    "end": 3896.298,
    "text": " I just want to say I'm extraordinarily excited about continuing to contribute with you guys and develop the package further, maybe even help with some forays into the refactor of the package.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3896.318,
    "end": 3898.301,
    "text": "I know that can be intimidating, but so we'll see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3899.063,
    "end": 3902.089,
    "text": "So yeah, I look forward to working with you guys in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3902.289,
    "end": 3902.89,
    "text": "I look forward to it all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3902.93,
    "end": 3903.211,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3904.513,
    "end": 3905.415,
    "text": "Thanks, Faisal.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3905.767,
    "end": 3906.268,
    "text": " Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3907.01,
    "end": 3915.973,
    "text": "Thank you again for joining and just another chapter in the journey and in the learning and in the application of Active Inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3916.394,
    "end": 3918.098,
    "text": "So, until next time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3919.301,
    "end": 3919.662,
    "text": "Thank you all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3919.722,
    "end": 3920.284,
    "text": "Thanks, Daniel.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3920.404,
    "end": 3920.845,
    "text": "Thanks all.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3921.066,
    "end": 3921.467,
    "text": "Bye-bye.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3921.487,
    "end": 3922.609,
    "text": "Okay, bye.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3922.63,
    "end": 3922.83,
    "text": "Bye-bye.",
    "speaker": "SPEAKER_03"
  }
]