[
  {
    "start": 2.157,
    "end": 25.127,
    "text": " all right welcome back welcome back to cohort six couple quick updates as we mentioned with octopus and others there are math discussion sessions they're tuesdays at 12 utc octopus session videos has the links to the videos",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 26.474,
    "end": 53.46,
    "text": " so feel free um these should be awesome freewheeling and super epistemic sessions and as with the material on the book itself all kinds of questions from the most background and basic and confirmatory for one on through the most speculative and and farsighted for for others",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 53.812,
    "end": 56.575,
    "text": " It's always a contribution to write it down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 56.616,
    "end": 66.208,
    "text": "And as the math comes into play and the meta math and the math art, it's going to be a great journey together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 68.811,
    "end": 77.642,
    "text": "Today, we're in our second pass on chapter six, which is the recipe for active inference modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 77.723,
    "end": 87.782,
    "text": " And also a new or different feature in this interval of activity compared to previous weeks is the third week rhythm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 88.784,
    "end": 96.88,
    "text": "So in the third week for cohort six, going through the second half of the book, we'll",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 97.062,
    "end": 99.504,
    "text": " really focus on applying active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 100.425,
    "end": 109.493,
    "text": "Andrew has written a tutorial utilizing PyMDP with a focus on agent-based modeling for the social sciences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 110.173,
    "end": 111.254,
    "text": "So that should be pretty cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 112.035,
    "end": 120.902,
    "text": "And additionally, as Rx and Fur development continues, we'll be learning more and more about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 121.963,
    "end": 126.647,
    "text": "In cohort seven, we haven't quite determined what the third week activity will be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 126.745,
    "end": 154.896,
    "text": " in that uh slot so we'll find out uh discuss later today with that cohort and and see what's useful in the third week for now though let's uh jump over to chapter six we can start with any section of six any idea or page or figure in chapter six that anybody wants to bring up",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 156.698,
    "end": 175.433,
    "text": " we could look at any of the prior questions and also as chapter six is about applying and designing active inference models it can be any question that someone has so just raise your hand or write it in the chat or unmute and go for it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 188.086,
    "end": 194.623,
    "text": " I'll just give one brief catch up to get us to six, to get us there in just a minute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 195.024,
    "end": 197.691,
    "text": "And then again, just type a question or raise your hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 198.683,
    "end": 204.352,
    "text": " So part one of the book, they outline as kind of the epistemic and the background and learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 204.672,
    "end": 210.701,
    "text": "Part two is heading kind of home stretch, heading downhill, heading back home into the applying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 211.523,
    "end": 214.587,
    "text": "Chapter one and chapter 10 are like bookends.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 215.489,
    "end": 216.751,
    "text": "They're very similar chapters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 216.911,
    "end": 226.125,
    "text": "Chapter 10 is a bit more broad ranging and longer, whereas chapter one introduces the ideas, whereas they're similar because they provide perspectives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 227.084,
    "end": 234.372,
    "text": " In chapter one, this concept of the low road and the high road is introduced, and that's revisited in more detail in chapters two and three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 235.193,
    "end": 237.596,
    "text": "Low road is like the how and the what.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 237.957,
    "end": 239.799,
    "text": "It's the actual architectures that are built.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 240.179,
    "end": 246.046,
    "text": "It's the way that Bayes' theorem applies to perception and cognition and action in a unified cognitive model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 246.607,
    "end": 255.437,
    "text": "And then the high road comes from the free energy principle, physics of cognitive systems, Bayesian mechanics, the imperative to persist, to remeasure, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 256.632,
    "end": 280.513,
    "text": " chapter two and three get us to active inference and chapter four is where we actually see the active inference generative model itself which is what's going to be given the recipe for in chapter six chapter four goes through the generative model describes some of its analytical properties and it introduces us to the idea that there's a discrete time and a continuous time form",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 281.303,
    "end": 298.35,
    "text": " chapter five message passing in neurobiology gives a quick review of one of the systems of interest that has received the most study to date in terms of active inference modeling which is like mammalian and human neuroanatomy that's part one of the book",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 299.512,
    "end": 303.039,
    "text": " Part two of the book goes into applying active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 303.76,
    "end": 311.255,
    "text": "Chapter six is very provocative and fun, and it's a recipe for designing active inference models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 312.137,
    "end": 318.55,
    "text": "And as we'll, I hope, unpack a little bit today, it doesn't require some",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 318.952,
    "end": 342.445,
    "text": " advanced level of programming or anything like that to get going and actually with augmented coding with templates and some other tools there's a lot that can be done just through a conversation with a domain expertise or familiarity in the active inference ontology chapter seven and eight that are going to focus on some of the features and examples of discrete time continuous time models",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 342.712,
    "end": 372.432,
    "text": " chapter nine introduces data into the picture how do empirical data relate to generative models and then again chapter 10 is a summary so that's the textbook it's it's a long pull and then when we kind of pull back to this level of course screening it looks really short too so what's a section or a question on six that that anybody would like to go to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 409.334,
    "end": 409.714,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 412.717,
    "end": 417.302,
    "text": "We'll just go to the questions that have been sorted by the thumbs up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 418.984,
    "end": 427.552,
    "text": "You can click on the symbol to follow wherever a person is in CODA, and I'm putting it in the chat as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 428.333,
    "end": 437.082,
    "text": "So if you want to, you can hit thumbs up for the questions that are interesting, or again, just like type it or raise your hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 437.102,
    "end": 437.282,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 440.502,
    "end": 446.506,
    "text": " First question, what are the four steps in the recipe to construct an active inference model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 447.449,
    "end": 449.618,
    "text": "Does anyone want to give a thought on this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 470.725,
    "end": 479.605,
    "text": " How are these steps similar or different to any other kind of systems modeling or analysis technique that people have seen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 559.37,
    "end": 562.074,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 562.114,
    "end": 562.354,
    "text": "John.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 570.605,
    "end": 574.73,
    "text": "Okay, let's look at figure 6.1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 577.714,
    "end": 578.595,
    "text": "John, go for it if you want to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 579.136,
    "end": 580.057,
    "text": "Yeah, yeah, sorry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 580.077,
    "end": 581.419,
    "text": "I had to set up properly there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 582.76,
    "end": 587.166,
    "text": "I'm dealing with something at work right now, so I'm going to be in and out on this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 587.77,
    "end": 610.295,
    "text": " But a question I've kind of had come up, and maybe this is just from not seeing too many active inference agents implemented yet, is sort of how do you fit expected free energy in with free energy minimization?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 611.657,
    "end": 614.52,
    "text": "Like for the current state,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 615.007,
    "end": 616.288,
    "text": " versus looking into the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 616.749,
    "end": 621.293,
    "text": "It's not something I saw detailed a ton in chapter six.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 623.716,
    "end": 640.232,
    "text": "But yeah, and I guess answering the question you posed, I think that like looking at our allies, we don't have, you know, reward based policies, but we just focus on minimization for energy, expected for energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 642.934,
    "end": 643.495,
    "text": "But yeah, like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 644.825,
    "end": 652.492,
    "text": " It's a little unclear to me how those two interplay, what their interplay is in implementation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 653.794,
    "end": 654.835,
    "text": "Great question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 655.275,
    "end": 658.558,
    "text": "Yeah, it's going to touch on a lot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 658.578,
    "end": 668.188,
    "text": "So if anybody wants to add in or go in deeper into some of this, please just write it or raise your hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 669.249,
    "end": 671.971,
    "text": "Otherwise, let's get there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 672.312,
    "end": 673.633,
    "text": "So the question is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 673.816,
    "end": 676.5,
    "text": " How do we think about free energy minimization?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 677.121,
    "end": 686.296,
    "text": "So the real-time free energy minimization with equation 2.5 and the prospective expected free energy minimization in equation 2.6.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 686.316,
    "end": 693.127,
    "text": "So how do those pieces come together in an active inference generative model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 693.147,
    "end": 694.91,
    "text": "Okay, let's start with figure 6.1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 696.412,
    "end": 699.317,
    "text": "This is called the particular partition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 699.719,
    "end": 700.28,
    "text": " It's a pun.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 701.143,
    "end": 703.709,
    "text": "Particular means like that specific one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 704.652,
    "end": 707.539,
    "text": "Also, particular means related to a particle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 708.562,
    "end": 712.311,
    "text": "And the agent or the cognitive particle",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 712.527,
    "end": 735.565,
    "text": " is consisting of the internal states and the blanket states so everything to the exclusion of the external states is called the particle blanket plus internal equals particle so it's like the brain and the skin so to speak that's figure separated from ground that's the agent separated from the niche",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 735.815,
    "end": 763.206,
    "text": " that's called the particular partition and the free energy principle makes this kind of axiomatic starting point that we're going to partition systems according to a blank and the the two directions there so this is kind of the the partition on what we're looking at okay now how is free energy minimized in in real time and where does planning and prospection come into this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 763.878,
    "end": 784.317,
    "text": " have some external state let's say it's the actual temperature of the room sensory states coming in that's like thermometer readings internal states like internal representations of temperature and then action states which might be like to modify the air conditioner that's kind of the setup of the model david",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 785.528,
    "end": 813.207,
    "text": " uh yeah I was just wondering how uh discrete time would play in the um exchange between the different states in terms of being able to model fit for example yeah great question um the way it comes into play in discrete time we think about each of these nodes having like a number and then there's a discrete tick of the model and like all the numbers update in a tick",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 813.946,
    "end": 842.62,
    "text": " in continuous time these four states are thought of as being like four simultaneous flows so it's like the difference between like four discreetly updating synchronized changes and like four analog control knobs that are kind of always giving a value and then they can change independently okay so now let's look at the recipe then we'll get to equation 2.5 and 2.6",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 844.237,
    "end": 863.443,
    "text": " the recipe first we identify the system that we're modeling this is the cognitive particle that's that's or it's really the cognitive particle plus niche it's the total setting and then question three is basically how are we going to set up the particle",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 863.592,
    "end": 865.795,
    "text": " in terms of the blanket and the internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 865.975,
    "end": 870.842,
    "text": "And question four is, how are we going to set up the generative process in terms of the niche?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 871.503,
    "end": 881.898,
    "text": "So these four questions basically just get us to the point of specifying the agent, including blanket, and the niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 883.6,
    "end": 883.7,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 883.72,
    "end": 892.232,
    "text": "So how does framing things in that way relate to the real-time inference and to prospection?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 904.109,
    "end": 932.952,
    "text": " part of the answer is that it depends a lot on the system that we're discussing so it's kind of sometimes frustratingly general in general but it's because it depends so much on the system that we're modeling so here we see a slightly different representation of the particular partition also of course slightly different notation Etc and this is like a continuum from simpler systems on through systems that have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 933.607,
    "end": 936.091,
    "text": " introspection or it can have planning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 936.752,
    "end": 940.217,
    "text": "But the overall scheme is very similar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 940.878,
    "end": 941.098,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 941.118,
    "end": 944.723,
    "text": "So John asked, where does expected free energy fit in?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 945.324,
    "end": 947.067,
    "text": "Let's look at the equations for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 947.287,
    "end": 951.413,
    "text": "And then we can look at the PI MDP documentation to see what it looks like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 962.345,
    "end": 984.572,
    "text": " equation 2.5 is the variational free energy variational free energy it's a functional so it's a function that takes in a function and what it takes in is Q a belief distribution and Y a new observation data coming in so this is like the agent's belief",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 985.244,
    "end": 1011.1,
    "text": " about temperature distribution that could be a super tight distribution very loose distribution and then Y is a data point and here are three equivalent ways to frame this or to decompose the same quantity the top uh line is using a physics-based ontology of energy minus entropy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1012.497,
    "end": 1023.372,
    "text": " The middle is using a statistical ontology of complexity minus accuracy, which is to say we want to reward models for fitting well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1024.113,
    "end": 1027.398,
    "text": "However, we want to penalize them for having more parameters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1028.079,
    "end": 1034.067,
    "text": "That's also known as the IKIKI information criterion or the Bayes information criterion, basically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1034.047,
    "end": 1063.918,
    "text": " in that adding more parameters will always fit the data better so the imperative can't simply be fit the data better otherwise you take that to the end of the road and you just have this massively overfit model so the question is how do you penalize a model for its growth while rewarding it for fitting well and that's the kind of accuracy minus complexity uh trade-off frontier and then there's a divergence in evidence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1063.898,
    "end": 1091.998,
    "text": " representation these are not look-aheads this just relates to beliefs at a time point and an incoming data point that's because variational free energy is attractable optimizable bound on surprisal surprisal itself is often difficult to compute because it it can be a large computation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1092.097,
    "end": 1095.642,
    "text": " However, variational free energy is this tractable bound.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1096.202,
    "end": 1099.407,
    "text": "This is not introduced or invented by octave inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1100.188,
    "end": 1106.616,
    "text": "Variational autoencoders, any kind of variational inference uses the exact same approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1108.439,
    "end": 1113.345,
    "text": "It's known as the evidence lower bound or the variational lower bound.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1114.388,
    "end": 1123.319,
    "text": " So if you can't necessarily fit the likelihood directly to maximize evidence, which is minimizing surprise, there's this tractable bound.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1124.14,
    "end": 1142.202,
    "text": "So this is not something that is being introduced by the active inference literature, but rather variational methods, variational approximations are being applied to the whole iguana, to a unified model of perception, cognition, and action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1144.223,
    "end": 1172.813,
    "text": " but equation 2.5 doesn't have any planet it's just about beliefs at a given moment and then what is the sort of base optimal move given this new observation David go for it oh yeah I was just wondering if the uh part of the entropy formula that was related to uh Heisenberg does anyone have a thought on that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1177.467,
    "end": 1182.892,
    "text": " You mean the... I'm wondering, I don't understand the question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1182.912,
    "end": 1183.233,
    "text": "Sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1184.514,
    "end": 1187.316,
    "text": "Yeah, did you mean like Heisenberg uncertainty or what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1187.877,
    "end": 1190.359,
    "text": "Yeah, the uncertainty principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1190.379,
    "end": 1194.623,
    "text": "So in terms of the functions itself related to Shannon Entropies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1201.37,
    "end": 1204.673,
    "text": "Yeah, let's look into it more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1206.408,
    "end": 1234.238,
    "text": " there there may be some connections yeah just it does deal with um fast warrior transform so I was just thinking in terms of um agent modeling cool yeah interesting possibility the 2022 textbook doesn't go into the Quantum uh interpretations however maybe maybe we can look more into it okay so this is great for modeling",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1235.129,
    "end": 1257.289,
    "text": " a boundable approximation yeah go for it david oh sorry oh sorry i was falling down boundable approximation for the situation of beliefs and a new data point coming in so that can apply to trivially simple systems like that have no reactivity or sentience at all or kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1257.472,
    "end": 1287.006,
    "text": " classical or conservative systems like um you know a given data point comes in and just it just makes a linear adjustment in a belief it also describes that real-time flow on more complex systems however it doesn't invoke any future time points this is just kind of like the slice of the now so when we were interested in modeling agents with planning that is when we move into the expected free energy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1287.475,
    "end": 1312.74,
    "text": " expected free energy is a cousin of variational free energy it's g it's also functional um instead of f it's like the one after f g its um argument that it takes is pi pi is the policy prior so it's a vector of all of the possible policies",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1313.024,
    "end": 1317.63,
    "text": " Affordances are actions that can be taken in a moment, up, down, left, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1318.691,
    "end": 1323.537,
    "text": "Policies are sequences of affordances for a given time horizon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1324.138,
    "end": 1328.884,
    "text": "So for a time horizon of one, the policy vector is the same as the affordances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1329.945,
    "end": 1337.935,
    "text": "For a time horizon of two, the policy vector is of the length affordances squared.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1338.016,
    "end": 1364.496,
    "text": " so on so it's like up down left right are the affordances those are the opportunities for action in the niche policies could be just one one time step if there was no planning just action selection or policies could be longer like up up down up up right um so that's about the defined time horizon for the model which we'll look at in pi mdp um after this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1365.488,
    "end": 1390.062,
    "text": " g takes in the policy prior and it's going to update it according to how well these policies score on expected free energy what gives a good score for expected free energy here we see several decompositions there's kind of like three and a half decompositions because the the second and third line are really similar",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1391.088,
    "end": 1416.319,
    "text": " first decomposition is in terms of epistemic value expected information gain and pragmatic value or utility there's a lot more to say on this just just going quickly but pragmatic value in terms of utility is the expected alignment between future observations y tilde and preferences their preferred observations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1416.856,
    "end": 1436.934,
    "text": " Whereas epistemic value is about the KL divergence between double line, beliefs about hidden states through time, Q on X tilde, conditioned upon policy either way, and observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1436.954,
    "end": 1446.222,
    "text": "So if the observations coming in are not expected to update beliefs, these two are the same and the KL divergence is zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1446.809,
    "end": 1471.18,
    "text": " information gain is zero if expected observations coming in are expected to update beliefs like I want to know what's on page 12 of the book what about the policy to look on page 12 of the book I expect those observations to give me information even if I don't know what direction the information is going to be updated in and that is assigned a high epistemic value",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1472.088,
    "end": 1482.866,
    "text": " This is a point of differentiation with reinforcement or utility based models, which is those kinds of models only have pragmatic value or utility.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1483.507,
    "end": 1492.763,
    "text": "So they need to discover these kinds of tricks and methods to give a utility to information gain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1492.861,
    "end": 1519.729,
    "text": " there's all kinds of tricks you can have heuristics like mix it up every 500 times steps or you could say give this price on information put this price on basic research whereas here they're kept separate um and there's some other representations but what's important here is whereas 2.5 was about our beliefs and then the data point coming in in a moment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1521.245,
    "end": 1548.771,
    "text": " expected free energy is arbitrarily forward looking for a given time horizon so a good example of of where this comes into play is in this um active inference epistemic training demo I'll put it in the in the chat as well and probably uh linked elsewhere um okay",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1550.033,
    "end": 1559.146,
    "text": " Well, since we're in 6 and actually looking at how these models are coming into play, let's look at this script.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1559.226,
    "end": 1562.471,
    "text": "But again, just raise your hand or type it if you have any thoughts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1563.212,
    "end": 1569.782,
    "text": "And also note, this is the PyMDP Python kind of script.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1570.282,
    "end": 1575.67,
    "text": "So RxInfer is quite different in its style, but this is what PyMDP looks like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1580.24,
    "end": 1586.73,
    "text": " First, like many other Python scripts, different packages are imported.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1586.75,
    "end": 1593.201,
    "text": "Those can be core packages or other broad packages like NumPy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1594.182,
    "end": 1599.23,
    "text": "And it also includes specific functionality from elsewhere in the PyMDP package.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1602.616,
    "end": 1607.243,
    "text": "So we can kind of read this in light of the recipe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1609.332,
    "end": 1612.517,
    "text": " So just to remind yourself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1612.537,
    "end": 1614.46,
    "text": "System of interest, like situation of interest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1615.522,
    "end": 1621.451,
    "text": "What does the agent look like in terms of its perception, cognition, internal states, and action?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1622.092,
    "end": 1624.095,
    "text": "And then what does the environment look like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1624.736,
    "end": 1628.963,
    "text": "So it's not going to be in that order in the script, but we'll see that all those boxes will get ticked.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1629.965,
    "end": 1630.906,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1630.926,
    "end": 1633.49,
    "text": "First, they set up the map.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1634.151,
    "end": 1637.196,
    "text": "So this is like declaring the generative process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1637.851,
    "end": 1660.467,
    "text": " and it's this grid world where there are certain cells that have rewards or it could be just called food and then there's some that have cues which are like signals here they use matplotlib to visualize the grid so in in this world",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1660.649,
    "end": 1690.217,
    "text": " there's two possible places where there could be food or not so it's kind of like a tea maze however the reason why it's called epistemic chaining is that there's different places where information can be found and that information reduces uncertainty about where the food is so that's the generative process they should call it grid world now we get to generative model um okay",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1694.517,
    "end": 1695.859,
    "text": " We're in discrete time here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1698.063,
    "end": 1702.65,
    "text": "Pi MDP is only in discrete time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1709.941,
    "end": 1710.883,
    "text": "Here's figure 7.1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1711.023,
    "end": 1713.467,
    "text": "So a little looking ahead to discrete time model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1714.188,
    "end": 1717.133,
    "text": "This is the core sense-making motif.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1717.213,
    "end": 1721.74,
    "text": "This is what makes something partially observable, is we have observations coming in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1722.31,
    "end": 1733.249,
    "text": " At each time point, the observations are mapped through A to hidden state S. B describes how hidden states transition through time at each time step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1734.33,
    "end": 1737.396,
    "text": "And D is the prior just to kick off the chain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1738.317,
    "end": 1747.052,
    "text": "So in the neuroimaging setting, like SPM, observations are the noisy sensors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1748.095,
    "end": 1752.88,
    "text": " And then S are these latent activity patterns in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1754.341,
    "end": 1756.844,
    "text": "That's partially observable inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1756.884,
    "end": 1758.125,
    "text": "That's like a Kalman filter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1759.246,
    "end": 1765.373,
    "text": "Active inference is going to drop in on top and add this upstairs bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1765.773,
    "end": 1768.356,
    "text": "But the downstairs is exactly the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1768.896,
    "end": 1775.723,
    "text": "That's the sense-making motif of observations kind of getting mapped into latent states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1777.39,
    "end": 1784.099,
    "text": " Where the action comes into play is when policies intervene in how things change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1784.119,
    "end": 1792.69,
    "text": "So we have observations like thermometer readings coming in at each time step, and they're getting mapped to beliefs about temperature in the room.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1793.492,
    "end": 1801.362,
    "text": "And then B is a matrix that is going to apply to the hidden state and fold it into the next time step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1802.063,
    "end": 1805.828,
    "text": "So then B has these slices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1806.095,
    "end": 1828.845,
    "text": " it's kind of like index cards and policy selection by the agent is like picking which index card is going to be applied to unroll into the next state so one of the index cards might be keeping something like just in the location setting keep something where it is no move then that would keep S the same",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1829.483,
    "end": 1837.392,
    "text": " Whereas there might be turn on the air conditioner, move left, and then those would be represented in the structure of slices of B. David.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1838.774,
    "end": 1856.554,
    "text": "Uh, yeah, I was just wondering how this works in terms of, uh, weights and values for, um, each portion, because you had mentioned, um, with activate, uh, being applied at G as a bit, would that be considered, um, adding any data weight to, uh, to the formulas?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1858.61,
    "end": 1869.312,
    "text": " okay yeah good good question so again downstairs is our like perception and sense making here upstairs is our policy selection",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1870.962,
    "end": 1880.081,
    "text": " Applying variational inference, evidence lower bound, variational free energy to the downstairs sense-making part is like a variational autoencoder.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1880.863,
    "end": 1891.705,
    "text": "The move in active inference is to say agents are described by the joint distribution of their beliefs about perception, cognition, and action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1891.853,
    "end": 1918.738,
    "text": " then we're going to take a variational free energy on all of that so that's the unified modeling angle that is um what unifies like the perception inbound signal processing problem with the outbound control theory problem so then the question is like well okay how do you this is a structural model how do you get at the weights let's see how they do it in the demo okay so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1918.988,
    "end": 1948.54,
    "text": " here they're setting up the size of frank here they're setting up the size and the dimensionality of observations which are called obs and hidden state factors which are called num states so an important thing to to note is that um this is like the schema",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1949.212,
    "end": 1953.337,
    "text": " or the sort of template motif.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1953.357,
    "end": 1963.671,
    "text": "However, let's just say that each grid cell, each cell in the grid had like a temperature, a smell, and a light variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1965.553,
    "end": 1968.857,
    "text": "There's modular choice in how that is represented.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1970.039,
    "end": 1978.51,
    "text": "You have three observations coming in, and then you could imagine like those all project onto one hidden state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1979.553,
    "end": 2008.53,
    "text": " type or you could set it up so that like there was a hidden state for each of those sensory modalities and then those were or weren't integrated so this is like map territory this is why Toby St Clair Smith calls this work compositional cognitive cartography compositional because we're playing with Legos and category Theory and we're composing models",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2009.287,
    "end": 2036.425,
    "text": " cognitive because we're talking about cognitive interfaces and things perception cognition action and then cartography because it's a science or a study of map making so this isn't to say that like if you broke open an animal you'd find this base graph it's to say that this is a map like a subway map that we're making that has all of these really tractable properties",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2036.776,
    "end": 2056.489,
    "text": " so there's a lot of places for modeler degrees of freedom and there isn't necessarily like a correct map of a cognitive system any more than there would be a correct map of of a city here they're setting up the variables just in terms of their length",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2058.325,
    "end": 2075.355,
    "text": " without going too much into Rx infer at this moment, one of the major challenges slash frustrations with PyMDP and with modeling is the dimensionality and making sure all the dimensionalities work out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2076.537,
    "end": 2083.489,
    "text": "Otherwise you get like just a bunch of matrices that get multiplied and the shapes don't work and it just kind of like gives bugs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2085.95,
    "end": 2113.071,
    "text": " next they're going to state a a maps between observations and hidden states so this is the downstairs sense making part the a matrix they make sure that its shape in terms of rows and columns is basically related to on one dimension the number of hidden states and on the other dimension the number of the type of observations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2113.135,
    "end": 2120.788,
    "text": " So you could have five mapping onto five, or you could have one mapping onto five, or you could have any combination.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2123.232,
    "end": 2130.564,
    "text": "Then they fill out all zeros just to get it going.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2132.006,
    "end": 2139.058,
    "text": "Here, there's three modalities on A. So A is a tensor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2139.275,
    "end": 2146.405,
    "text": " Each slice goes from observations to hidden states within like one frame.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2147.446,
    "end": 2157.28,
    "text": "So you can think of it like three index cards or like three sheets in an Excel file or a tensor that has three stacks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2159.223,
    "end": 2162.447,
    "text": "A0 is location.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2163.271,
    "end": 2189.16,
    "text": " a1 is q1 a2 is q2 this is zero indexing so it's kind of like the first element is the zero just like a birthday and so the numbers are being filled in and then there's this um third third modality a3 which is the observation of reward or not so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2190.693,
    "end": 2205.829,
    "text": " in how these matrices are built is where a lot of the nitty gritty happens in A. Okay, now they move to specifying B. B is the transition model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2206.39,
    "end": 2209.373,
    "text": "So this is how do those hidden states change through time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2211.335,
    "end": 2216.641,
    "text": "Again, there's the work of making sure that the sizes and the shapes of all the variables line up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2217.942,
    "end": 2218.523,
    "text": "And then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2219.498,
    "end": 2245.523,
    "text": " all of the work of like what does action do all the action representation is loaded into b and it's like when you see the model it's like there's actually not many places that that uh again in this simple form there's not many places where learning can go but it's important to see that a is action independence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2245.975,
    "end": 2248.618,
    "text": " A is the mapping from observations to hidden states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2249.139,
    "end": 2255.848,
    "text": "That can be a recognition direction, recognizing, or it can be a generating direction like synthetic data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2257.31,
    "end": 2274.953,
    "text": "All of the efficacy of pi, all of the efficacy and the differences that make a difference with policy selection influence how things change through B. So here's where we see the actions having an impact",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2275.338,
    "end": 2302.965,
    "text": " in terms of different b slices that can get pulled out in the b0 which is um location just like a0 was location we have we have efficacy of actions actions should change our location however there's no action that the mouse can take to change the cues",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2303.35,
    "end": 2315.95,
    "text": " And so here, the B variables in that first and second modality are called uncontrollable because there's no policy that makes a difference for those modalities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2318.855,
    "end": 2320.377,
    "text": "Preferences are specified.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2322.04,
    "end": 2327.248,
    "text": "We can talk about preferences, but they play the role in control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2327.6,
    "end": 2355.936,
    "text": " contributing to pragmatic value calculations if you don't have any uh preference or you have a flat preference like outcomes are equally desirable then epistemic value or learning or novelty comes to dominate the behavior whereas conversely if you have hyper precise priors there's no epistemic opportunities and strong preferences you get the special case of utility maximization",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2357.317,
    "end": 2360.561,
    "text": " then the prior over D is specified.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2361.202,
    "end": 2367.931,
    "text": "So that was A, B, C, D and E. It was just framed in terms of the actions, basically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2370.335,
    "end": 2371.656,
    "text": "Any thoughts on this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2378.205,
    "end": 2378.306,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2378.326,
    "end": 2383.813,
    "text": "Just like in the recipe, they then turn to the rules of the game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2386.51,
    "end": 2412.535,
    "text": " drawing inspiration from machine learning and reinforcement learning all this they use an env for environment class which steps in discrete time one by one so we defined the agent in terms of a b c d and then they write this grid world environment example which is kind of like um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2413.51,
    "end": 2419.136,
    "text": " We can look in more detail, but this actually is the consequences of action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2419.757,
    "end": 2427.665,
    "text": "Whereas before, when we were defining the agent, this is its beliefs about action, what that will do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2428.406,
    "end": 2432.791,
    "text": "And then here are the actual consequences of choosing actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2433.471,
    "end": 2440.699,
    "text": "So this begets a question like, well, how does the agent come to know",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2440.814,
    "end": 2468.07,
    "text": " the structure the consequences of its action that's like not addressed in this notebook but like it's like playing a video game and then like you're um you were used to having up on the joystick move you forward but then now you're in a inverted mode where it moves you backwards so just because the agent is specified to have a given beliefs like oh if I hit this button the room will get colder",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2468.135,
    "end": 2472.32,
    "text": " But that's not necessarily a veridical belief.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2472.34,
    "end": 2474.763,
    "text": "But that's what the modeler is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2475.164,
    "end": 2487.239,
    "text": "If they're interested in this question of how do agents come to learn the consequences of their action, maybe you'd set up a different model than I'm studying agents who already know the consequences of their action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2487.319,
    "end": 2489.762,
    "text": "It's just like, what are you trying to ask?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2490.383,
    "end": 2491.164,
    "text": "Who's the model for?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2491.224,
    "end": 2495.709,
    "text": "All those early questions of chapter six.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2495.729,
    "end": 2495.829,
    "text": "Okay."
  },
  {
    "start": 2495.85,
    "end": 2496.05,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2496.07,
    "end": 2497.872,
    "text": "Now we get to the active inference part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2499.708,
    "end": 2519.657,
    "text": " initialize an agent and an instance of grid world again this is like chapter six we defined the the situation of interest then made the agent ABCD alphabet and then defined the environment the generative process grid world M",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2522.067,
    "end": 2531.721,
    "text": " my agent is specified and here the arguments it's taking looks a little bit like redundant, but that gives you like a degree of freedom in specifying the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2531.741,
    "end": 2534.024,
    "text": "So you could say, I want A and then I wanna customize it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2534.044,
    "end": 2539.232,
    "text": "And so this is just a wrapper method that bundles together",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2539.212,
    "end": 2566.738,
    "text": " a b c and d and policy length so that's where the expected free energy is going to come into play because at each time step it's going to compa compute variational free energy but the policy length is used for the expected free energy so in this situation you have five affordances up down left right and stay and there's four time four four time steps is the time horizon of consideration",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2567.292,
    "end": 2575.863,
    "text": " So that means the policy vector is going to be five times five times five times five, and it will sum to one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2576.624,
    "end": 2580.309,
    "text": "Here's another point of difference to emphasize with reinforcement learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2581.09,
    "end": 2582.972,
    "text": "So that's called the policy space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2583.473,
    "end": 2586.697,
    "text": "Pi is the space of all policies that can be selected from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2588.279,
    "end": 2590.802,
    "text": "In reinforcement learning or reward learning,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2591.66,
    "end": 2602.731,
    "text": " There's another function proposed called the utility or the reward, and it is going to give a value to each of those points in policy space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2603.331,
    "end": 2609.677,
    "text": "So each policy is going to be given a value, and then that is going to rank the policies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2609.718,
    "end": 2619.507,
    "text": "And then you could choose the most rewarding, most valuable policy, or you could probabilistically select from policies according to their expected value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2621.107,
    "end": 2625.793,
    "text": " In active inference, there's no proposal of this auxiliary reward function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2626.574,
    "end": 2629.418,
    "text": "We have our policy prior, which is like our habit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2631.341,
    "end": 2640.373,
    "text": "And then whether we apply G or not, which updates to the policy posterior, that policy variable is directly sampled from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2641.214,
    "end": 2645.46,
    "text": "So policies are selected based upon their likelihood.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2645.575,
    "end": 2672.916,
    "text": " either they're the likeliest thing that would happen so we just pull from the top of the list that's kind of like the most rewarding policy but rather than moving through this intermediary auxiliary function we're picking directly either the best policy the likeliest policy or probabilistically choosing from the list that's the whole physics of um decision making angle is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2673.453,
    "end": 2698.279,
    "text": " there's no secondary reward assessment it's just updating the policy variable and then choosing from it okay spin up the environment and reset it just clean up the environment now here's the actual active inference Loop so it's cool because python has this semi pseudo Cody feel",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2700.622,
    "end": 2730.122,
    "text": " history of locations is just creating a trace or a log variable and the number of time steps is specified it's 10 time steps so it's going to run for 10 steps but the agent's window is four so while we're within the range of steps this is like where we get to kind of the uda like observe orient aside act because we're actually going to see procedurally what happens within the active inference Loop",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2730.862,
    "end": 2755.688,
    "text": " first q of s that was um q of s is q of x q of hidden states so here it's it's taking in observations and it's inferring hidden states that's q of s",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2756.917,
    "end": 2784.004,
    "text": " then there's policy inference so this is sense making that's the downstairs and then there's control that's the upstairs and then after updating the policy prior into the policy posterior the actions are selected the movements the the chosen action is is kind of locked in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2784.524,
    "end": 2794.655,
    "text": " So even though there was a probability distribution over the five options for movements, eventually one of them selected, and this just clarifies, yeah, which integer was it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2794.715,
    "end": 2796.217,
    "text": "Was it 0, 1, 2, 3, or 4?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2797.678,
    "end": 2800.601,
    "text": "And then the implications of that action occur.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2802.103,
    "end": 2805.687,
    "text": "This prints a line to the terminal just to log what happened.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2807.308,
    "end": 2814.396,
    "text": "Then the environment takes a step predicated upon the choice of the action of the agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2815.118,
    "end": 2820.124,
    "text": " And then there's just an updating of some of the observations and the history gets appended too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2821.906,
    "end": 2826.091,
    "text": "So this is what it looks like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2826.111,
    "end": 2827.092,
    "text": "Visualization method.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2829.515,
    "end": 2832.098,
    "text": "So here, the agent starts here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2832.138,
    "end": 2836.043,
    "text": "It comes up, or it starts in the top left.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2837.485,
    "end": 2843.792,
    "text": "It steps here to determine which of the Ls have the queue that's informative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2844.397,
    "end": 2869.746,
    "text": " it navigates to there and then that told it that the bottom spot was the one that would have the preferred observation David so in terms of modeling the map itself and updating the agent priors for the expectations is there like a library call for a different environment or is it going to be like a different kind of data store for example",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2871.65,
    "end": 2876.256,
    "text": " Yeah, there's a lot of ways to do this, like in PyMDP, RxInfer, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2876.916,
    "end": 2880.861,
    "text": "One really useful articulation is right here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2880.921,
    "end": 2900.965,
    "text": "So let's just say that the final agent method is going to take on A, B, C, D, E. One convenient approach is have like a bunch of A, like a bunch of A alternatives that you generate, you know, A, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2902.717,
    "end": 2931.795,
    "text": " a noisy and then and then you make an agent constructor and let's say you have 10 options for a matrices and 10 options for b matrices then you make this a wrapper method that says okay now spin me up all 100 agents all 10 by 10 combinations of agents who have a matrix 1 through 10 and b matrix 1 through 10. and then using these other kind of methods like visualization and parameter sweeps",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2932.18,
    "end": 2962.187,
    "text": " then you use those sorts of methods to sweep across combinations more modifications here they move the two cues to here or the two rewards here um so it's it's it's an interesting experience but that's what chapter six is like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2962.285,
    "end": 2991.567,
    "text": " to see ultimately there's more lines of code in this related to just the visualization methods sometimes it's it's quite curt and concise what is actually being specified so it's not like we're making mega sized models or needing to tinker with a wrench on a billion parameters",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2991.968,
    "end": 2996.433,
    "text": " That's one of the interpretability elements of active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3014.171,
    "end": 3019.276,
    "text": "So that was the output of the recipe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3019.516,
    "end": 3021.418,
    "text": "Here's the recipe to follow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3021.854,
    "end": 3044.655,
    "text": " just at a qualitative structural level that may have a lot of similarities with other systems modeling techniques people have learned about like from complexity science or systems dynamics or other other strategies of modeling and then we take the situation of interest and then basically decompose it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3045.31,
    "end": 3070.44,
    "text": " according to the particular partition that's what grounds this all under the free energy principle and then more specifically using the active ontology so that we know that we've gotten like the a the b the c and the d the observation and the hidden state with those in place you just write them in using language models or code models to help and then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3071.399,
    "end": 3075.31,
    "text": " the other functions are shared across models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3079.461,
    "end": 3083.552,
    "text": "In our last bit, what are any thoughts or questions on that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3124.167,
    "end": 3142.159,
    "text": " what they call a recipe here this is like more like the OODA loop this is just getting into the procedure of what happens at each time step but also it's like just like if the procedure for the recipe was a cup of flour a cup of sugar Etc and you had all those ingredients ready",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3143.422,
    "end": 3166.83,
    "text": " you'd be able to make the recipe so the kind of functional food we're making is an agent that's able to do perception cognition action so if we have all these ingredients we have all of the precursor materials to do this observation sampled from the environment move that observation into the hidden states",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3167.84,
    "end": 3172.347,
    "text": " through the A matrix, through variational free energy minimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3173.348,
    "end": 3178.456,
    "text": "What should I believe about temperature given this thermometer observation and my prior?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3179.037,
    "end": 3179.698,
    "text": "Equation 2.5.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3181.541,
    "end": 3183.864,
    "text": "Calculate the expected free energy of actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3184.165,
    "end": 3184.886,
    "text": "Equation 2.6.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3186.568,
    "end": 3187.289,
    "text": "Policy prior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3188.251,
    "end": 3193.479,
    "text": "Rewate the policy prior according to expected free energy, epistemic plus pragmatic value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3194.42,
    "end": 3195.622,
    "text": "Get the policy posterior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3196.363,
    "end": 3197.104,
    "text": "Sample from it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3199.21,
    "end": 3209.745,
    "text": " or just pick the best one or sample probabilistically from it, reenter that sampled action into the generative process, that's it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3214.733,
    "end": 3224.627,
    "text": "Dan, is there a similar recipe book in terms of Rxinf?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3226.987,
    "end": 3240.439,
    "text": " we uh want to be building them making an rx infer model um so copied in like the same recipe should apply okay like chapter six is that a generality of like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3241.769,
    "end": 3270.223,
    "text": " prepare the main course prepare the drinks set the table but then of course it's all situational what's the main course what's the drink what's what's the main table um but uh we have Google collab notebooks drawing from kobus's code examples at learnable Loop so if if and I'll put these these links in the chat too so the here you can um jump in to uh uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3271.604,
    "end": 3297.932,
    "text": " coding notebook and then like get all the way on through to to seeing it in rx infer like here it is with running a drone um there's some pretty major structural differences between time dp and rx infer in terms of how you set the table specify the main course etc um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3299.093,
    "end": 3303.54,
    "text": " And if people want to learn more, they could explore that document.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3303.56,
    "end": 3321.228,
    "text": "And then also, we're working to have all of the textbook examples for the textbook in RxInfer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3321.709,
    "end": 3324.493,
    "text": "So let's see where 1.2 is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3341.922,
    "end": 3343.345,
    "text": " Okay, figure 2.1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3345.83,
    "end": 3348.254,
    "text": "So this is not a case of active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3348.354,
    "end": 3349.978,
    "text": "This is just a passive inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3351.22,
    "end": 3354.627,
    "text": "There's beliefs about frogs and apples, like how prevalent they are in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3355.288,
    "end": 3357.071,
    "text": "That's the prior beliefs about hidden states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3358.093,
    "end": 3360.538,
    "text": "Then there's a likelihood model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3360.569,
    "end": 3362.592,
    "text": " which is like the A matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3362.612,
    "end": 3363.773,
    "text": "And that is a mapping.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3363.813,
    "end": 3370.222,
    "text": "It's a belief about a mapping, about jumping and not jumping and how they're related to frogs and apples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3370.242,
    "end": 3380.135,
    "text": "So it's kind of a two by two shown here with these two bars, like apples jump 1% of the time, frogs jump 81% of the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3381.537,
    "end": 3386.564,
    "text": "Before we saw the observation, we believe that 10% of the items in the world were frogs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3387.505,
    "end": 3389.428,
    "text": "We observed a jump,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3389.628,
    "end": 3418.588,
    "text": " and then we basically multiplied this shape by this shape and it turns out that a jump is 81 times more likely to have come from a frog than an apple just 81 versus one percent however we believe that apples were nine times more likely so um something was it was it was 9x down",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3419.345,
    "end": 3444.762,
    "text": " in in the um odds and then we observe something that by 81 fold made it more likely so it went from 9x down to 9x up so that's the bayesian update and then this is what it looks like in rx infer so just really briefly here's installing julia so it's not related to rx infer",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3445.248,
    "end": 3450.218,
    "text": " Here's installing, just showing, okay, have we installed Julia?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3450.939,
    "end": 3455.468,
    "text": "Here's installing the RxInfer package and other needed tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3457.633,
    "end": 3458.495,
    "text": "Frog or Apple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3459.156,
    "end": 3461.681,
    "text": "It's a categorical distribution with 0.9 and 0.1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3464.346,
    "end": 3466.21,
    "text": "Right here, 0.9, 0.1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3467.658,
    "end": 3470.14,
    "text": " Here's the T matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3470.16,
    "end": 3474.384,
    "text": "That's what it's just being called here, but the variable names don't matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3474.404,
    "end": 3475.225,
    "text": "It's what they are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3476.186,
    "end": 3483.733,
    "text": "And then there's this observation that takes in those two variables and updates based upon observation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3484.874,
    "end": 3492.541,
    "text": "And then in RxInfer, it just calls, you just call it and you say the data were surely a jump.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3492.561,
    "end": 3495.083,
    "text": "And then you return the posteriors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3497.341,
    "end": 3503.026,
    "text": " So it's a different style and it's one that many of us are still learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3505.068,
    "end": 3520.042,
    "text": "However, when we have well-documented examples of everything in the textbook in RxInfer, it'll bring a lot of continuity between the kind of engineering grade application framework and the learning path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3521.564,
    "end": 3526.268,
    "text": "So for anybody who wants to work in that way, it's super helpful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3528.543,
    "end": 3533.788,
    "text": " Okay, I hope these have been some useful pieces for people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3534.569,
    "end": 3538.433,
    "text": "Any last thoughts or questions on this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3553.888,
    "end": 3557.672,
    "text": "I don't want to go over time here too much or anything,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3558.142,
    "end": 3579.731,
    "text": " One thing I have been thinking about is how you actually distinguish between a continuous versus a discrete space or time in that there are these limitations on your inference procedure, all of that calculating your expected energy and making a decision, taking an action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3580.212,
    "end": 3583.997,
    "text": "So you're kind of living in a discrete space that's dependent on your",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3585.783,
    "end": 3607.338,
    "text": " when you're working in the continuous space, which to me also raises a question on like inferring a policy about your temporal breadth of like the now, which is something that we kind of do with adrenaline, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3607.939,
    "end": 3612.246,
    "text": "So maybe we, or at least it feels so,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3614.437,
    "end": 3615.338,
    "text": " Yeah, I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3615.398,
    "end": 3618.042,
    "text": "That's just another dimension of modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3619.164,
    "end": 3619.845,
    "text": "You're right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3619.905,
    "end": 3621.387,
    "text": "It's another dimension or layer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3621.487,
    "end": 3626.694,
    "text": "And that's part of the fun and the open-endedness of having such a composable framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3627.736,
    "end": 3636.989,
    "text": "Temporal thickness or anticipation of future agency over consideration of time thickness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3637.91,
    "end": 3639.091,
    "text": "That's not here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3640.133,
    "end": 3643.077,
    "text": "But if you can dream it, you can do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3643.597,
    "end": 3671.967,
    "text": " so you could make those kinds of structural hypotheses explicit so whether it's making a map of a cognitive system that does act as if it has these properties or if you're just on a flight of fancy or a flight of utility and you're like could we make a policy variable controlling this and then you just add another node in an edge",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3675.001,
    "end": 3703.945,
    "text": " crank it again so that's that that is the fun is saying okay then how would we do that if there was an agent that was observing its adrenaline levels and the adrenaline actual levels were modifying temporality this way maybe that's a map of nowhere maybe it's a useful map so that that is the whole question",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3704.735,
    "end": 3728.953,
    "text": " and and that is why there's such a space between the fundamentals like the particular partition variational free energy expected free energy like you can't say too much more generically than those equations the whole point is those equations whether in real time or in the anticipation those equations apply to whatever graph is constructed",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3729.659,
    "end": 3753.118,
    "text": " but that graph could be anything could be um a lattice of just ones and zeros could be a continuous automata so it's like it doesn't even have to resemble something agentic and like Maxwell said in Discord several weeks ago but but I think about it all the time he said the focus on agents has reduced the apparent scope of active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3754.027,
    "end": 3783.544,
    "text": " because agent as we know it is not anywhere necessarily here now one interface that's interesting is that like cybernetic perception action interface but just more generally we could talk about like fabrics of message passing or ecosystems of shared intelligence so there's kind of the fundamentals and then it's all about what you build and and how the models really play out in in their environment so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3785.245,
    "end": 3806.562,
    "text": " that's kind of fun and it allows the the scaffolding and the externalization of cognitive hypotheses and the consideration of alternate cognitive models but like the Lego set is not opinionated on the architecture",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3811.25,
    "end": 3811.511,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3811.531,
    "end": 3812.233,
    "text": "That makes sense to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3812.413,
    "end": 3812.553,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3812.594,
    "end": 3813.175,
    "text": "Thank you for the answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3813.556,
    "end": 3813.817,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3813.997,
    "end": 3814.278,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3814.659,
    "end": 3815.261,
    "text": "Good question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3815.281,
    "end": 3815.521,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3815.862,
    "end": 3821.918,
    "text": "So, um, if this time works for people, then next, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3823.18,
    "end": 3850.048,
    "text": " week we'll return in the third week and we'll see if these are um in the cohort seven recorded or not but we'll see um who has a feeling on what these sessions could be about maybe we revisit octopus math group developments maybe we kind of look at recent updates look at philosophy look at other uh areas and then in um the third week for cohort six",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3851.041,
    "end": 3859.47,
    "text": " especially with Andrew giving the tutorial at the workshop at some conference and RxInfer and everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3860.651,
    "end": 3868.079,
    "text": "We'll get down to it with really applying it, including everybody can make a copy of the Colab notebook.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3868.66,
    "end": 3870.962,
    "text": "So everybody can be running it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3871.803,
    "end": 3878.23,
    "text": "And it really demystifies a lot when you see it run in your browser.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3878.311,
    "end": 3896.995,
    "text": " you see which variables are defined how do the variables interact what did i put into this what do i get out of it so it's cool okay thank you very much see you all next time thanks have a good one",
    "speaker": "SPEAKER_01"
  }
]