[
  {
    "start": 10.207,
    "end": 28.637,
    "text": " hello and welcome everyone this is active inference guest stream 84.1 on july 22nd 2024 on anthropocentric bias and the possibility of artificial cognition with rafael miguerre and charles rathkoff so rafael and charles",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.82,
    "end": 35.708,
    "text": " Thank you very much both for joining, to you for introductions, and to take us through the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 35.728,
    "end": 36.869,
    "text": "Hello and welcome, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 37.25,
    "end": 41.675,
    "text": "This is Akron Sketchstream 84.1, July 22, 2024.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 42.095,
    "end": 43.036,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 43.797,
    "end": 45.098,
    "text": "OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 45.118,
    "end": 47.341,
    "text": "Thank you, guys.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 47.521,
    "end": 50.024,
    "text": "Go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 50.745,
    "end": 50.805,
    "text": "Hi.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 50.825,
    "end": 51.345,
    "text": "Thanks for having us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 52.026,
    "end": 52.727,
    "text": "So I'm Rafael.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 53.768,
    "end": 58.033,
    "text": "I'm an assistant professor at Macquarie University in Australia, Sydney.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 58.402,
    "end": 58.963,
    "text": " And Charles?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 60.305,
    "end": 61.507,
    "text": "I'm Charles Raktoff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 61.527,
    "end": 73.064,
    "text": "I'm a prominent research associate at the Jülich Research Center in Jülich, Germany, in a big neuroscience institute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 76.809,
    "end": 79.894,
    "text": "So should we go through the paper briefly?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 79.934,
    "end": 83.88,
    "text": "So yeah, we wrote this paper together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 83.94,
    "end": 87.345,
    "text": "Actually, we started by writing the general audience piece that was published",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 89.047,
    "end": 90.996,
    "text": " When was that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 91.759,
    "end": 92.623,
    "text": "A few months ago, I guess.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 92.884,
    "end": 96.34,
    "text": "Yeah, I think almost close to a year ago, maybe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 97.518,
    "end": 98.939,
    "text": " I don't think it was published a year ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 98.959,
    "end": 101.963,
    "text": "I think it was published in 2024.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 102.023,
    "end": 104.745,
    "text": "But yeah, we worked on it for a while.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 105.346,
    "end": 111.793,
    "text": "Yeah, so this piece was doing, I guess, two things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 112.393,
    "end": 122.884,
    "text": "That piece of the collection box was pushing back against what we call the all or nothing principle, which we define as the idea that either something has a mind or it doesn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 123.168,
    "end": 131.121,
    "text": " So this kind of neat but overly simplistic perhaps partition of things into minded and non-minded things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 131.982,
    "end": 146.205,
    "text": "And we argued that this was not the best framing to think of, especially unfamiliar systems that seem to have sophisticated behavioral capacities like large language models or AI systems in general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 146.185,
    "end": 169.408,
    "text": " where we don't want to take various cognitive capacities of the package and package them into this idea of a mind where either you have the mind or you haven't and if you have the mind you have all of these things as a package consciousness reasoning uh etc uh planning memory um theory of minds so we thought so as a remedy to to this kind of all-or-nothing approach we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 170.907,
    "end": 185.561,
    "text": " or what we call the divide and conquer strategy when studying the cognitive capacities of these systems, which involve looking at these capacities on a piecemeal basis, case by case, with an open-minded empirical approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 186.762,
    "end": 190.826,
    "text": "Charles, I don't know if you have anything else that's on the box, piece or background.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 193.308,
    "end": 197.792,
    "text": "Yeah, I mean, we made one point in there about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 198.143,
    "end": 205.89,
    "text": " why it is that people feel so torn about reactions to large language models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 205.99,
    "end": 224.387,
    "text": "And we said a little bit about the psychology of essentialism, which is the idea that we naturally categorize, especially living things with respect to a presumed essence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 224.407,
    "end": 226.969,
    "text": "So we give an example of an oak tree, I think,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 227.27,
    "end": 247.118,
    "text": " And we said that what people tend to think as they grow up and learn about the natural world is that an oak tree remains an oak tree regardless of changes to its observable properties.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 248.195,
    "end": 255.086,
    "text": " what makes it milk tree is this unobservable essence of oakness or whatever that it presumably has.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 255.387,
    "end": 266.705,
    "text": "And there's some experimental psychology and developmental psychology showing that we have a similar attitude towards mindedness or having a mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 267.807,
    "end": 273.696,
    "text": "And that is a somewhat speculative explanation for why the literature on",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 273.997,
    "end": 282.433,
    "text": " large language models is so torn and some people are quite dismissive and other people think that it's a step away from AGI.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 284.097,
    "end": 294.537,
    "text": "It's that if you feel like you've got to put large language models into one of two boxes,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 294.955,
    "end": 304.844,
    "text": " the box that has the essence of mindedness for the box that lacks it, then you will be forced either to say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 304.884,
    "end": 321.84,
    "text": "It doesn't have what it takes to do any of the things that we associate with having a mind such as reasoning or it has the essential characteristics of mindedness, and therefore we should expect it to have all of the other",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 322.242,
    "end": 329.991,
    "text": " properties we associate with mindedness as well, such as consciousness or understanding or whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 332.553,
    "end": 332.853,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 333.154,
    "end": 353.773,
    "text": "I think it's worth emphasizing, as you did, that the background motivation for starting to write on this general piece in the first place is indeed that the general discourse on AI systems and LLMs in particular is extremely polarized in a way that is very dichotomous and stark.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 353.793,
    "end": 361.8,
    "text": "So you have on the one hand people arguing that these systems are no more than so-called",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 361.78,
    "end": 377.73,
    "text": " parrots that are haphazardly stitching together samples from the training data and regurgitating them, or that they are no smarter than Toaster, or that they only do next-token prediction and export prediction, and therefore it is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 378.892,
    "end": 384.16,
    "text": " a non-starter to ascribe to them any form of community capacity or maybe even a category mistake.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 384.46,
    "end": 397.02,
    "text": "And on the other end of the spectrum, you have people arguing that the systems are harbingers of superhuman indulgence, that they exhibit sparks of artificial general indulgence to purpose them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 398.141,
    "end": 404.511,
    "text": "It's literally the title of a paper by Microsoft on 24.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 404.93,
    "end": 413.83,
    "text": " And many people hyping up the capacity of the systems in a way that might seem very speculative and untethered from actual empirical results.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 413.93,
    "end": 416.797,
    "text": "So there is this huge gap between these two positions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 417.198,
    "end": 423.833,
    "text": "And there's probably a very rich and complex and nuanced middle ground that is underexplored.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 424.184,
    "end": 439.223,
    "text": " I think we did make that point, if not explicitly in the published piece and in some draft, that there's something reassuring about being able to make definitive claims about what these systems are and what they do, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 440.114,
    "end": 443.862,
    "text": " they're really unsophisticated or they're really very much like us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 444.343,
    "end": 454.865,
    "text": "And either of these claims kind of meet somewhere in a way in saying that we have a clear idea of what the systems do and what they are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 455.686,
    "end": 458.933,
    "text": "And I think it's a little more epistemically uncomfortable to say",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 459.672,
    "end": 470.185,
    "text": " We have to study them empirically and find out what they can or cannot do, and why, and what are the underlying mechanisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 470.946,
    "end": 478.976,
    "text": "And we simply don't know a priori just by looking at the architecture, the learning objective, the training data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 479.596,
    "end": 485.764,
    "text": "These sources of evidence are insufficient to make the definitive claims about what these systems are capable of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 485.744,
    "end": 489.649,
    "text": " So I think that was a big part of the motivation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 490.03,
    "end": 495.897,
    "text": "And that fits into that more academic paper as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 497.94,
    "end": 511.558,
    "text": "Yeah, one other small side note, which we don't make in the paper but I think might be relevant, especially for people working in philosophy, LLMs are epistemically uncomfortable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 511.578,
    "end": 515.683,
    "text": "I think that was the phrase you just used, Raf, which is fitting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 516.524,
    "end": 537.402,
    "text": " not only because they're so new and different but also because they are artifacts right they're things that humans have constructed and engineered and um we don't have a thorough understanding of how they work i mean mechanistic interpretability and various behavioral uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 538.175,
    "end": 541.039,
    "text": " research is helping us improve our understanding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 541.9,
    "end": 546.627,
    "text": "But on the whole, our understanding is not nearly as deep as hopefully it one day will be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 546.667,
    "end": 554.938,
    "text": "And this is by itself a really strange situation to be in that we've constructed an artifact that we only partially understand.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 555.659,
    "end": 565.212,
    "text": "In the in the past, artificial intelligence was seen as a way of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 566.879,
    "end": 578.334,
    "text": " constructing something like an epistemic assistant, something that will help us, but not something that will kind of alienate us from the process of coming to know about the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 578.674,
    "end": 585.563,
    "text": "So I think there's an extra layer of discomfort built into thinking about large language models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 585.603,
    "end": 595.215,
    "text": "And that may also play into the divisiveness of debates about what they can do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 596.984,
    "end": 613.457,
    "text": " And just to add to that, I guess we should be clear that this does not entail in any way that we think these systems are so completely alien and beyond the reach of our current understanding that anything goes and that they could very well be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 615.31,
    "end": 621.583,
    "text": " you know, have like human-like intelligence or superhuman intelligence and we simply cannot say whether or not they do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 621.603,
    "end": 631.243,
    "text": "Because that's sometimes what you see in some op-eds where people frame these systems as novel alien forms of intelligence that we have created but do not understand or control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 631.444,
    "end": 632.526,
    "text": "And that is...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 632.843,
    "end": 639.595,
    "text": " You know, it's a slippery slope that leads some people to then claim that they have all these quasi-magical abilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 639.615,
    "end": 642.059,
    "text": "And that's not at all what we want to say here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 642.099,
    "end": 643.241,
    "text": "And in fact, we want to resist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 643.322,
    "end": 644.784,
    "text": "That's a cop-out, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 644.804,
    "end": 645.986,
    "text": "Yeah, yeah, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 646.006,
    "end": 654.261,
    "text": "So we think that that's just that much of a cop-out as completely dismissing a priori",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 658.308,
    "end": 659.93,
    "text": " with behavioral and mechanistic studies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 660.431,
    "end": 664.717,
    "text": "So we very much want to resist both extremes of this spectrum, if that makes sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 666.881,
    "end": 670.286,
    "text": "OK, so now should we move towards the content of the current paper?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 671.588,
    "end": 673.27,
    "text": "Sounds good, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 673.29,
    "end": 680.481,
    "text": "OK, maybe, Raphael, I'll just start with the distinction between anthropomorphism and anthropocentrism, and then you can take the next step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 682.744,
    "end": 687.471,
    "text": "So everyone is aware of the problem",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 688.008,
    "end": 709.645,
    "text": " anthropomorphic bias in some form i mean anthropomorphism is just the idea of projecting human qualities onto something non-human and it's quite easy to especially when you're having a productive successful exchange with a large language model it's easy to slip into this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 709.895,
    "end": 734.637,
    "text": " interpretive mode where you reason about the responses of the large language model as if they were coming from an agent just like you and maybe that's a useful thing to do in some circumstances but from a theoretical perspective it's certainly a mistake because large language model is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 735.224,
    "end": 762.75,
    "text": " uh radically unlike you know a human agent in all sorts of ways but um that's only one form of sort of human-centric bias the other one is um anthropocentrism or what we call in that box article anthropocentric chauvinism and that idea is pretty straightforward it's um the idea that the human way of solving problems is the gold standard",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 763.034,
    "end": 779.47,
    "text": " of solving problems generally, so that to the extent that a system solves a problem in a way that diverges from the human strategy, it's only using a trick or a faux solution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 781.492,
    "end": 792.383,
    "text": "It's not using a deep, general, rational strategy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 793.004,
    "end": 819.822,
    "text": " debate about what large language models can do we think that the anthropomorphic bias is pretty well recognized and the anthropocentric bias is not so well recognized and so part of this paper is is or the main idea behind the paper is to um present a systematic analysis of uh anthropocentric bias how it comes about and how to push back against it",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 821.708,
    "end": 834.52,
    "text": " Right, and we want to be very clear, and hopefully we're clear in the paper, that the reason why we focus on anthropocentric bias here is just because it is, I think, as Charles mentioned,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 835.124,
    "end": 842.416,
    "text": " less discussed and less recognized, or some forms of it are less recognized, and we propose this new taxonomy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 843.457,
    "end": 852.492,
    "text": "But it's not at all to suggest that it's more problematic or more important than the anthropomorphic bias that's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 855.053,
    "end": 856.475,
    "text": " morphic biases, for all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 857.997,
    "end": 868.572,
    "text": "So in other words, this is not to frame things in this slightly problematic dichotomous way of thinking that's common in the discourse on LLM.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 868.592,
    "end": 876.623,
    "text": "This is not a paper that is pioneering to the LLM booster or LLM hype camp.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 876.603,
    "end": 886.138,
    "text": " even though it is pushing back against a certain form of dismissal of anthropocentric biases that only exclusively emphasizes anthropomorphic biases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 887.42,
    "end": 899.86,
    "text": "But perhaps we should flesh this out a little bit already with the first point we make here in the paper about the performance competence distinction, which is a nice way to bring about both anthropomorphism and anthropocentrism regarding",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 900.397,
    "end": 915.715,
    "text": " So this distinction is a very classic distinction in linguistics and cognitive science, and it has already been applied to AI systems in the neural networks productively, like Chas Parsons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 916.015,
    "end": 917.657,
    "text": "So there's nothing really new here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 917.717,
    "end": 926.387,
    "text": "But the distinction comes from Noam Chomsky originally, and the idea is that performance pertains to the external behavior of a system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 926.367,
    "end": 940.627,
    "text": " in a particular domain and competence is the kind of set of underlying knowledge and computations or mechanisms that enable the system to achieve that behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 940.667,
    "end": 948.277,
    "text": "And a family observation in linguistics and cognitive science is that there is a double association between performance and competence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 949.159,
    "end": 953.725,
    "text": "So if you take, for example, language,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 955.915,
    "end": 960.922,
    "text": " I might, during this very podcast, make some grammatical mistakes or some other mistakes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 960.962,
    "end": 964.987,
    "text": "In fact, I've already misspoken a few times, I think, and repeated myself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 965.648,
    "end": 966.99,
    "text": "So I've made performance errors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 968.091,
    "end": 976.202,
    "text": "But this does not entail necessarily, hopefully, that I'm an incompetent language user and that I don't have the underlying linguistic competence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 977.566,
    "end": 980.591,
    "text": " So that's a well-recognized dissociation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 981.092,
    "end": 983.436,
    "text": "You can be competent and yet make some errors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 984.377,
    "end": 993.853,
    "text": "And the reason for that is that there might be some additional factors that are unrelated to the underlying competence that might impede",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 993.833,
    "end": 1022.254,
    "text": " on my performance so for example i might be distracted when i speak or there might be other effects on my speaking performance that don't actually originate from a lack of competence but just impede on my on the the the idealized expression external manifestation of my competence and this is why i speak but it's also why we recognize that you can have good uh performance without confidence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1022.369,
    "end": 1034.707,
    "text": " So we give here an example of a student cheating on a test or memorizing test answers by brute forcing the test into a slightly more, I guess, gray area.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1034.727,
    "end": 1042.538,
    "text": "But at least in the cheating case, a student can ace a test without being competent at whatever the test is actually testing for.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1042.518,
    "end": 1063.108,
    "text": " um and it's also well acknowledged in cognitive science that there can be instances like this throughout um you know um like that can be manifested certain experimental settings where the test subject is right",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1064.573,
    "end": 1087.425,
    "text": " where namely it's doing well, it's exhibiting good performance, and then we realize the underlying reason for the good performance is that there was perhaps some heuristic that the experimenters or the scientists hadn't thought about that could account for this good performance, but doesn't actually amount to whatever competence they were setting out to test.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1087.777,
    "end": 1090.262,
    "text": " So we start by saying, well, this is what we recognize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1090.302,
    "end": 1094.491,
    "text": "This is the world association that is supplied to humans across the board.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1095.092,
    "end": 1102.107,
    "text": "You can have performance without competence, good performance without competence, and you can have bad performance despite competence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1102.593,
    "end": 1120.973,
    "text": " Now, when it comes to LLMs, the point we make, I'm just going to scroll as we go, we have some figures to share later, but the point we make is that generally people stress the dissociation, apply the distinction to LLMs, but stress dissociation only in one direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1121.24,
    "end": 1124.145,
    "text": " unlike in the case of human where it's bi-directional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1124.165,
    "end": 1148.783,
    "text": "And so what people do generally is they say, well, other labs famously, you know, if you look at the GPT-4 technical report and various other, any report about a new state of the art other lab, they are getting really, really good at a number of tests and about benchmarks and even human examinations, human exams, the bar exam, medical exams, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1149.185,
    "end": 1165.253,
    "text": " So they can create really good performance tests that we tend to think are really difficult tests that one can only pass, at least a human could only pass, if they have a really significant amount of competency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1166.735,
    "end": 1187.175,
    "text": " And the point that is often made when it comes to LLMs is be careful, slow down, and try to find out why the model is doing well on that test, because there are various reasons why it could do well that do not actually indicate that the model has the underlying competence that the test was designed for when it comes to humans.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1187.936,
    "end": 1195.543,
    "text": "So one big concern, for example, is data contamination, where very large language models train on Internet-scale data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1196.587,
    "end": 1209.882,
    "text": " can easily be trained on some test items from common benchmarks that leak into the training data such that they can then do really well on the benchmark just because they've essentially memorized test items.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1211.064,
    "end": 1218.933,
    "text": "And there are other more subtle reasons why performance could be very good for the wrong reasons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1219.594,
    "end": 1220.935,
    "text": "So that's very well recognized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1221.116,
    "end": 1223.218,
    "text": "And a lot of the people who push",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1225.392,
    "end": 1226.894,
    "text": " bias when it comes to LLM.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1227.375,
    "end": 1228.015,
    "text": "Make that point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1228.656,
    "end": 1229.197,
    "text": "Be careful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1229.758,
    "end": 1233.062,
    "text": "Do not take on an orthomorphic attitude to the systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1233.082,
    "end": 1248.241,
    "text": "The reason why they do well is not because they have human-like intelligence or human-like current capacities, but it's for these trivial, contingent, or otherwise irrelevant reasons that account for the good performance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1248.742,
    "end": 1252.547,
    "text": "Now, when it comes to the other dissociation or the dissociation in the other direction,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1253.017,
    "end": 1256.485,
    "text": " their people are very reluctant to apply to LLMs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1257.528,
    "end": 1268.173,
    "text": "And we think it's because essentially people think in a human case, you can make sense of the idea that the human could do badly on a test or corporate could perform badly on a task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1268.778,
    "end": 1283.642,
    "text": " and yet have the competence that you're trying to test, but there might be some auxiliary factors, such as working memory limitations, attention deficits, et cetera, that could impede on the performance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1283.662,
    "end": 1296.102,
    "text": "But in the language model, I think what we argue in the paper, actually what I argue in the longer version of the paper is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1296.605,
    "end": 1306.699,
    "text": " A lot of people don't think that there is an analogous mechanism at play, where there could be some kind of auxiliary factor that impedes on performance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1306.739,
    "end": 1307.72,
    "text": "Performance is what you get.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1307.76,
    "end": 1308.721,
    "text": "What you see is what you get.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1309.422,
    "end": 1315.17,
    "text": "And so the performance is a direct manifestation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1316.652,
    "end": 1335.054,
    "text": " what the system is computing and if you have performance errors, that can only be explained by the lack of competence because there is no additional independent factor or module that could impede on the performance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1335.434,
    "end": 1337.597,
    "text": "Sources of interference, you might say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1337.813,
    "end": 1364.209,
    "text": " yeah so that'd be great yeah um so yeah i mean i'll i'll um pass it over to you charles i just wanted to to set up the this distinction yeah yeah um right so i mean if you think about a traditional uh computer program or at least if you think about a simple computer program",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1365.083,
    "end": 1374.041,
    "text": " It's odd to think of it as some sort of complex system where one part of it could sort of interfere with the workings of another part of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1374.102,
    "end": 1384.543,
    "text": "But one of the points we want to make is that something like that is a realistic possibility with large language models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1384.777,
    "end": 1414.497,
    "text": " um okay but i suppose the next part of the paper goes into a taxonomy of anthropocentric bias and the first sort of overarching point is the distinction between type one and type two so the type one anthropocentrism is the tendency to assume that lm's performance failures designed to measure competence always indicates that it lacks",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1414.763,
    "end": 1443.505,
    "text": " uh that competence and so we i before we so we'll say something about three different kinds of type one anthropocentric bias but first a background point um which is that um whenever we think it's possible to give a mechanistic explanation of some complicated phenomenon",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1444.514,
    "end": 1452.207,
    "text": " we always have to foreground some factors, some variables, and background others.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1453.89,
    "end": 1464.008,
    "text": "And the properties that we push into the background",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1466.333,
    "end": 1467.515,
    "text": " nevertheless matter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1467.575,
    "end": 1476.348,
    "text": "We're still making assumptions about the nature of those properties when we try to articulate what's going on with the other properties that we're paying more attention to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1476.388,
    "end": 1489.168,
    "text": "And if assumptions about those properties in the background turn out to be wrong, then those mistakes will corrupt our explanation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1490.127,
    "end": 1492.471,
    "text": " that attends only to the foregrounded factor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1492.491,
    "end": 1493.913,
    "text": "So that's a little bit abstract.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1493.953,
    "end": 1495.595,
    "text": "Let me just give you a simple example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1498.259,
    "end": 1508.235,
    "text": "In comparative cognition, one famous behavioral experiment is the mirror test for self-recognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1509.176,
    "end": 1519.071,
    "text": "So the question is, roughly, do non-human animals have something like a concept of self?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1519.827,
    "end": 1526.693,
    "text": " And the strategy is to put some sort of mark on their body.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1527.494,
    "end": 1536.102,
    "text": "In the original experiments, it was a red dot on the forehead of maybe a monkey or a bird or whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1536.602,
    "end": 1546.932,
    "text": "And then you put that animal in front of a mirror and see if it makes any attempt to get rid of the mark.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1547.907,
    "end": 1555.396,
    "text": " And if it does make an attempt to get rid of the mark, that shows that it recognizes that the image in the mirror is an image of itself and otherwise not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1557.558,
    "end": 1567.59,
    "text": "So that's a cool way to get at a really difficult and abstract question about the mind of a non-human animal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1567.991,
    "end": 1577.762,
    "text": "But it presumes or it assumes that animals will care about the fact that they have a red dot on their forehead, that they will be bothered by that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1578.063,
    "end": 1580.085,
    "text": " and be motivated to get rid of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1580.446,
    "end": 1593.319,
    "text": "And if that assumption is wrong, then they might fail the mirror test for self-recognition for reasons that have little to do with the presence or absence of a capacity for self-recognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1594.36,
    "end": 1599.566,
    "text": "And so something similar to that is going on, we say, in large language models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1600.948,
    "end": 1607.935,
    "text": "So the first example that we give is to do with task demands.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1608.775,
    "end": 1625.721,
    "text": " So it's a pretty natural idea that whenever you set up a behavioral task, there will be demands associated with that task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1626.224,
    "end": 1630.811,
    "text": " that are not directly related to the capacity that you're trying to test.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1630.891,
    "end": 1637.12,
    "text": "So to take the most obvious example that I can think of, if you give someone a written test, they have to be able to write.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1637.561,
    "end": 1639.844,
    "text": "They have to have a hand and a pen and whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1640.605,
    "end": 1655.607,
    "text": "And if their hand was injured or whatever and they couldn't write, then their failure to fill out the test wouldn't tell you anything about their academic knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1657.088,
    "end": 1669.574,
    "text": " So we suggest that there are auxiliary task demands in behavioral tests of a large language model, and they're subtle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1670.336,
    "end": 1675.587,
    "text": "You wouldn't think of this right away, but we talk about a paper from",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1676.09,
    "end": 1687.064,
    "text": " Who and Frank, they have a couple of papers on this topic, but what they do is they give a large language model the following sort of question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1687.104,
    "end": 1694.813,
    "text": "This is a question, it's for a grammaticality judgment, so you can see on the image there which sentence is better in English.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1694.873,
    "end": 1696.395,
    "text": "Number one, every child has studied.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1696.435,
    "end": 1699.619,
    "text": "Number two, every child have studied.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1700.32,
    "end": 1704.966,
    "text": "Answer with one or two and it gives the wrong output.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1706.6,
    "end": 1734.548,
    "text": " But then you can also simply look at the probabilities assigned to each of those sentences within the model and figure out directly whether the model thinks that input A is more likely than input B. And it turns out that on a wide variety of questions of this kind,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1734.916,
    "end": 1751.101,
    "text": " the direct comparison does, or the large language models perform better with the direct comparison than they do with the more complex demand for metalinguistic judgment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1751.181,
    "end": 1763.32,
    "text": "So the fact that the model has to process the numbering of the options and then answer in terms of a number is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1764.835,
    "end": 1771.382,
    "text": " a subtle but nevertheless important additional variable in the experiment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1772.003,
    "end": 1777.889,
    "text": "And that can influence the model's capacity to get the answer right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1777.909,
    "end": 1779.03,
    "text": "Raphael, do you want to add to that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1780.772,
    "end": 1790.623,
    "text": "No, I think that, well, maybe we can mention briefly the other example that we discussed, which is from this paper by Andrew Lampinen, which kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1791.127,
    "end": 1806.874,
    "text": " has a little extra ingredient that makes the example interesting and even more problematic in terms of comparative psychology which is one way in which auxiliary task demands can be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1807.377,
    "end": 1832.338,
    "text": " ignored or disregarded or overlooked is when you are doing a direct comparison between humans and algorithms on a task, and the experimental conditions are mismatched in such a way that the task, as you set it up, imposes stronger demands, stronger task than auxiliary demands.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1832.673,
    "end": 1835.877,
    "text": " on the LLM than it does on human subjects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1836.578,
    "end": 1839.261,
    "text": "And that's something that can happen quite often.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1839.321,
    "end": 1861.549,
    "text": "And so there is this interesting example from a couple of papers originally published by Black Rats and colleagues from Stan DeHaan's group, where they looked at the ability of language models to handle recursion, looking at center embedded clauses, how such clauses",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1861.968,
    "end": 1888.11,
    "text": " might um for example when you had a propositional phrase within the subject of the sentence and the verb might throw off either humans or lms into agreeing the the verb in the wrong way so giving the wrong number to the verb for example the keys that the man put on the table",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1889.373,
    "end": 1905.159,
    "text": " Here it should be R because keys is plural, but because you have a clause in the middle, and if you add more clauses like this that are embedded in the middle, people and algorithms can get confused and predict that the verb should be is, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1905.981,
    "end": 1915.937,
    "text": "So they tested this on humans and algorithms and found that on the more complex examples involving complex constructions or recursion,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1920.035,
    "end": 1922.037,
    "text": " collapsing compared to the simpler examples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1923.138,
    "end": 1930.204,
    "text": "And Alfred Opinen from DeepMind looked into that and realized that the experimental conditions were mismatched.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1930.224,
    "end": 1940.834,
    "text": "So the humans, as is very common in cognitive science experiments, were getting some training before they completed the test items to just get familiarized with the task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1940.854,
    "end": 1945.678,
    "text": "So then they were given some examples of the task for each condition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1946.739,
    "end": 1949.822,
    "text": "And the other labs were just prompted zero-shot",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1950.511,
    "end": 1954.497,
    "text": " um people usually put it so just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1955.219,
    "end": 1957.803,
    "text": " without any example, just .",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1958.684,
    "end": 1968.499,
    "text": "And Andrew found out that he replicated the experiments, but added some proper matched testing conditions for the other lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1969.62,
    "end": 1973.526,
    "text": "So adding some examples of the task in the prompt, what's known as future prompting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1974.588,
    "end": 1977.732,
    "text": "And with that, he found that performance was equivalent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1977.792,
    "end": 1982.88,
    "text": "In fact, the other lab that he tested was slightly better on the more complex constructions than humans.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1983.113,
    "end": 1987.979,
    "text": " So when you match the task conditions here, you actually match also parties.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1988.519,
    "end": 1993.225,
    "text": "It's not automatic, but you can match the task demands.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1993.265,
    "end": 2000.053,
    "text": "I mean, it could be that there are reasons why the various experimental conditions would result in different demands for humans and others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2000.113,
    "end": 2010.505,
    "text": "But you're still, in this case, even out of the playing field in such a way that you don't find the behavioral discrepancy that you found initially anymore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2015.362,
    "end": 2027.346,
    "text": " um yeah um good so shall we continue to the next section um so another uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2028.929,
    "end": 2036.878,
    "text": " Another way that auxiliary or another type of auxiliary task demand is input independent computational limitations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2037.359,
    "end": 2051.176,
    "text": "And here we're thinking of a few papers that show that the number of forward passes that the transformer can make influences its ability to find the right spot in parameter space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2051.796,
    "end": 2058.244,
    "text": "So neural networks are function approximators",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2059.304,
    "end": 2080.975,
    "text": " but their ability to approximate a function can be limited by the number of computations it's allowed to perform.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2083.351,
    "end": 2100.077,
    "text": " sort of crucial feature of transformers in this example is that the number of operations that determines the next token is limited by the number of tokens that it's seen so far.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2101.238,
    "end": 2130.182,
    "text": " And it turns out that if you train a transformer with additional meaningless tokens, like pause tokens, like the word pause, you can increase its accuracy across a range of question types.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2131.985,
    "end": 2159.157,
    "text": " yeah this is this counts as an auxiliary task demand in our view because um it's doing something roughly analogous to sort of giving the model that's demanded auxiliary factor right but not yeah yeah sorry yeah yeah um it's it's doing something like giving the model uh time to think and um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2160.419,
    "end": 2186.68,
    "text": " Yeah, so you might think that the absence of that additional inference time is a factor that is not directly, not conceptually related to its capacity to answer a question like the one on the screen, a simple arithmetical question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2187.031,
    "end": 2210.811,
    "text": " uh raf do you want to fill in more yes yeah no so i think that analogy is is a nice one time to think because if you if you tested a human on even a simple mathematical questions or any any task really and just ask them you know tell them they have like one second to just blurt out an answer performance would probably be pretty bad um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2211.247,
    "end": 2229.66,
    "text": " and you can think of asking an alan to answer a question point blank as very very loosely analogous to that and obviously this is an analogy and there are very important differences here but i think it's a helpful heuristic to think about what is um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2229.64,
    "end": 2244.662,
    "text": " what is going on roughly here, namely, in both cases, the system, the human or the LLM, does not get the chance to perform the necessary computations to derive the correct answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2244.642,
    "end": 2260.542,
    "text": " And so, yeah, what we talk about in the paper is that you have this experimental work showing that if you ask a question to a language model, the amount of tokens it's allowed to generate before providing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2263.07,
    "end": 2264.674,
    "text": " makes a difference to how accurate it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2265.395,
    "end": 2278.665,
    "text": "So if it just generates a few tokens and have to give an answer, or even if you just have to give the answer point blank with the very first token, it's gonna be less accurate that if you give it a chance to generate a number of tokens before you give the answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2279.253,
    "end": 2294.156,
    "text": " So the usual way in which this is understood is that when you allow the LLM to generate a number of tokens before giving the answer, or you even prompt it to do so, you say, think step by step, for example, that's not as chain of thought prompting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2294.437,
    "end": 2306.155,
    "text": "And essentially what you're doing is you're forcing the LLM to generate a reasoning trace, or what looks outwardly, externally, like a reasoning trace in the output before giving an answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2306.81,
    "end": 2310.075,
    "text": " And we know that chain of thought prompting increases performance accuracy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2311.417,
    "end": 2327.94,
    "text": "But what was found by a couple of papers is that the mechanistic influence of this process is not entirely due to the nature of the tokens that are generated in this reasoning trace.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2327.92,
    "end": 2337.31,
    "text": " In other words, it's not just that the LLM has to generate the right tokens corresponding to different steps of reasoning before giving an answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2338.592,
    "end": 2357.573,
    "text": "In fact, the very fact that you allow the LLM to just generate tokens, any token, before giving an answer, from a mechanistic perspective, affords the system to perform additional computations that can complete a computational circuit that otherwise wouldn't get a chance to be completed and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2357.823,
    "end": 2382.413,
    "text": " derive the correct answer so as charles mentioned you can have you can set up an experiment when you have the lm just generate meaningless tokens like little just the dots a bunch of dots dot tokens before giving the answer and the the the more dots you allow before the token gives the answer the greater the expressivity of the system and the more um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2382.73,
    "end": 2385.236,
    "text": " the more kinds of problems you can answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2386.118,
    "end": 2391.752,
    "text": "And so as Charles mentioned, every time an LLM is generating a token, the LLM is performing one forward pass.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2393.015,
    "end": 2396.824,
    "text": "And so the more tokens it's generating, the more forward passes it's doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2398.627,
    "end": 2413.311,
    "text": " about what's going on here as well is that having these additional forward passes where you feed back the whole input sequence plus the previously generated tokens into the system to generate the next is also a way to introduce the form of recurrence in Transformers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2415.603,
    "end": 2416.624,
    "text": " of recurrent networks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2417.846,
    "end": 2424.496,
    "text": "So that increases the exclusivity and complexity in theoretic terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2424.516,
    "end": 2435.772,
    "text": "And yeah, there is pretty compelling evidence that if you don't add up for that, then you're imposing a limitation that again, we think is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2439.38,
    "end": 2441.183,
    "text": " or point-blank a question without thinking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2442.485,
    "end": 2458.01,
    "text": "So that's an auxiliary factor because if you give the LLM the opportunity to generate enough tokens, it might have the competence to solve tasks, but you might not see that otherwise, and you might get performance errors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2458.531,
    "end": 2460.033,
    "text": "But you do think it's incompetent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2463.419,
    "end": 2464.1,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2464.12,
    "end": 2464.24,
    "text": "Yeah."
  },
  {
    "start": 2465.3,
    "end": 2489.974,
    "text": " okay um so the the third type of type one uh anthropocentric uh bias that we talk about is mechanistic interference and so um this comes from the mechanistic interpretability work and the basic idea is that because um large language models are capable of in context learning they can learn different strategies",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2490.241,
    "end": 2492.925,
    "text": " for solving a different particular type of problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2492.945,
    "end": 2498.833,
    "text": "And the strategy that they implement at a given time can be different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2499.053,
    "end": 2505.703,
    "text": "So you can talk about this in terms of virtual circuits that are formed inside the language model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2506.964,
    "end": 2520.163,
    "text": "And there's some interesting work from Neil Nanda and others showing that in some circumstances, these two circuits can compete with one another.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2520.97,
    "end": 2546.083,
    "text": " a certain level of uh or after a certain amount of training you get one circuit operative after a bit more training you have two different circuits um but they're uh the first circuit is still sort of dominant and um then after additional training the model um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2548.122,
    "end": 2551.086,
    "text": " converges on the second circuit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2551.106,
    "end": 2563.0,
    "text": "And the first one slowly gets sort of, it sort of ceases to influence the internal operations of the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2563.441,
    "end": 2573.573,
    "text": "And it's only once you reach that third phase at which the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2575.139,
    "end": 2579.245,
    "text": " benefits of the second circuit with respect to the first become visible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2580.407,
    "end": 2599.555,
    "text": "So you can you can show using decoding work that the second circuit is there before you can show behaviorally that the second circuit yields better performance accuracy on the task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2600.216,
    "end": 2601.518,
    "text": "So",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2601.852,
    "end": 2604.415,
    "text": " I suppose there's a combination of two ideas here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2604.435,
    "end": 2613.045,
    "text": "One is that there are different strategies a model can implement for solving a problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2615.127,
    "end": 2621.615,
    "text": "We can detect those strategies internally using decoding methods.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2624.178,
    "end": 2624.798,
    "text": "So three ideas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2625.079,
    "end": 2628.062,
    "text": "And then the third is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2630.455,
    "end": 2642.413,
    "text": " a good strategy can be present in some sense in the model before it has had the chance to influence behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2644.195,
    "end": 2655.452,
    "text": "And so this is just another way that the link between performance and competence is shown to be more complicated than it might seem at first.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2657.255,
    "end": 2658.657,
    "text": "Raf can certainly explain that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2659.818,
    "end": 2669.936,
    "text": " And just to clarify one thing, circuits are just ways to think about the causal structure of a neural network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2670.197,
    "end": 2675.045,
    "text": "And they're essentially computational subgraphs of the network that have a specific function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2675.486,
    "end": 2675.987,
    "text": "And you can think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2678.532,
    "end": 2705.029,
    "text": " of computations um it's a part of what people are interested in in this mechanistic interpretability literature that we build on people like neil meldak chris ola and others is reverse engineering these circuits that in deep neural networks and large language models appear to implement certain well-defined algorithms in some cases at least and the emerging picture that we build on here is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2705.228,
    "end": 2720.892,
    "text": " there is a lot of redundancy built into neural networks as they learn to perform a task or optimize a function that, in many cases, translates into redundant circuits that relate to the same task, the same kinds of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2721.023,
    "end": 2738.123,
    "text": " the same kinds of input-output mappings, and these circuits might be somewhat identical circuits that are just redundant, or they might be different algorithms just to do a similar thing, and different strategies to solve some problem elsewhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2738.684,
    "end": 2743.21,
    "text": "Maybe one will be a bit more approximative, and the other one a bit more exact, more computationally intensive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2743.23,
    "end": 2750.338,
    "text": "So that's where you can have some interference, where one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2750.909,
    "end": 2765.446,
    "text": " or do some competition where one circuit takes over another such that the other becomes kind of, you know, it's there, it's latent in the system, but it doesn't get a chance to influence behavior on a specific input.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2765.826,
    "end": 2767.768,
    "text": "So you can get a performance error for that reason.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2767.789,
    "end": 2770.512,
    "text": "And these can combine with the other things we mentioned here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2770.552,
    "end": 2778.621,
    "text": "So things like task demands, the first thing we discussed, as well as the number of tokens you generate,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2779.276,
    "end": 2783.422,
    "text": " Both of these things could cause a particular circuit to take over another.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2784.684,
    "end": 2798.184,
    "text": "So we can think of this holistically as perhaps if you ask a question point blank to a model without letting it generate a bunch of tokens before giving an answer, then one particular approximate circuit might take over that gives the wrong answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2798.645,
    "end": 2800.187,
    "text": "If you let it generate more tokens,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2800.167,
    "end": 2809.06,
    "text": " then another more relaxed circuit might be given a chance to a causal influence the output within the right answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2809.521,
    "end": 2826.445,
    "text": "And similarly with task demands, strong task demands might, in some cases, impede on the triggering of certain circuits that would otherwise have given the right answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2826.425,
    "end": 2840.603,
    "text": " So that could be the case, perhaps, in the Lakritz and Lampinian example, where giving examples of the task in the prompt might actually prime the word circuit to solve the task about complex recursive cases in the right way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2841.325,
    "end": 2850.554,
    "text": " These are the three main auxiliary factors that relates to what we call Type 1 anthropomorphism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2850.574,
    "end": 2854.558,
    "text": "I guess we should be quick on Type 2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2854.578,
    "end": 2856.84,
    "text": "Do you want to briefly explain Type 2, Charles?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2857.961,
    "end": 2858.462,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2858.522,
    "end": 2870.674,
    "text": "Type 1 deals with cases where performance of the model is weak compared to humans, so the model doesn't do so well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2871.211,
    "end": 2880.799,
    "text": " And then type two is when the model does do well, but nevertheless is different in some respect from the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2882.281,
    "end": 2889.35,
    "text": " performance profile of the human, or we have some evidence to think that the model uses a different strategy than humans typically use.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2890.111,
    "end": 2911.258,
    "text": "And the idea is that even once you hold performance equivalent or average performance equivalent, you know, making a different pattern of errors or adopting a different strategy as evidenced by, you know, some interpretability work, any deviance from the human strategy",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2911.559,
    "end": 2917.906,
    "text": " is evidence of fragility or only a trick solution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2918.947,
    "end": 2926.315,
    "text": "And this point is a bit more philosophical, I suppose.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2926.355,
    "end": 2936.807,
    "text": "But the idea is that the human strategy for solving a problem",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2938.407,
    "end": 2943.134,
    "text": " isn't necessarily the most general strategy for solving a problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2944.356,
    "end": 2964.224,
    "text": "And what matters is whether the strategy that is pursued by the model is general, whether it's robust, whether it's accurate, and not merely whether it mirrors the human strategy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2964.945,
    "end": 2965.326,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2966.234,
    "end": 2993.524,
    "text": " And we end the paper by considering an objection, which is why, given that in humans, we study cognition largely through language, and given that LLMs are trained on language or on linguistic outputs",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2995.698,
    "end": 3003.171,
    "text": " isn't it appropriate after all to treat human cognition as the correct or appropriate yardstick to study other lamps?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3004.533,
    "end": 3010.043,
    "text": "And to that, we answer that it depends how we think of that dialectic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3011.526,
    "end": 3015.833,
    "text": "So we acknowledge that there is no",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3016.488,
    "end": 3029.631,
    "text": " really other option than to start our investigation of cognitive abilities in LLMs, but with reference to human cognitive abilities, using human cognitive abilities as some kind of realistic reference points.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3030.052,
    "end": 3035.762,
    "text": "Things like theory of mind, memory, metacognition, various forms of reasoning, etc.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3035.943,
    "end": 3037.365,
    "text": "that are familiar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3037.345,
    "end": 3055.27,
    "text": " to us because we humans have them and this is the same thing by the way in animal cognition for example or in developmental psychology where in any comparative psychology set up the reference point for what concept psychological capacity is initially at least",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3055.25,
    "end": 3064.744,
    "text": " is necessarily tied up with our conception of what we humans have in our repertoire of cognitive capacities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3065.585,
    "end": 3068.349,
    "text": "But we emphasise that this is only the starting point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3068.369,
    "end": 3075.72,
    "text": "So here we've got a return from the philosopher Ali Boyle, who calls this investigative kinds and investigative cognitive kinds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3075.76,
    "end": 3082.27,
    "text": "We start with the cognitive kind like memory or metacognition, episodic memory, metacognition, fear of mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3082.25,
    "end": 3086.335,
    "text": " as an investigative starting point, a starting point of the investigation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3086.556,
    "end": 3107.903,
    "text": "And then we can start operationalizing this concept, this kind, this cognitive capacity in an experiment, testing the algorithms on it with an open-minded empirical approach, and then based on the results from that, iteratively refine",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3108.524,
    "end": 3137.383,
    "text": " the capacities that we are targeting or the definition of the capacity we're targeting in a way that could gradually lead us to shed the initial anthropocentric assumptions that we have, such that as the experimental project runs a course or as we get more results and refine our concepts, we may end up with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3138.325,
    "end": 3150.158,
    "text": " something that no longer looks like looking trying to find human life specific memory in ravens or um or in other times but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3150.728,
    "end": 3160.657,
    "text": " ends up looking for some capacity that shares some similarity with human episodic memory, but is different in other respects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3161.678,
    "end": 3169.905,
    "text": "And so we can gradually come up with a kind of cognitive ontology for the systems that is less anthropocentric.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3170.186,
    "end": 3180.735,
    "text": "So we emphasize that there's this kind of virtuous feedback loop here that's premised on open-minded empirical investigation that doesn't settle these questions a priori, but has to start",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3180.715,
    "end": 3184.158,
    "text": " as a necessary starting point with the reference to human cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3184.178,
    "end": 3187.101,
    "text": "I don't know if you want to add to that, Giles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3189.804,
    "end": 3191.806,
    "text": "No, I think that's pretty good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3191.826,
    "end": 3194.449,
    "text": "Maybe we should move on to questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3195.93,
    "end": 3201.636,
    "text": "Yeah, sounds good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3201.696,
    "end": 3202.097,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3202.877,
    "end": 3202.957,
    "text": "Wow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3203.878,
    "end": 3206.201,
    "text": "You can stop sharing, or you could leave it up, and I can move it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3208.623,
    "end": 3208.963,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3209.184,
    "end": 3209.524,
    "text": "OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3213.622,
    "end": 3217.272,
    "text": " Yeah, a lot of interesting pieces there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3217.332,
    "end": 3217.833,
    "text": "So thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3218.656,
    "end": 3220.42,
    "text": "I'll read some questions from the live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3220.902,
    "end": 3228.542,
    "text": "But first, I just wanted to read a short quote from the 2022 Active Inference textbook they wrote.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3229.298,
    "end": 3231.382,
    "text": " on page 195.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3232.243,
    "end": 3240.697,
    "text": "Some decades ago, the philosopher Dennett lamented that cognitive scientists devote too much effort to modeling isolated subsystems, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3240.757,
    "end": 3244.724,
    "text": "perception, language, understanding, whose boundaries are often arbitrary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3245.405,
    "end": 3255.222,
    "text": "He suggested to try modeling the whole iguana, a complete cognitive creature, perhaps a simple one, and an environmental niche for it to cope with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3256.147,
    "end": 3260.716,
    "text": " So it's interesting about the approach that you're taking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3260.756,
    "end": 3271.759,
    "text": "This is kind of a simple synthetic iguana, but that's leading to the bringing to bear of a lot of these empirical phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3272.279,
    "end": 3295.114,
    "text": " because there is something and and and so I saw in the presentation paper kind of this call for like deliberate investigation rather than just chopping up the iguana a priori with a framework that that applies to humans or that centers humans or or that just uh soothes the epistemic challenge that's presented",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3301.895,
    "end": 3304.559,
    "text": " Okay, first question from Dave.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3305.079,
    "end": 3316.074,
    "text": "He wrote, have you looked at Daniel Dennett's distinction between competence without awareness and competence with awareness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3316.795,
    "end": 3321.281,
    "text": "He expands on this in the 2023 From Bacteria to Bach and Back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3322.142,
    "end": 3331.294,
    "text": "I find this much more valuable than Chomsky's highly problematic performance without competence, a situation that Chomsky posits but doesn't look at deeply.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3332.557,
    "end": 3335.74,
    "text": " Where do you put awareness in all of this competency?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3341.586,
    "end": 3349.614,
    "text": "Well, maybe I'll let you take that one second, Charles, because you're maybe more with the netting than I am.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3349.634,
    "end": 3362.547,
    "text": "But I'll just say awareness is a very polysemous term, like many terms in philosophy of mind, but particularly this one and more than many others, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3363.033,
    "end": 3365.898,
    "text": " It can mean a lot of different things in all different contexts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3367.381,
    "end": 3379.101,
    "text": "Here we don't focus on things like consciousness, because I think we probably both agree that it's a less tractable, maybe empirical problem to try to assess",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3379.081,
    "end": 3384.81,
    "text": " the presence or absence of consciousness in language models, even though many people are interested in that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3385.331,
    "end": 3399.975,
    "text": "We think that we have more hope of making progress in the near term with more well-defined cognitive capacities or cognitive functions and things that relate to certain forms of reasoning, variable binding, etc.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3402.199,
    "end": 3403.401,
    "text": "So we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3403.381,
    "end": 3409.287,
    "text": " Our framework and principle would apply to things like consciousness or, as you put it, awareness, generally speaking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3409.607,
    "end": 3412.409,
    "text": "But we don't really focus on that for our examples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3412.95,
    "end": 3432.088,
    "text": "The other quick thing I wanted to mention is I seem to remember that the phrase from Dennett, but again, I'm not a Dennett scholar, was competence without comprehension, which seems a little different from competence without awareness, perhaps, depending on how you think of comprehension.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3432.389,
    "end": 3450.668,
    "text": " and yeah i think that does uh i think it is a very interesting phrase that it does um in fact i i had this project that i published with chris delega who i think you had on the podcast as well um on semantic competence in language models where",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3450.648,
    "end": 3466.572,
    "text": " we use that phrase to kind of avoid taking its stance on the kind of messy, muddy question of whether LLMs understand language, which builds in all sorts of assumptions, including about consciousness, actually, for some people like John Searle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3467.314,
    "end": 3470.158,
    "text": "And we focus on the more restricted notion of competence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3470.178,
    "end": 3479.372,
    "text": "And I think our paper here also has that property that if we over-rationalize competence, we end up over-rationalizing competence in terms of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3479.352,
    "end": 3499.922,
    "text": " the sets of knowledge of the mechanism and mechanisms that enable a system to generalize well in a given domain, basically, and in a way that's, I suppose, fairly deflationary compared to some more expensive understandings of competence that are related to comprehension or understanding more broadly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3500.082,
    "end": 3502.846,
    "text": "But I'll let you take that one, Charles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3505.089,
    "end": 3506.912,
    "text": "No, yeah, that was good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3508.09,
    "end": 3514.598,
    "text": " The phrase, the distinction that Dennett draws is between competence with comprehension and without.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3515.359,
    "end": 3528.955,
    "text": "And I think competence with comprehension is the ability not just to pursue a strategy that's successful for solving a problem, but to articulate the strategy in such a way that you could teach it, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3529.857,
    "end": 3533.541,
    "text": "And humans only sometimes",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3534.483,
    "end": 3536.205,
    "text": " have competence with comprehension.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3536.265,
    "end": 3540.909,
    "text": "We have many competences that lack comprehension.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3543.031,
    "end": 3555.502,
    "text": "When we learn to walk, for example, we have an amazing competence that we still can't quite translate into robotics because we don't fully understand how it works.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3557.904,
    "end": 3562.448,
    "text": "And when it comes to our language models, I think",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3564.115,
    "end": 3571.529,
    "text": " we should not expect comprehension.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3571.569,
    "end": 3576.98,
    "text": "I mean, they have an amazing suite of competences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3577.521,
    "end": 3584.875,
    "text": "If you thought that they also had comprehension, then I suppose you would think like, well, if you want to understand how a large language model works, you can just ask it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3586.053,
    "end": 3588.937,
    "text": " But that's a bad strategy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3589.218,
    "end": 3593.904,
    "text": "Nobody thinks that's a good way to find out how a large language model works.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3594.285,
    "end": 3599.753,
    "text": "So they're on the competence without comprehension side of things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3600.674,
    "end": 3610.508,
    "text": "And in order to figure out what the mechanisms are that enable",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3610.91,
    "end": 3618.738,
    "text": " its competencies, we have to pursue strategies that are broadly similar to the strategies we use in cognitive psychology or cognitive linguistics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3619.819,
    "end": 3621.64,
    "text": "And we have to run experiments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3621.66,
    "end": 3625.624,
    "text": "So I think that's all very compatible with Dan's way of looking at things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3625.704,
    "end": 3636.274,
    "text": "One other thing I'll mention, Dan was quite influential to me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3636.295,
    "end": 3639.938,
    "text": "And we actually wrote a commentary together",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3641.302,
    "end": 3644.846,
    "text": " which pushes back a little bit on a simple understanding of this distinction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3645.307,
    "end": 3649.953,
    "text": "So we were looking at the evolution of metacognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3651.715,
    "end": 3662.708,
    "text": "And basically what we argue is that given the gradualism of evolution, there must have been something in between base level cognition and metacognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3662.828,
    "end": 3666.533,
    "text": "So we shouldn't see that distinction as black and white.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3667.103,
    "end": 3689.247,
    "text": " And I think that if you want to contrast the sort of cognitive prowess of a human adult with lots of linguistic and scientific",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3689.783,
    "end": 3713.378,
    "text": " uh concepts at her disposal with you know a non-human animal then this strong distinction between competence with and without comprehension is reasonable um but in the space of all possible minds we should be open to the view that there can be you know semi-competent um forms of cognition",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3714.944,
    "end": 3737.543,
    "text": " And just to go quickly on this, it occurred to me while I was listening to you as well that the first example of auxiliary practice we gave, auxiliary task demands, and specifically the Hugh and Frank example, is a nice example where, in order to give the metalinguistic judgments correctly, so to that, you would need competence with comprehension, because you need to understand",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3737.692,
    "end": 3765.825,
    "text": " not only be able to to come to to agree the verb in the subject but know the rule and know how to formulate it perhaps verbalize it uh for example to teach someone right and so uh and so when you find that the lm can do well at the low task demand version of the task and that the high test demand involvement explicit metalinguistic judgments in some way that's an example of the lm having confidence in that comprehension yeah yeah nice",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3767.712,
    "end": 3792.218,
    "text": " awesome okay upcycle club wrote question given that llms inherently reflect anthropocentric biases due to their training on human data and goals how can we ensure that their intermodal discourse aligns with humanity's values um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3795.337,
    "end": 3801.443,
    "text": " So the inter-white discourse or the... Inter-model discourse, perhaps amongst the models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3802.804,
    "end": 3803.745,
    "text": "I see, I see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3803.985,
    "end": 3805.847,
    "text": "Like in that Farmville paper?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3807.128,
    "end": 3813.314,
    "text": "Yeah, the small, the, yeah, both generative agents, yeah, the small ones, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3816.176,
    "end": 3822.542,
    "text": "I think that's beyond the scope of this paper, to be honest, but I mean, we could muse about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3823.163,
    "end": 3836.601,
    "text": " But I don't know that we have, I don't know if this project has much, I mean, I think we both have an interest in the alignment problem independently of this project, but I don't think this project has much to say really about this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3836.621,
    "end": 3838.464,
    "text": "I don't know, Charles, what do you think?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3839.665,
    "end": 3846.775,
    "text": "Yeah, yeah, and I don't, yeah, I don't have anything super concrete on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3847.598,
    "end": 3857.073,
    "text": " Okay, Dave asks, an example of inserting noise into LLM training, that was the section about the extra tokens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3858.154,
    "end": 3863.903,
    "text": "Do you see any analog to intermittent reinforcement to uncertainty tolerance?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3866.887,
    "end": 3873.593,
    "text": " Because you mentioned the extra tokens in the chain of thought and how that could also be replaced by dot, dot, dot, dot, dot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3874.133,
    "end": 3895.172,
    "text": "And so what is that telling us about model training when it seems like there's some situations where adding superfluous tokens would diminish signal in datasets, but then here are other situations where it seems to actually help?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3896.232,
    "end": 3904.104,
    "text": " Um, yeah, so in that paper, I think it's called thinking dot by dot, and there is a subtitle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3905.025,
    "end": 3907.69,
    "text": "It's by Will Merrill and Jacob Stoll, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3909.552,
    "end": 3924.315,
    "text": "In that paper, if I recall correctly, what they did is that they, they introduced just this one filler token, this one meaningless token, just to evolve, but just a dot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3925.342,
    "end": 3930.23,
    "text": " and train the model to give an answer after producing a certain number of dots.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3931.792,
    "end": 3935.919,
    "text": "That's not just like introducing Rambam and gibberish in your training data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3935.999,
    "end": 3947.518,
    "text": "It's actually quite a specific intervention that forces the model to learn to perform certain computations before giving an answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3947.802,
    "end": 3953.432,
    "text": " So it makes sense to me that this couldn't diminish performance and that you could get benefits from that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3953.652,
    "end": 3956.918,
    "text": "It's not quite the same as just having that training data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3958.38,
    "end": 3961.686,
    "text": "Just because the token seems meaningless, it's a filler token, it's a dot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3962.708,
    "end": 3971.042,
    "text": "It's not just random gibberish that's going to throw off the model and impede the optimization of its learning function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3971.022,
    "end": 3987.698,
    "text": " or at least good downstream performance um but what it's going to do is going to force the model to learn that when there is a dot token it can allocate computation with its attention heads and other parts of the architecture in such a way that it's um getting towards",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3987.83,
    "end": 3994.018,
    "text": " deriving the correct token when it's finally producing the token that matters and that's meaningful after the series of thoughts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3995.881,
    "end": 3998.064,
    "text": "Yeah, I don't know, Charles, if you have other answers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3998.124,
    "end": 4010.901,
    "text": "Yeah, I think it's an important question because a priori, if someone said, look, we're going to append and prepend a whole bunch of meaningless symbols to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4011.522,
    "end": 4022.074,
    "text": " an LLM input, you might very well think that this will just weaken the signal-to-noise ratio and degrade model performance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4024.076,
    "end": 4036.77,
    "text": "So it's against that background that the empirical result that it doesn't degrade model performance ought to be regarded as an important clue about how the model works.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4037.273,
    "end": 4044.582,
    "text": " So I think that the intuition behind this question is indeed part of the interpretation of the empirical results, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4044.682,
    "end": 4046.444,
    "text": "It's surprising for exactly this reason.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4046.945,
    "end": 4053.253,
    "text": "And then the theory that's supposed to, well, this is an active inference podcast, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4053.693,
    "end": 4060.902,
    "text": "So the theory that's supposed to help rid some of the surprise here is the idea that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4063.987,
    "end": 4087.75,
    "text": " Given the architecture of a transformer where it has to go through all the tokens in every cycle, having these extra tokens gives it sort of more computational bandwidth and therefore more expressivity or more capacity to locate the right spot in parameter space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4088.506,
    "end": 4095.757,
    "text": " And even that, in a way, reminds me of... So it's not just that dots improve performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4095.897,
    "end": 4098.922,
    "text": "It's that, like you mentioned, it was trained to have that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4098.942,
    "end": 4108.576,
    "text": "And similarly, it could have been trained maybe hypothetically to just output Shakespeare quotes verbatim while you're processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4109.137,
    "end": 4113.383,
    "text": "So that's kind of like a filler or more of like a sort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4113.734,
    "end": 4115.336,
    "text": " that was a great question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4115.356,
    "end": 4125.065,
    "text": "It's like, these are linguistic paddings that do create time to get to the meat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4125.566,
    "end": 4141.902,
    "text": "So not only does it signal and signpost if it's being trained to have that meaning, which then questions like, so then was it a meaningless dot if it had a cognitive or even like a semantic aspect?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4142.759,
    "end": 4143.46,
    "text": " I had a question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4143.5,
    "end": 4167.045,
    "text": "How do you feel like in this era, Cambrian explosion of diverse intelligences, how can we understand capacities when they seem so conditional upon the setting and how the system of interest is interacted with?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4167.7,
    "end": 4179.937,
    "text": " like what are the practical implications for people who are studying LLMs and other synthetic intelligences from like a safety or reliability or performance perspective?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4185.245,
    "end": 4185.886,
    "text": "Charles, you want to?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4187.468,
    "end": 4188.469,
    "text": "No, I was throwing it to you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4190.632,
    "end": 4193.977,
    "text": "So, so, so just want to chat to some of the questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4194.017,
    "end": 4196.661,
    "text": "So the question is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4198.514,
    "end": 4210.085,
    "text": " how is the notion of a capacity changing when we have such different systems that seem to have intelligent behavior?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4210.625,
    "end": 4219.313,
    "text": "Yeah, and it's so dependent upon potentially initially unintuitive ways of interacting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4219.914,
    "end": 4227.981,
    "text": "So how can we understand the reliability and the performance and the capacity of a model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4228.703,
    "end": 4237.218,
    "text": " other than, for example, by exhaustively inputting prompts, which can't really happen, what could we really say or know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4238.74,
    "end": 4245.131,
    "text": "And or just how do you feel that this work reenters into the ways that people practically are using the models?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4246.534,
    "end": 4246.814,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4247.155,
    "end": 4247.636,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4248.076,
    "end": 4248.277,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4248.457,
    "end": 4249.479,
    "text": "It's a very interesting question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4249.519,
    "end": 4251.943,
    "text": "So the first part of the question is, I think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4252.092,
    "end": 4269.062,
    "text": " Part of the background assumption from this paper that I've explicitly defended in other work is that behavioral evidence is simply not sufficient in most cases to arbitrate disputes about capacities of algorithms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4270.684,
    "end": 4272.227,
    "text": "When it comes to human cognition,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4273.861,
    "end": 4279.147,
    "text": " We do have to rely a lot on psychological experiments that are ultimately behavioral.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4279.608,
    "end": 4294.646,
    "text": "And we do also rely on self-reports a little more than we can when it comes to LLMs because we, despite the move away from relying on intuition and introspection in the history of psychology, it still has a role to play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4295.227,
    "end": 4302.636,
    "text": "But we've, by and large, gravitated towards behavioral experiments that get increasingly sophisticated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4303.173,
    "end": 4306.198,
    "text": " to try to reverse engineer what's going on inside the black box.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4307.059,
    "end": 4323.223,
    "text": "When it comes to LLMs, partly because that's so different from us, relying exclusively on behavior is even more difficult because we have even less of an idea of what might be going on inside the black box.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4325.836,
    "end": 4328.18,
    "text": " and we have reasons to think it might be very different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4329.181,
    "end": 4344.705,
    "text": "So I think we both agree that we have to supplement this with mechanistic work that essentially involve performing causal interventions on the inner mechanisms, on the inner workings of the systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4344.685,
    "end": 4357.196,
    "text": " So decoding representation and computations that the systems that are in principle available to the systems and then intervening on them to confirm hypotheses about the causal role of these representations and computations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4358.018,
    "end": 4360.163,
    "text": "And we have methods to do that, and partly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4361.645,
    "end": 4385.779,
    "text": " Why we can be a little optimistic about this project, even though it's extremely challenging, especially to be scaled up to large models, is because unlike what's happening in neuroscience with the brain, where the range of decoding methods and intervention methods we have is extremely limited, but for ethical and for simply practical reasons, we just don't have ground truth access to activation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4388.24,
    "end": 4394.547,
    "text": " we also are generally unable to make specific interventions on activations in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4395.709,
    "end": 4400.955,
    "text": "When it comes to LLAMS, we have full ground truth knowledge of all activations of every single part of the network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4401.095,
    "end": 4406.561,
    "text": "And we also have full access to all of it for interventions at inference time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4407.182,
    "end": 4410.345,
    "text": "So that opens up a whole new range of things we can do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4411.186,
    "end": 4417.774,
    "text": "And that enables us to go beyond behavioral studies and actually decode these features",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4421.72,
    "end": 4432.837,
    "text": " philosophers would generally put it, representations and computations that the system is actually making use of, and try to reverse engineer what kind of algorithms it's making use of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4432.857,
    "end": 4448.52,
    "text": "So part of the broader problem projects that we have with Charles is to, suppose that we start with these investigative kinds, as we put, as Adivald calls them, these human-centered capacities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4448.72,
    "end": 4452.987,
    "text": " We can operationalize them and do behavioral experiments in the top down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4453.688,
    "end": 4465.368,
    "text": "And then from bottom up, we can also try to reverse engineer the mechanics of building blocks of the computations and representations that elements make use of to solve the task related to that particular capacity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4466.15,
    "end": 4470.998,
    "text": "And then we can meet somewhere in the middle and try to, from that line of work that I",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4470.978,
    "end": 4493.661,
    "text": " these things from both ends bring to the fore some kinds of mid-level abstractions as we call it or computational building blocks that might be key to the performance of the system in that domain so for example if you're interested in the capacity for reasoning you can start with this very broad",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4493.641,
    "end": 4507.802,
    "text": " human-centric notion of reasoning, then try to operationalize it in a reasoning task, then do some behavioral testing and then mechanistic interpretability of that reasoning task, find out how the system is solving it, find out how the other one is doing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4507.934,
    "end": 4529.622,
    "text": " well and why reverse engineer building blocks that might for example have to be variable manipulation viable binding and then from there you might be able to iteratively refine the notion of reasoning you started with uh to have a more specific and less human centric notion that is now operationalized in more low level",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4531.306,
    "end": 4540.725,
    "text": " multiple terms that involve the manipulation of variables in certain ways and the banning of variables to figures, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4541.549,
    "end": 4543.811,
    "text": " So yeah, so that's, I think, the general approach we take.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4543.852,
    "end": 4550.419,
    "text": "Now, does any of that feed back into interactions, how we humans interact with LLMs?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4550.439,
    "end": 4562.852,
    "text": "I think that's one way in which it could feed back is simply in terms of challenging our spontaneous anthropomorphic attitudes to LLMs to some extent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4562.872,
    "end": 4570.881,
    "text": "The same way if you read a lot of animal cognition, perhaps you will interact with your cat in a slightly different way that you might maybe not rush to conclude",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4570.861,
    "end": 4581.153,
    "text": " that when your cat performs a certain behavior, it has understood what you think and it's modeling what you're thinking about what it's thinking or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4582.594,
    "end": 4589.982,
    "text": "Perhaps you might adopt a more deflationary attitude to explain the behavior of the cat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4590.002,
    "end": 4596.75,
    "text": "It doesn't mean you have to love them any less, or it doesn't mean you have to, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4597.473,
    "end": 4598.917,
    "text": " That is the other thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4598.957,
    "end": 4605.373,
    "text": "If you want, at the end of the day, to speak to your cat like a human because you're the urban gentleman for that, then that's all the more part of you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4605.413,
    "end": 4610.385,
    "text": "In the same way, if you find it useful to treat LLMs in the way you interact with them,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4611.53,
    "end": 4621.542,
    "text": " to have fluid interactions with them, to treat them as if they had beliefs, desires, et cetera, of human-like capacities, then that's fine if that's for actual purposes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4621.563,
    "end": 4635.58,
    "text": "But at least if that line of work that we are sketching here ends up maturing enough, the hope is that we can interact with LLMs perhaps in a way that's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4635.914,
    "end": 4649.635,
    "text": " where even if we have that kind of intentional stance and make believe about the kinds of capacities they have, at the background, we will know what their limitations are and what their actual capacities are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4649.655,
    "end": 4652.799,
    "text": "I don't know if you agree with that, Charles, because we're going to discuss that much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4652.82,
    "end": 4653.46,
    "text": "Yeah, I agree with all that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4653.501,
    "end": 4658.128,
    "text": "I just had a slightly different first reaction to the question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4659.149,
    "end": 4661.112,
    "text": "I took the question to be in part about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4661.328,
    "end": 4663.915,
    "text": " how to deal with the sort of prompt sensitivity of models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4663.975,
    "end": 4672.477,
    "text": "The fact that sometimes we write something that seems natural to us, but provokes an unexpected response from a large language model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4672.558,
    "end": 4675.405,
    "text": "And how do we think about that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4675.486,
    "end": 4683.019,
    "text": " And the first thought that occurred to me was just that we should distinguish between different kinds of large language models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4684.983,
    "end": 4692.195,
    "text": "You know, we have this sort of huge large language models, which are",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4693.441,
    "end": 4696.466,
    "text": " fine-tuned to interact with us in a particular way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4696.526,
    "end": 4711.433,
    "text": "And here's the central point, they're trained on a sort of unthinkably large database, whereas there are other sorts of large language models where the training data is more circumscribed and where we know",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4711.767,
    "end": 4718.738,
    "text": " in more detail where you can survey what the training data says.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4718.758,
    "end": 4729.033,
    "text": "And I think if you're interested in what the mechanisms are underlying the responses, it's certainly very helpful to look at smaller",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4729.317,
    "end": 4733.541,
    "text": " but nevertheless large language models where the training data is known to us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4733.682,
    "end": 4748.858,
    "text": "Because when you train a model on the entire internet, there are going to be all kinds of subtle signals in there that we don't have much hope of tracing back to their source, but which will influence the model behavior in all sorts of ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4749.538,
    "end": 4757.687,
    "text": "But working with these somewhat more conscripted models gets rid of that problem, at least in part.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4761.498,
    "end": 4762.399,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4762.419,
    "end": 4770.33,
    "text": "Well, where do you see the work going or where do you plan to continue this direction?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4772.974,
    "end": 4791.42,
    "text": "Yeah, so actually, so we wrote this paper, this short paper for the ICML machine learning conference, the International Conference Machine Learning that's happening this week in Vienna and we'll be getting to Vienna at the end of the week for the popular workshop at which we're presenting this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4793.307,
    "end": 4794.789,
    "text": " models and cognitive science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4796.611,
    "end": 4802.777,
    "text": "So there is a very strict page limit for these ICML contributions, which is four pages.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4803.798,
    "end": 4812.367,
    "text": "But what we want to do next is to expand this into a more philosophically substantive paper, and it's going to be a bit longer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4812.387,
    "end": 4817.813,
    "text": "And that's going to expand on the more philosophically meaty parts of that project.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4819.379,
    "end": 4822.123,
    "text": " compressed in that version that we're presenting on HTML.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4822.143,
    "end": 4823.466,
    "text": "So yeah, that's the next step for us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4823.846,
    "end": 4826.611,
    "text": "This is a really useful way for us to force ourselves to write things down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4826.791,
    "end": 4829.936,
    "text": "After running the box piece, we wanted to write an academic piece.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4829.976,
    "end": 4836.887,
    "text": "Now we've written kind of a condensed skeleton of the piece that focuses more, that caters more to an ML audience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4837.508,
    "end": 4843.398,
    "text": "And now the next step is to write the full philosophy paper for at least that part of the project to be complete.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4843.418,
    "end": 4846.483,
    "text": "And then after that, maybe we'll have a lot of ideas, but yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4849.687,
    "end": 4853.49,
    "text": " Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4853.51,
    "end": 4855.072,
    "text": "I got nothing to add to that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4855.092,
    "end": 4855.432,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4856.313,
    "end": 4859.436,
    "text": "That's well, it's very interesting work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4859.456,
    "end": 4861.538,
    "text": "I think it brings a lot of pieces together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4861.578,
    "end": 4874.569,
    "text": "And it's some philosophy and cognitive science, jumping in, jumping into the heat and into the the spotlight and the relevance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4874.589,
    "end": 4877.432,
    "text": "And so it's going to be an exciting learning journey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4880.011,
    "end": 4880.735,
    "text": " Thanks for having us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4881.257,
    "end": 4882.664,
    "text": "Yeah, thank you very much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4882.684,
    "end": 4882.885,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4883.106,
    "end": 4884.091,
    "text": "Enjoy the conversation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4884.855,
    "end": 4885.458,
    "text": "Until next time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4885.82,
    "end": 4886.121,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4887.589,
    "end": 4887.709,
    "text": "Bye.",
    "speaker": "SPEAKER_02"
  }
]