[
  {
    "start": 8.553,
    "end": 9.674,
    "text": " All right, hello and welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10.215,
    "end": 14.6,
    "text": "It's May 30th, 2024, and we're in Active Guest Stream 84.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 16.022,
    "end": 24.152,
    "text": "This will be a presentation and a discussion with Jesse G. So Jesse, thank you for joining and for your participation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 24.753,
    "end": 31.962,
    "text": "Looking forward to a great presentation, and then we'll check the live chat and see where it goes from there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 34.017,
    "end": 35.639,
    "text": " Go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 35.659,
    "end": 36.04,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.08,
    "end": 40.587,
    "text": "Thank you so much for letting me do this showcase.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 41.728,
    "end": 58.894,
    "text": "Largely, what I'm going to go over is basically an overview debut publication of a series of papers that have to do with habits and adaptive learning in regards to a general systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 59.532,
    "end": 74.349,
    "text": " and basically looking at agential systems largely from the point of view of biological organisms, largely trying to better understand connecting that with human behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 74.389,
    "end": 89.387,
    "text": "And largely, the motivation here for this series of publications started with looking at a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 90.262,
    "end": 106.023,
    "text": " sort of literature review that was data focused on looking at the not necessarily addiction from a more broad point of view, but from a drug dependency point of view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 106.443,
    "end": 111.73,
    "text": "When I reached out to a colleague of mine a number of years ago, well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 112.334,
    "end": 119.852,
    "text": " little over three years ago now, in 2021, when I first started this journey.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 120.294,
    "end": 124.183,
    "text": "So this whole",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 125.598,
    "end": 132.23,
    "text": " This whole series of work has been undergone for about slightly over three years now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 132.491,
    "end": 134.515,
    "text": "So I started this work in 2021.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 135.797,
    "end": 147.218,
    "text": "Originally, I was connected indirectly with a group of graduate students at a state university, associated with a state university.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 147.907,
    "end": 164.278,
    "text": " And they were looking at data on addiction, not really broadly speaking, but dealing with looking at more so drug dependency based addiction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 164.258,
    "end": 169.228,
    "text": " And I was quite disappointed with the effort put into the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 169.588,
    "end": 181.592,
    "text": "I mean, I understand that the students involved were students in data science and informatics, but at the same time,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 181.572,
    "end": 188.264,
    "text": " I was a bit dismayed by the approach in the paper and I provided a critique of their work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 188.284,
    "end": 193.973,
    "text": "And I thought to myself, well, wow, like addiction has some root.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 194.234,
    "end": 196.718,
    "text": "There's some route to addiction we need to better understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 196.738,
    "end": 204.812,
    "text": "And what's also what was also came off quite",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 206.969,
    "end": 228.252,
    "text": " odd to me for a number of years now is just the the narrative looking at the lens of like what is the root of addictive behavior and that kind of goes back fun you know thinking about fundamentals um and fundamentally we we think about habits and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 228.232,
    "end": 241.573,
    "text": " When people think about habits, mostly stereotypically, again, people think about habits in sort of a bad point of, like, you know, habits are bad or, you know, point of view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 241.733,
    "end": 248.383,
    "text": "And again, re-approaching fundamentals and breaking the stereotypes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 249.899,
    "end": 255.193,
    "text": " I think it's important to understand, okay, well, are habits good or bad?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 255.233,
    "end": 256.697,
    "text": "What can we say about them?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 257.499,
    "end": 266.322,
    "text": "And how do we adapt to circumstances that we face as humans, you know, as human beings?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 266.977,
    "end": 289.221,
    "text": " More specifically, thinking about sort of this idea of not necessarily coping, but reinforcing our fitness in the sense of like, how can we better engage with the world around us and with each other and ourselves, most importantly, over time, over the course of a lifetime?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 289.842,
    "end": 319.697,
    "text": " And so that's been the general focus of this series of works is trying to look into, in terms of adaptive learning, what interventionary approaches, like what primary interventionary approaches, which I'll get into a little later, can be leveraged to be reinforcing towards our behavior and complement",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 320.403,
    "end": 326.685,
    "text": " how we engage with the world around us, each other and ourselves, rather than be counterintuitive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 328.01,
    "end": 331.442,
    "text": "And looking at habits as sort of like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 331.54,
    "end": 342.373,
    "text": " kind of like an ebb and flow of how we drive, how we motivate and direct our behaviors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 343.414,
    "end": 358.813,
    "text": "So habits can be good or bad, but more so thinking about habits on a spectrum of being reinforcement-based in a sense that it complements our fitness and how we engage with each other in a constructive way in the world around us, of course.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 358.793,
    "end": 381.814,
    "text": " uh as well as ourselves uh rather than counterintuitive or maladaptive um so um anyway i didn't really give a former a more formal introduction of who i am i wanted to kind of give start with a bit of an overview of motivation and drive of the work i'm doing um so uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 382.621,
    "end": 384.824,
    "text": " I call myself an independent researcher.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 384.924,
    "end": 394.839,
    "text": "I'm working on a portfolio of works where I spend quite a bit of time investigating academic literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 394.879,
    "end": 409.0,
    "text": "For this series of publications I'm working on, I have roughly about close to a thousand, maybe a little close to a thousand papers to work with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 410.212,
    "end": 432.912,
    "text": " I have hundreds of papers that I've found that I've read abstracts for that I haven't given a good read yet, but I've read quite, I've gone through quite a bit of papers and it gets to a point where you have so, you find so much work to work with that you kind of have to figure, you kind of have to prioritize, okay, do I have enough",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 432.892,
    "end": 459.675,
    "text": " content um and um anyway um so basically what i'm trying to do with the portfolio work i'm doing is i i look for data um i also find a lot of literature so i think it's important to find not just data but information criteria that tells a story about the data that's out there um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 459.655,
    "end": 472.525,
    "text": " And I could go on a tangent about the limitations of data science oriented communities not really telling much of a narrative rather than looking at the data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 472.906,
    "end": 478.238,
    "text": "So what I try to do with the work I'm doing is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 478.353,
    "end": 485.225,
    "text": " I try to find enough criteria, which I consider to be information or literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 486.007,
    "end": 496.986,
    "text": "So I find a whole lot of criteria that emphasizes on model building and construction, not just looking at data, but data is important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 497.557,
    "end": 520.307,
    "text": " but more importantly, like connecting, you know, building models, not just about the data, but being able to tell a story about the direction in which if we collect data in a sufficient manner, where that would go, where, you know, where, you know, the models would tell us, like, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 521.182,
    "end": 547.189,
    "text": " what does the information tell us in terms of that evaluates the criteria of data and the models that we that we build to have an understanding narrative of uh um you know what uh what we're working with in terms of uh uh in this case what i'm working on this series of papers dealing with habits and adaptive learning",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 547.912,
    "end": 552.517,
    "text": " really getting to the root of the problem domain that we're working with here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 555.36,
    "end": 572.637,
    "text": "Basically, what I'm trying to do, again, is build models, mainly complex systems-based models and work with whatever data I can to provide a narrative and provide a means to justify,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 574.0,
    "end": 575.843,
    "text": " This is the problem domain we're looking at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 576.204,
    "end": 586.24,
    "text": "This is how we should evaluate based on the criteria or the literature that has elaborated on the problem domain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 586.301,
    "end": 589.586,
    "text": "Take the converging aspects of the literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 589.626,
    "end": 596.818,
    "text": "So in this case, looking at habits and adaptive learning and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 597.473,
    "end": 620.022,
    "text": " um you know provide an emphasis like okay this is where we can go based on the problem domain so that's essentially what i'm trying to do whether or not um you know i end up working in academia or industry in in some way or another um what i feel like i'm doing is more analytical like analytics based um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 620.002,
    "end": 644.534,
    "text": " not necessarily engineering-focused, although I am working on systems-based approaches in terms of interventionary means to deal with adaptive learning and habits, which is not the current paper I'm elaborating on, although that's going to be the next paper, but I might get into that a little bit later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 644.594,
    "end": 647.157,
    "text": "But in a nutshell,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 647.947,
    "end": 653.516,
    "text": " even though that might be a bit of an elongated explanation about who I am, what I'm trying to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 653.577,
    "end": 657.964,
    "text": "I'm also trying to be agnostic about explaining what I'm trying to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 658.004,
    "end": 667.44,
    "text": "Even though I feel like I have an interest leaning into the cognitive sciences, given that's largely the arena that this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 667.42,
    "end": 694.828,
    "text": " this paper is is is leaning is geared towards is the cognitive sciences domain and a general systems um i don't want to limit myself in in a corner per se i i like to be open about my capacities of building models looking at criteria looking at data and um providing uh you know an evaluation of problem domains we are investigating anyway",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 695.213,
    "end": 705.527,
    "text": " So the whole purpose of this talk now is to go over my debut publication work, which is more of an overview",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 706.52,
    "end": 713.094,
    "text": " of understanding habits and adaptive learning with regard to agential systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 714.096,
    "end": 723.014,
    "text": "There are four primary paradigms of interventionary approaches to leverage adaptive learning with respect to human behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 723.074,
    "end": 727.363,
    "text": "I'll go over that a little bit, maybe towards the end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 727.343,
    "end": 753.705,
    "text": " uh of the points i'm making but um what i plan on doing um i'll present a a base model that i put together uh and uh momentarily but i'm gonna step through the paper a bit because there's there's a lot of context um but um i'm gonna try and summarize the uh the points that i make and uh for those of you who have looked at my work",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 753.685,
    "end": 757.372,
    "text": " I will say that it is quite a long paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 757.672,
    "end": 772.74,
    "text": "So there is this meta analysis approach to to the work in terms of, you know, looking at a lot of literature that talk about habits and talks about a general systems and different models of understanding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 773.8,
    "end": 794.07,
    "text": " perception, action, perception based dynamics, and how we engage with the world around us, and how we anticipate, you know, how we anticipate how to leverage engagement over time, based on our history of engagement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 794.05,
    "end": 799.299,
    "text": " Anyway, let's start with the abstract and we'll build up even further.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 799.419,
    "end": 814.405,
    "text": "So, like I mentioned, this paper presents itself as an overview of looking at understanding the nature of habits and adaptive learning with respect to agential systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 814.385,
    "end": 843.717,
    "text": " So the best way to understand what a habit is, is a persisting composition of behaviors that couple our engagement to leverage how we reinforce interaction with our surrounding environment and with other agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 844.473,
    "end": 846.095,
    "text": " as well as ourselves, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 847.157,
    "end": 857.931,
    "text": "So on the one hand, agents can engage with their environment in a way that's constructive, as well as each other and themselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 858.552,
    "end": 861.035,
    "text": "So we call that reinforcement learning, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 861.135,
    "end": 870.868,
    "text": "Where agents are engaging in a way that's constructive to optimize fitness, probably buffer, in the best case, buffer their fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 870.848,
    "end": 887.49,
    "text": " But on the other hand, agents also can engage with their environment in the means that could be deceptive or counterintuitive that could not only deceive themselves, but other agents in the environment, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 887.47,
    "end": 890.156,
    "text": " So that has to do with maladaptive learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 890.376,
    "end": 898.433,
    "text": "So we can think of reinforcement learning being on one side of a spectrum and maladaptive learning being on the other side of a spectrum, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 898.593,
    "end": 902.762,
    "text": "And we can say realistically that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 903.147,
    "end": 921.797,
    "text": " There's no truly completely, you know, there's no certain behavior, you know, there's no most optimal behavior that's going to completely optimize the fitness of an organism or as a multi-agent systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 921.777,
    "end": 948.46,
    "text": " given the problems with cellular senescence and aging that over time we engage with the world around us more suboptimally, but the challenge there being that to optimize fitness in the face of thinking of aging and cellular senescence being a problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 949.283,
    "end": 960.745,
    "text": " uh that we don't you know we're mortal beings agents don't last forever we break down um we decompose right so um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 961.265,
    "end": 990.377,
    "text": " In the face of that issue of becoming more suboptimal over time, reinforcement learning leverages optimizing in the moment and as time goes on, while maladaptive learning is really working against the optimal means in which we can leverage fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 991.387,
    "end": 1012.112,
    "text": " The paper is pretty comprehensive, and the reason why it is a bit long is, one, like I mentioned, it's looking at a whole bunch of literature, connecting ideas, and so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1014.86,
    "end": 1034.556,
    "text": " I've tried to approach the contextualization of the paper in a way that is both comprehensive in terms of the audience that I expect to be a more general audience,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1034.536,
    "end": 1053.085,
    "text": " to to be to be reading it um i'm not too confident in terms of like how many actual cognitive scientists or neuroscientists or physicists or whatever are going to be looking at the paper as opposed to the more layman type so i try to be mindful about who's looking at",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1053.065,
    "end": 1075.427,
    "text": " or who's going to be reading the paper, and I try to be comprehensive as much as I can, so there is some redundancy here and there in terms of my elaborations on specific points, especially talking about perceiving, acting, and anticipating the world around us, like this idea of what I call the TAP cycle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1076.099,
    "end": 1082.308,
    "text": " which I constantly bring up in my work, well, in this particular paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1082.408,
    "end": 1089.919,
    "text": "So we can think of the PAP cycle as perceiving, acting, perception, action, priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1090.359,
    "end": 1104.199,
    "text": "So perception has to do with, so before elaborating on what I call the PAP cycle, so as agents,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1105.04,
    "end": 1107.824,
    "text": " we're constantly like engaging with stimulus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1107.844,
    "end": 1116.175,
    "text": "So anything that provokes engagement for agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1116.575,
    "end": 1119.68,
    "text": "So agents we can think of as single.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1119.74,
    "end": 1127.51,
    "text": "So we can think of the scaling of agential systems to be on the one hand, units of agents or single agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1128.872,
    "end": 1131.115,
    "text": "So like single celled organisms,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1131.095,
    "end": 1154.487,
    "text": " you know your bacteria and your and different types of cells and all that stuff like simple cells that don't have much degrees of freedom and agency because they have simple functions and they serve simple roles in the environment that they're embedded in which we'll get more into this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1155.074,
    "end": 1164.949,
    "text": " this idea of how agents are existentially bounded to an embedded environment in which they co-inhabit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1166.043,
    "end": 1178.665,
    "text": " So now, on the one hand, we have these single agent systems that have simple functions and they serve a certain role within the environment they're embedded in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1179.327,
    "end": 1186.279,
    "text": "And on the other hand, we have compositions of single agents that make up what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1186.259,
    "end": 1188.443,
    "text": " make up a multicellular system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1188.483,
    "end": 1199.701,
    "text": "So in terms of speaking about agency, I'm largely going to talk about, and agential systems in general, I'm largely going to focus on biological systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1200.041,
    "end": 1208.335,
    "text": "And to be frank, and I do kind of emphasize this maybe somewhat bluntly in my work,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1208.315,
    "end": 1221.244,
    "text": " realistically, our most comprehensive and intuitive understanding of agents really is reflective in biology in terms of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1222.118,
    "end": 1242.327,
    "text": " You could say that there are very simple synthetic agential systems being researched by groups like Neil Gershenfeld's lab at MIT, for instance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1243.549,
    "end": 1247.535,
    "text": "Michael Levin's lab also.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1247.515,
    "end": 1253.823,
    "text": " and investigates xenobots and what have you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1254.343,
    "end": 1261.792,
    "text": "But Michael Levin's work is, of course, more focused on biological organisms as agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1262.613,
    "end": 1275.008,
    "text": "So I guess the one crutch of understanding agential systems really is that we're kind of limited to the scope of understanding agential systems in the scope of biology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1274.988,
    "end": 1297.095,
    "text": " So that's kind of the framework that I'm focused on here, even though I do pay a little mind of like comparing, okay, well, computer systems that we built using our understanding of technology, but very briefly, I do touch on that as opposed to what we consider to be agential systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1299.318,
    "end": 1302.362,
    "text": "Now, okay, so,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1303.523,
    "end": 1318.208,
    "text": " What separates a computer system from an agential system is that we are constantly engaging with stimulus, as I mentioned.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1318.492,
    "end": 1348.38,
    "text": " uh now stimulus is is really uh you know anything that immediate that that that is directly you know anything that directly provokes engagement of the agent right so like whether it's something visual whether um that deals with any of the capa any capacity any modality for the agent to just to to have a capacity to develop some kind of sensation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1348.36,
    "end": 1372.326,
    "text": " as a result of being uh being provoked by the stimulus where like you could think of the stimulus as like like constantly bombarding um uh the the agent in question right like the stimulus kind of is like this continuous input uh that um where the agent has multiple modalities",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1373.099,
    "end": 1377.428,
    "text": " of trying to process that input as sensations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1378.09,
    "end": 1385.185,
    "text": "And we're going to talk about what I call generalizations of sensations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1386.683,
    "end": 1392.795,
    "text": " So there's kind of multiple layers here in which sensations are processed by the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1393.837,
    "end": 1401.712,
    "text": "So in line with what I call the PAP cycle, perceptions, actions, and priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1402.293,
    "end": 1405.519,
    "text": "So perceptions deals with this,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1405.499,
    "end": 1410.618,
    "text": " capacity of enveloping, of perceiving the stimulus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1410.959,
    "end": 1417.382,
    "text": "So there's this initial, there's this layer of perceiving stimuli",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1417.7,
    "end": 1438.273,
    "text": " um where the agent again you know is you know is constantly um uh you know so so so the agent within this embedded environment that it's existentially bound to is constantly being bombarded by stimulus right there there's constant uh uh constant uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1438.895,
    "end": 1441.418,
    "text": " exposure to stimulus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1441.438,
    "end": 1465.763,
    "text": "Stimulus is inevitably directed towards the agent and then there's multiple modalities in which the agent then tries to process the stimulus as the stimulus is directed towards the agent and the agent has a various number of ways to try to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1465.743,
    "end": 1487.818,
    "text": " process that stimulus and what and we can think about those modalities in the human sense as like our different senses so vision touch uh auditory taste right um we can think of like like the combination of sensory modalities as a means to try to generalize",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1487.95,
    "end": 1492.319,
    "text": " how to process these sensations in a visceral.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1494.042,
    "end": 1504.402,
    "text": "So the generalization of sensations aspect is this visceral, initially this visceral processing of sensations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1505.444,
    "end": 1510.414,
    "text": "So you can think of like this visceral processing to be the initial layer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1510.748,
    "end": 1530.85,
    "text": " uh of which that um the agent tries to process uh these sensations try to like this is kind of where the agent filters uh what would what it would try to un try to um try to uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1532.5,
    "end": 1562.372,
    "text": " to distinguish between what is noise in the environment, like what the agent should or should not prioritize attention to, as opposed to what could be significant to the agent, like what sorts of stimulus that are being fed into the agent's modalities of processing, what stimulus matters and what stimulus doesn't,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1562.825,
    "end": 1579.643,
    "text": " Um, so this, so, so through the, through, through the generalization of sensations, there's this filtering of, okay, what, what matters and what doesn't matter based on my circumstances of, of leveraging fitness as an agent moment by moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1580.484,
    "end": 1584.228,
    "text": "Um, you know, how do I handle that as an agent?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1585.449,
    "end": 1588.933,
    "text": "Um, so, and, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1590.736,
    "end": 1607.513,
    "text": " Going from there, once the agent is able to prioritize, once the agent recognizes certain patterns of stimulus that matter, then there's this means to categorize that stimulus as information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1607.813,
    "end": 1620.029,
    "text": " So now then from there, the agent might additionally try to prioritize that information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1620.089,
    "end": 1622.832,
    "text": "Okay, what information matters?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1624.454,
    "end": 1631.403,
    "text": "There might be redundant information or there might be information that matters to my fitness, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1631.984,
    "end": 1634.968,
    "text": "So we can think about how that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1635.404,
    "end": 1660.315,
    "text": " the information now that we have that went through that layer of being generalized as a sensation and differentiating, trying to understand whether that sensation is just like noise that can't really be categorized as something",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1660.295,
    "end": 1668.195,
    "text": " that might be redundantly meaningful in some some sense, or it's something recognizable to the agent, not meaningful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1670.04,
    "end": 1672.566,
    "text": "Or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1674.453,
    "end": 1699.65,
    "text": " okay right so so from this generalization of sensations we get to the point where um the agent is trying to figure out oh uh trying to figure out uh if there's a pattern to distinguish you know between okay well is this just just noise that i can't really comprehend or is therefore not meaningful or is there some pattern here that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1699.63,
    "end": 1705.038,
    "text": " provide some information about my environment and my circumstances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1705.519,
    "end": 1710.186,
    "text": "And then by providing some, okay, now I have information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1710.266,
    "end": 1712.429,
    "text": "Now I have this generalization of information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1714.112,
    "end": 1728.253,
    "text": "Uh, now I speak of the term generalization because that kind of leads to the problem of, uh, what I like to call their vertical perception that, um, and a lot of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1728.453,
    "end": 1747.626,
    "text": " a lot of researchers and what have you talk about illusionism in the sense that we can have a more general, a more, we can develop, we can always have a generalization that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1747.741,
    "end": 1760.502,
    "text": " either becomes more intuitive or becomes counterintuitive to how we leverage circumstance, but we never have an absolute understanding of the information",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1761.055,
    "end": 1782.844,
    "text": " and and uh as well as our experiences uh which is which is a sort of a problem with with philosophy in the philosophy of science with okay well how do we evaluate something to be a theory as opposed to a conjecture which really has to do with with the rigor involved in what have you but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1782.824,
    "end": 1792.918,
    "text": " The problem with vertical perception is we are always constricted to a relative understanding of reality in which",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1793.017,
    "end": 1816.223,
    "text": " an average and you know if if enough agents agree with a generalization then that generalization guides a you know a sufficiently large group of agents so uh we can think about the direction of how we uh develop technologies and how modern civilization got to where it is today",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1816.372,
    "end": 1831.596,
    "text": " And we're going to talk more about interagent dynamics momentarily, but the idea is that we're constantly generalizing the world around us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1832.082,
    "end": 1851.509,
    "text": " And even though we can come up with generalizations, which most of us could largely agree with, those generalizations could be challenged by looking through a different lens of generalizing that criteria.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1851.669,
    "end": 1856.115,
    "text": "So it's sort of a paradox of like, okay, well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1856.095,
    "end": 1875.884,
    "text": " how do we evaluate the criteria that we have as knowledge when, you know, we have sort of these best guesstimates, so to speak, of of understanding what's happening with the world around us and how we understand reality and how we engage with each other, how we develop technologies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1877.646,
    "end": 1881.512,
    "text": "But anyway, OK, so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1883.973,
    "end": 1902.855,
    "text": " Going back to understanding habits and what they have to do with behavior, again, I talk about habits being these persistent compositions of behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1903.676,
    "end": 1913.608,
    "text": "And on the one hand, we have dynamics pertaining to nature of the agent and the nurturing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1914.331,
    "end": 1915.233,
    "text": " of the agent, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1915.253,
    "end": 1917.939,
    "text": "So we think about nature versus nurture now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1918.6,
    "end": 1929.445,
    "text": "So nature pertains to physiological limitations, while nurture pertains to the exposure over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1929.485,
    "end": 1932.812,
    "text": "So we could think of like the, you know, the course of a lifetime",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1932.792,
    "end": 1956.488,
    "text": " an agent is exposed to environmental circumstances and there's this idea of intrinsic and extrinsic variability of circumstances of environment so we can think on the one hand that as multi-agent systems being human beings we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1956.468,
    "end": 1958.851,
    "text": " we are a whole ecosystem, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1958.911,
    "end": 1977.458,
    "text": "We are composed of multiple cells and we have these different anatomical layers that allow us to have this integrated functionality in which we leverage metabolic and cognitive load.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1978.359,
    "end": 1984.888,
    "text": "Now, the key thing to understand here about metabolic and cognitive load is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1985.712,
    "end": 1994.652,
    "text": " is top-down as opposed to bottom-up dynamics in which agents facilitate their own integrity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1995.534,
    "end": 2001.848,
    "text": "And we're speaking largely about multi-agent systems because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2001.828,
    "end": 2015.947,
    "text": " There's this complexification of behavior that enables the capacity of, for instance, our ability to make decisions because we have a central nervous system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2016.007,
    "end": 2019.292,
    "text": "Not all organisms have a central nervous system, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2020.474,
    "end": 2026.742,
    "text": "So we, especially when we think about these single agent systems, they're much more simple in function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2026.782,
    "end": 2031.008,
    "text": "They have much lesser degree of agency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2031.46,
    "end": 2053.3,
    "text": " Since we're composed of multiple cells and all these different subsystems that regulate functioning that deals with metabolic cost, that gives us a bit more degrees of freedom because there's all these different subsystems engaging with each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2053.28,
    "end": 2059.289,
    "text": " that facilitate the capacities we have to engage with the world around us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2059.83,
    "end": 2077.195,
    "text": "So on the one hand, thinking from bottom-up dynamics, we have the composition of cells that compose of different organ systems, right, that regulate metabolic load,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2078.39,
    "end": 2087.018,
    "text": " that enables the possibility from the top down for when we think of cognitive load from the top down, we're thinking about executive function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2087.979,
    "end": 2097.567,
    "text": "So from top-down dynamics, we're thinking about how cognitive load is facilitated, where decision-making happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2098.468,
    "end": 2105.815,
    "text": "And this, we'll talk more about the, what is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2105.795,
    "end": 2109.179,
    "text": " fundamental to this decision-making momentarily.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2110.221,
    "end": 2130.267,
    "text": "But thinking about nature dynamics, we're thinking about the physiological limitations of the integrity of bodily functions from the bottom up that influence the top-down dynamics that facilitate cognitive load leverage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2130.719,
    "end": 2131.18,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2131.2,
    "end": 2159.123,
    "text": "So, so, so problems with physiology, uh, has, has to do like maybe, maybe with, with, uh, problems with, with, with, uh, you know, from, from the beginning, uh, of the agent's life cycle, or at some point there's some hindrance that, that, uh, sticks, uh, that kind of sticks out as, as like a barrier for the agent to, to leverage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2159.643,
    "end": 2183.288,
    "text": " uh how they engage with their environment whether or not you know let's say uh uh an amputated limb for instance like i you know like like i like if i lost my arm like how is that gonna impact how i engage with the world around me right or something more severe than that right so on one hand we think about physiological limitations pertaining to nurture dynamics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2183.268,
    "end": 2207.503,
    "text": " We can think of the beginning of the life cycle of an agent considering problems from birth, or we can think of something that just happened that could be an existential hindrance that could be permanent or pretty long-lasting until that hindrance is corrected, whether or not it could be corrected.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2207.753,
    "end": 2232.259,
    "text": " And in terms of nurture dynamics, since nurture dynamics have, you know, pertain to the course of a lifetime exposure in which an agent leverages how it interacts with its surrounding environment, other agents and intrinsically and extrinsically, of course, thinking about how the agent deals with its own",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2233.353,
    "end": 2243.008,
    "text": " its own internalizations and externalizations, as well as considering how it engages with other agents and its surrounding environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2243.866,
    "end": 2254.479,
    "text": " And the nurture dynamics generally would have the most impact because it deals with the full life cycle of the agent, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2254.62,
    "end": 2265.333,
    "text": "So until the agent ceases to exist, it's going to be constantly engaging with an environment in which it's bound to, and it's constantly going to engage with other agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2265.413,
    "end": 2272.422,
    "text": "And the exposure dynamics are what is central to this engagement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2272.57,
    "end": 2276.555,
    "text": " both intrinsically and extrinsically, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2278.277,
    "end": 2282.182,
    "text": "And now I was talking about metabolic load.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2282.482,
    "end": 2299.843,
    "text": "And now like every function of the agent, like every process that happens, like every interaction, you know, when we think about this, you know, from the single cell level to the multicellular level,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2300.077,
    "end": 2312.415,
    "text": " of the integrity of different functions of the agent from the top down to the bottom up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2313.458,
    "end": 2339.078,
    "text": " um all that involves metabolic load and i even argue that the the process of of having thoughts that like even generating thoughts in our head even in a way that's compulsive or you know thoughts that that just kind of go in and out or you know other processes like that involve perception action and priors all that comes down to metabolic load processing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2339.058,
    "end": 2358.096,
    "text": " And those metabolic dynamics are facilitated through, you know, are largely facilitated from the bottom, you know, from the bottom up, you know, in terms of the integrity at scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2360.219,
    "end": 2388.285,
    "text": " okay so let's move on to routines um being fundamental so routines uh we can think of uh routines like you know for those of you who are programmers or have a program or engineering background we can think of a routine as like some kind of instruction or or or or some kind of a simple instruction among other",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2388.502,
    "end": 2393.811,
    "text": " instructions that enable behavior to happen, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2393.831,
    "end": 2409.598,
    "text": "And we can also think of routines as compositions of, you know, this continual, we can also think of routines as",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2410.169,
    "end": 2413.413,
    "text": " the enabling of persistence to happen, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2413.513,
    "end": 2420.762,
    "text": "So on the one hand, we can think of a routine as part, some aspect of the behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2420.802,
    "end": 2439.805,
    "text": "On the other hand, we can also think of, more so, I contextualize routines to be the means in which the persistence of some compositions that make up a habit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2440.747,
    "end": 2457.27,
    "text": " To be able to be orchestrated because a habit, you can think of a habit to be some routine characteristic of which the agent is leveraging.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2459.09,
    "end": 2476.727,
    "text": " um in some procedural orchestrated fashion right um that that some that that either um constructively optimizes its fitness or maintains its its its current state of fitness in a way that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2476.707,
    "end": 2506.697,
    "text": " right when we think about optimizing on the reinforcement aspect uh in terms of reinforcement learning or being counter you know routines and uh like this routinization of behavior of habits um you know could could be counterintuitive to the agent too right um like this persistence of of behavior could be counterintuitive uh to to the behavior uh behavior of agents as well and and and we this regulation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2507.96,
    "end": 2509.718,
    "text": " uh, of, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2511.622,
    "end": 2518.649,
    "text": " Now this regulation of behavior we can think of is not static, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2518.989,
    "end": 2530.981,
    "text": "We're not consistently in the same state when we're engaging with our environment because the environment that we are embedded in is not in a fixed state either.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2531.161,
    "end": 2535.966,
    "text": "So the environment, as well as ourselves as agents, are not in a static state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2536.086,
    "end": 2539.249,
    "text": "So we're these complex,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2539.229,
    "end": 2567.295,
    "text": " uh adaptive dynamical systems complex in the sense that uh we have you know we're composed of uh uh you know like i mentioned like we're we're composed of multiple we're these multi-cellular systems we're a whole environment ecosystem have you but we're we're we're composed of all these integral integral functions that regulate an entire system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2568.659,
    "end": 2572.463,
    "text": " So that's on the complex side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2574.626,
    "end": 2585.438,
    "text": "And then adaptive being that the system is trying to compensate a way to regulate behavior based on circumstances, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2585.558,
    "end": 2594.548,
    "text": "Whether or not the circumstances optimize or deceive the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2597.566,
    "end": 2613.533,
    "text": " So that's what I mean in terms of thinking about agents as complex adaptive systems, that we are these compositional systems that have certain",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2613.513,
    "end": 2630.998,
    "text": " exhibit certain behaviors in a means that try to regulate our capacity to engage with our environment in the sense of, you know, thinking intrinsically, regulating our own",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2630.978,
    "end": 2647.286,
    "text": " our own bodily functioning and cognitive functioning, as well as, you know, extrinsically as well, how we engage with our surrounding environment, as well as other agents, because those other agents are part of the surrounding environment, and we're part of the environment as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2647.506,
    "end": 2651.333,
    "text": "Hence, where we are embedded in this environment, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2653.793,
    "end": 2673.979,
    "text": " so um obviously we can think of this uh you know the reinforcement learning as opposed to maladaptive learning capacity of agents to be like sort of a tug of war um you know tussle in terms of like optimizing as opposed to deceiving fitness right because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2673.959,
    "end": 2684.983,
    "text": " On the one hand, there are moments in which we can optimize leverage, in which we can strategize certain ways to reinforce our behaviors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2685.023,
    "end": 2692.98,
    "text": "And those ways could themselves become counterintuitive over time based on how circumstances might change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2692.96,
    "end": 2710.362,
    "text": " Because the environment is not in a static state, it's in this, you know, we're in this, we exist within a complex system, as complex systems, right, that are changing state over time due to, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2711.557,
    "end": 2740.551,
    "text": " the state of which the entire environment, what the resources in the environment available to agents to utilize, whether or not how those resources remain available, how those resources might change and how other agents might change their behavior or conduct themselves as well as ourselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2740.683,
    "end": 2767.753,
    "text": " um and so you know we're always trying you know as agents we're always trying you know we're we you know i don't want to use the word exploit as a bad word but we we are trying to figure out a way to leverage resources and you know you know what can we use as resources in our environment to optimize metabolism",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2767.733,
    "end": 2787.137,
    "text": " you know, to optimize our bodily functioning capacities from the bottom up to the top down, as well as this idea of utilizing certain aspects of the environment as tools and developing technologies and communicating with other agents as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2788.899,
    "end": 2789.6,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2789.88,
    "end": 2796.188,
    "text": "So as agents, we have this goal-directedness and orientation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2797.349,
    "end": 2816.387,
    "text": " and this this routine behavior like this like the persistent dynamics of habits and just kind of like thinking of of of habits of like like these reoccurring behave ways um or uh these ways that we repetitively engage with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2816.367,
    "end": 2831.237,
    "text": " uh with uh with our environment and other agents and even ourselves the way we kind of engage with our ourselves and like how we start our day and how we end our day and how we you know we work on tasks and all that uh thinking about human behavior",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2832.466,
    "end": 2847.876,
    "text": " So, and that is like, you know, that's aligned with, you know, this engagement is in line with, you know, this, you know, when we think of goal orientation,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2847.856,
    "end": 2860.533,
    "text": " We're thinking about how an agent kind of facilitates, thinking about, OK, I'm going to do this to achieve this or get this resource.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2860.854,
    "end": 2862.336,
    "text": "I want to have this resource.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2862.376,
    "end": 2864.819,
    "text": "I have to do a certain number of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2865.98,
    "end": 2871.568,
    "text": "So goal directedness could be composed of a subset of goals or there's change",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2871.869,
    "end": 2893.708,
    "text": " and you know there are dynamics and you know the goals themselves are not necessarily static but uh in terms of it like instinctual goals like we have to maintain metabolic load sufficiently for for our integrity right so so we can think of like there's certain certain goals that are our primary that facilitate um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2894.465,
    "end": 2923.307,
    "text": " how we optimize fitness, like, you know, eating, eat, you know, dieting, uh, exercise, you know, thinking about human behavior, we think about like stuff like dieting, exercise, sleep, uh, drinking water, hydration, like what, what, you know, what are, what are fundamental, uh, fundamental goals that are going to regulate enter, you know, this integral, uh, integrated, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2924.62,
    "end": 2939.828,
    "text": " uh functioning uh from bottom facilitating bottom up and and top down facilitation in which an agent leverages uh optimizing fitness right so so when we think about goal directing this we're really",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2939.808,
    "end": 2965.798,
    "text": " thinking we're really talking about okay how how is the agent uh optimizing its integrity you know keeping itself alive really is is like most fundamental to instinctual goal directedness and there's there there can be other goals that complicate the agent's integrity like obsessions and like and how obsessions manifest and so you know like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2966.048,
    "end": 2967.611,
    "text": " We can think about, oh, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2967.811,
    "end": 2974.041,
    "text": "OK, well, as humans, like some of us are into sports, some of us are into video games or what have you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2974.201,
    "end": 2980.231,
    "text": "Or, you know, I like to you know, I like to draw art sketches.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2980.412,
    "end": 2987.263,
    "text": "So there's certain things that are you know, there's certain other goals that might not necessarily.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2987.952,
    "end": 2996.282,
    "text": " be directly or, or, or maybe they're tertiary, uh, to, to, to the agent, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2996.302,
    "end": 3005.872,
    "text": "There's certain goals that might not necessarily, uh, uh, be, be necessarily like, I don't, I don't necessarily have to work on artwork.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3006.073,
    "end": 3017.706,
    "text": "You know, I could do, I could both do other things, but like goal alignment, especially in terms of like goals that are not necessarily, uh, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3018.31,
    "end": 3044.807,
    "text": " uh uh vital to to to the agent's integrity like when we think about like food water sleep and what have you right those are fundamental goals like there's there's also the complication of other goals that uh kind of align with the interests of the agent over time based on exposure dynamic when we think of nurture dynamics like you know like what",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3044.973,
    "end": 3070.12,
    "text": " what stimuli ends up directing the agent to develop these interests and obsessions and what have you and now they they have these goals that are that are aligned with like those obsessions or their or those interests or what have you not to say that interests are obsessions but um just trying to come up with some examples there okay um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3071.332,
    "end": 3077.19,
    "text": " So I kind of go, in this section over here talking about,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3077.491,
    "end": 3081.917,
    "text": " Um, routine behavior, being integral to, to environment and agent based dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3081.977,
    "end": 3100.04,
    "text": "I kind of start off with like talking a little bit about, uh, you know, from the, from the perspective of, of, of thinking about physics and particle interactions, um, and then getting to, uh, uh, agent based behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3100.48,
    "end": 3101.862,
    "text": "Um, so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3103.715,
    "end": 3129.418,
    "text": " we can think about how systems might, how do systems, how do agents as systems maintain stability or acknowledging, of course, the problem with cellular senescence and aging of systems, like that system degrade over time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3130.495,
    "end": 3149.888,
    "text": " um due to uh you know uh systems degrade over time after prolonged exposure to uh to their environment and and what have you and and those dynamics which um see",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3152.517,
    "end": 3178.963,
    "text": " which, you know, I don't think it's necessarily necessary for me to talk about entropy and what have you, but most systems, you know, degrade from a structured, more organized state to a more decomposed chaotic state, which is, which,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3179.99,
    "end": 3191.648,
    "text": " which that kind of connects, in a sense, to problems with cellular senescence, like how as we get older, our fitness is more suboptimal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3191.768,
    "end": 3204.428,
    "text": "But even though our fitness is more suboptimal as we get older, we still try to optimize the integrity of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3204.408,
    "end": 3222.719,
    "text": " of our agency by engaging with our environment in ways that are reinforcement-based even in light of that sub-optimality as opposed to being counterintuitive to fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3228.449,
    "end": 3229.791,
    "text": "Let's see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3232.268,
    "end": 3236.133,
    "text": " And now resources, I mentioned resources.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3236.594,
    "end": 3243.843,
    "text": "Resources provide a variation in which we can leverage our fitness, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3243.863,
    "end": 3249.871,
    "text": "So resources could be like food that allow us to manage metabolic load.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3249.891,
    "end": 3259.103,
    "text": "They could be certain aspects of the environment that we can use as tools to manipulate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3259.083,
    "end": 3261.186,
    "text": " the landscape of the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3262.187,
    "end": 3280.23,
    "text": "So variational constraints in terms of optimizing fitness in line of our agency have to do with not how we maintain ourselves, but how we engage with each other, especially as a means to maintain our fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3284.058,
    "end": 3294.989,
    "text": " And the environment not only presents resources that agents can utilize, but there might be barriers in the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3295.009,
    "end": 3308.783,
    "text": "There might be optimal, in a sense that there's obstacles within the environment that provide constraints in which the agent has certain agency to engage",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3308.763,
    "end": 3337.673,
    "text": " uh to engage with the environment uh more more intuitively or or you know to to have better circumstances as opposed to circumstances being being worse uh based on certain resources not being available to the agent so that could that could be an obstacle where like whether certain resources that that an agent was utilizing whether it has to do with metabolic uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3337.653,
    "end": 3343.933,
    "text": " metabolic integrity more directly in terms of food or whether",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3344.504,
    "end": 3355.942,
    "text": " there are certain aspects of the environment that can be utilized as tool construction or means to communicate with other agents, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3357.404,
    "end": 3370.444,
    "text": "So the environment can pose as a barrier if the environment makes it that it's more difficult rather than",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3370.424,
    "end": 3389.003,
    "text": " more intuitive for agents to facilitate integrity, their fitness in terms of how they how agents engage with each other and how they leverage their own fitness intrinsically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3392.267,
    "end": 3398.153,
    "text": "So we talked to where I think I provided a good overview of goal directed behavior now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3399.955,
    "end": 3419.179,
    "text": " What I'm going to talk about, so I'm going to talk a bit about this aspect of regulation, like try and provide more clarity on like, okay, well, as agents, we're trying to regulate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3419.159,
    "end": 3444.323,
    "text": " uh we're trying to to regulate an optimal means of sustaining an optimal level of fitness and and how does that work out right and so um maybe a number of you aren't familiar with david wolpert but uh david wolpert um talks about uh this this term known as this this um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3445.282,
    "end": 3449.988,
    "text": " this idea of guided random search optimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3450.408,
    "end": 3452.11,
    "text": "So I'm going to say that again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3452.471,
    "end": 3456.115,
    "text": "It's an entendre of words.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3456.615,
    "end": 3471.373,
    "text": "Guided random search behavior, which has to do... So if we think of randomness, we're thinking about this uniformity in which",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3473.395,
    "end": 3477.941,
    "text": " uniformity in which certain outcomes occur or certain things can happen, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3478.061,
    "end": 3496.483,
    "text": "Like that there's no prioritized, there's no prioritizing of certain ways things might occur, but there's uniformity in which occurrences happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3496.463,
    "end": 3521.053,
    "text": " and we can and so this uniformity especially understood in literature regarding probability theory and denotes to what randomness means now it's not necessarily like a lot like some people might think randomness has to do with spontaneity and what have you and that might have to deal with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3521.033,
    "end": 3543.042,
    "text": " probably extremities of randomness per se, that's not necessarily random, but randomness more so has to do with uniformity, that there's no selective favoritism about how outcomes happen, but that there's kind of like this evening out",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3543.022,
    "end": 3553.619,
    "text": " of like how outcomes and circumstances happen in terms of thinking about what randomness implies here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3555.381,
    "end": 3566.599,
    "text": "And David Wolpert approached this aspect of thinking about how we develop axiomatic systems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3569.836,
    "end": 3584.74,
    "text": " And how we can think about, you know, when we think about axioms, we think about really, you know, how we, how, how we, how",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3586.137,
    "end": 3589.804,
    "text": " how behaviors, how things are reduced.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3591.147,
    "end": 3595.877,
    "text": "How far can we reduce a certain behavior or a phenomenon?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3596.638,
    "end": 3608.061,
    "text": "And when there are certain components that can't be furthermore reduced, but you can use those components as building blocks to represent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3608.041,
    "end": 3621.949,
    "text": " uh complications or complexities of how behavior uh how behavior can can happen with a system now now we're thinking about axioms right so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3623.093,
    "end": 3639.921,
    "text": " a good example of thinking about axioms is thinking about how arithmetic happens right like how how we can add or multiply numbers to get more numbers and we get a rate we have we have inputs of numbers and we then we have an output of numbers we have a range of numbers so now we can think about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3639.901,
    "end": 3668.659,
    "text": " when we're talking about agential systems and we're thinking about axiomatic properties of systems we're really thinking about um you know how do we reduce stimuli and sensations and generalizations in the way the way uh agential systems generalize how to engage with stimuli and um now um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3670.158,
    "end": 3683.299,
    "text": " I just realized that I probably didn't give an elaboration on actions and priors as opposed to perceptions regarding the path cycle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3683.82,
    "end": 3690.31,
    "text": "So let me do that real quick before I go more into what is guided random search behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3691.049,
    "end": 3700.626,
    "text": " Which then leads to this aspect of guided random search optimization, because ultimately we as adjunctural systems want to optimize fitness, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3702.729,
    "end": 3714.61,
    "text": "Now, okay, so perception has to do with perceiving, you know, as we're engaging with stimulus and processing sensations,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3714.59,
    "end": 3724.106,
    "text": " We are, you know, we're perceiving, we are trying to figure out, okay, how do I engage with this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3724.367,
    "end": 3735.265,
    "text": "You know, in terms of top-down, you know, we're talking about top-down here when we're talking about perception actions and priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3735.245,
    "end": 3747.263,
    "text": " uh more simple agents uh it could be argued that you know even simpler agents have a means in which they perceive act and anticipate even though you know that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3747.665,
    "end": 3770.668,
    "text": " their capacity the capacity more simple agents to engage with the environment is is is less complex because uh you know if we're thinking about especially single cell systems as compared to you know humans where these multi-agent systems because we're we're composed of multiple cells and um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3771.88,
    "end": 3794.085,
    "text": " We have these networks of neurons and glial cells that are facilitating engagement and communication with different regions of other neural and glial cellular networks that are facilitating our capacity to perceive, act, and anticipate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3794.105,
    "end": 3798.41,
    "text": "So action has to do with how we're responding to the stimulus, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3798.45,
    "end": 3801.533,
    "text": "So we're trying to facilitate a response",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3801.513,
    "end": 3824.77,
    "text": " uh to to to the stimulant to to how we're engaging with our environment we're talking about action and then priors or anticipation has to do with uh like a history you know we keep track of it of a history of our perceptions and our actions and we then we try to optimize based on that history we were trying to anticipate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3825.661,
    "end": 3831.532,
    "text": " what perceptions and actions ought to be optimized going forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3832.113,
    "end": 3846.599,
    "text": "So on the one hand with perceptions, we're engaging with their environment, we're engaging with stimulus, we're trying to figure out, okay, how do I react to this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3846.659,
    "end": 3848.462,
    "text": "How do I respond to this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3848.442,
    "end": 3876.863,
    "text": " and then next in line once we once we once we have a calculation in mind of like okay this is going to be my action this is going to be my response to the stimulation and now when we're thinking about perceptions actions and friars um again we we can think about compositions thereof of of perceptions actions and friars right you know we think about not only uh you know",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3876.843,
    "end": 3881.807,
    "text": " even different modes of perceiving and acting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3881.905,
    "end": 3897.008,
    "text": " And at times, their perception and actions are sort of coupled based on how different regions of the brain are processing sensations and information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3897.028,
    "end": 3909.347,
    "text": "And once you process sensations, you have information to work with, and then you're prioritizing what information matters after you prioritize what sensations matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3909.968,
    "end": 3914.937,
    "text": " Now, okay, this guy did random search.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3915.518,
    "end": 3921.949,
    "text": "Now, we're going back to axiomatic systems, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3922.289,
    "end": 3928.5,
    "text": "We have this, we get to this point where we try to reduce,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3929.189,
    "end": 3949.105,
    "text": " uh sensations right we try to to decompose you know like especially when we're processing sensations and prior and we're trying to um conduct this capacity to perceive act and anticipate ultimately we're trying to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3950.485,
    "end": 3971.143,
    "text": " come up with ways to to you know as we're coming up with ways to predict we're trying to uh you know we're trying you know thinking about like that example of arithmetic we're trying to to you know reduce what the sensation to what we're trying to reduce to uh uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3972.187,
    "end": 3990.87,
    "text": " know like sensations only reduce so much yet uh compositions of those sensations could start to build a picture right like the bare reductions of those sensations might not make much sense themselves but if we take the compositions of those sensations over time and how they build up",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3990.85,
    "end": 4018.714,
    "text": " uh into something that makes sense for us to you know in terms of interpreting the stimuli in terms of perceiving the stimuli and then acting on the stimuli after uh you know facilitating uh okay how you know in the pers in in the perceiving of the stimuli what's the best what's the most optimal manner i can act on the stimuli and then having a history of okay well",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4020.128,
    "end": 4023.911,
    "text": " I perceived the stimuli this way and I acted on it this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4023.951,
    "end": 4024.852,
    "text": "This is what happened.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4024.872,
    "end": 4028.375,
    "text": "Okay, well, the outcome might have been good or might have not been good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4028.475,
    "end": 4050.034,
    "text": "So now I'm going to anticipate how to perceive and act based on the outcome that may or may have not been good in terms of how my capacity to evaluate when we talk about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4051.229,
    "end": 4070.612,
    "text": " let's see, um, my capacity to evaluate the, the stimuli is reflective of, of like, okay, well, uh, I don't want to call it trial and error here, but this is kind of how we're getting to the guided random search aspect, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4070.732,
    "end": 4077.861,
    "text": "That there are, there are, there is a combination of ways that we take the re the, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4079.174,
    "end": 4085.643,
    "text": " that we take the reductions of the sensations that build into information, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4085.743,
    "end": 4098.921,
    "text": "And then we, that become information, like this reduction of generalizations of sensations that become information based on how we're prioritizing that due to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4098.901,
    "end": 4110.398,
    "text": " how we select out perceptions and actions and priors that optimize our fitness based on how we're engaging with our environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4111.58,
    "end": 4121.635,
    "text": "So like the guided aspect is prioritizing what's working as opposed to what's not working and the random",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4121.615,
    "end": 4129.262,
    "text": " aspect has to do with okay well the sensations as we you know we reduce the info when we reduce",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4130.272,
    "end": 4155.925,
    "text": " the amalgamation of sensations that ultimately, like I mentioned, are stimuli that we're being bombarded with, though the aspects of those sensations really are uniform in the sense that those, you know, when we don't really prioritize those sense, you know, once like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4158.25,
    "end": 4172.714,
    "text": " Before those sensations develop any relevancy as information, the environment doesn't really necessarily dictate what sensation, what stimuli have priority.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4172.754,
    "end": 4177.542,
    "text": "The stimuli just present themselves as stimuli.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4177.522,
    "end": 4195.665,
    "text": " to our system and then it's up to us based on how we perceive and act and anticipate the stimuli on how to how to it's up to us to prioritize that that stimuli which",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4195.645,
    "end": 4224.657,
    "text": " uh which in uh in the bare bones aspects of that stimuli outside of our judgment you know outside of our own judgment which involves perceiving acting and anticipating is random because nature doesn't really care you know um nature doesn't really care about you know reg you know necessarily selectively regulating the stimulus outside of the agents",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4224.856,
    "end": 4231.052,
    "text": " like the environment, the bare environment doesn't care about the agents",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4231.673,
    "end": 4245.166,
    "text": " among that environment are going to engage with the environment in a way that prioritizes stimulus and guides the agents to engage with each other and the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4245.667,
    "end": 4251.132,
    "text": "And in that sense, the guided aspect is the prioritization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4251.172,
    "end": 4259.2,
    "text": "The random aspect is this uniformity that the bare bones stimulus presented in the environment among agents",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4259.18,
    "end": 4266.592,
    "text": " There's no there's, you know, until the agents start to prioritize the sensations as information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4266.632,
    "end": 4274.263,
    "text": "There's really there's really beyond there's really nothing more than this uniformity of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4274.304,
    "end": 4282.977,
    "text": "You know, there's nothing there's nothing really that that stands out about the stimuli until the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4282.957,
    "end": 4297.026,
    "text": " starts to make selective generalizations once the agent can notice patterns of stimulus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4297.628,
    "end": 4302.197,
    "text": "And those patterns would be information, and then the agent's going",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4302.177,
    "end": 4305.02,
    "text": " try to prioritize those patterns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4305.04,
    "end": 4313.449,
    "text": "So the search behavior now, the search behavior is recognizing the patterns and then the filtering aspect of the patterns, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4313.529,
    "end": 4318.575,
    "text": "So like I mentioned, the guided aspect has to do with the prioritization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4319.176,
    "end": 4329.467,
    "text": "The random aspect has to do with, okay, well, there's this uniformity in which the stimulus is provoking the agent to engage with the stimulus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4329.683,
    "end": 4349.45,
    "text": " And then it's up to the agent to kind of categorize and prioritize the stimulus and reduce it to information and then prioritize that information based on like what the agent thinks is necessary to pay attention to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4349.991,
    "end": 4359.184,
    "text": "And so the search aspect is like this paying attention, like the attentional dynamics involved with this prioritization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4359.164,
    "end": 4388.614,
    "text": " um so um now there's like i mentioned there's constraints within the environment that enable agents to to facilitate uh perception action and prior uh dynamics um in a way that would optimize fitness as opposed to um deceive fitness or or be counterintuitive to fitness",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4389.269,
    "end": 4413.471,
    "text": " and now okay well when we talk about homeostasis uh again the environment's not in a fixed static state dynamic uh agents aren't in a fixed uh fixed state right everything you know we have this complex adaptive system that is the environment and we also have this complex you know the nature of agents is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4413.451,
    "end": 4430.228,
    "text": " of agents invoking agency in the environment or trying to compensate for what the environment presents to agents as resources or obstacles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4431.811,
    "end": 4453.878,
    "text": " homeostasis has to do with then how do agents sustain a minimum viable functional integrity that is crucial to fitness to allow the agent to continue to exist rather than cease to exist, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4454.278,
    "end": 4458.223,
    "text": "So homeostatic regulation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4458.203,
    "end": 4479.199,
    "text": " is going to have to do with, and maybe some of you are thinking of the free energy principle in this respect, that agents want to minimize costs but maximize on opportunity to leverage optimizing fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4480.833,
    "end": 4483.299,
    "text": " Well, at least most agents want to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4484.081,
    "end": 4494.505,
    "text": "I mean, there are some aspects where I think where agents that have the capacity to annihilate themselves, which I don't think...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4494.839,
    "end": 4501.285,
    "text": " I think agents need a certain level of complexity to make that decision from the top down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4501.385,
    "end": 4522.804,
    "text": "So in that respect, the top down dynamics as opposed to the bottom up dynamics, you know, are much more crucial to facilitating the integrity of an agent because, you know, agents with enough sophisticated agency like human beings can decide to annihilate themselves, which is unfortunate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4522.784,
    "end": 4545.298,
    "text": " In most cases, I would say it's generally unusual for, and we're seeing this in the literature too, that it's unusual but it's interesting to know where circumstances arise where an agent makes the evaluation that they can't really optimize fitness",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4545.278,
    "end": 4563.728,
    "text": " any more than they have, so the most optimal decision for the agent is to decide for them to not exist anymore, which is unfortunate, but this also isn't uniquely human either.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4565.231,
    "end": 4569.818,
    "text": "There are other types of agents, other animals out there,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4570.372,
    "end": 4581.348,
    "text": " You know, when we think, again, we're thinking about agents as biological organisms here, you know, where an agent makes a decision that they can't really optimize fitness anymore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4581.488,
    "end": 4592.444,
    "text": "And the circumstances in which the environment provides any leverage of integrity is not really there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4592.565,
    "end": 4596.651,
    "text": "So the most optimal decision an agent can make is to annihilate itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4596.811,
    "end": 4598.353,
    "text": "But that's...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4598.333,
    "end": 4606.22,
    "text": " I'm not going to get really into that, but I think that's sort of an unfortunate circumstance for an agent to find themselves in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4606.34,
    "end": 4616.369,
    "text": "And and this pertains to probably, you know, more sophisticated agents, as I found in the literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4616.409,
    "end": 4616.47,
    "text": "OK.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4623.456,
    "end": 4625.758,
    "text": "See.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4628.894,
    "end": 4633.583,
    "text": " So we went over what stimulus is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4637.25,
    "end": 4643.882,
    "text": "And regarding, again, homeostasis, this builds on guided random search.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4644.267,
    "end": 4654.682,
    "text": " And the guidedness being the prioritization, the randomness being the uniformity in which stimulus provokes the agent and presents itself within the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4654.862,
    "end": 4661.972,
    "text": "And we acknowledge that stimulus is really anything that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4661.952,
    "end": 4667.582,
    "text": " that is provoking the agent to perceive, act, or anticipate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4667.682,
    "end": 4675.836,
    "text": "Anything that provokes an agent to perceive, act, or anticipate would be considered a stimulus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4677.298,
    "end": 4685.192,
    "text": "And prioritizing, where was I here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4692.8,
    "end": 4717.751,
    "text": " Being able to prioritize stimulus and for agents to minimize cost to engage with their environment and maintain like a minimally viable functional integrity that is crucial to fitness, this has to deal with homeostatic regulation or homeostasis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4718.352,
    "end": 4720.174,
    "text": "This is what I call homeostasis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4722.618,
    "end": 4739.335,
    "text": " And the environment presents means in which, on the one hand, can be resourceful for agents to regulate their fitness, while on the other hand, the environment might also present obstacles that could be problematic to regulating fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4746.022,
    "end": 4747.984,
    "text": "So, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4749.078,
    "end": 4763.874,
    "text": " We're going to talk more about the mechanistic interpretability explanation of the perception, action, and prior cycle, or what I call the PAP cycle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4765.116,
    "end": 4776.368,
    "text": "So a lot of you programmer types and engineering types are probably familiar or hopefully are familiar with the terms sensor,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4777.175,
    "end": 4806.253,
    "text": " and actuator so on the one so we could reduce all the all these behaviors of agents perceiving and acting on the environment as well as anticipating to be reduced to sensory and actuator based dynamics sensory sensors being to sensory mechanisms like uh recognizing and and and um communicating or signal you know recognizing and signaling",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4807.567,
    "end": 4826.192,
    "text": " You know, when we think about how neurons, neural and glial cellular networks work together, the sensor capacities have to do with interpreting a signal and passing that signal along to the right networks that then deal with that signal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4826.232,
    "end": 4834.063,
    "text": "And then you have this coupled capacity of sensory motor actions involved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4834.685,
    "end": 4836.708,
    "text": " that deal with the stimulus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4837.189,
    "end": 4839.432,
    "text": "So actuators have to do with acting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4840.033,
    "end": 4844.821,
    "text": "So like having an action towards the stimulus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4844.881,
    "end": 4860.085,
    "text": "So actuators having this actuation based mechanism has to do with responding to the stimulus while the sensors or the sensory capacities signaling",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4860.065,
    "end": 4886.241,
    "text": " uh certain you know the signaling and communication faculties that opt that enable uh perceptions and actions and anticipation dynamics to be optimized um you know certain networks of neural um there are certain uh there are neural and glial cellular networks that that uh interpret",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4886.221,
    "end": 4901.116,
    "text": " sensations and communicate what those sensations are, you know, and they signal to the networks that deal with the, with acting and responding to the stimulus, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4901.296,
    "end": 4914.81,
    "text": "And more so there's more, there's this coupled capacity of, you have these coupled sensor actuator based networks that, and compositions thereof.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4915.853,
    "end": 4924.27,
    "text": " that deal with handling stimulus and sensations and prioritizing the sensations into information and then so on and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4933.869,
    "end": 4937.997,
    "text": "And the sensor and actuator based",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4938.719,
    "end": 4965.773,
    "text": " mechanistic capacities, you know, you know, that, that we reduce this, you know, we, you know, basically this is, this is, this is a reduction of like, okay, we have these neural and glial networks that facilitate perception, action, anticipation, and we're trying to optimize for metabolic costs and facilitate cognitive load.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4967.002,
    "end": 4976.616,
    "text": " that leverages fitness rather than compromises fitness over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4978.139,
    "end": 4995.945,
    "text": "In the most realist, I guess in the most pragmatic sense, we think about this minimum viable means in which an agent optimizes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4996.82,
    "end": 5008.609,
    "text": " how it calibrates cost of metabolic load with regard to facilitating functional integrity or homeostatic regulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5011.175,
    "end": 5012.719,
    "text": "So hopefully that makes sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5014.319,
    "end": 5025.273,
    "text": " So we could think of like when I mentioned goal directed behavior, there's this coordination of micro and macro levels of how we as multi agent systems facilitate that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5025.333,
    "end": 5025.573,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5025.593,
    "end": 5032.302,
    "text": "So we think from the bottom up, we have metabolic load handling or facilitation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5032.322,
    "end": 5035.686,
    "text": "And from the top down, we have cognitive load.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5036.037,
    "end": 5065.977,
    "text": " handling right we're thinking about how cognitive load is mitigated due to how metabolic load plays out as cognitive load it really is a subset of metabolic load because you need you need you need metabolic costs to facilitate everything that an agent does like without being able to uh metabolize the the agent just wouldn't exist it wouldn't be able to continuously engage with with its environment because it needs resources like the agent needs",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5065.957,
    "end": 5084.218,
    "text": " uh fundamentally one of one of the fundamental goal goals of the agent is to consume resources whether that that's food water you know think about human behavior we think about food water sleep um that involves the consumption of metabolic load",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5085.278,
    "end": 5112.349,
    "text": " And then, uh, of course other, you know, you know, other means like using tools that, um, extensively enable us to better leverage fitness and how we engage within our environment and other agents is, is also important, but that's more, more secondary, uh, in terms like, um, you know, like tool use and, and, and augmentation and development or of, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5114.219,
    "end": 5127.002,
    "text": " is not as crucial as, as maintaining like a metabolic load is in terms of, of, of, of food, you know, consumption of food and water and being humans like to, to regulate that fundamentally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5127.183,
    "end": 5127.283,
    "text": "Yeah."
  },
  {
    "start": 5134.3,
    "end": 5150.421,
    "text": " So we can think of like on the macro level, cells represent, you know, as multi-agent systems on the macro level, you know, cells can represent whole organ systems and subsystems that regulate from the bottom up as opposed to the top down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5150.481,
    "end": 5159.312,
    "text": "And then from the micro level, we think about how the individual cells as individual unit agents engage with each other because we ourselves,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5159.292,
    "end": 5166.68,
    "text": " Even though we are agents, we are a whole environment and ecosystem thereof of agents communicating with each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5167.101,
    "end": 5173.327,
    "text": "That enables our own agency and our own capacity to communicate the environment in which we're embedded.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5173.688,
    "end": 5184.76,
    "text": "We have agents embedded within us and then we are also embedded within an environment in which we have agency and that is constrained due to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5184.74,
    "end": 5200.748,
    "text": " the resources and obstacles that the environment presents, or the resources and obstacles that are existent within the environment that we have constrained access to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5200.788,
    "end": 5208.081,
    "text": "And then the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5210.17,
    "end": 5216.844,
    "text": " There's also the, this is not talked about that much in the literature, but there's also the meso level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5217.004,
    "end": 5229.85,
    "text": "So we talked about the micro level where we have the individual unit agents within our organism as a multi agent system, how those agents communicate with each other, but on the macro level,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5229.83,
    "end": 5232.557,
    "text": " We have the different subsystems communicating with each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5232.618,
    "end": 5245.392,
    "text": "And even on the macro level, we're thinking about the top-down dynamics of regulating executive function, which also considers the macro level about how networks of neural and glial cells are communicating with each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5246.452,
    "end": 5248.475,
    "text": " But we also have this mezzo level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5249.176,
    "end": 5274.771,
    "text": "And this mezzo level, we can think about how selective, more so when we're thinking about the top-down regulation of agency, we're thinking about how different sub-regions of our nervous system or our executive functioning are regulating agency, our capacity to continuously engage",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5276.152,
    "end": 5278.315,
    "text": " with our environment in an optimal fashion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5278.375,
    "end": 5301.962,
    "text": "So thinking from the meso level, do you think we can think about how different regions of the brain are working together to evaluate perceptions, actions, and priors, like the prefrontal cortex, the reticular formation, the hippocampus, the amygdala?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5302.002,
    "end": 5304.285,
    "text": "How are all these subsystems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5304.265,
    "end": 5325.818,
    "text": " of neural and glial cellular networks facilitating engagement like we're going from the more macro level of the central nervous system to not necessarily the micro level of the individual neurons and glial cells but we're also talking about how different how different coupled networks",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5325.798,
    "end": 5332.611,
    "text": " of these neural and glial cells of these different regions are facilitating lateral engagement with each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5332.691,
    "end": 5341.347,
    "text": "So I think it's important also for those of you who don't necessarily have a neuroscience background or psychology background.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5343.411,
    "end": 5344.313,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5344.748,
    "end": 5372.106,
    "text": " no no one region of the like one like all the regions of the brain first of all are are communicating laterally in the sense that they're communicating they're engaging in parallel processing stimuli and sensations and what have you and information right no one region is responsible like you know the hippocampus uh doesn't doesn't store and and you know even though like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5372.086,
    "end": 5394.55,
    "text": " the hippocampus is largely recognized as the memory storage system the way it stores and and references information it needs to work with the amygdala the thalamus it has to work with the reticular formation because um it has to work with the prefrontal cortex um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5395.34,
    "end": 5402.122,
    "text": " So no one region is processing these sensations at one point or momentarily in time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5402.222,
    "end": 5407.459,
    "text": "And in an interesting way, we're going to get",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5407.844,
    "end": 5415.855,
    "text": " get to what is necessarily interesting about how our brains are structured.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5416.556,
    "end": 5432.518,
    "text": "And that's not necessarily hierarchical, although it's mostly hierarchical in the sense of prioritizing stimulus and sensory information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5433.359,
    "end": 5450.068,
    "text": " how that processing and prioritizing builds out over time in terms of how we, as these biological organisms, as agential multi-agent systems evolved,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5450.048,
    "end": 5480.055,
    "text": " um is not just hierarchical but um is uh there's this other term that is less familiar um so on on the on the one hand we have this prioritization or or what can be deemed as hierarchy of like of prioritizing uh of sensations and and what have you on the other hand there's the tuning aspect right like sort of like as we're prioritizing and selecting out",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5480.035,
    "end": 5500.425,
    "text": " as stimuli loads and as sensations and information, there's also this aspect of sort of like tuning, you know, like, you know, kind of like, you know, if you think about like an audio mixer or a soundboard, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5500.445,
    "end": 5509.519,
    "text": "You want to get the right, you kind of want to, you want to kind of select out the right channels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5509.499,
    "end": 5539.287,
    "text": " of how stimuli and sensations are being prioritized and this is known as heterarchical processing h-e-t uh heterarchical h-e-t-e-r archical so i'm not going to spell the whole thing out but this is heterarchical processing and this term is actually brought out in um uh uh hubner and shulkin's biological cognition paper which i highly recommend",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5539.418,
    "end": 5550.154,
    "text": " And we're going to talk a little bit about this means of preserving viability,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5551.467,
    "end": 5557.174,
    "text": " which is pretty important to how agents engage with each other to optimize and leverage fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5557.194,
    "end": 5559.317,
    "text": "We're going to talk about that momentarily.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5561.139,
    "end": 5570.191,
    "text": "But so there's this hierarchical capacity in which the regions of our brain are prioritizing stimulus, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5570.811,
    "end": 5578.401,
    "text": "And in that prioritization and selecting out the stimulus, there's this tuning coming.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5578.421,
    "end": 5580.023,
    "text": "There's this kind of like this...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5580.003,
    "end": 5583.667,
    "text": " channel tuning mechanism, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5583.687,
    "end": 5609.318,
    "text": "Like trying to just get the, you know, trying to prioritize the stimulus just the right way involves like sort of like a selective pressuring that's not necessarily hierarchical, but it's also like a little bit more, it's sort of like there's degrees of freedom in which we try to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5609.298,
    "end": 5621.364,
    "text": " calibrate the channels in which those sensations are being prioritized as information, and then that information is being selectively prioritized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5621.384,
    "end": 5624.05,
    "text": "So this is known as heterarchical processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5625.447,
    "end": 5641.532,
    "text": " um but largely speaking what's happening is hierarchical because that the actual prioritization of sensory modalities that's hierarchical but that can't happen without calibrating",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5642.052,
    "end": 5645.677,
    "text": " the sensations and information to be processed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5645.697,
    "end": 5651.104,
    "text": "This calibrating aspect is heterarchical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5651.164,
    "end": 5653.747,
    "text": "Think about a mixing board or a soundboard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5653.767,
    "end": 5671.57,
    "text": "I don't know how many people are into DJing or producing music or what have you, but if you play with a soundboard and you're trying to get the right sound to come out, and you're trying to get the channel properties, you're trying to tune the channels and all that stuff,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5671.55,
    "end": 5683.568,
    "text": " This is hyperparameterized tuning processing of the top-down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5684.155,
    "end": 5688.481,
    "text": " Right, like the idea of parameterizing the sensations, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5688.501,
    "end": 5711.952,
    "text": "Like when we're trying to facilitate the parameterization of, okay, the stimuli coming in and our perceiving and acting on that stimuli, the parametric tuning that has to facilitate the prioritization, that is the heterarchical processing that's happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5716.606,
    "end": 5745.702,
    "text": " Okay, so there's, on the one hand, there's what's happening with perception actions and priors is this introspective capacity of trying to interpret stimuli and then this reactive capacity, this proprioceptive capacity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5747.099,
    "end": 5768.297,
    "text": " of aligning our perceptions and actions uh with with how we anticipate right so so our so so in terms of not only our our um well this is in due part to to the top down functioning but this and this this really calibrates",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5768.277,
    "end": 5789.458,
    "text": " our capacity to not only interpret but react and react to stimuli in a sense of predicting what's going to happen going forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5789.438,
    "end": 5797.396,
    "text": " that would be more in the proprioceptive sense of dealing with the stimulus over time to optimize fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5797.756,
    "end": 5804.832,
    "text": "So on the one hand, there's this capacity in which, especially with decision making,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5805.588,
    "end": 5820.53,
    "text": " where we try and make sense of what we ought to do, how we perceive and act on the stimulus, and then our continued actions going forward in time has to do with proprioceptive capacities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5822.533,
    "end": 5834.43,
    "text": "So this capacity, the means in which to regulate perception and actions based on anticipations,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5835.541,
    "end": 5863.489,
    "text": " going into the future and how how how in terms of bodily functioning like just just how i engage with the stimulus in in a way that becomes more that feels more intuitive um this is a proprioceptive capacity as opposed to more introspective capacity of uh of of in trying to interpret and understand the stimulus and and and and making a decision that might be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5863.469,
    "end": 5872.502,
    "text": " and making decisions that might reflect what could happen in the future, then there is the happening of the future, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5872.522,
    "end": 5884.42,
    "text": "And the alignment of that happening in the future that is in line with anticipation has to do with proprioception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5888.566,
    "end": 5891.35,
    "text": "Okay, let's see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5895.43,
    "end": 5924.509,
    "text": " um i don't want to speak too confident confidently about about the main regions of the brain coordinating uh coordinating our capacity of perception actions and priors but i'll i'll i'll bring some some key some regions that have caught my eye um there's a bit of contention in terms of what are the key regions that are responsible for our capacity proceed act and anticipate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5925.907,
    "end": 5933.075,
    "text": " The most evolved capacity that really sets humans apart has to do with the prefrontal cortex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5933.095,
    "end": 5938.08,
    "text": "So that deals a lot with planning and perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5938.2,
    "end": 5947.009,
    "text": "A lot of the modalities in which planning in terms of perception and goal-directedness has to do with the prefrontal cortex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5948.391,
    "end": 5954.277,
    "text": "The anterior cortex has more to do with the sensory motor functioning",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5954.257,
    "end": 5964.671,
    "text": " Now, what's less talked about in the literature is the role of the reticular formation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5964.811,
    "end": 5966.153,
    "text": "So that's your brainstem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5966.233,
    "end": 5970.218,
    "text": "So the reticular formation has to do with autonomic arousal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5970.438,
    "end": 5974.864,
    "text": "So this like the capacity to even",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5976.16,
    "end": 5978.985,
    "text": " engage with sensations at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5979.886,
    "end": 5982.671,
    "text": "It has to do with the reticular formation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5983.452,
    "end": 5996.734,
    "text": "And in particular, my favorite part of the brain is the locus coelus, also known as the LCNE system or what regulates norepinephrine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5996.714,
    "end": 6007.18,
    "text": " So autonomic arousal is pretty important because without it, like, we're not really engaging, you know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6008.476,
    "end": 6017.285,
    "text": " I mean, there's no means for stimulus to be interpreted and facilitated throughout the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6017.465,
    "end": 6034.062,
    "text": "So the norepinephrine system is allowing us to interpret this stimulus and guide that interpretation in terms of signaling all the different primary regions of the brain",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6034.042,
    "end": 6064.048,
    "text": " uh that are responsible for perception action and anticipation and now what i like to call the neuromorphic interchange is the limbic system now the limbic system is basically uh basically the region that encompasses like basically uh the the key regions of executive functioning so thinking about memory retrieval emotions um planning goal directedness um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6064.028,
    "end": 6066.152,
    "text": " sensory motor processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6066.552,
    "end": 6088.551,
    "text": "So the prefrontal cortex, at least most of the prefrontal cortex or the neocortex layer, the hippocampus, the amygdala, all those really important regions that are important for executive functioning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6088.531,
    "end": 6092.657,
    "text": " are guided by the limbic system, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6093.037,
    "end": 6096.722,
    "text": "Well, they're connected together by the limbic system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6096.842,
    "end": 6107.237,
    "text": "Like they facilitate each other's capacity due to being housed into this interchange that facilitates their engagement, which I call the limbic system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6110.301,
    "end": 6112.564,
    "text": "And let's see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6133.402,
    "end": 6136.868,
    "text": " All right, going to the next section.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6138.591,
    "end": 6141.596,
    "text": "Sensations are fundamental to perception, action, and anticipation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6141.616,
    "end": 6144.661,
    "text": "I think I covered most of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6149.429,
    "end": 6158.464,
    "text": "So this idea of generalizations of sensations is this feeding of stimulus",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6160.216,
    "end": 6175.93,
    "text": " as inputs into our multimodal way of engaging with the stimulus has to do with this generalization of sensations in which",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6175.91,
    "end": 6191.64,
    "text": " that the stimulus is fed into the system initially and this is this is a this is the visceral uh this is this is the visceralness of the stimulant the the viscerality against viscerality is the right word uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6191.62,
    "end": 6221.61,
    "text": " so the means of internalizing the stimulus is this generalization of the stimulus itself right which is visceral in natural right like think about like when we think about visceral like think about how blood flow is just naturally happening like throughout your body or certain like even metabolic uh metabolic processing um when we think about uh the uh uh the um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6223.767,
    "end": 6251.732,
    "text": " glycolysis and all these different behaviors that happen that that regulate metabolic processing cellular respiration right all like stuff that's just constantly happening that that that regulates metabolic load uh this like that's generally pretty you know that that that um like the like these behaviors that that aren't really particularly that interesting that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6252.37,
    "end": 6264.017,
    "text": " that correlate directly to our executive top-down functioning, this can be recognized as visceral processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6266.326,
    "end": 6287.293,
    "text": " of like stimulus that isn't, that's just constantly happening or this processing, this load processing that's constantly happening, that's not that interesting, but it's kind of fundamental to like our continuous engagement with the environment as agential systems is regulated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6287.333,
    "end": 6292.62,
    "text": "That's what we can denote as visceral processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6295.418,
    "end": 6320.27,
    "text": " And this internalization of stimulus with respect to environmental constraints, of course, has to do with, you know, we're filtering the noise in this generalization of sensations, like this capacity of filtering the noise into becoming a means in which we can make sense of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6321.892,
    "end": 6324.295,
    "text": "So we prioritize that noise as information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6328.747,
    "end": 6337.423,
    "text": " And that eventually allows us to anticipate, you know, how should we perceive and act accordingly to the stimulus being presented to us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6342.191,
    "end": 6353.151,
    "text": "And then we have these recollection of experiences because we're able to anticipate based off of our history of perceiving and acting to stimuli.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6354.498,
    "end": 6363.754,
    "text": " Now here's where things get interesting because I'm about to talk about System 1 and System 2 coupled with the rider and the elephant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6364.235,
    "end": 6376.135,
    "text": "So System 1 and System 2 refers to Daniel Kahneman where System 1 has to do with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6377.684,
    "end": 6397.844,
    "text": " decisions and ways of engaging with our environment from a top-down level or an executive functioning level, which is more automatic and less involved, while system two has to do with non-trivial or problem-solving circumstances, which take more effort.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6398.485,
    "end": 6407.674,
    "text": "So now that has to do with reasoning and how we optimize engagement with our environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6408.11,
    "end": 6416.263,
    "text": " Now, we couple this capacity with Jonathan hates the rider and the elephant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6417.003,
    "end": 6445.069,
    "text": " And the reason why this is of interest is, especially with System 2 processing, we use emotional valence processing or emotions, these feelings, the feelings we get from the generalization of the sensations that we have as these embodied",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6445.049,
    "end": 6453.338,
    "text": " as these embodied beings, but as agent ruled systems, our engagement is embodied, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6453.358,
    "end": 6470.095,
    "text": "This capacity to generalize sensations as agents is embodied, which this is what really separates us from classical machines or just these closed loop circuits.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6470.075,
    "end": 6480.589,
    "text": " And I would argue additionally that the way that we perceive, act, and anticipate is not necessarily a closed loop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6482.371,
    "end": 6489.18,
    "text": "It's sort of like an open system, but it's not, it's like a bounded open system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6491.002,
    "end": 6497.01,
    "text": "We'll get into that a little bit soon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6499.505,
    "end": 6505.017,
    "text": " What's interesting about, so talking about the rider and the elephant, I need to elaborate on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6505.137,
    "end": 6511.231,
    "text": "So system one, system two, system one is like kind of automatic, doesn't take too much effort to make a decision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6511.271,
    "end": 6516.081,
    "text": "And system two, it takes a little bit of effort.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6516.241,
    "end": 6517.885,
    "text": "It's non-trivial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6517.865,
    "end": 6529.839,
    "text": " Now the rider and the elephant, the rider is like the voice of reason while the elephant is like the experiencing, like the feeling states, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6529.9,
    "end": 6534.605,
    "text": "So one can only imagine an elephant going rampant in the village, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6534.685,
    "end": 6539.451,
    "text": "Like the rider doesn't have a good grip of the elephant, the elephant just go crazy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6539.431,
    "end": 6557.068,
    "text": " So I coupled this idea of the rider and the elephant with System 1 and System 2 because, especially with System 2, you need a non-classical logical solution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6558.263,
    "end": 6584.338,
    "text": " uh system reduction way to uh take uh uh feeling states emotion states in where uh decisions are not are not trivial or or they're not like they're these non there's these non-linear non-trivial circumstances in which we have to make decisions or make predictions or or you know like how we engage with stimulus and how we try to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6584.318,
    "end": 6604.352,
    "text": " make make anticipations of how should we perceive an act going forward into especially the distant future right that it could be a big deal in terms of leveraging fitness so um so that so this uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6607.91,
    "end": 6631.116,
    "text": " So what happens here where decision making is not so intuitive is we can try and figure out a way to have decision weights as criteria to evaluate decisions where there is some uncertainty involved, where we're not certain how things are going to pan out and we have to anticipate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6631.096,
    "end": 6635.703,
    "text": " as agents, how should we engage optimally with our environment?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6635.824,
    "end": 6644.858,
    "text": "So emotions play a role in this capacity where decision-making is non-trivial, non-linear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6645.82,
    "end": 6650.968,
    "text": "And there's this generalization of feeling states, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6650.988,
    "end": 6655.315,
    "text": "When we're talking about generalization of sensations,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6655.767,
    "end": 6676.122,
    "text": " So first we have to consider that raw sensations have to be processed by specialized regions of our executive functioning that deal with memory consolidation regarding optimizing priors as well as emotional valence processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6676.507,
    "end": 6680.132,
    "text": " So affective processing is involved here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6681.494,
    "end": 6703.948,
    "text": "So what happens is sensations become these streams of information that are comprehensible for modes of reasoning and emotion valence weighting that can more optimally guide perceptions and actions on priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6705.43,
    "end": 6721.245,
    "text": " What can be understood as emotions then would be this emotional valence weighting on generalized feeling states that is separate but necessarily",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6721.225,
    "end": 6727.594,
    "text": " is separate but necessary for optimizing rationale and accordance to decision making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6727.614,
    "end": 6734.144,
    "text": "So we have this interwovenness of reasoning and emotions or feelings, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6734.685,
    "end": 6742.997,
    "text": "And emotions kind of provide a means to weigh decisions that are especially more difficult",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6743.99,
    "end": 6760.868,
    "text": " where it's not obvious how we should anticipate what's going to happen in the future and just how to guide our behavior, especially in moments of uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6769.454,
    "end": 6781.891,
    "text": " And it could be argued that consolidation of memories would be largely compromised if emotions did not provide emphasis on how memories are referenced in the first place, because you need a reference pointer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6782.071,
    "end": 6797.031,
    "text": "And that's what these emotions themselves, like these emotion weights themselves, function as like a reference, a point of reference in how we rationalize our perceptions and actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6798.479,
    "end": 6800.562,
    "text": " based on how we anticipate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6804.106,
    "end": 6821.668,
    "text": "So in accordance to that, if memories cannot be properly referenced on weighing decisions, then how can we optimize perception and action according to minimizing, compromising fitness, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6821.648,
    "end": 6847.268,
    "text": " uh that that would that's a that's quite an existential question like if we didn't we weren't capable of emotions on some level like how we carry baseline decisions that allow us to effectively anticipate what what do we do next based on our environmental circumstances right um maybe that's not super intuitive but to me that that kind of is um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6848.53,
    "end": 6852.395,
    "text": " So we talked about System 1, System 2, and the rider and the elephant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6853.296,
    "end": 6860.426,
    "text": "We talked a bit about hierarchical and heterarchical processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6860.846,
    "end": 6866.554,
    "text": "So again, hierarchy has to do with prioritizing stimulus and information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6866.614,
    "end": 6878.149,
    "text": "And heterarchy has to do with how we parameterize it, how we select it out in association with the prioritization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6878.399,
    "end": 6880.083,
    "text": " So they're kind of coupled together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6880.504,
    "end": 6894.417,
    "text": "But of course, priority is what, the priority is what matters, even though we select out certain perceptions and actions in accordance to how we're optimizing our engagement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6901.265,
    "end": 6908.905,
    "text": " And hopefully I elaborated that clearly, but I could always go back to that a little bit later if there's questions about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6909.286,
    "end": 6909.707,
    "text": "Let's see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6909.747,
    "end": 6911.391,
    "text": "Relativistic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6911.431,
    "end": 6912.654,
    "text": "I'm going to skip this section.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6912.674,
    "end": 6915.642,
    "text": "Core regions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6916.304,
    "end": 6916.705,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6916.905,
    "end": 6917.687,
    "text": "So.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6918.73,
    "end": 6929.752,
    "text": " This is probably one of my favorite parts of the paper right here is talking about reality as an interface or reality is an interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6930.373,
    "end": 6937.988,
    "text": "And this is kind of, this gained a lot of popularity in Don Hoffman's collaborative paper with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6937.968,
    "end": 6957.073,
    "text": " with Chris Fields and Chetan Prakash, especially elaborating on like the boundary, you know, we're talking about perceiving and acting and how agents are, you know, agents have a boundary within the environment they're engaging with, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6957.053,
    "end": 6986.368,
    "text": " but even more interesting that I make the case for is that agents themselves are existentially embedded within the environment that they're engaged in and this can argue I would say arguably this could extend to artificial artificial agents that they rely on some on resource leverage within the environment that they're engaging in for them to continue to exist or function right",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6988.795,
    "end": 7000.211,
    "text": " And now reality as an interface, we think about this, you know, this phenomenal capacity for us to engage with stimuli and react to it, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7001.293,
    "end": 7009.504,
    "text": "And this can, like, very deeply, you can really argue reality as an interface, like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7009.484,
    "end": 7031.236,
    "text": " deep down past the fact of organisms and talking about physics and just how space-time, the fabrication of space-time maintains itself, is that particles are interacting with each other in some capacity, even though they don't necessarily have any agency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7032.238,
    "end": 7035.222,
    "text": "But most importantly,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7035.202,
    "end": 7038.606,
    "text": " We as agents are constantly engaging with each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7038.626,
    "end": 7042.712,
    "text": "We're constantly interacting with each other, so to speak, in the phenomenal sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7042.732,
    "end": 7048.859,
    "text": "So that really has to deal with reality as an interface and extensive and building on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7048.919,
    "end": 7054.847,
    "text": "We talked, I mentioned axiomatic systems sort of as the reduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7055.519,
    "end": 7072.959,
    "text": " You know, we decompose sensations reductively, axiomatically, and we can relate that to David Wolpert's argument of talking about, okay, well, we base our reasoning on mathematics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7072.979,
    "end": 7078.725,
    "text": "Mathematics is based on axiomatic constructions of systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7078.705,
    "end": 7105.472,
    "text": " And we have base components that allow us to construct, to elaborate on properties of systems or construct systems compositionally in a number of ways based on like baseline rules, like for instance, considering the rules of arithmetic, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7107.713,
    "end": 7110.627,
    "text": " Let's see, is there something that I should?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7111.17,
    "end": 7114.365,
    "text": "We talked a bit about guided random search.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7120.437,
    "end": 7142.614,
    "text": " So this idea of abstract reasoning is rooted axiomatically because making decisions involves, again, trying to make sense of the sensations that we're trying to generalize, and we're trying to prioritize those sensations as information, and then we try and prioritize that information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7144.788,
    "end": 7150.984,
    "text": " to make sense of the world around us in which we're constantly interfacing and engaging with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7168.008,
    "end": 7193.188,
    "text": " So now we come to an interesting dilemma of when we deal with this understanding of, OK, well, we're constantly engaging with the world around us and we can decompose our engagement axiomatically, so to speak, especially when we try to reduce sensations and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7194.502,
    "end": 7207.375,
    "text": " we try and figure out how to filter those sensations into information and prioritize that information based on how we prioritize sensations as information, then we're prioritizing the information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7207.415,
    "end": 7211.245,
    "text": "Okay, well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7212.76,
    "end": 7223.814,
    "text": " In mathematics, there's this hole that is brought about due to Kurt Gödel's incompleteness theorems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7225.436,
    "end": 7242.717,
    "text": "Not really going to get that into that, but what really should be... What should be the moral of the story is that the lack of consistency",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7243.878,
    "end": 7269.075,
    "text": " in how we construct, you know, in the sense of how Gödel uses the axioms of arithmetic as an example and trying to map those axioms to how we construct the natural numbers, there's inconsistencies",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7269.747,
    "end": 7274.593,
    "text": " that he presents in that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7277.071,
    "end": 7301.408,
    "text": " And I guess this more so, you know, this sort of provides an insight into the inconsistency in how we generalize sensations as information, and then we try and generalize information and try and have a consistent interpretation of reality, which",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7301.388,
    "end": 7320.055,
    "text": " In the illusionist sense, you could argue that we never have a true representation of reality, but enough of us can come to an agreement on some representation,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7320.035,
    "end": 7334.095,
    "text": " of reality based on how we formally represent models of the world around us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7334.648,
    "end": 7354.79,
    "text": " in terms of making predictions about how certain aspects of reality works, how certain aspects of the environment, how do we generalize ways in which we can engage with the environment, not for ourselves, but to facilitate cooperation with other agents, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7354.85,
    "end": 7357.433,
    "text": "Like if there are means in which",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7357.413,
    "end": 7364.943,
    "text": " we can collectively come to some agreement that makes sense in the moment, and then there's a better way to make sense of it in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7365.864,
    "end": 7379.623,
    "text": "More so the illusionist aspect is that we're not going to, you know, we would be deluding ourselves if we truly thought, like, understood reality for what it is, rather than really",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7379.603,
    "end": 7395.182,
    "text": " uh generalizing uh certain features of it that pertain to optimizing fitness and our survivability and our engagement so ultimately we're we're exploring",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7395.162,
    "end": 7409.897,
    "text": " our environment and we're just trying to optimize our fitness with respect to how we engage with each other and ourselves within the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7411.649,
    "end": 7424.041,
    "text": " And the inconsistency is the generalizations that we make that become replaced with better models in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7424.101,
    "end": 7439.597,
    "text": "So that's not necessarily the same exact reasoning that Kurt Gödel makes saying, well, we have this inconsistency of mapping",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7441.012,
    "end": 7459.527,
    "text": " the properties of arithmetic in which we can compose certain systems with arithmetic and map that to natural numbers for which we assign each composition that we come up with using arithmetic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7459.507,
    "end": 7481.7,
    "text": " uh as uh some um iteration within the natural numbers and then we come to some property that says that uh this property disproves that this prop this property shows that um this isn't true uh well uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7484.279,
    "end": 7495.717,
    "text": " Yeah, you come to a property that shows inconsistency saying, okay, well, this isn't true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7495.777,
    "end": 7503.148,
    "text": "How did it go?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7507.212,
    "end": 7526.132,
    "text": " Basically, you bump into a problem where you eventually formalize a condition that is a contradiction, saying that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7527.985,
    "end": 7542.764,
    "text": " It's escaping me right now, but essentially you bump into a formalization of a contradiction within trying to compose conditions that are consistent with the axioms of arithmetic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7542.824,
    "end": 7550.314,
    "text": "But anyway, that's kind of outside of the scope of this presentation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7551.037,
    "end": 7561.816,
    "text": " The whole point about inconsistency is that we're constantly generalizing how we're engaging with the world around us as agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7565.403,
    "end": 7567.086,
    "text": "Okay, you're right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7568.849,
    "end": 7575.441,
    "text": "Basically, a girl came up with a condition that said,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7576.602,
    "end": 7585.655,
    "text": " Like, this card proves that this condition proves that it's false.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7586.056,
    "end": 7588.485,
    "text": "Otherwise, it's true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7589.123,
    "end": 7600.059,
    "text": " So you have a condition that proves that something is not untrue, but it's also true that it's not true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7600.139,
    "end": 7603.644,
    "text": "That's the contradiction in a nutshell.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7604.004,
    "end": 7607.61,
    "text": "That's not exactly how he phrased it, but I'm like talking off the top of my head.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7609.152,
    "end": 7611.435,
    "text": "But you basically arrive at a contradiction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7612.124,
    "end": 7626.442,
    "text": " And kind of sort of relating that back to how we generalize sensations and information is we never have a completely consistent picture of reality, especially how we engage with it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7626.462,
    "end": 7634.352,
    "text": "And we're constantly reformulating how we interpret our reality for what it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7636.711,
    "end": 7650.81,
    "text": " And that itself is the illusion, not that reality isn't an illusion, but our understanding of reality is elusive because we're constantly generalizing what reality really means.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7658.4,
    "end": 7661.824,
    "text": "I think we're ready to talk about preservation of viability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7667.66,
    "end": 7687.287,
    "text": " Okay, so this is where, and I'd spend a lot of time in this paper talking about interagent dynamics in terms of how cooperation is essential for how we even got to modern civilization as humans.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7688.208,
    "end": 7696.519,
    "text": "If we didn't cooperate well enough together, we just wouldn't have gotten, we wouldn't have Zoom calls, we wouldn't have gotten to where we are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7696.499,
    "end": 7708.697,
    "text": " there was not some sufficient means in which we cooperated with each other effectively as sufficiently large groups of humans.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7709.097,
    "end": 7725.561,
    "text": "And this goes back to this preservation of viability, which really has to do with how we consider trade-offs in engaging with our environment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7725.794,
    "end": 7741.214,
    "text": " While also we consider how we engage with each other and recognize and have this awareness of our own degrees of autonomy with respect to other humans as agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7741.315,
    "end": 7745.44,
    "text": "But we aren't the only agents that exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7745.42,
    "end": 7746.522,
    "text": " within the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7746.542,
    "end": 7769.841,
    "text": "There are other agents that aren't humans that don't have the degrees of autonomy that humans have and we ought to acknowledge their existence as well and try to acknowledge the trade-offs in optimizing how we engage with the environment and other agents that aren't humans that I kind of call lesser agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7771.238,
    "end": 7779.034,
    "text": " That they don't necessarily have the same degree of autonomy to engage with the environment around them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7779.054,
    "end": 7781.118,
    "text": "And I'm going to get into that in a moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7782.721,
    "end": 7791.238,
    "text": "But really, there's this idea of this optimal ebb and flow of guiding our priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7791.218,
    "end": 7798.89,
    "text": " which is not limited to individual fitness of us individually, but also how we engage with each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7798.97,
    "end": 7806.502,
    "text": "So there's this idea of interagent coordination that ought to be facilitated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7808.565,
    "end": 7814.695,
    "text": "And we can think about this in a diplomatic sense of like how we engage with each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7816.514,
    "end": 7826.089,
    "text": " And ultimately, this increases the well-being of each other and ourselves and our overall odds of survival.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7826.751,
    "end": 7840.092,
    "text": "And acknowledging that the dynamics of modern society itself, where we fluidly communicate with each other through evolution of language, technology,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7840.072,
    "end": 7848.673,
    "text": " and bartering would not be possible if we did not rely so much on how we coordinate and cooperate with each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7848.753,
    "end": 7855.65,
    "text": "That's critical to just how we got to where we are as human civilization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7856.812,
    "end": 7877.162,
    "text": " And engagement with each other not only increases our chances to optimize fitness, but it enables our capacity to further develop our awareness and means of engaging with our environment in a way that can become more optimized over time at scale, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7877.202,
    "end": 7885.654,
    "text": "Because more and more of us exist, we have to think about scaling, problems with scaling and how we collectively engage with each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7887.541,
    "end": 7906.444,
    "text": " and consider perception and actions of others, not just our own perception and actions and how we anticipate, but as collectively, how we all coordinate and cooperate in such a fashion to facilitate that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7911.368,
    "end": 7930.404,
    "text": " So there's this idea of co-inhabitants, and it's not just humans that exist on this planet, but there's other organisms that do not have the degree of autonomy of agency we have, but they serve a functional role within the ecosystem for us to exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7930.545,
    "end": 7931.807,
    "text": "So I'm talking about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7932.361,
    "end": 7942.776,
    "text": " all kinds of life, like plant life, not just animals, but plants, fungi, molds, like insects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7942.876,
    "end": 7953.671,
    "text": "If it wasn't for the existence of pollinators and all these different species of organisms, if they didn't exist, we wouldn't exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7953.791,
    "end": 7957.356,
    "text": "So we have to acknowledge",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7957.336,
    "end": 7963.426,
    "text": " that, you know, you know, this that we co-inhabit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7964.227,
    "end": 7972.4,
    "text": "And actually some literature that came out recently comes up with this term co-evolution that we co-evolved with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7973.041,
    "end": 7984.879,
    "text": "I don't use the term biosphere in my work other than the abstract, but we co-evolved with all these species that we co-inhabit the environment with and we're all embedded",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7986.378,
    "end": 7991.91,
    "text": " we're all essentially embedded within this ecosystem that we co-inhabit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7993.313,
    "end": 8003.695,
    "text": "I think there should be more awareness brought to that front in terms with how there's such an issue with human conflict and just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8004.502,
    "end": 8019.88,
    "text": " what I see as this bias of not really recognizing at scale that we ought to do more to work together and symbiotically coexist with our environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8022.243,
    "end": 8033.496,
    "text": "We ought to hold ourselves more accountable as a species because we have such degrees of agency and awareness that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8034.893,
    "end": 8042.786,
    "text": " that enables the potential for how we can cooperate and where that can lead us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8043.628,
    "end": 8049.518,
    "text": "I mean, it got humans to modern civilization, which I think is absolutely phenomenal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8050.72,
    "end": 8054.286,
    "text": "And we're going to get a little bit into that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8060.527,
    "end": 8069.074,
    "text": " But before I get into that, I want to talk a little bit about uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8070.736,
    "end": 8089.352,
    "text": "So this kind of goes back to leveraging guided random search, where there are moments with regarding to calibrating our perceptions with regard to next actions that we take in accordance to the past and present moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8089.332,
    "end": 8097.934,
    "text": " What could unravel in the future regarding optimizing our priors, especially when we're facing moments of uncertainty, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8097.954,
    "end": 8105.974,
    "text": "So this has to do with complications that happen with regulating system two dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8107.237,
    "end": 8116.017,
    "text": " And this in regards to non-triviality, non-linear evaluations of decisions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8117.58,
    "end": 8126.781,
    "text": "And this can complicate how we reason about the world around us and regulate our emotions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8128.702,
    "end": 8136.669,
    "text": " uh, and how we can persistently act effectively in a re in a way that's reinforcing our fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8137.331,
    "end": 8141.344,
    "text": "So persistent uncertainty, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8143.906,
    "end": 8158.014,
    "text": " that persistent uncertainty with respect to conducting the capacity to perceive and act effectively can hinder the efficiency in leveraging and reinforcement learning behavior, making us more immediately prone to acting maladaptively.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8158.054,
    "end": 8164.446,
    "text": "Error prone signaling of sterilizations of sensations becomes more prominent in the face of uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8164.426,
    "end": 8172.719,
    "text": " which can end up deceiving our senses instead of being able to effectively optimize our priors in the face of circumstance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8173.26,
    "end": 8192.391,
    "text": "So on the one hand, dealing with uncertainty involves novelty exploration where we try to improvise and figure out ways to how we can calibrate our perceptions and our actions with respect to optimizing our priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8196.134,
    "end": 8197.926,
    "text": " And then...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8199.88,
    "end": 8207.507,
    "text": " And, and that has to do with, with how we recall, like how, how we were engaging with our environment in the past, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8207.527,
    "end": 8229.027,
    "text": "We talk a lot about like anticipation with perspective, perceiving and acting and, and, uh, novelty really, um, you know, it's not just the improvisation, it's kind of being clever and, um, trying to experiment with ways to optimize fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8229.007,
    "end": 8232.79,
    "text": " in the face of uncertainty,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8239.958,
    "end": 8267.974,
    "text": " And this can be leveraged in the short term as well as the long term where novelty can be leveraged by considering how we recall experiences in dealing with circumstances that are either out of the ordinary or just by happenstance making a recollection from some point in the distant or not so distant past relative to perception that may aid in improvising against optimizing priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8267.954,
    "end": 8271.028,
    "text": " And we can consider this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8272.223,
    "end": 8300.56,
    "text": " uh an aha moment like oh i figured out what to do um so in terms of novelty exploration and you know finding yourself dealing with uncertainty um that that's one aspect of handling uncertainty another aspect of uncertainty is just be as unfamiliarity um like an agent being unfamiliar with circumstances uh they're just gonna be have this uh sense of unfamiliarity of what to do",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8300.54,
    "end": 8323.976,
    "text": " And maybe other agents could help facilitate that, that have experience in dealing with those circumstances that in accordance can help, you know, with cooperation can help the agent optimize those moments of uncertainty by becoming familiar or at least developing that familiarity themselves, which might be prompted by novelty exploration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8325.599,
    "end": 8326.26,
    "text": "Now,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8327.59,
    "end": 8339.22,
    "text": " down here so there's there's there's a couple uh there's two primary modes uh there's two there's uh how do i say this see",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8357.02,
    "end": 8382.859,
    "text": " Okay, so on the one hand, there can be a means in which there's problems interpreting what we can do, and from a perceptive point of view, that deals with interpretation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8387.108,
    "end": 8394.82,
    "text": " And this is, this has to do with, um, now when we consider problems with uncertainty, this is sort of kind of like the halting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8395.221,
    "end": 8405.337,
    "text": "I would, I kind of call it the halting problem of agency where an agent doesn't quite know what to do until they figure it out, or maybe they don't figure it out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8405.437,
    "end": 8408.582,
    "text": "And you know, that kind of dooms the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8409.323,
    "end": 8414.331,
    "text": "But, um, so on, from an interpretive point of view,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8416.589,
    "end": 8444.824,
    "text": " We can consider that there's problems with considering what decision to make in terms of the determinable sequence of actions in line with an agent's capacity to perceive their surroundings considering contextual variation of intrinsic and extrinsic value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8447.538,
    "end": 8462.8,
    "text": " So that has to do with interpretation being the problem of aligning, that aligns with uncertainty, that the agent is having a problem interpreting what to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8462.82,
    "end": 8469.63,
    "text": "On the other hand, there is this,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8480.36,
    "end": 8493.295,
    "text": " So interpretation has to do with problems with the agent perceptively reflecting on their priors moment by moment to understand what they ought to do to resolve problems with optimizing fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8494.336,
    "end": 8510.215,
    "text": "On the other hand, there's problems with functional capacities of dealing with uncertainty where the actions determined and executed upon moment by moment that fall in line with perception and alignment with priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8510.583,
    "end": 8524.888,
    "text": " that there's a problem with actions being selectively and sequentially carried out with regard to context moment by moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8524.928,
    "end": 8532.2,
    "text": "So on the one hand, uncertainty could be a problem with perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8532.24,
    "end": 8535.105,
    "text": "On the other hand,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8535.862,
    "end": 8549.061,
    "text": " uncertainty can also be a problem of functional capacities in terms of not just perception, but also how the agent ought to act with respect to the circumstances they're dealing with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8549.446,
    "end": 8570.318,
    "text": " and selectively carrying out certain sequences of actions moment by moment where they're kind of stuck trying to carry out the action as opposed to making a decision on how to interpret the circumstances they're in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8570.818,
    "end": 8577.208,
    "text": "On the other hand, they also have problems with acting on the circumstances they're in as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8579.011,
    "end": 8580.501,
    "text": " What else should I say?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8581.528,
    "end": 8583.3,
    "text": "There's something interesting to say on this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8595.11,
    "end": 8609.054,
    "text": " I mentioned that this is like the halting problem in terms of having difficulty perceiving or acting for the agent that compromises their fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8610.336,
    "end": 8618.991,
    "text": "The traditional sense of the halting problem is when there's problems where you condition an algorithm",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8618.971,
    "end": 8633.993,
    "text": " on certain inputs and you don't feed any information into a system for an algorithm to evaluate it, so it just waits.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8633.973,
    "end": 8660.824,
    "text": " uh for inputs to come in or or rather it just hangs there and it does and you know the system doesn't do anything it just is it's just waiting to engage uh with a user on this hand um uh the halting problem as i condone it to be is a problem with dealing with uncertainty where the agent just has problems perceiving uh understanding uh you know",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8661.968,
    "end": 8666.335,
    "text": " developing an understanding of how to make sense of the circumstances they're in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8667.657,
    "end": 8685.545,
    "text": "In an interpretive point of view, on the other hand, the agent also can have difficulty with carrying out how they go about their circumstances, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8687.508,
    "end": 8688.87,
    "text": "So hopefully that makes sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8692.259,
    "end": 8695.986,
    "text": " complications regarding uncertainty?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8696.047,
    "end": 8697.169,
    "text": "Let's see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8705.866,
    "end": 8712.259,
    "text": "Right, so not only is uncertainty",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8713.387,
    "end": 8739.124,
    "text": " deals with unfamiliarity where the agent is constrained to exploring novelty or novelty exploration but also um that the agent might just not be familiar with what to do and they just need to figure out what to do and that not that might not necessarily be novel for all the agents that are that have dealt with that circumstance but it could be just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8740.1,
    "end": 8764.453,
    "text": " novel for for the agent dealing with that circumstance and on on the one hand if they cooperate with another agent that understands what to do and that agent communicates what to do and that resolves that misunderstanding or um maybe sort of a novelty exploration since the agent figures out themselves so i guess you can call it a novelty exploration case",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8764.433,
    "end": 8781.278,
    "text": " uh in that sense and um this this has to do with um uh you know these moments of uncertainty deal with error proneness and compromise of system two dynamics right so let's see",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8784.008,
    "end": 8803.367,
    "text": " And uncertainty itself really arises from moments of ambiguity where information does not present enough clarity for the agent to perceive and act effectively in alignment with priors to optimize fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8808.241,
    "end": 8817.662,
    "text": " And I do kind of compare how that differs between computers, like how computing systems that we're familiar with is different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8818.023,
    "end": 8820.067,
    "text": "I'm not going to get too into that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8824.657,
    "end": 8826.722,
    "text": "So unlike, let's see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8829.318,
    "end": 8841.256,
    "text": " Okay, perceptions, actions, and alignment of priors become vulnerable to risk-taking behavior with respect to facing ambiguity as behavioral dynamics become a gamble on fitness of the agent in question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8841.296,
    "end": 8853.975,
    "text": "Risk-taking behavior, however, is not necessarily maladaptive in its nature, but is prone to compromise the agent's fitness in which the risks taken may likely become maladaptive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8854.04,
    "end": 8867.532,
    "text": " Given complications that happen with regulating rationale capacities and emotion throughput under moments of ambiguity, most especially for us human organisms become vulnerable to experience what is commonly known as anxiety.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8868.733,
    "end": 8872.096,
    "text": "So now I'm going to talk about anxiety.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8872.196,
    "end": 8876.06,
    "text": "I'm going to talk real quick about anxiety as a complication of ambiguity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8876.841,
    "end": 8884.047,
    "text": "And that really has to be, that's really worrying about what's going to happen in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8884.027,
    "end": 8885.35,
    "text": " largely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8885.39,
    "end": 8891.164,
    "text": "And being prepared to deal with those circumstances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8891.364,
    "end": 8897.158,
    "text": "So when an agent is in this dilemma of what it can do,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8897.915,
    "end": 8906.986,
    "text": " regarding future circumstances, then it's dealing with what I like to call anxiety.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8908.148,
    "end": 8910.751,
    "text": "That would be some anxiety.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8911.833,
    "end": 8912.433,
    "text": "Let's see here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8913.134,
    "end": 8919.282,
    "text": "Anxiety then would",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8919.785,
    "end": 8928.157,
    "text": " would be some level of behavioral fixation which permeates due to lingering uncertainty in calibrating perceptions and conducting appropriate next actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8928.217,
    "end": 8941.236,
    "text": "This permeation ultimately presents itself as layers of thought-based as well as compulsion-based complexes that complicate perception with respect to generalizing next actions and aligning priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8942.33,
    "end": 8957.841,
    "text": " Given that anxiety is largely psychological, the degrees of anxiety permeation are primarily due to nurture dynamics where we consider constraints with regard to environmental exposure that can hinder adaptation, most especially with regard to trauma response.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8959.762,
    "end": 8976.81,
    "text": " And so hypervigilance also complicates anxiety or rather oversensitivity in processing stimuli as well as overreactivity to responding to stimuli, which can be marginally rooted from physiological constraints.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8977.25,
    "end": 8983.761,
    "text": "Hypervigilance can also arise due to behavioral fixations arising from complications in nurture dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8985.209,
    "end": 8997.346,
    "text": " More concisely, hypervigilance presents itself as complex behaviors that enable our human organism to act on alert with regard to optimizing our perceptions, actions, and aligning priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8997.807,
    "end": 9002.253,
    "text": "Moments of hypervigilance can be useful when circumstances align well with fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9002.293,
    "end": 9014.811,
    "text": "However, hypervigilance may pose to be maladaptive when it becomes compromised, most especially due to problems with upbringing or overexposure to certain environmental stimuli triggers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9023.397,
    "end": 9026.522,
    "text": " So now we're going to kind of get into",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9027.211,
    "end": 9030.596,
    "text": " hyperarousal as opposed to hypoarousal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9030.656,
    "end": 9042.033,
    "text": "So sensory processing complications that pose problems in calibrating perception are largely due to moments of noise filtering from generalizations of sensations being over or undercompensated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9042.053,
    "end": 9055.834,
    "text": "So this overcompensation has to do with hypervigilance, while this undercompensation has to do with hypovigilance or hyperarousal as opposed to hyporousal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9062.328,
    "end": 9080.929,
    "text": " And overcompensation of sensory processing should, however, not be confused to be equivalent to some form of anxious behavior, but rather that moments of hyperarousal potentially complicates the permeation of how anxiety takes form and persists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9080.949,
    "end": 9082.531,
    "text": "And all right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9084.814,
    "end": 9092.082,
    "text": "Risk-taking behavior with respect to uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9094.458,
    "end": 9113.53,
    "text": " see so marginal risk is always associated with metabolic load demands and cognitive load demands um there's always some some risk associated with just engaging with with our with environment and uh you know trying to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9113.51,
    "end": 9125.221,
    "text": " prioritized resources and dealing with obstacles that that, you know, inevitably comes, you know, even risks that we're unaware of that we're unconscious of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9125.602,
    "end": 9140.496,
    "text": "And also, there's, you know, just given problems with cellular senescence and aging, and becoming more sub optimally fit in over time, and, you know, also presents risks, inevitably, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9143.311,
    "end": 9152.562,
    "text": " So here's an interesting bit I want to bring up regarding risk-taking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9153.622,
    "end": 9161.953,
    "text": " There is a fine line between risk-taking behavior associated with uncertainty and risk-taking behavior due to intentionally maladaptive behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9162.493,
    "end": 9171.485,
    "text": "Given that we associate risk-taking with perceptions and action based gambling on fitness, cognitive biasing is involved with evaluating these gambles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9172.145,
    "end": 9178.954,
    "text": "Fundamentally speaking, unless there is intention behind a particular agent deceiving itself, we consider",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9178.934,
    "end": 9199.575,
    "text": " such behavior to be risk associated with acting in accordance to uncertainty with respect to the agent in question clearly risk is associated with an agent's intentions be it self-deceptive or otherwise if there is marginal compromise to be considered in the case of optimizing fitness in some fashion regardless risk is inevitable",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9199.555,
    "end": 9217.043,
    "text": " to the well-being of agents as marginal compromise to fitness not only is pertinent based on executive functioning dynamics in System 1 and System 2 processes, but even metabolic load processing dynamics from bottom up that are not necessarily directly associated with executive functioning from the top down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9219.908,
    "end": 9225.377,
    "text": "And this is the second to last section I have to go over, reinforcement learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9229.778,
    "end": 9231.099,
    "text": " Let's see what I can pick out of here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9234.542,
    "end": 9239.086,
    "text": "This is really getting more really into reinforcement learning with regard to agency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9250.657,
    "end": 9257.743,
    "text": "So deterrence is something I realized I didn't really talk about deterrence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9260.305,
    "end": 9283.292,
    "text": " at least uh deterrent mechanisms so this is interesting uh given the the whole point of reinforcement learning behavior is to leverage perceptions actions and priors to optimize fitness uh a rather interesting expectation one ought to conjure is that reinforcement has much to do with deterrence from perceiving acting and anticipating maladaptively",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9284.69,
    "end": 9297.72,
    "text": " Deterrence, however, ultimately is not the goal of reinforcement learning-based behavior, but rather some reinforcement learning-based behaviors provide mechanisms of deterrence, but not all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9299.86,
    "end": 9316.794,
    "text": " most especially if a habitual behavior that was once reinforcement-based transitions into maladaptive behavior due to environmental constraints impacting the dynamics of an agent in question, and such behavior cannot provide a mode of deterrence, clearly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9317.395,
    "end": 9325.982,
    "text": "On the other hand, there can also exist reinforcement learning-based behaviors that act as modes of deterrence that become ineffective and thus transition to maladaptive behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9326.422,
    "end": 9329.665,
    "text": "Being able to align perceptions and actions with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9329.645,
    "end": 9336.517,
    "text": " regard to precautionary constraints that alert the aging question with regard to priors effectively demonstrates a mode of deterrence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9346.995,
    "end": 9353.627,
    "text": "OK, so here's something interesting about deterrence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9356.847,
    "end": 9372.588,
    "text": " And then I might go a little bit over language and how that's important to how we engage with each other in a cooperative fashion that got us as humans to where we are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9374.35,
    "end": 9377.855,
    "text": "But so I just want to close off deterrence here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9377.915,
    "end": 9381.179,
    "text": "Let's see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9385.124,
    "end": 9385.605,
    "text": "OK.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9391.205,
    "end": 9394.048,
    "text": " I'm going to try and wrap up this whole section.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9396.891,
    "end": 9413.229,
    "text": "Certain reinforcement learning-based behaviors may not have precautionary constraints aligned to them, although may momentarily leverage fitness due to opportunities in which the agent in question does not incur fitness penalties with regard to assessing metabolic and functional risk that compromise overall integrity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9413.249,
    "end": 9420.857,
    "text": "Additionally, while agents may be aware of modes of deterrence, they may be intentionally oblivious to them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9420.837,
    "end": 9441.917,
    "text": " With regard to agents being intentionally self-deceptive towards modes of deterrence, the purpose of doing so involves fitness trade-offs, which in large part not only encourages marginal risk associated with fitness penalties over time, but also tends to be optimized with regard to anticipating a trade-off in which the agent in question is convinced will pay off in the short term or long term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9442.336,
    "end": 9451.806,
    "text": " Where things go awry with such self-deception and other means of self-deception varies with regard to the magnitude of maladaptive behavior being enacted by the agent in question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9451.887,
    "end": 9455.031,
    "text": " A rather paradoxical remark can be made regarding deterrence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9455.191,
    "end": 9465.303,
    "text": "Perhaps there are degrees of deterrence associated with reinforcement learning-based behaviors as associated with the fundamental alignment of perceptions, actions, and priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9465.523,
    "end": 9475.555,
    "text": "Such fundamental alignment is variable in terms of navigating our environment with respect to what we consider a fitness landscape of associated risks and precautionary constraints to consider.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9475.595,
    "end": 9477.878,
    "text": "These associated risks and precautionary",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9477.858,
    "end": 9497.115,
    "text": " precautionary constraints enabled an agent in question to leverage optimizing fitness and attentively recognizing obstacles and aspects of the environment to be avoidant of in order to furthermore avoid incurred fitness penalties that would be otherwise obvious to the agent in question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9498.757,
    "end": 9507.865,
    "text": "So the rest of this section talks about interagent cooperation-based dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9508.115,
    "end": 9514.28,
    "text": " And then the other section that I completed goes over maladaptive learning behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9514.34,
    "end": 9520.946,
    "text": "So I talked a bit about cooperation of agents and how that's important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9521.306,
    "end": 9537.16,
    "text": "So what separates us as humans from any other agents that exists is just our capacity to utilize and develop language to a point where we can take information",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9537.595,
    "end": 9551.065,
    "text": " and have what we can take that information and turn it into generalized knowledge using language to we can take language and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9551.382,
    "end": 9571.483,
    "text": " information and make associations that stay consistent over a prolonged period of time with how we as humans engage with each other and are able to leverage the resources and constraints of our environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9573.286,
    "end": 9599.749,
    "text": " And that impacts like how we develop social structures and just this capacity of cohesiveness in how we utilize language to augment our capacities to better, more optimally engage with our environment and furthermore abstract the world around us and make",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9600.91,
    "end": 9604.817,
    "text": " generalizations of information and generalized knowledge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9609.525,
    "end": 9610.266,
    "text": "Just to get to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9615.455,
    "end": 9626.074,
    "text": "The capacity to take an incorporated, sophisticated, structured language system and map that to concepts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9626.543,
    "end": 9650.897,
    "text": " uh using language um becomes generalized knowledge um and this is this is really what separates us from other agents and and how we got to where we are um and so we can think of like mimetic adaptation capacities emphasized through uh celia hayes work on imitation learning and metacognition dynamics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9650.877,
    "end": 9673.628,
    "text": " and more interestingly we can also consider Francois Chollet's conceptualization of intelligence generalization on how we make generalizations about our perceptions and actions and anticipate our environment but in so in a collective fashion utilizing this capacity of structured",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9673.608,
    "end": 9701.151,
    "text": " of language and how we're able to furthermore augment language as we utilize it and incorporate mappings to concepts that become generalized knowledge because that knowledge enables us to engage with each other in a way that optimizes technology and tool use and our capacity to engage with each other and make abstract",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9701.789,
    "end": 9704.012,
    "text": " conceptualizations of the world around us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9705.133,
    "end": 9708.898,
    "text": "And I could get really into that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9709.539,
    "end": 9711.942,
    "text": "But I spent a lot of time writing about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9711.963,
    "end": 9719.032,
    "text": "But that that that that's really what makes us uniquely human.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9719.072,
    "end": 9720.594,
    "text": "Now, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9723.257,
    "end": 9731.188,
    "text": "maladaptive learning now has to do with error prone habits and now getting to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9737.328,
    "end": 9749.262,
    "text": " The real issue with maladaptive learning is what I like to call, well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9750.119,
    "end": 9752.903,
    "text": " I don't know how many of you are familiar with Anand Vadya's work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9753.764,
    "end": 9759.052,
    "text": "Anand Vadya brings up this interesting concept known as cognitive strain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9759.432,
    "end": 9770.708,
    "text": "So we can think of like, not just like, you know, if you think about physics and forces and how like applying stress, like let's say I take a ball and I throw it at a wall.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9770.768,
    "end": 9777.257,
    "text": "And if I throw the ball at the wall enough times, it creates a dent in the wall, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9777.237,
    "end": 9789.188,
    "text": " likewise cognitive strain we can consider that like the amplification you know the cognitive strain could be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9790.383,
    "end": 9795.589,
    "text": " the problematic association of what really makes maladaptive learning an issue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9796.631,
    "end": 9810.788,
    "text": "This prolonged exposure to stressors that compromises fitness, that compromises the capacity for agents to have a consistent world model and to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9811.325,
    "end": 9824.696,
    "text": " Leverage their capacity to perceive, act and anticipate in a way that's intuitive and unfortunately like excessive cognitive overload compromises this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9825.177,
    "end": 9829.367,
    "text": "So this goes into like, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9829.347,
    "end": 9854.612,
    "text": " you know okay how do we facilitate that well thinking about basic needs and what have you and due to lack of time i'm not going to get really into that but what i will say um about cognitive strain is like you know if if you over if the agent is overloaded with with stressors like prolonged stressors right then that contributes to to trauma",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9855.655,
    "end": 9870.64,
    "text": " And we can think of trauma as like being the result of this prolonged exposure to stressors and that's associated with the amplification and magnification of cognitive strain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9873.144,
    "end": 9876.229,
    "text": "I would get more into",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9880.563,
    "end": 9886.34,
    "text": " into addiction and all that stuff and dealing with addiction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9886.641,
    "end": 9892.8,
    "text": "But I think that's more or less what I've...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9894.097,
    "end": 9896.559,
    "text": " thrown together so far in the body of my work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9896.719,
    "end": 9901.704,
    "text": "I do, however, plan on talking about free will dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9901.724,
    "end": 9921.943,
    "text": "So to summarize what I feel about what makes free will relevant, my point on free will is probably more on the compatibilist point of view where we consider degrees of freedom and willpower to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9922.177,
    "end": 9943.392,
    "text": " align our perceptions actions and priors with regard to constraints in our environment that enables us to have to make choices reflective of how we deal with existing circumstances and how those circumstances align in the future and that moments of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9944.047,
    "end": 9956.47,
    "text": " of non-determinism really become resolved when choices reduce or evaluate to how certain",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9956.821,
    "end": 9959.864,
    "text": " certain decisions play out and certain choices align.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9960.024,
    "end": 9984.45,
    "text": "So non-deterministic, moments of non-determinism become resolved into deterministic actions over time based on how choices play out reflected to present moments of circumstances which agents deal with that carry over and align with future scenarios that the agent finds themselves in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9984.59,
    "end": 9986.592,
    "text": "So that was another,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9987.23,
    "end": 9991.597,
    "text": " That has to do with the section on free will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9991.717,
    "end": 9993.079,
    "text": "That's the last main section.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9993.139,
    "end": 9996.024,
    "text": "And then there's the conclusion section of the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9996.104,
    "end": 9998.828,
    "text": "Of course, I also have a modeling section.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10000.31,
    "end": 10008.163,
    "text": "I didn't expect to go over models today, but I kind of elaborated what my models would go over.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10009.585,
    "end": 10014.773,
    "text": "But I think that more or less,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10017.2,
    "end": 10019.062,
    "text": " Talks about that more or less covers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10020.744,
    "end": 10024.308,
    "text": "This is, you know, there's a lot more I could talk about, but more or less.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10026.23,
    "end": 10039.125,
    "text": "Covers the work that I've been putting into this this specific goju paper of habits and adaptive learning dynamics with respect to agents agential systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10043.85,
    "end": 10046.633,
    "text": "Yeah, I I know I can go on and on and.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10046.849,
    "end": 10076.552,
    "text": " thanks for that i just noticed that uh message in the chat uh not terribly long ago but yeah well thank you jesse let us take a deep breath okay yeah you covered a lot of territory i'll just read two questions from the live chat just to note them and then i'll just ask a final question",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10076.65,
    "end": 10103.704,
    "text": " then you can give a few minute response and then we'll close it okay so michael lennon wrote how would he contrast the modification of individual habits versus habits between paired individuals versus habits of clusters of individuals and michael's second question was how might he describe how a moment of novel individual insight becomes collective behavior change",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10104.916,
    "end": 10127.565,
    "text": " just like to close it all out overall where are you gonna take this work and how do you intend to proceed with it right um so reflecting on michael's uh questions um so let's address those another time i know that you could go into a lot of information let's just go right to the next steps",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10127.967,
    "end": 10128.288,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10128.388,
    "end": 10129.65,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10129.67,
    "end": 10138.764,
    "text": "So the next steps is so this current paper is really an overview of addressing what are what are habits?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10138.864,
    "end": 10145.735,
    "text": "What is what do habits have to do with adaptive learning and how that ties with agential systems?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10146.096,
    "end": 10152.726,
    "text": "And in the conclusion section, I'm going to bring about like what's going to happen with the next couple of series of topics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10152.706,
    "end": 10153.53,
    "text": " papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10154.032,
    "end": 10161.889,
    "text": "But really, I was originally going to go into the interventionary approaches geared towards adaptive learning, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10162.207,
    "end": 10170.096,
    "text": " So the next steps I want to do with this work is go into the interventionary approaches towards adaptive learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10170.157,
    "end": 10172.199,
    "text": "So, okay, how can we use technology?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10172.279,
    "end": 10177.025,
    "text": "How can we, are there different modes in which we can better engage with information?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10177.645,
    "end": 10180.509,
    "text": "What about just how we engage the world around us?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10180.569,
    "end": 10186.476,
    "text": "Like how, like the food we eat, like, how do we like, are there ways that we regulate food intake?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10186.878,
    "end": 10190.786,
    "text": " How about better understanding reasoning and emotion?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10191.246,
    "end": 10202.929,
    "text": "Is there some capacity in which we can better, how we can better reason with our emotions to have more effective reasoning capacities?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10203.348,
    "end": 10207.452,
    "text": " to deal with circumstances, largely dealing with non-triviality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10209.214,
    "end": 10211.337,
    "text": "So those are the four next papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10211.357,
    "end": 10212.838,
    "text": "I consider the four paradigms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10212.858,
    "end": 10226.513,
    "text": "So the first paradigm has to do with technological interventions, like how can we utilize technology to better facilitate how we engage with the world around us and benefit not only our own agency, but each other's agency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10227.474,
    "end": 10231.178,
    "text": "And two would be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10231.158,
    "end": 10239.292,
    "text": " paradigm two has to do with, okay, how can we better engage with certain objects in the world, like using tactile tools?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10240.074,
    "end": 10244.642,
    "text": "How can we use different objects to facilitate how we better engage with the world around us?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10245.443,
    "end": 10249.791,
    "text": "Three, dieting dynamics, how can we leverage metabolism",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10249.771,
    "end": 10278.31,
    "text": " the most optimal fashion to leverage agency and for, of course, reasoning, like, is there some means in which we can better facilitate how we deal with affective processing and how that can better be, how reasoning can be better leveraged with better understanding of dealing with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10278.661,
    "end": 10280.584,
    "text": " with leveraging affective processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10281.284,
    "end": 10284.749,
    "text": "Um, so that that's the next steps for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10284.769,
    "end": 10286.391,
    "text": "And those are going to be individual papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10286.611,
    "end": 10291.618,
    "text": "Although I do have a, uh, I do plan on talking about the different brain regions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10291.658,
    "end": 10301.631,
    "text": "So like a neuroscientific, uh, more of a neuro psychological, uh, approach in terms of, and going, talking about the different brain regions that are associated with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10302.016,
    "end": 10324.362,
    "text": " uh habits and adaptive learning and agency but that would be a fifth paper um okay last question how could people contact you or what would you look to ask people for or how they could get involved um uh i uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10324.612,
    "end": 10337.295,
    "text": " I do have a business email, but I'll have an email where I'll provide a different email that I can have people reach out to me by.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10337.416,
    "end": 10338.938,
    "text": "It's a Google mail account.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10339.58,
    "end": 10345.27,
    "text": "So reach out to me and hopefully",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10345.25,
    "end": 10353.165,
    "text": " I would love to try and collaborate with the right parties and see where this work can go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10353.206,
    "end": 10364.187,
    "text": "I mean, I have a lot of confidence in terms of especially with the system model that I'm designing in terms of technological interventions, I would love to talk to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10364.167,
    "end": 10383.846,
    "text": " people about that uh because that's the next main step i'm going with is okay well there's a problem with how we interface technology like with social media and like just a lot of platform like just a lot of basic technologies right now that really compromises how we engage with you in the with the world like it's addictive like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10383.826,
    "end": 10412.263,
    "text": " like social media is addictive like people play mobile games on their phone right right and people can waste hours doing all that stuff so how can we better develop systems that complement rather than compromise our behavior um i think that's really important to figure out um and i would love to talk to more people about that um awesome well you covered a ton of scope",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10412.378,
    "end": 10419.113,
    "text": " I hope that people who are studying active inference see a lot of the connections in the terms and topics and systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10419.795,
    "end": 10422.661,
    "text": "And good luck in your learning and research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10423.884,
    "end": 10424.425,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10424.445,
    "end": 10425.889,
    "text": "I appreciate it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10425.909,
    "end": 10426.53,
    "text": "Peace, Jesse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10426.55,
    "end": 10426.911,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  }
]