[
  {
    "start": 1.525,
    "end": 1.825,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3.466,
    "end": 3.807,
    "text": "Welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3.887,
    "end": 4.187,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4.427,
    "end": 6.989,
    "text": "It's March 15th, 2023.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8.75,
    "end": 16.495,
    "text": "We're in meeting 20 of cohort two in our first discussion on chapter nine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 17.896,
    "end": 31.185,
    "text": "So as we begin this discussion of nine, is there any general comment or question about nine that anyone wants to bring up?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 50.091,
    "end": 78.09,
    "text": " one part on nine is it at least points the direction towards an avenue that many people who are interested in learning and applying active inference want to go down which is to make generative models yes that help us understand different cognitive systems and also have models that can accept empirical data",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 79.116,
    "end": 82.319,
    "text": " so that we can enact the tail of two densities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 83.24,
    "end": 99.654,
    "text": "So we can use the model in the generative direction to go from specified parameters to output data sets of synthetic data, kind of like generative AI, but then also to recognize",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 101.317,
    "end": 126.506,
    "text": " outcomes in the world or data and then update or parameterize our generative models from those data and it's that tale of two densities the generative density and the recognition density the ability to run these models both ways to generate valid synthetic data from a generative model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 128.274,
    "end": 153.986,
    "text": " and if you design your experiment so that those data which are generated are also actually being generated in the real world then you can just instantly plug it back in um and we'll i'm sure unpack and explore more so we'll go through the chapter but is there any just general comment or general thoughts on chapter nine first",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 163.097,
    "end": 187.671,
    "text": " okay so let's look at one previous question so how did chapter four on the generative model relate to chapter nine as we're getting close to the end of the book chapter six was a recipe it was about applying active inference chapter four we were learning the necessary prerequisites and chapter one and or two and three were the roads to chapter four",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 189.215,
    "end": 217.156,
    "text": " then chapter five we got the neurobiology and some examples chapter six we got the recipe chapter seven and eight was the discrete time and continuous time generative models and now we're in chapter nine where we're learning how to solve problems and it's about getting one's hands dirty with case studies and problem solving",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 226.499,
    "end": 249.541,
    "text": " we'll see this in the figure upcoming a key distinction is between the subjective model and the objective model there's different readings of the first sentence and in some readings it could be seen as playing fast and loose with instrumentalism and realism",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 251.215,
    "end": 262.258,
    "text": " So the subjective model though, is that which is subject specific from the subject's perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 262.858,
    "end": 268.32,
    "text": "Now, it turns out that it is a map that we're making from the subject's perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 269.08,
    "end": 278.503,
    "text": "So it isn't the actual territory of the subjectivity, but it is from the subject's perspective",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 280.003,
    "end": 309.33,
    "text": " and then to meet that and make the full model we are going to have an objective model which doesn't mean that it's the one and only it means that it's our view from the outside seeing that thing as an object this entire setup with the tail of two densities and the the meta bayesian",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 310.962,
    "end": 326.71,
    "text": " enables us to make Bayesian cognitive models and think about experimentation in a Bayesian context, which lets us talk about Bayes optimal cognition in different systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 328.37,
    "end": 334.593,
    "text": "And one area that that has been especially relevant is in computational phenotyping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 338.215,
    "end": 339.736,
    "text": "This chapter deals with the utility",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 340.871,
    "end": 344.754,
    "text": " of active inference formulations in analyzing data from behavioral experiments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 346.255,
    "end": 348.276,
    "text": "It's going beyond the proof of principle simulations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 348.376,
    "end": 357.382,
    "text": "So in the proof of principle domain, we have the jumping frog in the hand, we have the rat in the tea maze, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 358.562,
    "end": 363.926,
    "text": "And here, active inference is going to be used to answer scientific questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 367.248,
    "end": 369.79,
    "text": "Since the subjective GM",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 371.281,
    "end": 397.362,
    "text": " is the generator of behavior in active inference then the scientific hypotheses that we're going to entertain about the causes and consequences of phenotype must be in terms of hypotheses about alternative generative models so the challenge is to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 398.8,
    "end": 423.157,
    "text": " just like an abductive logic challenge, generate a portfolio or spaces of alternative generative models, cognitive models, and then ask for a given string of observations what the evidence is for different alternative hypotheses provided.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 424.097,
    "end": 427.92,
    "text": "And then at that point, one could take a more classical or frequentist approach and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 429.076,
    "end": 448.302,
    "text": " could also take a more pure bayesian approach and ask about like the base factor and the relative support of different models but the upstream part is to generate alternative generative models explicitly or implicitly by specifying state spaces of possibilities",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 449.409,
    "end": 466.232,
    "text": " And then chapter nine is when we're plugging in empirical data and then going to ask about which of those generative models or spaces within the possibilities of the GMs have what evidence with respect to the observables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 468.812,
    "end": 471.593,
    "text": "If you have any thought or question, just totally go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 471.673,
    "end": 475.634,
    "text": "Otherwise, we'll just continue to walk through it on the first discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 477.554,
    "end": 478.134,
    "text": "Michael, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 480.492,
    "end": 487.015,
    "text": " Yeah, I mean, I guess you'll still come to it, but I'm struggling with this mathematics very much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 487.635,
    "end": 496.239,
    "text": "And last time, we had this interesting discussion about temporal models, the difference between chapter 7 and chapter 8.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 496.68,
    "end": 507.925,
    "text": "And I was thinking that for my data that I have with this gaze data and the keystrokes and all this, these temporal models would be perhaps much better suited",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 510.053,
    "end": 516.798,
    "text": " But then we discussed about these different kinds of derivations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 516.939,
    "end": 522.784,
    "text": "And I'm really unsure what that implies, whether I should",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 524.845,
    "end": 534.529,
    "text": " find a way to express my data in kinds of waves so that one can compute somehow derivations from this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 536.409,
    "end": 541.911,
    "text": "So we discussed about the disappearance of time in these models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 543.012,
    "end": 549.394,
    "text": "And I'm really struggling to understand what that means in my data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 550.984,
    "end": 551.505,
    "text": " that I have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 552.405,
    "end": 556.97,
    "text": "But I don't know whether this really relates to what you were saying before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 556.99,
    "end": 558.632,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 559.192,
    "end": 567.16,
    "text": "Well, it's definitely an experience and a challenge when you have an actual data set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 567.26,
    "end": 570.163,
    "text": "And for people who are already experimentalists,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 571.284,
    "end": 594.794,
    "text": " it's not like we can just dream up the most creative generative model and then build a lab to record those data in many cases we're actually constrained in what we can do or we already have the data set and then we're going to work backwards from the data set to generative models yep that's the case in my case yes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 595.342,
    "end": 615.236,
    "text": " yeah yeah so i mean one um um uh beware all who pass this point is everything just like everything that led to the collection of your data was an experimentalist's choice you could have collected more or different um participants you could have done this or that in the data collection",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 616.537,
    "end": 628.021,
    "text": " And now, let's just say that we're in the analysis phase, everything downstream, everything about the structure of the generative model and so on is all going to be a modeler's degrees of freedom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 629.521,
    "end": 639.305,
    "text": "So we are looking for different spaces to specify and then different portfolios of generative models to test against.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 640.025,
    "end": 645.727,
    "text": "And one of the great things about Bayesian statistics is that wildly disparate",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 647.023,
    "end": 663.953,
    "text": " models architecturally can be compared through the bayes factor and the bayesian information criterion so just to explain why that's relevant relative to the um frequentist statistics when comparing frequentist statistical models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 665.8,
    "end": 683.486,
    "text": " one of the only principled ways to actually test for which model is better is the hierarchical likelihood ratio test so you can say i have two strictly nested models i have factor a and factor b and now i'm going to test for an interaction effect of a x b",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 684.64,
    "end": 712.242,
    "text": " then you can ask whether there's a statistically significant improvement by taking on that interaction effect but if you said i have a model with a x b and then i have a model with b and c and c and d and d and e and x and y those models cannot be directly compared because their um likelihoods are not comparable in contrast",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 713.407,
    "end": 717.369,
    "text": " Bayesian models can be compared in various ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 718.35,
    "end": 729.536,
    "text": "The Bayes factor, the BIC, accuracy minus complexity, free energy, even when there's a very, very different model anatomies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 730.757,
    "end": 737.601,
    "text": "So it's not even like you have to decide whether you want to do only a discrete or only a continuous time generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 738.877,
    "end": 765.198,
    "text": " and hopefully as the software pipelines become more developed it'll be like you'll specify all the different channels that your data can flow through and then see how wildly different models match up with the data and look at their relative evidence or the areas that they fit well or don't in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 767.813,
    "end": 779.075,
    "text": " And you still might have to prune that down in some talk or paper, but also maybe it'll be possible to share those computational resources also with that kind of high bandwidth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 780.875,
    "end": 782.476,
    "text": "But yeah, we'll return to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 782.776,
    "end": 790.057,
    "text": "So two reasons why we want to fit data, like why chapter nine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 791.117,
    "end": 796.478,
    "text": "The first is to estimate parameters of interest from a group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 799.588,
    "end": 827.328,
    "text": " those kinds of computational phenotypes might be useful for some other setting the second reason is to compare alternative hypotheses so here we have in the simplest case two groups and we want to ask if there is a difference in some parameter in the cognitive model a related",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 828.76,
    "end": 856.485,
    "text": " reason to use computational phenotyping is potentially even for one person or one group or it could be for two groups is to compare two different models against one another and ask which one has different um evidence and so these are the two agendas estimating parameters given a cognitive model and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 857.788,
    "end": 861.591,
    "text": " Evaluation among models given data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 868.438,
    "end": 869.839,
    "text": "That's the same hypothesis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 870.62,
    "end": 871.961,
    "text": "You have the same hypothesis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 872.001,
    "end": 873.202,
    "text": "You just replace the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 875.586,
    "end": 896.885,
    "text": " and then uh same data so like uh like uh let's just say in the first case what this would look like would be people who have condition X or not I'm going to measure their attention with with this given attention model I'm going to test if there's a significant difference in this attention parameter",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 898.424,
    "end": 900.925,
    "text": " This one would say, I have two attention models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 901.565,
    "end": 907.967,
    "text": "I have one where attention is a single layer model and I have one where there's like a nested model on attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 908.787,
    "end": 917.71,
    "text": "And now on the whole data set or on just this one person, I'm going to ask which of these two cognitive models is more consistent with the data that I see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 921.228,
    "end": 946.07,
    "text": " And these two agendas are perfectly compatible with different terms within Bayes' theorem, which is a tight synthesis of the kind of fully Bayesian epistemology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 946.937,
    "end": 951.959,
    "text": " It's like we're doing Bayesian science with Bayesian statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 953.74,
    "end": 962.064,
    "text": "We're approaching our data collection and analysis in an optimal information setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 968.542,
    "end": 995.752,
    "text": " okay now we get to figure nine one with the objective and the subjective so does anyone want to give a thought on figure 9.1 what they see here or what they see this figure doing in the context of the book okay just to give a first thought then again just raise your hand or write in the chat or anything",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 997.446,
    "end": 1020.396,
    "text": " everything that we saw in chapters four five seven eight all those generative models all those base graphs those are in the center in the dashed line and so it's a map but it's a map that we're constructing as if it were a view from the inside",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1021.59,
    "end": 1044.513,
    "text": " so here's the mouse in the T-Maze and here's the POMDP in this case it's a discrete time you can tell because it has the past present and future transition matrix and so on and so we've made a discrete time model of the mouse in the T-Maze so it's the as if mouse's view from the inside",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1045.755,
    "end": 1073.602,
    "text": " and that's what makes sense when we're doing computational phenotyping we don't want to do model selection on um omniscient mice because we don't think that that exists in the world so the kinds of constraints that we think actually are uh justifiable in the world like the only input is sensory and the only outputs are actions those constraints are embodied within the gm that we make for the subject",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1075.503,
    "end": 1078.945,
    "text": " but the subject is also the object of our study.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1080.166,
    "end": 1085.911,
    "text": "The object of our study or the system of interest of our study is that mouse in the tea maze.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1087.252,
    "end": 1102.262,
    "text": "And so with respect to how we designed that tea maze experiment and whether we do it with one trial on one day, or we do it with this other block design, or we have it replicated across laboratories, those experimental parameters",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1103.291,
    "end": 1113.334,
    "text": " that our action selections from us can be understood as being drawn from distributions of possible experiments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1115.975,
    "end": 1125.619,
    "text": "And what our action selections by the experimenter are being passed into the subjects model as an observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1128.46,
    "end": 1132.461,
    "text": "What is passed out of the subject through action",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1133.76,
    "end": 1156.078,
    "text": " is the input for the observer so we're kind of wrapping the generative models that we saw in chapter four etc calling those subjective models not to mean that they're willy-nilly but just to say that they are as if from the subject's perspective",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1157.273,
    "end": 1170.596,
    "text": " And then wrapping that as a behavioral researcher in an objective model, not to mean that it's the one and only true model, but it's the one from the outside with the subject as object.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1172.396,
    "end": 1174.957,
    "text": "And this is called meta-Bayesian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1179.198,
    "end": 1185.639,
    "text": "So in some ways, this is a formalization of ethology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1187.717,
    "end": 1196.321,
    "text": " with the cognitive modeling twist, because we're explicitly saying that we're interested in this cognitive or internal map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1197.021,
    "end": 1197.281,
    "text": "Michael?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1200.403,
    "end": 1213.949,
    "text": "Has this to do with a self-evidencing experimenter that they put in the data and they get the results and then they model the subject in between in such a way",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1216.064,
    "end": 1220.186,
    "text": " that the expectations become true, that the input-output relations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1220.446,
    "end": 1228.589,
    "text": "And so has it to do with the self-evidencing ideas?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1231.39,
    "end": 1231.75,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1231.79,
    "end": 1233.031,
    "text": "The experimenter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1234.392,
    "end": 1236.172,
    "text": "Yeah, it's very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1237.513,
    "end": 1245.056,
    "text": "Like our subjective model, we can see why that is set up in a way to be self-evidencing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1246.152,
    "end": 1255.916,
    "text": " We can say that the mouse is moving around in the tea maze so that it reduces divergence, so that it can be the kind of mouse that it expects and prefers to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1256.496,
    "end": 1260.697,
    "text": "We can understand its diverse behavioral selections in light of self-evidencing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1262.738,
    "end": 1273.522,
    "text": "If we're going to consider ourselves in a Bayesian light as well, then also that entails a certain kind of epistemological self-evidencing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1274.386,
    "end": 1295.844,
    "text": " now in the extreme or in one simple reading self-evidencing would be like you write down the number four oh i wonder what number four great write down the number four look at the number it's four well that isn't what self-evidencing means any more than for the organism it means to stay in the dark room",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1297.984,
    "end": 1323.531,
    "text": " which has been a point of philosophical contention for like literally 10 years people say well if organisms are acting to reduce surprise or to self-evidence why don't they just stay in the dark room dark room challenge you know throw down the gauntlet and it's like right if the generative model didn't have survival requirements and its only imperative was to have the reduced divergence with a photon distribution",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1324.844,
    "end": 1326.585,
    "text": " You would, and you do see that behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1327.265,
    "end": 1328.966,
    "text": "But that's not what organisms do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1329.967,
    "end": 1331.208,
    "text": "And maps aren't territories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1331.308,
    "end": 1339.852,
    "text": "So if you actually built a realistic generative model, you would find that self-evidencing doesn't just mean staying in the dark room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1339.973,
    "end": 1343.735,
    "text": "It also means self-evidencing for temperature and thirst and all these other drives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1344.655,
    "end": 1351.099,
    "text": "So self-evidencing by the researcher plays out",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1352.93,
    "end": 1376.793,
    "text": " in a way that would need its own generative model to be specific about but for example if the researcher says my commitment is to maximum information experimentation i'm not trying to simply confirm what my friend told me my commitment and expectation slash preference is for maximally informative experiment design",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1377.918,
    "end": 1400.87,
    "text": " then the experiment that they design can be understood as self-evidencing even if the data points are maximally surprising that would be the point ali",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1404.848,
    "end": 1422.092,
    "text": " And also about self-evidencing, you see in recent literature, especially since 2019, there's two distinct way of formulating self-evidencing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1422.292,
    "end": 1429.553,
    "text": "One is in terms of Bayesian model evidence, which is the approach taken in this chapter as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1430.133,
    "end": 1432.574,
    "text": "And one is in the terms of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1433.258,
    "end": 1437.941,
    "text": " Lagrangian of the autonomous paths of active particles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1438.462,
    "end": 1461.898,
    "text": "So these autonomous paths are actually, or in other words, these Lagrangians are actually the expected free energy, which can by themselves decompose into two separate terms corresponding with expected costs on one hand and expected information gain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1462.992,
    "end": 1481.205,
    "text": " So in this kind of formulation, the expected cost is the surprisal of sensory paths, which is also what's referred to as the sensory surprisal or the self-evidencing of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1481.856,
    "end": 1483.977,
    "text": " self-organization systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1484.397,
    "end": 1507.422,
    "text": "So there are slight, there are some subtle differences between these two formulations, but ultimately they converge onto same results providing, I mean, a description of the behavior of these systems in, or in particular active",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1508.162,
    "end": 1532.988,
    "text": " particles in the environment in terms of minimizing their expected free energy thank you um when we set up the ethological moment in this way it's an active inference problem",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1534.286,
    "end": 1540.85,
    "text": " So it can be approached using all of the amazing tools that are being developed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1544.572,
    "end": 1547.713,
    "text": "Our focus is on ACT-INF and specifically discrete time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1549.394,
    "end": 1553.637,
    "text": "However, the generic methods may be used with other likelihood functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1557.799,
    "end": 1559.82,
    "text": "So other normative models of behavior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1561.553,
    "end": 1584.558,
    "text": " in active inference our normativity is around self-evidencing things should persistent things should minimize or bound their surprise but there's no issue with having a subjective model with a different normativity that it should maximize reward as per a utility function defined",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1590.208,
    "end": 1596.894,
    "text": " Now there will be a generic inference scheme that can be used for metabasian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1598.775,
    "end": 1601.858,
    "text": "Then there's going to be a recipe and then a key example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1604.32,
    "end": 1608.343,
    "text": "Readers uninterested in certain details are invited to skip 9.3 and 9.4.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1608.623,
    "end": 1610.365,
    "text": "Okay, we'll keep that in mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1616.97,
    "end": 1618.952,
    "text": "Parametric empirical Bayes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1620.635,
    "end": 1628.887,
    "text": " is a technique that's used to jump start a bayesian analysis with empirical data",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1629.952,
    "end": 1650.88,
    "text": " so a common question by adherents and critics in bayesian statistics is like well what priors should i choose because there's no such thing as a unbiased or a non-biased prior there's the uniform distribution like the flat probability distribution but even that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1652.396,
    "end": 1681.636,
    "text": " is over a certain interval and it still embodies a prior albeit one that is uniform across the range but there's other situations where the uniform distribution is not even a possible selection for example you can't have a uniform distribution across all possible heights of trees at some point you just got to be like you know objects have this range of sizes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1683.168,
    "end": 1689.713,
    "text": " And so there's always this question about selection of priors and hyper priors and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1690.614,
    "end": 1693.016,
    "text": "Now, in many cases, in practice,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1694.798,
    "end": 1696.84,
    "text": " it can be shown that it doesn't matter that much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1697.221,
    "end": 1707.252,
    "text": "For example, somebody will show that with two wildly divergent prior distributions, there's so much signal in the data that it converges to the same posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1707.973,
    "end": 1714.2,
    "text": "So that's often used as evidence like, hey, we tried different priors and we always got the same convergence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1715.347,
    "end": 1736.978,
    "text": " even with different families of priors so we feel like this signal is being driven by patterns in the data and it's not an aberration because of our choice of like a very opinionated prior so that's one strategy people take presentation of alternative priors another approach that can be taken",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1738.445,
    "end": 1764.653,
    "text": " it's not exclusive to what was previously mentioned is parametric empirical base and so in this situation empirical data are used to kick start setting the priors so we're going to be measuring the height of children in the whole school first we're going to measure one classroom and then we're going to use the mean and the variance of that classroom",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1765.845,
    "end": 1782.538,
    "text": " as our prior moving forward for the other classrooms so it's just a way to take empirical data and use the empirical data summary statistics like mean and variance for gaussian",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1783.735,
    "end": 1789.938,
    "text": " to jumpstart subsequent Bayesian analyses, including of the data that generated that prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1790.518,
    "end": 1798.042,
    "text": "Now that analysis by itself won't be super informative because you kind of already described the maximum likelihood solution for that one data set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1798.803,
    "end": 1803.005,
    "text": "But with subsampling and so on, there's some ways to make PEB really useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1805.245,
    "end": 1833.161,
    "text": " right so 9.3 9.4 it was like reminded that they're not essential so we'll move a little faster through them but we can return to it um next time okay here we have the variables that are being used in the meta bayesian image in nine point figure 9.1 and there's a focus on the likelihood function and um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1834.451,
    "end": 1848.776,
    "text": " Bayesian model evidence is closely linked to surprise or self-evidencing because the model with the most evidence is the one that is least surprised by data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1851.037,
    "end": 1860.481,
    "text": "So sometimes we're talking more about maximizing likelihood, other times minimizing the surprise, but the tuning of the parameters",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1861.678,
    "end": 1865.801,
    "text": " is not going to clash between those approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1871.425,
    "end": 1875.547,
    "text": "Pi are those policy selections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1876.948,
    "end": 1886.274,
    "text": "And so pi is going to be based upon a minimization of free energy over all the pis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1887.916,
    "end": 1889.837,
    "text": "So this is like act-inf.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1891.479,
    "end": 1913.77,
    "text": " free energy minimization of the generative model not of the territory of the GM is going to be used as the imperative for action selection which is what we observed from the mouse and the teammates so if we have the model that does best at predicting their behavior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1915.885,
    "end": 1924.272,
    "text": " then we've done a good compromised job on the subject of perception, cognition, action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1926.874,
    "end": 1943.707,
    "text": "And there's just a mention of this temperature parameter, shaky handedness, which is just kind of fun to like think about even just from an intuition perspective where in the shaky hand limit, the high temperature, everything is shaking a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1944.688,
    "end": 1950.593,
    "text": " it eradicates differences in the likelihood of taking different actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1951.673,
    "end": 1957.718,
    "text": "Like if something is just vibrating, it just ends up making all action selection choices equally likely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1958.539,
    "end": 1971.869,
    "text": "Whereas like in the sort of sure-handed limit, then you follow either your habits or your free energy minimization habits",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1973.26,
    "end": 1998.236,
    "text": " without further hindrance so sure-handed optimization of policy shaky-handed if and if it's soft max is one then you're sampling from the posterior so there's two actions and your posterior um evaluation is 60 40.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1999.756,
    "end": 2021.546,
    "text": " this parameter is one you you select those policies 60 and 40 percent of the time respectively if you turn up the temperature it converges back to 50 50 and if you turn down the temperature you're always going to select the higher um likelihood one there's some details on the laplace",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2023.346,
    "end": 2045.098,
    "text": " um assumption there's probably a lot of detail that could be gone into but Laplace puts a quadratic function that is censored at the maximum likelihood solution to a distribution so if it's um bimodal there's two humps to the distribution Laplace will get stuck at one of them",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2046.34,
    "end": 2074.757,
    "text": " or you'll get other kinds of issues like it'll be stuck at one but very over dispersed and so on so this isn't approximating the distribution completely but it turns out it's a super computable way that in many reasonable situations does really well now we return to the peb so we want to ask regular anova type statistical modeling questions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2078.243,
    "end": 2107.723,
    "text": " here we have a linear model this is kind of like spm style where x is a design matrix it's also used in linear regressor models won't go into this in too much more detail but this is kind of like saying just like you could do a linear regression with a design matrix on um height",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2109.016,
    "end": 2128.682,
    "text": " you can do a linear regression with a design matrix on generative model parameters and still test for an effect of age by height on attention or something like that 9.5 instructions for model-based analysis Ali go for it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2131.069,
    "end": 2141.575,
    "text": " Yeah, I just wanted to point out the relation between the Laplace assumption and the form of the recognition density.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2141.635,
    "end": 2158.545,
    "text": "Because very briefly, Laplace assumption mathematically leads to this assumption that the shape of the recognition density would be necessarily a Gaussian density.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2158.625,
    "end": 2160.186,
    "text": "So in that case,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2161.467,
    "end": 2165.855,
    "text": " the variation of free energy would be equivalent to Gibbs energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2165.915,
    "end": 2170.824,
    "text": "But without that Laplace assumption, then we would have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2171.623,
    "end": 2177.529,
    "text": " variational free energy equals Gibbs energy minus the entropy of the recognition density.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2178.289,
    "end": 2192.462,
    "text": "And by recognition density, I mean the approximate probability density for hidden input variables under a certain generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2194.964,
    "end": 2195.365,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2196.966,
    "end": 2197.607,
    "text": "Many times...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2200.66,
    "end": 2223.711,
    "text": " getting to a Gaussian or a quadratic is simplifying it's symmetric it has the minimum number of parameters 2 to describe like the mean and the scaling the mean and the variance but that doesn't mean distributions in the world are like that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2224.636,
    "end": 2245.355,
    "text": " however for ones that are even roughly shaped like that like they have a central tendency these kinds of symmetric models can be like super super effective because they have very very well established methods for solving okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2247.594,
    "end": 2269.66,
    "text": " now we're going to get to instructions for the model-based analysis so definitely contrast slash juxtapose this with the recipe from chapter six so in six we were kind of coming to the system what are we modeling why are we doing it what structurally are we looking to include in our gm",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2270.994,
    "end": 2295.426,
    "text": " are we going to specifically set up that gm and then how are we going to set up the generative process okay doesn't have to be in order but these are what we'll need to figure out now in chapter nine we have some instructions for how to go from not just building a gm like we saw in six but to using the gm for gm based analysis so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2296.86,
    "end": 2322.408,
    "text": " collecting behavioral data including metadata or demographic data two formulate a pomdp I I think here they could have said construct a GM as per chapter six but they're focusing like they mentioned above on the discrete time case so that's why they're focusing on the pomdp",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2326.337,
    "end": 2347.49,
    "text": " specify a likelihood function that is going to simulate behavior and quantify the likelihood of observed actions so we started with data then we formed a pomdp basically like it was laid out in chapter six",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2349.011,
    "end": 2374.772,
    "text": " turns out we're doing a pomdp like chapter seven but it's basically like formulating the gm and now we're going to actually be using that gm for doing the kinds of papers that people write about where this age group had with this statistical confidence level a higher likelihood of this or that um how should the model be used to calculate a likelihood",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2377.071,
    "end": 2400.488,
    "text": " specification of priors that's where um you can take a zero centered um approach or again one could use parametric empirical base to just say all previous studies found this distribution so that's going to be my prior distribution um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2403.513,
    "end": 2406.995,
    "text": " Here's our prior probability and our likelihood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2408.655,
    "end": 2412.297,
    "text": "What we need now is the posterior probability and the model evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2418.64,
    "end": 2428.625,
    "text": "Likelihood function, prior, solving for, now with data, posterior distributions, and evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2433.024,
    "end": 2454.044,
    "text": " so we put information in on the front half of Bayes equation now we're solving for the second half of Bayes equation and there are routines in SPM in MATLAB that help with this lastly perform the group level analysis this is also an opportunity for using peb",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2457.629,
    "end": 2486.611,
    "text": " or you can do any other kind of truly wide variety of statistical methods you could fall back to frequentism and just do a t-test just say all right i had 17 in this group and 35 in this group and we're going to t-test to see if this attention parameter was significantly different you could use a canonical variant analysis or an independent contrast analysis or principal component analysis",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2488.237,
    "end": 2515.372,
    "text": " any statistical method that you would see in any paper this is just doing statistics at this point a little bit more detail and figure 9.2 is showing the six step inversion procedure",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2518.683,
    "end": 2519.263,
    "text": " Collect the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2521.485,
    "end": 2522.346,
    "text": "Make the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2524.328,
    "end": 2526.469,
    "text": "Specify the likelihood function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2529.692,
    "end": 2530.973,
    "text": "P of U tilde.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2531.593,
    "end": 2534.115,
    "text": "Remember back to 91, U tilde is the observed behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2536.117,
    "end": 2537.698,
    "text": "So we're doing behavioral modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2538.979,
    "end": 2540.701,
    "text": "What we're interested in is the distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2542.256,
    "end": 2567.632,
    "text": " of probabilities of um behaviors given theta o and m theta o and m so now we've kind of like specified the pumdp for the mouse in the in the maze but we've pulled back our likelihood function",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2569.198,
    "end": 2590.568,
    "text": " to in a way um abstract or insulate from all of those subjective model parameters such that our statistical analysis is only about objective model parameters so it'd be like if we were making a cognitive model of a decision to take x or y behavior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2592.09,
    "end": 2600.557,
    "text": " We'd want to do that, then collect the data on the behavior and then do a demographic analysis on how X or Y is related with this or that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2601.978,
    "end": 2607.862,
    "text": "And those statistics are not an appeal to the cognitive model of the decision maker.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2609.363,
    "end": 2617.71,
    "text": "They're actually a layer of descriptive statistics that will be absolutely familiar to anyone who's done behavioral modeling in the lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2618.09,
    "end": 2619.771,
    "text": "It's just a slightly different way of looking at them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2620.697,
    "end": 2633.742,
    "text": " but it can be seen as doing model evaluation and estimation using statistics in a way that doesn't mention any of the inner cognitive model parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2637.143,
    "end": 2645.707,
    "text": "Because things have been framed in this nice pan meta Bayesian way, we can do the tail of two densities",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2647.688,
    "end": 2653.331,
    "text": " And here is kind of a visualization of what the t-test would look like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2654.191,
    "end": 2656.592,
    "text": "Those error bars could be bootstrapped, et cetera, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2656.632,
    "end": 2658.453,
    "text": "But just imagine that they're from a t-test.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2659.093,
    "end": 2660.054,
    "text": "So here's five groups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2661.437,
    "end": 2678.38,
    "text": " here we have some parameter that we modeled they're uh novelty seeking something or some other specific model inside and then we can ask like is there more variance within or among these bars",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2679.341,
    "end": 2682.203,
    "text": " And maybe you see a bar with an asterisk here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2682.243,
    "end": 2685.806,
    "text": "These two are indistinguishable, but they're both significantly different than these three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2687.046,
    "end": 2690.209,
    "text": "And this one is significantly different from that one, but not that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2690.249,
    "end": 2698.895,
    "text": "So you see those kinds of regular ANOVA-type statistics here in a Bayesian setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2702.837,
    "end": 2706.56,
    "text": "So specification of the GM, Chapter 6 and all that,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2708.129,
    "end": 2733.452,
    "text": " allows us to do statistics on it just like if we had some advanced model of materials properties and then we were just testing which one was like harder or softer um before analyzing actual data we may want to check face validity by generating fictive data",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2734.813,
    "end": 2751.36,
    "text": " so taking just a look at it visually and also doing parameter recovery so that means can you identify or recover parameters or do you have issues with your model like co-linearity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2752.52,
    "end": 2767.155,
    "text": " where there's two parameters that are so covariate with each other that sometimes you'll run the model and it will explain the data equally well with wildly different combinations of those two parameters, just for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2769.857,
    "end": 2775.123,
    "text": "And again, classical SPM-like angle with a design matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2778.396,
    "end": 2801.185,
    "text": " it's kind of amazing how it works but the design matrix encodes all of the experimental metadata and then you have like a matrix of regressors and you just smash the design matrix into this beta and somehow the dimensions work out and it's like what you'd want to know",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2803.749,
    "end": 2822.852,
    "text": " like in SPM it'll be one Matrix with this is the um the age and so on of the of the patients and here's a big Matrix with all of the fmri data and you just smash them together and it and then it sets up this if it's all set up properly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2827.509,
    "end": 2856.233,
    "text": " okay and then just we'll look at these upcoming sections but then talk more with open questions and and uh look at any other details there's going to be an analysis of the mirza at all saccade eye movement and smooth pursuit of eye movement atoms and mirza smooth tracking of eye movement on the left atoms",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2858.137,
    "end": 2876.24,
    "text": " discrete tracking of eye movements Mirza not much more said than that obviously there's papers to go back to and those are even generative models that we can use replicate them and modify them",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2880.114,
    "end": 2909.058,
    "text": " models of false inference so this is going to be approaching that kind of challenging Nexus of well if it's base optimal then how is their maladaptive behavior how can people have delusions how can there be the accommodation of chemical changes that that just fundamentally alter the substrate of cognition",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2912.813,
    "end": 2929.922,
    "text": " table 9.1 has a sample of examples that um are papers exploring computational pathology in primarily humans but almost surely vertebrates",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2933.044,
    "end": 2956.989,
    "text": " addiction impulsivity compulsivity delusions hallucination interpersonal and personality disorder oculomotor syndrome pharmacotherapy prefrontal syndromes visual neglect disorders of interoceptive inference so just giving us some examples and the notes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2958.53,
    "end": 2974.133,
    "text": " tend to be defining what that pathology was operationalized as by those studies and then briefly what kind of generative models were used",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2975.339,
    "end": 3001.95,
    "text": " to support what new explanations predictions or control opportunities are presented when we have for example an active model of oculomotor syndrome as opposed to some other framework for describing that behavior um a useful way of thinking about causes of pathological behaviors to think about the prior belief used for policies",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3003.923,
    "end": 3029.794,
    "text": " how each part of this may be disrupted to give rise to abnormal policy selection so one could look at a figure and just imagine that we're dealing with a very simple uh mouse-like patient on the top here um or um just looking at it here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3031.326,
    "end": 3055.965,
    "text": " we're interested in that behavioral policy selection component that is uh conditioned on preferences and affordances or habits so that's why they mentioned c and e because maybe there's a group of people who are repeatedly or compulsively taking a given behavior but again just totally simplifying making this up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3057.13,
    "end": 3068.832,
    "text": " There might be some who prefer that behavior and understand the consequences of their action, so they engage in the selection of the behavior because they expect slash prefer it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3070.592,
    "end": 3083.495,
    "text": "In another case, it actually might not be aligned with the preferences, but it has become habitual, in which case there's a different cognitive model parameterization,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3084.62,
    "end": 3108.141,
    "text": " and potentially different consequences or treatment opportunities however the experiment needs to be carefully designed to resolve those possibilities which is why a great advance is to be able to basically not just pre-register what you're going to do but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3110.103,
    "end": 3126.186,
    "text": " to do the statistical power analysis and ask which regions of experimental state space are going to be Bayesian optimal for, for example, distinguishing two groups of people, some of whom have a habitual bias and others have a strong prior preference for something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3127.506,
    "end": 3135.107,
    "text": "But it's not just like any given set of experimental data are going to resolve this because these are not measurable things in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3136.168,
    "end": 3138.548,
    "text": "They're inferred parameters in our cognitive map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3139.522,
    "end": 3142.884,
    "text": " So it's not just going to happen because we tried.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3142.904,
    "end": 3160.736,
    "text": "That being said, we can make the GM ahead of time and do the simulations, do that parameter identification and recovery to determine what kinds of experimental paradigms could resolve that if that was what we were trying to resolve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3164.874,
    "end": 3175.621,
    "text": " Then there's a few more interesting points here on everything from salience and neuromodulators and different pathologies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3178.543,
    "end": 3180.064,
    "text": "And they summarize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3181.304,
    "end": 3183.246,
    "text": "They outlined an approach to use the models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3184.448,
    "end": 3212.692,
    "text": " previously described to pose questions to empirical data so chapter six was like the recipe for making the GM and then here we saw like the kind of second stage of the recipe the instructions for model-based analysis that helped us see like not just the building of the model which got us to here but now we see the whole six stages that gets us like to the visualization and statistical analysis that we want in the paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3220.175,
    "end": 3234.819,
    "text": " They also highlighted that you can use these methods to distinguish groups, for example, with a given cognitive model, or you can use it to distinguish alternative model hypotheses given data from one or more group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3237.859,
    "end": 3240.02,
    "text": "They gave a bunch of examples in Table 9-1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3241.397,
    "end": 3265.002,
    "text": " and they focused on the examples of Adams and Mirza et al in eye tracking pursuit giving just a total clear example of how even for the very same data you can model it with continuous or discrete time it's a generic method or experimental design",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3267.642,
    "end": 3272.544,
    "text": " that offers an opportunity to answer questions about the function of the nervous system and health and disease.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3276.966,
    "end": 3277.226,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3280.728,
    "end": 3282.769,
    "text": "That's good for our first discussion on nine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3283.009,
    "end": 3289.532,
    "text": "We'll come back next week and check any questions that people have added.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3291.172,
    "end": 3293.653,
    "text": "And yeah, thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3293.913,
    "end": 3294.914,
    "text": "We'll come back next week.",
    "speaker": "SPEAKER_00"
  }
]