[
  {
    "start": 9.565,
    "end": 9.985,
    "text": " All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10.246,
    "end": 18.334,
    "text": "It is July 8th, 2024, and it is Active Inference Insights number 24, a reverse insight.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 19.035,
    "end": 20.556,
    "text": "So welcome, Darius.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 21.257,
    "end": 22.098,
    "text": "How are you doing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 22.478,
    "end": 22.999,
    "text": "Very well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 23.099,
    "end": 25.602,
    "text": "I apologize, everyone, also for my stupid headband.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 25.622,
    "end": 26.943,
    "text": "I'm currently in El Salvador.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.505,
    "end": 30.627,
    "text": "It's very warm and my hair is going everywhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.647,
    "end": 32.349,
    "text": "So I've decided to strap it in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.869,
    "end": 34.951,
    "text": "So it's a bit of a look.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 35.292,
    "end": 35.672,
    "text": "I'm very well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 35.692,
    "end": 36.433,
    "text": "How are you, Daniel?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.7,
    "end": 57.932,
    "text": " good well as we just briefly discussed this is sort of the season finale slash pivot point or next jump and we will discuss some of the inception and journey of insight series the 1 through 23 main episodes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 58.148,
    "end": 59.71,
    "text": " What is next for Insight?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 59.83,
    "end": 61.031,
    "text": "What is next for you?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 61.852,
    "end": 63.513,
    "text": "And just however long that is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 63.573,
    "end": 66.296,
    "text": "So let us begin with Insights.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 66.876,
    "end": 70.6,
    "text": "How did it come to be and what were the beginning steps like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 71.661,
    "end": 74.884,
    "text": "Well, firstly, it's annoying that we never made this to 25.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 75.124,
    "end": 78.908,
    "text": "You know, it would be nice to have a nice square number, but 24, that's life, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 79.649,
    "end": 80.95,
    "text": "How's it come about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 80.99,
    "end": 86.556,
    "text": "Well, firstly, thanks to your generosity in many ways and the Institute's generosity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 86.576,
    "end": 88.037,
    "text": "So I'm very grateful for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 88.017,
    "end": 102.696,
    "text": " I had done podcasting when I was at university, a little bit after, but I think I just noticed there was a sort of gap at least in the institute's offerings, the live streams, not like this one, but the other ones that can be quite technical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 103.557,
    "end": 113.53,
    "text": "And I don't think necessarily offer a way in and a way to see how active inference exists in the sort of context of theories of biology or neuroscience or philosophy or whatnot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 114.171,
    "end": 116.995,
    "text": "So there was a space airport and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 117.987,
    "end": 124.636,
    "text": " I just, I guess it was also this idea that it was a way for people to learn alongside me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 125.497,
    "end": 138.335,
    "text": "And I think that's always quite an efficient and effective way of podcasting because I don't, you know, there's one thing that where people know nothing and it's very difficult to have a conversation with an expert.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 138.355,
    "end": 141.499,
    "text": "And there's another way that it's too expert speaking and it's inaccessible for the audience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 142.08,
    "end": 145.885,
    "text": "So it was, I think we hopefully found a kind of sweet spot",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 145.865,
    "end": 157.41,
    "text": " where i was sufficiently knowledgeable albeit to a quite limited degree at the beginning i'd say uh but enough that i could ask insightful questions and be curious the way it came about really was",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 157.593,
    "end": 161.28,
    "text": " I did my master's at UCL from 2022 to 2023.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 161.981,
    "end": 171.398,
    "text": "And about halfway through, I sort of discovered Active Inference, probably through predictive processing, because obviously Carl is at UCL and it's a big hub for Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 171.959,
    "end": 177.188,
    "text": "Although I think there's an interesting relationship between Active Inference and UCL, because not everyone's necessarily on board.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 177.168,
    "end": 195.733,
    "text": " and then i started attending i got on the discord so miles so we just mentioned before miles taft who was my supervisor at ucl was also and is also interested in active influence and he recommended the discord and the institute so i started doing that started attending the textbook groups and then i think i just messaged you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 195.713,
    "end": 224.488,
    "text": " uh when would that have been september october and it all came together quite nicely and rather quickly and then again just people to thank carl really first and foremost to be the first guest um a good three hours with carl was like this very nerve-wracking experience but i think a pretty you know throw yourself in the deep end and then i think hopefully it's just gone from strength to strength um and i'm sure we can sort of talk about how it's evolved",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 228.907,
    "end": 257.209,
    "text": " one thing about that certainly by view count which is not everything the most popular videos on our channel over the last year have been basically chris fields's 2023 physics is information processing and your series and now i'm kind of reflecting on that and uh when we have a presentation like a guest stream that can get technical or a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 257.189,
    "end": 284.952,
    "text": " live stream with the paper focused third people there it's human however it's also like a conversation with literature and literature in conversation with other topics whereas in chris fields's case with the course like format that's a uh similar to a professor to audience and then what you kind of brought into play was like also the person to person and so that sort of like direct human element of the conversation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 285.353,
    "end": 301.23,
    "text": " which is much more like a textbook group, but of course a textbook group still has the textbook group as reference point, but once you kind of swim away from the wall of any text, then there's this wide space of what you can ask people and how you prepare it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 302.211,
    "end": 313.723,
    "text": "Sure, and I think people naturally are attracted to the kind of what John Bavakian calls dialogos, this kind of mutual dialectical unfolding where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 314.058,
    "end": 340.47,
    "text": " don't know we're both we're both um affording each other the opportunities for insights and one thing i always sort of wanted to do and never got around to doing was doing in-person insights episodes um there was the possibility of doing that i mean i think the more it can be embodied the more it can be enacted the more it can be situated the better and maybe that's the kind of idea going forward i mean i i recognize also that one of the benefits of the institute is it's kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 340.619,
    "end": 342.401,
    "text": " Its location is everywhere and nowhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 342.682,
    "end": 344.003,
    "text": "It's this distributed map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 344.984,
    "end": 356.819,
    "text": "And that's really amazing because I think what you see on the Institute is all these people coming from completely different parts of the world with completely different interests and being unified over this one of an interest in this framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 357.44,
    "end": 361.906,
    "text": "At the same time, I think, yeah, hopefully what sort of developed was this kind of mutual unfolding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 362.206,
    "end": 364.749,
    "text": "And I think that can really only be done in dialogue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 365.19,
    "end": 370.356,
    "text": "I think you have to be quite an exceptional speaker and orator to be able to do that just through monologue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 372.277,
    "end": 394.656,
    "text": " yeah wow interesting point there okay so carl and then dot dot dot dot so yeah do any come to mind like what was sort of a um a lead-up or a follow-up that was surprising or you know without naming the innocence how how did people differ and how they approached like what you asked and did",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 395.041,
    "end": 398.024,
    "text": " Well, look, everyone, to be honest, everyone was really amazing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 398.124,
    "end": 414.719,
    "text": "I mean, for me, just like being a pre-doc, but being like to have that generosity of people to give me their time and actually read and take it seriously and not give, you know, flippant or oversimplified answers was really something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 414.739,
    "end": 420.644,
    "text": "And I think I recognized that with Carl when I asked him about active inference, he gave me a sort of 15 minute answer, which basically maths.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 421.064,
    "end": 425.048,
    "text": "And I thought, okay, well, this is not going to be, this is not going to be a soft launch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 425.028,
    "end": 429.818,
    "text": " So everyone sort of unified has taken it really seriously and been really engaged.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 429.838,
    "end": 430.54,
    "text": "And that was amazing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 430.901,
    "end": 432.364,
    "text": "I think there were a couple of pinch me moments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 433.386,
    "end": 444.69,
    "text": "So one, like I've always loved John for Vicky really since discovering awakening from the meaning crisis, probably when I was about 17 or 18.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 445.21,
    "end": 449.196,
    "text": " He's always been a massive figure in my life, and I was lucky to meet him last year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 449.236,
    "end": 455.024,
    "text": "And to be able to speak to him was a really bizarre and special moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 455.985,
    "end": 458.108,
    "text": "So, yeah, John was really amazing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 458.549,
    "end": 470.326,
    "text": "I think also there were some people who I think what was nice about the process was integrating some people who weren't necessarily active inference per se, but still had insights from different disciplines and different domains which could bear on active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 470.366,
    "end": 473.31,
    "text": "So I really enjoyed speaking to Marilyn Stendera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 473.611,
    "end": 490.708,
    "text": " um about heidegger because this kind of notion of us being beings directed ultimately towards a futurity i think is very in tune with active inference and this emphasis on expected free energy but everyone's been yeah everyone's been a total delight i think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 490.688,
    "end": 517.793,
    "text": " also what's been really fun is having like the debate was really fun um about the markov blanket trick and i think that's another thing to say i really enjoyed having people who weren't necessarily not only people from different domains but also people who weren't necessarily in the camp of active inference so whether that was you know a chris delega for example just being able to probe the relevant questions i think is really important because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 518.228,
    "end": 520.412,
    "text": " the framework is always evolving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 520.892,
    "end": 529.186,
    "text": "As always important, in my opinion, at least to have these not necessarily outside voices, but concerned voices, just to temper proceedings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 529.446,
    "end": 532.651,
    "text": "And I guess you had that when you've done live streams of people like Mel Andrews.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 534.033,
    "end": 541.806,
    "text": "So I think, you know, if this something like this continues, it's important that we break out and listen to other voices who might have something to say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 543.473,
    "end": 544.334,
    "text": " Awesome, thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 544.354,
    "end": 563.099,
    "text": "Yeah, well, about the sort of contents, what were some topical themes, whether ones that developed like even over those months or just some emergent themes or like what topics did you find coming up or developing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 563.82,
    "end": 565.262,
    "text": "Yeah, so I think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 565.428,
    "end": 568.192,
    "text": " So I'm not, by training, a philosopher of science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 568.753,
    "end": 575.183,
    "text": "And so I guess when I discovered that to inference, this whole notion of the map and the territory was not forefront in my mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 576.184,
    "end": 587.902,
    "text": "And in many ways, my enthusiasm facts of inference, I think, has been quite efficiently and importantly mitigated or mitigated, but just constrained by that conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 588.383,
    "end": 591.047,
    "text": "So to what degree can the maths",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 591.027,
    "end": 602.292,
    "text": " actually really tell us anything about one, lived experience, two, human behavior, and three, what the brain is actually doing, or the brain or the body, what they're actually doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 602.312,
    "end": 609.508,
    "text": "So that was a recurrent conversation that kept coming up over and over again, this map territory or math territory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 609.792,
    "end": 619.148,
    "text": " And I think hopefully it's been a contributor to this wider conversation that I know is happening within active inference and the wider community, again, about what active inference can really say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 619.609,
    "end": 629.626,
    "text": "I attended a talk by Tobias Schlicht last week about, well, I think it was predictive processing's flirt with transcendental idealism, but the conversation turned into a kind of map territory thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 630.147,
    "end": 630.788,
    "text": "And I think...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 631.527,
    "end": 640.195,
    "text": " A lot now, even people coming into active inference as a new field are very much aware of the importance of that conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 640.696,
    "end": 642.477,
    "text": "So that was one thing that I think was really, really helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 642.517,
    "end": 647.462,
    "text": "The other thing that always kept coming out was consciousness and the lived experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 647.482,
    "end": 652.127,
    "text": "And I think that's in part because that's really what my research focuses on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 652.167,
    "end": 659.914,
    "text": "And so people may have noticed that the podcast was slowly transforming into a podcast on consciousness, but so be it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 661.109,
    "end": 666.781,
    "text": " And in that case, I think all that was cemented was the fact that I don't think we know very much at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 669.367,
    "end": 673.836,
    "text": "So I mean that in terms of the metaphysical question, really the hard problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 674.086,
    "end": 696.55,
    "text": " then i guess on the flip side of that is the importance of taking lived experience very seriously and in my opinion always kind of starting with the phenomena doing the intricate and careful phenomenological analysis of the of the actual phenomenon in question before applying your models or running your experiments and so on so yeah the map territory consciousness um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 697.947,
    "end": 700.452,
    "text": " And, and much more, and much, much more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 700.673,
    "end": 703.599,
    "text": "And I think also just active influence is placed in the history of ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 704.941,
    "end": 719.331,
    "text": "Whether you are coming from a kind of computational stance, you're thinking about Helmholtz machines, or Jeffrey Hinton, or its relationship to neural nets, or whatever, or whether you're a phenomenologist, or whether you're an analytic philosopher of mine, like Thomas Metzinger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 720.256,
    "end": 725.342,
    "text": " just recognizing that the history and the future has come and will come after us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 725.403,
    "end": 730.128,
    "text": "And it's, I guess, always important to think about our place within that stream of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 732.131,
    "end": 732.932,
    "text": "Nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 732.952,
    "end": 733.693,
    "text": "But there was much more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 733.913,
    "end": 734.594,
    "text": "There was much more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 734.915,
    "end": 735.255,
    "text": "Oh, yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 735.676,
    "end": 743.365,
    "text": "I'll definitely look forward to not just re-listening, but also to jointly analyzing the core entities and the active inference ontology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 743.946,
    "end": 744.246,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 744.487,
    "end": 745.168,
    "text": "Two questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 745.788,
    "end": 746.289,
    "text": "One and two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 746.91,
    "end": 747.951,
    "text": "Take as long as you want.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 748.825,
    "end": 750.65,
    "text": " One, what is active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 751.512,
    "end": 756.043,
    "text": "Two, why is it important to have insights about active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 757.407,
    "end": 760.014,
    "text": "So I think my wife, I might have just put it there, but what's the first question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 760.034,
    "end": 760.916,
    "text": "What is active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 761.056,
    "end": 763.763,
    "text": "And the second one, why does it matter to have insights?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 764.519,
    "end": 769.183,
    "text": " Yeah, so an active inference is, as we all say, the corollary of the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 769.223,
    "end": 772.286,
    "text": "It's not the same as predictive processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 772.806,
    "end": 777.391,
    "text": "And I think that's an important proviso, although a lot of people conflate the two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 777.971,
    "end": 794.526,
    "text": "So the free energy principle tells you, in terms of mathematics, that a organism or an entity that persists over time can always be described as if it is minimizing this upper bound or surprise that we call variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 794.506,
    "end": 809.359,
    "text": " And then active inference, I've always... I think to be fair, there's an interesting meta question here about exactly what we are talking about when we talk about active inference, but I've always thought of that as the process theory associated with free energy minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 809.947,
    "end": 814.233,
    "text": " this as if or can be described as the relative is the kind of paramount thing here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 814.874,
    "end": 833.6,
    "text": "Because yes, indeed, there's a mathematical way that you could start from, like a Fokker Planck equation, or any sort of start from your theory of physics, which is that it's a, it's a, whatever it is, you know, you have you have your mathematical equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 834.361,
    "end": 835.262,
    "text": "And then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 836.137,
    "end": 843.855,
    "text": " you say, okay, well, therefore, given this, we can cast self-organization as this minimization of variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 844.737,
    "end": 851.412,
    "text": "The question is, okay, well, we make the axiomatic assumption that things do persist over time, so that's relevant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 851.847,
    "end": 858.32,
    "text": " But then the question really is, okay, given that things are persisting over time and given that they can, like, that is a really nice launch pad.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 858.34,
    "end": 859.743,
    "text": "How are things actually doing that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 860.665,
    "end": 867.158,
    "text": "And then I guess this is the overlap with things like autopoiesis and inactivism and cybernetics and all of this stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 867.659,
    "end": 869.322,
    "text": "Why is it relevant to study active influence?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 869.362,
    "end": 873.45,
    "text": "Well, I think because we have to take seriously the notion that things are self-organizing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 875.118,
    "end": 876.483,
    "text": " It's not a trivial fact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 877.748,
    "end": 884.554,
    "text": "This is, I think, Schrodinger's big insight back in the 50s, which was that life",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 884.939,
    "end": 887.984,
    "text": " is a quite miraculous phenomenon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 888.284,
    "end": 899.521,
    "text": "It is this negentropic phenomenon that seems to defy the second law of thermodynamics, or at least offer a quite interesting counterexample to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 899.561,
    "end": 907.673,
    "text": "And I know, again, this is not necessarily my field of expertise, but I know there's a broad domain of thinking why that happens in the first place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 908.054,
    "end": 913.562,
    "text": "I mean, why are these pockets of negentropy in the universe anyway?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 913.542,
    "end": 939.297,
    "text": " and this obviously can take you all the way to stuff like arguments from design um all the way back down to like the role of lived experience so i think it's very important to study self-organization and but that said it's important to realize that the mathematics won't take you all the way there so for me i've always viewed active inference in the furniture principle as a very interesting launch pad",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 940.34,
    "end": 948.243,
    "text": " but always with the recognition that the answer I don't think is, it can't be in the mathematics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 948.384,
    "end": 953.539,
    "text": "The mathematics, at least the way that I've always viewed it or come to view it as an instrumental tool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 954.346,
    "end": 958.813,
    "text": " a very insightful instrumental tool, but not, as we say, the territory itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 959.574,
    "end": 966.785,
    "text": "And I know Maxwell, who I just chatted with a couple of days ago, he's just released his preprint with Dalton and Carl, and they make very explicitly that point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 967.466,
    "end": 974.957,
    "text": "So I think the next steps in active inference is going to be something like, so what is the point, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 974.997,
    "end": 979.965,
    "text": "Like you have the maths and it's this really interesting descriptive tool, but then what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 980.097,
    "end": 984.029,
    "text": " And how secluded is it from what the brain is doing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 984.089,
    "end": 991.592,
    "text": "Because I think we forget that within the whole active inference ecosystem, although it's different,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 991.876,
    "end": 997.824,
    "text": " You do get these ideas coming in like predictive processing or predictive coding or discrete state space POMDP work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 998.484,
    "end": 1002.97,
    "text": "And that's much more of a process theory about actually what is the brain doing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1003.731,
    "end": 1013.243,
    "text": "And then, you know, within those theories, you start having the integration of stuff like active inference, oh, sorry, variational free energy and expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1013.844,
    "end": 1021.714,
    "text": "So for me, active inference is really interesting because one thing seems to be true, which is that we are self-organizing and self-maintaining and self-distinguishing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1023.314,
    "end": 1028.419,
    "text": " I think the real work needs to be done on saying, what is the instrumental tool?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1028.739,
    "end": 1031.342,
    "text": "What is actually happening in a realist manner?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1032.103,
    "end": 1034.525,
    "text": "And where are the where are the where?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1035.105,
    "end": 1036.427,
    "text": "How do we get from one to the other?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1036.827,
    "end": 1049.119,
    "text": "And obviously, this has been the paramount question throughout, but I think it's high time that someone comes in and really asked the sort of the path is like a generative passage, but for the for the science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1051.462,
    "end": 1053.346,
    "text": " Real active inference has never been tried.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1054.248,
    "end": 1061.604,
    "text": "Well, it was a stochastic differential equation which was escaping my attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1063.589,
    "end": 1067.918,
    "text": "What that very interesting account...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1069.349,
    "end": 1092.403,
    "text": " impresses on me is you started with the downstream relationship of active inference to free energy principles so that's the high road and in that sense there's a grounding in general thingness particular partition more like a systems theory then you said that's a launch pad to get down to the meeting point",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1092.434,
    "end": 1095.788,
    "text": " because you get that surprisal minimization VFE from the top.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1096.29,
    "end": 1102.174,
    "text": "And then with all of these existing Bayesian architectures as various low road,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1102.66,
    "end": 1131.553,
    "text": " paths those also have kind of convergently described the evidence lower bounds multiple ways to look it up but it's like vfe is coming from it's actually coming from the low road methodologically but it's as if it's coming from the high road so that's one place they meet then you said well that is like that's like another orthogonal launch pad for people who want to do something other than develop",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1131.854,
    "end": 1152.833,
    "text": " that infrastructure which will remain its own research program and direction and everything but then it's going to be that so what so what okay so we have rx infer with the drag and drop and everything works fine and here and then what so that's that's a very interesting and anticipatory",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1153.268,
    "end": 1159.141,
    "text": " I think just in first and foremost, always for anyone coming in, just recognizing that these things don't all mean the same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1159.181,
    "end": 1171.328,
    "text": "The free energy principle does not mean predictive processing, but it's a processing does not mean a, you know, it doesn't necessarily rely on an upper bound on surprisal and so on and so forth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1171.308,
    "end": 1184.323,
    "text": " And so I think all credit to Pa, Petsula and Friston for sketching this out quite effectively in their textbook and also the way that you guys teach this in the textbook group and then also the resources of the institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1185.825,
    "end": 1191.191,
    "text": "It's important, I think, I mean, there are lots of Twitter debates that rage about how ignorant the active inference community is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1191.771,
    "end": 1194.194,
    "text": "Interestingly, within the kind of ecosystem, they're not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1195.055,
    "end": 1200.201,
    "text": "And they're very, I personally think they're very humble and aware of the limitations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1201.582,
    "end": 1209.772,
    "text": " So, yeah, so I don't know what the ultimate solution and the synthesis is, whether there is such a thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1211.915,
    "end": 1224.61,
    "text": "But I think it's a kind of, we've got to start with the multiplicity before looking at the unity and then trying to see if there's unity in the multiplicity, which is sort of both McGilchrist and Hegelian all together, you know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1225.051,
    "end": 1230.137,
    "text": "And alluded to in the Neat and Scruffy, also early in the textbook,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1230.539,
    "end": 1247.063,
    "text": " um okay so that that's very interesting um so several paths ahead yes first how about some of your own directions and then we'll talk more about like where could insights go",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1247.617,
    "end": 1247.917,
    "text": " Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1247.957,
    "end": 1253.445,
    "text": "So I'm starting my PhD in October at Macquarie in Sydney.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1253.805,
    "end": 1257.03,
    "text": "So I'm my supervisor in Nez Hipólito and Rafael Milière.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1257.751,
    "end": 1261.836,
    "text": "And I'm very, very excited and very grateful to have the opportunity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1262.397,
    "end": 1268.906,
    "text": "I'm moving to the other side of the world as well, which is, albeit I am on the other side of the world right now, but actually setting up residence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1269.366,
    "end": 1271.97,
    "text": "It's slightly scary, but it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1271.95,
    "end": 1272.955,
    "text": " exciting, nevertheless.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1272.996,
    "end": 1278.585,
    "text": "And I want to explore principally subjectivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1278.785,
    "end": 1284.112,
    "text": " and the sense of self, as well as what if, like what a self is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1285.654,
    "end": 1288.718,
    "text": "So this, some of this is foreshadowed in the work that we did on flow states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1289.539,
    "end": 1296.008,
    "text": "So this was me, Lars, Karl, Riddhi, Jakob and Miles Tuft.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1296.028,
    "end": 1304.86,
    "text": "And I think there what became really paramount to me was that the notion of self, almost like the notion of active inference becomes conflated and confused.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1304.84,
    "end": 1312.87,
    "text": " because people don't make it clear whether they're talking about the metaphysical self as if there is a sort of Cartesian ego or a sense of self.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1313.191,
    "end": 1320.66,
    "text": "And even when they're talking about a sense of self, they're not distinguishing between a self as subject or a sense of self as subject and a sense of self as object.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1321.321,
    "end": 1323.544,
    "text": "So I'm really interested in subjectivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1323.924,
    "end": 1332.315,
    "text": "The fact that experience seems to have a certain for-me-ness, and there's an ongoing debate about the degree to which that's a universal condition of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1332.295,
    "end": 1343.248,
    "text": " So this is people like Anna Czajonica, but really going all the way back to Dan Sahavi and Joseph Parnas and Louis Sass all the way back into the 90s.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1343.808,
    "end": 1356.022,
    "text": "And I think linking all that together as well as an interest in being in the world in the Heideggerian sense and skillful coping in the sort of Dreyfusian, Merleau-Ponty sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1356.603,
    "end": 1360.868,
    "text": "So seeing if there's interesting connections between subjectivity and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1360.848,
    "end": 1385.033,
    "text": " this familiar coping that we have in the world so that's a couple of strands and then i think naturally from that one becomes embroiled in what is being in the world to what degree does it um involve representations there was just this big paper that came out led by johannes jaeger on the fact that relevance realization and agency and cognition therefore can't be computational so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1385.182,
    "end": 1388.689,
    "text": " For me, I read that and I think it's very Merleau-Ponty and very Dreyfusian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1389.55,
    "end": 1392.876,
    "text": "And so those are the big philosophers that kind of inform my thinking on this front.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1393.217,
    "end": 1400.17,
    "text": "So just seeing, I mean, it's all quite open, but I think hopefully there's a kind of cluster there that's emerging because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1401.095,
    "end": 1405.704,
    "text": " There is also a more meta question about the degree which we computationally model something like subjectivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1406.426,
    "end": 1415.063,
    "text": "If the fundamental aspects of cognition and agency aren't computational, algorithmic, and representational, then I think it's a fair presumption that subjectivity might not be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1415.745,
    "end": 1420.875,
    "text": "So this is a big mystery, basically, that no one knows where the four minas comes from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1420.855,
    "end": 1423.823,
    "text": " And first and foremost, no one really necessarily knows what the four minus is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1424.565,
    "end": 1434.673,
    "text": "So some people take almost without critical analysis that the four minus is because there is a self, a homunculus located behind the eyes for whom experience is given.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1434.713,
    "end": 1436.839,
    "text": "I think it's quite clear that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1436.819,
    "end": 1466.522,
    "text": " that isn't the case from the human analysis from the neuroscientific analysis so there's really nice work by people like kenneth williford um and going all the way back to aaron gerwich and sartre about the fact that consciousness might be the the subject of consciousness might be consciousness itself so it's exploring this kind of thing and then i then i guess for me as well something that's really important is collaboration um i've been really really really really lucky to be club to have collaborated already with really amazing people",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1466.958,
    "end": 1474.206,
    "text": " Not only the people on the flow paper, but also people like Libby Severs on the piece we did on Tourette's and self-modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1474.947,
    "end": 1485.358,
    "text": "So really just trying to get integrated into this community, this philosophical, this theoretical biological community as much as possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1486.239,
    "end": 1489.463,
    "text": "And then seeing again what active inference can do for all of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1489.883,
    "end": 1496.29,
    "text": "So I think not necessarily making active inference the front and center,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1496.742,
    "end": 1509.346,
    "text": " because I'm not sure, I don't think I could without necessarily because of all of the big meta scientific questions that reside in active inference, the map territory thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1510.429,
    "end": 1517.923,
    "text": "So I think using it as a tool, and then if there are developments either done by myself or other people about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1518.983,
    "end": 1541.211,
    "text": " a more biologically realist robust theory of actually what the brain is doing but absolutely fleshing that out and trying to do this what maxwell and others have called the generative passage tying phenomenology or the lived experience to modeling to experimentation but always always being aware of just how",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1541.191,
    "end": 1562.659,
    "text": " fraught with danger or how precarious and fragile that passage can be so that's the idea at least it's quite broad it will narrow down cool wow well that's it's exciting to begin the phd um what you said about active inference not being front and center",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1562.69,
    "end": 1584.732,
    "text": " for some reason it made me think of like famous or powerful photography or documentation and it's like the map and the methodology so it'd be like the open source methods element however outside of the gear enthusiasts connoisseur respecter development community it'd be like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1584.712,
    "end": 1613.47,
    "text": " okay but what about the picture so so not that that's a reductionist view on the totality of like photography or anything like that but just like yeah it it may become relevant for a larger and larger fraction to focus on how that picture looks rather than um that's absolutely right what the methods and the tools are i think just i just think maybe because of the way i'm composed and maybe because my background is ultimately in philosophy of mind and philosophy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1614.563,
    "end": 1621.091,
    "text": " I do think for myself, starting with the phenomena is the first place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1621.852,
    "end": 1624.936,
    "text": "Not only never forgetting the phenomena, but starting with the phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1625.277,
    "end": 1626.859,
    "text": "So I've just been writing this thing about attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1628.261,
    "end": 1639.255,
    "text": "And it's funny how strange the notion of attention can be once you lose sight of how it actually phenomenologically unfolds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1639.471,
    "end": 1641.396,
    "text": " and how it structures consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1642.198,
    "end": 1648.475,
    "text": "So for me, and again, this is not disrespecting anyone who wants to start with the modeling or wants to start with the map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1649.418,
    "end": 1653.328,
    "text": "But I'm probably inclined to go the other way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1655.992,
    "end": 1680.092,
    "text": " that makes me think about textbook group it's like quite literally sometimes circle square line circle square yeah o s a b c d e and then it's like well even if you were going to make a map of your street and intersection you'd be talking about like 20 to 100 circles and squares",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1680.697,
    "end": 1684.802,
    "text": " pulled up to the level of abstraction of something like a POMDP.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1684.822,
    "end": 1687.926,
    "text": "And then that's like getting into the multi-agent and all of these concepts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1688.486,
    "end": 1691.81,
    "text": "And then also it made me think of like, what is this obviously?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1691.83,
    "end": 1693.913,
    "text": "Great question to do the PhD in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1694.594,
    "end": 1699.139,
    "text": "And the immune system and the sensory and the effector and all these different self concepts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1699.56,
    "end": 1709.151,
    "text": "And then seeing what's happening now with like agentic AI agents defined in terms of like perception and action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1709.131,
    "end": 1731.257,
    "text": " which is like one thingness and then at the same time as Maxwell also emphasized in the Discord recently like the agentic focus which is one system of interest or genre of system of interest actually minimizes the apparent scope because especially grounded more in the high road of just how things",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1731.355,
    "end": 1754.916,
    "text": " are as if they are rather than any particularly built architecture then it's like yeah there's no reason why it should be kind of an agentic boundary it could be like an ecosystem of shared intelligence and then that's where all these self-concepts are in like a kind of multiplicity almost by definition sure i mean i guess i guess ultimately",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1756.938,
    "end": 1780.65,
    "text": " don't know um so so like this notion of individuated selves is is in many ways uh at least i've always taken it to be an underlying axiom of active inference right i mean if one was to say that well we're all just non-individuated things in the soup then you can't really apply the mark or blanket partition in the first place so it's a healthy way to start",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1781.508,
    "end": 1788.798,
    "text": " But even if you read, I mean, I was just reading something yesterday on, it was like autopoetic, autonomic, and activism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1790.04,
    "end": 1792.403,
    "text": "So just, it was a really interesting piece.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1792.924,
    "end": 1794.006,
    "text": "See if I can find who wrote it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1794.026,
    "end": 1795.528,
    "text": "It was very good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1796.109,
    "end": 1809.287,
    "text": "But ultimately, and they were trying to do is saying, okay, why is inactivism, why are there being these two strands of inactivism, sensory motor inactivism, and then autonomic based on basically autopoetic inactivism?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1809.706,
    "end": 1820.378,
    "text": " and trying to kind of merge the two and saying, okay, well, what's at the heart of living might be something like sensory motor and activism, but not discounting the fact that there is this operational closure within the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1821.279,
    "end": 1829.509,
    "text": "But again, one has to recognize there that like there's a kind of embedded circularity, which is that we already take the system for granted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1829.649,
    "end": 1834.935,
    "text": "So we're saying like, what allows the system to self-maintain?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1834.975,
    "end": 1838.92,
    "text": "Well, it's operational closure, but thermodynamic openness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1839.406,
    "end": 1841.428,
    "text": " And then, but what does that do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1841.468,
    "end": 1846.294,
    "text": "Well, it maintains the self-organization and allows for self-maintenance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1846.314,
    "end": 1852.461,
    "text": "And so there is, and this is obviously recognized by those authors, there is this kind of inherent circularity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1853.642,
    "end": 1861.431,
    "text": "And this notion of like a strange loop has clearly always been pointed to at the heart of intelligence and cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1862.002,
    "end": 1874.001,
    "text": " I think also getting to the bottom of that circle, which for many philosophers would be problematic, but actually for these theorists is kind of at the very heart of their theories, is a really interesting thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1874.482,
    "end": 1885.44,
    "text": "But yeah, again, not forgetting that literally recognizing or believing theoretically that there are individuated things can look like an axiomatic presupposition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1886.001,
    "end": 1889.106,
    "text": "And in active inference, it almost certainly is one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1890.014,
    "end": 1892.558,
    "text": " Yeah, I mean, what is a self really is the big question, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1893.039,
    "end": 1895.103,
    "text": "There's really good paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1895.123,
    "end": 1895.704,
    "text": "I always do this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1895.784,
    "end": 1897.006,
    "text": "It's like I'm in podcast mode again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1897.086,
    "end": 1898.97,
    "text": "But it's Varela.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1899.471,
    "end": 1900.132,
    "text": "I think it's 1991.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1900.793,
    "end": 1904.119,
    "text": "It's called A Meshwork of Selfless Selves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1904.7,
    "end": 1905.181,
    "text": "Really good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1905.902,
    "end": 1907.044,
    "text": "Really, really good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1907.024,
    "end": 1933.116,
    "text": " because again it's not saying that this is a self in the sort of strict cartesian way that we all might have a focus psychology theory of but like some of these are intuitive or viable ways that we could define the self whether this is a sensory motor boundary a cellular boundary and so on and so forth so yeah it's it's a surprisingly elusive concept the self yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1933.568,
    "end": 1960.774,
    "text": " so much to say on that i mean even if you apply a utilitarian or pragmatist approach to your own agency over an attentional profile over self-concepts it would be like that's the strangeness or part of the strangeness and the second order cybernetics with the observation okay i'll read some comments from the live chat and we'll keep talking about this before we do eventually talk about like where the series goes okay upcycle club writes greetings wave hand emoji",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1961.108,
    "end": 1964.212,
    "text": " I have really enjoyed the Insights Active Inference series with Darius.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1964.392,
    "end": 1966.495,
    "text": "I wish you all the best in your future endeavors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1967.276,
    "end": 1967.736,
    "text": "Well, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1967.756,
    "end": 1968.397,
    "text": "That's very kind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1968.878,
    "end": 1970.58,
    "text": "I mean, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1970.64,
    "end": 1972.182,
    "text": "Yeah, go, go, go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1972.202,
    "end": 1972.402,
    "text": "Oh, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1972.603,
    "end": 1973.223,
    "text": "Thanks, Upcycle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1973.343,
    "end": 1973.564,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1973.664,
    "end": 1977.108,
    "text": "Terry Muldoon writes, I've loved the talks, the latest one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1977.549,
    "end": 1985.819,
    "text": "I really thought the free energy principle could resolve the different approaches if you remove the idea of a preordained agency of the individual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1986.28,
    "end": 1986.78,
    "text": "Make sense?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1989.464,
    "end": 1989.664,
    "text": "Um...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1991.028,
    "end": 1993.515,
    "text": " Yeah, I mean, again, it depends on how you define agency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1994.217,
    "end": 2006.691,
    "text": "But if you just define agency as the ability to, again, in an activist tradition, to set your own norms and standards with respect to your surrounding milieu,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2006.671,
    "end": 2009.658,
    "text": " then active inference is very consonant with those ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2010.119,
    "end": 2022.267,
    "text": "So I'm not too sure whether you can really discard the notion of agency when you're talking about active inference, because at the very heart of active inference is the sensory motor contingency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2022.247,
    "end": 2026.374,
    "text": " So, again, I think it's like depends on what one means by agency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2026.394,
    "end": 2035.228,
    "text": "If, I mean, clearly, there are things that don't necessarily move and change the world according to their internal norms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2035.289,
    "end": 2037.653,
    "text": "And by this, I don't mean conscious norms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2037.793,
    "end": 2041.519,
    "text": "I mean, the norms that an E. coli bacterium would have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2042.22,
    "end": 2046.828,
    "text": "And for those, I guess, at the, you know, the mark of blanket, you just leave the active partition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2047.228,
    "end": 2047.529,
    "text": "No.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2048.43,
    "end": 2049.452,
    "text": "But",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2049.432,
    "end": 2058.248,
    "text": " No, I mean, I don't think active inference completely flattens out this distinction between agentic and non-agentic systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2059.55,
    "end": 2065.821,
    "text": "In many ways, it might reinforce this idea that agency is active inference and active inference is agency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2066.425,
    "end": 2069.835,
    "text": " again, always just an epistemic humility, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2069.915,
    "end": 2081.43,
    "text": "I don't know what the free energy principle solves, but I don't think it's going to be able to discard and dispense with agency so thoroughly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2081.9,
    "end": 2086.567,
    "text": " Okay, Terry added, like an emotional volition, which I think gets added after the event.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2086.627,
    "end": 2103.132,
    "text": "Well, what I think is interesting about this and relates to your flow work and some of the other discussions that have come up about time is that view from the inside and view from the outside of potentially timescales",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2103.112,
    "end": 2132.983,
    "text": " that are working in this integrated way where there's this kind of like it's it's a complex moment what is happening and that's even before getting into like different ways we can think about space time so it's like in that rewriting pre-writing now casting body integrating zone there's so much to explore and and like you said about the map territory earlier it's like good to go into a complex territory",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2133.284,
    "end": 2160.557,
    "text": " knowing what's a map and what's the territory at least in kind 100 and so whenever you know we there is a there is a pom dp in the flow states paper and in the tourette's paper but hopefully it's made pretty clear that this is an idealization um i was very lucky actually as an undergrad to study chomsky in linguistics and the notion of idealization comes up a lot in chomsky and so i think i was at least in that sense quite well i know i said earlier i'm not a philosopher of science but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2160.537,
    "end": 2181.988,
    "text": " there was some we had there were quite a few discussions about idealization and science so yeah in those cases i mean god knows how recursive and hierarchical these layers are and i think in some cases all you have to do is point at it and say you know at this degree of complexity one must remain silent there's an interesting thing there about um emotion coming after the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2182.087,
    "end": 2183.629,
    "text": " after the phenomenon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2183.649,
    "end": 2185.432,
    "text": "I'm not quite sure I agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2185.472,
    "end": 2192.521,
    "text": "I mean, I had flirted with the idea that, for example, in flow states, there is no consciousness or at least no emotion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2193.002,
    "end": 2194.564,
    "text": "There is an ongoing discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2194.584,
    "end": 2207.942,
    "text": "Again, I'm not an emotion theorist, but I believe it's within appraisal theory about the fact that just because if we take emotion to be an appraisal of, let's say, an interoceptive signal, it doesn't actually have to mean that this can only be done offline.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2208.344,
    "end": 2227.72,
    "text": " could be done in real time and i think informed again by someone like dreyfus or merle ponti that's that's quite right um the emotion in many ways whether it's now there's an interesting question here is about actually what the causal role of that emotion is because there are two different things that one is its causal role and one is its temporal um status",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2228.257,
    "end": 2252.053,
    "text": " interesting uh causal role is where that emotion actually does anything for the organism who's trying to return to this kind of equilibrium or what um dreyfus would call your sort of optimal grip with the gestalt so i don't know i i don't think the flowing agent is non-conscious i don't think they're a robot um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2252.354,
    "end": 2263.695,
    "text": " So no, ultimately, to answer your question, I don't think the free energy principle solves everything by dispensing with agency, because one, I don't think it can answer the question of agency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2264.095,
    "end": 2269.144,
    "text": "Two, I don't think there's a robust definition of agency within the free energy principle literature or elsewhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2269.164,
    "end": 2276.117,
    "text": "And thirdly, under certain definitions, agency is inbuilt within actively inferring agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2277.11,
    "end": 2284.368,
    "text": " Note that I'm using agents with speech marks because when I talk about agent, I'm not talking about some Cartesian homunculus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2285.03,
    "end": 2293.11,
    "text": "So big questions, big questions, which need lots of years of deep delegation to resolve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2293.377,
    "end": 2313.968,
    "text": " cool okay more to the operational closure yes so having organized many many live streams and worked with many people what was very different about your co-organizing was basically you did all the invitation you recorded it and just shared the upload so yeah logistically",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2313.948,
    "end": 2343.027,
    "text": " what did it take in terms of research background prep confirmation all that kind of stuff how would you evaluate that and or how how would you we'll just ask that question first just how was it how was it and how you actually did it well i i like doing this stuff so i love emails um and maybe this is a betrayal of my age and inexperience but i love sending emails so well you very finally had to spread we have a spreadsheet",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2343.007,
    "end": 2344.589,
    "text": " which is going to be hidden from everyone else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2344.609,
    "end": 2347.732,
    "text": "But we have a couple of codes, a spreadsheet where we have just a list.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2347.752,
    "end": 2351.737,
    "text": "I think there was a list of people who had been on live streams before and then maybe potential guests.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2352.137,
    "end": 2355.561,
    "text": "And then we did another one where it was people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2355.822,
    "end": 2357.644,
    "text": "And then there was a way of sort of categorizing people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2357.684,
    "end": 2358.405,
    "text": "I'd invited people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2358.445,
    "end": 2360.627,
    "text": "I was thinking of invited people that had been on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2360.647,
    "end": 2364.572,
    "text": "So for me, I mean, the one was recognizing this as an active inference podcast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2364.792,
    "end": 2367.495,
    "text": "So starting with the kind of canonical figures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2367.998,
    "end": 2370.744,
    "text": " That said, there were some canonical figures who didn't appear on the show.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2370.964,
    "end": 2379.904,
    "text": "So that might be, we could talk about that and who else could be there because there were certain people who I think were meant to come on and then there were logistical timing issues and so we can get to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2379.944,
    "end": 2387.661,
    "text": "But I think for anyone listening who wants to do something like this, people are unbelievably receptive and generous with their time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2387.641,
    "end": 2408.89,
    "text": " um so really ultimately it was just a question of asking of course there are ways of asking so i was always you know one always has to be very polite and considerate and if people say no which some people did then that's totally fine um but really it was just a question of asking so we use zencaster which is a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2409.916,
    "end": 2412.786,
    "text": " podcasting tool that only works on Google Chrome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2413.468,
    "end": 2414.632,
    "text": "And they've been really good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2414.713,
    "end": 2417.161,
    "text": "I mean, what's nice about them is I think they're a really small company.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2417.803,
    "end": 2420.854,
    "text": "And so whenever I had sort of little issues",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2421.003,
    "end": 2450.419,
    "text": " would just ask them and they would get back to me super quickly so shout out to zen caster and then i guess logistically the only other thing was just how big those files got so a warning i mean people who do podcasts and live streams will know i mean these were big you know 24 25 gig things and so good wi-fi and an external hard drive turned out to be useful but no it it's it's quite respectfully i'd say it's gone quite smoothly don't get me wrong it's a learning process",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2450.483,
    "end": 2466.484,
    "text": " so daniel you'll know this there's a like one starts with no i mean right now i'm just on my laptop but people probably be able to notice the difference right i don't have a light in front of my camera i don't have a different camera i don't have a microphone",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2467.038,
    "end": 2471.005,
    "text": " And so I think it's an optimization thing, like active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2471.626,
    "end": 2476.796,
    "text": "It's sort of going, okay, I'm starting from here and I'm accepting myself from starting here as the complete layman, the novice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2477.557,
    "end": 2482.566,
    "text": "And I didn't really set myself a goal of where I wanted to end up, but I just knew I could get better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2483.17,
    "end": 2489.04,
    "text": " And I hope and people seem to think that the quality of it has gone up and up as time's gone on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2490.222,
    "end": 2492.145,
    "text": "But I think there's still massive scope.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2492.926,
    "end": 2493.948,
    "text": "And it's super cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2493.968,
    "end": 2495.431,
    "text": "You guys now have charity status.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2495.751,
    "end": 2497.995,
    "text": "And hopefully that sort of raises the ceiling here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2498.015,
    "end": 2501.24,
    "text": "And so yeah, I mean, personally, I'm just really excited to see where this can go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2501.26,
    "end": 2506.95,
    "text": "Recognizing also the podcast base is a little is a little bit saturated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2507.656,
    "end": 2520.654,
    "text": " And so I think when we talk about pushing this podcast forward, thinking about how we can be innovative in setting up new schema for guests and live streams throughout.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2520.674,
    "end": 2527.403,
    "text": "So yeah, surprisingly quite a sort of fluent and not too tricky process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2527.973,
    "end": 2530.576,
    "text": " How would you see it continuing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2530.616,
    "end": 2545.755,
    "text": "Like what would a very cool volunteer or intern or research fellow do or how could they kind of jump in and continue just thematically and from the same like intention center?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2545.855,
    "end": 2548.699,
    "text": "Like what do you see that as actually being like for someone to do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2549.624,
    "end": 2554.34,
    "text": " I think ultimately, first and foremost, I would always just say, speak to the people that you're interested in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2554.36,
    "end": 2560.039,
    "text": "This is a sort of trope, I think, in podcasting, which is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2560.323,
    "end": 2582.685,
    "text": " know there's a vacuum going on someone's going off well hold on this is this is the issue of doing this in an el salvadorian hostel there's a lot of noise everywhere um but i think ultimately okay you know the audience is going to be it's going to be quite evident to the audience if you're doing it for them and i'm not saying this got discount the interest of the audience but i",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2583.813,
    "end": 2585.496,
    "text": " I loved everyone I spoke to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2586.017,
    "end": 2595.734,
    "text": "So I think whoever the research is, the podcast is ensuring that they know who they want to speak to is really important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2596.094,
    "end": 2597.637,
    "text": "I think preparation was really important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2597.677,
    "end": 2600.201,
    "text": "Now, I don't mean writing down all the questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2600.221,
    "end": 2600.923,
    "text": "You don't do this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2601.604,
    "end": 2603.527,
    "text": "I don't mean writing down all the questions you're going to ask.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2603.547,
    "end": 2606.412,
    "text": "I always really had about three or four themes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2607.573,
    "end": 2613.502,
    "text": " And maybe in certain cases, an actual like well-formed question because it might have been slightly recursive and complicated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2614.463,
    "end": 2618.789,
    "text": "But generally, and I always said this to guests before we went live, it's meant to be free flowing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2620.131,
    "end": 2625.339,
    "text": "So I think keeping that, at least for the podcast space, is really important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2626.32,
    "end": 2632.669,
    "text": "I think that said, could the community actually be even more personal?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2633.324,
    "end": 2641.794,
    "text": " you know, one of the really nice things that you guys did was the interview with Carl, which I love, I love, I think it's great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2641.814,
    "end": 2646.319,
    "text": "And so I think even little stuff like that could be really nice additions to the process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2647.08,
    "end": 2653.748,
    "text": "Because, well, for many people, the only thing they see are their work and their Twitter account.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2653.788,
    "end": 2657.212,
    "text": "So so kind of getting to know people, I think is relevant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2657.933,
    "end": 2659.855,
    "text": "And then Yeah, I mean, final thing I'll say is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2661.134,
    "end": 2668.321,
    "text": " I don't think we should silo ourselves in to only speak to people that we agree with, intellectually speaking, in this case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2668.662,
    "end": 2690.584,
    "text": "And so constantly, you know, whether that's people who have actually been actively critical of active inference in writing in the past, so I don't know, Ezequiel de Paolo or Evan Thompson or someone like this, or even someone who you know might not just be a, even someone within the community, right, like myself, who is not dispensing with the map territory distinction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2690.885,
    "end": 2695.691,
    "text": " just having that dialectic is really, really important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2696.172,
    "end": 2697.593,
    "text": "So yeah, I think there's plenty there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2697.613,
    "end": 2699.235,
    "text": "I mean, I'd love to see it continue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2700.397,
    "end": 2704.562,
    "text": "I would watch every episode, like an avid supporter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2705.083,
    "end": 2710.53,
    "text": "And yeah, again, I'm just super, yeah, I'd be very happy to help out wherever I can.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2710.55,
    "end": 2715.035,
    "text": "But for me personally, and we spoke about this, it's kind of time to lock in, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2715.836,
    "end": 2717.718,
    "text": "I think this is one of those things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2717.759,
    "end": 2719.761,
    "text": "I mean, I don't know, I'll ask you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2720.045,
    "end": 2724.572,
    "text": " I think at some point to be totally candid, I was slightly worried that I was becoming a podcaster.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2725.753,
    "end": 2732.703,
    "text": "And I guess for me, what I want from my academic life at least is to be writing and reading and doing academic work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2733.444,
    "end": 2735.768,
    "text": "So I'm curious about your experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2735.828,
    "end": 2744.28,
    "text": "How much do you feel like the stuff that you do takes away time for writing, reading and doing the kind of canonical academic activities?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2745.307,
    "end": 2761.847,
    "text": " that's a great question so it's um there's a lot to say on it and and uh of course what i can say about my own last like 10 years doesn't apply necessarily broadly but during graduate school from 2014 to 2019",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2761.827,
    "end": 2791.53,
    "text": " was doing multiple weeks plus of field work in the desert and while i was on stanford campus i was not taking video meetings i was not like in the digital so during graduate school absolutely it makes sense to be really focused and then one thing i started exploring at the end of graduate school was live streaming some overhead view hand drawing so with no audio",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2791.932,
    "end": 2801.2,
    "text": " So that got me familiar with OBS, the open source broadcasting software, and just the logistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2801.568,
    "end": 2824.369,
    "text": " of doing something that is largely improvisational so not preparing more than oh maybe here's a reference image okay yeah so getting the time of live streaming as close to real time which is this kind of like marshall mcluhan angle on the whole thing plus like people's feedback so that's like one sort of lane",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2824.349,
    "end": 2853.816,
    "text": " which even now doesn't take much more time than like you mentioned several emails and the time itself and then where it starts to really be like okay this is like reading the paper making the slides that the question is how slash is that aligned with like relevant learning and research formats so like the dot zero style video um that kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2853.965,
    "end": 2880.883,
    "text": " came into play with just the pure background and context before even if we had a broader discussion on the paper that was like almost exactly the lab meeting slides which then during the second half of the lab meeting we okay go back to figure three or like what where was the abstracts like being able to have sections up there on the slide form and have one person who could say like that they had really fully gone through the whole thing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2880.863,
    "end": 2899.108,
    "text": " So again, that's the conversation with the literature, but from a combination of alignments of education, research, service, interest, and then the logistical element of most streams not taking more, but then there is still that element of just like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2900.033,
    "end": 2901.254,
    "text": " what has happened?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2901.274,
    "end": 2904.558,
    "text": "Um, but you know, that's Daniel, you're, you're, you're a beast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2904.678,
    "end": 2907.982,
    "text": "I mean, like, it's worth saying, you know, I think everyone's very grateful for the work you've done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2908.002,
    "end": 2910.265,
    "text": "I mean, it's like, there's nothing else like it really.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2910.986,
    "end": 2915.631,
    "text": "So, I mean, not to be, not to speak out of turn, but like, well done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2915.651,
    "end": 2917.833,
    "text": "Like, it's really, it really is something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2918.434,
    "end": 2924.841,
    "text": "And I think also like to say that this is the place to go to learn about active influence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2924.861,
    "end": 2927.104,
    "text": "I mean, I came to this, you know, I didn't,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2928.383,
    "end": 2933.442,
    "text": " the institute is known and I mean the discord is getting bigger and bigger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2933.462,
    "end": 2935.65,
    "text": "And so yeah, it's really remarkable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2936.253,
    "end": 2938.461,
    "text": "You know, for me to be in London,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2938.913,
    "end": 2944.341,
    "text": " with not even necessarily over active inference people and then go, oh, well, I know there's a textbook group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2944.401,
    "end": 2945.583,
    "text": "I know there's this chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2945.663,
    "end": 2950.15,
    "text": "I know that, you know, Daniel is doing this and that is a real sign of success.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2951.131,
    "end": 2953.415,
    "text": "And so long may it continue, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2953.555,
    "end": 2958.182,
    "text": "But yeah, I think something you said there was I forgot to mention was all the paper reading.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2958.462,
    "end": 2962.168,
    "text": "So I hope this is quite obvious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2962.929,
    "end": 2965.613,
    "text": "Obviously, one has to know what who they're talking to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2966.774,
    "end": 2971.38,
    "text": " And so I think this in many ways informs my thing about speak to people that you want to speak to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2971.42,
    "end": 2979.01,
    "text": "Now I'm quite lucky because I basically love reading academic papers, but me, it's just a hobby, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2979.05,
    "end": 2980.652,
    "text": "Like, so it doesn't feel like work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2981.613,
    "end": 2982.294,
    "text": "I love reading books.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2982.314,
    "end": 2983.316,
    "text": "I'll read academic papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2983.856,
    "end": 2984.738,
    "text": "I was also really lucky.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2984.938,
    "end": 2988.883,
    "text": "And I think this is just a logistical point that I had institutional access throughout.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2989.032,
    "end": 3007.75,
    "text": " this is a broader educational point which is a lot of people don't have access to papers if they're not open access so i think that is probably the majority of the time goes into reading papers reading the papers of the people you're going to be speaking to and making sure that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3008.017,
    "end": 3017.167,
    "text": " the questions that you ask are really tied to their work, because there's no point in me speaking to Ian McGilchrist about quantum mechanics, really.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3018.829,
    "end": 3023.795,
    "text": "I'm sure he'd have something actually quite miraculous to say, but you get my point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3026.137,
    "end": 3037.23,
    "text": "Maybe this is something that the Institute could also work on, finding a way for people to access papers, because for the vast majority of people who don't have a .edu, they can only see the abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3039.573,
    "end": 3044.985,
    "text": " But yeah, on the whole, yeah, it's been a really, really splendid experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3045.126,
    "end": 3050.638,
    "text": "I mean, I think there are plenty of people as well that we could get on who would have lots to say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3050.658,
    "end": 3052.543,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3053.144,
    "end": 3055.81,
    "text": "Yeah, I think maybe we could do something like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3056.178,
    "end": 3086.185,
    "text": " see who's interested you could ask a few people and the time will be right when the time is right so there's no right need to um to jump on it i think to to ferment and digest with like the 50 hours or whatever it is there's a lot there's a lot there's a lot there that people i hope will be able to glean maybe not even insights from but just you know i think the role of philosophy in many ways is is finding the right questions to try and answer",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3086.941,
    "end": 3089.445,
    "text": " So it's not necessarily always about answering the questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3089.485,
    "end": 3090.947,
    "text": "It's about structuring the conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3092.429,
    "end": 3099.118,
    "text": "And so hopefully we've opened up that landscape where the questions now are more concretized in people's heads, the relevant questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3100.16,
    "end": 3100.6,
    "text": "So yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3101.381,
    "end": 3102.543,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3102.663,
    "end": 3104.986,
    "text": "I mean, I don't know, hopefully an intern's watching.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3105.167,
    "end": 3107.269,
    "text": "I love this internship thing that you guys are doing as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3107.43,
    "end": 3110.634,
    "text": "Um, and they're interested in taking it on because it's all theirs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3110.734,
    "end": 3114.079,
    "text": "But again, as I say, whoever's watching and might be interested, I am.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3114.498,
    "end": 3122.322,
    "text": " albeit although on the other side of the world right now in not the most Wi-Fi robust place, although I have found some good Wi-Fi, I'm always very happy to help.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3122.342,
    "end": 3123.546,
    "text": "Always very, very happy to help.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3124.623,
    "end": 3126.646,
    "text": " We will see him we'll explore it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3126.967,
    "end": 3133.616,
    "text": "So Thank You Darius for the very unique series Thanks, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3133.636,
    "end": 3151.423,
    "text": "And and I also again, thank you for all your help and blur and Ali and everyone who's part of the Institute there was like loads and loads and loads of work that goes in that people don't see and obviously like they see my face but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3151.403,
    "end": 3173.04,
    "text": " yeah you guys have been incredibly helpful and generous with your time and so i'm really genuinely super super grateful thank you i think there's a piece there about like the future of content slash attention and whether and where we would really want a person like where i would want to know what you thought",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3173.813,
    "end": 3192.291,
    "text": " and where we'll be able to use synthetic methods to just like generate different kinds of material that would flood and potentially be indistinguishable or even preferable on certain ways, then the real conversations, real dialogos that people would have an experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3192.311,
    "end": 3199.137,
    "text": "So I think that like it, you know, the way that you kind of also help frame it in that context is awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3199.157,
    "end": 3200.759,
    "text": "So thank you again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3200.779,
    "end": 3203.061,
    "text": "Although just a final thing I'll say on that,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3204.779,
    "end": 3223.902,
    "text": " think there's something very special about two humans speaking to one another um and i think like all i'll say is without the appropriate embodiment the appropriate social context the approachable enculturation and so on and so forth to have genuinely the effect",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3224.017,
    "end": 3245.772,
    "text": " of genuinely not just mimic but replicate the effect that can happen when the true dear logos is happening within two uh you know among two artificial bodies in this case i will i will i will just say that i'm skeptical but in the meantime let the humans talk",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3247.76,
    "end": 3248.823,
    "text": " And I'm sorry for sweating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3248.963,
    "end": 3250.447,
    "text": "It's 35 degrees here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3250.467,
    "end": 3251.75,
    "text": "So invariably there is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3251.89,
    "end": 3253.755,
    "text": "This is not glamorous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3254.577,
    "end": 3255.018,
    "text": "There is sweat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3256.141,
    "end": 3256.903,
    "text": "And more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3257.084,
    "end": 3258.046,
    "text": "So thank you, Darius.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3258.768,
    "end": 3259.069,
    "text": "See you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3259.089,
    "end": 3259.891,
    "text": "Thanks, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3259.911,
    "end": 3260.232,
    "text": "Peace.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3260.412,
    "end": 3260.773,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  }
]