[
  {
    "start": 2.63,
    "end": 3.712,
    "text": " All right, welcome everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5.554,
    "end": 9.941,
    "text": "It's cohort six and our second discussion of chapter one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10.222,
    "end": 12.565,
    "text": "So Andrew and Ali, thanks for facilitating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 13.046,
    "end": 18.214,
    "text": "Just take it from here, wherever you want to pick up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 24.383,
    "end": 26.326,
    "text": "Andrew, would you mind taking the lead on this one?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 27.208,
    "end": 27.388,
    "text": "Sure.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 28.685,
    "end": 58.438,
    "text": " yeah so i know um yeah absolutely so welcome cohort six this is week two that we're spending on chapter one of the textbook um i'm not sure what was discussed at the last meeting but i thought it might be worthwhile for some of the folks who are unable to attend the morning meetings to maybe just quickly move through um the sections of the textbook um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 59.92,
    "end": 63.125,
    "text": " just to quickly get a bit of a recap or overview.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 64.087,
    "end": 77.208,
    "text": "Yeah, the overview, we began with a nice brief introduction describing what's going to be happening in this chapter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 77.268,
    "end": 82.056,
    "text": "We already get off the bat that active inference is a normative perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 82.156,
    "end": 85.742,
    "text": "It's starting from first principles.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 86.6,
    "end": 88.002,
    "text": " Move on to section 1.2.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 88.162,
    "end": 96.254,
    "text": "It's some quick explanations regarding the relationships between things like actions and sensory observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 97.235,
    "end": 105.207,
    "text": "Specifically, the living organisms can only maintain their bodily integrity by exerting adaptive control over the action perception loop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 105.747,
    "end": 113.198,
    "text": "This means acting to solicit sensory observations that either correspond to desired outcomes or goals,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 113.178,
    "end": 124.577,
    "text": " such as the sensations that accompany secure nutrients and shelter for simple organisms or friends and jobs for more complex ones or help in making sense of the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 125.258,
    "end": 133.532,
    "text": "This is carried out through there's a rather recursive nature to this cycle of action perception loops.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 133.985,
    "end": 148.922,
    "text": " Also, whenever we move on to looking at more complex organisms, there's the assumption that organisms can increasingly use more complex adaptive strategies to adjust to their environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 149.695,
    "end": 172.783,
    "text": " section 1.3 still more on um first principles get an introduction to this uh this kind of i don't want to call it ad hoc because i think these conversations have been had before but it's a little light-hearted i suppose this meets versus scruffy's uh division that's made right and so um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 174.198,
    "end": 189.051,
    "text": " scruffies being like, these are folks who will approach these kinds of problems, but maybe from within their particular field or subfield, they don't want to, you know, forego any kind of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 189.284,
    "end": 195.313,
    "text": " kind of idiosyncrasies or specificities to their objective study.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 196.996,
    "end": 212.22,
    "text": "So maybe not so quick to jump to some kind of broader unifying framework to analyze things whenever you might let go of some of the specificity of the problem you're looking at.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 212.572,
    "end": 213.213,
    "text": " J. Sam Hurley, Ph.D.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 213.193,
    "end": 221.11,
    "text": ": In anthropologists will have disagreements with sociologists and so on, about what what defines like a society or culture or otherwise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 221.671,
    "end": 223.235,
    "text": "J. Sam Hurley, Ph.D.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 223.215,
    "end": 231.492,
    "text": ": Nonetheless, needs are those who do seek unification beyond heterogeneity of brain and mind phenomena.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 232.062,
    "end": 234.786,
    "text": " And that is the perspective that active inference takes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 234.826,
    "end": 261.563,
    "text": "It does, in fact, attempt a kind of unified framework at looking at diverse scenarios and organisms ranging from human beings and entire cultures who are operating at different time scales of the way, at fast time scales of what they're immediately observing and perceiving, all the way up to slower time scales of planning, learning,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 262.488,
    "end": 266.558,
    "text": " Joe Trumpey, organizing with a group development of institutions and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 266.578,
    "end": 274.898,
    "text": "Joe Trumpey, Section 1.4 is a good overview kind of structure of the book.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 274.918,
    "end": 275.299,
    "text": "Joe Trumpey, um.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 279.177,
    "end": 282.887,
    "text": " 1.4.1 active inference in theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 282.947,
    "end": 286.617,
    "text": "We get more about surprise minimization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 286.657,
    "end": 295.6,
    "text": "We're also introduced to variational free energy in the next paragraph there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 295.58,
    "end": 312.957,
    "text": " they keep it short in describing why we might look at variational free energy as opposed to surprise, which seems like a much more intuitive concept for one to be surprised at unexpected phenomena or observations or incoming sensory signals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 314.298,
    "end": 324.928,
    "text": "But to put it quickly, variational free energy is basically an upper bound on surprise that is done because computationally,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 324.908,
    "end": 328.892,
    "text": " we find this issue of intractability in computation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 329.472,
    "end": 346.709,
    "text": "Whenever you break down the math, you find like, oh, in order to actually precisely compute, surprisingly, you would need something like an entire history of an organism's memory, every observation it's come across, every potential hidden state it would estimate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 347.249,
    "end": 353.295,
    "text": "And you can imagine that the mathematics to that, the kind of formula that would be involved in that would be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 353.275,
    "end": 357.399,
    "text": " just untenable from a computational perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 357.84,
    "end": 366.949,
    "text": "And you can imagine the same thing for an actual human brain, making snap judgments based on its entire history of what it's learned and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 367.45,
    "end": 375.018,
    "text": "So variational free energy is very important in order to overcome this kind of intractability problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 375.118,
    "end": 380.143,
    "text": "Everything is somewhat approximate with the goal being to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 380.123,
    "end": 386.034,
    "text": " minimized free energy as much as you can such as surprises also minimize as much as possible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 387.156,
    "end": 388.779,
    "text": "There will be much more on that in the textbook.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 388.799,
    "end": 389.72,
    "text": "We're only in chapter one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 391.023,
    "end": 403.245,
    "text": "So stepping forward from that, we do have this nice figure 1.2, which describes how to reach active inference from two different routes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 403.63,
    "end": 428.946,
    "text": " uh the low road and the high road we can say that the low road is kind of the the how of active inference how an organism maintains its own integrity um just before we started this meeting there were certain uh mentions of autopoiesis and so on like this is the how and and so it relies heavily upon base's theorem uh we work up to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 428.926,
    "end": 435.814,
    "text": " generative models and using Bayes' theorem in order to find relationships between different variables in the model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 438.357,
    "end": 441.361,
    "text": "That's the mechanics, it's the how.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 441.981,
    "end": 458.781,
    "text": "But from the high road, alternatively, this is where things become a little bit more verbose, which is that this is what and why organisms are doing what they're doing as far as their behavior goes and attempting to explain what is happening here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 458.761,
    "end": 461.104,
    "text": " they're minimizing free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 461.124,
    "end": 464.027,
    "text": "And so we begin with the free energy principle, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 464.468,
    "end": 470.475,
    "text": "So then we can start to understand living organisms or other kinds of systems that we attempt to model using these kinds of tools.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 471.016,
    "end": 474.58,
    "text": "On the one hand, they're trying to minimize free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 474.74,
    "end": 476.162,
    "text": "On the other hand, how are they doing it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 476.182,
    "end": 479.286,
    "text": "They're doing it through something like Bayesian statistics and mechanics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 481.108,
    "end": 488.717,
    "text": "We'll get much more on both of those roads to active inference in chapters two and three, each of which are dedicated to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 488.933,
    "end": 491.056,
    "text": " one route, one route each.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 493.099,
    "end": 498.948,
    "text": "Following that, learn that yourself when we look at the structure of the book as it's described from there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 498.968,
    "end": 511.988,
    "text": "To keep it a little bit shorter, I'll just say the first half of the book is predominantly dedicated to a lot of the more theoretical aspects of active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 512.305,
    "end": 521.959,
    "text": " There will be explanation of other aspects, such as the mathematics involved, although you'll find much more in the details of that math in the appendix.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 523.261,
    "end": 529.891,
    "text": "The Active Inference Institute also, if you view the coda, you'll find references to the maths.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 530.792,
    "end": 534.297,
    "text": "You'll see there's an ongoing project right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 534.277,
    "end": 564.132,
    "text": " it's being streamed regarding the mathematics of active inference so there are plenty of resources outside of this textbook um for those who are more interested or or feel like they're not getting a sufficient amount of explanation from the textbook um and then we'll also later in this first part of the book we'll also get references to uh the kind of the more neurobiological aspects of the theory of course it was um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 564.5,
    "end": 571.049,
    "text": " largely initially devised by Carl Friston as a neuroscientist and neurobiologist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 571.109,
    "end": 579.961,
    "text": "And so all of this is heavily based within preceding work and looking at how to understand the mind and the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 579.981,
    "end": 585.529,
    "text": "So with that said,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 594.098,
    "end": 600.488,
    "text": " I think beyond that, keywords include active inferences of process theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 601.129,
    "end": 605.015,
    "text": "We're looking at different kinds of models, discrete and continuous models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 606.157,
    "end": 611.946,
    "text": "We're getting references to just a variety of things that this is connected to, hybrid models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 612.868,
    "end": 616.113,
    "text": "I think that might be fair enough.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 616.193,
    "end": 618.056,
    "text": "We're trying to introduce the chapter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 618.557,
    "end": 621.962,
    "text": "We're already nearly a quarter of the way through.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 623.579,
    "end": 635.072,
    "text": " So I'd like to ask if there's any, are there any questions that anyone has about the textbook or anything that they've kind of been chewing on for some time and you'd like to discuss?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 639.457,
    "end": 644.963,
    "text": "So can supplies be seen as the difference between expected observations and actual observations?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 647.686,
    "end": 648.087,
    "text": "Yeah, I'm sorry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 648.107,
    "end": 650.229,
    "text": "I missed just the first couple of words of what you said.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 650.289,
    "end": 651.831,
    "text": "Could you repeat that for me, please?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 652.317,
    "end": 660.956,
    "text": " So I was asking, can surprise be seen as the difference between expected observations and actual observations?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 663.181,
    "end": 663.622,
    "text": "That's right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 664.324,
    "end": 670.377,
    "text": "So active inference kind of relies upon this idea that you can think about it as",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 671.369,
    "end": 677.96,
    "text": " like a set point, for example, in control theory or looking at a thermostat.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 678.42,
    "end": 681.746,
    "text": "So you set the thermostat to a particular temperature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 681.786,
    "end": 685.371,
    "text": "There's a signal that's being read about the temperature in the room.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 686.433,
    "end": 689.197,
    "text": "Here's what you want the temperature to be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 689.518,
    "end": 691.02,
    "text": "Here is what it actually is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 691.06,
    "end": 697.731,
    "text": "And then the idea is you'd want a heating or cooling system that could then take action here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 697.711,
    "end": 706.746,
    "text": " to bring the temperature that it's reading in line with the expected set point temperature that you want.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 707.628,
    "end": 715.261,
    "text": "And you can quickly see like, yeah, you're minimizing the difference between expected and actual.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 716.022,
    "end": 721.491,
    "text": "It's a kind of classic machine learning perspective or otherwise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 721.471,
    "end": 727.836,
    "text": " So yeah, you'd be effectively minimizing surprise in that sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 729.217,
    "end": 737.367,
    "text": " Mathematically, it's easier to minimize variational free energy than it is to try and minimize the area directly, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 738.208,
    "end": 738.648,
    "text": "That's right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 740.47,
    "end": 748.16,
    "text": "The textbook will get much more into that, but that itself is also very much based upon mathematics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 748.18,
    "end": 752.905,
    "text": "It's not an arbitrary decision, but it has to do with Jensen's inequality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 752.965,
    "end": 756.169,
    "text": "The idea that...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 757.043,
    "end": 763.03,
    "text": " basically a particular quantity is always necessarily greater than or equal to another one, given certain conditions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 763.691,
    "end": 766.034,
    "text": "And so that's how we end up there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 770.399,
    "end": 770.72,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 775.846,
    "end": 776.687,
    "text": "Can I ask something?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 776.727,
    "end": 778.79,
    "text": "Sorry, can you hear me?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 780.111,
    "end": 783.996,
    "text": "Yes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 784.55,
    "end": 804.28,
    "text": " A lot of things hinge on the generative model that an agent or an organism has and I often wonder it like and yeah when I read further in the book, then I see that the generative model is considered given somehow you you seem to.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 804.698,
    "end": 808.802,
    "text": " it's considered that you have access to it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 809.883,
    "end": 812.325,
    "text": "So then I wonder, where does that model come from?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 812.545,
    "end": 815.308,
    "text": "Who chooses what model is there?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 815.328,
    "end": 821.854,
    "text": "The parameters seem to be updated through message passing and that kind of stuff.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 822.154,
    "end": 832.444,
    "text": "But the model itself, it's the P and not the Q, but where does it...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 832.829,
    "end": 834.333,
    "text": " Yeah, where does it come from?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 834.433,
    "end": 836.759,
    "text": "Or how should one think about that?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 843.074,
    "end": 850.332,
    "text": "Before I give an answer, I was just wondering if anyone else wants to chime in on that thought, because it is a big question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 861.82,
    "end": 866.625,
    "text": " It's, um, I guess, uh, does the free end.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 866.645,
    "end": 867.126,
    "text": "Oh, I'm sorry.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 867.146,
    "end": 868.187,
    "text": "People are raising their hands.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 868.527,
    "end": 869.708,
    "text": "Uh, let them go first.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 874.533,
    "end": 874.894,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 874.914,
    "end": 875.194,
    "text": "Ali.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 885.165,
    "end": 886.326,
    "text": "Anna, did you have a question?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 888.989,
    "end": 890.771,
    "text": " Oh, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 890.852,
    "end": 893.315,
    "text": "But Adley was going to go first.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 893.535,
    "end": 894.176,
    "text": "He was first.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 896.479,
    "end": 896.76,
    "text": "Okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 896.78,
    "end": 902.228,
    "text": "So what I wanted to comment on was a bit unrelated to this current question.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 902.288,
    "end": 907.635,
    "text": "So, Eric, would you please go on about what you were talking about before?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 907.916,
    "end": 908.176,
    "text": "Thanks.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 909.618,
    "end": 918.27,
    "text": "Oh, I was just going to say, I think is his like how the model is updated.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 918.402,
    "end": 948.173,
    "text": " is is that um is that really addressed directly by the free energy principle or is it kind of like mysterious right because um it seems like uh you kept on you keep on getting this phrasing from uh friston like this is how uh an organism has to behave if you know um so uh um i don't know coming from a neuroscience",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 949.064,
    "end": 975.156,
    "text": " perspective i'm not sure we quite understand how it works but we could see that the brain seems to be doing it something like this i don't know if that's a good answer but you know that just makes a lot of sense i mean it's so to i mean come at to come at any kind of",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 975.878,
    "end": 993.482,
    "text": " and this is just me speaking, but to come at any kind of phenomena, I presume you have to, you know, you start with some kind of framework or you attempt to like kind of structure things and then, and then as far as living organisms and the behavior goes, yeah, it's, I mean, all of this is sort of, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 994.34,
    "end": 996.585,
    "text": " you know, the map is not the territory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 996.625,
    "end": 999.331,
    "text": "We're just attempting to understand the organisms, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 999.812,
    "end": 1002.758,
    "text": "And so active inference is like attempting to provide that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1002.778,
    "end": 1010.555,
    "text": "So just to comment on how you phrased it is like, it's as if it is undertaking free energy minimization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1010.615,
    "end": 1013.682,
    "text": "I think that's a just fine way of saying it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1013.662,
    "end": 1023.331,
    "text": " So as far as defining a generative model, I suppose it depends on what kind of perspective you want to take.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1023.391,
    "end": 1030.498,
    "text": "So there are many people at the Institute who are more focused on the modeling and the programming, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1030.979,
    "end": 1034.402,
    "text": "And so they want to construct like a model themselves.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1035.283,
    "end": 1039.787,
    "text": "Maybe it's to simulate something like an agent, it's an environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1040.206,
    "end": 1057.103,
    "text": " In that case, you would want to rely upon things like domain knowledge in conjunction with a lot of the principles of active inference and Bayesian mechanics, which, as we mentioned earlier, is kind of the low road to active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1057.724,
    "end": 1059.806,
    "text": "That's already your starting point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1060.046,
    "end": 1068.795,
    "text": "You already assume that the agent is attempting to minimize free energy, and it's doing it through a variety of principles all",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1068.978,
    "end": 1070.6,
    "text": " related back to Bayes' theorem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1073.122,
    "end": 1078.248,
    "text": "So that's kind of the top-down normative framework that's being used here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1078.308,
    "end": 1087.497,
    "text": "And then from there, it's sort of up to you as far as how you want to continue constructing that model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1088.298,
    "end": 1094.344,
    "text": "So if there are certain actions that are available to the model or not that it can take.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1094.324,
    "end": 1108.065,
    "text": " Adrian Holovaty, What are the different kinds of states, it already expects to see what are the the priors is this is the kind of language that will get more deeply into is the textbook and you know as we continue reading through the chapters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1109.126,
    "end": 1117.699,
    "text": "Adrian Holovaty, From another perspective, if you're not modeling but rather just kind of going through the theory here, I mean it's.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1118.017,
    "end": 1125.312,
    "text": " there can be bigger philosophical questions about the structure of an agent and why it is the way it is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1125.332,
    "end": 1133.528,
    "text": "I think that there are many people who study active inference who kind of follow the line of something along the lines of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1134.25,
    "end": 1143.044,
    "text": " natural selection or perhaps more nuanced versions of that theory since its initial conception.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1144.326,
    "end": 1155.685,
    "text": "And so I don't want to say too much here, but has that at all been helpful in trying to answer the initial question yours?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1158.247,
    "end": 1177.704,
    "text": " Yeah, I see that this is not an easy question, but I understand that there is, for a modeler, there is a lot of room for creative filling in of the structure of the model, at least it seems.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1179.245,
    "end": 1187.612,
    "text": "While, yeah, if I get you right, it's not something that is necessarily derived from",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1187.963,
    "end": 1195.455,
    "text": " a normative point of view or something.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1195.475,
    "end": 1210.579,
    "text": "Yeah, I mean, of course, like with any kind of scholarly pursuit, I mean, whenever there's already work that's been done, whenever there's already secondary literature to draw from and so on, of course, folks will build upon one another's models and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1211.116,
    "end": 1232.769,
    "text": " test things out and oftentimes you'll construct one model and then eventually realize like it's behavior, despite the fact that it's minimizing free energy, the way you might've set up the variables in the model, like the behavior it elicits doesn't actually match any kind of real world phenomena that you're actually, you might be attempting to simulate for example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1234.011,
    "end": 1238.237,
    "text": "In that case, it can be a trial and error process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1238.403,
    "end": 1245.335,
    "text": " It can involve discovering something that you didn't expect to find when you realize there's a missing variable here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1247.298,
    "end": 1255.913,
    "text": "Those are many of the general trials and errors of model construction, I suppose.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1260.961,
    "end": 1261.322,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1272.305,
    "end": 1298.751,
    "text": " um Anna I did want to come back around to you yeah um okay so actually my question um is relevant to the previous question I think um so on page six of the book um there is you know this sentence that I'm going to read it says active inference is a normative",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1299.338,
    "end": 1328.653,
    "text": " framework to characterize space optimal behavior and cognition in living organisms, and so I was wondering if you could give us an overview or some ideas to start thinking around the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1329.207,
    "end": 1335.817,
    "text": " what does a Bayesian model optimize?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1335.837,
    "end": 1344.131,
    "text": "And so, because that's the Bayesian optimization is a tool that allows us to think about the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1345.473,
    "end": 1356.43,
    "text": "And so I'm curious about things like what utilities are optimized in Bayesian models",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1357.017,
    "end": 1364.889,
    "text": " Is that, are the utilities specific to the phenomena that you're working with?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1366.371,
    "end": 1384.138,
    "text": "And if you could connect and discuss, you know, the utility to the probability functions that are used in Bayesian statistics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1393.703,
    "end": 1408.073,
    "text": " So again, this time I do want to open the floor if anyone has any thoughts on this or otherwise to maybe see if we can get into this question that Anne has posed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1412.422,
    "end": 1413.163,
    "text": "Go for it, Aaron.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1416.805,
    "end": 1424.355,
    "text": " Oh, well, I had my hand raised from to ask independent thing, but I guess like in terms of I can try to take a stab at this one.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1425.316,
    "end": 1432.244,
    "text": "So I would I would phrase it as Bayesian models don't on their own optimize for anything.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1432.605,
    "end": 1439.494,
    "text": "But the model itself states the relationship between variables that is assumed.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1440.395,
    "end": 1446.222,
    "text": "And under those assumptions, one can, in light of new evidence,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1446.202,
    "end": 1450.348,
    "text": " express a posterior distribution which describes one's beliefs.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1451.089,
    "end": 1464.61,
    "text": "And I think classically that's like fully separate from how we think about utility utility functions and sort of given my posterior distribution about the world, I can then choose to act depending on what my preferences are.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1470.358,
    "end": 1475.466,
    "text": "Can you can you add to your example like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1476.779,
    "end": 1500.272,
    "text": " are you some you know what what is the currency that's being optimized it just I understand that the modeler decides what currency is being optimized so when you say when you're talking about beliefs updating beliefs and so on what are we optimizing there",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1503.003,
    "end": 1513.524,
    "text": " So how do we translate the natural language updating beliefs?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1515.127,
    "end": 1521.94,
    "text": "What does that look like in a model and can",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1524.569,
    "end": 1540.708,
    "text": " So one way that I would, anyone feel free to derail me on this, one way that I think about Bayesian updating, and I think the currency that's at play here is units of surprise, so bits or nots.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1541.609,
    "end": 1544.072,
    "text": "And I think the textbook doesn't really talk about this.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1544.112,
    "end": 1549.339,
    "text": "I feel like other sources are better about grounding bits or nots as a unit for surprise.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1549.639,
    "end": 1553.884,
    "text": "But if you were to have a lot of observations from a distribution,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1553.864,
    "end": 1578.606,
    "text": " and you want to communicate those to some other party efficiently literally how many bits do you need per per observation that's the kind of thing that is reduced as your model of the source of the data is improved so if you're if you're constantly surprised then you're going to take more bits per observation to communicate what you're observing and if your model is pretty well",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1580.206,
    "end": 1604.104,
    "text": " explaining what you're seeing then you'll need many fewer bits per observation to to report or communicate um and I guess make maybe communication comes like loaded with some expectations of like between agents but I think also that can be between components within an agent in in some cases but yeah that bits or nats are like actually an expression of",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1604.084,
    "end": 1625.653,
    "text": " uh perplexity surprise um on average I suppose um that can be uh reduced by updating appropriately thank you okay and I I do want to add to that to um",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1626.038,
    "end": 1637.854,
    "text": " I think it was well said, Erin, and pointing to, yeah, it's frequently understated what the units of measurement here are whenever we're looking at something like surprisal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1638.982,
    "end": 1649.76,
    "text": " That said, if we want to look at it in terms of active inference, I mean, some some things that you're going to see are commonalities throughout the textbook is we're going to be looking at particular variables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1650.421,
    "end": 1659.336,
    "text": "And so we're going to be looking at priors, which can be viewed as something like prior predictions, what you think is going to happen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1660.092,
    "end": 1663.618,
    "text": " or is happening, i.e.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1663.879,
    "end": 1666.403,
    "text": "your hidden state that you're estimating.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1667.085,
    "end": 1671.813,
    "text": "And then you'll have sensory observations, which is new information that's coming in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1672.875,
    "end": 1677.223,
    "text": "This is where we get into things like predictive coding or processing, at least.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1677.203,
    "end": 1687.453,
    "text": " where there is a continuous process of comparison between what information you're getting versus what you thought would happen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1687.694,
    "end": 1690.723,
    "text": "This kind of harkens back a little bit to the general idea of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1691.058,
    "end": 1709.995,
    "text": " You know here's the expected observations here's the actual ones, like the thermostat examples and it's through kind of starting with basis theorem as a sort of foundation like that's the how of reducing surprise right so.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1709.975,
    "end": 1721.335,
    "text": " um given some new information exactly i mean i don't want to rehash what aaron said because i think he put it much more eloquently than what i'm prepared to but um yeah it's to um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1722.783,
    "end": 1734.839,
    "text": " to minimize surprise via taking in new information, updating what you thought you knew before, suddenly your predictions perhaps come more into line with what you see out in the environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1735.3,
    "end": 1747.356,
    "text": "It's much more complex than that, depending on the situation, but that's an attempt at getting closer to describing, you know, here's what we're doing, whatever we're minimizing surprise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1747.673,
    "end": 1754.844,
    "text": " Aaron, you've had your hand up for some time, so I'd like to allow you to speak on your original question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1756.947,
    "end": 1764.518,
    "text": "Yeah, so one thing that I struggled to get my head around here is the generative model is supposed to generate",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1765.308,
    "end": 1772.818,
    "text": " all of your sensory data or is like supposed to like go all the way out to like, you know, the, the margins of the Markov, like, or whatever, the things that are coming in from the exterior world.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1773.599,
    "end": 1776.763,
    "text": "Um, and how plausible is that really?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1777.024,
    "end": 1783.873,
    "text": "Like there's lots of cases where you can see a complicated situation and not be able to predict most of it.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1783.913,
    "end": 1790.441,
    "text": "Um, and a lot of the things that the, the details that may be surprising possibly aren't going to be relevant to any action.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1790.461,
    "end": 1793.205,
    "text": "Uh, you know, you look at, um,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1794.248,
    "end": 1796.07,
    "text": " a whole bunch of birds flocking together.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1796.23,
    "end": 1799.393,
    "text": "You don't know where any particular one of them is, but it kind of doesn't matter.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1799.413,
    "end": 1810.944,
    "text": "If you look at a TV screen with a bunch of static, you can't predict what color any pixel is going to be in the next millisecond, but you can predict like derived features about a scenario.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1811.625,
    "end": 1822.315,
    "text": "And so I'm wondering sort of there should be some intermediate layer that is more relevant for our generative model to populate than like the actual sense data coming in.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1828.842,
    "end": 1830.404,
    "text": " Does anyone have any thoughts on that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1832.367,
    "end": 1854.917,
    "text": "Actually, this is directly relevant to John Verbeke's relevance realization, because in that framework, it's not possible for an organism to encode every single bit of information about its environment.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1855.302,
    "end": 1858.327,
    "text": " I mean, with sufficient precision.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1858.447,
    "end": 1876.534,
    "text": "So it needs to only encode only the information which is relevant to the situation which it's dealing with currently.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1877.189,
    "end": 1906.926,
    "text": " One way to do that is to encode those information probabilistically instead of deterministically, because in our traditional algorithmic formulation of cognitivism, for example, we deal with well-defined situation in which the parameters are pretty much clear cut and we can encode them with arbitrary precision if you want, but",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1907.345,
    "end": 1922.018,
    "text": " Uh, in one of the selling points of predictive processing frameworks is that, uh, it's not necessary to, uh, to encode those information with any, uh, kind of precision at all.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1922.598,
    "end": 1936.39,
    "text": "Uh, you can even start from, uh, I mean, in principle, you can start from a, uh, from an arbitrary precision or from an arbitrary distribution and then, uh, and then move your way.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1936.64,
    "end": 1941.967,
    "text": " in an optimization scenario.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1942.628,
    "end": 1955.544,
    "text": "So for instance, you can do a gradient descent on the VFE landscape and reach the extrema or the minimum of the variation of free energy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1956.265,
    "end": 1961.331,
    "text": "And that's one of the fundamental differences between",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1961.598,
    "end": 1971.338,
    "text": " active inference or predictive processing frameworks from the other traditional cognitivist frameworks.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1971.398,
    "end": 1979.995,
    "text": "Because as this recent paper, Naturalizing Relevance Realization shows,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1981.274,
    "end": 2006.269,
    "text": " In real world situations, cognition might be fundamentally uncomputable, but we can get around this obstacle by somehow encoding that generative model probabilistically and only encode the information that are relevant to us.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2014.113,
    "end": 2023.6,
    "text": " Yeah, I think there have been arguments that have been made, especially just a brief tangent that, you know, living organisms,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2024.153,
    "end": 2053.435,
    "text": " living organisms who necessarily have metabolic rules to keep in place and homeostasis to maintain, there's a tendency to, we can view this as one potential explanation for something like only paying attention to what is surprising and meanwhile trying to put on the back end all the processes involved in",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2053.415,
    "end": 2054.377,
    "text": " J Lenz, D.B.A.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2054.297,
    "end": 2071.052,
    "text": ": Determining like what is the new information here, and what is not the new information do we need to know the position of every single seagull in the flock as it moves by to be able to comprehend that this is a flock of sequels right and.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2071.623,
    "end": 2098.93,
    "text": " know that i i think it just it kind of hits on the aspect of of active inference but it doesn't even necessarily have to be active inference like the importance of something like a having a variational dynamic that allows for things like dimensionality reduction and increase from there compressing information and just kind of keeping things a little bit more efficient um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2099.939,
    "end": 2121.525,
    "text": " any case um i would like to give others a chance to ask questions uh how do apologies if i um yeah thanks for that um yes so i guess you know i guess coming from machine learning as well i i tried to i guess",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2122.72,
    "end": 2141.758,
    "text": " um compartmentalize my my learning here and um you know does active influence if influence use um newer networks gradient descent um and you're like back propagation or is it like a just you know different",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2143.46,
    "end": 2144.762,
    "text": " I'll give a quick answer to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2146.063,
    "end": 2151.79,
    "text": "There's an essential analytical form that is just matrix multiplication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2152.231,
    "end": 2155.935,
    "text": "So what we see in the textbook is just matrix multiplication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2155.975,
    "end": 2165.807,
    "text": "However, a lot of the modern examples have used neural networks as kind of like plug and play for different things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2165.867,
    "end": 2170.092,
    "text": "Like instead of a massive A matrix, you can have a neural network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2170.072,
    "end": 2186.089,
    "text": " and there's also deeper theoretical connections in live stream 51 with takuya isomura this discusses the monotonic relationship between the variational free energy and the neural network loss function",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2186.407,
    "end": 2198.62,
    "text": " And then Livestream 52 or like anything with Lance DaCosta is super informative about how accelerated optimization methods are used with variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2199.201,
    "end": 2203.906,
    "text": "Some of which are generally accessible to any variational method.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2204.527,
    "end": 2208.251,
    "text": "Others are especially enabled by Acton for FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2210.493,
    "end": 2210.874,
    "text": "Interesting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2210.894,
    "end": 2214.878,
    "text": "So it can use neural networks, but it doesn't need to?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2215.904,
    "end": 2216.445,
    "text": " Exactly.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2218.049,
    "end": 2218.31,
    "text": "Oh, okay.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2219.973,
    "end": 2225.526,
    "text": "Um, Oh, I had a question, but I've lost it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2225.546,
    "end": 2228.573,
    "text": "Um, yeah, thanks for the answer, by the way.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2234.347,
    "end": 2234.908,
    "text": "Uh, Thomas.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2237.926,
    "end": 2243.194,
    "text": " Yeah, I mean, just kind of, I want to build on some of the questions and looking for examples on that generative model point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2243.414,
    "end": 2247.861,
    "text": "I remember the Fristin article on aesthetic experience, order and chaos.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2248.562,
    "end": 2250.926,
    "text": "There was a note in it about the nature of absences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2251.146,
    "end": 2254.291,
    "text": "So there's like visuals basically of a square with a piece cut off.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2255.132,
    "end": 2260.42,
    "text": "And there was a comment in the caption that talked about absences are meaningful as obstacles or prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2260.88,
    "end": 2265.267,
    "text": "So I think that's really interesting because it's pointing out that a kind of absence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2266.327,
    "end": 2269.132,
    "text": " it's almost like where's the grounding, like where's the gender of model come from?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2269.152,
    "end": 2284.977,
    "text": "It seems to be, and I relate to the other parts of that essay where it talks about this kind of epistemic promise that our reason we engage in artistic experiences because there's been a promise that we're gonna get some kind of payoff of epistemic basic clarity or resolution of some kind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2285.648,
    "end": 2291.896,
    "text": " There's a lot more nuance in that, but just to kind of build on this point, where is the generative model bottom-up thing coming from?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2292.617,
    "end": 2311.521,
    "text": "Absences or lacks, basically, that are pointing out that that's a kind of course, basically, either there's an objective you're trying to achieve that's being hindered, so there's an obstacle in that mode, or there's basically a difference between the prediction model in your head versus the reality of interfacing with it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2311.906,
    "end": 2312.787,
    "text": " I think that's interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2312.807,
    "end": 2317.554,
    "text": "It's kind of, that was an interesting, just building point on where potentially a generative model comes from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2318.395,
    "end": 2327.347,
    "text": "Um, also there's other idea, like where I'm thinking in my head, I was looking, reading this piece and where this comes from concretely as an example, it's like, you got a gallon of milk in the fridge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2328.008,
    "end": 2329.65,
    "text": "You think it's full, you're not paying attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2329.89,
    "end": 2331.412,
    "text": "So you recruit way too much energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2332.614,
    "end": 2332.854,
    "text": "Boom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2332.894,
    "end": 2337.34,
    "text": "And you pull, you put, you yank it out with way more force than expected, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2337.877,
    "end": 2343.265,
    "text": " That difference basically is a surprise, I mean that's what i'm thinking as a concrete example of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2344.287,
    "end": 2356.425,
    "text": "So in that case what's the currency being manipulated years is calories basically to basically recruit the energy required for the muscles to contract and move on that example does he doesn't want to share.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2359.325,
    "end": 2362.29,
    "text": " Yeah, no good points for sharing those.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2362.41,
    "end": 2378.575,
    "text": "I mean, yeah, again, with the, you know, expecting a much heavier, you know, jug of milk is another very quick, intuitive example of, you know, here's the difference between what you predict is currently going on in the state of the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2378.715,
    "end": 2382.16,
    "text": "Like, I have a full jug of milk.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2382.14,
    "end": 2385.664,
    "text": " What actually happens is much less milk in there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2386.024,
    "end": 2389.668,
    "text": "You end up yanking it out way too quickly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2389.729,
    "end": 2392.772,
    "text": "There's excessive metabolic expenditure there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2393.553,
    "end": 2396.436,
    "text": "Those are all ways of for sure thinking about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2396.596,
    "end": 2405.346,
    "text": "And at some point in the textbook, we'll see explanations of things like arc reflexes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2405.832,
    "end": 2417.471,
    "text": " and proprioception where it'll describe things like, for example, you can move on from that example you gave to imagining the arm will adjust, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2417.871,
    "end": 2419.854,
    "text": "Well, we hope it does anyway.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2419.914,
    "end": 2422.439,
    "text": "The arm will not just immediately fling out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2422.539,
    "end": 2430.912,
    "text": "It will maybe halfway through a quarter of the way through the movement start to pick up like, oh, this is actually",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2430.892,
    "end": 2450.74,
    "text": " not heavy enough to justify this amount of force there'll be some kind of change in the action sequence right like suddenly you're not hopefully you're no longer going to fling it sorry it's kind of a silly example isn't it but um but you see the point it's like error correction right so so there's",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2451.091,
    "end": 2466.021,
    "text": " Jake Hamilton, What you expect there's what's you're actually observing and then there's an action can then be used to try and correct for that error, which ultimately presumably minimizes free energy along the way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2466.702,
    "end": 2468.526,
    "text": "Jake Hamilton, Eric.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2469.822,
    "end": 2493.005,
    "text": " Um, yes, I was just gonna also add, um, to the question raised earlier that maybe part of the answer to the question about whether, um, the model really has to, um, model every century detail is just that there's, there's actually many models that are working together, um, in, in, in an organic system.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2493.345,
    "end": 2496.729,
    "text": "So, um, they don't all have to model everything.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2497.67,
    "end": 2497.99,
    "text": "Um,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2498.628,
    "end": 2527.352,
    "text": " and uh like if i understand uh provecky's take um i think he believes that like the um task task centered network and the default mode network which kind of take turns right when you're um when you're doing various activities that you know the um the default default mode network is basically",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2527.602,
    "end": 2550.336,
    "text": " aspectualizing different things in the world and um like offering them up to the task focus network which is selecting some of them um and that they're constantly mutually modeling each other so that the organism can move through a salience landscape",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2550.755,
    "end": 2557.208,
    "text": " But, you know, we tend to reduce organisms, you know, being conscious creatures.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2557.248,
    "end": 2561.656,
    "text": "We tend to think of the model as, oh, it's me, the conscious me, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2562.237,
    "end": 2570.333,
    "text": "But there's all these, my understanding is that there's all these generative models, right, working beneath",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2570.313,
    "end": 2588.743,
    "text": " my consciousness um allowing some things to appear in others you know um so maybe that's part of um how it works efficiently because there's many different models hopefully that's coherent",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2590.36,
    "end": 2592.382,
    "text": " Yeah, no, it makes a lot of sense to me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2592.402,
    "end": 2613.886,
    "text": "And I think, um, you know, it's where we start to see a little bit more relationship with, um, yeah, as you described break these theories, as well as, you know, if anyone's familiar with like global workspace theory, basically this, the idea that you can have a kind of, uh, like multiple systems within a single system or nested systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2614.547,
    "end": 2615.828,
    "text": "And, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2616.972,
    "end": 2622.059,
    "text": " We're already in chapter one briefly introduced to the idea of a Markov blanket.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2622.079,
    "end": 2631.552,
    "text": "But as the textbook continues, there will be some more regarding Markov blankets and what what separates in this sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2631.973,
    "end": 2636.719,
    "text": "Does it also statistically separates a system from another system?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2636.699,
    "end": 2645.312,
    "text": " And then also recognizing that there can be nested systems within systems or systems who appear to be working cooperatively together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2645.652,
    "end": 2656.849,
    "text": "And so in the context of a human being, we only need a quick example, someone who is a cigarette smoker or something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2657.309,
    "end": 2661.235,
    "text": "Someone who, on the one hand, and decides to quit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2661.416,
    "end": 2663.439,
    "text": "But sorry, I'll keep it more brief than that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2664.36,
    "end": 2666.503,
    "text": "Someone who decides they want to quit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2667.192,
    "end": 2696.17,
    "text": " top level hierarchical like higher order decision i want to quit i want to be done with this um this is good like that's what i want to do that's a higher order decision on the other hand uh you know give them you know roughly 15 minutes and they start experiencing a craving and as that time continues we have you know withdrawal symptoms and so on um suddenly the person will become potentially more ambivalent um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2697.179,
    "end": 2716.875,
    "text": " there are different systems in the body that are expecting that nicotine uh to to come in right um and so you can have like multiple systems within a single human being or a single system that are potentially in conflict with one another cooperating with one another um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2717.513,
    "end": 2724.363,
    "text": " It's really about what is the phenomena you're interested in whenever it comes to active inference and applying it as a framework.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2724.403,
    "end": 2726.506,
    "text": "What is the system of interest for you?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2726.546,
    "end": 2731.433,
    "text": "And you have to decide what defines those boundaries.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2732.334,
    "end": 2734.397,
    "text": "What behavior am I expecting to see?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2734.457,
    "end": 2740.365,
    "text": "What system am I trying to simulate here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2741.122,
    "end": 2745.608,
    "text": " what potential nested systems are within that broader system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2747.13,
    "end": 2751.236,
    "text": "So at risk of over speaking, I'll give the floor back.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2751.356,
    "end": 2756.083,
    "text": "But no, I think those are all great questions and things to think about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2756.644,
    "end": 2758.747,
    "text": "Ali?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2758.767,
    "end": 2760.97,
    "text": "Yeah, I just wanted to add to what",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2761.321,
    "end": 2789.168,
    "text": " Thomas just mentioned about, I mean, the absence of information, because that's exactly the premise of Terence Deacon's incomplete nature, because in his magnum opus, he develops theory of absentialism, and he tries to somehow derive a kind of teleodynamics based exactly on those",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2789.148,
    "end": 2814.278,
    "text": " uh what he calls absentials so uh in one of our works with uh mao and i uh which is uh info interaction inference uh we uh we initially developed uh an account of uh the interaction between the organism and the environment based on possibility spaces so uh",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2814.764,
    "end": 2824.977,
    "text": " very briefly, any system with a given state space would have a form of the possibility space based on the definition or the collection of",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2825.176,
    "end": 2840.217,
    "text": " It's tendencies and capacities and and the structure of this possibility space can be described or defined as a multiplicity as a delusion multiplicity so by multiplicity.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2840.998,
    "end": 2849.53,
    "text": "What we mean is a nested set of vector fields which are related to each other hierarchically by symmetry breaking bifurcations.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2849.864,
    "end": 2865.143,
    "text": " and which together they constitute a collection of distributions of attractors which define each of their subsequent or embedded levels.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2865.364,
    "end": 2878.42,
    "text": "In other words, the idea of essentialism is already embedded in these spaces of possibilities or the multiplicities because",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2878.568,
    "end": 2890.262,
    "text": " those are exactly what constitute the structure of the space of possibility as the attractors of the multiplicities.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2890.622,
    "end": 2898.892,
    "text": "So in one of our recent papers, we're trying to develop this connection a bit more explicitly.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2899.533,
    "end": 2905.42,
    "text": "And yes, I agree that those absentials are",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2905.754,
    "end": 2914.009,
    "text": " quite essential for any kind of representational framework or generative models.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2932.197,
    "end": 2959.335,
    "text": " so i have a question ali about absentialism and sure uh yeah so how can i ask this um so invasive statistics we are using",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2960.227,
    "end": 2969.659,
    "text": " probability distributions to get at understanding something about reality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2973.323,
    "end": 2985.238,
    "text": "Can you define essentialism in the context of probability theory or is it completely unrelated?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2986.417,
    "end": 2986.737,
    "text": " Okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2986.757,
    "end": 2997.232,
    "text": "So, uh, first of all, as, um, as a side note, uh, Terence Deacon actually, uh, doesn't use the term absentialism in his book.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2997.532,
    "end": 3010.07,
    "text": "And, uh, he even rejects, uh, this word explicitly, but, um, in any case, in all of the literature related to, uh, incomplete nature, uh, they've used the word absentialism.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3010.15,
    "end": 3012.373,
    "text": "So, uh, it's pretty much, um,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3012.691,
    "end": 3013.612,
    "text": " widely accepted.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3013.953,
    "end": 3021.564,
    "text": "So by essentialism, he means something that's not physically realized yet.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3022.366,
    "end": 3033.402,
    "text": "Or in other words, as Duluth would call it, it's not actual, but a virtual possibility of the system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3033.903,
    "end": 3038.53,
    "text": "So, for instance, as a very simple example,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3038.83,
    "end": 3049.001,
    "text": " You can think of the capacity of a knife to cut, to kill, or I don't know, to poke something.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3049.321,
    "end": 3060.033,
    "text": "All of these are capacities of the knife, which are not always actualized.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3060.553,
    "end": 3064.838,
    "text": "They reside as its virtualities.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3064.818,
    "end": 3067.764,
    "text": " in its space of possibilities, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3068.366,
    "end": 3077.366,
    "text": "And the knife may or may not ever actualize these virtualities, but it doesn't make it any less real.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3077.987,
    "end": 3082.557,
    "text": "So by absential concepts,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3082.537,
    "end": 3106.401,
    "text": " or as a another related term of deacon intentional concepts he means something similar a kind of possibility or potentiality which is not actualized or realized yet but it is real and it constitutes uh i mean the",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3107.36,
    "end": 3116.335,
    "text": " the internal dynamics of the system as its capacities and tendencies.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3117.116,
    "end": 3127.613,
    "text": "So I'm not sure if we can characterize absentialism in terms of probabilities because although it",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3127.593,
    "end": 3137.245,
    "text": " it can be said that some of those virtualities are more probable than others to be actualized.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3138.166,
    "end": 3151.762,
    "text": "But it needs a much more rigorous work on that to derive these kinds of probabilistic landscape over those multiplicities.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3151.822,
    "end": 3156.047,
    "text": "But in any case, that multiplicity exists as a",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3156.263,
    "end": 3173.484,
    "text": " kind of reality of the system or the agent, again, whether, I mean, regardless of whether it actualizes those possibilities or virtualities or not.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3173.504,
    "end": 3180.853,
    "text": "So would it be incorrect to say that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3183.922,
    "end": 3209.052,
    "text": " there are states that are virtually or have a potential that they exist in some virtual representation somewhere and and that those states are not uh accessible to us for whatever reasons for to the observer at some point in time",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3210.584,
    "end": 3217.174,
    "text": " But to me that translates, let's see, I'm trying to see if this is making any sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3218.015,
    "end": 3239.207,
    "text": "To me that translates into, in order for me to even think about that thing that's absent, I, the observer, need to have some sense of what could possibly be absent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3240.335,
    "end": 3249.648,
    "text": " So I, as the observer, have to also have a virtual version of the thing that's absent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3249.948,
    "end": 3258.38,
    "text": "And would that thing that's absent not have a probability distribution?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3260.603,
    "end": 3265.87,
    "text": "So you see, these absentials kind of reside",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3265.985,
    "end": 3271.473,
    "text": " in the space of possibility of the system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3272.434,
    "end": 3288.596,
    "text": "But in order to actualize those possibilities, of course, they can be prioritized based on the probabilities of those absentials to be actualized.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3288.616,
    "end": 3293.443,
    "text": "As I mentioned earlier, some of those virtualities can occur",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3293.423,
    "end": 3296.408,
    "text": " with a higher frequency than others.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3297.649,
    "end": 3319.262,
    "text": "But this is a very subtle point in active inference, which is to say that you see in recent years, beginning from 2022, there is this attempt to somehow",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3320.17,
    "end": 3335.286,
    "text": " blur the line between the observer and the observed by showing a complete symmetry and duality between FEP and CMAP, which is the constrained maximum entropy principle, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3335.727,
    "end": 3348.0,
    "text": "So in other words, what the recent formalism of active inference or rather FEP shows is this complete symmetry and duality",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3347.98,
    "end": 3367.356,
    "text": " between these two perceptions these two i mean distinctions between observed and the observer so every time we draw a mark of blanket a statistical boundary between a system or between the observer and the observed",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3367.336,
    "end": 3371.568,
    "text": " it can basically be treated as a kind of arbitrary boundary.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3371.99,
    "end": 3379.371,
    "text": "We can switch that observed and observer perspective",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3379.823,
    "end": 3383.793,
    "text": " And the formalism will help perfectly.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3383.873,
    "end": 3398.187,
    "text": "So yes, there is this duality and perfect symmetry between observer and observed, which is shown formally in recent work by Dalton, Sack, Divadibel, and others.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3398.167,
    "end": 3416.293,
    "text": " And especially from the viewpoint of category theoretical perspective, it can be shown much more eloquently through those category theoretical formulation as well, such as the work of Toby Smyth and others.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3420.759,
    "end": 3421.12,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3421.46,
    "end": 3425.406,
    "text": "Appreciate it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3427.411,
    "end": 3450.246,
    "text": " unfortunately i see we're just about out of time here it's been we've run through the the whole hour and for uh i will say for a discussion on chapter one of a textbook this got rather deep uh very interesting stuff though i'm very happy to hear everyone share their their thoughts and uh i would you know of course everyone here is coming from their own distinct perspective and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3450.344,
    "end": 3458.433,
    "text": " and interest, so I would say if you are coming from a certain angle, certainly don't hesitate to ask questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3458.473,
    "end": 3471.827,
    "text": "I think that's what will kind of pull you into active inference a little bit more quickly in a way that is a little bit more fluent for a lot of people, because it can be a lot of material at one time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3472.468,
    "end": 3477.533,
    "text": "But thanks, Ali, for facilitating, and you're very",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3477.513,
    "end": 3479.496,
    "text": " your very thorough responses.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3479.716,
    "end": 3487.527,
    "text": "I always end up learning something new about active inferences history and sub theories that makes me want to read more.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3488.408,
    "end": 3493.055,
    "text": "And thanks everyone else for attending per usual.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3493.375,
    "end": 3495.578,
    "text": "There will be another meeting next week.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3496.6,
    "end": 3506.153,
    "text": "We'll be going over chapter two, which is where we'll get into the low road to active inference, a lot more on Bayesian statistics and mechanics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3506.133,
    "end": 3511.838,
    "text": " get maybe a clearer view of what optimality means or optimal behavior and inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3512.658,
    "end": 3536.038,
    "text": "We'll also get a couple of perspectives on things like different time scales, such as inference at a very quick moment by moment scale, all the way up to planning and agents who actually have the capacity for planning their next move or constructing goals that will take a series of steps to carry out, not just taking a breath in the moment because you need it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3536.339,
    "end": 3548.56,
    "text": " um daniel do you have anything to to add or announcements no great all right thank you everyone farewell thanks everyone thanks everyone bye",
    "speaker": "SPEAKER_03"
  }
]