[
  {
    "start": 7.028,
    "end": 8.568,
    "text": " Hello and welcome everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9.389,
    "end": 11.129,
    "text": "It's November 20th, 2023.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 11.209,
    "end": 20.111,
    "text": "We're here in ACT-INF Orgstream 5.1 with Annamarie Swann discussing ecological organizations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 20.852,
    "end": 22.992,
    "text": "So thank you very much for joining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 23.192,
    "end": 27.293,
    "text": "We will be looking forward to a talk followed by a discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 27.833,
    "end": 33.675,
    "text": "So to those who are watching along live, please feel free to add your questions in the live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 34.295,
    "end": 36.336,
    "text": " And thank you again for joining, Anna-Marie.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 36.516,
    "end": 37.496,
    "text": "Really looking forward to this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 38.857,
    "end": 39.537,
    "text": "Oh, pleasure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 39.617,
    "end": 41.158,
    "text": "Thank you so much for having me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 42.218,
    "end": 47.44,
    "text": "It's been very interesting to discover the work that you're doing here at the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 47.5,
    "end": 52.682,
    "text": "I'd never heard of the work of active interference, the phrase, like, what's that about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 52.802,
    "end": 59.484,
    "text": "And it struck me as you were explaining it to me a little bit when you reached out, and as I...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 62.04,
    "end": 85.475,
    "text": " explored the term myself that it's it's fascinating because it feels like we're coming into organizations or group dynamics perhaps from different entryways but I can really see the the small amount I know the relationship and ways that we could explore together so it's a real pleasure to be here and talk to you a bit about ecological organizations um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 86.345,
    "end": 97.627,
    "text": " Yeah, actually, I think you've introduced, you shared the link to my website in your, in the, in the, so I won't dive too much into kind of introducing myself, but yeah, I'm based here in the UK in Exeter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 97.647,
    "end": 109.55,
    "text": "And I've been absolutely fascinated with organizations and group dynamics very specifically for about seven years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 109.61,
    "end": 112.05,
    "text": "And that's become my work in my world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 113.31,
    "end": 115.411,
    "text": "And over those years, my,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 117.324,
    "end": 123.046,
    "text": " My perception of organizations and groups within organizations has changed quite a bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 123.966,
    "end": 132.549,
    "text": "And where I'm at now is looking at organizations through this very specific lens of ecological organizations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 133.489,
    "end": 138.671,
    "text": "So let me get set up and then we'll dive into the course, into the talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 150.641,
    "end": 166.391,
    "text": " So during today's talk, I'm asking you to join me on a journey into exploring and examining the nature of an organization as a co-created story and why this story matters, in particular to how we view the role of organizations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 167.452,
    "end": 176.978,
    "text": "We'll set off on our journey by investigating the story of our body as a singularity, a complete and separate entity with clear and discoverable borders.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 178.072,
    "end": 189.039,
    "text": " Take what we learn about our bodies into investigating the story of an organization as a singularity, a complete and separate entity with clear and discoverable borders.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 190.52,
    "end": 203.748,
    "text": "And with these investigations as our signposts, we'll arrive at ecological organizations as a co-created story that asks us to radically reimagine the role of organizations in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 206.715,
    "end": 213.78,
    "text": " Because with all good stories that center a journey, we'll need some aids to help us along the way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 214.721,
    "end": 222.327,
    "text": "So first, we'll hold truth as a lowercase t, truth that is formed of living questions that open up new questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 223.568,
    "end": 230.293,
    "text": "Second, we'll adopt different lenses to look at an organization through, including an animist lens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 231.28,
    "end": 246.14,
    "text": " And third, will hold the we that I speak of as a we that's whiteness-dominated, European-centered, and a neo-capitalist world that I inhabit, and not as a reflection of all people and all perspectives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 248.992,
    "end": 265.628,
    "text": " I truly believe that the time has come for us to reimagine stories of organizations as ecological and through co-creating the story of ecological organizations become radically responsive and responsible ecosystem stewards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 267.967,
    "end": 274.769,
    "text": " To give ourselves some way of tasting what being ecological means, I'm going to ask you to close your eyes for a while.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 275.489,
    "end": 281.21,
    "text": "You don't have to, but I think you'll find this talk much richer if you join me by investigating your lived experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 283.871,
    "end": 285.652,
    "text": "Bring your attention to your body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 287.312,
    "end": 290.813,
    "text": "What is your experience of being in your body right now?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 292.413,
    "end": 294.854,
    "text": "What physical sensations do you notice?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 297.025,
    "end": 298.746,
    "text": " Do you notice your heart beating?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 300.527,
    "end": 303.529,
    "text": "Can you feel your body breathing in and out?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 306.491,
    "end": 309.553,
    "text": "Now bring your attention to what you're sitting or standing on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 312.054,
    "end": 315.496,
    "text": "Investigate the place where your body meets another surface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 317.438,
    "end": 320.88,
    "text": "Can you tell where that point of contact exactly is?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 323.487,
    "end": 329.21,
    "text": " Are you losing heat or feeling a difference in temperature at the place that your body meets another material?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 332.511,
    "end": 336.773,
    "text": "Now widen your attention to your external environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 338.394,
    "end": 339.895,
    "text": "What sounds can you hear?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 342.476,
    "end": 347.058,
    "text": "What sensations are you experiencing that arise from your environment?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 349.099,
    "end": 350.42,
    "text": "Can you notice dampness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 351.354,
    "end": 354.776,
    "text": " heat, stillness or movement in the air.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 358.017,
    "end": 359.638,
    "text": "Now we'll do some time travel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 361.179,
    "end": 364.24,
    "text": "So go back to the start of your day and travel through it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 366.982,
    "end": 372.585,
    "text": "Perhaps you woke up in bed next to someone and you were aware of that other body near you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 374.145,
    "end": 379.228,
    "text": "Or perhaps you were alone and you were aware of that sense of your being alone in your bed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 381.465,
    "end": 384.247,
    "text": " Recall the contact of the sheets on your skin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 386.509,
    "end": 393.273,
    "text": "Later on in the day, you likely interacted with substances like toothpaste to brush your teeth, water to wash your face.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 394.434,
    "end": 399.037,
    "text": "Perhaps you filled a kettle with water and then pressed the on button, then drank a hot drink.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 400.999,
    "end": 402.019,
    "text": "Have you eaten today?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 403.38,
    "end": 405.702,
    "text": "If you have, remember that process of eating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 406.322,
    "end": 409.965,
    "text": "The food first outside your body, then in your mouth, then swallowed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 411.988,
    "end": 414.191,
    "text": " How about bringing other people into your day?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 415.152,
    "end": 417.815,
    "text": "Have you been in the same space as someone else today?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 419.217,
    "end": 425.625,
    "text": "Did you sit next to them, walk past them on the street, perhaps make direct physical contact with another human being?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 428.936,
    "end": 433.979,
    "text": " At the very least, you're all here on this Zoom with me, so we're in some way in connection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 434.739,
    "end": 444.845,
    "text": "And you're likely sitting at a computer or on a mobile phone, which means you've turned on a screen and your fingertips have hit computer keys or interacted with a mobile phone screen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 447.206,
    "end": 458.512,
    "text": "Through all of this, from the moment you woke up to right now, did you feel like a singularity, a complete and separate entity with clear and discoverable borders?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 461.465,
    "end": 465.788,
    "text": " Keeping your eyes shut, we're going to investigate your day's experiences again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 466.829,
    "end": 475.275,
    "text": "Add into all of those activities the estimated 39 trillion bacteria in or on the human body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 477.236,
    "end": 481.439,
    "text": "Now, we only have 300 trillion human cells in our body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 482.32,
    "end": 484.962,
    "text": "So we have more bacteria than human cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 486.391,
    "end": 493.656,
    "text": " We have bacteria in our gut, on our eyelashes, our skin, up our nose, our belly buttons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 494.216,
    "end": 498.319,
    "text": "We have it in our lungs, we have it in our genitals, and we have it in our bladders.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 499.42,
    "end": 503.583,
    "text": "We house multiple microbiomes in and on our body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 505.916,
    "end": 517.201,
    "text": " Perhaps after all, you weren't just a singularity, a complete and separate entity with clear and discoverable borders going about your day, but a creature that is more of a multitude.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 519.702,
    "end": 522.023,
    "text": "Can you locate the very borders of you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 523.784,
    "end": 527.786,
    "text": "Where exactly is the edge of you and the start of something else?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 529.646,
    "end": 533.008,
    "text": "Is your border your skin and everything your body holds within it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 534.872,
    "end": 535.873,
    "text": " What about your hair?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 536.613,
    "end": 542.919,
    "text": "Is each strand of the hair on your head, your arms, your legs, your genitals, your eyelashes a part of you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 542.939,
    "end": 546.522,
    "text": "Well, how much hair do you think you shed today?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 547.482,
    "end": 549.384,
    "text": "It's likely you wouldn't notice all of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 550.465,
    "end": 553.767,
    "text": "A hair from our head holds a viable DNA if kept stable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 554.928,
    "end": 558.551,
    "text": "Is that hair no longer part of you the moment it's no longer on your body?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 559.172,
    "end": 561.614,
    "text": "If that strand of head hair contains your DNA?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 563.393,
    "end": 564.814,
    "text": " What about skin cells?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 565.614,
    "end": 566.795,
    "text": "Are they a part of you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 568.196,
    "end": 575.199,
    "text": "How many skin cells were you shedding when you were in bed, as you brushed your teeth, as you ate, or as you're right now?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 576.3,
    "end": 580.502,
    "text": "When is your skin a part of you and when is it not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 582.563,
    "end": 589.427,
    "text": "Your consciousness, your emotions, your awareness of you, can you pinpoint the edges of these?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 590.66,
    "end": 594.285,
    "text": " Are they contained within the edges of your skin or do they travel outside?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 595.045,
    "end": 597.508,
    "text": "Where do you really begin and end?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 599.151,
    "end": 601.914,
    "text": "Think about the last time that you held someone's hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 602.555,
    "end": 608.142,
    "text": "Could you tell at all times where the edges of you ended and the edges of the other person began?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 610.592,
    "end": 614.115,
    "text": " Our reliance on our environment is a matter of life and death.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 614.936,
    "end": 618.379,
    "text": "We eat food and convert it to energy because otherwise we'd starve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 619.2,
    "end": 622.843,
    "text": "We drink water and are hydrated because otherwise we'd die of thirst.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 623.444,
    "end": 627.928,
    "text": "We breathe in air and utilise the chemicals within because otherwise we'd suffocate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 629.082,
    "end": 643.212,
    "text": " As we process and expel what we consume, as you've consumed today, aided by chemical process in the body, where are the lines between food, water, air being separate from us and when they're a part of us?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 644.873,
    "end": 649.857,
    "text": "When we breathe, we move carbon through our blood into our lungs and expel it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 650.718,
    "end": 655.721,
    "text": "At what exact moment in the conversion process is the carbon part of you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 656.442,
    "end": 657.783,
    "text": "And when is it no longer you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 659.48,
    "end": 671.287,
    "text": " Perhaps after all, you weren't just a singularity, a complete and separate entity with clear and discoverable borders going about your day, but a creature that is very much of your environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 672.868,
    "end": 687.436,
    "text": "Now, still with your eyes shut, bring all of these multitudes, this environmental reliance into actions, into your awareness of yourself as a being that has multiple relationships, multiple interactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 688.871,
    "end": 697.894,
    "text": " The relationships and interactions with loved ones, friends, colleagues, people at the supermarket, on the train or on the bus and walking past you in the park.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 699.575,
    "end": 704.436,
    "text": "Think about how you're carrying those relationships and interactions with you every day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 705.557,
    "end": 715.06,
    "text": "With family, close friends, partners, we're carrying years, sometimes decades of relationships and interactions with us as we go about our day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 716.681,
    "end": 725.166,
    "text": " Now extend those relationships and interactions to include everything else you meet and interact with and are affected by.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 726.327,
    "end": 738.154,
    "text": "Objects, animals, trees, rivers, plants, clouds, sunshine, electricity, the internet, computer software, and on and on and on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 740.256,
    "end": 742.557,
    "text": "Where exactly do you begin and end?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 743.357,
    "end": 745.739,
    "text": "Where are the edges of you, the human being?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 747.102,
    "end": 776.566,
    "text": " So after all, you aren't just a singularity, a complete and separate entity with clear and discoverable borders going about your day, but a creature that is a multitude, a multitude of your environment, deeply and irrevocably enmeshed into constellations of relationships and interactions, constantly being rearranged and rearranging, impossible to point to where we end and others and other things really begin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 778.832,
    "end": 791.621,
    "text": " Now extend that awareness of this magnitude for ourselves and include every other human being with us right now or watching this Zoom at some point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 792.461,
    "end": 802.728,
    "text": "Each of us with trillions of bacteria shedding hair and skin, breathing, eating, drinking, moving through our day, carrying multiple relationships and interactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 804.25,
    "end": 807.532,
    "text": "This is what it seems to me it is to be human.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 808.703,
    "end": 814.308,
    "text": " You are you, I am I. We can clearly point to where you end and I begin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 814.328,
    "end": 822.394,
    "text": "And yet, when we really explore it, when we close our eyes, we find that the human body is actually dispersed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 823.095,
    "end": 826.057,
    "text": "A multitude that's more bacteria than human cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 826.738,
    "end": 828.899,
    "text": "A constant shedding and regrowth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 829.56,
    "end": 836.746,
    "text": "Our cells, our very selves, being arranged by our environment and rearranging it constantly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 837.878,
    "end": 844.184,
    "text": " When we close our eyes, we can experience both the borders and the borderlessness of being a human being.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 844.884,
    "end": 850.53,
    "text": "And we can ask the question, do we really know where things end and everything else begins?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 853.713,
    "end": 859.478,
    "text": "So when you're ready to step back into your singularity, at least for a while, feel free to open your eyes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 865.973,
    "end": 884.243,
    "text": " If your experience just then was anything like mine is when I shut my eyes and bring my attention to my body and then extend it outwards, what you've just experienced is how I directly experience what it means to be ecological, to be a living organism in relationship with their environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 885.864,
    "end": 891.187,
    "text": "More than that, we know that there are ecological relationships being lived within and on us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 892.591,
    "end": 898.596,
    "text": " The relationship between us and our gut microbiome is just one kind of ecological relationship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 899.997,
    "end": 909.665,
    "text": "With our gut and us, it's a mutualistic symbiotic relationship, meaning that different species live in close proximity and both the species benefit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 911.146,
    "end": 915.15,
    "text": "Ecological relationships are intimate and meaningful relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 916.331,
    "end": 931.517,
    "text": " In the case of us and our gut bacteria, we host the bacteria for their lifetime, we give them what they need to thrive, and they help us digest our food, access nutrients, develop and maintain our immune system, and protect us against harmful invaders.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 932.697,
    "end": 937.599,
    "text": "Healthy and happy gut microbiome equals healthier and happier human bodies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 938.78,
    "end": 939.6,
    "text": "I know this well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 940.365,
    "end": 959.194,
    "text": " One of the challenging health issues I have means that some of my gut bacteria that I rely on for health and well-being has migrated from the large intestine into the small, causing all sorts of havoc to my small intestine and causing me daily issues for my immune system, access to nutrients and food digestion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 961.087,
    "end": 986.952,
    "text": " Now, I'm not a biologist and this is not a biology lesson, but when I was thinking about how to best convey what it is that led me to birth the Ecological Organizations Framework and the story of ecological organization it rests on, I realized that it's through my awareness of myself as an ecological being, boosting and being hosted by ecological relationships",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 987.552,
    "end": 992.614,
    "text": " that was the path into seeing and experiencing organizations as ecological.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 993.635,
    "end": 1004.339,
    "text": "And I realized without touching the experience of being ecological, then ecological organizations just become a lifeless theory and nothing ecological is lifeless.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1006.536,
    "end": 1018.526,
    "text": " Now that we've lived our experience of being both bordered and borderless, we can investigate ecological organizations, starting by looking for where an organization's border lies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1021.689,
    "end": 1032.518,
    "text": "It seems to me that we have co-created a story of organizations as singularities, as complete and separate entities with clear and discoverable borders,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1033.621,
    "end": 1050.647,
    "text": " And I believe that believing this co-created story to be a fact, to be truth with a capital T, can do immense damage to an organization, an organization's members, and the ecosystems and social systems that an organization is situated within.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1050.667,
    "end": 1057.249,
    "text": "And most of us here could probably give a definition of what an organization is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1058.339,
    "end": 1065.005,
    "text": " We might explain it as a group of people with a shared purpose or goal with a specific legal status.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1066.107,
    "end": 1069.81,
    "text": "We might include to that description that it has employees or members.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1070.711,
    "end": 1077.217,
    "text": "We might also add that it often has a head office or multiple offices, or at least an address that we can write to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1077.237,
    "end": 1079.8,
    "text": "It all seems pretty obvious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1081.561,
    "end": 1090.648,
    "text": " But when searching for the borders, the edges of an organization, I found that these descriptions leave me unable to actually pinpoint them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1093.731,
    "end": 1099.055,
    "text": "So let's start with an organization as a group of people that have a shared purpose or goal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1099.736,
    "end": 1101.197,
    "text": "That makes a lot of sense to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1101.898,
    "end": 1105.801,
    "text": "But when I look to find the organization here, I end up frustrated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1106.561,
    "end": 1111.304,
    "text": " Well, people share around, people group around all sorts of shared purposes and goals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1111.724,
    "end": 1114.186,
    "text": "That doesn't bring us to the organisation itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1115.467,
    "end": 1120.95,
    "text": "For starters, we're grouping here today with a shared purpose, but we're not an organisation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1121.871,
    "end": 1125.593,
    "text": "People group up in parks for yoga classes or group walks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1126.194,
    "end": 1127.755,
    "text": "They're not organisations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1130.376,
    "end": 1137.62,
    "text": " If I want to find the borders of an organisation, if it is a group of people with a shared purpose or goal, I want to know where I can find the edges.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1139.081,
    "end": 1153.429,
    "text": "When the members of this group go home at the end of the working day, if they're in an office or an allocated building, or when they stop working on organisational tasks if they work from home, does the organisation cease to exist for a while?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1155.063,
    "end": 1163.389,
    "text": " What about at weekends when an organization's members are with their families or hiking mountain trails or flying to a new city or watching TV?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1164.65,
    "end": 1168.313,
    "text": "Has the organization itself become somehow dissolved at these times?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1169.994,
    "end": 1172.616,
    "text": "What about when a member leaves and another arrives?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1173.477,
    "end": 1179.001,
    "text": "What if all the original members of a group leaves an organization and it's formed of entirely new members?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1179.762,
    "end": 1182.504,
    "text": "Does it as an organization change?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1183.615,
    "end": 1190.598,
    "text": " The atmosphere might, the direction might, maybe they'll even rebrand, but does the thing change?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1192.439,
    "end": 1195.721,
    "text": "Even if an organization merges with another organization,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1196.348,
    "end": 1206.511,
    "text": " If we look to find the borders of the organization as a group of people that are different to everyone else, we know that people aren't singularities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1207.012,
    "end": 1212.153,
    "text": "They're not complete and separate entities with clear and discoverable borders themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1212.934,
    "end": 1217.195,
    "text": "So that we know that a group of people isn't ever just a group of people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1218.945,
    "end": 1230.071,
    "text": " It's a group of human beings that are deeply enmeshed in their environment and that carry with them into their working lives a multitude of living relationships and daily interactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1232.472,
    "end": 1234.834,
    "text": "I then find myself investigating the physical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1235.674,
    "end": 1241.097,
    "text": "Can we locate an organisation in an office, a building, in a home office?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1242.059,
    "end": 1249.124,
    "text": " When I look there for an organisation, I find walls, floors, ceilings, lights, desks, electricity, internet and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1250.625,
    "end": 1254.387,
    "text": "I can locate those things, but I'm not finding the organisation there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1256.209,
    "end": 1260.432,
    "text": "Any of those elements can be replaced and an organisation stays the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1261.872,
    "end": 1266.676,
    "text": "Where, for example, is the physical divide of an organisation in a shared floor or building?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1267.476,
    "end": 1271.339,
    "text": "When do I know when I'm standing in an organisation or outside of it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1272.5,
    "end": 1273.881,
    "text": " Hosts might get delivered.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1274.342,
    "end": 1276.243,
    "text": "Visitors in an office come and go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1276.263,
    "end": 1280.948,
    "text": "And yet does part of the organisation go with those visitors?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1281.908,
    "end": 1285.231,
    "text": "What happens when an organisation expands into two offices?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1285.772,
    "end": 1286.633,
    "text": "Has it been split in half?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1288.055,
    "end": 1293.481,
    "text": " Many of us are members of organisations that don't even have an office.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1294.202,
    "end": 1303.052,
    "text": "I've been a core member of a number of organisations where I've never met the other members in person and where we all work from different locations around the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1305.094,
    "end": 1306.816,
    "text": "So then I looked to legal status.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1308.132,
    "end": 1309.754,
    "text": " Most organisations have one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1310.514,
    "end": 1321.764,
    "text": "An organisation is most often a non-profit, a limited company, a church, a school, an institution such as yourselves, a purpose-led enterprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1322.925,
    "end": 1324.767,
    "text": "Still, I can't find its borders.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1325.568,
    "end": 1333.515,
    "text": "The organisation isn't the computer file or the piece of paper that says an organisation exists and affords it a certain legal status.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1336.158,
    "end": 1341.301,
    "text": " I find that when I investigate an organization in this way, I feel almost a little embarrassed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1341.761,
    "end": 1344.102,
    "text": "These investigations feel a little childish.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1344.803,
    "end": 1347.825,
    "text": "We know that an organization isn't actually a thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1347.845,
    "end": 1353.448,
    "text": "None of us try and touch one, and we know in a way it's as much of an idea as anything else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1354.48,
    "end": 1363.164,
    "text": " You could say it's an idea, a story of all the above elements combined, the members, where they work, the shared purpose or goal, the legal status they have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1364.024,
    "end": 1381.933,
    "text": "But I keep getting stuck when I think of the human body and how easy it is to say that, yes, look, there at that body, that's a singularity, a complete and separate entity with clear and discoverable borders, until I investigate it and find it to be both bordered and borderless.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1382.625,
    "end": 1388.106,
    "text": " that to be human is to be ecological and be enmeshed within ecological relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1390.606,
    "end": 1405.089,
    "text": "Even if we land or agree at organisations being an idea that we all agree to share, that I could never touch or find its edges in the same way that I could touch you and say, look, there you are, we still know that organisations exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1406.449,
    "end": 1411.39,
    "text": "The impact of them on our lives is beyond doubt and beyond argument.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1412.938,
    "end": 1415.119,
    "text": " Many of us are members of an organisation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1415.679,
    "end": 1417.7,
    "text": "You are members of an institution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1418.18,
    "end": 1423.462,
    "text": "And at some point, or we will at some point be in our lifetimes, some member of an organisation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1424.543,
    "end": 1426.423,
    "text": "We might rely on them for our income.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1427.104,
    "end": 1435.727,
    "text": "We have relationships and interactions with members of the organisation and relationships and interactions with members of other organisations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1436.82,
    "end": 1444.388,
    "text": " We look to organisations to pay taxes, to keep promises, to sell us things, provide us with things, take care of services.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1445.549,
    "end": 1448.472,
    "text": "The impact and output of them is without argument.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1449.173,
    "end": 1451.816,
    "text": "We have daily lived experiences of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1453.211,
    "end": 1466.581,
    "text": " Here in the UK, I am daily experiencing the impact of actions and outputs of large to small organisations, depending on my heating, my water, my food, my electricity and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1467.621,
    "end": 1477.108,
    "text": "At this particular time, some of the organisational impacts are so impactful that they radically change my daily life as a UK citizen for the worse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1479.49,
    "end": 1481.231,
    "text": "When I examine an organisation,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1481.704,
    "end": 1495.148,
    "text": " look to where its edges are, just like with our bodies, I find that instead of singularity, instead of a complete and separate entity with clear and discoverable borders, there exists both borders and borderlessness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1497.108,
    "end": 1500.229,
    "text": "Take the organisation Amazon as an example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1501.209,
    "end": 1503.63,
    "text": "I know Amazon, the organisation, exists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1504.623,
    "end": 1512.085,
    "text": " I and you could point to Amazon delivery centers, the delivery trucks they utilize, their customer service team.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1513.045,
    "end": 1515.246,
    "text": "We can buy products from their organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1515.906,
    "end": 1521.287,
    "text": "We could divide people into Amazon employees or those working for Amazon and those that aren't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1522.388,
    "end": 1528.949,
    "text": "We could even track the peripherals, the supply chains, who does business with Amazon, who their stockholders are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1528.969,
    "end": 1531.89,
    "text": "It starts to get trickier though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1532.642,
    "end": 1537.985,
    "text": " to divide people into who is impacted by the actions and output of Amazon and who isn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1539.626,
    "end": 1550.032,
    "text": "It doesn't seem to me to be a huge leap to guess that we'd find that every single human on this planet is in some way affected by the actions and output of Amazon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1551.641,
    "end": 1565.244,
    "text": " It gets even trickier to divide the everything that is affected by the actions and output of Amazon and those that aren't, like the impact on Earth's natural ecosystems and all the life forms that dwell within them and in relationship with them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1566.404,
    "end": 1575.666,
    "text": "It doesn't seem to me to be a huge leap to guess that we'd find that everything on this planet is in some way affected by the actions and outputs of Amazon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1577.046,
    "end": 1580.307,
    "text": "But it's not just huge organisations like Amazon that have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1581.027,
    "end": 1584.988,
    "text": " external actions and outputs and impacts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1585.928,
    "end": 1593.27,
    "text": "Investigate any organisation and it becomes challenging to separate out the impact and actions from that organisation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1594.39,
    "end": 1601.471,
    "text": "After all, the shared idea of, say, a group of people with a shared purpose and goal, they have a purpose and a goal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1603.412,
    "end": 1608.113,
    "text": "We still need to define an organisation, though, even if we find there are no true borders.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1608.939,
    "end": 1615.564,
    "text": " We need to know who works for an organisation and who doesn't, which office to go to or who to have an async conversation with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1616.385,
    "end": 1625.231,
    "text": "I need to know, as a member of an organisation, who's paying me, what tasks I'm responsible for, what purpose or goal I'm contributing to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1626.552,
    "end": 1630.435,
    "text": "We need to know who to hold accountable and who to ask questions of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1631.476,
    "end": 1634.939,
    "text": "My work especially is hugely inspired by comments",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1635.529,
    "end": 1638.931,
    "text": " And I'm very excited by organizations as commons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1640.452,
    "end": 1652.96,
    "text": "The first step in creating and governing a commons is to define it, to define its borders so that we can understand who or what is within that commons and who and what is without.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1654.801,
    "end": 1656.102,
    "text": "It's the same with humans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1656.582,
    "end": 1658.924,
    "text": "We need to know that you are you and I am I.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1660.103,
    "end": 1665.926,
    "text": " Besides, each of us humans is unique, and that's wonderful, as each organisation is unique.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1667.807,
    "end": 1678.133,
    "text": "To me, when I investigate it, the nature of an organisation seems as enmeshed in relationships, as made up of relationships, as a body is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1678.953,
    "end": 1681.154,
    "text": "The edges become hard to determine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1681.695,
    "end": 1687.718,
    "text": "What's taking place within its borders affects and is affected by what's taking place outside of its borders.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1688.427,
    "end": 1695.253,
    "text": " What's taking place outside of its borders affects and is affected by what's taking place within its borders.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1697.254,
    "end": 1702.299,
    "text": "If we didn't create stories of definable borders, an organisation wouldn't exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1703.139,
    "end": 1712.067,
    "text": "But we need to remember that these borders, like most borders, are a story that we co-create and keep co-creating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1715.899,
    "end": 1730.273,
    "text": " Once we hold organisations as both bordered and borderless, as having edges that are tricky to find, we can co-create a reimagined organisational story, that of ecological organisations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1732.074,
    "end": 1739.461,
    "text": "Ecological organisations are organisations that are curious about themselves and how they relate with their environments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1740.629,
    "end": 1750.242,
    "text": " They're organizations that recognize that within their so-called borders, they are a web of ever-changing, fluid, responsive relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1751.023,
    "end": 1758.653,
    "text": "From the relationships between their members to the relationships playing out and within their systems and social norms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1759.688,
    "end": 1777.112,
    "text": " and that recognize that outside of their so-called borders, they are affecting and being affected by webs of ever-changing, fluid, responsive relationships that are the ecosystems and social systems an organization is situated in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1778.832,
    "end": 1788.594,
    "text": "Ecological organizations are organizations that recognize that they are being constantly rearranged by relationships and all that dwell within those relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1789.461,
    "end": 1794.97,
    "text": " and are constantly rearranging relationships and all that dwell within those relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1796.092,
    "end": 1803.685,
    "text": "Because to be is to be in and of a multitude of relationships, as it is with us humans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1806.052,
    "end": 1821.287,
    "text": " Thinking back to that huge multitude of relationships, interactions, and the intimate symbiotic relationships that each of us human beings carries and meets and is rearranged by every single day that you experienced when you shut your eyes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1822.348,
    "end": 1830.116,
    "text": "Bring that complexity, that interrelating into your understanding of an organization, even the very smallest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1832.253,
    "end": 1842.943,
    "text": " as well as the webs of relationships that each human member of an organisation is woven into and brings with them into an organisation every single time they set foot in that virtual or real office.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1844.295,
    "end": 1857.538,
    "text": " Think about the multitude of relationships that are involved every time people work together in different formations, from pairs to triads to small teams, large teams, departments, boards, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1857.558,
    "end": 1868.38,
    "text": "On top of all that, bring in investors and all of their relationships, stakeholders and all of their relationships, clients or customers and all of their relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1869.861,
    "end": 1881.486,
    "text": " now bringing the ceiling externalities, the neighborhoods, the natural ecosystems, the man-made structures, such as electricity grids and phone lines and internet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1883.147,
    "end": 1899.314,
    "text": "When we start to hold the myriad of ways that an organization affects or impacts all the relationships inside its imagined borders and all the relationships outside its imagined borders, now we are touching the ecological nature of organizations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1901.004,
    "end": 1909.949,
    "text": " Through looking at an organisation through this lens, we can become curious about where and how an organisation is causing harm or being helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1911.17,
    "end": 1920.856,
    "text": "Curious about where and how all the different relationships within an organisation are hurting an organisation's member or helping them, or likely both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1921.974,
    "end": 1932.3,
    "text": " We can become curious about how the relationships within an organization are hurting the organization or helping the organization, maybe both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1933.541,
    "end": 1951.131,
    "text": "Curious about where and how the actions and output of an organization are hurting or helping those small communities, large communities, neighborhoods, nature, social norms, natural systems, man-made systems, more than human beings and the very earth itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1952.54,
    "end": 1978.651,
    "text": " We can utilize this lens to trace and observe and intentionally improve the relationships that an organization and its members are consistently rearranged by and are constantly rearranging both within the organization and within the local, regional, bioregional and global ecosystems and social systems that an organization is located within.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1980.865,
    "end": 1983.426,
    "text": " There's one thing that we still have to explore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1984.427,
    "end": 1993.331,
    "text": "Let's revisit and examine again the two terms, ecology and ecological relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1995.051,
    "end": 1999.994,
    "text": "The ecological is the relationship between living organisms and their environments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2000.954,
    "end": 2005.116,
    "text": "Ecological relationships are the relationship between living organisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2006.627,
    "end": 2015.455,
    "text": " How then can an organisation be ecological, be enmeshed within ecological relationships if it is not a living organism?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2016.676,
    "end": 2019.018,
    "text": "Well, here's where another lens comes in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2020.746,
    "end": 2043.028,
    "text": " Even if we understand that an organisation is a web of relationships and interactions enmeshed in wider webs of relationships and interactions, if the nature of an organisation is a group of people with a shared purpose or goal, a legal status, members and so on, why isn't every single group of people with a shared purpose or goal an organisation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2044.332,
    "end": 2053.515,
    "text": " Whether we view organisations as animate or inanimate is, it seems to me, just another story that we are co-creating together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2053.535,
    "end": 2069.26,
    "text": "And over the many years of my being fascinated with organisational design, strategy and facilitation, as well as group dynamics playing out within organisations, I find myself relating to organisations through an animist lens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2070.543,
    "end": 2081.451,
    "text": " where others just see organisations as the elements, the static elements, the grouping of business, offices, computers, decisions, employees, partners, production output and legal status and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2082.492,
    "end": 2092.54,
    "text": "I see these as being the elements that birth organisations into life as their own beings, breathed into life by humans and human creativity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2093.53,
    "end": 2100.274,
    "text": " beings that we can choose to have the honour to nurture, steward, and hopefully one day support through a good death.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2101.354,
    "end": 2107.858,
    "text": "This is the difference that I find between groups gathering around a shared purpose or goal and an organisation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2109.899,
    "end": 2115.102,
    "text": "So much opens up for me when I view an organisation as animate instead of inanimate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2116.183,
    "end": 2122.146,
    "text": "Now I, as an organisational member, become an organisational steward, listening deeply,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2122.742,
    "end": 2126.865,
    "text": " paying careful attention to what the organisation needs and is telling me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2128.005,
    "end": 2134.43,
    "text": "Being an organisational steward becomes one more way that I can honour life and all the forms it takes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2135.59,
    "end": 2139.513,
    "text": "One more way that I can choose to move toward right relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2140.956,
    "end": 2155.66,
    "text": " Now I, as an organizational steward, become activated into radical stewardship, radical responsiveness and responsibility for those relationships within the co-created boundaries of an organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2156.3,
    "end": 2164.803,
    "text": "And radical responsiveness and responsibility of the relationships within the multitudes of relationships and organizations situated within.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2167.347,
    "end": 2172.531,
    "text": " This then is the heart of what to me an ecological organisation encompasses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2173.652,
    "end": 2179.037,
    "text": "This is the reimagined organisational story that moves and activates and excites me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2180.078,
    "end": 2186.143,
    "text": "This is how I step further into activism, into right relationship and into stewardship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2187.898,
    "end": 2204.563,
    "text": " Whether or not you choose to adopt an animist lens or not, or co-create a story of ecological organizations or not, I hope that this talk will at least ignite some interesting breadcrumbs you might want to follow and leave you with questions to live into and to explore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2205.464,
    "end": 2207.304,
    "text": "Thank you so much for your attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2212.126,
    "end": 2212.606,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2212.806,
    "end": 2213.186,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2214.707,
    "end": 2215.187,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2218.752,
    "end": 2218.972,
    "text": " Wow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2221.113,
    "end": 2221.553,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2221.653,
    "end": 2223.974,
    "text": "Very experiential.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2224.534,
    "end": 2226.495,
    "text": "And it's really exciting to hear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2226.515,
    "end": 2232.317,
    "text": "I think there's a lot of touch points with what we talk about at Active Inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2232.417,
    "end": 2235.798,
    "text": "And so there's a lot of ways to explore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2239.779,
    "end": 2243.821,
    "text": "Anything else you want to add or can I go into some questions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2244.601,
    "end": 2245.641,
    "text": "Let's go into them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2245.862,
    "end": 2246.622,
    "text": "Let's dive in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2249.423,
    "end": 2255.588,
    "text": " I really like this tension between the singularity and the multitude.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2256.649,
    "end": 2262.453,
    "text": "And that's something that comes up in the ant colony, in the slime mold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2263.094,
    "end": 2265.456,
    "text": "It's like nothing is just...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2267.336,
    "end": 2285.721,
    "text": " uni components everything that we call thing when we zoom in it becomes blurrier and it becomes more multi-agent at a smaller scale right so how do we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2288.567,
    "end": 2305.122,
    "text": " How do we scaffold then our role as on one hand stewarding the little guys inside and whose goals and histories we can't step into their shoes directly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2305.142,
    "end": 2311.808,
    "text": "And similarly for processes that are bigger and slower than we are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2313.587,
    "end": 2315.988,
    "text": " So how do we jump?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2316.329,
    "end": 2321.331,
    "text": "I felt like I was ready to jump somewhere when my eyes were closed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2322.812,
    "end": 2323.092,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2324.333,
    "end": 2325.974,
    "text": "That's really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2326.074,
    "end": 2334.219,
    "text": "Firstly, I love the, cause I think when we talked before, I think we did end up talking about ants in some way or certainly I remember.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2334.239,
    "end": 2336.88,
    "text": "And I, I think that's such a great story because, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2340.083,
    "end": 2350.852,
    "text": " to understand and like with organizations, we have to somehow find some way to, to make the definition right in these, these tensioned borders or borderlessness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2350.892,
    "end": 2353.694,
    "text": "We have to understand what we're studying and what we aren't studying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2354.374,
    "end": 2364.623,
    "text": "And so I, I guess one of the ways into it, or certainly I think one of the ways into it for me of, of that activation of that jumping is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2366.323,
    "end": 2368.345,
    "text": " through some defining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2368.365,
    "end": 2371.527,
    "text": "I feel like that's really important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2373.369,
    "end": 2382.136,
    "text": "As long as we do that defining with the awareness that we are creating this story and maybe understanding for ourselves why we're creating that definition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2382.797,
    "end": 2390.183,
    "text": "So when I, in simile, when I feel that kind of excitement or that sense of jumping, I want to both",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2390.831,
    "end": 2419.247,
    "text": " nurture and care for what's happening within an organization I want to nurture and care and support and steward as much as I can for for the impact of it and all the different relationships that are happening at some point it can be it's just too much really like there can if we were to follow relationships in the same way I'd imagine with ants if you were to follow their relationships to the next relationships and the next relationships and the next relationships at some point you reach a level where um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2421.003,
    "end": 2422.103,
    "text": " What do you focus on?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2422.143,
    "end": 2423.144,
    "text": "Where do you even start?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2423.204,
    "end": 2424.224,
    "text": "Everything dissipates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2425.244,
    "end": 2426.624,
    "text": "The attention dissipates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2427.424,
    "end": 2428.305,
    "text": "It's all too much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2428.425,
    "end": 2443.248,
    "text": "So I guess all I can come back to is to a personal sense of how I cope with that lived tension experience of being an organizational member, which is that...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2448.373,
    "end": 2449.374,
    "text": " Where am I drawn to?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2449.594,
    "end": 2452.215,
    "text": "What do I think I can have the most impact on right now?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2452.695,
    "end": 2462.92,
    "text": "What's the information that feels big enough to encompass some level of impact-ness and feel small enough to cope with?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2464.621,
    "end": 2470.424,
    "text": "If we go back to organisations very specifically, I'm just trying to think of an example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2470.644,
    "end": 2473.426,
    "text": "All right, let's take as an example...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2475.729,
    "end": 2502.265,
    "text": " So I, until recently, I'm still a partner in a wonderful small organization called Nesta that creates technology to support self-organization and fairly small organization, very globally located and with a very specific way that the purpose of that organization is being enacted through the creation of software that helps support the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2504.679,
    "end": 2525.464,
    "text": " self-organization well i can hold both i think at the same time i can hold the size of that organization and the care and the stewardship of of the humans within it right understanding like what is their well-being right now true well-being not the well-being that comes with yoga classes but like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2526.244,
    "end": 2528.645,
    "text": " How are they feeling seen and heard?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2528.785,
    "end": 2531.226,
    "text": "Are they feeling that they get to follow what moves them?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2531.386,
    "end": 2534.648,
    "text": "Does it feel like a right fit within this organisation right now?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2535.709,
    "end": 2537.749,
    "text": "Is the work they're doing, are they getting supported?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2537.829,
    "end": 2539.49,
    "text": "All of those things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2540.591,
    "end": 2547.114,
    "text": "What are the things happening at home for them right now that maybe massively impact them?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2547.534,
    "end": 2551.616,
    "text": "Are they someone like myself that has chronic health conditions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2551.696,
    "end": 2554.998,
    "text": "All of these things we can sort of ripple out in a very manageable way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2556.84,
    "end": 2565.983,
    "text": " hold an address and we can start to, sorry, we can hold an address us as members, as human beings, as important human beings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2566.603,
    "end": 2578.126,
    "text": "And then I can look at Nesta and I can start to examine the different systems and structures that are taking place within Nesta as a small organization that maybe describe it as different Hollands or different cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2578.166,
    "end": 2585.428,
    "text": "We can look at each one and we can start to kind of address it and see where their relationships are and what's being affected by what, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2586.021,
    "end": 2597.585,
    "text": " And then I can spread my attention more externally, like as we're creating these new products or as we're improving our products or evolving our products, who does this touch?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2597.645,
    "end": 2598.965,
    "text": "Who are our products touching?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2599.046,
    "end": 2601.566,
    "text": "So we can start to interact with our clients, say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2602.187,
    "end": 2604.928,
    "text": "And we can also, we can go in that direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2604.948,
    "end": 2608.549,
    "text": "At the same time, we can start to look at what supplies us",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2611.512,
    "end": 2615.777,
    "text": " What kind of systems do we rely on for our software?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2615.817,
    "end": 2617.739,
    "text": "Are they decentralized or centralized?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2617.939,
    "end": 2625.428,
    "text": "We can start to spread our awareness and our intentionality outwards at a very manageable pace.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2626.676,
    "end": 2633.398,
    "text": " We might start to make decisions like, well, it really matters to us where our energy comes from as an organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2633.418,
    "end": 2639.761,
    "text": "It matters what suppliers we have a relationship with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2640.361,
    "end": 2643.662,
    "text": "So we want to start understanding the relationship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2644.162,
    "end": 2664.494,
    "text": " what's important to our suppliers but we also want to start exploring what's important to our clients and so we might start to to really understand like what are the pressures they're experiencing what are the stresses they're experiencing what's the impact they're having and through this way and in a way i guess what we're doing is we're gently starting to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2665.618,
    "end": 2686.643,
    "text": " to practice, because it is always just a practice, practice what it's like to bring attention to both things at the same time, to start gently extending awareness outside of the borders in manageable ways, while at the same time holding just as important and understanding those effects, how they affect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2687.203,
    "end": 2693.665,
    "text": "So might find that maybe a client's having an incredible challenging time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2695.44,
    "end": 2699.763,
    "text": " And we start to support the clients in some way with that in a different way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2699.803,
    "end": 2705.167,
    "text": "And then relationships change and we find new pathways internally within our own environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2706.208,
    "end": 2713.594,
    "text": "If we're taking it to more kind of, not I'd say so much extremes, that's not quite the right word, but if we're",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2714.85,
    "end": 2723.422,
    "text": " if we're looking to, we're so activated and we have the ability, there are some really fascinating things happening in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2723.502,
    "end": 2729.37,
    "text": "There are, and I forget the name, but there are companies that are creating",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2730.812,
    "end": 2746.409,
    "text": " office buildings that are their own ecosystems that are themselves living ecosystems so they're bringing into their immediate environment in through those borders as they focus all of those things they're actually bringing in um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2747.486,
    "end": 2769.029,
    "text": " externalities they're bringing those in they're learning to live in a different way so um I think if that kind of answers your point I may have gone off on a little tangent so if I do I have a habit of doing that so let me know at any times but I notice all I can do would say with that is I noticed for myself that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2770.447,
    "end": 2778.311,
    "text": " there comes a point where vastness and scales become impossible to navigate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2778.411,
    "end": 2781.853,
    "text": "They become, you know, it's in the same way with bodies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2781.913,
    "end": 2790.758,
    "text": "Like I can take care of my body and I can help a certain amount of people in my life in a direct and intimate way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2790.838,
    "end": 2796.381,
    "text": "But then my ability to have a relationship with others gets less and less and less.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2797.202,
    "end": 2797.262,
    "text": "Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2799.238,
    "end": 2823.149,
    "text": " yeah does that kind of touch on it somewhat yeah like what i got in that was when we still ourselves or steal ourselves and sit with that fractal multitude it's like breathing and then there's a point where it's like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2824.403,
    "end": 2836.668,
    "text": " I've breathed all I can breathe, and then we take the jump of faith and we do something, we take some action, and that might be an internal action, like a shift of attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2837.348,
    "end": 2841.55,
    "text": "It might be action on our border.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2842.634,
    "end": 2863.223,
    "text": " But by being an action on our border, like our finger touching the screen or doing some other action, like the border itself becomes the site of action that already is beyond us, but it's us, but it's already beyond us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2864.204,
    "end": 2866.325,
    "text": "Yes, I like that very much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2866.385,
    "end": 2866.725,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2866.765,
    "end": 2868.446,
    "text": "I love how you put that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2868.746,
    "end": 2870.687,
    "text": "What came to mind when you were speaking was",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2872.229,
    "end": 2887.583,
    "text": " how it seems to me more and more important that information that we're gathering from outside of us becomes as close to real-time data and to immediate data as we can so that when we're",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2888.47,
    "end": 2903.822,
    "text": " when we're in action on those borders, when we're activating those borders and we're really kind of interacting and keeping our attention on those interactions, that we have as much as possible of the best information coming back to us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2904.383,
    "end": 2906.184,
    "text": "What are the real effects we're having?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2907.585,
    "end": 2914.491,
    "text": "What's the changes happening in the world that we can hear as quickly as possible to react to?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2916.372,
    "end": 2929.864,
    "text": " A practical kind of example of that is in the way that we often see organizations triggering kind of sweeping changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2931.065,
    "end": 2932.606,
    "text": "Let's say AI, for an example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2932.646,
    "end": 2943.416,
    "text": "I know that's a whole ball of stuff that we might not want to open, but it's really, for me, one of the things that I found incredibly troubling about AI is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2944.085,
    "end": 2966.077,
    "text": " is how quickly AI has moved to a global scale without really giving us as humans and our systems and our environments, and I might be wrong, an AI person might say, no, these have been done, but it feels like we've moved to a global encompassing scale at an overwhelming rate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2967.058,
    "end": 2970.9,
    "text": "We haven't given time to have more kind of localised",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2971.56,
    "end": 2987.312,
    "text": " experiments that we can get as true to real time data about the impact of AI on communities, the impact of AI on our work, the impact of AI on our ecosystems, impact on our energy systems of running AI, all of these things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2988.312,
    "end": 2991.375,
    "text": "We've kind of got swept up into this enormity of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2992.075,
    "end": 2994.057,
    "text": "And you spoke earlier, one thing that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2995.12,
    "end": 3003.923,
    "text": " really struck me as you talked about, you mentioned something, I'm going to forget the phrase, but it made me think of the different ways that we experience time, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3004.143,
    "end": 3016.327,
    "text": "You mentioned something, I think about how do we exist in this kind of borderless, bordered state and be in touch with the externals when things may be moving at different times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3016.906,
    "end": 3039.96,
    "text": " deep time or slow time or you said something do you remember I don't know okay but it's like we you know sometimes AI makes me crave like whale time it's like look at how slowly or what does life look like for whale that's alive for like so long and it seems to move in this particular way and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3040.805,
    "end": 3049.469,
    "text": " us humans with something like AI, we just move often at these incredible speeds, really kind of removed from our environments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3050.81,
    "end": 3052.991,
    "text": "And I find that very disturbing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3053.231,
    "end": 3056.613,
    "text": "Like I physically find it very disturbing at that idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3056.653,
    "end": 3063.916,
    "text": "And I look at kind of, yeah, this movement with AI and I get all the organizations that are leading it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3063.936,
    "end": 3067.097,
    "text": "And I kind of just want to ask them to slow down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3067.158,
    "end": 3068.658,
    "text": "It's like, please just slow down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3068.698,
    "end": 3069.879,
    "text": "Like it's not that I,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3071.488,
    "end": 3078.641,
    "text": " reject our, I don't think that we should be evolving and changing and innovating, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3080.162,
    "end": 3101.986,
    "text": " But to really understand, to keep our attention on the borders of ourselves, of our organizations, we have to also move at a speed that allows us to bring in as close to real-time data as we can so that we as organization members have the best data, the best information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3102.006,
    "end": 3108.587,
    "text": "And then we can start to really focus on how do we as an organization",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3109.511,
    "end": 3135.746,
    "text": " ensure that we have the internal relationships so healthy that we can then respond internally as well to that information as not just as quickly as we can, but with as much intentionality and absorbing it so that really then that border becomes a place of the highest activity really in an organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3135.766,
    "end": 3138.568,
    "text": "It's where we meet the outside world and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3139.434,
    "end": 3143.415,
    "text": " You know, we're constantly going back there for as much new information as we can.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3143.435,
    "end": 3147.196,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3147.477,
    "end": 3148.897,
    "text": "A lot to say on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3149.577,
    "end": 3160.521,
    "text": "I love the idea that where the rubber hits the road or the ground floor is like the coolest and actual place to be in a decentralized organization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3160.561,
    "end": 3161.961,
    "text": "I think that's really cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3162.121,
    "end": 3164.122,
    "text": "I'm going to ask some questions from the live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3164.522,
    "end": 3164.822,
    "text": "Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3165.562,
    "end": 3165.822,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3166.603,
    "end": 3167.423,
    "text": "Susan asks,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3168.519,
    "end": 3169.519,
    "text": " A lovely presentation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3170.12,
    "end": 3175.722,
    "text": "How do you explain the benefits of using this lens to move to collective decision-making?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3183.246,
    "end": 3185.447,
    "text": "Well, I don't know that I actually do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3185.467,
    "end": 3189.909,
    "text": "I don't think I do in that sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3190.549,
    "end": 3191.47,
    "text": "Let me explain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3191.59,
    "end": 3195.711,
    "text": "So I come from a background of collective decision-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3195.772,
    "end": 3196.472,
    "text": "I come from a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3197.446,
    "end": 3226.004,
    "text": " fascination in in self-organizing and how groups self-organize and make decisions but and so I have an immense fascination with that and of course how groups make decisions is incredibly important how we navigate our social norms how we navigate being relational creatures um I have a personal preference for things like consent decision making",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3227.044,
    "end": 3239.315,
    "text": " for self-organization as a base managing approach, because to me, it affords so much that I see as beneficial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3240.116,
    "end": 3244.36,
    "text": "But I actually don't think in my work of ecological organizations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3244.76,
    "end": 3245.721,
    "text": "No, is that true?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3248.483,
    "end": 3253.347,
    "text": "At the heart of it, I guess what I'd like people to come away with is understanding that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3254.324,
    "end": 3264.997,
    "text": " To view an organization as ecological does not put a preference on something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3268.021,
    "end": 3270.324,
    "text": "To understand something as ecological is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3273.82,
    "end": 3281.965,
    "text": " In the same way we look at studying to ants, we're understanding something about the nature of an organization itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3282.565,
    "end": 3284.626,
    "text": "That's what really feels important to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3286.247,
    "end": 3292.911,
    "text": "However, I, being an opinionated human being, have my strong opinions and opinions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3294.553,
    "end": 3321.075,
    "text": " in the framework that I authored as part of my kind of understanding of my perspective on ecological organizations being a self excuse me being a self-organizing system and understanding what that looks like for people and also being relational a key element of the framework and the framework really is just guidance it's very much a personal perspective of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3321.826,
    "end": 3334.617,
    "text": " that came from the work that I've done over the years in self-organization and working with organizations, excuse me, that to me is a lens that we can look at organizations through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3335.318,
    "end": 3339.622,
    "text": "So I guess what I'm trying to say to you, Susan, and thank you for that question is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3341.198,
    "end": 3355.468,
    "text": " In some ways, as someone working, bringing, looking to bring to attention the idea of organizations being ecological, it doesn't really feel like my business to say how well you make decisions within them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3356.369,
    "end": 3360.992,
    "text": "But as a human being, having worked in organizations and, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3364.895,
    "end": 3382.906,
    "text": " Having worked with relationships and how groups work together, it feels to me that we can choose to put that lens on, like using something like the framework, and we can, as part of that, focus on how we make decisions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3383.066,
    "end": 3393.813,
    "text": "And for me, that always comes back to things like consent decision-making to really looking more at the kind of organisational design and governance",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3395.809,
    "end": 3401.892,
    "text": " But it was one thing that I thought was very interesting in my understanding of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3401.972,
    "end": 3414.459,
    "text": "And Daniel, correct me if I'm wrong, but it's my understanding is that active inference is doing exactly what Susan's pointing at, is understanding how collective behaviors works, how decisions are made.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3415.239,
    "end": 3415.9,
    "text": "Is that right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3415.92,
    "end": 3419.802,
    "text": "There's a lot to say there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3420.754,
    "end": 3449.696,
    "text": " okay certainly yes the essence of active inference is that thing that's on the inbound doing sense making with whatever information it has whatever modalities it's getting and then on the outbound is making decisions based upon whatever affordances it has and you in response to that question you said well viewing the organization as ecological doesn't put a preference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3450.997,
    "end": 3467.749,
    "text": " on the structure and it's so funny because we talk about preference a lot in active inference too and similarly active inference doesn't put a preference on what body plan or what algorithm or what organizational structure one should use",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3468.65,
    "end": 3472.793,
    "text": " It's just a descriptive understanding framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3473.494,
    "end": 3485.524,
    "text": "And so active inference applied to organizations, it also is not opinionated as to whether there should be one, three, five, seven consensus, this style, that style.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3485.984,
    "end": 3491.048,
    "text": "Those are all conversations to have and to be described as situations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3491.068,
    "end": 3491.409,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3491.929,
    "end": 3500.451,
    "text": " But it's like we're opinionated and can express our values and who we are to the extent that the framework doesn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3501.432,
    "end": 3519.417,
    "text": "And to the extent that the framework loads on the hard decisions, that would be us offsourcing and reducing our expressivity with simply a more opinionated tool, which might work well where that's the right opinion to have, but...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3520.757,
    "end": 3542.35,
    "text": " won't work where that isn't the opinion to have and even where it is the right opinion to have it almost silently robs the organization of that of taking agency over that structure agency right that's that's exactly the word that was coming up for me listening to you agency because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3543.84,
    "end": 3553.232,
    "text": " For me, every organization is unique to be any being, any ant colony, any ecosystem, all of these are unique.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3553.733,
    "end": 3562.343,
    "text": "So it's always important to me that any organization or the way I see it would be like any organization,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3563.732,
    "end": 3568.557,
    "text": " finds its own way of being an organization in that sense, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3568.598,
    "end": 3575.405,
    "text": "In the practical way, like how they make decisions, how they govern, what their systems and structures look like, what work they do, all of those things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3576.687,
    "end": 3578.008,
    "text": "I've always struggled with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3579.369,
    "end": 3588.315,
    "text": " I have so much appreciation and more than that, like huge respect for something like sociocracy or holacracy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3588.855,
    "end": 3589.676,
    "text": "I've worked in both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3589.716,
    "end": 3593.818,
    "text": "I'm trained in holacracy 3.0 and I think they're incredible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3595.761,
    "end": 3611.489,
    "text": " I could never look at an organisation and say, well, all organisations should be sociocratic or all organisations should use halacracy or, in fact, all organisations should use consent or just holy consent because that kind of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3613.149,
    "end": 3623.478,
    "text": " that brush, we can't brush it with that often with those one colors, like most governance systems, most decision-making, most social norms are, are very distinct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3623.539,
    "end": 3632.086,
    "text": "And they, they, they sit somewhere on a border between like, say like, like centralization and decentralization and how they do things and how they work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3632.106,
    "end": 3632.407,
    "text": "Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3633.367,
    "end": 3662.279,
    "text": " um mostly consent but sometimes consensus um doing a lot of group work and sense making but also individual sense making and all of those things and i think what you're speaking to what's interesting about um active inference um so for me i hold ecological organizations as almost neutral in the sense that like an animal is an animal we don't say they're good or bad or they look this way you know ants act as ants it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3663.404,
    "end": 3667.557,
    "text": " look at understanding that an organization is full of relationships that affects",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3669.124,
    "end": 3675.105,
    "text": " and is enmeshed in massive other relationships feels incredibly important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3676.126,
    "end": 3683.327,
    "text": "For me, the ecological organisations framework that I authored is a very specific tool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3683.907,
    "end": 3685.368,
    "text": "It's like an addition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3685.728,
    "end": 3696.39,
    "text": "It's kind of like if you're interested, if you've had that kind of like leap of perspective and you now understand how deeply relational you're",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3697.054,
    "end": 3701.749,
    "text": " organization or an organization is and you feel that activated um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3704.349,
    "end": 3712.834,
    "text": " that activation towards stewardship, towards now what, now how can, what some of the options, how can we look at it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3713.414,
    "end": 3720.178,
    "text": "Then the framework becomes potentially very useful because it kind of gives you this very specific way in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3720.238,
    "end": 3728.963,
    "text": "But the framework is so saturated with me and my perspectives that I can imagine and I hope there will be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3729.994,
    "end": 3736.344,
    "text": " There could be many different frameworks about how to relate with or be in an ecological organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3736.484,
    "end": 3743.355,
    "text": "And I'm sure they would all just be as valid and as fascinating and as supportive of collective decision making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3744.662,
    "end": 3745.022,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3745.423,
    "end": 3754.111,
    "text": "So on the live stream, I've brought up and maximized the square image that you've created.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3754.851,
    "end": 3758.915,
    "text": "And I'll just read the ecological organization circles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3759.556,
    "end": 3766.762,
    "text": "So there are integrating more than human, encouraging rich diversity and cohesive disruption, embodying the commons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3767.603,
    "end": 3791.612,
    "text": " moving closer to right relationship embedding seasonality activating ecosystem responsiveness and responsibility stewarding a self-organizing system and becoming more relational so how did you come to this palette or this layout or or even approach with so many questions in the outside",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3793.547,
    "end": 3808.974,
    "text": " Yeah, I love that's a question and it is so hard to answer because really this framework represents all of the work that I've ever done in a way with organisations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3809.034,
    "end": 3813.737,
    "text": "It reflects really what I see or have seen as",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3818.174,
    "end": 3840.292,
    "text": " the elements that create well let's put it this way so if if an ecological organization is is a is a is a we we're calling it a being it's its own being um we're understanding that organizations are their own beings and now we want to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3842.865,
    "end": 3848.69,
    "text": " activate our cells of human beings within those ecological organizations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3849.311,
    "end": 3865.905,
    "text": "Those are all the elements that I see as being the important elements to focus on that help us become stewards and help us become in a form, deep relationships with the organization itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3865.925,
    "end": 3867.046,
    "text": "Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3868.211,
    "end": 3873.573,
    "text": " And really, when I created the framework, I didn't mean to create a framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3873.813,
    "end": 3889.097,
    "text": "What I was trying to do was reach this point in my life when I realized that I was moving further away from previous work that I'd done and relating to organizations as I had done before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3889.83,
    "end": 3894.833,
    "text": " and was really just trying to understand for myself, what is it that I care about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3895.434,
    "end": 3896.594,
    "text": "What is it to me?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3896.734,
    "end": 3918.929,
    "text": "Like if I was to, if I could help instigate an organization in certain ways, be the most radical stewards, both for the organization and for the ecosystems and social systems it's situated in, what do I see as important?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3920.003,
    "end": 3921.683,
    "text": " And it's all of those elements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3923.064,
    "end": 3931.746,
    "text": "And that's why I say that another framework, you know, you could have different frameworks and they may, I'm sure they'd be just as beautiful and important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3933.426,
    "end": 3947.83,
    "text": "But for me, this brings in, really is so informed by work on living systems, on interbeing, on stewardship, on self-organization, on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3949.911,
    "end": 3964.882,
    "text": " organizational design on the way that I see groups and dynamics play out on the kind of state of the world that we're in right now and the necessary steps that all the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3966.075,
    "end": 3979.99,
    "text": " that the steps that I see as necessary, such as the one that we talked to before about localizing and experimenting innovation in a very kind of local controlled way so that you get real time feedback.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3980.07,
    "end": 3985.436,
    "text": "So I was lucky enough to get some input on this framework from",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3986.423,
    "end": 4006.193,
    "text": " one person in particular who works very deeply in, in commons and in urban design and in, um, um, like, uh, sort of building like ecological villages, things like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4006.473,
    "end": 4012.156,
    "text": "And, you know, they brought the attention to the importance of real time information and, and things like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4012.316,
    "end": 4013.437,
    "text": "So, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4015.748,
    "end": 4016.748,
    "text": " You still with me, Daniel?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4016.768,
    "end": 4017.829,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4018.809,
    "end": 4019.549,
    "text": "Oh, you've gone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4020.229,
    "end": 4021.11,
    "text": "Your picture's just gone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4021.19,
    "end": 4021.55,
    "text": "But yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4022.15,
    "end": 4035.794,
    "text": "So, yeah, I mean, and then they became questions through reading the work of Dr. Wall and his work on regenerative design.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4035.834,
    "end": 4043.856,
    "text": "And I realized that the questions are the most richest questions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4046.174,
    "end": 4050.819,
    "text": " experience that we can have as organisational stewards is to keep asking questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4050.839,
    "end": 4051.7,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4056.345,
    "end": 4056.765,
    "text": " Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4056.825,
    "end": 4057.926,
    "text": "That's awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4058.026,
    "end": 4061.948,
    "text": "I really resonate that with asking questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4062.308,
    "end": 4076.236,
    "text": "What would happen if questions were asked from the top, from the middle, from the outside, from the boundary, rather than leading with directives or commands?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4077.397,
    "end": 4080.559,
    "text": "I'll ask another question appropriately from the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4081.679,
    "end": 4082.8,
    "text": "Mills8102 writes, Question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4085.896,
    "end": 4092.498,
    "text": " There are so many connections to be explored beyond ourselves as persons and organizations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4093.218,
    "end": 4099.64,
    "text": "How do we prioritize and choose which areas to explore with our finite capacities to do so?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4101.021,
    "end": 4101.381,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4102.261,
    "end": 4103.882,
    "text": "Yeah, that's so important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4104.202,
    "end": 4113.725,
    "text": "It's a question I often ask myself, and I think we have touched on that briefly when we spoke about the need to somehow find",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4114.838,
    "end": 4123.124,
    "text": " the edges of what becomes too vast for us to hold within our awareness and work on and what becomes manageable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4123.144,
    "end": 4141.037,
    "text": "I'm probably going to give a really frustrating answer to that, which is that I think what the priorities are would be very, very unique and specific to the organization, to the ecosystems and social systems that it's situated in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4144.386,
    "end": 4163.331,
    "text": " what I would find or what I would imagine is that Daniel, you, you said something lovely earlier about like, well, it's just kind of, it's just taking time to kind of almost like sit and be and breathe and have a absorb what's happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4163.551,
    "end": 4172.414,
    "text": "And it's almost like taking space as humans to just really sit and find some silence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4172.914,
    "end": 4172.974,
    "text": "Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4173.911,
    "end": 4179.837,
    "text": " And then it could be multiple ways in as priorities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4181.739,
    "end": 4183.441,
    "text": "What's your organization like?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4183.801,
    "end": 4186.304,
    "text": "Are the people incredibly unhappy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4187.873,
    "end": 4196.034,
    "text": " Are you desperately concerned about the systems or structures that you're enmeshed in?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4197.875,
    "end": 4200.475,
    "text": "What's happening in your local communities?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4200.975,
    "end": 4202.155,
    "text": "What do they care about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4203.636,
    "end": 4209.597,
    "text": "Then there are the bigger urgencies, things like the climate pressure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4210.257,
    "end": 4211.477,
    "text": "Where's your relationship with that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4211.517,
    "end": 4213.317,
    "text": "That could be an entryway in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4214.237,
    "end": 4217.098,
    "text": "What's the role that your organisation might play",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4220.925,
    "end": 4226.411,
    "text": " to help support people through this or to make changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4226.431,
    "end": 4233.7,
    "text": "There's so many, I think, different ways that an organisation would or could prioritise and find entryways in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4235.723,
    "end": 4237.405,
    "text": "On a personal level, I think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4238.76,
    "end": 4246.034,
    "text": " It's probably about gathering as much information as you can, listening as much as you can to others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4246.134,
    "end": 4247.837,
    "text": "Like what do other people see?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4249.62,
    "end": 4251.263,
    "text": "What do they think are priorities?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4253.871,
    "end": 4257.573,
    "text": " And then finding something that really fascinates you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4257.653,
    "end": 4259.614,
    "text": "That's something we often forget about too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4259.694,
    "end": 4262.636,
    "text": "Like where do you personally feel pulled?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4263.216,
    "end": 4268.619,
    "text": "What gives you excitement and energy to work on or to look at and examine and explore?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4270.5,
    "end": 4272.221,
    "text": "Maybe you should make that a priority.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4272.901,
    "end": 4273.362,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4273.422,
    "end": 4275.883,
    "text": "I find that's a very personal thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4279.944,
    "end": 4287.809,
    "text": " situation for each of us and are going to be very unique for every organisation and the ecosystems and social systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4290.236,
    "end": 4315.969,
    "text": " well in active inference where we're creating these formal models of sentient things it often comes up like how can something be such a general scaffold such that we can fill in the details and make it an organization or an organism and like in terms of how we think about decision making",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4316.909,
    "end": 4323.511,
    "text": " It often is decomposed, not to go too deep here, but into two components, a pragmatic and an epistemic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4323.991,
    "end": 4332.674,
    "text": "And the pragmatic is about making the world as we expect it to be, like making our organizational culture or the narrative as we expect it to be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4333.394,
    "end": 4339.856,
    "text": " And the epistemic is like the mystery and the curiosity and the open-endedness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4340.116,
    "end": 4356.301,
    "text": "And there's this blend in every action, or at least in how it's chosen, between bringing the world into alignment with the preferences of the thing and that thing learning more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4357.241,
    "end": 4358.882,
    "text": "And that seems to be...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4360.794,
    "end": 4379.617,
    "text": " place that can be pulled back to that can explain the activity of non-curious things like a metronome, it just carries out its task rhythmically, all the way on through purely curious things that don't have any pragmatic preference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4380.017,
    "end": 4382.922,
    "text": " They just seek to explore information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4383.523,
    "end": 4394.401,
    "text": "And this is part of the ecosystems of shared intelligence, which is something that people in the active inference field talk about is like rather than constructing monolithic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4396.064,
    "end": 4423.972,
    "text": " architectures bigger and bigger models we can already think about our ecosystems as a piece of paper here and an old computer here and a person here and the office cat here it's like we're already in this space where the causal networks flow across bodies and networks and computers and we overlook that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4424.992,
    "end": 4433.464,
    "text": " heterogeneous reality, again, already at our own peril, because it's already how things are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4433.484,
    "end": 4438.531,
    "text": "Yeah, I mean, absolutely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4438.631,
    "end": 4438.871,
    "text": "I can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4442.409,
    "end": 4459.827,
    "text": " Yeah, I mean, it's so fascinating because I think, you know, we're sort of looking at the same things, but maybe our entryway into how we're looking at it is, you know, my entryway into this is through, as I said earlier, it's through my kind of lived experience of myself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4459.887,
    "end": 4460.328,
    "text": "And I think...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4463.523,
    "end": 4475.468,
    "text": " As someone who's had chronic health conditions their whole adult life, the impact of that has made me explore my reality and my body and my world in a very different way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4475.668,
    "end": 4480.29,
    "text": "And there's certain things like it limits my capacity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4480.33,
    "end": 4483.571,
    "text": "It limits what I can focus on, but it also heightens things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4484.752,
    "end": 4489.894,
    "text": "It gives me a very kind of perhaps visceral experience of what it's like to walk through the world",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4491.375,
    "end": 4495.502,
    "text": " with a kind of queerness that some people might not experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4495.542,
    "end": 4500.05,
    "text": "So there's all these kind of different entryways into it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4500.17,
    "end": 4500.39,
    "text": "And I,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4501.36,
    "end": 4509.667,
    "text": " You know, one of the things that I really hesitated with when I brought out the framework was, what if people read this as an answer?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4509.727,
    "end": 4524.018,
    "text": "Like, what if people read this as an end goal, as a, like, oh, just take the framework and put it on an organization and we can just follow these questions and that's it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4524.579,
    "end": 4528.382,
    "text": "And I'd find that heartbreaking if that happened because, yeah,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4530.316,
    "end": 4538.72,
    "text": " But at the end, but we also as humans, I need you to sit here and talk to me about active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4538.78,
    "end": 4539.961,
    "text": "I need you to hold...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4541.411,
    "end": 4550.18,
    "text": " all of your knowledge about it because I don't have the capacity or probably even the interest in the same way you do to dive into it in the same way you do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4550.721,
    "end": 4559.47,
    "text": "And you might not have the same interest to hold and dive into ecological relationships or organizations in the way that I do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4559.49,
    "end": 4563.975,
    "text": "And I'm not saying you don't, but, and I think that's what I find so interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4566.816,
    "end": 4568.758,
    "text": " Sometimes I feel this pressure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4568.818,
    "end": 4570.08,
    "text": "It's like, I don't know enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4570.14,
    "end": 4571.081,
    "text": "I don't know enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4571.141,
    "end": 4572.062,
    "text": "I need to know more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4572.102,
    "end": 4580.571,
    "text": "I need to, how do we make these decisions without more information, more knowing, without being more rearranged by knowledge?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4580.651,
    "end": 4589.32,
    "text": "And then I have to kind of breathe and I have to go quiet and I have to kind of remember that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4590.467,
    "end": 4599.611,
    "text": " we are millions of people and we're holding all of this different information, this different knowledge and these different entryways into something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4599.631,
    "end": 4601.792,
    "text": "And that just feels amazing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4602.908,
    "end": 4603.829,
    "text": " a miracle to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4603.849,
    "end": 4605.13,
    "text": "It feels so exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4605.29,
    "end": 4613.917,
    "text": "And if we can just hold all of these things as these lowercase T's, these truths that are more questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4615.098,
    "end": 4616.739,
    "text": "I'm curious, can I ask a question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4618.08,
    "end": 4628.989,
    "text": "Tell me, like, what are some of the kind of living questions maybe that you, Daniel, or more generally your community kind of lives into?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4633.646,
    "end": 4634.607,
    "text": " Well, I love that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4634.627,
    "end": 4640.352,
    "text": "I hope in comments and in conversations, everybody can give their thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4640.472,
    "end": 4649.819,
    "text": "I'll give a personal anecdote, I guess, just to my experience with organizing your question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4650.799,
    "end": 4673.819,
    "text": " brought me back um more than 10 years ago to organizing a chess club in undergraduate and bringing out tables to the farmer's Market and playing chess with people and myself not not being the best chess player in the group not even close not ever having competed in chess but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4675.45,
    "end": 4684.274,
    "text": " wanting to show up with the boards and facilitate that space where people who had years of chess or minutes of chess could have fun.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4684.854,
    "end": 4703.062,
    "text": "And the question that mystified me then and I see in a new clothing today is some people would walk by the boards and it would just bring them joy to see that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4704.184,
    "end": 4711.01,
    "text": " we were out there and they would just, whether or not they stopped and played, they would like, it made them excited.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4711.07,
    "end": 4713.672,
    "text": "Maybe it reminded them of their passion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4714.332,
    "end": 4719.677,
    "text": "And other people had seemingly intense negative reactions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4719.897,
    "end": 4720.217,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4720.737,
    "end": 4728.564,
    "text": "Like that the existence of a game was even with or without them playing was a threat, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4730.345,
    "end": 4747.115,
    "text": " Or that somehow their worth or that their relevance was on the line seemingly for chess in a way that if we had checkers on the table, maybe it wouldn't have seemed so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4749.116,
    "end": 4758.042,
    "text": "I see it again now with as we organize variously in kind of purely relational communities of care,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4759.873,
    "end": 4773.385,
    "text": " online friendships and relationships, but also including technical open source ecosystems with science and technology, engineering, math and art and all these different areas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4773.585,
    "end": 4779.711,
    "text": "And how do we have an organization so that the passerby",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4785.49,
    "end": 4811.745,
    "text": " and those inside and those outside in that boundary moment it's something that makes people feel warm and right with who they are not like i should have been doing something different in my past such that i should have been a different person right now just because i saw a chessboard",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4815.95,
    "end": 4817.631,
    "text": " That's an amazing question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4817.751,
    "end": 4827.396,
    "text": "And it seems to hold so many other questions in it as well about like sense of self and just, yeah, fascinating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4828.476,
    "end": 4829.617,
    "text": "Thank you for sharing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4833.399,
    "end": 4835.62,
    "text": "I'll ask one last question from the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4835.78,
    "end": 4836.14,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4836.2,
    "end": 4836.461,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4836.721,
    "end": 4837.521,
    "text": "Yeah, please do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4837.561,
    "end": 4837.781,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4838.281,
    "end": 4838.562,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4839.542,
    "end": 4840.623,
    "text": "So Susan asks,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4841.621,
    "end": 4845.545,
    "text": " What are barriers for people to begin an exploration?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4846.145,
    "end": 4850.809,
    "text": "In other words, what is scary, confusing, and overwhelming, full of surprise?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4852.251,
    "end": 4856.895,
    "text": "Maybe that's in reference to the framework or maybe just in the organizational work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4858.196,
    "end": 4860.959,
    "text": "Yeah, well, let's maybe start with the framework and we'll go backwards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4861.139,
    "end": 4864.102,
    "text": "I mean, I can imagine that for a lot of people, it could be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4865.405,
    "end": 4887.241,
    "text": " overwhelming just to sit with the framework like where do we even find entry here do we resonate with this these areas maybe there's some we do and some we don't maybe there's language here we don't resonate with or um what is a more than human being i mean i've been asked that before you know like that's not a terminology or even a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4887.961,
    "end": 4892.004,
    "text": " kind of perspective that people that everyone holds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4894.145,
    "end": 4899.108,
    "text": "And so I mean, I'm, I can imagine that there might be quite a lot about the framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4899.208,
    "end": 4914.518,
    "text": "And so I that's, and I, I struggled a lot with like, how do I produce this thing and be true to it and also not be scary and kind of like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4915.742,
    "end": 4916.884,
    "text": " Do I change my language?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4916.944,
    "end": 4918.528,
    "text": "Do I all of these things?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4918.588,
    "end": 4925.022,
    "text": "And then it felt like, no, all I can do is I think as any of us can do and maybe I'll change my",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4925.825,
    "end": 4951.748,
    "text": " my feeling on this future is all we can do is be true to like what's within us and what we see and bring it into the world with as much care as possible so that the the people that can connect with it can and the people that don't don't I'm not that worried about the amount of people that won't connect with something like this framework they'll find something else they can connect with they'll find other language that matters to them they'll find different areas and and I also like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4952.649,
    "end": 4976.739,
    "text": " if someone took the framework and they said oh half of this seems absolute rubbish but i half of it kind of resonates and i'm curious and i want to dive into this one particular question well great you know it's like fabulous i think we should all follow the breadcrumbs and interests that matter to us and as to having an i guess it feels like maybe slightly different question with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4978.143,
    "end": 4988.271,
    "text": " with the nature of ecological organizations, because in some way that feels more vital, more urgent in some ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4988.911,
    "end": 5005.725,
    "text": "I feel like our, I feel an urgency that more people recognize that organizations are ecological and that organizations are likely causing harm and help and all of these things, but they're having",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5006.9,
    "end": 5028.653,
    "text": " impacts and they're affecting things um that to me feels urgent for these times and and as bio akamalafi always says when in urgent times we slow down so or let's slow down um but i can imagine that it might be very hard for people to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5031.078,
    "end": 5056.229,
    "text": " hold the like what does that mean when we start to like look at an organization as this massive web of constantly changing fluid relationships that are enmeshed in other fluid constantly changing relationships you know you and i've been there on this conversation it's a tension we have to hold it's an almost an impossibility um um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5060.353,
    "end": 5062.975,
    "text": " I don't know the answer to that, really.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5062.995,
    "end": 5076.703,
    "text": "I mean, that was why I spent so much time working on the kind of visualization for this talk was like, how do I... It felt like an impossible question to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5077.243,
    "end": 5086.529,
    "text": "How do I bring something that feels like it's very personal and comes from my lived experience as a human being?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5086.569,
    "end": 5087.89,
    "text": "And how do I somehow...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5089.614,
    "end": 5094.098,
    "text": " share that in a way that might trigger other people to have their own personal experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5094.118,
    "end": 5109.971,
    "text": "Because it feels to me important that we don't hold organizations as these lifeless theories, these lifeless ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5113.814,
    "end": 5117.697,
    "text": "But I don't know how to take everyone there, or I don't know how everyone would get there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5121.058,
    "end": 5136.372,
    "text": " when when you said the organizations like they might be lifeless and also like almost absent your framework or similar approach they they are lifeless de facto and it's like well we're living so then we're getting bled out",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5137.651,
    "end": 5158.084,
    "text": " in the organization because then there's some point in which the life is being enclosed or is drawing the energy of something that's from the living to the unliving and then the organization is part of a death process rather than a regeneration process",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5159.09,
    "end": 5188.577,
    "text": " But if we can be like in a room that is living, like you mentioned with your colleague in the case of a physically living building, but you also brought up other senses, not just the architecture, but socially living and so on, then we would be like warm bodies in a warm room instead of like our energy always just being dissipated by these cold synthetic intelligences that aren't human and aren't aligned.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5189.775,
    "end": 5190.095,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5191.037,
    "end": 5191.918,
    "text": "Yeah, interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5191.938,
    "end": 5200.387,
    "text": "I think I would slightly challenge that in the sense that I'm not sure that organizations can be dead or culled.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5202.055,
    "end": 5203.376,
    "text": " I'm not sure they can.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5203.396,
    "end": 5213.945,
    "text": "I think our experience of them can be, and our experience as a human interacting with them and being a member in them can leave us cold and feeling deadened inside.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5214.645,
    "end": 5226.014,
    "text": "Certainly the experience I had that brought me to self-organisation is that I felt I was like my soul was dying within certain businesses and organisations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5227.015,
    "end": 5228.716,
    "text": "But I don't think they are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5228.816,
    "end": 5229.176,
    "text": "I think...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5230.248,
    "end": 5238.498,
    "text": " though that how we steward these organizations in the same way like do we we",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5242.016,
    "end": 5242.497,
    "text": " let's go back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5242.557,
    "end": 5242.777,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5242.817,
    "end": 5247.479,
    "text": "How we steward them will change how we experience them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5248.24,
    "end": 5257.705,
    "text": "So if a group of people, let's think about this the other day, like let's say a group of people all get together and they, you know, it doesn't like, let's take Amazon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5257.985,
    "end": 5261.067,
    "text": "It doesn't feel like there's a soul within Amazon, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5261.167,
    "end": 5266.75,
    "text": "It doesn't feel like the people that came to birth and steward Amazon have done that with people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5267.23,
    "end": 5286.608,
    "text": " with heart and soul and kind of connected to life that's my experience of it does that make amazon the organization dead not to me it doesn't but it's like what they've what they've nurtured and stewarded without being aware of it maybe or through their intentionality",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5287.569,
    "end": 5303.907,
    "text": " becomes a very different experience and say an experience of an organization that's being nurtured and birthed through awareness and connectivity and care and compassion and humanity and love.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5305.949,
    "end": 5307.871,
    "text": "So that's where I'd be with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5311.567,
    "end": 5340.354,
    "text": " well you took on an impossible challenge as you said but you took steps and now i hope that the ecosystem can meet you on this interface object you've created and i guess in closing where do you intend to take the work or like what will be exciting for you going forward",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5342.352,
    "end": 5350.554,
    "text": " Yeah, well, one thing that came very clear to me as the framework was coming together was it makes immense sense to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5350.634,
    "end": 5356.936,
    "text": "It comes from kind of pulled from so many different worlds of experience and knowledge and information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5357.016,
    "end": 5363.317,
    "text": "And it's had a great response in the world from people that have really connected with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5363.377,
    "end": 5367.818,
    "text": "I know that it's being utilized in a couple of different schools and business schools already.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5367.898,
    "end": 5369.899,
    "text": "It's kind of, wow, that's amazing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5370.399,
    "end": 5370.819,
    "text": "People are...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5371.999,
    "end": 5395.545,
    "text": " bringing it into their organizations but and that's that's amazing to me and also was that sense as I was bringing it together that this needs now some real world experience like everything else this feels in a bit like an infant or a or a young child that's been kind of nurtured into the world and now it needs real life experience so the more that the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5396.593,
    "end": 5421.395,
    "text": " framework can be interacted with the more it can be explored um on a personal level as it said the more that happens i think the richer it will be and and it's it needs that um on a personal level i have i've had a long kind of sense that i would like to some to start a community because of the interest it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5422.182,
    "end": 5444.971,
    "text": " gathered, come together, draw people in that are fascinated with holding up this lens of ecological organisations and support them by bringing in people from all these different worlds that inspired it, such as interbeing and sense-making and self-organisation and all of these things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5446.692,
    "end": 5451.034,
    "text": "So, yeah, I'm curious to see if I've kind of got this sense that post-Christmas",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5451.86,
    "end": 5460.906,
    "text": " I'll probably be initiating that as a community and I would like to support them and I'd like to gather information and real world, real life data from that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5461.767,
    "end": 5465.81,
    "text": "And I'd like to start, if I can, working with organizations that are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5466.556,
    "end": 5479.282,
    "text": " drawn to the framework, um, to, to see what happens as we, over the longer term, as we apply it and utilize it, like what changes about the framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5479.783,
    "end": 5492.129,
    "text": "And I am just like, I'm so, it'd be so excited if people have, if anyone listening to this or watching this has ideas, sees ways it could evolve or be worked with, like, I'd love them to like, let me know because it's,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5493.288,
    "end": 5513.656,
    "text": " know it's had it's it's got life to it but the more life that can be given to it the richer and the more it will grow thank you awesome anything else just thank you so much for having me it's um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5514.691,
    "end": 5520.812,
    "text": " I've never found or I've always found writing easier than sitting in kind of something like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5520.872,
    "end": 5522.653,
    "text": "But I actually really, really enjoy it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5522.873,
    "end": 5529.414,
    "text": "And I thank you so much for your care in there and your thoughtfulness in the questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5529.514,
    "end": 5532.135,
    "text": "And I've loved our discussion for everyone listening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5532.215,
    "end": 5534.635,
    "text": "Thank you for sharing your thoughts and your questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5534.835,
    "end": 5543.277,
    "text": "And just if you want to find me on LinkedIn or through my site, anyone watching this that gets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5544.344,
    "end": 5567.431,
    "text": " activated and excited by it wants you know support to enter it or anything like please let me know i'd love that thank you well best of luck and see you around i hope that we can continue to explore this i'd like that thank you daniel thank you good day see ya you too bye bye",
    "speaker": "SPEAKER_00"
  }
]