[
  {
    "start": 5.558,
    "end": 18.346,
    "text": " hello and welcome it's january 26 2023 we're here in active inference model stream number 8.1 today we're appreciative to have thomas ringstrom",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 19.292,
    "end": 27.919,
    "text": " who will be presenting on reward is not necessary, a compositional theory of self-preserving agents with empowerment gain maximization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 28.559,
    "end": 31.401,
    "text": "There will be a presentation followed by a discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 31.681,
    "end": 34.003,
    "text": "So Thomas, thank you for joining.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 34.163,
    "end": 35.144,
    "text": "Really looking forward to this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 35.885,
    "end": 36.245,
    "text": "Off to you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 38.035,
    "end": 39.056,
    "text": " Yeah, thank you very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 39.096,
    "end": 42.358,
    "text": "It's really nice to be here and talk to this group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 44.539,
    "end": 49.302,
    "text": "I'm a computer science PhD student at the University of Minnesota.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 50.402,
    "end": 51.843,
    "text": "My interests are in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 54.565,
    "end": 71.181,
    "text": " What are the computational properties that we would need to have agents which flexibly plan in high-dimensional product spaces of variables?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 72.462,
    "end": 83.912,
    "text": " And also, how do we get agents to perform complex tasks in an intrinsically motivated way, especially in high dimensional product spaces?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 85.834,
    "end": 97.344,
    "text": "So this presentation is going to argue that reward, and I know I'm talking to a sort of active inference crowd,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 99.285,
    "end": 103.248,
    "text": " But some of the same points apply to active inference, perhaps, too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 103.328,
    "end": 115.598,
    "text": "But this presentation is mostly about how there's going to be some major problems, I think, using reward maximization objectives and by",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 116.138,
    "end": 124.204,
    "text": " moving to sort of reward-free objective functions, we can get really nice factorizations that help us plan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 124.485,
    "end": 131.03,
    "text": "So let's just start off with a sort of simplified picture of an organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 131.13,
    "end": 132.351,
    "text": "So we have a honey badger here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 133.372,
    "end": 139.777,
    "text": "And so this honey badger has internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 140.417,
    "end": 142.399,
    "text": "It gets hungry and it gets thirsty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 143.279,
    "end": 147.502,
    "text": " And there's also an external world that the agent lives in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 148.523,
    "end": 157.87,
    "text": "And in order to modify internal state spaces, the agent might have to perform some complex tasks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 159.151,
    "end": 167.039,
    "text": " It might have to get several items in order to, you know, eat an apple or things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 167.34,
    "end": 180.313,
    "text": "So you could see that maybe some symbolic state space sort of mediates the connection between things you do in the world and transformations that you make on some internal state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 181.134,
    "end": 200.284,
    "text": " and of course real you know real world organisms and humans are live in a high dimensional world so you could imagine that there's an encoder and a decoder and really you know there's a sort of high dimensional physiological or interoceptive domain",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 201.044,
    "end": 226.526,
    "text": " that that is these sort of y tilde with the dot or y tilde i should say and z tilde and then there's you know high dimensional worlds you could just say that the that's x tilde and really you just need to sort of map these down to some discrete state space in which these domains can interact so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 228.792,
    "end": 231.555,
    "text": " Yeah, here's like a simple encoder and decoder.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 233.497,
    "end": 244.83,
    "text": "And so if an agent has a kind of simple ontology like this, you can imagine that it's sort of generatively entrained to the world that it lives in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 246.011,
    "end": 251.374,
    "text": " which is a notion that's probably pretty familiar to sort of active inference people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 253.355,
    "end": 273.345,
    "text": "So, you know, you have some encoder of these high dimensional states, and then you have some operator PS, which is in the middle of the head here, and that just sort of advances the latent states, and then you decode, and you'll get sort of expectations of the high dimensional world that the agent lives in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 274.748,
    "end": 289.879,
    "text": " And so the problem is that you can't really represent explicitly these latent space transition operators that would dictate the dynamics of all these variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 289.919,
    "end": 301.567,
    "text": "You can't represent it as an explicit object because the more state spaces that you keep track of in the world, the larger this object PS becomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 302.387,
    "end": 308.391,
    "text": " So in order to handle this, you'd have to represent it in a sort of factorized form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 308.612,
    "end": 318.939,
    "text": "So you just would represent its factors and you wouldn't explicitly sort of enumerate all of the state vector transitions under this transition operator.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 320.14,
    "end": 320.42,
    "text": "And so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 322.563,
    "end": 345.91,
    "text": " What we really need to think about is, you know, what are the sort of model based or the sort of Bellman principles for decomposing hierarchical state spaces so that we can create the right representations that help us plan in a flexible way in a sort of time varying, time dependent,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 346.69,
    "end": 369.133,
    "text": " a world of lots of lots of variables so this just means um you know what is the sort of objective function l telegraphic l applied to ps or its factorization that would give us um that would give us some uh factors here uh eta and and these omegas that could help us plan",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 370.254,
    "end": 396.645,
    "text": " and also how you know given the fact that you know the state space the effective product space that we're working in is so large and there's many possible state factors that describe possible states of the world how do you know what to do i mean if you're an rl theorist you would have to say well there exists some kind of reward function that tells you you know this state of the world is is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 397.245,
    "end": 407.929,
    "text": " worth this much reward in this state of the world is worth this much reward, but it's not really clear how you should define reward functions on huge product spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 408.449,
    "end": 414.191,
    "text": "So I'll address this question from a sort of reward-free perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 415.011,
    "end": 425.535,
    "text": "And just to give you a hint of what it's going to be like, what I'm going to argue is that what we really need are agents that have a kind of structured",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 426.255,
    "end": 451.086,
    "text": " core ontology that it needs to maintain that is coupled state spaces that really depend on each other in which the policies that you use maintain the sort of internal integrity or controllability of the agent um so and that's where empowerment will eventually come in so i'll talk about empowerment a little too that's the controllability metric",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 452.066,
    "end": 468.988,
    "text": " So here I'm just saying, what's a nice policy or what's an objective function F that takes in some intrinsic motivation function, which is this fancy V here, along with a nice factorization that allows you to plan on the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 470.109,
    "end": 478.473,
    "text": " Okay, so just to recap things that I already said, we're in a product space of state of variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 479.013,
    "end": 481.234,
    "text": "We have internal and external state spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 481.254,
    "end": 485.256,
    "text": "You know, hunger and hydration state spaces can be dynamic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 485.296,
    "end": 487.596,
    "text": "As you do things in the world, you get hungrier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 489.338,
    "end": 490.278,
    "text": " So how do we plan?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 490.819,
    "end": 492.44,
    "text": "How do we know what a good goal is?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 492.6,
    "end": 506.406,
    "text": "And what I'm going to argue is that we should compute a specific representation called a state time feasibility function, which is going to be an abstraction that's going to map us from initial state times to final state times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 506.686,
    "end": 509.628,
    "text": "And this will have some really nice properties that allow us",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 510.228,
    "end": 514.453,
    "text": " to sort of reason in this high dimensional state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 515.274,
    "end": 520.339,
    "text": "And I'm going to talk about this from just a dynamic programming point of view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 520.399,
    "end": 521.921,
    "text": "There isn't going to be any learning",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 523.729,
    "end": 531.252,
    "text": " OK, so let's just talk about transition operator composition, because I said, well, we have this large product space of state variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 531.413,
    "end": 534.474,
    "text": "And it'd be nice if we just represented it as a factorization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 534.974,
    "end": 535.835,
    "text": "So what does that mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 538.096,
    "end": 542.478,
    "text": "So imagine that you have Px, which is like a base state space to move around the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 543.098,
    "end": 546.92,
    "text": "And you have some internal state space or secondary state space Py.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 547.52,
    "end": 551.502,
    "text": "And these are linked by some function f. So here's your base state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 552.543,
    "end": 555.267,
    "text": " And here's the honey badger in the state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 556.288,
    "end": 563.38,
    "text": "And here's the secondary state space, which is just like your internal hunger space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 565.779,
    "end": 569.161,
    "text": " And so f, what f is going to be is called an availability function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 569.781,
    "end": 588.692,
    "text": "An availability function is going to say, oh, this, you know, this honey badger is in state x at time t. And given that it's there, what's the probability that this goal is available from this state time, state action time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 589.412,
    "end": 595.096,
    "text": " And so this goal is formally going to be an action on the higher level state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 595.636,
    "end": 607.924,
    "text": "So, for instance, these green lines on the high level state space are going to map you to the most satiated state where you're not hungry anymore at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 608.444,
    "end": 613.348,
    "text": "And then these black lines on the internal state space are just going to decrement you one state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 614.108,
    "end": 623.421,
    "text": " if you're if you're not at the tree so you eat apples at the tree and that's going to map you to the top and all other states without a tree you're going to get hungrier over time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 624.821,
    "end": 645.443,
    "text": " okay so if we wanted to uh write a product space operator uh you know ps you know y prime x prime uh we can just represent this as a composition where lambda p is our composition operator and it's just going to be defined as the product of uh your two state spaces with f",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 646.384,
    "end": 655.128,
    "text": " linking them, and then we sum over G. So we're getting rid of the goal variable, and so we can represent the product space this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 655.288,
    "end": 656.989,
    "text": "And we can also just call the product space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 657.049,
    "end": 669.035,
    "text": "We can say that bold S here is just the state vector for YX, or if we have more variables, that can be incorporated into bold S. Okay, so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 671.693,
    "end": 688.801,
    "text": " what if we have more features of the world we can drink water we can get warm at the house um well we will need to have a a bigger composition so we can just create an operator called we'll just call pr",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 689.981,
    "end": 707.531,
    "text": " where bold r is just a state factor of w y and z and w y and z correspond to the hydration uh the the hunger and the temperature space and so this is just a product of the individual ones uh individual operators",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 708.411,
    "end": 721.116,
    "text": " And so this influence graph is connecting px to pw, py, and pz through f. And so we can just define the product space operator as a composition this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 722.457,
    "end": 736.583,
    "text": "And if we do that, you start to realize, well, this is nice because the effective state space exponentiates, essentially, as you add on more state spaces that you can control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 737.683,
    "end": 756.495,
    "text": " and so this influence graph is just showing you know you know what is the sort of ontology of the agent what is what what constitutes it as its internal and external coupling and you could imagine that it gets more complicated for instance that if you hit you know w0",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 757.655,
    "end": 763.681,
    "text": " or Y zero or whatever, that these skull and crossbones indicates that you die.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 763.761,
    "end": 768.105,
    "text": "So you can imagine being in a state has a bi-directional influence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 768.445,
    "end": 775.111,
    "text": "So Zeta here is conditioning the possible dynamics PX can produce.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 775.632,
    "end": 781.758,
    "text": "So you could imagine that once you're in one of those sort of defective bad states that it kills you and you can't move around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 782.358,
    "end": 793.632,
    "text": " So you can imagine sort of more complicated structures like this, which essentially mean that you have to go out in the world and do things in order to keep the system alive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 794.473,
    "end": 796.716,
    "text": "So you don't want to hit W0 or Z0.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 800.331,
    "end": 802.652,
    "text": " And you can imagine this gets even more complicated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 802.712,
    "end": 819.381,
    "text": "You could compose sort of larger structures where P-sigma is going to be some logical state space that keeps track of multiple conditional events that need to occur for, say, eat an apple or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 821.763,
    "end": 825.005,
    "text": " So representing it in this form is very nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 825.125,
    "end": 829.869,
    "text": "We just represent the factors and the links between the state spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 830.569,
    "end": 836.354,
    "text": "And that's a sort of memory efficient way of representing the space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 837.855,
    "end": 841.318,
    "text": "Okay, so if we have a homeostatic task,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 842.419,
    "end": 864.382,
    "text": " I'll eventually get to the sort of Bellman equations and the model-based formulas, but first I'm just going to sort of build up an intuition in the form of an example about how these state-time feasibility functions are going to work, the state-time feasibility function being the representation that I'm arguing for in this talk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 865.976,
    "end": 885.778,
    "text": " So if we have a hiker and it can go into the world and drink and eat and get warm with these goal variables, well, there's also this goal variable G epsilon, which is going to decrement by one state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 888.522,
    "end": 903.204,
    "text": " then as the uh as the hiker moves around you can you could represent this as a function so imagine that the hiker starts at xg1 that's the house",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 904.205,
    "end": 930.606,
    "text": " and ts which is the start time and if the hiker follows a policy pi 2 so imagine that you have a policy that is a goal like a goal condition policy pi g2 that's going to take you to x g2 okay so it's a policy it's like a shortest path policy or whatever um then that means that there's going to be some final state time x g2 tf",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 933.131,
    "end": 939.302,
    "text": " that you achieve this goal, G drink, which remember is an action on the higher level space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 942.714,
    "end": 966.76,
    "text": " so what this would look like is that you decrement two rights because that takes two time steps to get to the lake and then once you get to the lake you take the state action that's going to drink and it's going to bring you up so there's there's three total steps in this process of inducing the drink goal variable and then the step after drinking",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 969.124,
    "end": 970.065,
    "text": " which would look like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 971.247,
    "end": 976.736,
    "text": "And then you can imagine, well, the other state spaces are not involved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 977.116,
    "end": 980.942,
    "text": "And so they will all decrement three because there's three time steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 982.478,
    "end": 1001.255,
    "text": " And so one way to represent this is to realize that if all of these goal variables on the way to the lake are sort of the null goal variables, meaning that the agent isn't affecting some other state space,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1002.296,
    "end": 1004.697,
    "text": " then you can define that as a Markov chain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1004.818,
    "end": 1021.287,
    "text": "So if you set all of the goals to be the epsilon goal, the null goal, then this PY epsilon is going to be a Markov chain matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1021.908,
    "end": 1025.069,
    "text": "And so that means that the time difference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1027.811,
    "end": 1043.642,
    "text": " Encoded in the state time feasibility function, the TF minus TS is going to be the power that you can take this Markov chain to in order to forward evolve all the other internal state spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1044.022,
    "end": 1054.47,
    "text": "So you can define an operator that does this in one step called omega y, which is just going to take some initial state, so this green dot or this red dot,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1057.968,
    "end": 1059.629,
    "text": " And it's going to take the time difference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1059.869,
    "end": 1062.99,
    "text": "So this is going to be two to get from the house to the lake.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1063.03,
    "end": 1063.91,
    "text": "It's two time steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1064.731,
    "end": 1072.854,
    "text": "And so these gray arcs are just an initial to final state map under this policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1075.681,
    "end": 1090.333,
    "text": " And so what this looks like, this looks sort of complicated, but you can build a jump operator that jumps you from your initial high dimensional state, for instance, yxt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1091.574,
    "end": 1115.585,
    "text": " and we're just considering y for now i don't have the other state spaces uh w and z in here but uh this eta over here is is mapping you on the x space the omega y is mapping you forward to in in the uh in the y space and then the py and the px are just evolving by one step",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1117.565,
    "end": 1119.906,
    "text": " to update after you hit the goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1120.167,
    "end": 1122.788,
    "text": "So after you hit the goal, you have to update by one step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1123.068,
    "end": 1126.81,
    "text": "So py and px do that for both state spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1127.27,
    "end": 1131.752,
    "text": "And then, of course, you can do this for all the state spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1131.912,
    "end": 1136.515,
    "text": "So a jump operator for all of the internal state spaces are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1137.714,
    "end": 1155.703,
    "text": " where r, remember, is the vector of all your internal states, w, y, and z. Then this is similarly defined, where omega r is just the product of all of these other omegas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1155.803,
    "end": 1160.625,
    "text": "So we defined omega y up here, but you can just define this for all of your other state spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1163.855,
    "end": 1171.397,
    "text": " So now that we've done that, we can continue our journey by going to the tree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1172.337,
    "end": 1173.718,
    "text": "And so that's two steps away.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1173.838,
    "end": 1177.579,
    "text": "So all of the other things decrement two and then an additional one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1178.419,
    "end": 1188.201,
    "text": "And then if we go back to the house, that's four times steps away, plus the additional time step of entering the house and getting warm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1189.262,
    "end": 1189.542,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1190.402,
    "end": 1190.582,
    "text": "So.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1192.674,
    "end": 1209.102,
    "text": " Here is another route you could take where the agent, the hiker goes to the tree to eat and then the hiker goes to the lake to drink and then goes back to the house to get warm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1209.582,
    "end": 1218.247,
    "text": "And so this JS is a huge, it's important to keep in mind that JS is a huge operator and we cannot,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1219.387,
    "end": 1235.769,
    "text": " uh explicitly form it in memory uh because it's unless we have you know a lot of memory on our computer um but having this factorization allows us to chain policies together and evolve a high dimensional state vector",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1236.65,
    "end": 1237.391,
    "text": " in these jumps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1238.031,
    "end": 1254.322,
    "text": "So we're jumping a state vector around in this object-oriented fashion where each state vector is updated once you get to some key object of interest, such as the tree with the apple or the lake with the water.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1256.747,
    "end": 1265.593,
    "text": " So also in this example, you can see that the agent went from the lake to the house.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1266.654,
    "end": 1273.638,
    "text": "And technically, if Z, it occupies the lowest state, Z0.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1274.139,
    "end": 1278.462,
    "text": "And so technically, it should die at the skull and crossbones on the map.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1279.022,
    "end": 1281.103,
    "text": "But we let it finish his journey.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1281.123,
    "end": 1285.866,
    "text": "And we haven't talked about this sort of bidirectional coupling yet, but we'll do that in the next slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1288.489,
    "end": 1289.449,
    "text": " to make that concrete.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1291.691,
    "end": 1292.212,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1292.232,
    "end": 1292.272,
    "text": "So,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1295.572,
    "end": 1307.297,
    "text": " If we have these defective states, we can define mode parameters, E plus and E minus, which are just going to be variables that condition our dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1307.677,
    "end": 1317.941,
    "text": "And we can have a mode function that takes any vector r. And so an r is any vector of blue, green, and red squares in the space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1318.501,
    "end": 1320.222,
    "text": "And we can map it to a mode parameter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1320.742,
    "end": 1323.123,
    "text": "So we can define zeta.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1324.804,
    "end": 1333.45,
    "text": " to map to the good mode, the normal healthy mode, if it's not occupying any of the defective states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1333.65,
    "end": 1341.496,
    "text": "But if one or more defective states are occupied, then we can map it to E minus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1342.316,
    "end": 1355.528,
    "text": " And so that means if we have some low level transition operator that's indexed by E, that means we can split it into a normal dynamics PE plus and a defective dynamics PE minus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1355.728,
    "end": 1361.232,
    "text": "And you just notice that the defective dynamics is a sort of identity operation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1361.273,
    "end": 1364.776,
    "text": "It just sort of arrests your dynamics in the space so you can't move around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1364.836,
    "end": 1368.899,
    "text": "But the normal dynamics is just normal grid world movement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1370.1,
    "end": 1381.609,
    "text": " OK, and so what we can do is we can compute a set of individual feasibility functions for each object of interest in the map.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1382.549,
    "end": 1388.554,
    "text": "So in the previous example, we had, you know, two trees, two lakes and a house.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1388.774,
    "end": 1392.476,
    "text": "So we have five state time feasibility functions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1393.88,
    "end": 1406.253,
    "text": " And then this eta hat is an aggregate function of all of these functions, where the pi is indexing the corresponding pi for that function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1407.975,
    "end": 1411.699,
    "text": "Anyone can ask questions, by the way, if they have any questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1415.243,
    "end": 1415.724,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1422.288,
    "end": 1422.688,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1422.888,
    "end": 1444.936,
    "text": "So the full dynamics is going to be just defined like we defined it before, where we we have these two state spaces, the base state space coupled to the internal state space through F. But then we have the Zeta R here on the conditioning side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1446.056,
    "end": 1462.1,
    "text": " And so this is a sort of an operator that you sort of have to achieve goals in order to keep yourself out of these sort of absorbing defective states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1464.121,
    "end": 1472.923,
    "text": "And I showed this influence diagram before, but this influence diagram is capturing this coupling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1475.484,
    "end": 1490.114,
    "text": " OK, so many of you will probably be familiar with the standard Bellman equations, which are formalized this way, where you have some reward function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1491.536,
    "end": 1495.261,
    "text": " plus some discounted expectation of your future value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1495.802,
    "end": 1506.136,
    "text": "And so the value function in a sort of standard Bellman equation says how much reward am I going to get if I act here optimally over an infinite horizon?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1507.495,
    "end": 1511.576,
    "text": " And so the reward function is often thought to be a task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1512.237,
    "end": 1516.418,
    "text": "It has that sort of semantics in RL land.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1519.579,
    "end": 1532.624,
    "text": "And then the optimal policy is just going to return the action that corresponds to the best action that maximizes your value, your long run sum of rewards that you're going to get.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1533.524,
    "end": 1536.005,
    "text": " So this is a recursive equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1537.826,
    "end": 1559.499,
    "text": "But my thesis is that we need to rethink the model-based Bellman formalizations in order to compute these nice factorizations that move us around high-dimensional space, like we've been talking about on the previous slides.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1560.479,
    "end": 1566.183,
    "text": " So we're going to formalize some new Bellman equations called operator Bellman equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1567.364,
    "end": 1574.908,
    "text": "And these are going to be non-stationary Bellman equations, or they're going to be functions of time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1575.809,
    "end": 1582.033,
    "text": "So instead of having a value function that says, what's the accumulated reward that I get?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1582.053,
    "end": 1585.876,
    "text": "I'm going to have a cumulative feasibility function, kappa,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1587.436,
    "end": 1597.681,
    "text": " And this is going to represent what is the cumulative probability that I achieve a particular goal, where a goal, remember, is an action on a higher level space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1599.682,
    "end": 1605.309,
    "text": " So this has a very similar form to the infinite horizon Bellman equation that I just showed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1605.949,
    "end": 1610.755,
    "text": "But you'll notice that we have this availability function here for a specific goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1610.915,
    "end": 1613.938,
    "text": "So this is a single goal G that we're picking out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1614.079,
    "end": 1619.805,
    "text": "So say the Eden apple goal or the drink the water goal, we're just choosing one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1620.886,
    "end": 1631.478,
    "text": " And so F is returning the availability of G from any given state and time and action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1633.591,
    "end": 1646.237,
    "text": " And then, so either the agent achieves a goal now, which is what this equation is saying, or, which is the plus, the agent does not achieve the goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1646.297,
    "end": 1651.52,
    "text": "So one minus the probability of achieving the goal is the probability that you don't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1653.34,
    "end": 1658.344,
    "text": " achieve the goal times the expectation that you achieve it in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1658.984,
    "end": 1666.11,
    "text": "So it has this similar recursive structure that the infinite horizon Bellman equation has.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1667.668,
    "end": 1694.601,
    "text": " okay so then we have the policy and this policy equation is a little different from the last one because you can imagine that you can maximize the cumulative that you achieve a goal but you you sort of do it at the last second you have a lot of you have maximized certainty that you can get to the store right before it closes so you have you know you know 100 that you can achieve",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1696.722,
    "end": 1700.843,
    "text": " the goal of getting an item from the store five minutes before it closes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1701.463,
    "end": 1712.707,
    "text": "Well, it might be if the store is open for some period of time that essentially you might want to get it as soon as possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1713.187,
    "end": 1718.969,
    "text": "So what this equation is saying is that we're going to pick the action",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1720.029,
    "end": 1727.754,
    "text": " which maximizes the cumulative, but from that set of equivalent actions that maximize the cumulative, which is a star.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1728.174,
    "end": 1734.918,
    "text": "So we're collecting the actions that maximize the cumulative, and we're going to pick the one that minimizes the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1735.398,
    "end": 1746.245,
    "text": "So this is a sort of conditional optimization that says subject to the fact that we want to maximize the cumulative, we want to get there as fast as we can.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1748.481,
    "end": 1757.862,
    "text": " um and so normally there's just you know with the infinite horizon bellman equation there's the value function and the policy here we have a third um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1759.644,
    "end": 1763.407,
    "text": " function, which is the state-time feasibility function, which I've been talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1764.689,
    "end": 1780.544,
    "text": "And the state-time feasibility function says, given that I start at x and t, what's the probability that I achieve a goal, g, at a particular state, final state in time, xf and tf?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1781.736,
    "end": 1788.858,
    "text": " And so you can compute this via dynamic programming as you're computing these other functions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1790.119,
    "end": 1807.784,
    "text": "And there's a relationship between the cumulative feasibility and the state time feasibility, which is that if you can sum up the individual final states and times from your state time feasibility, then that is the cumulative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1809.108,
    "end": 1816.452,
    "text": " So the cumulative feasibility is just summing over the individual probabilities of a given state, final state time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1818.472,
    "end": 1835.901,
    "text": "And the nice property is that when you use these operator Bellman equations on hierarchical state spaces, such as the product space of the agent's core ontology, it has a nice decomposition property, which is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1836.881,
    "end": 1853.928,
    "text": " if you're just solving to go to a particular point in the world then you can actually compute eta separately from the high level space so you just solve for for eta the state time feasibility function on the low level space",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1854.508,
    "end": 1860.592,
    "text": " But then omega can be computed independently in the high level space and they can be combined.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1861.292,
    "end": 1871.218,
    "text": "So this decomposition property is really nice because we never want to work in a product space, especially as we learn tons of dynamics about how the world works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1871.798,
    "end": 1880.744,
    "text": "We need to be able to compute representations in a factorized way, which is going to help us move around in reason.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1881.944,
    "end": 1910.41,
    "text": " So this means that when we compute a bunch of individual state time feasibility functions for each goal, I don't know why this little hat is here, but then if we have five of these and we have an aggregate feasibility function, then we can use this aggregate feasibility function to move around from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1912.073,
    "end": 1918.534,
    "text": " from feature to feature in the low level world and update all of our internal and higher level states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1919.755,
    "end": 1927.316,
    "text": "And so this is the object from the previous slides that sort of map us around the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1928.717,
    "end": 1936.858,
    "text": "So you can also do, and I won't talk about this much, but you can also do logical tasks where instead of eating an apple, you might want to gather an apple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1937.418,
    "end": 1940.079,
    "text": "So if you go obtain an apple,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1940.595,
    "end": 1945.959,
    "text": " then there could be a bit that corresponds to having an apple, and you flip that bit to one once you go to the tree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1945.979,
    "end": 1949.282,
    "text": "And then you go gather water at the lake, and you flip that bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1950.163,
    "end": 1954.866,
    "text": "And then you go to the key, and you obtain that key.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1954.986,
    "end": 1964.234,
    "text": "And that might be a task where you have to obtain these three items, perhaps because you wanted to compose this task with something else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1964.274,
    "end": 1968.097,
    "text": "You want to bring these items to another agent or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1968.817,
    "end": 1979.308,
    "text": " So the point is that you can use these factorizations to move around the world, especially when things in the world have a sort of limited time period in which they are available.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1981.169,
    "end": 1992.793,
    "text": " So yeah, I talked about how we can plan in these high dimensional state spaces using this factorization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1994.254,
    "end": 2003.457,
    "text": "And now we get to the question, well, why should I plan to any particular high dimensional state?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2003.657,
    "end": 2006.158,
    "text": "And that's the intrinsic motivation question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2007.658,
    "end": 2018.548,
    "text": " Given that there's an exponential number of state vectors in a product space, why is one state vector of the world in the far-off distance better than another?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2020.461,
    "end": 2022.462,
    "text": " So that's where empowerment comes in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2023.322,
    "end": 2031.287,
    "text": "Empowerment is an intrinsic motivation metric which sort of represents controllability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2031.907,
    "end": 2037.15,
    "text": "So formally, empowerment is a function of a transition operator.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2037.69,
    "end": 2043.433,
    "text": "It's an intrinsic measure of a transition operator.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2044.173,
    "end": 2068.062,
    "text": " and it's and you can also condition it on the states that an agent is at so it takes two arguments it also has a horizon n which we'll talk about in a second um so it's formally defined as the shannon channel capacity between your actuators or sequences of actions that you take and the resulting states so the channel capacity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2069.282,
    "end": 2079.073,
    "text": " So here, you know, an open loop sequence of actions would just be, you know, go up right and up again or up left and then down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2079.653,
    "end": 2080.394,
    "text": "There's a whole bunch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2080.995,
    "end": 2083.397,
    "text": "There are a lot of possible sequences of actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2083.538,
    "end": 2088.062,
    "text": "So big A here is a random variable for your sequences of actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2088.983,
    "end": 2101.733,
    "text": " And so for a horizon n, you can ask, how much information can we transmit from our actuators to the resulting state at time tau?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2102.153,
    "end": 2110.08,
    "text": "So tau minus t is our horizon n, which is this parameter on the empowerment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2110.66,
    "end": 2132.678,
    "text": " so it's just saying you know how much what's what's the agent's capacity to affect the future with uh certainty or or varying amounts of certainty and so the channel capacity is formally defined as the maximum mutual information givens uh distribution over these action sequences",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2135.033,
    "end": 2153.622,
    "text": " um and the mutual information decomposes into the entropy of the final states minus the conditional entropy of the final state random random variable given that you know given the actions and and your starting state so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2155.672,
    "end": 2161.695,
    "text": " This means that there are two extremes to empowerment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2162.956,
    "end": 2177.644,
    "text": "If Px is a deterministic operator, so anytime I'm at state x and I apply an action, I get a deterministic output x prime, then the conditional entropy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2178.984,
    "end": 2183.248,
    "text": " There's going to be no uncertainty over my future states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2183.468,
    "end": 2185.569,
    "text": "So the entropy is going to be zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2185.769,
    "end": 2186.83,
    "text": "There's no uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2187.611,
    "end": 2192.154,
    "text": "And so that means that the conditional entropy has to cancel out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2192.795,
    "end": 2198.839,
    "text": "And so empowerment is really just the maximum possible entropy given.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2200.2,
    "end": 2227.277,
    "text": " this distribution and this just reduces down to the log of the number of possible reachable states so how much can i actually reach in the world um and so you know if my horizon is two we can see that you know the empowerment here is just log of 13. so i think there are 13 states i can get to and i have perfect control so i can actually realize any of those 13 states if i want",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2229.671,
    "end": 2245.462,
    "text": " And the other extreme is if PX is action independent, meaning that any sort of state that I'm in, I have an action that maybe there's the same distribution given that action, say a uniform distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2247.724,
    "end": 2258.63,
    "text": " Then my conditional entropy, given the actions, is just going to be the entropy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2259.391,
    "end": 2265.395,
    "text": "And so the empowerment has to be zero because this term is going to cancel out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2266.516,
    "end": 2281.477,
    "text": " um and so there might be a lot of states you can technically reach because i can select actions i'm just going to go random places so pink is all the states i could possibly reach but i don't have any control over which state i'm going to result i'm going to end up in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2283.092,
    "end": 2290.495,
    "text": " And so I can't influence my future in any way, even though there are a lot of possible futures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2290.695,
    "end": 2292.836,
    "text": "So empowerment in that extreme is zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2292.996,
    "end": 2303.321,
    "text": "And then there's an in-between zone where you take actions and there's a bias in one direction, or there's different distributions for each action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2303.341,
    "end": 2311.544,
    "text": "And so there might be uncertainty, but you can sort of control how much information, you can sort of control what state do you want to end up at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2314.173,
    "end": 2318.856,
    "text": " Okay, so what I'm going to define is a function valence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2318.976,
    "end": 2319.036,
    "text": "And",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2323.655,
    "end": 2331.321,
    "text": " It's important to note that there's two arguments, the states, and you can include the time, too, on the conditioning side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2331.681,
    "end": 2340.507,
    "text": "So you have empowerment, and you can define an empowerment difference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2340.747,
    "end": 2343.489,
    "text": "So say you start at S and T.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2345.17,
    "end": 2354.132,
    "text": " And then you end up at a future state in time after you execute some sequence of policies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2354.552,
    "end": 2359.833,
    "text": "So rho here, appended to the s and t, is a sequence of policies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2360.553,
    "end": 2363.314,
    "text": "And s rho and t rho are the resulting states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2364.194,
    "end": 2366.674,
    "text": "Then you can compute an empowerment difference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2368.334,
    "end": 2370.575,
    "text": "And this will be our valence function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2372.057,
    "end": 2378.144,
    "text": " So Q here is a function that I'll talk about in just a second.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2378.825,
    "end": 2385.132,
    "text": "But we can see that our jump operator that's moving around high dimensional space",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2386.93,
    "end": 2406.212,
    "text": " is defined as this factorization so we don't have to represent it remember that's an important part and so we can sample you know multiple policies from this or chains of policies so if i have policy one policy two then i'm going to have some resulting state r double prime x double prime tf2",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2407.874,
    "end": 2426.017,
    "text": " um and so Q here can just represent out the output of chains of policies so you can imagine you know a tree search of chains of policies and Q is just summarizing the final state of those branches in a tree search of policies of chains of policies",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2428.394,
    "end": 2428.874,
    "text": " All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2430.095,
    "end": 2432.375,
    "text": "So we can use this queue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2432.775,
    "end": 2433.036,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2433.416,
    "end": 2437.537,
    "text": "So notice that this queue here is in the expectation over here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2437.617,
    "end": 2442.519,
    "text": "So it's linking our original state time to the final state time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2442.599,
    "end": 2445.2,
    "text": "So it's the empowerment after some chain of policies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2447.4,
    "end": 2448.781,
    "text": "OK, so if we have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2453.768,
    "end": 2467.606,
    "text": " uh so say we have a deterministic operator and this should be a p um then valence is an empowerment difference we can have a simple sort of example here where we have two hikers that are considering two different plans",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2468.624,
    "end": 2484.13,
    "text": " And so if this tree here is like the space of, um, you know, two possible chains of policies, then these hikers are just executing, you know, one sort of path through this tree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2484.79,
    "end": 2493.733,
    "text": "So the, um, the hiker on the, so they both have the same empowerment cause they're starting at the same state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2495.714,
    "end": 2497.9,
    "text": " And they're both two away from starving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2497.94,
    "end": 2503.173,
    "text": "So if we just consider an empowerment at the beginning, that's a log of 13.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2505.434,
    "end": 2518.541,
    "text": " And if we chain together to two policies here, we can advance our internal state space and the agent will end up down at the lake.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2519.642,
    "end": 2530.347,
    "text": "And so given that it's at the lake, you'll notice that it's one state away from from dying so that there's an effective range of what it can",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2532.328,
    "end": 2542.249,
    "text": " where it can go so the empower the final empowerment is log five because there's five reachable states and we're assuming determinism to make this easy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2543.894,
    "end": 2550.219,
    "text": " So the valence here, and this should be PS here, but I have T here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2550.799,
    "end": 2555.603,
    "text": "But the valence is just log 5 minus log 13.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2555.803,
    "end": 2559.066,
    "text": "And that's the difference between the final and the initial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2559.526,
    "end": 2561.067,
    "text": "And so that has a negative valence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2562.288,
    "end": 2569.634,
    "text": "The yellow shirt hiker is clearly in a worse position that he started off at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2571.375,
    "end": 2592.568,
    "text": " but we can advance the other hiker with pi g3 to the lake and then pi g4 to the tree and updates his internal states and we can see that he's three away from dying so there's a bigger effective range",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2593.776,
    "end": 2620.461,
    "text": " um and so there are 25 states that he can get to and um so log of 25 minus log of 13 is 0.94 which uh means that uh he is he's better off than where he started and so clearly um the second hiker is executing a better plan um he has more freedom to uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2621.941,
    "end": 2642.557,
    "text": " to engage with other tasks in the world and so if if we you know searched over this entire tree of policy chains uh we could pick the best one uh in in this example we're just going to consider two two of these uh branches and we'd pick policy ig ig ig3 ig4",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2647.04,
    "end": 2647.44,
    "text": " All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2648.501,
    "end": 2650.922,
    "text": "So there's also another interest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2651.002,
    "end": 2655.304,
    "text": "So in this past example, we're just sort of changing the structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2655.704,
    "end": 2657.525,
    "text": "We're just changing the initial state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2659.206,
    "end": 2662.728,
    "text": "But since empowerment is also a function of a transition operator,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2664.142,
    "end": 2680.354,
    "text": " and our operator Bellman equations are producing transition operators that map us from state time to state time, then the output of those Bellman equations, the operator Bellman equations, produce transition operators so we can compute their empowerment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2682.416,
    "end": 2688.439,
    "text": " So that's a deep connection between Bellman equations and these intrinsic motivation metrics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2689.759,
    "end": 2703.185,
    "text": "So we can do interesting things where we can say, well, if the structure of the world were different, then the feasibility functions that I could compute in different configurations of the world would be different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2704.085,
    "end": 2717.034,
    "text": " So if the honey badger gets a key and it opens a door in the mountain pass, then it could potentially get through to the other side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2717.234,
    "end": 2724.459,
    "text": "But it's important to note that this is changing the structure of the low level state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2724.479,
    "end": 2733.145,
    "text": "So PE0 is what we'll call the original transition operator in which we can't go through the mountain pass.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2734.346,
    "end": 2745.559,
    "text": " And that means that if we compute state time feasibility functions on this operator, that means PE here is going into the Bellman equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2747.426,
    "end": 2752.513,
    "text": " then we're going to produce state time feasibility functions from those operator Bellman equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2752.753,
    "end": 2760.104,
    "text": "That's this object here, which means that we can use it to construct j to move us around high dimensional space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2761.065,
    "end": 2764.089,
    "text": "And so there's an empowerment for this j.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2765.56,
    "end": 2777.705,
    "text": " But then if we get the key and the key allows us to move through the door, it changes the structure of the world, then that's a different mode of dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2778.726,
    "end": 2790.071,
    "text": "So that means that all of this applies on the other side where we can compute feasibility functions off of a different mode of dynamics in which we can move through the mountain pass.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2790.971,
    "end": 2805.361,
    "text": " And so that means we can compute things, you know, by, we can compute valence by asking, you know, is this configuration of the world more conducive to the agent's core ontology?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2805.521,
    "end": 2813.807,
    "text": "That is, the agent's internal, external coupling that needs to be maintained as a sort of core object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2815.64,
    "end": 2826.929,
    "text": " And so we can compute valence just by changing J, the structure of the agent's abstractions that it moves to go to perform tasks in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2827.59,
    "end": 2832.073,
    "text": "So by computing empowerment on J, we're sort of computing it in task space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2832.134,
    "end": 2833.034,
    "text": "We don't have to consider",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2835.336,
    "end": 2837.299,
    "text": " all possible states of the product space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2837.339,
    "end": 2851.137,
    "text": "We can narrow it down to operators that move us around task space that induce dynamics on key other state spaces that we care about maintaining, such as our physiological state spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2853.63,
    "end": 2872.823,
    "text": " okay so here here's a simple example say uh the honey badger uh starts at the lake and has some initial um empowerment uh just on the low level operator so that's p uh phi zero uh there",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2874.4,
    "end": 2888.751,
    "text": " There's 12 states it can reach, but it also has a task empowerment, which is actually zero because there's only one task that it can engage in if you don't include getting the key as a task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2889.491,
    "end": 2896.256,
    "text": "So the circle here is saying that there's only one sort of task that can be done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2897.337,
    "end": 2899.659,
    "text": "And so if the agent goes and gets the key,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2902.165,
    "end": 2906.551,
    "text": " It's going to reduce its physiological states because it had to travel there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2906.571,
    "end": 2911.857,
    "text": "And then it gets the key and it conditions a different mode of dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2912.137,
    "end": 2918.184,
    "text": "So there's different feasibility functions associated with that mode, which I just described on the last slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2919.585,
    "end": 2926.371,
    "text": " then the door will open and it can travel back to the lake.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2926.431,
    "end": 2933.496,
    "text": "Now that it's at the lake, it can go eat food on the other side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2933.936,
    "end": 2944.644,
    "text": "Before getting the key, if it couldn't get the key, if there were no key, then it would just starve because while it could drink water and stay hydrated, it couldn't eat from the apple tree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2944.984,
    "end": 2948.087,
    "text": "But now it can cycle back and forth between the apple tree",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2949.047,
    "end": 2952.35,
    "text": " and the lake for as long as it wants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2953.051,
    "end": 2967.303,
    "text": "And so it has a higher empowerment just on the low-level state spaces, but also has a higher task empowerment because there are just over a horizon of three, and we're just computing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2968.484,
    "end": 2969.665,
    "text": "We have to choose a horizon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2970.385,
    "end": 2980.453,
    "text": " So the empowerment in task space is eight because there's eight possible branches in resulting states from where it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2981.534,
    "end": 2985.277,
    "text": "And so that's very useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2985.297,
    "end": 2997.427,
    "text": "So we can compute the valence, which is 0.5 just in the low level space, but also three in the task space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2998.648,
    "end": 3004.77,
    "text": " And another interesting question, which is very important, is to say, well, what's the value of the key?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3005.49,
    "end": 3006.83,
    "text": "And you can compute this too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3006.91,
    "end": 3019.414,
    "text": "You can say, well, given if I just fix the state vector that I'm at and I just alter the state phi that encodes the object of a key,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3020.174,
    "end": 3033.666,
    "text": " if I just alter that state and switch it between having a key and not having a key, you can say, well, this key has this much value to the internal organization, the internal integrity or controllability of the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3033.766,
    "end": 3035.667,
    "text": "So it's a sort of agent-centric",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3037.029,
    "end": 3050.784,
    "text": " uh uh judgment of how much something in the world is valuable and so the key can be not valuable if it doesn't do anything in the world that helps the agent control its core ontology",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3052.409,
    "end": 3058.132,
    "text": " So this is a way in which you can sort of bootstrap a value into the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3058.272,
    "end": 3059.452,
    "text": "You can use it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3059.892,
    "end": 3064.935,
    "text": "You can use the change in an agent's internal structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3065.035,
    "end": 3069.577,
    "text": "It's coupling between the internal state spaces and the external world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3070.037,
    "end": 3073.738,
    "text": "You can use the changes in that structure to assign value to things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3074.079,
    "end": 3074.999,
    "text": "And that's very useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3077.279,
    "end": 3099.235,
    "text": " okay i think we're approaching an hour and so i'll just conclude by saying um intelligent systems operate in high dimensional product spaces often with non-stationary dynamics this this introduces a lot of problems um especially in artificial intelligence because people normally deal with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3100.074,
    "end": 3108.841,
    "text": " structured tasks and non-stationarity by training recurrent neural networks and things like this, which contribute a lot to sample complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3108.861,
    "end": 3124.473,
    "text": "And what I'm saying is that operator Bellman equations have this different form, which produces transition operators, which helps you factorize your representations for moving around the world and predicting the resulting high dimensional state factor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3126.895,
    "end": 3129.776,
    "text": " And these operators are composable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3129.816,
    "end": 3133.036,
    "text": "They compose with themselves, but they also compose with higher level structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3133.297,
    "end": 3136.897,
    "text": "So you can remap different transition structures to them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3137.137,
    "end": 3138.138,
    "text": "It's very modular.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3138.458,
    "end": 3152.261,
    "text": "And these are very nice properties that you need if you don't want to recompute things and you want to have sort of modular structure come in and remap to your representations that you've already computed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3153.76,
    "end": 3157.148,
    "text": " And then so forward sampling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3158.691,
    "end": 3159.533,
    "text": "Can you still hear me, Daniel?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3162.944,
    "end": 3189.097,
    "text": " okay just checking so forward sampling is a good way of solving problems in high dimensional state spaces without representing the product space we can't really solve we can't do dynamic programming in a huge product space that's not going to work we can't sample low level actions that's not going to work it's the tree is too big but we can uh we can work at the level of sequences of policies",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3190.946,
    "end": 3206.887,
    "text": " and we can evaluate empowerment gain to justify our goal states and so valence sort of unifies a lot of distinct drives like there's a different sort of subfield of rl called multi-objective",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3207.887,
    "end": 3218.438,
    "text": " reinforcement learning, which says, oh, well, we'll have a bunch of different reward functions and then we'll have value functions for each of these reward functions for like different tasks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3219.078,
    "end": 3223.002,
    "text": "And that'll make like a high dimensional value function vector space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3224.123,
    "end": 3246.518,
    "text": " um and usually in in like multi-objective rl you have to like pick a policy that that's in that you know that's does well um in that you know value function space but normally you have to uh you have to deal with the trade-offs by some waiting function so what i'm saying here is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3247.798,
    "end": 3268.267,
    "text": " This allows, because valence is just one number, and it summarizes an entire sort of control architecture, that you don't have to introduce things like weighting functions or weighting coefficients to say, oh, this objective is more important now, or this objective is more important now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3273.24,
    "end": 3277.526,
    "text": " So yeah, many latent drives is not necessarily multi-objective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3277.686,
    "end": 3281.672,
    "text": "It's multi-dimensional, it's multi-goal, but it doesn't have to be multi-objective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3286.484,
    "end": 3290.147,
    "text": " And so with empowerment, you don't have weighted combinations of empowerment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3291.328,
    "end": 3295.912,
    "text": "And valence depends on the structure of the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3296.052,
    "end": 3303.818,
    "text": "So it's not just some static property of the world or a static property of an agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3304.679,
    "end": 3308.102,
    "text": "It incorporates agent-world coupling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3309.878,
    "end": 3323.838,
    "text": " And I thought I'd just end with this quote from Terence Deacon, who wrote a great book called Incomplete Nature, which I love and I read it at the beginning of grad school and which inspired me a lot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3324.634,
    "end": 3331.98,
    "text": " And Terence Deacon wrote a lot about teleology from a sort of thermodynamic perspective, and it's really compelling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3333.181,
    "end": 3347.693,
    "text": "And I just liked what he had to say about teleodynamics, the idea that an organism or its behavior could be organized around realizing something which is sort of virtual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3348.053,
    "end": 3351.036,
    "text": "And he says, teleodynamics is the dynamical realization",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3351.616,
    "end": 3364.768,
    "text": " of final causality, in which a given dynamical organization exists because of the consequences of its own continuance, and therefore it can be described as being self-generating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3365.228,
    "end": 3373.395,
    "text": "Specifically, it is the emergence of a distinctive realm of orthograde dynamics that is organized around a self-realizing potential,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3374.296,
    "end": 3394.303,
    "text": " or to be somewhat enigmatic it is a consequence organized dynamic that is that is its own consequence and i think i think that's relevant to what i'm doing here because um i think empowerment sort of on a an internal sort of structured ontology allows an agent to say",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3395.203,
    "end": 3407.256,
    "text": " there's a huge space of possible futures, but I can evaluate a state of the world that's far off in the distant future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3407.276,
    "end": 3414.023,
    "text": "And I can organize all of my behavior around that because I can say, I can give an explanation,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3414.764,
    "end": 3419.447,
    "text": " for why it benefits my sort of core ontology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3419.988,
    "end": 3425.352,
    "text": "And so therefore it makes me capable of acting that way in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3425.432,
    "end": 3428.734,
    "text": "It's a consequence organized dynamic that is its own consequence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3429.935,
    "end": 3436.679,
    "text": " So with that, I just want to thank the Active Inference Institute, and I will take questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3437.24,
    "end": 3454.41,
    "text": "And I'm very interested in what active inference theorists think about the sort of potential for a sort of integrated view of empowerment, because I think you all have a lot of experience thinking about generative models and things of that nature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3454.45,
    "end": 3456.512,
    "text": "So I'd be very curious to know what you think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3456.972,
    "end": 3457.212,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3460.089,
    "end": 3476.193,
    "text": " excellent thanks a lot great presentation so this will be a fun discussion those who are watching live please feel free to add questions in the live chat and you can unshare your screen and we'll begin",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3478.689,
    "end": 3486.093,
    "text": " I guess I'll take an empowering deep breath and ask a general question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3486.433,
    "end": 3490.075,
    "text": "And then I have some scattered notes that I'll love to dive into.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3490.275,
    "end": 3493.736,
    "text": "So how did you come to this area of research?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3494.337,
    "end": 3500.64,
    "text": "What brought you to control theory modeling and to the empowerment perspective specifically?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3500.66,
    "end": 3504.121,
    "text": "Hold on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3504.221,
    "end": 3507.303,
    "text": "I'm just bringing up the YouTube stream so I can see comments right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3512.979,
    "end": 3513.64,
    "text": " General question?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3513.96,
    "end": 3514.74,
    "text": "Mute that one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3514.8,
    "end": 3515.181,
    "text": "There we go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3515.801,
    "end": 3517.022,
    "text": "Yeah, I'll mute that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3517.982,
    "end": 3518.403,
    "text": "Sounds good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3518.423,
    "end": 3518.663,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3520.143,
    "end": 3546.871,
    "text": " yeah so what brought me to empowerment i've always been interested in yeah how you know how how could animals uh interact in a world in a way that's so sample efficient and especially like you know knowing that you know animals can you know like like a baby horse can you know get up and move around and interact with the world in a sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3548.011,
    "end": 3556.334,
    "text": " fluid, flexible way, you know, what are the sort of core representational capacities that are needed to do that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3556.534,
    "end": 3560.756,
    "text": "And I didn't really see anything from the RL world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3560.856,
    "end": 3562.777,
    "text": "And this is before I knew about active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3564.377,
    "end": 3566.678,
    "text": "And so that's always been in the back of my mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3566.698,
    "end": 3566.758,
    "text": "And",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3568.619,
    "end": 3586.69,
    "text": " Another big influence was a guy named Nishith Srivastava who wrote an interesting paper about how you can basically have a sort of relativistic decision theory that allowed you to make judgments between different",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3587.47,
    "end": 3611.889,
    "text": " of items without recourse to sort of hedonic utility theory maximization and so he he sort of argued that if there was something like a latent acceptability function that you could you could sort of measure you you could sort of remember a history of item acceptability and you could remember the context that you made decisions and then you could actually just do Bayesian inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3612.649,
    "end": 3627.38,
    "text": " over those memories and you could explain a lot of interesting things like preference reversal phenomena and decision theory where you introduce irrelevant alternatives and it like changes the fundamental um choice you make and i thought that that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3628.527,
    "end": 3645.199,
    "text": " that sort of initiated a lot of thinking into how could you have um how could you bring those kinds of intuitions into sort of embodied planning like how how could it be that you have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3645.899,
    "end": 3668.679,
    "text": " an agent assign value to things without them being sort of attributed as sort of static um sort of static preferences or static utilities in the world so I think that was also a big inspiration awesome okay and then one short general question why the honey badger",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3670.922,
    "end": 3690.894,
    "text": " honey badger um yeah my advisor showed me a a youtube video of of a honey badger named stoffel and in my paper reward is not necessary it's the the opening um paragraph talks about stoffel and there's a link to this youtube video but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3691.414,
    "end": 3703.244,
    "text": " Stoffel is a honey badger in Australia and he's at some sort of animal care center and he's really good at escaping from things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3703.544,
    "end": 3715.094,
    "text": "So the caretaker at this animal sanctuary constantly has to build elaborate structures to keep Stoffel in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3715.194,
    "end": 3718.117,
    "text": "So he has this sort of pen called Badger Alcatraz",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3718.977,
    "end": 3725.699,
    "text": " And Stoffel would do interesting things like find objects to lean against the wall and climb over.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3725.719,
    "end": 3737.002,
    "text": "And if you took those away, Stoffel would pack mud into balls and stack them into a little pyramid against the wall to climb up and things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3737.562,
    "end": 3745.545,
    "text": "So yeah, it got me thinking, what is a sort of good general intrinsic motivation function that isn't",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3746.84,
    "end": 3761.628,
    "text": " doesn't just work on low-level states, but also in a sort of more conceptual hierarchical space, like there might be objects or mating opportunities or anything sort of outside Badger Alcatraz.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3761.708,
    "end": 3771.813,
    "text": "What is a sort of way in which you could have an agent sort of think in a sort of abstract way in order to justify its motivations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3774.969,
    "end": 3779.834,
    "text": " So I encourage the listeners to look up that video.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3779.874,
    "end": 3780.735,
    "text": "It's entertaining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3782.216,
    "end": 3795.829,
    "text": "It's like this general escape impulse extended into our open-air context where we also want to maintain the ability to move.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3795.929,
    "end": 3797.771,
    "text": "And for mobile creatures,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3799.457,
    "end": 3813.124,
    "text": " that's quite a good proxy for what we might want to care about like living right all right i'll go to a question in the chat from alex keifer",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3814.363,
    "end": 3815.163,
    "text": " Fantastic work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3815.603,
    "end": 3820.164,
    "text": "Maybe a naive question, and I'm sure it's clear in the formalism, which I have only begun to look at.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3820.824,
    "end": 3827.886,
    "text": "But the idea is that actual agent environment coupling figures in computing empowerment, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3829.146,
    "end": 3837.048,
    "text": "If so, is there a fully internal proxy that can be optimized given information available internally?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3840.748,
    "end": 3843.789,
    "text": "Is there... Let's see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3845.754,
    "end": 3857.493,
    "text": " Is there a fully internal proxy that can be computed, that can be optimized, given info available internally and not part of the coupling?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3858.575,
    "end": 3858.936,
    "text": "Does he mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3861.05,
    "end": 3869.939,
    "text": " I suppose you could compute empowerment just on the internal state space, but I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3870.36,
    "end": 3880.29,
    "text": "Actually, I kind of want to say no, just because you do need to use actions to move around and influence other state spaces and things like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3881.572,
    "end": 3882.633,
    "text": "I don't know how I would",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3884.707,
    "end": 3895.461,
    "text": " compute just a sort of intrinsic motivation function that isn't a part of some coupling to some broader system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3896.643,
    "end": 3902.03,
    "text": "What about the desire to think freely and to move in cognitive spaces broadly?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3903.806,
    "end": 3922.765,
    "text": " yeah i agree that's that okay so yeah i definitely agree if i mean if you have all of your sort of physiological you know needs met and they aren't sort of imposing themselves on you you're sort of freed up to do other things right um so yeah i think that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3923.806,
    "end": 3950.594,
    "text": " this could work generally into very abstract spaces maybe even mathematical spaces um and yeah I think that there can be dependent like higher level dependency structures in you know abstract thought or mathematical thoughts or things like this I mean you think about you know faulty proofs that that sort of like destroy an entire field or something like uh there there's a sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3951.054,
    "end": 3974.399,
    "text": " dependency structure in which you that you know if if you're working on mathematics that assume some proof is true and it turns out to be false then you know perhaps that's disempowering from a sort of abstract uh perspective i suppose so that would be yeah and when there again you are yeah",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3976.03,
    "end": 3986.518,
    "text": " Oh, I was just going to say, but again, all that mathematics is being done by some system that has to perform computation, which takes energy and stuff like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3986.718,
    "end": 3990.861,
    "text": "So it's always sort of constrained by that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3993.604,
    "end": 3996.666,
    "text": "Constrained by some kind of external internal coupling, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4001.187,
    "end": 4009.579,
    "text": " many ways to go let's let's swerve towards active inference and then see if we can come back to some other areas um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4011.84,
    "end": 4018.003,
    "text": " You mentioned the generative model of active inference, but you took a different approach.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4018.023,
    "end": 4019.764,
    "text": "There's different model ontology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4020.164,
    "end": 4030.89,
    "text": "So just broadly, how would you structurally contrast the coupling of the agent and the environment in active inference and in what you've proposed?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4031.47,
    "end": 4037.173,
    "text": "Because the representations that we see in active inference often feature the particular partitioning,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4037.873,
    "end": 4060.547,
    "text": " where a Markov blanket of a Bayesian graph is intermediating between internal and external states, and then there's a mapping function between those internal and external states such that they can engage in an adaptive coupling, again mediated through the blanket, which is interpreted as providing incoming sensory observations and outgoing actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4060.627,
    "end": 4062.068,
    "text": "So structurally,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4062.808,
    "end": 4069.427,
    "text": " is that compatible incompatible or some other secret third thing with what you proposed",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4071.863,
    "end": 4096.358,
    "text": " yeah so i would start off by saying that i think the thing that makes my work different is that it's the structure of the latent just sort of discrete state space it's that structure that's under consideration and i think and i think that in active inference usually in code",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4097.319,
    "end": 4114.997,
    "text": " you things like homeostatic drives right you encode them in a generative model right correct they're encoded as a preference over sensory observations so that the entity uh seeks out and selects ultimately policies that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4115.678,
    "end": 4128.267,
    "text": " reduce or bound their surprise about those observations like i expect and prefer myself to be at a homeostatic temperature i'm not surprised when i'm in that range and i'm going to undergo action so that i find myself in that range",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4129.915,
    "end": 4153.317,
    "text": " yeah yeah so i would say that that is a major difference um because the because the state space in my case has this sort of self-undermining quality where it's like bad you know starvation states it's not it's not really a surprise an expectation of receiving a particular signal or having a preference over",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4153.937,
    "end": 4178.075,
    "text": " some state of the world it has a sort of uh self-undermining quality that affects your ability to control every everything else so i i think that i would yeah i think i would contrast it that way that usually the preferences or the quality of the states are sort of encoded in a generative model in the active inference setting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4178.995,
    "end": 4186.427,
    "text": " And here I'm saying that there's a sort of structural coupling that's giving rise to these valence signals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4192.631,
    "end": 4214.3,
    "text": " you mentioned the key being obtained as inducing this change in the agent's ontology and one that was ultimately reflected by increase in empowerment hence increase in valence so how does it come to understand that this shiny object unlocks that door",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4216.024,
    "end": 4225.739,
    "text": " yeah i wish uh yeah i mean i think that uh throughout my career i will try to make steps towards like you know actually",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4227.646,
    "end": 4245.7,
    "text": " um actually figuring that out because a lot of this would comes down to dynamics learning you know if an agent doesn't know what a key does right it's not going to know that it opens a door and therefore that it can move through the door and things like this i think there are a lot of sort of maybe like dyna like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4246.78,
    "end": 4253.826,
    "text": " algorithms in which you sort of alternate between learning things about dynamics or things like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4253.906,
    "end": 4262.332,
    "text": "But that is a sort of outstanding question for me is like, yeah, how would you take a key and learn exactly how it's changing the dynamics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4264.574,
    "end": 4276.471,
    "text": " but yeah what i am saying is that given given that you can do that if if you can do that then you can really sort of make these value judgments to things in the world",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4277.935,
    "end": 4281.237,
    "text": " So I think that's really important, too, because consider money.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4281.837,
    "end": 4285.338,
    "text": "If I find a $20 bill on the ground, I'm just going to pick it up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4285.559,
    "end": 4293.762,
    "text": "I don't think I'm doing a fancy computation of, oh, no, my bank account is $20 greater.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4293.782,
    "end": 4297.364,
    "text": "And so therefore, I have all this new capacity or things like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4297.804,
    "end": 4305.848,
    "text": "I think these sort of preferences for various objects, like a key or a dollar bill or things like this,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4306.588,
    "end": 4313.991,
    "text": " can sort of be stored and maybe modeled with utility theory, who knows?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4317.012,
    "end": 4320.193,
    "text": "Okay, jumping around to some different questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4321.513,
    "end": 4332.877,
    "text": "I hope I'm accurate in saying you described empowerment as a Shannon information theoretic channel capacity between the actuators and the realization of the state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4334.446,
    "end": 4344.57,
    "text": " We might be familiar with hearing Shannon channel capacity in the context of bandwidth of information transfer or upload and download, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4345.11,
    "end": 4348.712,
    "text": "But this is kind of an action-oriented Shannon channel capacity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4348.772,
    "end": 4356.035,
    "text": "So what does it mean to get an intuition on that capacity between the actuators in the state?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4358.228,
    "end": 4369.333,
    "text": " Yeah, so the channel capacity is the maximum possible mutual information between the actions you choose and the resulting states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4369.353,
    "end": 4382.659,
    "text": "So the channel capacity is sort of the maximum information that you can transmit from your actuators to possible states of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4383.459,
    "end": 4387.041,
    "text": "It's a form of optionality that says, you know, I can affect",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4387.961,
    "end": 4409.558,
    "text": " this many sort of possible futures so yeah it's a sort of intrinsic property of an agent and so in a product space this is going to be affected by a lot of different state spaces if they're interacting like physiological state spaces can you know kill you if they get too low so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4412.3,
    "end": 4440.566,
    "text": " I think the interesting thing about this is that it sort of encourages you to think about cognition in this sort of interrogative way because you're essentially trying to figure out what you can do, but there are a lot of different state spaces that are hindering that information transfer from your actuators to your state spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4441.306,
    "end": 4449.392,
    "text": " So I think it's very useful because it can sort of, it also sort of leads to like explainable AI, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4449.472,
    "end": 4458.238,
    "text": "You can sort of explain your intentions in terms of concrete state spaces, which have structure and explanation, things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4458.679,
    "end": 4467.605,
    "text": "I think I got off topic from your question, but anything else on Shannon channel capacity that I should talk about?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4469.557,
    "end": 4479.579,
    "text": " I think before we loop it back to potentially expected free energy, you mentioned the AI topic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4480.159,
    "end": 4498.122,
    "text": "And is there any risk of an imperative that features its own empowerment in terms of an AI being able to then select action policies that might not be what anyone else expects or prefers?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4499.437,
    "end": 4507.871,
    "text": " may not even be concordant with their own encoded explainable AI priors, but rather something that takes an unbounding approach.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4510.58,
    "end": 4513.542,
    "text": " Yeah, I do think that that is a fear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4513.702,
    "end": 4522.426,
    "text": "I haven't thought that much about the alignment question, so I'd be very interested in what alignment researchers think of this perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4523.927,
    "end": 4535.593,
    "text": "I think that there's a lot of interesting work to do on multi-agent empowerment, especially with these abstract transition operators that work on long time scales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4535.613,
    "end": 4538.195,
    "text": "And you can see",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4540.556,
    "end": 4559.637,
    "text": " that how sort of socialization matters and things like this um you know if you're you know in a world of multiple agents um do you have to you know do you have to learn to respect all of the agents you know empowerment I mean they can also act against you right um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4560.598,
    "end": 4583.473,
    "text": " so yeah i don't know i do think it's a fear to take seriously um i don't know how i would do it though because it's it's an outright outstanding research question to me coming from an ant colony background you mentioned the socialization and i immediately thought well let's just say that the seeds take two or three nest mates to carry home",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4584.767,
    "end": 4613.173,
    "text": " so in order to have one nestmate achieve the maximum empowerment they must also engage in a pro-social environment because if anyone else even if their model is like smaller and less empowered if they just decide not to play then that individual until it figures out how to carry the seed home alone is going to actually be kind of um tethered to a social fabric",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4614.229,
    "end": 4617.891,
    "text": " that helps it actually obtain those goals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4618.372,
    "end": 4624.856,
    "text": "So it puts the social imperative as a screen in front of potentially any other imperative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4626.597,
    "end": 4627.097,
    "text": "Just a thought.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4628.338,
    "end": 4629.659,
    "text": "Yeah, that's a great thought.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4631.73,
    "end": 4649.124,
    "text": " you mentioned the decomposition of some function i'll let you unpack what exactly what function was being decomposed and you you um you justified that by saying we never want to work in the product space yeah",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4650.475,
    "end": 4661.624,
    "text": " from a computational complexity perspective or however makes sense, what are the dangers or what are the scaling features of that product space?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4662.285,
    "end": 4667.529,
    "text": "And then what is the decomposition that facilitates a more tractable form?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4669.03,
    "end": 4671.692,
    "text": "Yeah, I'll share my screen again and we can go back to that slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4672.713,
    "end": 4673.053,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4679.338,
    "end": 4679.979,
    "text": "Let's see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4704.52,
    "end": 4706.861,
    "text": " Here it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4711.443,
    "end": 4712.084,
    "text": "You can see my screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4712.524,
    "end": 4712.704,
    "text": "Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4712.844,
    "end": 4723.029,
    "text": "And maybe even a brief summary of what is a Bellman equation and how did you move from the standard formalization of Bellman equations into this operator space?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4725.39,
    "end": 4725.63,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4725.89,
    "end": 4727.851,
    "text": "Yeah, the standard Bellman equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4732.15,
    "end": 4735.391,
    "text": " I don't know the button for one slide forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4736.011,
    "end": 4741.192,
    "text": "Okay, so the standard Bellman equation just has this recursive form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4742.492,
    "end": 4745.393,
    "text": "And it's just the value of a state that you're at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4746.333,
    "end": 4761.397,
    "text": "The optimal value of that state is the maximum value that you can get by choosing an action that rewards you and takes you to a state from which you can act in the future to get more reward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4762.097,
    "end": 4783.742,
    "text": " So the Bellman equation can be solved by dynamic programming in order to maximize this function v. So it'll result in a policy that moves you around the world in a way that accumulates a reward that you'll find in your environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4785.186,
    "end": 4808.052,
    "text": " um so it has this recursive form uh you can you can sort of unroll it into a sequence um and then the operator bellman equation has this similar recursive form where now you'll notice that there isn't a reward function there's this availability function and it returns a number between zero and one it returns a probability",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4809.212,
    "end": 4815.375,
    "text": " And so that's significant because it makes it means that you can maximize the cumulative feasibility.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4816.736,
    "end": 4820.097,
    "text": "And so F here is just saying this goal is available.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4820.978,
    "end": 4824.179,
    "text": "Either you achieve the goal now or you take an action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4824.52,
    "end": 4829.102,
    "text": "You don't achieve it now, but you take an action in which you'll achieve it in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4830.695,
    "end": 4855.855,
    "text": " so that um it has the same form where you can sort of think of an availability function as a reward but it's maintaining a probabilistic form and that probabilistic form is important because it's what allows you to compute the state time feasibility as a transition operator as an operator that maps you from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4856.756,
    "end": 4875.405,
    "text": " where you are now the state time you're at now which is xt to the final state time and goal that you achieve um so under the policy so it says if i start at xt and i follow this policy and i'm choosing actions that move me through this state space",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4876.425,
    "end": 4886.169,
    "text": " Then I'm eventually going to get to the goal, and I want to know the final state in time, the probability that I achieve this at any given state in time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4886.97,
    "end": 4896.754,
    "text": "And so the state time feasibility function is here, as it's expressed, is a transition operator with one action, which is the policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4897.294,
    "end": 4900.536,
    "text": "But when we aggregate it, I'll bring this up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4901.036,
    "end": 4919.387,
    "text": " when we aggregate it into multiple possible feasibility functions that are centered around multiple sort of objects in the world then all of the policies associated which with each one of those these are goal condition policies that that are going to terminate on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4920.527,
    "end": 4944.254,
    "text": " achieving the goal of going to one of these features and and you know getting the apple for instance then those pop each of those policies is an action for this transition operator so there's five five possible policies that are going to take you around the uh around the space so these operator bellman equations have this probabilistic form which retain this probabilistic structure",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4945.215,
    "end": 4952.835,
    "text": " And you can sort of compare this with, I don't know if you're familiar, but there's this concept in RL called the successor representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4954.468,
    "end": 4959.111,
    "text": " which is like often a hot topic in computational neuroscience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4959.771,
    "end": 4971.757,
    "text": "And the successor representation is sort of talked about like it's this predictive operator, but really what it represents is expected state occupancies under a policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4971.777,
    "end": 4976.019,
    "text": "And those expected state occupancies are weighted by the discount factor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4976.579,
    "end": 4982.022,
    "text": "So it's really a successor representation is really a sort of weighted statistic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4982.964,
    "end": 4992.146,
    "text": " And it doesn't map from an initial state to the state of inducing an event, of achieving a goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4992.966,
    "end": 5003.508,
    "text": "So where successor representations aren't compositional, you can't multiply two successor representations and get another successor representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5004.068,
    "end": 5009.569,
    "text": "Well, you can multiply matrices that represent state time feasibility functions because they're mapping",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5010.649,
    "end": 5013.81,
    "text": " their probabilities of events.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5014.19,
    "end": 5025.955,
    "text": "So you can combine them just by multiplying matrices that represent the state time feasibility function for a given policy with another one for a different policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5026.635,
    "end": 5033.217,
    "text": "So that will retain the form of a probabilistic function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5033.637,
    "end": 5037.499,
    "text": "And that's what makes them reusable, composable, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5038.659,
    "end": 5041.841,
    "text": " And I think you asked me about the decomposition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5043.202,
    "end": 5048.246,
    "text": "And this decomposition, yeah, I might have glossed over this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5048.306,
    "end": 5061.575,
    "text": "But the decomposition result is that if you were to compute a state time feasibility function in a product space, which has lots of state vectors, which are each states,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5065.895,
    "end": 5091.525,
    "text": " um then you know you don't want to do that because product spaces are very large and take a lot of you know in memory to represent the operator uh so if if this was not px and this was ps and ps was the full product space operator that moves you around this high dimensional space well you can't really represent that and you don't really want to but if you did",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5092.365,
    "end": 5117.952,
    "text": " and you computed a state time feasibility function in a product space then you can under certain conditions and i can say what those conditions are but under certain conditions you can decompose this into a prediction of all of the higher level state spaces computed independently so you evolve the hunger space separately and you evolve the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5118.792,
    "end": 5142.73,
    "text": " their space separately and you evolve the temperature space separately you can do all of those computations locally on those spaces and you can combine them with a state time feasibility function that's only computed on the low level space so um so this hierarchical st of the state time feasibility function",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5143.71,
    "end": 5149.152,
    "text": " is an intractable object for most reasonably sized problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5149.893,
    "end": 5156.776,
    "text": "But you can implicitly form it by this product of these things individually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5157.296,
    "end": 5159.477,
    "text": "And so this works when your goal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5163.44,
    "end": 5172.096,
    "text": " For the hierarchical state-time feasibility function, when you just have a single goal at arriving at a particular feature of the world, like a tree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5175.245,
    "end": 5180.968,
    "text": " that's one of the conditions in which this decomposition holds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5181.788,
    "end": 5186.15,
    "text": "So I think that answered your question about the burden of a product space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5187.971,
    "end": 5194.855,
    "text": "You need to overcome it by doing local computations on individual state spaces in a sort of network",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5195.875,
    "end": 5214.086,
    "text": " of interconnected state spaces that implicitly form a product space but you you want to compute all of the representations separately in this network of state spaces so that you can sort of move around this high dimensional state space under successive policies",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5216.238,
    "end": 5223.34,
    "text": " And so that's what allows you to handle forward sampling in this high-dimensional state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5224.2,
    "end": 5236.944,
    "text": "And that's important because I think, and just to recall the sort of presentation, I think it was Avel, A-V-E-L?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5237.404,
    "end": 5239.644,
    "text": "Yes, Avel Guenincarlou.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5240.765,
    "end": 5244.346,
    "text": "Yeah, just to echo that sort of sentiment that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5246.107,
    "end": 5266.088,
    "text": " if you're composing if you're creating new state spaces or you're composing you're not computing policies in a fixed world um you're composing things together um that's of course going to expand the product space implicitly of all the state vectors of the system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5267.149,
    "end": 5287.478,
    "text": " and the act of composing thing or bringing new information in is expanding the implicit product space that you are in and so from an rl standpoint um it's not so clear you know what a reward function on that product space is even supposed to be i don't think that anyone will",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5289.159,
    "end": 5318.409,
    "text": " i answer that question but it's also not clear what you know what a generative model should look like on that product space either and i think given that you know organisms or humans at least are so skilled at this at this sort of dialectical process of proposing theories and comp you know composing structure um as hypotheses and in um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5318.989,
    "end": 5334.954,
    "text": " in interrogating what that means i think that there i think that value comes from interrogating you know what it means for the structure of the world to be a certain way so if i if i learn new dynamics of the world and i want to control",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5335.99,
    "end": 5339.473,
    "text": " dynamics on some new space, it might affect other state spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5340.073,
    "end": 5343.896,
    "text": "But from a normative perspective, it's not really clear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5344.536,
    "end": 5354.984,
    "text": "Once you compose something and you're expanding the implicit product space, it's not so clear where any sort of normative source of normativity should come from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5355.605,
    "end": 5364.871,
    "text": "But I think the sort of flexible human reasoning that we know humans to engage in, I think, is in this sort of regime of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5365.712,
    "end": 5387.705,
    "text": " composition and interrogation where you're always sort of saying oh if the world were this way then i'm sort of i i then i could see how this state space affects these other state spaces in a way that i didn't anticipate and so i think normativity in a creative way has to come from controllability that that would be my argument",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5391.26,
    "end": 5393.162,
    "text": " There's a lot there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5393.702,
    "end": 5395.764,
    "text": "So a few directions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5396.825,
    "end": 5400.368,
    "text": "First, to our colleagues in reinforcement learning, RL.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5401.669,
    "end": 5407.154,
    "text": "The paper is provocative in that it includes reward is not necessary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5407.835,
    "end": 5415.682,
    "text": "So is reward sufficient and or what is necessary for what?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5418.829,
    "end": 5446.693,
    "text": " yeah it's a good question is is reward sufficient i think i would argue this you know i think that the reward enough hypothesis which just to remind some of the viewers is the hypothesis that reward maximization can account for all sort of artificial and sort of natural intelligence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5447.193,
    "end": 5472.072,
    "text": " that all of the sort of features of intelligence the sort of capabilities the structure learning and stuff can all sort of arise out of some need to there's some some process of maximizing reward and from my standpoint this that's a frustrating statement because it's one it doesn't um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5474.484,
    "end": 5481.227,
    "text": " One, it doesn't really address where your preferences for specific reward functions come from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5481.807,
    "end": 5488.87,
    "text": "And in the paper, they will say, well, we acknowledge that there could be multiple sources of reward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5490.507,
    "end": 5514.664,
    "text": " and but you know the process of deciding on what you know reward you should attend to or care about that's i think is is a deciding what signals you should care about is an important part of intelligence itself and i think that reward is enough hypothesis as a hypothesis is sort of under constrained in that whatever that mechanism is to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5516.105,
    "end": 5543.472,
    "text": " to that perspective it's going to be maximized reward you know under their Paradigm and so therefore whatever whatever shapes what that mechanism is that that you know an agent should attend to this or an agent should stop attending to the things that they always cared about in and attend to some new signal I think that that call you know I think that that forces you to sort",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5545.011,
    "end": 5560.957,
    "text": " take the position that maybe there's a meta reward that directs this process because all sort of attendant processes of intelligent systems sort of underlie the process of reward maximization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5561.357,
    "end": 5571.5,
    "text": "And also, the reward is enough hypothesis is not being specific about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5573.362,
    "end": 5576.926,
    "text": " it doesn't tell you what necessarily to compute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5577.026,
    "end": 5586.199,
    "text": "It just says that if you try to maximize reward, you will compute the right representations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5587.16,
    "end": 5590.204,
    "text": "And so I think that there's just a lot of nuts and bolts about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5590.985,
    "end": 5606.278,
    "text": " what it takes to be able to reason in a flexible human way and what i'm proposing here with the operator bellman equations is to say hey look there's these reward-free bellman equations that help you deal with the complexity of the world there's no reward in them",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5607.178,
    "end": 5613.382,
    "text": " And you could make the case, well, maybe you could just use these operator Bellman equations to occupy states that are rewarding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5614.243,
    "end": 5621.268,
    "text": "But I would argue that since the product space, the effective product space that we all live in is so vast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5622.208,
    "end": 5634.104,
    "text": " and we reason about it in such a flexible way, I very much doubt that RL will rise to the challenge of being able to justify motivations in real time in a way that humans can.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5634.845,
    "end": 5638.651,
    "text": "And so to get to the question of is it sufficient?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5640.265,
    "end": 5659.877,
    "text": " my hunch is no i can't like i don't have a proof of like you know reward is not sufficient but i also think that the information that a reward function is supposed to carry about what is good i don't think that that is that is knowable or computable",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5660.817,
    "end": 5672.844,
    "text": " on the time scales that we understand human intelligence to to work at to work on and so yeah in order to answer your question about what is necessary i don't know",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5675.006,
    "end": 5697.246,
    "text": " what is necessary but i would just sort of make the point i already made of that i think that we have to get to a point in which we sort of acknowledge the problems of product spaces and sort of reasoning dialectically in a product space that we can't explicitly represent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5698.247,
    "end": 5726.389,
    "text": " uh and so i don't know i don't know what is necessary but i can say that it's not necessary for simple self-preserving agents and that's the claim of the paper awesome all right in our closing segments i'd like to take a journey to philosophy and then connect this back to potentially relationships",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5727.847,
    "end": 5749.501,
    "text": " between the models that you've presented here and active inference and maybe even walk to the edge of that cliff of the hybrid model so aristotle proposed four causes material cause what something is made of the efficient cause which is the source of change",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5750.362,
    "end": 5772.064,
    "text": " the formal cause is the essence and the final cause is the teleology the end goal of the object and your presentations telios was deacon's analysis of these different forms of teleology and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5773.16,
    "end": 5800.076,
    "text": " indeed within the model proposed empowerment was that type of self-referential teleology when juxtaposing with active inference and specifically the expected free energy functional which has a lot of analogies with an operator it's a function of other functions the expected free energy functional is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5801.535,
    "end": 5821.668,
    "text": " predicated around helping the agent select policies that over expected futures reduce their uncertainty the most about which sensations they receive and that's what ties active inference closely with perceptual control theory that that expected free energy",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5822.649,
    "end": 5849.197,
    "text": " is ultimately looking at a divergence between preferences over observations and incoming observations so that's kind of the sense side of the coin it's like i want to stay in the game to be able to align observations with my preferences and i'm wondering if empowerment is the action side of the game",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5850.37,
    "end": 5859.653,
    "text": " It is saying you'll be involved with, yes, repeatedly sensing yourself to not be starving, not be dying of thirst, not be dying of cold.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5859.733,
    "end": 5867.716,
    "text": "You'll be in your preference vector by way of this single value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5868.942,
    "end": 5897.846,
    "text": " which is the empowerment whereas active inference kind of comes from the other side saying you're going to end up having a lot of squares to move around in but first you need to make sure that you're reducing divergence between your preferences and your expected observations what do you think about that map or where would that take these intertwined models",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5899.662,
    "end": 5920.116,
    "text": " Well, I think that there could be an interface between the two concepts if we consider that models of how things work, like composed models of how things work, could induce particular generative models that you would want to use in a sort of active inference setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5920.816,
    "end": 5923.979,
    "text": "And that would be the sort of dual nature between",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5924.699,
    "end": 5934.549,
    "text": " the two, that there's a crosstalk between the proposal of some kind of generative model that would be conducive to the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5935.95,
    "end": 5940.255,
    "text": "And if it is, then it could be a good state encoding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5940.515,
    "end": 5958.792,
    "text": " which feeds back in on you know controllability or empowerment and things like this so I mean there's a lot to think about on this topic um but I guess I would just put put it that way that um that we still need to justify where",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5963.197,
    "end": 5982.775,
    "text": " generative models come from uh in new situations for new theories of how things work and things like that and there could be a dual process in which the action side the internal controllability side is dictating what kinds of generative models that we that should be considered",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5987.472,
    "end": 6015.218,
    "text": " very interesting and the reason i brought up aristotle's causes was because active inference as a process theory seems to be describing that efficient cause it's just especially with the variational free energy which is kind of the real-time version of the expected free energy it's like one step at a time",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6017.142,
    "end": 6039.932,
    "text": " ball going downhill and so variational inference is enabling incremental unfolding optimization again oriented around reducing that sensory preference and outcome it does everything but specify a final cause in a sense",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6041.255,
    "end": 6050.057,
    "text": " One might say that there's a local final cause within the active inference generative model, which is like to reduce the divergence between the preferences and the observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6051.337,
    "end": 6066.02,
    "text": "But the generative model also, from the action selection side, which is what makes active inference active inference, it also needs a final cause.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6068.547,
    "end": 6094.53,
    "text": " in that self-referential teleodynamic way and so there could be some very interesting architectures where active inference picks up where empowerment leads like through a needle because it's such a small representation with valence",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6095.626,
    "end": 6113.056,
    "text": " And then one other kind of connection or maybe mapping between them is we've seen models of valence in active inference, such as the affective inference work, where valence was associated",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6114.036,
    "end": 6141.438,
    "text": " broadly with whether things are going better or worse than expected in terms of statistical uncertainty if you're reducing your uncertainty more than you expected things are going better than expected and vice versa um so that is a very variance oriented valence concept",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6143.76,
    "end": 6170.662,
    "text": " where broader uncertainties are associated with inferior valence and tighter uncertainties are associated with positive valence and it's just interesting that that's kind of like an orthogonal valence concept from how much you can actually do that's the actionable valence would you rather have a high precision around not being able to do anything",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6171.713,
    "end": 6178.718,
    "text": " or high uncertainty about being able to do a lot or a huge amount.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6180.08,
    "end": 6197.733,
    "text": "And so it almost seems like when we contrast those two, the direction that dominates is in the final analysis, the ability to have empowerment, not necessarily to just have tight control over your observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6200.295,
    "end": 6200.435,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6202.677,
    "end": 6227.337,
    "text": " agree lots lots of interesting avenues for hybrid theories well what a very interesting talk i guess one more question on the model and then we'll close which is the time horizon is it an infinite time horizon or",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6228.979,
    "end": 6236.194,
    "text": " What is the treatment of time and can time be continuous or is time always discrete and is it finite or infinite horizon?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6239.069,
    "end": 6243.013,
    "text": " So the operator Bellman equations are formalized as a finite horizon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6243.033,
    "end": 6251.042,
    "text": "I suppose they could be extended to infinite horizon and infinite or continuous time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6251.062,
    "end": 6252.804,
    "text": "I suppose that's possible too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6253.685,
    "end": 6259.711,
    "text": "But as they're formalized now, it's discrete state, discrete time, finite horizon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6262.613,
    "end": 6268.035,
    "text": " But yeah, I mean, I think that there's alternative forms that could be made.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6272.437,
    "end": 6274.017,
    "text": "Was there another question too in it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6274.037,
    "end": 6275.278,
    "text": "I can't remember.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6278.806,
    "end": 6281.368,
    "text": " Let us close with your time horizon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6282.209,
    "end": 6292.379,
    "text": "What are your next steps with the research and how would you imagine an ecosystem of continuation of the work?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6294.289,
    "end": 6311.28,
    "text": " Yeah, I'm interested in getting this work into computational neuroscience because there's a lot of, I think, alternative models that need to be considered, especially given some of the themes that I've touched on in terms of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6312.461,
    "end": 6329.112,
    "text": " justifying what to do in a product space how do you represent control in a distributed system etc um and so i think that there's a lot a lot to do there in computational neuroscience on the ai side i want to put this in a world model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6330.962,
    "end": 6344.17,
    "text": " I want to get good autoencoders, kind of like how I had on the first slide, where you have a high-dimensional agent in a high-dimensional multimodal world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6344.67,
    "end": 6349.373,
    "text": "How do you have nice world models and put this in something like that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6349.433,
    "end": 6352.334,
    "text": "So that's the AI future direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6352.354,
    "end": 6353.835,
    "text": "And I'd like to do both of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6353.995,
    "end": 6356.797,
    "text": "So I have a lot of work to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6358.729,
    "end": 6359.07,
    "text": " Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6359.23,
    "end": 6368.407,
    "text": "Well, in closing, I'm just going to read some of the more statement-like comments from the live chat just so that they're included in the Active Inference Journal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6368.968,
    "end": 6370.03,
    "text": "So Dave Douglas wrote,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6371.567,
    "end": 6386.158,
    "text": " With regards to Deacon's consequence, Galileo may have gotten in trouble less from insisting on a heliocentric universe than from insisting that purpose, value, and meaning be banished from science as connecting explanatory principles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6387.139,
    "end": 6397.967,
    "text": "The Galileo-tolerated remaining connecting principle, causation, may have reached the limits of its explanatory power sometime between Newton's and Fourier's day.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6398.988,
    "end": 6407.234,
    "text": " where all respectable principles of explanation must ultimately rest on invocation of either rigid rods or on elastic bands.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6408.195,
    "end": 6421.766,
    "text": "The Galilean program of sola causa attained its absurdity in Carnap's insistence that meaning-value counterfactuals must be judged as strictly and literally as meaningless.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6422.95,
    "end": 6435.923,
    "text": " Have we passed the point when the Galilean program must be simply abandoned and meaning, value, and purpose must be restored to science as irreducible explanatory principles alongside causation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6437.168,
    "end": 6448.235,
    "text": " I find the mysticisms of both Bohm and Heisenberg's quantum completeness and of Pauli and Jung's synchronicity to just be too fluffy to be very useful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6448.956,
    "end": 6458.042,
    "text": "In a word, it has become a tradition of science as funded to insist that causation and causation alone must found our enterprise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6458.762,
    "end": 6466.768,
    "text": "This is a tradition of men, not a feature of ultimate reality, meaning and value also have their place not reducible to cause.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6471.627,
    "end": 6482.015,
    "text": " i like it yeah excellent well thomas thank you again for joining you're always welcome back and really looking forward to seeing how this all continues",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6483.72,
    "end": 6484.04,
    "text": " Me too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6484.08,
    "end": 6485.361,
    "text": "And thanks again for having me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6485.381,
    "end": 6488.444,
    "text": "I've been very impressed with how much work you do for the Discord.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6488.524,
    "end": 6491.166,
    "text": "And it's a great community.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6491.926,
    "end": 6494.488,
    "text": "Everyone's very, very nice and enthusiastic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6494.588,
    "end": 6496.289,
    "text": "So I was excited to see it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6496.309,
    "end": 6498.491,
    "text": "I just sort of randomly stumbled across it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6498.571,
    "end": 6503.015,
    "text": "So I'm glad I introduced myself to the Discord.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6503.095,
    "end": 6503.615,
    "text": "So thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6504.776,
    "end": 6505.136,
    "text": "Excellent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6505.356,
    "end": 6505.616,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6505.877,
    "end": 6506.457,
    "text": "Till next time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6506.757,
    "end": 6507.078,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6508.318,
    "end": 6508.539,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6508.599,
    "end": 6508.879,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  }
]