[
  {
    "start": 7.557,
    "end": 19.761,
    "text": " hello and welcome this is active inference live stream 58.0 october 29th 2024 we're discussing the paper from pixels to planning scale 3 active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 20.905,
    "end": 22.827,
    "text": " So welcome to the Active Inference Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 23.548,
    "end": 29.355,
    "text": "We're a participatory online institute that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 29.756,
    "end": 31.298,
    "text": "You can find us at the links on the slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.079,
    "end": 34.201,
    "text": "This is a recorded and archived live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 34.762,
    "end": 36.985,
    "text": "Please provide feedback so we can improve our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 37.706,
    "end": 42.171,
    "text": "All backgrounds and perspectives are welcome and will follow video etiquette for live streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 43.383,
    "end": 51.015,
    "text": " Head over to ActiveInference.Institute to learn more about the Institute, get involved with projects like live streams and a lot of other things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 51.897,
    "end": 55.382,
    "text": "Okay, before we jump into the paper, let's say hello.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 56.163,
    "end": 56.664,
    "text": "I'm Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 56.884,
    "end": 61.652,
    "text": "I'm a researcher in California and really looking forward to this discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 61.692,
    "end": 68.563,
    "text": "Arun, want to say hi, give any context, and thanks again for contributing to the .Zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 70.501,
    "end": 71.082,
    "text": " Hi, everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 71.442,
    "end": 71.983,
    "text": "My name is Aaron.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 72.604,
    "end": 74.086,
    "text": "I'm a software engineer in the UK.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 75.148,
    "end": 80.376,
    "text": "I did my PhD a good few years ago, in which I touched on dynamicals with modeling and active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 81.077,
    "end": 82.86,
    "text": "I've been thinking about it for a long time since then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 82.88,
    "end": 88.228,
    "text": "I came across this paper and thought it was really hard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 89.049,
    "end": 91.693,
    "text": "And so I requested, guys, can we do a live stream on this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 91.974,
    "end": 93.837,
    "text": "I'd really love to understand this paper properly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 93.857,
    "end": 97.142,
    "text": "And now I've somehow ended up contributing to the live stream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 98.223,
    "end": 98.584,
    "text": "So yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 101.062,
    "end": 120.825,
    "text": " okay so we're discussing this paper from july 2024 from pixels to planning scale free active inference by carl friston and colleagues the rest of this video is going to be some background and context and an introduction and an overview",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 120.805,
    "end": 138.46,
    "text": " of the ideas it's not a review it's not comprehensive it will be part of an exciting series where in the coming weeks in the dot one and dot two we discuss with the authors and the dot two is going to fall during the applied active symposium so that'll also be really fun",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 138.44,
    "end": 140.666,
    "text": " Okay, let's go to the big questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 141.228,
    "end": 153.04,
    "text": "What are your big questions around whether it's about the paper specifically or what are the big motivators that made you excited and want to pursue these affordances?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 154.943,
    "end": 157.928,
    "text": " So I think the big one is the title, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 158.348,
    "end": 168.624,
    "text": "And I think the question of scale is one that's plagued a lot of Active Inference implementations and previous papers in the past few years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 169.425,
    "end": 172.61,
    "text": "Everyone's like, oh, yeah, I'd love an Active Inference agent that can do stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 172.63,
    "end": 177.137,
    "text": "But if I have more than a few states, I get a combinatorial explosion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 177.117,
    "end": 184.155,
    "text": " and things either fall over or they take a very long time compared to alternative methods that are out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 185.197,
    "end": 190.992,
    "text": "So the question of scale is a really important one and I think this paper nominally looks like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 191.208,
    "end": 192.089,
    "text": " There's a way around that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 192.93,
    "end": 197.536,
    "text": "Also, the renormalization group as a way to do that is, I think, a very interesting one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 198.738,
    "end": 204.084,
    "text": "It draws from a lot of physics that I actually studied a very, very long time ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 204.905,
    "end": 212.575,
    "text": "So that really spoke to me and I thought it was really, really nice to see some things that apply to also like Ising model of ferromagnetism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 212.555,
    "end": 222.51,
    "text": " some other key parts of thermodynamics that now come into AI, which active inference has been doing for a while with the free energy minimization part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 223.231,
    "end": 229.0,
    "text": "But I think the renormalization group is a really interesting part of maths that seems to get you a lot further.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 231.283,
    "end": 241.178,
    "text": "I also had some much more technical questions, which maybe don't fall under the big questions, which you'll definitely come on to later when I was reading this paper and looking at it and I go, I don't understand actually what's happening here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 241.512,
    "end": 262.206,
    "text": " So I'd really love to dive into those and particularly catch up with the authors in the later episodes to get some of the more technical answers on how these matrices and tensors play together, which seems to defer a little bit to the textbook by Parr and some of the other formulations by the RxInfer group as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 263.208,
    "end": 268.296,
    "text": "So actually getting into the nitty gritty of how we implement this will be really fun for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 269.474,
    "end": 269.815,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 270.718,
    "end": 275.997,
    "text": "Blue also contributed to the .zero, and so she wrote, what is a path?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 276.118,
    "end": 279.771,
    "text": "More specifically, how are paths related to the renormalization group?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 279.869,
    "end": 285.899,
    "text": " How is the renormalizing generative model, RGM, different from the active inference generative model that we usually study?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 286.58,
    "end": 289.845,
    "text": "And how do paths tie into transitions between categories?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 290.566,
    "end": 292.249,
    "text": "And I had similar questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 292.97,
    "end": 294.353,
    "text": "What is the renormalization group?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 294.673,
    "end": 295.915,
    "text": "How is it being used here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 296.356,
    "end": 300.282,
    "text": "How does that make the generative models structurally or functionally different?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 301.124,
    "end": 303.868,
    "text": "How does that have implications for different media?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 306.363,
    "end": 308.145,
    "text": " Few key claims.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 309.306,
    "end": 318.695,
    "text": "They're considering one solution to the implicit scaling problem with scale-free generative models that are linked through the renormalization group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 318.716,
    "end": 331.088,
    "text": "They're going to explore generalized MDPs, Markov Decision Processes, as discrete models that do functional cognitive tasks like compression, content generation, and planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 332.671,
    "end": 339.458,
    "text": " They're going to pay attention to universality and scale and variance for specifying structural form of generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 339.995,
    "end": 346.401,
    "text": " And then there will be a sequence of worked examples that we're going to spend most of the dot zero walking through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 347.502,
    "end": 354.769,
    "text": "And they highlight that these kinds of RGMs with quantized paths may or may not be useful in certain application domains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 355.27,
    "end": 366.841,
    "text": "So that's kind of the meta ML question is where, or how would we know where this would or wouldn't be more effective than another given kind of model, no free lunch at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 367.582,
    "end": 369.664,
    "text": "Could you read the abstract?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 371.534,
    "end": 373.457,
    "text": " Yeah, sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 373.557,
    "end": 377.783,
    "text": "So this paper describes a discrete state space model and accompanying methods for generative modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 378.304,
    "end": 387.237,
    "text": "This model generalizes partly observed Markov decision processes to include paths as latent variables, rendering suitable for active inference and learning in a dynamic setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 388.259,
    "end": 392.665,
    "text": "Specifically, we consider deep or hierarchical forms using the renormalization group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 393.303,
    "end": 404.12,
    "text": " ensuing renormalising generative models can be regarded as discrete homologues of deep convolutional neural networks or continuous space models in generalised coordinates of motion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 404.982,
    "end": 417.522,
    "text": "By construction, these scale invariant models can be used to learn compositionality over space and time, furnishing models of paths or orbits, in other words, events of increasing temporal depth and itinerancy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 418.362,
    "end": 423.709,
    "text": " This technical note illustrates the automatic discovery, learning, and deployment of RGMs using a series of applications.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 424.089,
    "end": 429.156,
    "text": "We start with image classification and then consider the compression and generation of movies and music.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 429.176,
    "end": 433.121,
    "text": "Finally, we apply the same variational principles to the learning of Atari-like video games.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 434.262,
    "end": 434.583,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 436.105,
    "end": 438.368,
    "text": "Okay, moving on to... Daniel, you're on mute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 440.15,
    "end": 440.43,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 440.811,
    "end": 441.872,
    "text": "To the roadmap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 443.573,
    "end": 444.899,
    "text": " The first section is the introduction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 445.802,
    "end": 449.176,
    "text": "Section 2 is the background formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 449.678,
    "end": 454.157,
    "text": "This is going to make connections with the generative models from the textbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 454.357,
    "end": 459.142,
    "text": " Then section three, four, five, six, we'll go through a sequence of worked examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 459.862,
    "end": 468.251,
    "text": "We're going to front load the focus in the dot zero on sections two and three, and then four, five, and six unfold kind of naturally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 469.072,
    "end": 474.757,
    "text": "Three is a static image MNIST handwriting dataset task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 474.777,
    "end": 482.625,
    "text": "Section four is a cyclic video that then slides into a chaotic attractor dynamical system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 482.605,
    "end": 484.728,
    "text": " and a natural video.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 485.288,
    "end": 493.158,
    "text": "Section five goes into sound, and six is the general planning case from pixels to planning, and seven's a short conclusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 493.638,
    "end": 497.122,
    "text": "So it's pretty much introduction and conclusion like bookends.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 498.104,
    "end": 511.92,
    "text": "Section two is where the general formalism is, and then three through six take us on from handwriting, several kinds of videos, dynamic images, sound, and then gameplay and planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 513.723,
    "end": 515.806,
    "text": " Here are the keywords of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 516.747,
    "end": 525.941,
    "text": "Active inference, active learning, Bayesian model selection, renormalization group, compression, structure learning, RG flow, renormalizing generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 526.662,
    "end": 532.17,
    "text": "So those are good terms if you're uncertain about to jump into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 532.15,
    "end": 548.353,
    "text": " okay we have a few slides on some of these background concepts just to get it up front so we can proceed with the paper when we get there let's start with what is renormalization so of course much could be said but what what would you say what is renormalization",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 549.565,
    "end": 554.354,
    "text": " Yeah, so I think this is in itself quite a loaded term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 554.734,
    "end": 556.397,
    "text": "There's a lot from physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 556.417,
    "end": 562.829,
    "text": "And if you look at the Wikipedia page, the third link that's there, there's a lot in that Wikipedia page.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 562.849,
    "end": 564.031,
    "text": "It's very confusing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 564.512,
    "end": 566.996,
    "text": "A lot of quantum electrodynamics coming in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 567.357,
    "end": 569.481,
    "text": "And I think Feynman has an attitude on it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 569.501,
    "end": 570.763,
    "text": "He says he's not a fan of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 570.98,
    "end": 596.464,
    "text": " um but uh i think for our purposes the top quote that's there that's coming from the paper is actually good enough for a large part so we basically take some sort of system and we say this is way too hard this is way too complex there's way too many moving parts what is a like a take-home message what is the summary of what this is doing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 596.883,
    "end": 599.53,
    "text": " at a macroscopic level compared to the micro level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 600.754,
    "end": 611.905,
    "text": "And there are some examples in the upcoming slides on particularly talking about thermodynamics and materials where this will become more obvious as to how this might work in practice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 611.885,
    "end": 619.139,
    "text": " But I think the coarse-grained version that retains the properties of interest is really what to focus on going forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 619.66,
    "end": 625.791,
    "text": "And yeah, lossy compression for the signal processing engineers in the audience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 625.871,
    "end": 629.819,
    "text": "This is very much a case of you're not keeping everything when you renormalize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 630.279,
    "end": 631.682,
    "text": "You're keeping what's important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 632.928,
    "end": 633.81,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 633.83,
    "end": 634.351,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 634.371,
    "end": 652.126,
    "text": "As you coarse grain, so spatially, like thinking about a radius or like a convolutional diameter getting larger and larger, you're choosing a bigger chunk to grain over, coarse graining, and renormalizing what those edges and relations amongst blocks are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 652.767,
    "end": 655.392,
    "text": "So you have one model, it's a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 655.372,
    "end": 678.51,
    "text": " 10 by 10 square so you have blocks of size one and all those edges and then you decide okay we're gonna look at blocks of two by two you have fewer blocks fewer edges so you have to renormalize all of your parameter estimates and then you end up with hopefully capturing some of the signal with fewer parameters aka compression whether it's lossy or lossless",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 679.351,
    "end": 680.412,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 680.752,
    "end": 686.558,
    "text": "I'm going to pick up on one thing quickly where you said spatially, and you can renormalize through space, but you can also renormalize through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 686.618,
    "end": 688.139,
    "text": "You can renormalize through any dimension you want.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 688.88,
    "end": 690.882,
    "text": "It's just easier to imagine the space and time ones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 691.102,
    "end": 701.532,
    "text": "So the time analogy that I think they use in the paper, which is quite a good one, is thinking about if you're, let's say you're watching TV and you're watching something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 701.752,
    "end": 706.877,
    "text": "And in that moment, there are two characters talking that might form part of a scene.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 706.857,
    "end": 714.328,
    "text": " which is one renormalization, and then you have a series of scenes, which would be an episode, and then you'd have multiple episodes in a series.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 715.73,
    "end": 720.436,
    "text": "So the time one, actually, I find a bit more intuitive to understand what renormalization is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 720.737,
    "end": 723.521,
    "text": "And you can say, oh, yeah, something happened in a particular episode.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 723.761,
    "end": 733.675,
    "text": "You can say something happens in a particular series, something happens in a particular scene, but that thing you might be describing might actually be more fine-grained or more coarse-grained.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 734.667,
    "end": 757.401,
    "text": " awesome yeah the examples will start with the static handwriting and move on to include time and you're totally right about the time scales it's like saying what's the transition matrix from minute to minute or hour to hour or day to day but each moment is measurable with seconds minutes hours or so on okay how about the spin block transformation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 759.524,
    "end": 766.574,
    "text": " Yeah, so now this is sort of back to material science and magnetism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 767.816,
    "end": 779.052,
    "text": "So there's a fairly well understood model of magnetism called the Ising model and physicists generally quite like it, mathematicians quite like it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 779.032,
    "end": 787.91,
    "text": " You imagine a big magnet, there's lots of little magnets that will line up in a grid, and each magnet just talks to the little magnets around it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 788.732,
    "end": 797.53,
    "text": "And you can recover quite a lot of actual behavior of magnets in the real world with a fairly simple model for this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 797.51,
    "end": 811.227,
    "text": " But the spin block transformation is largely going, well, if I have lots of little magnets together and they're all pointing the same way, I can just think of it as one big magnet that's the sum behavior of all of these little ones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 812.048,
    "end": 815.993,
    "text": "And this is a trick that we play a lot in physics of going from the micro to the macro.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 816.033,
    "end": 817.595,
    "text": "The micro is too hard to model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 817.695,
    "end": 819.017,
    "text": "It's too painful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 819.277,
    "end": 820.459,
    "text": "You've got all these particles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 820.539,
    "end": 823.703,
    "text": "They could all be doing, you know, spinning every which way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 823.683,
    "end": 850.365,
    "text": " all their speeds and velocities and if you had all of them then you could add them all up and you could figure out what's going on or you can just you know get a thermometer measure the temperature right and the temperature that one number tells you a lot about how this thing is going to behave so you can get a lot of value just from the macro but if that macro is composed of all of the micro so depending on where you are in your core screening of your scaling behavior uh you can get either a lot done or a little bit done and it's just what's useful to you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 850.784,
    "end": 864.737,
    "text": " So I quite like this sort of quote at the bottom about the magnitude of an observable of a physical system undergoing an RG transformation and whether that observable is relevant or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 864.817,
    "end": 878.31,
    "text": "I think that's quite important to bear in mind for the future examples of, well, if something is always increasing, it's always getting bigger, then you're going to see it on the coarse grained transformations that you see later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 878.29,
    "end": 903.353,
    "text": " but if it's always decreasing at a particular level you're not going to see it on the higher levels you're only going to see it on the lower levels so it'll have so this gives you some uh understanding of causality of when you're going up or when you're going down uh on the core screening um so yeah like particle speeds and temperature is a nice uh a nice uh example of this and similarly magnetism with the spin block transformation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 903.333,
    "end": 906.42,
    "text": " But by and large, what are these transforms doing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 906.66,
    "end": 917.143,
    "text": "If you take a grid of lots of little things, you just go, well, I'm just going to summarize this with a single thing that represents that behavior and then move on with my day.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 918.465,
    "end": 918.726,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 919.533,
    "end": 937.778,
    "text": " okay quick on the singular value decomposition there's a nice interactive explanation this is related to principal component analysis and it's a way to proportion variance and to take the biggest cut of variance",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 937.758,
    "end": 940.923,
    "text": " for a given decomposition for a dataset.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 941.423,
    "end": 959.509,
    "text": "And you can take, we'll look at it in application a bit later, but it's used to assess the vectors of variance, and then you can truncate them and use that to capture increasing amount of variance for a given dataset.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 959.549,
    "end": 960.951,
    "text": "We'll look at it in a specific case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 961.692,
    "end": 965.638,
    "text": "And last kind of background topic on locality principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 967.998,
    "end": 981.925,
    "text": " Yeah, I don't actually know a huge amount about the locality principle, but I think it's a general intuition that things next to each other affect each other and things far away, in theory, don't affect you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 982.907,
    "end": 987.255,
    "text": "There are definitely some things where if this is violated, this feels very weird.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 988.137,
    "end": 991.002,
    "text": "I think quantum entanglement is probably an example of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 990.982,
    "end": 1013.158,
    "text": " uh but i'm gonna stop speaking there because we've hit the limit of my knowledge yes i think wittgenstein wrote something about that okay and this is just a few of the other links but there was a ton of other links that people brought up over the months preparing for this okay onto the paper so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1014.505,
    "end": 1030.472,
    "text": " here's the link to the coda i'll put this in the youtube live chat right now just if anyone wants to follow back to the workspace where we did the preparation work if you're watching live write any questions in the live chat and we'll check it at the end",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1030.925,
    "end": 1043.583,
    "text": " What we're about to do is go through much of the paper, pulling out some of the key quotes in the main thread, and we show most or all the figures and some of the formalisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1043.924,
    "end": 1045.746,
    "text": "Of course, they're all there in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1046.327,
    "end": 1051.735,
    "text": "This is just the highlights so that we can get this done in a reasonable linear amount of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1051.715,
    "end": 1080.253,
    "text": " in preparation for conversations with the authors further open source development and all that so okay here we go onto the paper so first three sentences of the paper this paper considers the use of discrete states discrete state space models as generative models for classification compression generation prediction and planning so for context we're in the discrete time setting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1081.027,
    "end": 1083.892,
    "text": " Figure 4.3 from the 2022 textbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1084.033,
    "end": 1085.687,
    "text": "We're in the top setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1087.507,
    "end": 1093.854,
    "text": " The inversion of such models can be read as inferring the latent causes of observable outcomes or content.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1094.414,
    "end": 1115.657,
    "text": "So this is the tale of two densities, meaning that generative models can be used to generate synthetic observations from latent state estimates, that's the generative direction or decompression, as well as infer latent states from data, that's the recognition direction from observations to latent states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1115.637,
    "end": 1123.092,
    "text": " And then last of these three sentences, when endowed with the consequences of action, they can be used for planning as inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1124.054,
    "end": 1128.904,
    "text": "So in contrast with sort of a sterile sense-making or perceptual inference task,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1129.542,
    "end": 1135.437,
    "text": " Active inference considers action as part of a joint inference distribution or problem, which constitutes the agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1135.918,
    "end": 1145.863,
    "text": "So think about how the agent is defined as ABCDE matrices as sensemaking, latent state transition operations, and the consequences of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1145.843,
    "end": 1175.817,
    "text": " so improvements to generative modeling technologies have wide-ranging implications for a variety of both sense making perception tasks on the inbound as well as decision making and action tasks on the outbound which is kind of the theme of active inference that action can be treated as an inference problem any thoughts on these first slides um no i think we should keep going cool okay specifically",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1177.012,
    "end": 1180.499,
    "text": " This paper explores the use of generalized Markov decision processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1181.321,
    "end": 1190.7,
    "text": "This generalization in question rests on equipping a standard, partially observed Markov decision process with random variables called paths.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1192.3,
    "end": 1216.654,
    "text": " this affords an expressive model of dynamics in which transitions among states are conditioned upon paths which themselves can have lawful transitions so we're going to return to this figure again but the big picture is that from the sort of textbook basic pomdp we're going to add some sophistication which is that variables called paths",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1216.634,
    "end": 1245.612,
    "text": " will condition the state transitions and those could fall under the agency or the efficacy of an agent or not there can be lawful probabilistic transitions among paths which are like transitions amongst actions in a policy sequence except that actions in a policy sequence would be understood to be under the control of an agent and and those paths states influence transitions of latent states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1246.148,
    "end": 1252.299,
    "text": " Figure one shows that several concepts of depth in generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1252.579,
    "end": 1257.027,
    "text": "We have temporal depth, which means a deeper unrolling through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1257.568,
    "end": 1262.677,
    "text": "So this is just predicting more time steps deeper into the future linearly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1263.518,
    "end": 1269.068,
    "text": "So if this was each one was one day, this is just going rolling out for a bigger number of days.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1269.335,
    "end": 1287.242,
    "text": " hierarchical depth would be if we had a model that had days months and years and the way that it could deal with longer time scales would be have 30 days within a month and then 12 months within a year so nested hierarchically recursive layers",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1287.492,
    "end": 1292.237,
    "text": " deal with deeper time scales instead of needing to unroll 365 days.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1292.277,
    "end": 1298.004,
    "text": "And factorial depth can be thought of kind of like a multi-sensory model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1298.744,
    "end": 1301.768,
    "text": "So here's an observation of sound and here's an observation of light.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1302.368,
    "end": 1310.958,
    "text": "And then those different modalities can be factorized separately from each other, like the what and the where in the brain to simplify.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1311.398,
    "end": 1314.542,
    "text": "And that's another way in which generative models can have depth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1316.063,
    "end": 1317.465,
    "text": "Any more thoughts on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1318.863,
    "end": 1325.403,
    "text": " I think one thing to highlight is first of all, the notation is quite difficult to understand in this figure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1327.208,
    "end": 1328.231,
    "text": "I found it really hard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1329.254,
    "end": 1331.1,
    "text": "There is also a...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1331.57,
    "end": 1339.18,
    "text": " I think there is a difference, at least in my mind, when I read this figure in the caption compared to, say, the textbook, which is the C matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1340.582,
    "end": 1350.336,
    "text": "So I think previous formulations of actor inference, the C matrix tends to represent the prior preferences of an agent, sort of its goals, its values.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1350.396,
    "end": 1353.46,
    "text": "It's like, I expect to see these observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1353.44,
    "end": 1377.135,
    "text": " so if i don't then i'm going to experience a higher free energy so i'm either going to change my mind or change take some action to change the world so that my observations match my priors better and i get a lower free energy here the c matrix seems to be encoding probabilities of paths it's not entirely clear to me how we get value into that as opposed to just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1378.178,
    "end": 1379.765,
    "text": " what it expects to see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1380.026,
    "end": 1385.43,
    "text": "So maybe there is a distinction here that I haven't understood, or maybe it is genuinely a shift.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1385.59,
    "end": 1387.8,
    "text": "I'd be really curious to ask the authors specifically",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1390.447,
    "end": 1410.767,
    "text": " in the future episodes yeah pending authors accounts but two things I would note to echo that first is every variable through time can be understood as a trace or a path whereas path is also being used to refer to just this specific upstairs string",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1410.747,
    "end": 1429.665,
    "text": " And then a second case of overloading is C, while in previous situations, like in figure 7.3 or 4.3 from the textbook, we have C as playing a role in expected free energy calculation, pragmatic value, the preference over observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1430.045,
    "end": 1437.632,
    "text": "Here, it's not the same C. C as preferences is over observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1438.152,
    "end": 1453.139,
    "text": " Here, transition probabilities are encoded in C. So it's kind of like a B, but this just goes to show letters are just letters and future software will be able to flip out and have different shapes and notation and all of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1453.821,
    "end": 1456.245,
    "text": "So don't get too attached to the letter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1456.276,
    "end": 1484.477,
    "text": " look at how they're locally defining things even though that can be really challenging learning too okay the generalization becomes particularly important when composing markovian processes in deeper hierarchical architectures this follows from the use of states at one level to generate the initial conditions and paths at a lower level this recursive aspect speaks to a definitive feature of the generative models considered in this paper renormalizability",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1484.93,
    "end": 1485.772,
    "text": " This is the big idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1486.373,
    "end": 1500.441,
    "text": "Multiscale hierarchical models can be built using this paths-on-states-on-paths-on-states-on-paths-and-dot-dot-dot-dot method, which describes this renormalization happening across scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1500.978,
    "end": 1528.605,
    "text": " you could have the inch by inch path and then that's nested within a foot by foot and mile by mile or you could have the minute by minute path and that's nested within hour by hour and day by day so by having this layering of states and paths and states and paths there's a clean way to get the separation of spatial or temporal or arbitrary scales so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1529.817,
    "end": 1546.105,
    "text": " that's the big background formalism one other way to get an intuition here's from our paper on the renormalization group in free energy principle applied to multi-scale biological systems",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1546.49,
    "end": 1562.895,
    "text": " On the bottom, we have the kind of figure that we've seen in many active inference papers, where we're thinking about the cognitive behavioral entity like a worm, where the sensory states can be associated with perception, the active states with action, internal states with cognitive states, and all of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1564.799,
    "end": 1573.777,
    "text": " At the end of the day, there's also this nested, extended evolutionary process that is happening at the population scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1574.078,
    "end": 1582.234,
    "text": "So that's kind of like nesting the phenotype of individual worms within a population of worms or within an ecological distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1583.429,
    "end": 1592.997,
    "text": " And then last note here, in this setting, a policy is not a sequence of actions, but a combination of paths where each hidden factor has an associated state and path.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1593.598,
    "end": 1598.342,
    "text": "This means there's potentially as many policies as there are combinations of paths.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1599.583,
    "end": 1612.474,
    "text": "So because these paths are kind of like context combinations, it means that there's a double explosiveness to them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1613.787,
    "end": 1625.551,
    "text": " So understanding how do you handle that and understand the computational complexity class, and again, where it wouldn't be useful, those are key questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1627.475,
    "end": 1628.016,
    "text": "Any thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1629.65,
    "end": 1640.423,
    "text": " Yeah, I think that last bit, especially in a paper that's talking about scale-free active inference, and then now we're not just combining states for that combinatorial explosion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1640.583,
    "end": 1644.188,
    "text": "Now it's combinations of paths of states and actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1646.11,
    "end": 1648.073,
    "text": "In theory, this should be much worse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1649.214,
    "end": 1650.055,
    "text": "So I think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1651.132,
    "end": 1657.2,
    "text": " At the moment, I'm reading this and I'm thinking we're going to pay even more of a cost in terms of computing what the hell is going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1658.242,
    "end": 1665.932,
    "text": "But I think the renormalization group and making these models hierarchical pays for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1666.052,
    "end": 1668.535,
    "text": "That's my intuition of reading this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1669.116,
    "end": 1674.243,
    "text": "So yeah, there's a good quote to have there and it's a good thing to have bolded.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1674.664,
    "end": 1679.35,
    "text": "I don't think you're ever going to get a free lunch, but you have to pay for lunch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1679.92,
    "end": 1693.744,
    "text": " yeah the number of ingredients for lunch um okay in what follows we illustrate applications of the renormalizing generative model rgm in several settings um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1694.77,
    "end": 1701.897,
    "text": " The renormalization group requires the functional form of the dynamics, in terms of belief updating, is conserved over levels or scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1702.377,
    "end": 1712.327,
    "text": "This is assured in variational inference in the sense the inference process itself can be cast as pursuing a path of least action, where action is a path integral of variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1712.587,
    "end": 1718.613,
    "text": "Another classic term overloading action here isn't like the robot moving its arm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1718.673,
    "end": 1722.297,
    "text": "This is the physics action, sometimes with a capital A.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1722.277,
    "end": 1746.124,
    "text": " because all inference under free energy principle is considered in terms of the path of least action we can be assured that arbitrarily thick wide thin tall small world however you want to create the topology of a generative model we can be ensured that we're in an analytical setting where the models are quote doing the same thing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1746.543,
    "end": 1773.597,
    "text": " at different scales and then this takes us all the way from the first principles framing of the problems all the way on through the software tools like rx and fur which might be implementing these kinds of generative models also in this kind of ecumenical way the only thing that changes between levels are the parameters of the requisite action eg sufficient statistics of various probability distributions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1774.42,
    "end": 1782.492,
    "text": " That's to say, the functional properties of the RGM are simply determined and described by how it's parameterized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1783.175,
    "end": 1785.223,
    "text": "So was it statistics all along?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1786.368,
    "end": 1794.096,
    "text": " And that's what we have in figure three with showing what that blocking looks like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1794.617,
    "end": 1797.32,
    "text": "These are statistical parameters that are learnt.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1798.121,
    "end": 1807.671,
    "text": "So the description of the topology of this graph is the structure, which is either fixed or designed or set or learnt as a structure learning problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1808.151,
    "end": 1814.198,
    "text": "And then there's the values for a given situation that these variables take on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1814.178,
    "end": 1842.784,
    "text": " and here's that state path essential coupling that's the state paths state path so compare this with hierarchical or multi-level Bayesian regression compare this with hierarchical predictive processing architectures state path state path and each of those constitute a separation of scales all of this is a statistical model any thoughts on this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1844.873,
    "end": 1848.558,
    "text": " Yeah, I think the hierarchy part is absolutely key here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1849.499,
    "end": 1859.372,
    "text": "There is a little aside in the paper about which things in a hierarchy can affect which things in the lower part to make the inference actually possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1859.553,
    "end": 1865.981,
    "text": "So this is the idea of the Markov blankets and whether a child can have multiple parents, that sort of thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1867.063,
    "end": 1868.745,
    "text": "I think we possibly will come onto that later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1869.566,
    "end": 1872.45,
    "text": "But overall, the main critical thing is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1873.038,
    "end": 1883.965,
    "text": " stuff happening at a higher level in your hierarchy is determining a lot of what's happening at the lower level, but information can flow back up with the observations that you get at the lower level to infer those parameters at the higher level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1884.145,
    "end": 1888.195,
    "text": "So that's the classic active inference sort of top-down, bottom-up approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1888.377,
    "end": 1915.482,
    "text": " yeah awesome okay next section active inference learning and selection this section overviews the model which is used in the numerical studies of the following section and figure one provides an overview of the generative model that's considered in the paper we already took a quick look outcomes at any time depend upon hidden states that's the a matrix that's the partially observable part",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1916.322,
    "end": 1945.249,
    "text": " while transitions among hidden states depend on paths and that's this sort of way that we see the transitions amongst latent states so that's the B matrix which is intervening between hidden states S B is being imposed upon by this path happening so it's almost like this is a this is like a rail or a guide up top",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1946.039,
    "end": 1951.427,
    "text": " that's influencing how the actual latent state ends up unfolding through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1951.567,
    "end": 1963.786,
    "text": "And at each time point, there's the emission of an observation, that's the generative direction, or it could be taking in an empirical data point and then updating beliefs through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1965.569,
    "end": 1968.874,
    "text": "They describe the variables just like in the caption",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1970.44,
    "end": 1982.277,
    "text": " The tensors are generally parameterized as Dirichlet distributions whose sufficient statistics are concentration parameters or Dirichlet counts, which count the number of times a particular combination of states and outcomes has been inferred.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1982.818,
    "end": 1990.749,
    "text": "We focus on learning the likelihood model encoded by Dirichlet counts, A. And that's known as learning by counting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1990.949,
    "end": 1994.895,
    "text": "So that's the kind of classic case of pulling balls out of an urn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1995.01,
    "end": 2017.71,
    "text": " and then tallying every time you see a certain kind of ball coming out of an urn or here it would be like pulling balls out of an urn and it's either cloudy or sunny and then you're doing learning by counting on the context and the outcome and then you're using that to parameterize everything else",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2020.238,
    "end": 2030.738,
    "text": " carrying on a little bit with this and again connecting back to the 2022 textbook compare with figure 7.3 pomdp",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2030.887,
    "end": 2048.466,
    "text": " The details are basically the same, except notice that paths U are described, as we mentioned earlier, C in the textbook, just the letter C, it's not actually that variable computationally, but the letter C is being used for preference distributions over observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2048.986,
    "end": 2052.049,
    "text": "Here, C is playing a role in the transition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2052.13,
    "end": 2056.354,
    "text": "It's kind of like a B, but for this meta path.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2058.528,
    "end": 2061.152,
    "text": " In the textbook, we have a single-layer model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2061.613,
    "end": 2076.056,
    "text": "Now, it has compositionality, but it's just a single-layer model, whereas in the paper we're discussing today, hierarchical levels are described in terms of this state-path-state-path alternation approach, and there's factorial depth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2077.798,
    "end": 2085.21,
    "text": "Here, the procedural order of operations for the generative model is provided as policy selection",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2086.405,
    "end": 2090.849,
    "text": " generate hidden state sequences and generate expected outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2091.63,
    "end": 2094.172,
    "text": "This is the forward or generative direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2094.352,
    "end": 2098.837,
    "text": "We could also go the recognition direction from real observations to policy inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2099.737,
    "end": 2107.385,
    "text": "So they're unrolling a policy centric approach that yields expected outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2108.025,
    "end": 2113.29,
    "text": "That's like running the generative model from policy inference out",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2114.08,
    "end": 2121.951,
    "text": " as opposed to running a generative model from data processing to belief updating about policy going in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2123.653,
    "end": 2128.58,
    "text": "Just to highlight some kind of points of contact, similarities with the textbook for those who dapple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2129.802,
    "end": 2130.944,
    "text": "Any comments?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2133.407,
    "end": 2134.809,
    "text": "No, I think that was really good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2135.169,
    "end": 2136.291,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2137.199,
    "end": 2149.351,
    "text": " Equations 1, 2, and 3 in this paper are akin to equation 2.5 and 2.6 in the textbook on variational free energy and expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2149.711,
    "end": 2166.447,
    "text": "So to learn about the different decompositions of variational free energy in terms of the ones that look more statistical, like divergence minus evidence, complexity minus accuracy, or the ones that look more statistical physical, like energy and entropy,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2166.73,
    "end": 2193.227,
    "text": " that's variational free energy and then analogously with equations two and three in the paper or equation 2.6 in the textbook we have expected free energy with the classical decomposition into epistemic value pragmatic value okay now we get to active inference um there's a lot we could say here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2194.878,
    "end": 2211.621,
    "text": " they describe that first sentence of active inference section in variational inference and learning sufficient statistics encoding posterior expectations which could be about sense making as well as action posterior expectations about what i am going to do pi",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2211.601,
    "end": 2214.425,
    "text": " are updated to minimize variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2214.866,
    "end": 2227.826,
    "text": "So that's the idea of seeing everything it is that the agent is and does on the inbound perceptual and outbound action selection as part of a joint distribution that's undergoing variational free energy minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2229.048,
    "end": 2231.972,
    "text": "That's the active inference concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2232.374,
    "end": 2262.162,
    "text": " note the circle with a dot notation so the notation implies a sum product operator the dot or inner product that sums over one dimension of a numeric array or tensor so note the difference between circle with a dot as the inner product or tensor contraction while circle with x is the outer product so to look at the figure with message passing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2262.209,
    "end": 2265.532,
    "text": " and which brings in this circle with a dot notation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2268.135,
    "end": 2274.401,
    "text": "Here we see the same graph that we saw in figure one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2275.202,
    "end": 2276.924,
    "text": "In figure one, we have a Bayes graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2277.024,
    "end": 2283.631,
    "text": "So the nodes are variables that we would encode in our program, and then the edges are causal relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2283.651,
    "end": 2288.976,
    "text": "So that's the kind of classic systems modeling kind of flow interaction mind map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2289.985,
    "end": 2296.432,
    "text": " Here in this figure, we see a factor graph representation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2296.752,
    "end": 2308.605,
    "text": "Now, in Livestream 55 and in the Realizing Synthetic Active Inference Agents discussion and other discussions, we've talked more about the relationship between Bayes graph and the Forney factor graph representation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2309.186,
    "end": 2316.634,
    "text": "Suffice to say that what it is that nodes and edges are basically get flipped, but there's a full reproducibility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2316.614,
    "end": 2322.864,
    "text": " so that here we have ways to look at the logistics of message passing amongst these nodes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2323.425,
    "end": 2329.855,
    "text": "And it turns out that under the hood, this is what RxInfer is doing when it's being implemented.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2330.396,
    "end": 2333.441,
    "text": "So maybe if we get more into implementation, we could talk about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2333.481,
    "end": 2337.728,
    "text": "This figure is just showing that for that POMDP,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2337.708,
    "end": 2343.114,
    "text": " which is going to be doing the real work of active inference on the perceptual and the action selection side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2343.914,
    "end": 2349.841,
    "text": "It's not just that we can link up the variables on the base graph that account for what we want to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2350.541,
    "end": 2361.453,
    "text": "It's that there's a specific logistics and we know exactly which messages to pack and send in order to get this whole variational inference done at the graph level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2361.993,
    "end": 2365.757,
    "text": "And that can be done with either a determined logistical schedule",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2366.868,
    "end": 2374.062,
    "text": " or it can be done in a reactive message passing setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2374.082,
    "end": 2376.146,
    "text": "Okay, active learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2377.108,
    "end": 2381.136,
    "text": "Bayesian model reductions a generalization of ubiquitous procedures and statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2383.561,
    "end": 2386.767,
    "text": "In the present setting, it reduces to something remarkably simple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2387.185,
    "end": 2408.793,
    "text": " By applying Bayes' rules to parent and reduce models, so a model of k parameters and of k-1 parameters, it is straightforward to show that the change in variational free energy can be expressed in terms of posterior Dirichlet counts A, prior counts A, and the prior counts that define a reduced model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2408.813,
    "end": 2417.023,
    "text": "So A' corresponds to the posterior one would have obtained under the reduced priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2418.472,
    "end": 2423.729,
    "text": " The alternative to Bayesian model reduction is bottom-up growth of models to accommodate new data or content.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2424.351,
    "end": 2429.528,
    "text": "If one considers the selection of one parent model over another augmented model as an action,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2430.807,
    "end": 2442.707,
    "text": " These two equations in the active learning section are like the add and remove variable operations and ultimately what allow us to compare any Bayesian model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2443.509,
    "end": 2454.688,
    "text": "So model comparison amongst nested, strictly nested models can be done in the fully parametric setting using the hierarchical likelihood ratio test.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2455.276,
    "end": 2471.364,
    "text": " Bayesian models allow model comparison amongst models that differ in only one parameter, like adding or removing one parameter as part of structure inference, or there could be radically different model topologies underneath.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2472.486,
    "end": 2479.258,
    "text": "And that can be evaluated in terms of like a Bayes factor support for one model over another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2480.723,
    "end": 2498.273,
    "text": " It also connects to a lot of work, theoretical and applied in sleep-wake type models, where parameters are added, fit increases during wake cycles, and then synapses are pruned, models are reduced, core screening occurs during sleep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2498.294,
    "end": 2502.04,
    "text": "And the big picture is you can use Bayesian model comparison",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2502.408,
    "end": 2529.276,
    "text": " framed as a free energy landscape optimization just as always comparing different base graphs comparing different generative models and then this results in the expression of a log base factor or an odds ratio comparing the likelihood of two different models so this allows comparison of different models and the selection of different models as its own inference task",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2531.467,
    "end": 2532.549,
    "text": " Any thoughts on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2535.035,
    "end": 2546.36,
    "text": "Yeah, just one thing I want to pick up on is I actually can't remember, like, I guess with this paper, I think they were just doing sort of like, it's almost like just purely the bottom-up approach, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2546.42,
    "end": 2549.627,
    "text": "They're not starting with like a massive model and then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2550.046,
    "end": 2553.091,
    "text": " You couldn't start with a very big one at the top and then coarse-grain down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2553.211,
    "end": 2555.815,
    "text": "You have to coarse-grain sort of going up the hierarchy, as it were.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2556.076,
    "end": 2564.589,
    "text": "So I think we end up going with this bottom-up growth of models because you don't want more levels than you need necessarily.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2564.83,
    "end": 2574.265,
    "text": "Or if you have an image and you're trying to classify it and it's, I don't know, 32 by 32 pixels and you just subdivide it by two,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2574.245,
    "end": 2588.259,
    "text": " you need to start with your pixel, you need to start with your full image width first and then coarse-grain, coarse-grain, coarse-grain up, rather than going, ah, A4RI, I'm going to have N levels and then cut them down after.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2588.299,
    "end": 2595.305,
    "text": "So I think that's probably going to be more on the bottom-up growth of models for this particular paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2596.326,
    "end": 2597.327,
    "text": "Yeah, good point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2597.688,
    "end": 2603.053,
    "text": "How do you know how big to make each scale and how many scales?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2604.434,
    "end": 2610.324,
    "text": " We won't read all the text on this page, but big claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2610.344,
    "end": 2613.769,
    "text": "Renormalizability is feasible under the models in Figure 1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2614.31,
    "end": 2618.577,
    "text": "So that's kind of the rhetorical chain is, here's the models that we're working with in Figure 1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2619.799,
    "end": 2622.023,
    "text": "These models have renormalization properties.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2622.644,
    "end": 2630.897,
    "text": "That is what makes this state path, state path layering amenable to scale-free or scale-friendly or multi-scale generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2631.687,
    "end": 2653.459,
    "text": " claim is that given the renormalization properties of base graphs like or including the ones that they're describing with this state path state path nesting there can be computationally tractable possibly multi-level renormalization and the rest of the paper they're going to be explaining and unpacking that and adapting it to specific settings",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2654.03,
    "end": 2664.151,
    "text": " These renormalizing transformations have the effect such that the dynamics slow down in time and space as one ascends levels or scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2664.792,
    "end": 2674.452,
    "text": "So compare that with other work on information theory of individuality, bottom-up and top-down information flows and causality, gapping and laddering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2677.402,
    "end": 2692.847,
    "text": " And also they're saying that the structure and the tuning of the variables in the graph, which would yield the full reproducible description of the renormalizable generative model, itself can be reached through this Bayesian model comparison.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2695.892,
    "end": 2700.76,
    "text": "We had some questions about how the discrete and continuous time are different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2703.592,
    "end": 2712.463,
    "text": " A more intuitive view is that successively higher levels encode sequences of sequences and implicitly composition of events or episodes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2713.104,
    "end": 2723.997,
    "text": "In other words, at a deep level, one state can generate sequences of sequences of sequences, thereby destroying the Markovian properties of content generated at the lowest level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2724.871,
    "end": 2733.769,
    "text": " So this is like encoding or sedimenting nested sequences or paths in event-based or order structured narratives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2737.155,
    "end": 2740.602,
    "text": "Deep structure is what allows",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2740.818,
    "end": 2755.03,
    "text": " or possibly advanced or naturalistic, interpretable, fill in your preferable adjective there, models of complex phenomena that do have deep structure like speech and writing and story.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2755.735,
    "end": 2776.427,
    "text": " and they're going to be walking through renormalization through space in terms of pixels time and in general spaces so it's cool to think about like chris fields and mike levin's work on competency in navigating arbitrary spaces as an invariant for analyzing cognition in diverse embodiments",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2776.475,
    "end": 2791.121,
    "text": " So the idea that space and time are just some state spaces, but other state spaces like semantic embeddings from an LLM or other kinds of state spaces might also have these abilities to yield to the renormalization operation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2792.243,
    "end": 2792.664,
    "text": "Any comments?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2795.69,
    "end": 2796.752,
    "text": "No, that was all good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2796.772,
    "end": 2797.032,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2798.817,
    "end": 2806.613,
    "text": " Figure 3 is a graphical model, which we looked at a little earlier, where groups of states at a lower level are generated by a single state at a higher level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2807.294,
    "end": 2817.855,
    "text": "So here we have a state at a higher level, S sub 1 superscript n plus 2, and then flowing out of it, we have the state and the path at a lower level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2819.438,
    "end": 2822.883,
    "text": " Higher states only change after a fixed number of lower state change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2823.624,
    "end": 2824.725,
    "text": "So that could be two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2825.286,
    "end": 2846.475,
    "text": "It could just be twice as fast, like a frequency doubling every time there's a time scale separation, or it could be fixed like 60 minutes per hour, and or it could be fully reactive in terms of using Rx and Fur for a just-in-time type responsive updating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2846.523,
    "end": 2857.461,
    "text": " And this is somewhere where I think that generalized notation notation will be really helpful because talking about what these variables are in detail gets pretty messy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2858.285,
    "end": 2884.326,
    "text": " um because each state and path has only one parent the ensuring markov blanket the blue circles of each state red circle ensures conditional independence among latent factors there is a strict uniparental inheritance factorization pattern in the hierarchical model so can latent factors remain conditionally independent so note that the s and the u here are not connected",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2884.492,
    "end": 2889.481,
    "text": " Conditioned upon the higher S, they are conditionally independent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2890.302,
    "end": 2892.626,
    "text": "That simplifies the runtime inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2893.588,
    "end": 2908.474,
    "text": "In sum, a renormalizing generative model, RGM, is a hypergraph parameterized by two sorts of tensors, the A and the B, in which the children of states at any level bipartition into initial states and paths.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2909.18,
    "end": 2915.73,
    "text": " In this example, the blocking transformation groups pairs of states and paths.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2917.06,
    "end": 2939.929,
    "text": " so here it's kind of like a and b again not exactly the a and the b letters from the textbook but note that a describes the likelihoods or empirical priors and b is the dynamics so a is broadly referring to like this instantaneous sense making like relationship between",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2939.909,
    "end": 2963.402,
    "text": " latent states and observations whereas b is describing the dynamics and the transitions through time so i'm not sure if it's exactly that simple but a is kind of describing synchronous attributes of the model whereas b describes diachronous through time aspects of the model okay anything else",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2964.648,
    "end": 2970.984,
    "text": " Yes, I think one thing to really hook onto is the uniparental inheritance thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2971.766,
    "end": 2978.904,
    "text": "So I think you're correct when you say, yes, that makes everything faster and less computationally difficult.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2979.145,
    "end": 2980.328,
    "text": "That is a good thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2980.308,
    "end": 3001.894,
    "text": " uh but i think there's a more philosophical thing to raise as well which is when we're talking about causality going up and down the levels uh and learning should in theory be a lot easier uh when you only have a single cause for something so that means that when you make an observation it's much easier to infer oh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3001.874,
    "end": 3006.582,
    "text": " the parent must have been this in order to cause what I see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3007.203,
    "end": 3015.538,
    "text": "And you don't have to consider multiple factors coming in and going, ah, well, it could have been any one of 10 different factors that mean I saw what I saw.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3015.578,
    "end": 3027.358,
    "text": "So that learning process as well, when we talk about the direct line counts earlier, should be a lot easier to do when you have only a single parent for a particular variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3027.338,
    "end": 3051.996,
    "text": " um so yeah that conditional independence among latent factors i think also features into the locality aspect as well of uh when we're talking about the very beginning of the session but i'm not 100 sure on that but that's my intuitive understanding of what's going on there cool okay one can also regard rgm as an expressive way of modeling non-linearities",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3052.28,
    "end": 3058.066,
    "text": " In the limit of precise likelihood mappings, this can be viewed as the composition of logical operators.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3059.948,
    "end": 3066.114,
    "text": "One can see why an RGM can compose operators to represent or generate content that has compositional structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3067.436,
    "end": 3073.662,
    "text": "The inversion of an RGM could be construed as a simple form of abductive logic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3073.682,
    "end": 3076.465,
    "text": "Okay, now we're going to get to the examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3077.373,
    "end": 3078.655,
    "text": " Here we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3078.676,
    "end": 3081.822,
    "text": "First example, image compression and compositionality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3082.583,
    "end": 3087.553,
    "text": "So first it's helpful for background to look at variational autoencoders.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3088.054,
    "end": 3099.195,
    "text": "These take in some input observations, they project down to a latent space that's smaller and then decode out to reconstruct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3099.648,
    "end": 3102.531,
    "text": " So it's really similar to a variational autoencoder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3102.671,
    "end": 3106.855,
    "text": "And look at the first word, variational free energy, variational autoencoder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3107.215,
    "end": 3109.998,
    "text": "They just call it the ELBO, not the VFE.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3110.338,
    "end": 3116.183,
    "text": "There's so many similarities between this method and active inference that it's really helpful to study up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3116.724,
    "end": 3120.247,
    "text": "It just sometimes uses a little bit of a frame shifted ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3121.989,
    "end": 3122.95,
    "text": "Here's what they do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3124.411,
    "end": 3128.575,
    "text": "They're studying the classic MNIST handwriting data set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3129.044,
    "end": 3138.874,
    "text": " They map continuous pixel values to a discrete state space, and then they're going to learn the structure through recursive applications of a blocking transformation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3139.775,
    "end": 3144.12,
    "text": "They group together local pixels by tiling or tessellating the image.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3145.041,
    "end": 3149.345,
    "text": "So that's the first step, is they tessellate over the image at multiple scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3150.747,
    "end": 3154.731,
    "text": "So the smallest dots is a 4x4 cluster of pixels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3154.863,
    "end": 3158.427,
    "text": " Then the medium-sized dot is four of those.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3158.507,
    "end": 3161.891,
    "text": "So then one, two, three, four, these get clustered into this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3162.572,
    "end": 3167.417,
    "text": "And then one, two, three, four get clustered into that one, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3168.118,
    "end": 3176.407,
    "text": "So that's the spatial static renormalization via spin block locality principle process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3177.428,
    "end": 3181.613,
    "text": "Each group is then subject to singular value decomposition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3181.711,
    "end": 3186.836,
    "text": " given the training set of images to identify orthogonal spatial basis of singular vectors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3187.958,
    "end": 3189.74,
    "text": "So this is the grouping and the reduction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3190.36,
    "end": 3191.942,
    "text": "Grouping is the tessellation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3192.042,
    "end": 3193.223,
    "text": "It's like a convolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3193.243,
    "end": 3197.688,
    "text": "We'll talk more about how it differs from convolution, like a convolutional neural network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3197.708,
    "end": 3199.91,
    "text": "And then they truncate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3200.451,
    "end": 3205.576,
    "text": "So here's an example from the form index project, but there's many other places you can look at this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3205.656,
    "end": 3210.942,
    "text": "This is what, for a principal component analysis or for an SVD analysis,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3211.462,
    "end": 3234.229,
    "text": " every single time it selects the vector that explains the most orthogonal variance and then it takes that profile out of the original data and then it takes the next most variance explaining vector and so you end up with something that looks like a variance explanation curve so the first 10",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3234.462,
    "end": 3235.805,
    "text": " components explain 70%.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3236.166,
    "end": 3239.915,
    "text": "To get to 90% on this data set, it took 50.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3240.597,
    "end": 3244.145,
    "text": "So if you say, well, my computer only has space for 10, just take 10.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3244.787,
    "end": 3251.222,
    "text": "Or if you say, well, I'm interested in this kind of Bayes optimal, Pareto optimal crossover point,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3251.455,
    "end": 3273.7,
    "text": " you can solve it that way or maybe you have other constraints so that's pretty much how it's working is they're structurally using the nesting with these four by four spin glass blockings and then they do a SVD truncation compression method on each level of that blocking",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3278.168,
    "end": 3302.286,
    "text": " this is how the path state path state path state works it's a multi-scale blocking convolution tessellation operation to group then svd with truncation to reduce to a defined state space they only retain 32 of the variables from the svd at each level um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3305.0,
    "end": 3320.26,
    "text": " There's more on this slide, but one thing that'll certainly be interesting to discuss with the author is, at first glance, this procedure may appear to generate likelihood mappings of increasing size because the combinatorics of increasingly large groups could explode at higher levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3321.0,
    "end": 3326.147,
    "text": "However, by training on a small number of images, one upper bounds the number of states at each level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3328.237,
    "end": 3336.25,
    "text": " In other words, one can effectively encode a finite number of images without any loss of information such that RGM inversion corresponds to lossless compression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3337.212,
    "end": 3340.277,
    "text": "So, what's the deal with training data?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3340.938,
    "end": 3348.731,
    "text": "How do we know about what is going to be an optimal or effective data size, variability, information content, or curriculum for the dataset?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3349.172,
    "end": 3353.299,
    "text": "How do we address that data selection problem, sometimes called active data sampling?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3356.435,
    "end": 3363.475,
    "text": " And then to the point about the lossless compression, one can effectively encode a finite number of images without loss of information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3364.231,
    "end": 3370.5,
    "text": " So how can or does this do compression better than, for example, Gzip or LLM?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3370.901,
    "end": 3390.188,
    "text": "That was a great moment in computational history when people realized that in certain ways, these models are doing information compression and that even Gzip or just file compression utilities have attributes that trained machine learning models have because of information theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3391.332,
    "end": 3399.823,
    "text": " And how do we know and infer or describe these trade offs related to the training data set and the structure of the model all these different things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3400.423,
    "end": 3413.88,
    "text": "As we expand the scope of our modeling degrees of freedom and how has this problem been solved similarly or approach differently in other work on information geometry in variational auto encoders.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3416.155,
    "end": 3419.66,
    "text": " And then just last piece on working through this example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3420.402,
    "end": 3424.228,
    "text": "So again, they pre-processed the MNIST images.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3425.89,
    "end": 3428.735,
    "text": "The images were downloaded from the link here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3428.775,
    "end": 3434.063,
    "text": "They were converted to the format that they needed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3435.325,
    "end": 3438.29,
    "text": " Then they say an exemplar image is shown in figure three in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3438.37,
    "end": 3439.813,
    "text": "I think that should be figure four.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3439.853,
    "end": 3444.241,
    "text": "And then they're showing the centroids of each of these groups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3445.142,
    "end": 3457.023,
    "text": "So this is just to get an intuition for what this multi-scale spin glass blocking is doing with the success of clumping and grouping into these multiple spatial scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3457.103,
    "end": 3458.245,
    "text": "Okay, any comments?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3460.874,
    "end": 3473.193,
    "text": " Yeah, I think I'm still very confused as to how this ends up being from the previous slide, how you get lossless compression if you're also doing the singular value decomposition and truncating some of those vectors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3475.316,
    "end": 3480.344,
    "text": "I definitely want to follow up with the office about when are we lossy and when are we lossless?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3481.305,
    "end": 3487.675,
    "text": "And as you said, the question of training data and how much, what goes in your curriculum, that's going to be huge, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3487.925,
    "end": 3508.701,
    "text": " yeah good point there's a truncation of variance so it's if it's close to lossless that's also known as lossy compression um here is figure five that's describing these concatenated likelihood matrices this is a common method in a lot of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3509.002,
    "end": 3534.334,
    "text": " models where four separate matrices can be included as sub matrices in a bigger matrix that can make it simpler to deal with in programming it might make it amenable to sparse matrix methods or compression methods it might make it just easier to visualize but this is kind of a classic trick going back to the spm days um okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3535.782,
    "end": 3557.217,
    "text": " if we had imposed an additional constraint or structural prior that likelihood mappings are conserved identically over groups so for example if there was the prior that um let's just talk about these four major quadrants that's the third level of the model if we had said all four of those are the same",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3558.901,
    "end": 3578.597,
    "text": " versus a situation like it was which is it was left open upper left quadrant of five could be different than the bottom right quadrant of five if we had imposed that additional constraint that the likelihood mappings are conserved identically over groups one would have the discrete homolog of a convolutional neural network with implicit weight sharing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3579.573,
    "end": 3586.079,
    "text": " So this is a super key point because people might have a lot more familiarity with convolutional methods from computer vision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3586.9,
    "end": 3601.975,
    "text": "In the case where the mappings are constrained to be the same, so it's a situation where we're learning a single filter that optimally sweeps across a whole image, this is the convolutional neural network case, convolutional case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3602.936,
    "end": 3607.2,
    "text": "Here in the multiscale RGM, the learning space is more complex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3607.383,
    "end": 3634.217,
    "text": " it's more general so the advantage is we could possibly describe more conditional relationships like oh the upper left quadrant of five looks like this but the bottom right looks like that what's the disadvantage you know where is this lunch getting paid for it massively expands the search and training space as always you can have a more expressive model has more options bigger search space less expressive model smaller search space",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3634.197,
    "end": 3644.473,
    "text": " And then figure six shows more about what these scales look like and connects it also to receptive fields in the visual processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3645.474,
    "end": 3662.5,
    "text": "But just like the four by four spin block window or the 32 truncation dimensions for SVD or the 10 levels of this factor, that's a big question is like, what about three by three with 25 dimensions of SVD and an eight factor or eight levels for the factor?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3662.902,
    "end": 3668.993,
    "text": " How much meta optimization do you do to determine what these variables should be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3671.458,
    "end": 3684.201,
    "text": "One thing to pick up on that, which maybe they don't do in this paper, but I'm sure they've done in others is, well, if I need to optimize something about my model, why don't I just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3685.16,
    "end": 3689.827,
    "text": " create a bunch of them and then check my free energy and just pick the one with the lowest free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3690.368,
    "end": 3696.537,
    "text": "So parameter optimization through free energy minimization happens everywhere else in Active Inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3696.577,
    "end": 3699.161,
    "text": "I'm not sure why we couldn't also do it here for some of these.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3700.383,
    "end": 3712.281,
    "text": "So you'd set up your RGM, but you could have different parameters on how many principles components to keep, how many levels to do, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3712.261,
    "end": 3726.0,
    "text": " And so long as you can generate observations and see which ones are the most internally consistent with the probabilities based on the training data, you could probably learn how to do your RGM.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3726.02,
    "end": 3736.615,
    "text": "Yeah, I think that's the dream, is you say, here's the meta structure of the 1x1, 2x2, 3x3, 4x4, mxn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3738.333,
    "end": 3757.05,
    "text": " grouping and then we'll learn how many n should be grouped by on how many levels per factor with how many variance retention elements from the SVD and then you say okay well should we retain the same number of SVD variables for every level",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3757.638,
    "end": 3763.646,
    "text": " Or should we open up the possibility that, well, maybe the first level we retain 10, but the second we only retain three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3764.247,
    "end": 3771.577,
    "text": "Again, that might be more expressive if there really was 10 variance contribution in the first level and three in the second, but it's a bigger search base.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3772.378,
    "end": 3776.103,
    "text": "So that's the sort of meta question, but that's cognitive computing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3777.185,
    "end": 3778.186,
    "text": "So it's exciting times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3779.408,
    "end": 3782.532,
    "text": "Figure seven, getting to the performance on the MNIST.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3783.22,
    "end": 3794.76,
    "text": " So figure five, it says in the text, illustrates the results of active learning, but I think here they mean figure seven, during exposure to the first 10,000 training images of the MNIST dataset.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3795.943,
    "end": 3801.332,
    "text": "So in this example, images were assimilated if and only if they increased the expected free energy of the RGM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3802.254,
    "end": 3805.279,
    "text": "In the absence of prior preferences or constraints,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3805.647,
    "end": 3811.296,
    "text": " This ensures minimum information loss by underwriting informative likelihood mappings at each level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3812.198,
    "end": 3816.665,
    "text": "So my question was, does this address the data sampling issue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3817.687,
    "end": 3823.597,
    "text": "It seems like they're selecting from a larger data pool the informative examples which improve the performance of EFE.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3824.658,
    "end": 3827.142,
    "text": "So how much to threshold or how to prioritize that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3827.202,
    "end": 3832.431,
    "text": "How do you deal with a path dependence in training?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3832.833,
    "end": 3837.74,
    "text": " the order of the curriculum of the points that are seen, or does it not matter?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3838.441,
    "end": 3842.327,
    "text": "But for real time and online inference methods, it often really matters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3843.028,
    "end": 3847.534,
    "text": "It's a complex landscape, so if you head out left or head out right, it's gonna make a big difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3848.476,
    "end": 3861.895,
    "text": "And isn't this substituting another possibly quite challenging inference and data selection problem just so that a special smaller RGM can be made?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3861.993,
    "end": 3872.826,
    "text": " So there's gonna be situations where it is worth that entry cost to set up a smart active data sampling method to train a powerful RGM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3873.687,
    "end": 3884.579,
    "text": "There might be another case where that data sampling component is challenging and it's not worth it and there's another simpler way to do it another way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3884.639,
    "end": 3889.705,
    "text": "So of course, in any specific situation, it's an empirical question",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3890.073,
    "end": 3893.116,
    "text": " how these different methods perform.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3893.176,
    "end": 3907.13,
    "text": "And then just again, with these images, figure eight, the thing to note here is classification accuracy increases with a marginal likelihood that each image belongs to the class of numbers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3908.191,
    "end": 3919.202,
    "text": "So here they're showing that their accuracy is very high where they're most confident and their accuracy drops as their confidence drops.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3919.925,
    "end": 3931.161,
    "text": " And from a quick perplexity search, I'll also be curious to see what others have to add, classic shallow machine learning algorithms can easily achieve 97% accuracy on MNIST.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3931.641,
    "end": 3943.738,
    "text": "In 2015, convolutional neural networks approach achieved an error rate of just 0.29%, so 99 plus percent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3944.022,
    "end": 3966.876,
    "text": " So especially at the way that they're presenting it here without code and things like that, keep in mind that it's more of a proof of concept in analytic foundation, not necessarily being described as a computational advance, which would have a lot more details on what was run rather than just saying it was learned automatically within a few seconds on a personal computer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3967.096,
    "end": 3969.479,
    "text": "That's kind of a casual way to describe it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3969.58,
    "end": 3971.262,
    "text": "I think it's very...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3971.326,
    "end": 3976.894,
    "text": " colorful and inspirational, though more assessment would need to be looked at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3976.954,
    "end": 3980.179,
    "text": "How does the fit relate to other methods?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3980.259,
    "end": 3993.839,
    "text": "And so this is a super exciting open source direction to support empirical reproducibility efforts to establish how and when and where different code bases do differently on different datasets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3996.223,
    "end": 3996.643,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3996.663,
    "end": 3999.207,
    "text": "Yeah, 100% just want to echo on the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4002.629,
    "end": 4006.252,
    "text": " It can't just be in a MATLAB script on Carfridson's computer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4006.433,
    "end": 4009.956,
    "text": "It's got to be out there so that we can use it and build on it and understand what's going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4011.337,
    "end": 4017.843,
    "text": "One thing I think that's also worth highlighting is this classification and confidence question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4018.604,
    "end": 4021.347,
    "text": "I'm not sure if the convolutional neural networks will also give you that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4021.607,
    "end": 4028.974,
    "text": "So if they classify something, maybe they just say, oh, I think it's the digit zero",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4029.072,
    "end": 4031.516,
    "text": " And I'm like, 95% confident?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4031.536,
    "end": 4033.319,
    "text": "I don't even know if you get that necessarily.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4033.76,
    "end": 4042.194,
    "text": "I think maybe you get something that's a pseudo confidence number on a scale between zero and one, but it's not really confidence in the same way that this is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4042.234,
    "end": 4047.362,
    "text": "This is like, you've got a probability distribution and you can do a credible interval on it if you want.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4048.164,
    "end": 4052.11,
    "text": "So I think that's something to really highlight, the explainability",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4052.866,
    "end": 4060.256,
    "text": " is often in many cases worth swapping a few percentage accuracy points so that you know why your algorithm has suggested something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4060.597,
    "end": 4067.666,
    "text": "Yeah, earlier work by a lot of those authors have highlighted that true element of interpretability and uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4068.147,
    "end": 4081.405,
    "text": "For example, in a LLM today, even if it does say something like, I'm not sure about X, that string, I'm not sure about X, was actually achieved as a high confidence outcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4081.975,
    "end": 4089.15,
    "text": " And so it doesn't actually reflect an introspection of the uncertainty intervals on x.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4089.94,
    "end": 4090.861,
    "text": " fun topics to go into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4090.881,
    "end": 4093.605,
    "text": "Okay, that was the first example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4093.965,
    "end": 4098.691,
    "text": "Now we're gonna go faster through the next examples because they're structured much the same way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4098.711,
    "end": 4102.856,
    "text": "It's just each of these following examples is gonna bring in a new dimension.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4103.517,
    "end": 4107.362,
    "text": "So the next dimension is gonna be video compression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4107.982,
    "end": 4115.792,
    "text": "Generalize the renormalizing procedures of the previous section to include dynamics for recognizing and generating ordered sequences of images.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4116.453,
    "end": 4119.677,
    "text": "So video is sequence of images.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4120.383,
    "end": 4131.518,
    "text": " Also algorithm one has the fast structure learning, even just copying and pasting this into perplexity and working in cursor from there does amazing things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4131.598,
    "end": 4140.851,
    "text": "So I'm super excited for what people come up with in terms of using the algorithms that are laid out and implementing them in different languages and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4140.871,
    "end": 4148.061,
    "text": "So this section is gonna generalize the static univariate grayscale example of MNIST.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4148.041,
    "end": 4175.263,
    "text": " into an rgb three color three channel plus time time color pixel voxel tuple structure here's where we get to time time wasn't present in the mnist example but by partitioning each sequence into non-overlapping pairs during the time scale transformation at successive levels one effectively halves the length of the sequence when ascending from one level to the next",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4175.328,
    "end": 4180.237,
    "text": " So we talked about different ways to do nesting in time, 60 minutes in an hour, 24 hours in a day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4180.277,
    "end": 4185.506,
    "text": "Here is going to be a strict frequency doubling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4185.526,
    "end": 4194.942,
    "text": "This means that higher levels encode sequences of sequences of sequences, paging exhibit, that can be regarded as episodes of successive events.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4196.585,
    "end": 4197.707,
    "text": "So key idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4197.907,
    "end": 4201.55,
    "text": " State path, state path, state path, encodes transitions through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4202.551,
    "end": 4205.174,
    "text": "And there's this enforced frequency doubling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4205.994,
    "end": 4208.837,
    "text": "So processes are encoded relationally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4210.338,
    "end": 4216.744,
    "text": "Look into something like successor representation learning or cue learning to see some other approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4219.427,
    "end": 4225.112,
    "text": "During inference, the separation of temporal scales manifests as a particular kind of reactive message passing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4226.02,
    "end": 4229.864,
    "text": " So it's possible to define and use message passing among levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4231.285,
    "end": 4244.859,
    "text": "It could also be possible to provide alternative operations orders, or like in RxInfer, use graphs that have no preset order of updating or other rules for how updating occurs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4245.8,
    "end": 4252.247,
    "text": "Okay, here's where in figure 10, 11, and 12, we get to the example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4252.615,
    "end": 4256.36,
    "text": " We used a short video sequence of a dove flapping her wings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4257.121,
    "end": 4262.89,
    "text": "The original video was downsampled to 32 frames and they describe a little bit more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4263.13,
    "end": 4265.493,
    "text": "They use the same four by four blocking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4266.955,
    "end": 4269.199,
    "text": "So this is key information on the video processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4270.44,
    "end": 4277.29,
    "text": "And it's really exciting to think about what they do to these file formats",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4277.455,
    "end": 4299.396,
    "text": " as analytic affordances i found this actually more from the discourse analysis area and rhetoric studies but if we think about the choices and the degrees of freedom that are made in the data processing and meta modeling those are analytical affordances and it relates to how we were talking about you could do inference on those variables",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4299.933,
    "end": 4306.542,
    "text": " And so here we see analogous to the images that were output for the MNIST summaries and performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4307.023,
    "end": 4312.551,
    "text": "Here we similarly have prediction through time of this dove flapping the wings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4312.991,
    "end": 4315.475,
    "text": "It's a cyclic generated video.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4315.655,
    "end": 4329.214,
    "text": "And for example, the stimulus here is just if like a spotlight is only on part of the dove and then it can reconstruct through space at the same moment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4329.346,
    "end": 4335.843,
    "text": " and through time, how it will continue to unfold given the patchy observations that it gets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4336.806,
    "end": 4339.272,
    "text": "So that's the kind of dove video example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4340.315,
    "end": 4349.734,
    "text": " I think there's some background on why does that matter, that you can just do the spotlight thing and recover the original in a way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4350.736,
    "end": 4355.305,
    "text": "So this is a fairly common way of understanding unsupervised learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4356.167,
    "end": 4360.095,
    "text": "Has your algorithm actually understood the data?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4360.075,
    "end": 4374.872,
    "text": " And so masking parts of the image and asking it to infill it is a very common way of testing that what you've got actually understands what's going on and it's not just going to hallucinate anything random.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4374.892,
    "end": 4378.436,
    "text": "So, yeah, when I first came across it, I thought, oh, this is a bit odd.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4378.476,
    "end": 4384.783,
    "text": "But then, yeah, it's worth looking into just as background of like, well, if you have an unsupervised learning technique, how do you know it's actually doing a good job?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4386.08,
    "end": 4410.636,
    "text": " yeah cool okay the next example in the video section in the preceding example the sequence of the image constitutes a closed path namely a simple orbit so it's like a gif of the dove flapping the wings it returns to the same spot and then it continues again this can be regarded as a quantized representation of a periodic attractor in the section paths orbits and attractors",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4411.51,
    "end": 4419.111,
    "text": " They use the same procedures to compress and generate stochastic chaos using images generated by a Lorenz system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4419.131,
    "end": 4426.431,
    "text": "The aim of the example is to show how active learning after structured learning furnishes a generative model of chaotic orbits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4427.17,
    "end": 4436.158,
    "text": " So Lorenz system and active inference is discussed in the four-part series on Livestream 32, Stochastic Chaos and Markov Blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4436.818,
    "end": 4442.083,
    "text": "And here we see an analogous process to the MNIST, analogous to the DOVE.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4442.103,
    "end": 4445.106,
    "text": "We have an image or sequences of images through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4445.766,
    "end": 4449.409,
    "text": "It's traces from this Lorenz chaotic attractor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4450.991,
    "end": 4457.076,
    "text": "Similarly, there's this grouping and reduction operation happening through space and time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4457.427,
    "end": 4474.862,
    "text": " And then parameterization of those models, that's the structured learning followed by parameterization, results in the ability to have, even when there's a gap in the observations, like in figure 15 on the right,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4474.842,
    "end": 4492.075,
    "text": " here we have a gap in the observations but the predictive posterior is able to continue it's an empirical question how well it lines up but this is just really fascinating because it shows well even though the generative process we can say has this chaotic instability",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4492.713,
    "end": 4495.438,
    "text": " that might make it analytically intractable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4495.478,
    "end": 4506.195,
    "text": "From the generative modeling perspective, the RGM enables a really nicely typed way that can accommodate systems that have these chaotic properties.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4506.997,
    "end": 4509.0,
    "text": "What was exciting to you about this part?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4510.938,
    "end": 4513.261,
    "text": " Yeah, exactly that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4513.281,
    "end": 4519.508,
    "text": "It's, you know, chaos is fascinating, and modeling it, famously very difficult.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4521.331,
    "end": 4529.601,
    "text": "So yeah, I think this is actually, I feel like they should be shouting about this more in the paper, in a way, like, maybe they could have opened with this, I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4530.542,
    "end": 4531.663,
    "text": "But",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4531.643,
    "end": 4540.113,
    "text": " I would really like to see some more like actually simpler examples of chaotic systems being modeled in this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4540.693,
    "end": 4542.435,
    "text": "And maybe that could be a separate paper entirely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4543.697,
    "end": 4556.892,
    "text": "But even just, you know, one dimensional signals that change in time that are famously quite chaotic that we don't do a very good job of modeling would be really interesting to see how",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4557.462,
    "end": 4562.529,
    "text": " getting that into an orbit modeling procedure using this would be and see how that goes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4563.13,
    "end": 4565.393,
    "text": "We were very excited to try that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4565.413,
    "end": 4565.773,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4565.834,
    "end": 4566.875,
    "text": "Yeah, totally agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4568.557,
    "end": 4577.77,
    "text": "The next example continuing in the image and video sequence is a bird, so a natural extension.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4578.491,
    "end": 4584.219,
    "text": "Figure 16 illustrates the spatial blocking of a more natural video, a short sequence from this website.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4584.279,
    "end": 4587.283,
    "text": "So that URL was no longer active.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4587.263,
    "end": 4617.068,
    "text": " but either way it was just a search url so it'd be cool to see the exact video maybe it could be uploaded but either way this is a short video of a bird in a natural setting and again figure 17 staying with this theme there's a latent state prediction ongoing even though the stimulus the observation is withheld sometimes so in a way that's like what happens when we blink or have an isocate",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4617.183,
    "end": 4635.488,
    "text": " We have this ongoing posterior prediction of the visual scene, which is what's being experienced or attended to, with color everywhere and equal precision everywhere and all this stuff, including continuity when we blink or have an eye saccade, because it's basically what's happening here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4635.688,
    "end": 4642.137,
    "text": "There's just transiently no stimulus, but still the likeliest thing that's happening is the latent state prediction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4642.717,
    "end": 4645.401,
    "text": "So that last little sequence took us from",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4645.567,
    "end": 4670.106,
    "text": " handwriting static images grayscale into three video settings which was a cyclic oscillatory synthetic video a synthetic chaotic video and then a natural video so you could imagine if this was more structured natural video it would be easier to learn with probably any method",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4670.086,
    "end": 4676.835,
    "text": " If this was a more complex scene with multiple different things switching positions, it would be a harder video to learn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4678.718,
    "end": 4680.44,
    "text": "Any more thoughts on the natural extension?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4681.862,
    "end": 4691.035,
    "text": "Yeah, actually, so if it's trained on this particular video, one thing I wasn't sure is what frames does it predict at the end?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4691.135,
    "end": 4696.442,
    "text": "So we talked about if you miss some frames in the middle, and then it can catch up and keep up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4696.803,
    "end": 4698.625,
    "text": "But if you just run this indefinitely,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4699.533,
    "end": 4702.118,
    "text": " I'm not actually sure what the bird would be predicted to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4702.138,
    "end": 4704.643,
    "text": "And would it just eventually loop back?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4704.843,
    "end": 4710.133,
    "text": "Because it's sort of like if you had that chaotic path in the previous one, it's still in orbit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4710.174,
    "end": 4713.019,
    "text": "It still returns to the same attractor states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4713.235,
    "end": 4717.806,
    "text": " Whereas here, I'm not sure what the bird would do when it's predicted to be doing stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4718.568,
    "end": 4720.392,
    "text": "Maybe it just flies off the screen and we don't see it anymore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4720.472,
    "end": 4721.294,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4721.615,
    "end": 4724.081,
    "text": "It's kind of like a sci-fi simulation to run.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4724.441,
    "end": 4729.433,
    "text": "It's like a sci-fi, like what if it's like the movie's an hour and a half long and then you keep watching.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4729.473,
    "end": 4730.836,
    "text": "It's like, wait, it's still going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4731.117,
    "end": 4731.919,
    "text": "What's happening?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4734.042,
    "end": 4739.227,
    "text": " Okay, the next case that they study is sound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4739.767,
    "end": 4745.033,
    "text": "So the video examples in the prior three were just transitions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4745.393,
    "end": 4747.014,
    "text": "It was an ordered sequence of images.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4747.815,
    "end": 4756.503,
    "text": "Whereas the video more broadly understood like the live stream that you're listening to now is video as image plus audio.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4756.644,
    "end": 4761.248,
    "text": "So here they just kind of leave the video behind and say, let's just look at the audio.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4761.498,
    "end": 4767.019,
    "text": " In this setting, pixels, and there's an analogy for the multimodal LLMs,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4767.337,
    "end": 4777.147,
    "text": " where the tokenization methods that work for natural language in the discrete setting also work for tokenization of image and audio like GPT-4.0.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4777.968,
    "end": 4779.53,
    "text": "So in this setting, pixels, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4779.57,
    "end": 4784.575,
    "text": "picture elements, are replaced by voxels, volume elements over frequency and time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4785.936,
    "end": 4792.483,
    "text": "These constitute time frequency representation of time series or a continuous wavelet transform, CWT.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4793.847,
    "end": 4801.924,
    "text": " Renormalizing generative models for sound are simpler than for video content because there's only one metric dimension, frequency, that accompanies time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4802.906,
    "end": 4811.704,
    "text": "Using a spin block transformation to coarse-grain over frequency reflects the factor assumption that neighboring frequencies fluctuate in a correlated fashion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4812.342,
    "end": 4818.671,
    "text": " So kind of similar data availability setting, URL provided, but unclear what the songs were.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4818.691,
    "end": 4834.435,
    "text": "And then we see the similar visual representations culminating in, for example, 20, where predictions, latent state predictions are able to continue even though part of the stimulus has been redacted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4836.102,
    "end": 4851.45,
    "text": " So it's kind of like a video chat or a phone call and then someone drops out for a few seconds, but you're able to still have your unrolling expectations about what did happen, even though you might be missing some observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4852.051,
    "end": 4855.798,
    "text": "So any comments on this first sound part?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4857.702,
    "end": 4859.127,
    "text": " No, let's carry on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4859.147,
    "end": 4859.388,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4860.351,
    "end": 4861.374,
    "text": "From sounds to music.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4862.377,
    "end": 4867.895,
    "text": "One might ask if RGMs could be applied to language, perhaps in the spirit of hierarchical Dirichlet process models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4868.718,
    "end": 4870.564,
    "text": "We will not address this here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4870.797,
    "end": 4880.748,
    "text": " but provide an application to music to illustrate the generalized synchrony that accompanies communicative exchange, Fristin and Frith 2015, the classic songbird dyad.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4881.589,
    "end": 4893.561,
    "text": "So keep in mind that the birds that are in this dyadic songbird setting, which is also reflected in the 2022 textbook, are literally singing from the same sheet music.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4894.182,
    "end": 4897.986,
    "text": "They have the same single fixed song.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4897.966,
    "end": 4916.481,
    "text": " so it's not modeling the flow of language as conversation at the level of new lexemic information provided like go to the store and get me milk or meta lexemic like prosodic or stylistic elements of language",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4916.849,
    "end": 4925.785,
    "text": " It's a very restricted sense of language, but it's part of the tech tree of building towards models that capture more sophisticated elements of language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4926.406,
    "end": 4931.695,
    "text": "But here is more structured than this sound example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4932.136,
    "end": 4936.123,
    "text": "It'd be interesting to hear some of these songs in their",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4936.222,
    "end": 4938.647,
    "text": " original versions and in their generated versions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4939.309,
    "end": 4944.961,
    "text": "And like, how well does this do from a performance and file size perspective?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4945.202,
    "end": 4947.026,
    "text": "How well does that do to MP3?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4947.647,
    "end": 4949.993,
    "text": "Which is another example of data compression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4950.033,
    "end": 4953.741,
    "text": "And that's exactly like the Gzip and LLM comparison earlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4954.328,
    "end": 4971.578,
    "text": " If at the heart of a variational autoencoder or an RGM or something else is using a structurally determined model as parameterized to have a smaller representation of a larger space, how do these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4972.435,
    "end": 4996.671,
    "text": " physics inspired first principles of intelligence models or classical machine learning and compression related models do are we getting what fraction of compression how good is the performance all these you know can you tune the bit rate all those kinds of questions okay on to the last section from pixels to planning so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4997.883,
    "end": 5007.916,
    "text": " In the final section, we turn to the deployment of RGMs for planning as inference and implicitly their use as synthetic agents and decision makers under uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5008.657,
    "end": 5018.49,
    "text": "So we're getting to the generalized active agents, which is to say the capacity for control and navigation in arbitrary spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5019.263,
    "end": 5025.335,
    "text": " And so here we also see a comparison or juxtaposition of active inference and reward learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5025.816,
    "end": 5030.125,
    "text": "And Ran Wei gave a great guest stream recently on similarities and differences there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5031.307,
    "end": 5037.981,
    "text": "And they make some more comments about how the RGM",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5037.961,
    "end": 5044.27,
    "text": " has relationships with generalized multi-level learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5044.811,
    "end": 5057.028,
    "text": "So now we're kind of briefly dropping any specific case, like a data set of images or video, and just thinking more generally about how this RGM could be used for multi-scale active agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5058.35,
    "end": 5059.151,
    "text": "Any comments?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5063.517,
    "end": 5063.918,
    "text": "No, Scario.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5064.218,
    "end": 5092.116,
    "text": " um procedurally this looks very much like conventional reinforcement learning however it is simpler and more efficient because it learns a compressed representation of and only of paths that link rewarded states so that might have some connections with the inductive behavior paper that they also wrote another way of looking at this is smart data selection that relates to my earlier question of well if you knew which data to select and in what order",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5092.822,
    "end": 5096.847,
    "text": " for free, then maybe the model can be trained effectively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5097.888,
    "end": 5109.141,
    "text": "But if it's a hard problem to determine which data to sample or what order to do it in, then it's just substituting one type of problem for another, which might be effective in a situation, but that's not a general approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5110.022,
    "end": 5122.356,
    "text": "Effectively, this leads to the automatic selection of model structures that can only recognize and predict rewarding episodes, thereby eluding subsequent parameter learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5123.129,
    "end": 5129.898,
    "text": " This rests upon the fact that one does not need to learn how to maximize reward if one has a generative model that can only predict paths that lead to reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5131.32,
    "end": 5140.333,
    "text": "I was a bit uncertain about this because different paths may probabilistically lead to different reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5141.013,
    "end": 5144.278,
    "text": "And then I thought, well, wait a minute, that's just pragmatic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5145.119,
    "end": 5151.668,
    "text": "What about the automatic selection of model structures that can only recognize and predict epistemic information?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5152.357,
    "end": 5163.753,
    "text": " Isn't the expected free energy gonna be able to select data, active data sampling, live stream 57, smart data selection, according to epistemic plus pragmatic value?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5165.255,
    "end": 5166.758,
    "text": "And thereby specify the next action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5167.739,
    "end": 5178.955,
    "text": "Again, reinforcement learning selects the next action based upon highest expected value or reward, but expected free energy has epistemic plus pragmatic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5180.099,
    "end": 5185.588,
    "text": " In what follows, we will illustrate this approach in sequential policy optimization and unpack some of its corollaries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5188.372,
    "end": 5189.213,
    "text": "Games and attractors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5190.035,
    "end": 5197.506,
    "text": "So here, they use simple Atari-like games to show how a model of expert play self-assembles given a sequence of outcomes under random actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5198.909,
    "end": 5201.413,
    "text": "The first simple game in question is the game of Pong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5202.715,
    "end": 5206.14,
    "text": "They describe how they coarse-grain the blocks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5208.044,
    "end": 5214.29,
    "text": " And then they selected frames that started from a successful outcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5216.252,
    "end": 5218.995,
    "text": "So they trained on successful examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5219.195,
    "end": 5223.019,
    "text": "In short, we use rewards for and only for data selections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5223.079,
    "end": 5236.532,
    "text": "That's kind of an interesting possibility that there's a pragmatic filter on training data followed by then an epistemic openness to whatever it is that that data has.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5239.313,
    "end": 5260.242,
    "text": " um and renormalization happened through space and time like the video examples and through the action policy that's the section that we're in here where we're saying in the general case we're also able to do rgm on nested policy but here there was just one time scale of policy um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5261.42,
    "end": 5267.909,
    "text": " figure 25, 26 and 27 go over some of those representations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5268.61,
    "end": 5270.373,
    "text": "So any thoughts on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5273.457,
    "end": 5278.324,
    "text": "Yeah, I think it's the training part is really interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5279.005,
    "end": 5290.06,
    "text": "And what I think maybe possibly as well, we're getting a bit closer as to why they use that C letter for paths, if it's only ever",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5291.305,
    "end": 5299.857,
    "text": " encoding paths that are rewarding, then we sort of go full circle back to the definition in the par textbook of C is like rewards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5301.059,
    "end": 5304.343,
    "text": "It's just rewarded paths rather than rewards of observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5305.505,
    "end": 5307.648,
    "text": "But I think they come onto this later on in the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5308.269,
    "end": 5311.494,
    "text": "This feels like a very brittle way of training a model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5311.934,
    "end": 5318.123,
    "text": "If it only ever encounters positive states or like things that it likes or things that we want it to like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5319.014,
    "end": 5327.983,
    "text": " What happens if you drop it in a situation that it hasn't seen before, where there's a negative state and it has no way to recover back to a positive one?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5328.323,
    "end": 5335.57,
    "text": "So if you think of like for training on a game, if you start in a losing state, how do you bring it back?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5336.01,
    "end": 5336.971,
    "text": "How do you recover?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5338.292,
    "end": 5344.318,
    "text": "So I think that's something that we will come onto later, but it's a really interesting thing to bear in mind of, well, what are you training on?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5344.338,
    "end": 5345.96,
    "text": "Are you only training on success?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5346.26,
    "end": 5347.401,
    "text": "How do you deal with failure?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5347.904,
    "end": 5366.115,
    "text": " yeah great point that also makes me wonder about the transfer applicability so we trained on that bird video but then what if it's the same bird but it's just a little bit darker light or it's a different angle what are the transfer limits or what is it really training on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5366.433,
    "end": 5379.215,
    "text": " And then especially if there's a sort of data filtering or selection to pass data, that is one of the critiques of large data set related training.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5379.255,
    "end": 5383.041,
    "text": "So maybe this uses a subset of it, like a filtered subset,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5383.021,
    "end": 5404.388,
    "text": " since there's already a database of successful and unsuccessful plays just selecting the successful ones and then at the same time there's this interesting biological tie-in which is like the organism's training data through life in a way is all successful with respect to survival",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5405.785,
    "end": 5422.444,
    "text": " so by having the training data only reflect a certain kind of success perhaps with a lot of variability still it it's an interesting question what it learns and how transferable that could be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5423.723,
    "end": 5427.79,
    "text": " And then this is the last of the worked examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5428.611,
    "end": 5433.82,
    "text": "Figure 28 shows the same simulation using a slightly more complicated game based upon Breakout.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5434.381,
    "end": 5444.558,
    "text": "So what's happening in these gameplay settings is gameplay is like a video plus controllable state transitions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5445.66,
    "end": 5449.326,
    "text": "So it'd be like if there was a dove flapping its wings,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5449.458,
    "end": 5453.806,
    "text": " And then also there was another parameter which was lights on or lights off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5454.907,
    "end": 5458.955,
    "text": "And then there's one latent state which is where is the dove's wings really?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5458.995,
    "end": 5466.167,
    "text": "And then how does the dove's wing state get emitted to observations when the light is on or off?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5467.126,
    "end": 5479.87,
    "text": " then that would be like a simple example where the dove does not respond to the light and then a more complex example would be oh it flaps differently in the light and the dark and so that's where you start getting into these factorized models and paths on states on paths and states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5480.643,
    "end": 5489.494,
    "text": " So here they study this game Breakout, where there's, in a way, niche modification happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5490.395,
    "end": 5497.524,
    "text": "It doesn't show any of the cells on the top getting broken, but that would be interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5498.025,
    "end": 5505.635,
    "text": "How does it represent, down into the really fine scale, what numbers represent the presence or absence of a block?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5506.255,
    "end": 5508.338,
    "text": "And how does that really get encoded",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5510.09,
    "end": 5512.915,
    "text": " So any last comments before we go to the conclusion?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5515.76,
    "end": 5518.725,
    "text": "I actually found this example the most difficult to follow in the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5520.809,
    "end": 5532.469,
    "text": "I think it's still not entirely clear to me how this RG operator handles the action inside this as well, and how you...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5532.753,
    "end": 5561.494,
    "text": " coarse grain the effects of action that might happen at a particular time step that then gets sort of diluted out as it were so uh that's just something i think from for this uh for the game section that i'd quite like to ask the authors about is uh to go to a bit more detail on the rg operators when action is happening but that action can only happen on a particular time like uh what's the word uh sort of period as it were uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5562.993,
    "end": 5584.073,
    "text": " yeah also i wasn't sure if these were meant to be empty or if something but then i wondered well is there a natural interpretation of levels one two and three and do these scale separations capture some natural components of the game or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5584.576,
    "end": 5613.57,
    "text": " is there a possibility that by using like a four by four or any n by n or using a strict doubling of time that there's kind of an aliasing where real natural scales of analysis get sort of chopped up strangely with different time scale separations and so then it depends a lot on what spatial temporal scales are divided on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5614.04,
    "end": 5618.306,
    "text": " And then there'd be some training data for some partitionings that would work really well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5618.367,
    "end": 5629.163,
    "text": "Like if you had a ton of good information on the structure of a problem, then maybe one measurement would be all you needed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5629.203,
    "end": 5641.161,
    "text": "Like if you knew the whole class schedule of the university and how all the class beginnings and endings were related, and then someone said, there's a lecture in that hall on Tuesday,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5641.327,
    "end": 5645.375,
    "text": " And then you could have a ton of information about how that was correlated with everything else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5646.216,
    "end": 5659.622,
    "text": "But then if you were studying it on a meter by meter subdivision on a timescale that wasn't related to the timescale of the classes were happening, you might need a ton of data and still be shocked with the next time step.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5660.969,
    "end": 5673.79,
    "text": " So that's just the structure learning challenge, and I think that is the hope and the question, how can automated, semi-automated, and ultimately unified methods for structure learning be applied?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5677.156,
    "end": 5678.418,
    "text": "Okay, conclusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5680.201,
    "end": 5687.533,
    "text": "The paper has showcased several applications of a generative model for discrete state-space approaches based on the renormalization group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5689.522,
    "end": 5693.846,
    "text": " The appeal to the apparatus of the renormalization group is relatively straightforward in the setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5694.287,
    "end": 5704.216,
    "text": "This is because active inference is an application of the free energy principle, which is itself a variational principle of least action, whose functional form is conserved over scales or hierarchical levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5705.738,
    "end": 5711.744,
    "text": "Having said this, the restriction to spin block transformations and pixel spaces could also be regarded as a limitation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5712.264,
    "end": 5713.145,
    "text": "Classic answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5714.847,
    "end": 5718.33,
    "text": "In principle, any outcome space could be a candidate for coarse graining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5720.453,
    "end": 5725.699,
    "text": " How do we know, understand and balance where and when these spin blocks would work or not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5726.2,
    "end": 5745.904,
    "text": "We've discussed and in other conversations, the applicability of the viability of doing sweeps and structure learning and act-inf, on-act-inf, on-act-inf, on-RL, on-act-inf, on-RL and how many layers back before your data science team is just like, I think this is fine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5746.897,
    "end": 5750.961,
    "text": " RGM with quantized paths may or may not be useful in certain application domains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5752.062,
    "end": 5758.148,
    "text": "The applications above illustrate the simplicity and efficiency with which the structure of the models can be learned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5758.928,
    "end": 5760.43,
    "text": "So that's the key claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5760.57,
    "end": 5763.673,
    "text": "That's the key point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5763.693,
    "end": 5769.018,
    "text": "Further limitations of the approach described above rest on the efficiency of the accompanying methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5769.819,
    "end": 5771.901,
    "text": "The efficiency is both a gift and a burden.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5773.002,
    "end": 5774.203,
    "text": "Again, great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5775.837,
    "end": 5782.707,
    "text": " Clearly, in terms of sample efficiency and compression, the schemes described above are designed to outperform conventional learning schemes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5783.768,
    "end": 5788.735,
    "text": "Okay, but designed to outperform is something that anyone can say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5788.815,
    "end": 5794.042,
    "text": "So did they outperform when other learning schemes weren't presented in the paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5795.264,
    "end": 5804.477,
    "text": "This follows because model construction procedure is constructive as opposed to the reductive approach of Bayesian model reduction and related procedures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5805.453,
    "end": 5812.24,
    "text": " enabling the self-assembly of a minimally expressive model to recognize, generate and predict the content at hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5812.388,
    "end": 5817.312,
    "text": " So that's this bottom-up construction through tessellation that we've discussed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5818.073,
    "end": 5835.509,
    "text": "This should be contrasted with the reductive, but not to be confused necessarily with reductionism or reductionist account, but reductive in terms of starting with a large, overly expressive model that's reduced or pruned, minimizing complexity to recover predictive validity and generalization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5835.889,
    "end": 5841.214,
    "text": "So one way to think about that is like in the VAE, the latent space is a bow tie.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5841.194,
    "end": 5868.501,
    "text": " it's smaller in the middle whereas for an image processing neural network you might take in 64 pixels output 64 pixels but then the thickness in the middle is huge so these are the approaches saying well you can kind of have this constructivist approach to building a smaller latent space that's projected down to and then unpacked from that's the vae rgm type style",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5869.342,
    "end": 5892.244,
    "text": " another approach is to start with a massive surfeit of parameters you know 70 billion 405 billion and then use that as a function approximator to fit an approximation to some other function but more generally how could efficiency be a burden um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5893.591,
    "end": 5898.679,
    "text": " They make some more points about learning and skills.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5898.759,
    "end": 5904.207,
    "text": "And this gets to our question about the successful trials for training.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5904.828,
    "end": 5913.141,
    "text": "So these such models are necessarily brittle in the sense they will not recognize or respond to events they have not previously encountered.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5914.583,
    "end": 5916.226,
    "text": "That almost seems like too far to say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5916.246,
    "end": 5921.033,
    "text": "I mean, the MNIST model will be able to respond to a digit it has never encountered.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5921.519,
    "end": 5933.012,
    "text": " It won't be able to respond to a temperature reading because it just doesn't even have that capacity, but it's like out of sample learning or out of structure learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5933.773,
    "end": 5936.295,
    "text": "A useful heuristic here is learning to ride a bike.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5937.697,
    "end": 5945.486,
    "text": "In this kind of procedural learning, we learn from a starting position and accumulate successive cycles of pedaling until we avoid falling completely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5946.066,
    "end": 5949.45,
    "text": "But we do fall and we learn from when we fall.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5949.751,
    "end": 5954.758,
    "text": " In other words, we retain only experiences characteristic of successful bike riding until we can ride fluently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5955.499,
    "end": 5962.129,
    "text": "However, we would not be able to ride a bike starting from any arbitrary state e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5962.149,
    "end": 5962.99,
    "text": "falling over.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5964.532,
    "end": 5968.738,
    "text": "We would have to return to a known starting position to recover our flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5969.815,
    "end": 5979.968,
    "text": " Flow is meant in manifold, which itself is a pun, senses here, the fluency associated with being in the flow, control flow, dynamical flow, and of course, RG flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5981.31,
    "end": 5999.113,
    "text": "So what is really being claimed about what are the situations where successful examples are enough, where negative examples are and aren't learned from or recovered to, and then how well did these methods work within and out of sample",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6000.427,
    "end": 6020.671,
    "text": " After all, that is what the whole question is in training a model is how well do you do on the training and the test for different kinds of out of sample being from really similar, but not in the exact training data itself all the way on through totally different kinds of work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6022.373,
    "end": 6026.258,
    "text": "So we don't know the next steps or implications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6026.418,
    "end": 6028.881,
    "text": "We have a lot of questions and hopefully do too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6030.886,
    "end": 6033.008,
    "text": " What are you looking forward to?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6033.028,
    "end": 6037.353,
    "text": "Or just what are your thoughts having now gone through all this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6037.373,
    "end": 6043.599,
    "text": "Yeah, I'd love to see some code.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6044.08,
    "end": 6047.643,
    "text": "I'd love to see some implementations that we can hack around with ourselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6048.624,
    "end": 6055.071,
    "text": "And yeah, I think it's a really because a lot of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6055.439,
    "end": 6061.552,
    "text": " what's come in the past for Active Inference has been, it's felt very like, I need to write my generative model down on paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6062.394,
    "end": 6068.767,
    "text": "I need to really sit down and think, undistracted, and think, how do I model this problem?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6069.248,
    "end": 6070.11,
    "text": "What are the causes?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6070.29,
    "end": 6071.252,
    "text": "What are the observations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6071.573,
    "end": 6073.617,
    "text": "How might they relate?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6073.968,
    "end": 6077.574,
    "text": " and then I create a function which will generate these observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6077.814,
    "end": 6080.078,
    "text": "And then you can plug it into active inference and go all the way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6080.859,
    "end": 6086.248,
    "text": "But often the hardest part is writing down those A, B, C, D matrices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6087.53,
    "end": 6090.795,
    "text": "It's actually really difficult for lots of people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6090.815,
    "end": 6095.723,
    "text": "You can be a trained physicist and it's still really hard to think, how do I model this problem in the real world",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6095.703,
    "end": 6097.406,
    "text": " in terms of mathematical matrices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6097.806,
    "end": 6098.547,
    "text": "That's really hard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6099.208,
    "end": 6107.44,
    "text": "So in theory, if your RG operators are good enough, and you just you can just chuck some data, maybe it has to all be positive data, all the happy path stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6108.202,
    "end": 6121.221,
    "text": "But that's already quite powerful, I think, and moves, I think, active inference closer to more traditional machine learning in terms of accessibility and ease of use, so that data science teams could just use this in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6123.142,
    "end": 6125.928,
    "text": " does represent quite a significant step forward for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6126.97,
    "end": 6139.155,
    "text": "And I think with all the work that you've done on this channel of just making active inference more accessible and easier to play around with, easier to try in new scenarios, that's such a good thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6139.556,
    "end": 6143.344,
    "text": "So very excited for the future livestream sessions on this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6144.252,
    "end": 6144.734,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6144.754,
    "end": 6153.233,
    "text": "Yeah, great point that how much of the modeling specification",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6154.428,
    "end": 6182.967,
    "text": " today and tomorrow will be manual semi-automated automated like would you just put in the eeg data and just say go for it or how would you embody side information about the eeg problem and then how would it do on training tests and how would it transfer all these different questions so it's great do you have any last comments",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6184.583,
    "end": 6188.687,
    "text": " Uh, yeah, I just think the explainability thing is going to be the key here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6188.707,
    "end": 6195.014,
    "text": "So as soon as you go to unsupervised sort of structure learning, what did those levels mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6195.254,
    "end": 6198.457,
    "text": "And what did those factors mean that it's learned from the data itself?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6199.098,
    "end": 6208.648,
    "text": "If I, if we go the old fashioned route, if I come up with a generative model and I say, this is how I'm modeling the system, I can explicitly say this level, this latent variable is for whether it's raining or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6208.708,
    "end": 6211.671,
    "text": "And this observation corresponds to water observed on the grass outside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6212.444,
    "end": 6219.501,
    "text": " But because I'm coming up with that model, I can use words to communicate that to you, and you have that full explainability of this model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6220.088,
    "end": 6233.06,
    "text": " With this approach, we are going to lose some of that, and it'll be really interesting to see whether we can recover the explainability of, well, what does this factor mean when I did a principal components transformation and ditched half the components?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6233.701,
    "end": 6234.582,
    "text": "What does that actually mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6234.642,
    "end": 6237.425,
    "text": "You can sort of look at it on the MNIST example and go, oh, yeah, it's a digit, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6237.905,
    "end": 6239.667,
    "text": "But we still have to look at that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6240.227,
    "end": 6244.551,
    "text": "So getting that in a semi-automated way would be very exciting as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6244.772,
    "end": 6247.294,
    "text": "Yeah, that makes me think about what",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6247.527,
    "end": 6251.698,
    "text": " natural joints of the world handles for the world will",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6252.573,
    "end": 6257.06,
    "text": " a possibly automated method fail to find?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6258.001,
    "end": 6264.451,
    "text": "And then conversely, what new natural scales might it come up with?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6264.671,
    "end": 6268.156,
    "text": "For example, just doing PCA analysis on natural language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6268.276,
    "end": 6273.965,
    "text": "It's like, okay, principal component one is whether it's happy or sad or whether it's written in this language or that language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6274.045,
    "end": 6279.373,
    "text": "But then you get to principal component seven and it's like, huh?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6279.353,
    "end": 6306.407,
    "text": " does that eigen term mean something with it a little bit more of this and a little bit less of that does that what does that really mean and then the further you go out usually the less reliable those variance components are across different data sets so then that comes back to how do we interpret",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6308.328,
    "end": 6316.592,
    "text": " and set up systems that have few or many, you know, when shorter lists are more interpretable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6317.494,
    "end": 6321.325,
    "text": "But then when you clump under fewer things, they have more",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6321.845,
    "end": 6347.582,
    "text": " grouping of dissimilar things so it's like lumpers and splitters the neets and the scruffies those those are all coming to play right on that field so thank you very much arun and also to blue and to courtney for the contributions to the dot zero so looking forward to the next two weeks peace thanks very much",
    "speaker": "SPEAKER_00"
  }
]