[
  {
    "start": 7.253,
    "end": 8.054,
    "text": " Hello and welcome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9.135,
    "end": 14.342,
    "text": "This is Active Inference live stream 58.1 on November 7th, 2024.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 15.844,
    "end": 17.206,
    "text": "Welcome to the ACT-INF Institute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 17.687,
    "end": 23.695,
    "text": "We're a participatory online institute that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 23.715,
    "end": 25.136,
    "text": "You can find us at links here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 26.338,
    "end": 31.545,
    "text": "This is a recorded and an archived live stream, so please provide feedback so we can improve our work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 32.386,
    "end": 37.092,
    "text": "All backgrounds and perspectives are welcome and will follow video etiquette for live streams.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 37.73,
    "end": 43.386,
    "text": " Head over to ActiveInference.Institute to learn more about live streams and other projects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 45.458,
    "end": 48.923,
    "text": " We are in the second in the 58 series.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 49.724,
    "end": 59.378,
    "text": "Arun and I last week did 58.0 with some background and context, kind of the approach to scratch the surface.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 60.32,
    "end": 67.65,
    "text": "And today we're going to pick it up with Lance and looking forward to this discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 68.011,
    "end": 72.377,
    "text": "So people watching live, please write any live chats.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 72.712,
    "end": 74.595,
    "text": " Arun has also prepared a bunch of questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 75.337,
    "end": 81.026,
    "text": "Let's begin, though, with Lance, if you want to say hi and welcome back.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 82.008,
    "end": 88.78,
    "text": "And then any overviews or any introductions, anything that you feel will help set the table for today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 88.98,
    "end": 89.421,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 90.599,
    "end": 92.622,
    "text": " Well, thank you so much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 92.643,
    "end": 95.027,
    "text": "And thank you so much for having me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 95.828,
    "end": 99.033,
    "text": "So, yeah, I'm super excited about this discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 99.234,
    "end": 103.641,
    "text": "And I feel a lot of us are trying to understand renormalizing generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 103.742,
    "end": 106.867,
    "text": "So I'm sure I'm going to learn a lot as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 109.211,
    "end": 111.314,
    "text": "Yeah, so just to give a little bit of background.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 112.617,
    "end": 116.303,
    "text": "So now Carl Fristen is the chief scientific officer at Versys.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 117.059,
    "end": 127.845,
    "text": " And one of the challenges that we are moving towards, and this is public information, is, of course, scaling active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 128.078,
    "end": 151.842,
    "text": " and uh there's one particular challenge that we're looking at it's uh atari um so for those who don't know atari is just a suite of um of like about 30 31 games uh they've been around for a long time maybe since the 80s or i don't know exactly it's a famous benchmark for reinforcement learning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 151.822,
    "end": 178.234,
    "text": " now there's been a lot of work in rl solving atari and maybe stuff even like 10 years old already that you know solves atari so the question is why are we trying to do that with active inference and the answer is uh all these rl methods they use a lot of data they're super data hungry and they're not uh so they don't have this human level efficiency that that we're looking for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 178.535,
    "end": 182.166,
    "text": " And so that's where active inference could potentially come into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 182.872,
    "end": 191.922,
    "text": " So one of the things that we're looking at at the company is scaling active inference to show that we can solve Atari with human-level efficiency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 193.284,
    "end": 199.671,
    "text": "And so this scale-free approach, planning from pixels, emerged out of these efforts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 200.833,
    "end": 203.095,
    "text": "And this has been work led by Carl.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 204.717,
    "end": 209.082,
    "text": "So he's come up with the ideas and the code and so forth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 209.062,
    "end": 231.913,
    "text": " and um and yeah and and so now we're still pushing with this approach and and other approaches uh so yeah it's uh super exciting and um there's uh many many research questions of things we could explore uh so very excited to discuss it today okay do you want to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 233.125,
    "end": 238.806,
    "text": " Give any connective tissue between some of your previous conversations or papers or streams.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 240.051,
    "end": 243.102,
    "text": "And then we'll jump into the listed questions we have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 244.972,
    "end": 250.318,
    "text": " Sure, so for those who don't know me, so I'm Lance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 250.439,
    "end": 258.388,
    "text": "I've been working on the Principle of Active Inference for a long time, primarily on the mathematical side of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 258.468,
    "end": 265.917,
    "text": "So back when I started, possibly the only person understanding active inference was Carl himself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 265.897,
    "end": 269.844,
    "text": " and a few privileged people around Cal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 270.646,
    "end": 278.36,
    "text": "And so a lot of the work I did was to try to understand things and put them on a more rigorous mathematical footing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 279.402,
    "end": 286.555,
    "text": "And so we've had a few conversations here, a few live streams speaking about some of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 286.535,
    "end": 294.805,
    "text": " So, I would say the RGM work that we're discussing today is a bit different from what I've been working so far.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 294.865,
    "end": 303.515,
    "text": "So, previous work was mostly on the theory of literature principle, theory of actual inference, to read the math.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 303.555,
    "end": 311.645,
    "text": "Today, it's more about a piece of code that does things, and it does really cool things, also has some interesting limitations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 312.626,
    "end": 316.17,
    "text": "And it's a much more pragmatic agenda.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 316.15,
    "end": 345.212,
    "text": " and i'm personally moving in this more pragmatic set of things but i have a lot to learn uh yeah so this is this is how things stand at the moment yes it was live stream 52 on the geometric methods for sampling optimization inference and adaptive agents that was a great and very uh epistemic setting and then also now that i'm seeing it",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 346.508,
    "end": 368.803,
    "text": " also 26 so it was sort of a 26 52 full card lance situation but both of these were some of the clearest and most fundamental papers and unpackings in the series um arun anything you want to begin with or we can just jump into the questions you wrote",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 369.914,
    "end": 374.441,
    "text": " First of all, just to say I need to catch up on those, because they sound great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 375.242,
    "end": 396.276,
    "text": "Also, I think some of my questions are still fairly... I don't want to say towards the end of the paper, they're much more like discussion points, but I don't know if maybe for some people who might not have been able to catch the first session, to maybe go into a very high-level summary of the paper first.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 396.661,
    "end": 402.588,
    "text": " and then set some background that might make the discussion points a bit clearer as they happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 403.889,
    "end": 406.432,
    "text": "But very happy for you to take the lead on that one, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 407.954,
    "end": 408.214,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 408.515,
    "end": 412.62,
    "text": "Lance, what would you say is the overall summary through LINE?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 413.46,
    "end": 415.463,
    "text": "And then we'll turn to the specific questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 417.505,
    "end": 417.785,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 418.566,
    "end": 419.968,
    "text": "So should I give a quick summary or?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 421.822,
    "end": 423.724,
    "text": " Yeah, right, so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 425.286,
    "end": 428.67,
    "text": "Yes, so the problem that we're looking at is planning from pixels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 429.591,
    "end": 433.575,
    "text": "So you have a bunch of pixels and we want to, you know, deep decision making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 435.998,
    "end": 441.745,
    "text": "So for those who are familiar with active inference, there's typically two flavors of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 441.765,
    "end": 443.347,
    "text": "There's the reflexive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 444.368,
    "end": 448.993,
    "text": "Type of active inference where you're not really planning in the future, but you're like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 448.973,
    "end": 454.101,
    "text": " If I infer that I'm in this state, then I should do this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 454.181,
    "end": 456.305,
    "text": "And if I infer I'm in this state, I should do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 457.106,
    "end": 459.83,
    "text": "That's typically what we see in continuous active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 461.252,
    "end": 469.205,
    "text": "And then there's the other flavor of active inference and also sophisticated inference, which is typically in discrete states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 470.287,
    "end": 476.837,
    "text": "And that has planning, that has expected free energy, it has expiration and so forth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 476.817,
    "end": 484.855,
    "text": " And here we are in a setting where we are doing things in discrete states, but we are reflexive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 486.96,
    "end": 491.029,
    "text": "So this is just to situate with the other things that are in the literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 492.173,
    "end": 507.752,
    "text": " and so what happens is we we get a bunch of pixels so yeah just to go back a little bit this is the pixels for planning paper is a way to learn from expert data",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 508.323,
    "end": 521.407,
    "text": " So if I look at expert data of an agent doing something, I'm going to be able to learn that with an RGM and reproduce it in some kind of a habitual reflexive loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 522.59,
    "end": 524.914,
    "text": "But I'm not going to do any kind of de novo learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 527.155,
    "end": 555.897,
    "text": " um and and yeah and so then there's like a very specific um architecture for the rgm generated model uh that allows it to do what it does and there's a way we can you know learn these things but that's kind of like the goal idea or a little context okay awesome yeah just we have the figures if there's any to jump to let's go to the first uh question so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 557.378,
    "end": 583.318,
    "text": " are renormalizability and sparsity linked and also if you could connect that to how else we've seen sparsity discussed in the markov blanket concept what's sparsity in a graphical model how is renormalizability doing something similar or different than the sparsity conditions that we've studied before right um so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 584.682,
    "end": 590.376,
    "text": " Yeah, just to give a bit of context on that question, because you talked about marker blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 591.037,
    "end": 600.42,
    "text": "So, Carl and a number of people have this idea that living systems, and I guess systems in general, are made of marker blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 600.44,
    "end": 602.826,
    "text": "I mean, they are themselves marker blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 603.312,
    "end": 624.443,
    "text": " and so if you take an organism it would be composed for example of organs with their own marker blankets and themselves made of cells with their own marker blankets and you can you know subdivide many many times sort of zoom in and you'll still see marker blankets everywhere",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 625.013,
    "end": 649.907,
    "text": " And so what you get from that, or probably what Carl got from that, is that there is some kind of a spell-free invariance about the nature of things, which is that if you zoom in or if you zoom out, arbitrary zooming or de-zooming, you would still have this kind of fundamental structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 649.887,
    "end": 658.497,
    "text": " And I should say the renormalization group is the mathematical apparatus for zooming in or zooming out on things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 659.945,
    "end": 689.26,
    "text": " and and so basically these are renormalizing generated models they have this um assumption that the world is renormalizable that the world has some kind of a spell free information uh within them and and so we can get more into the details of that but basically long story short is that this renormalization aspect it gives you a very powerful inductive bias on the structure of your journal model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 689.24,
    "end": 698.137,
    "text": " In this case, it gives you this kind of renormalizing genital model, which is a genital model that looks the same at every scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 699.119,
    "end": 706.894,
    "text": "So it's a genital model that if you give it pixel data that's sort of very zoomed in,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 706.874,
    "end": 720.36,
    "text": " That part of the model that feeds that data is going to be the same in terms of its structure than the high-level parts of the model that look at much more coarse-grained features.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 722.095,
    "end": 726.323,
    "text": " And these models are very sparse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 727.244,
    "end": 737.282,
    "text": "Yeah, just because when you look at the representations in the model, there's many, many connections that are missing, but by design on purpose, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 737.623,
    "end": 740.087,
    "text": "So we have a lot of sparsity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 740.067,
    "end": 769.467,
    "text": " uh so it means that they're very lightweight um and yeah i would say that's kind of um the main advantage right uh so when we when we compare with the traditional machine learning architectures this is not to say that you know this approach has a lot of limitations but one one of the strengths is that we we get some very lightweight models that can learn things with a relatively low number of states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 769.447,
    "end": 772.091,
    "text": " And I think that goes back to sparsity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 778.621,
    "end": 783.608,
    "text": "Okay, let's look at the figure and talk about the architecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 790.939,
    "end": 791.32,
    "text": "Maybe...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 792.565,
    "end": 812.481,
    "text": " continue a little bit on what what specifically can can uh where how can we see that renormalization structure in figure three and how does this have similarity and differences than like the textbook generative models that we've worked with",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 813.895,
    "end": 816.738,
    "text": " Right, so so I should say a full disclaimer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 817.479,
    "end": 823.605,
    "text": "I don't think the explanation of renormalizing data models is very clear in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 823.665,
    "end": 836.158,
    "text": "And some will say it's extremely unclear, so I'm going to try to to clear some of that confusion, but there's also part of it where where I'm probably still confused.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 836.178,
    "end": 840.623,
    "text": "So apologies in advance if I cannot clear all the confusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 842.845,
    "end": 843.025,
    "text": "But.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 844.237,
    "end": 855.227,
    "text": " So I can try to describe the figure that you have here, and then I can also give you my own kind of personal summary of genitive models, of renormalizing genitive models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 855.948,
    "end": 865.696,
    "text": "So here we have kind of a classic hierarchical partially observed Markov decision process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 866.737,
    "end": 874.024,
    "text": "And the special feature is that there's a time horizon of one at each layer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 875.708,
    "end": 905.715,
    "text": " um and then you have this renormalizing scale free aspect where as you can see at the bottom level you have two states two actions these are grouped into one state one action at the level above and if you go one level even even further above there's again two states at the level below and two actions that are good to do one state and one action the level above and you can go like that for as many layers as you want",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 905.695,
    "end": 921.06,
    "text": " In the current code, what you do is you specify the number of layers that you want to start with, and then you would kind of learn the transition mappings and so on and so forth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 925.247,
    "end": 933.019,
    "text": "What aspects of the code are available or what languages or timeline for overall applying it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 935.125,
    "end": 940.796,
    "text": " You mean for applying it to machine learning tests?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 940.937,
    "end": 955.345,
    "text": "Or just for any of these settings, what is the code availability or what do you think are the promising ways today and going forward for people who are interested in the open source active inference implementations to work with it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 956.54,
    "end": 967.2,
    "text": " But yeah, so I'm not entirely sure as to the kind of privacy constraints on the code right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 968.222,
    "end": 972.049,
    "text": "I would assume there's a link in the paper pointing to a repo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 972.891,
    "end": 975.396,
    "text": "But if that's not the case, it's not the case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 975.496,
    "end": 975.796,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 976.458,
    "end": 979.864,
    "text": "Well, so I know it's on a private version of SPM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 981.194,
    "end": 989.783,
    "text": " And so if it hasn't been released yet, then there's surely talks inside the company of like when to release it, how to release it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 991.405,
    "end": 994.909,
    "text": "Yes, I'm not exactly sure about the timeline of that, unfortunately.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 995.67,
    "end": 996.631,
    "text": "Okay, all good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 996.651,
    "end": 1007.202,
    "text": "Yeah, I mean, it's an interesting meta piece with the research and being able to share that and...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1007.317,
    "end": 1031.485,
    "text": " with this information here from the pseudocode it it gives a lot of the recipe and the anatomy of the uh model but let me just uh is there is there another part of this figure or another figure to continue specifying a little bit more about what's happening or do we want to jump back to the questions",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1032.528,
    "end": 1045.165,
    "text": " Um, yeah, so, uh, there, there's a presentation by, by Tim Ferberlin that, that, um, um, that, and there's a useful slide on, on that presentation, uh, that, that could potentially show.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1045.205,
    "end": 1052.614,
    "text": "I don't know if I can share my screen here, but I think it would be quite useful to illustrate a bit more in detail what's going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1052.935,
    "end": 1053.195,
    "text": "Oh yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1053.916,
    "end": 1054.537,
    "text": "Share your screen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1054.757,
    "end": 1058.823,
    "text": "And, uh, let's see if I can do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1059.363,
    "end": 1060.645,
    "text": "This is a new computer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1062.346,
    "end": 1074.73,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1074.75,
    "end": 1077.756,
    "text": "Yeah, unfortunately, I'm not going to be able to do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1079.845,
    "end": 1083.553,
    "text": " I mean, I could, but I need to fiddle with the settings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1083.673,
    "end": 1084.855,
    "text": "Or you could email it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1084.875,
    "end": 1085.998,
    "text": "And I don't have admin rates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1086.318,
    "end": 1086.619,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1086.639,
    "end": 1092.932,
    "text": "You could email any slides if you wanted to admin.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1092.952,
    "end": 1096.74,
    "text": "Yeah, I'll check and I'll get back to you on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1096.76,
    "end": 1098.664,
    "text": "But I'm happy to explain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1098.644,
    "end": 1115.674,
    "text": " yeah continue what i was going to show so the idea and and here i'm going to have to wave my hands a bit but hopefully it's clear so um you get some pixel data you get a movie but basically that's what",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1115.654,
    "end": 1126.367,
    "text": " You get a movie of an agent doing something, and you're going to learn a generative model that learns that and is able to reproduce the agent in the movie.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1126.787,
    "end": 1131.393,
    "text": "So it's able to learn its actions and reproduce its actions depending on the state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1132.334,
    "end": 1139.603,
    "text": "So the way it works is you take one frame of the movie and you take the next frame,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1139.583,
    "end": 1145.391,
    "text": " And this would be like your low-level observation for the renormalizing giant model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1145.851,
    "end": 1150.117,
    "text": "So why do we take two consecutive frames as one observation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1150.277,
    "end": 1154.783,
    "text": "Because we want to extract position but also momentum information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1157.266,
    "end": 1160.23,
    "text": "So that's our observation, two consecutive frames.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1161.051,
    "end": 1168.881,
    "text": "Then each frame, we're going to divide it into several overlapping patches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1169.35,
    "end": 1172.141,
    "text": " So this is like a convolutional neural network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1173.185,
    "end": 1180.272,
    "text": "So yeah, you have multiple patches that overlap, each centered, for example, around pixel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1181.348,
    "end": 1199.408,
    "text": " and then each of those patches you do a singular value decomposition which is that you uh you take the eigenvectors you have those pixel vectors you take the eigenvectors and you essentially do a pca",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1199.388,
    "end": 1212.728,
    "text": " And the reason why you do that, so just to give a little bit of context, well, first of all, planning is much easier in discrete states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1214.39,
    "end": 1220.82,
    "text": "So somehow things work a lot better, or at least that's what we think at this moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1222.062,
    "end": 1228.872,
    "text": "So once you convert this kind of like very high dimensional kind of continuous data that are pixels",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1228.852,
    "end": 1238.386,
    "text": " into some more manageable size, low dimensional discrete representation that we can then work with in the RGM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1239.487,
    "end": 1241.47,
    "text": "And so there's potentially many ways you can do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1241.731,
    "end": 1252.446,
    "text": "And one way would be to use a kind of a, for example, a variational autoencoder where you would then discretize the latent space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1252.426,
    "end": 1255.67,
    "text": " that would be one way to get from continuous to discrete.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1256.451,
    "end": 1259.315,
    "text": "There's many, many ways you can do this step.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1260.356,
    "end": 1270.409,
    "text": "The reason why I suppose Carl chose SVD is because it's very lightweight and it's also very, I would say, context sensitive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1271.05,
    "end": 1274.074,
    "text": "If you give one bit of data, it will adapt to that data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1274.755,
    "end": 1277.438,
    "text": "If you give it another bit of data, it will adapt as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1277.418,
    "end": 1282.129,
    "text": " There's arguably also pros to using a deep learning architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1282.51,
    "end": 1284.735,
    "text": "The cons is that it would need to be trained.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1285.557,
    "end": 1287.802,
    "text": "So lots to explore there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1288.825,
    "end": 1290.769,
    "text": "But for now we use SVD.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1291.306,
    "end": 1319.372,
    "text": " and so um so once you've done your your singular value decomposition you get these eigenvectors that um just to get a list of eigenvectors for for each patch that tell you okay well this is like the most important feature in in the patch of pixels this is second most important feature third most important feature and so forth what you do is you truncate that so you take the most important features",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1319.352,
    "end": 1321.716,
    "text": " And then you discretize that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1323.298,
    "end": 1328.186,
    "text": "So it's a lot of stats, I know, so hopefully I can send you a picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1329.167,
    "end": 1342.288,
    "text": "But the point is that you extract the features using SVD, so you get a much lower dimensional representation of the data, and because you truncate it, you kind of eliminate the noise, you eliminate the things you don't care.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1342.268,
    "end": 1350.481,
    "text": " And then this low dimensional thing, which is still continuous because these are eigenvectors, you can discretize it using multiple bins.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1351.603,
    "end": 1352.905,
    "text": "So now you have discrete data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1354.187,
    "end": 1364.023,
    "text": "And once you have your discrete data, then you can fit it to the picture that you have in the slide right there and do your hierarchical NDP, kind of like much more classic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1367.075,
    "end": 1368.356,
    "text": " Yeah, awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1368.376,
    "end": 1376.384,
    "text": "Yeah, in the .Zero, we talked a little bit about that process, about going from the continuous to the discrete to enable planning over the discretized form.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1376.624,
    "end": 1377.545,
    "text": "Arun, go for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1379.006,
    "end": 1380.868,
    "text": "Yeah, thanks for that summary, Lars.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1380.888,
    "end": 1383.59,
    "text": "It was really clear and informative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1384.812,
    "end": 1393.96,
    "text": "One question I have just to follow up on that is something you said quite early on, which is that planning in the continuous space is really difficult.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1394.632,
    "end": 1397.335,
    "text": " Um, could you say a little bit about why that is?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1397.495,
    "end": 1408.788,
    "text": "So the reason I ask is I think it's a very common thing that people would want to do is have an agent that can plan an action to do this thing, but control the degree at which it does it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1409.949,
    "end": 1415.435,
    "text": "So I would like to move, but by a certain amount, how do I choose how much to move in a continuous distance?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1416.216,
    "end": 1421.382,
    "text": "So I guess maybe could you say a little bit about why it's so difficult to plan in continuous space?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1422.273,
    "end": 1424.195,
    "text": " It's a really good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1426.397,
    "end": 1429.581,
    "text": "So planning is always about doing things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1431.002,
    "end": 1435.206,
    "text": "So when I talk about planning, I don't talk specifically about action selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1436.207,
    "end": 1441.433,
    "text": "I talk about imagining what will happen in a certain time interval in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1441.473,
    "end": 1450.322,
    "text": "So it means that you're looking at what would happen if I did that in terms of what is the trajectory of what would happen if I did that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1450.302,
    "end": 1455.027,
    "text": " Now, if you're in discrete space in discrete time, you're looking at a sequence of future states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1456.148,
    "end": 1471.064,
    "text": "But if you're in... And so your space of trajectories that you're kind of like planning over is discrete, because it's like possible steps at the next time step, and then times possible step at the next time step.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1471.084,
    "end": 1472.705,
    "text": "So it can be huge, but it's discrete.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1473.686,
    "end": 1479.212,
    "text": "When you're in continuous space, if you wanted to plan in a certain time interval in the future,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1479.783,
    "end": 1485.632,
    "text": " you're looking at trajectories of what would happen if you took a particular trajectory of actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1486.674,
    "end": 1492.042,
    "text": "And so if you're in continuous space, continuous time, the space of trajectories is infinite dimensional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1493.224,
    "end": 1499.614,
    "text": "So I think that's kind of like the, well, it's infinite and totally infinite dimensional, so it's kind of like really bad.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1499.594,
    "end": 1525.315,
    "text": " and yeah and it's probably i mean there are algorithms that kind of do this i'm not really an expert on that but i think that's kind of like the underlying limitation the the fundamental mathematical limitation and so the thing you can do then uh to plan in continuous space continuous time is you abstract away on a discrete space",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1525.295,
    "end": 1526.697,
    "text": " And then you go back down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1526.978,
    "end": 1529.021,
    "text": "And this is what we've been doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1529.041,
    "end": 1534.17,
    "text": "I mean, as you know, in active inference, it's kind of like the hat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1534.651,
    "end": 1537.556,
    "text": "There's probably other ways to do it, but yeah, that's where we're at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1539.198,
    "end": 1543.646,
    "text": "So maybe something just to clarify there is the nature of these infinities, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1543.786,
    "end": 1545.649,
    "text": "So you said infinite dimensional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1546.523,
    "end": 1550.21,
    "text": " but then also it's almost like infinite values for each of those dimensions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1550.53,
    "end": 1554.818,
    "text": "So that's why it gets really explosive in the number of things you have to consider.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1555.96,
    "end": 1567.722,
    "text": "One of the things that we talked about in the dot zero was the path-based formulation and how that seemed to be even more combinations you would have to consider",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1567.702,
    "end": 1591.814,
    "text": " compared to the textbook formulation, where now we're considering paths over states and actions, and there are as many combinations of paths of combining states and action choices, which already sounds quite difficult to solve relative to the toy examples of just what's in the book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1592.094,
    "end": 1594.958,
    "text": "So maybe you could say a little bit about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1596.17,
    "end": 1597.071,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1597.091,
    "end": 1603.58,
    "text": "So just to make sure I'm on the same page with you, what do you mean exactly by the path-based formulation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1605.143,
    "end": 1614.816,
    "text": "So I think it's when we're now... Just figure 4.3 from the textbook is kind of a good touch point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1615.757,
    "end": 1623.308,
    "text": "On the top is the discrete time explicit states and observations at time points are considered.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1624.013,
    "end": 1625.434,
    "text": " Time point one, two, three, four.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1625.995,
    "end": 1636.604,
    "text": "In a continuous time, future time points are only predicted through a Taylor series generalized coordinates expansion, which is something we talked about in 52.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1636.845,
    "end": 1639.547,
    "text": "Or continue from there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1639.587,
    "end": 1647.794,
    "text": "Just wanted to bring in those two textbook figures and how they can be combined in a hybrid architecture that kind of presages what we're talking about today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1649.256,
    "end": 1650.117,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1650.337,
    "end": 1654.02,
    "text": "It's interesting that you bring up generalized coordinates because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1655.283,
    "end": 1667.818,
    "text": " Yeah, when I was mentioning myopic active inference or not using paths, I wasn't specifically referring to generalized coordinates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1668.639,
    "end": 1672.243,
    "text": "Kind of like the more simpler version without the generalized coordinates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1673.104,
    "end": 1677.73,
    "text": "Because you're absolutely right that when you have generalized coordinates,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1677.71,
    "end": 1681.075,
    "text": " you do get trajectories again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1681.115,
    "end": 1699.6,
    "text": "The difference, or one of the differences, is in discrete states you may have a limited computational budget that kind of limits you in several ways, but at least theoretically you can plan infinitely or arbitrarily far ahead in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1699.58,
    "end": 1703.025,
    "text": " even though your beliefs would get very imprecise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1705.108,
    "end": 1715.283,
    "text": "In continuous states, when you have generalized coordinates, you have this notion of encoding implicit trajectories in the future through these Taylor expansions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1715.763,
    "end": 1724.676,
    "text": "But the Taylor expansions are only, by design, only going to be accurate on a very small or small time interval.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1724.656,
    "end": 1736.879,
    "text": " So already, theoretically, if you have only finitely many generalized coordinates, which is what you always have in practice, you are now able to plan very fine the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1736.919,
    "end": 1747.238,
    "text": "This is much more sophisticated than any kind of active inference without the generalized coordinates or the things I was mentioning before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1750.255,
    "end": 1779.891,
    "text": " the yeah one other thing um is so so when you do planning in the sweet states here like comparing multiple trajectories of actions if i remember right but but correct me here if i'm if i'm wrong when you do planning in the continuous state for generalist coordinates so then at the bottom of 4.3 you're always minimizing the gradient of the free energy with your actions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1779.871,
    "end": 1789.965,
    "text": " So even though you plan the trajectories of states in the future, if you did that, you don't plan for sequences of actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1792.713,
    "end": 1810.082,
    "text": " I believe that that's true, or another way to say that is that the continuous time formalization, even if you do have a high degree Taylor series expansion or a lot of generalized coordinates, it isn't explicitly considering counterfactual scenarios.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1810.522,
    "end": 1814.148,
    "text": "Like tree search in chess, it's like seven moves down the road.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1814.789,
    "end": 1819.497,
    "text": "If 1, 2, 3, 4, 5, 6, 7, then 8A, 8B, 8C.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1819.949,
    "end": 1829.845,
    "text": " Whereas in a continuous time expansion, you get one polynomial approximator, but it isn't saying, well, what if time point 12 were different?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1830.406,
    "end": 1845.872,
    "text": "All you could say is something about the statistics of that path as interpolated, but you wouldn't be able to directly make strong guarantees outside of following the gradients around that inferred path.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1848.265,
    "end": 1859.625,
    "text": " So maybe I've mistaken something, but either in one of the points that you've written there, Daniel, or something Lance said, I remember the word reflexive for the continuous time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1859.926,
    "end": 1865.071,
    "text": " Is that what we're saying here is that, yeah, there we go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1865.552,
    "end": 1876.003,
    "text": "Without planning, at least with the continuous time formulation, yes, it's sort of doing something with the expectation of what's going to happen in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1876.443,
    "end": 1878.425,
    "text": "But as you say, it's not considering counterfactuals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1878.486,
    "end": 1885.613,
    "text": "We're not considering if I do this, then this, if I go 10 meters rather than 20 meters, this will happen, etc.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1887.584,
    "end": 1897.78,
    "text": " Yeah, I think it would be interesting if you asked that question to Carl, if he draws the same distinction, but I would totally agree with you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1898.761,
    "end": 1906.133,
    "text": "I would say, so at the beginning I was referring to continuous active inference without the generalized coordinates as being reflexive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1906.954,
    "end": 1913.845,
    "text": "I would say that with generalized coordinates it's still reflexive, but you're right that it's still, it's already much more sophisticated in a sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1916.322,
    "end": 1920.076,
    "text": " Yeah, the generalized coordinates are like a way to bring the depth in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1920.116,
    "end": 1925.877,
    "text": "It's like doing momentum trading on a stock over multiple time scales.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1926.329,
    "end": 1938.366,
    "text": " you're still making an instantaneous decision in the sense you're looking at a vector of the current moment and then looking at different trends and first, second, third, et cetera, higher moments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1938.907,
    "end": 1941.571,
    "text": "However, again, there's not explicit planning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1942.392,
    "end": 1953.568,
    "text": "So this sort of gets into the functional underpinnings of anticipatory behavior and whether anticipatory behavior can be loaded up",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1954.021,
    "end": 1972.317,
    "text": " into a sort of reflexive intuitive moment or and or to what extent it involves explicit tree-based search of branching possibilities yeah totally",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1980.413,
    "end": 1990.606,
    "text": " Okay, but just to close the loop on the sparsity, could we say generative models are defined by their sparsity?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1991.206,
    "end": 1999.897,
    "text": "We're literally talking about some set of random variables, nodes, and their edges, which defines their sparsity conditions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2001.019,
    "end": 2004.984,
    "text": "Any node interpolating between two other nodes is a blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2005.644,
    "end": 2010.15,
    "text": "People often are interested in the agent environment blanket as interface.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2010.13,
    "end": 2023.031,
    "text": " However, taking the graphical model as a Bayes graph itself, we can think about the B matrix here as being a blanket, for example, between these other two nodes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2024.233,
    "end": 2031.565,
    "text": "The sparsity conditions of figure 3 and the, I mean, whatever model you design,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2031.68,
    "end": 2033.703,
    "text": " the connectivity is the sparsity condition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2034.764,
    "end": 2043.396,
    "text": "Renormalization generative models have a special template or recipe for how the sparsity conditions are related within and across levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2053.19,
    "end": 2056.995,
    "text": "Okay, Arun, wanna pick one of these or which one to go to next?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2058.089,
    "end": 2061.814,
    "text": " Um, I actually think the next one is they're sort of roughly in an order.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2063.335,
    "end": 2070.704,
    "text": "Uh, so yeah, I think talking about the RG operators, because it is the really new thing in this paper, what makes a good one?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2073.848,
    "end": 2075.671,
    "text": "What makes a good RG operator?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2077.653,
    "end": 2085.042,
    "text": "So, um, yeah, I mean, I'm assuming if you ask this question, you probably know more about RG operators than I do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2085.832,
    "end": 2090.057,
    "text": " Um, so it'd be interesting to know what you think about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2091.179,
    "end": 2101.212,
    "text": "Um, yeah, to be honest, like, uh, yeah, just, just to give like a comment, um, this is one of the things that I really need to read up on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2102.413,
    "end": 2111.485,
    "text": "Um, Kyle repeatedly says there is this universal aspect to renormalizing the models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2112.123,
    "end": 2120.376,
    "text": " And I agree that there is some part of nature that seems to be scale-free in terms of like these marker blankets at different scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2121.397,
    "end": 2124.582,
    "text": "But to me, there is also a lot of nature that is not scale-free.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2125.323,
    "end": 2128.528,
    "text": "I mean, not everything that you look at is a fractal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2128.508,
    "end": 2132.612,
    "text": " So, in what sense are RGMs universal?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2133.994,
    "end": 2140.381,
    "text": "The super cool thing and surprising thing for me in this paper is that there's a lot of things that you can do with RGMs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2140.401,
    "end": 2141.782,
    "text": "There's a lot of things that you can learn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2142.804,
    "end": 2144.265,
    "text": "I'm not sure to what extent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2144.886,
    "end": 2153.395,
    "text": "I mean, I would really like to know, okay, well, this is one thing that you cannot do with RGMs in terms of like, I cannot memorize this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2153.635,
    "end": 2156.018,
    "text": "Yeah, that's something I'm not sure about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2163.406,
    "end": 2184.537,
    "text": " so maybe i can sort of come back on that uh so i think the use of the svd and effectively principal components analysis and this paper is actually like a really nice introduction to renormalization groups if you don't know what they if you haven't heard of them before uh it's very common in other",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2184.517,
    "end": 2203.791,
    "text": " aspects of more like traditional pattern matching and machine learning and there's loads of good tutorials uh just out on the web we've got a couple linked in the slides uh to explain what it does so i think just saying like to summarize that very quickly pca is uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2204.21,
    "end": 2209.397,
    "text": " you do a transformation on your data to maximize variance amongst particular dimensions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2209.877,
    "end": 2213.522,
    "text": "And then you can do a dimensionality reduction by throwing away the dimensions you don't want.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2214.002,
    "end": 2221.312,
    "text": "So that really neatly leads into the definition of RGMs in this paper, which is the core screening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2222.173,
    "end": 2226.698,
    "text": "It's the critical part is that you are throwing bits away that you think aren't important at particular levels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2227.299,
    "end": 2228.04,
    "text": "And then as you go up",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2230.838,
    "end": 2231.679,
    "text": " into the lower levels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2233.061,
    "end": 2246.656,
    "text": "But I think there's also a lot of talk in this paper about the spin block transformation as well, of how the pixels are sort of blocked up, and then you say, okay, we're going to coarse-grain in space, and also coarse-graining in time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2246.716,
    "end": 2249.259,
    "text": "That's in a couple of the examples in the paper as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2250.42,
    "end": 2253.724,
    "text": "But I guess my question is, particularly on the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2254.025,
    "end": 2260.576,
    "text": " Like, how do we know our core screening is not throwing away actually useful information?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2261.718,
    "end": 2265.885,
    "text": "And how does that relate to the data that we're putting into the training as well?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2266.766,
    "end": 2270.813,
    "text": "I think that's because I know you mentioned before this is all about learning from expert play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2272.035,
    "end": 2278.446,
    "text": "But are we also possibly throwing away some of the expertise when we core screen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2279.928,
    "end": 2280.268,
    "text": " Totally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2281.31,
    "end": 2281.91,
    "text": "Yeah, totally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2281.95,
    "end": 2289.66,
    "text": "I mean, as far as things stand at the moment, this is more of an open question, a research question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2289.68,
    "end": 2306.34,
    "text": "So some of the things that we're doing is testing RGM on different kinds of expert play for different games or for different environments outside of Atari and looking at how well it works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2306.32,
    "end": 2336.327,
    "text": " um so my own take right now is that rgms are pretty good at memorizing uh really a bunch of things a bunch of expert play the well two things um the for for rgms to do well the the game or the environment needs to have some kind of orbits some kind of um orbit structure that um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2336.307,
    "end": 2338.39,
    "text": " Yeah, the RGM would learn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2338.951,
    "end": 2341.315,
    "text": "So that's like one thing that's pretty important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2342.036,
    "end": 2350.29,
    "text": "The main challenge of RGM that we've kind of been looking at or looking into is generalizability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2351.372,
    "end": 2358.764,
    "text": "So one of the things that we show in the paper, which is pretty cool, I think, is this DOVE example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2358.784,
    "end": 2361.488,
    "text": "So we learned this DOVE video with the RGM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2361.89,
    "end": 2388.657,
    "text": " then we occlude the dove and the rgm is able to infer oh um i'm actually so it's going back to its training data it's reconstruction of the training data and reconstructing the dust um so that's one type of generalization that works very well but it kind of highlights um perhaps i mean what seems to be a drawback as well so the rgm",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2388.991,
    "end": 2404.35,
    "text": " uh learns representations of the training data which means that when you expose it to non-training data so such as the dog which is occluded it will go back to training data and be like okay well this is the dog that i saw in my training and so i'm going to reconstruct it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2404.634,
    "end": 2417.185,
    "text": " What if you train it on expert play for a game or expert something for something, and then you initialize the RGM at a different condition?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2418.166,
    "end": 2426.574,
    "text": "So let's say you train the RGM on walking data, some robot walking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2427.194,
    "end": 2433.78,
    "text": "The RGM will learn the orbits of walking, and it will be able to reconstruct the motion and the actions of walking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2433.76,
    "end": 2460.915,
    "text": " but now if you initialize the rgm of like i'm lying flat on the ground it won't be able to stand up to go back on the walking orbit it will infer that it's walking and it would execute the actions of walking even though it's flat on the ground so you can imagine the motion the motion that you get out of it and this is a kind of a generalization aspect where rgms are really lacking",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2460.895,
    "end": 2466.443,
    "text": " is if you're outside of the training data, you're going to infer that you're in your training data when in fact that you're not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2466.483,
    "end": 2468.886,
    "text": "How do you go back to the things that you've learned?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2469.147,
    "end": 2470.448,
    "text": "How do you pick up the orbit?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2472.632,
    "end": 2472.932,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2473.052,
    "end": 2476.677,
    "text": "This definitely came up in the previous one, the point zero as well, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2476.697,
    "end": 2480.743,
    "text": "We're talking about resiliency of models and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2481.382,
    "end": 2486.887,
    "text": " This is, I think, a really interesting question of, yeah, how do you know if you're out of distribution?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2488.749,
    "end": 2497.978,
    "text": "There are other sort of machine learning applications, maybe like kernel density estimation or whatever, where you might say, okay, I've trained on this data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2498.578,
    "end": 2499.579,
    "text": "I get this new data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2500.36,
    "end": 2505.525,
    "text": "Can I compare it to a probability distribution and say, oh, wait, this doesn't look like anything else that I've seen before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2506.866,
    "end": 2509.228,
    "text": "I'm now very uncertain on what to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2509.377,
    "end": 2511.841,
    "text": " Is there a way we could apply those sorts of principles here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2513.984,
    "end": 2515.126,
    "text": "Yeah, I suppose so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2516.568,
    "end": 2525.302,
    "text": "So this would be a very interesting project because, yeah, I mean, this is the main limitation with RGMs right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2526.424,
    "end": 2529.128,
    "text": "And yeah, there's possibly many routes forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2529.168,
    "end": 2531.692,
    "text": "But yeah, at the moment, that's the main challenge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2532.052,
    "end": 2535.638,
    "text": "So taking inspiration from the things that you mentioned would be super promising.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2537.086,
    "end": 2558.925,
    "text": " one way that active inference models at least have a diagnostic is surprise bounded by variational free energy does give you a measure of overall how likely something is apt to be so if you have a training on driving safely",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2559.209,
    "end": 2576.34,
    "text": " then you're minimally surprised by the safe drive you have a measure at least this kind of threat agnostic measure of something different is happening however it's almost a general information theory problem",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2576.675,
    "end": 2582.223,
    "text": " of the space of what you don't know is always going to be so much larger.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2582.263,
    "end": 2584.285,
    "text": "There's always more that you could be surprised by.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2584.366,
    "end": 2594.96,
    "text": "Like for all the combinations of valid English sentences that language models are trained on, there are more combinations of gibberish sequences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2596.082,
    "end": 2605.855,
    "text": "So then how to make something that can weave its way back into the orbital zone",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2606.425,
    "end": 2628.636,
    "text": " or into a zone of control and that's that's where some of the multi-scale architectures and switching architectures come into play because the the variational free energy value itself isn't gonna say what to do when the car is off-road",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2629.612,
    "end": 2640.01,
    "text": " But at least it would be a diagnostic of how, like a kernel density estimator, how similar it is to training information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2644.9,
    "end": 2647.845,
    "text": " Just another thing to bring in as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2647.965,
    "end": 2652.231,
    "text": "I think we're still bringing all the questions in at once, but it's all related and it's all relevant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2653.694,
    "end": 2666.834,
    "text": "The question of how, if we are only training these things on expert play, how can we create resilient agents that can recover from unseen positions to, so quote unquote, get back on the path?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2667.796,
    "end": 2671.802,
    "text": "So I think one of the things that came to my mind when I was reading the paper was that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2672.457,
    "end": 2682.262,
    "text": " If you give it data where it starts off in a losing position and you can show it ways of going, oh, if you are losing, this is how you get to winning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2683.766,
    "end": 2687.496,
    "text": "Then that would become a new potential attractor set.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2687.78,
    "end": 2691.345,
    "text": " that, okay, if I am losing, I can then move to another sets where I'm winning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2692.006,
    "end": 2696.572,
    "text": "So you explicitly give it that journey as data that it sees.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2697.413,
    "end": 2707.206,
    "text": "But then I think we come on to one of my other questions, which is how do we then tell an agent that has learned the structure from the data itself",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2708.148,
    "end": 2710.631,
    "text": " which attractor sets are good and which are bad.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2710.891,
    "end": 2719.562,
    "text": "How do we inject value into these to say, okay, we've given you this data where let's say the self-driving car is a really nice example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2719.922,
    "end": 2720.963,
    "text": "Driving safely is great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2721.764,
    "end": 2725.889,
    "text": "If you are in an accident and you drive off road, this is how you get back onto the path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2727.531,
    "end": 2736.282,
    "text": "But if it's learned the structure of those actions from the data itself, how do we then inject the value that actually driving safely is good and being off-road is bad?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2738.725,
    "end": 2741.609,
    "text": " Yeah, really interesting questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2743.251,
    "end": 2746.636,
    "text": "So I have a few thoughts that I think echo what you said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2746.776,
    "end": 2750.722,
    "text": "I don't have specific solutions, but just to echo what you said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2750.742,
    "end": 2758.793,
    "text": "So for example, in the case of walking, we might ask, OK, well, if we have the training data for a walking agent,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2759.448,
    "end": 2765.697,
    "text": " And somehow the agent is like down, either sitting or lying down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2766.819,
    "end": 2768.381,
    "text": "We should teach it how to stand up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2769.142,
    "end": 2774.27,
    "text": "And then once it's recovered its starting position, we can go back and use the RGM policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2775.411,
    "end": 2776.613,
    "text": "So that's one solution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2777.335,
    "end": 2804.17,
    "text": " um uh yeah going back to to the starting point of the orbit that that works um and but but there are there are challenges so for example and this is maybe a slightly different challenge but also coming back to self-driving cars um a self-driving car is a very very high dimensional system lots of uh moving parts actions uh things that are going on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2804.15,
    "end": 2812.152,
    "text": " So if you give the RGM a lot of driving data or driving safety,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2812.553,
    "end": 2815.296,
    "text": " I'm assuming the RGM would learn it comfortably.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2816.157,
    "end": 2826.028,
    "text": "But now, if you expose it to a new situation it hasn't seen before in the training set, I would assume this would just happen very easily, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2826.088,
    "end": 2832.054,
    "text": "Because we're in a very, very high dimensional space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2832.975,
    "end": 2837.38,
    "text": "When you think about it, it's kind of a personal dimensionality problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2837.36,
    "end": 2840.524,
    "text": " Because you're feeding trajectories to the RGM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2840.724,
    "end": 2844.308,
    "text": "So trajectories or orbits, these are one dimensional objects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2845.61,
    "end": 2851.136,
    "text": "And you're in a state space that can be very high dimensional, for example, in a self-driving car.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2851.717,
    "end": 2860.667,
    "text": "And what you want is to get full coverage of the underlying manifold of state driving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2862.385,
    "end": 2890.62,
    "text": " um and and what you also want is if you're in an unsafe driving situation you want the trajectory that gets you back to the manifold of cell driving so you have these two problems um and and yeah so one problem coming back to the curse of dimensionality is that if you have this extremely high dimensional manifold of slave driving you want to cover it with one-dimensional trajectories",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2890.6,
    "end": 2900.695,
    "text": " The higher the dimension, the harder it's going to be because you're trying to cover a large n-dimensional thing with one-dimensional objects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2901.756,
    "end": 2903.759,
    "text": "Computationally, it's going to be a problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2903.799,
    "end": 2909.928,
    "text": "There's this generalization that doesn't work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2911.41,
    "end": 2916.237,
    "text": "As you said, within data distribution generalization, that's a problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2916.217,
    "end": 2928.96,
    "text": " Because if you give it a lot of data of the driving safety situation, we would want it to kind of extrapolate over all safe scenarios of driving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2930.054,
    "end": 2939.128,
    "text": " And we don't really see that at the moment, or at least maybe it happens, but it could be a challenge in some situations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2939.689,
    "end": 2946.038,
    "text": "And the other one, which is maybe the more fundamental problem, is you have this huge region of driving not safely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2946.098,
    "end": 2948.302,
    "text": "How do you go back to the driving safety situation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2949.103,
    "end": 2952.068,
    "text": "Also, coming back to the example of walking, how does that happen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2952.308,
    "end": 2953.87,
    "text": "And that's also very hard, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2953.91,
    "end": 2955.032,
    "text": "Because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2955.012,
    "end": 2980.8,
    "text": " potentially would want to you know have a trajectory back to the safe situation from every possible starting location but as the state space becomes very large that also becomes very difficult yeah when thinking about all the angles your joints could be in all the muscle energies there might be a very small Zone",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2984.088,
    "end": 3007.851,
    "text": " So how to really think about adaptive active inference agents at the agentic level, and then also more at the systems design level, how could components be robust and adaptive and simplified components doing better on a subtask and then design",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3009.586,
    "end": 3032.488,
    "text": " a composed system where the sort of low energy efficacious operation of the smaller units is designed in a way where they are not dealing with that massive overall computational challenge they're dealing with local computational challenges",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3032.654,
    "end": 3045.23,
    "text": " However, that moves the design challenge to, or moves the functional challenge to design time rather than inference time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3045.27,
    "end": 3049.276,
    "text": "But most morphologies don't walk.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3050.157,
    "end": 3059.148,
    "text": "But if you have one that walks through evolution or whatnot, then it may be a relatively simplified inference problem at runtime.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3059.188,
    "end": 3061.952,
    "text": "However, the challenge is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3062.337,
    "end": 3070.78,
    "text": " Basically figuring out which of those sparsities and message passing schemes would result in tractable node level inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3072.525,
    "end": 3077.899,
    "text": "Otherwise, it would be hard to do on a relevant hardware.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3082.098,
    "end": 3092.896,
    "text": " And adding to that, if I may, so going back to the walking example that you mentioned, and also the generalizing within data distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3092.916,
    "end": 3105.456,
    "text": "So there is evidence, and it's also something that we've encountered empirically, that walking is a chaotic orbit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3105.436,
    "end": 3111.041,
    "text": " Which means that if you, so let's say I'm here and I'm going to take some actions and I walk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3111.942,
    "end": 3118.828,
    "text": "Now, let's say I start from a slightly different, infinitesimally different initial condition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3119.528,
    "end": 3123.151,
    "text": "And I take the exact same actions, I'm going to fall at some point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3124.593,
    "end": 3126.614,
    "text": "And that's like the chaoticity, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3126.634,
    "end": 3135.342,
    "text": "So if you take the same actions, but you start from a different initial condition, you're going to diverge very far away at some point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3135.845,
    "end": 3161.148,
    "text": " And so we have, I think we have this problem in RGM that if we teach the agent to go back to the standing position and then take the RGM policy, if the agent has a slightly different initial condition than what the RGM was trained on, the RGM will infer that it is in the true starting position, even though it's slightly different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3162.089,
    "end": 3165.852,
    "text": "And then it will take the actions of the RGM and it will fall at some point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3165.832,
    "end": 3172.987,
    "text": " So you have this idea that just memorizing just doesn't work in that situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3173.208,
    "end": 3175.232,
    "text": "And yeah, that's also an issue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3178.739,
    "end": 3183.79,
    "text": "So maybe just a small question there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3184.495,
    "end": 3195.493,
    "text": " Is the issue there with the coarse graining part in that a slight change in initial conditions is being thrown away by the PCA and throwing away dimensions early on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3196.514,
    "end": 3209.575,
    "text": "And then when we go back and do the inference, we infer that we are sort of in quote unquote the same place because we've thrown away like something that is actually signal has gone into the noise part of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3212.103,
    "end": 3214.727,
    "text": " Yeah, I imagine that's one way to look at it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3216.11,
    "end": 3235.242,
    "text": "The way I've been looking at it, but I haven't been thinking about it in those terms, is just if your training data is one particular, you know, orbit trajectory and you start slightly different, because you're inferring where you are based on the training data, based on the structure that you've learned,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3235.694,
    "end": 3243.489,
    "text": " You're going to infer that you're on your right trajectory, even though you're not, and you're going to reproduce that, but you're going to land arbitrarily far.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3244.571,
    "end": 3246.996,
    "text": "But yeah, I assume it's the same phenomenon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3248.92,
    "end": 3254.31,
    "text": "This kind of gets to the whole structure determination question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3254.459,
    "end": 3266.873,
    "text": " Um, chaotic systems are sensitive to small changes near critical points, but then there might be another zone of the system that isn't so susceptible to critical points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3266.893,
    "end": 3277.885,
    "text": "So like, let's look at the chaotic attractor example from the paper, um, in figure 13.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3279.991,
    "end": 3287.963,
    "text": " If we were to make a small change while we were out on one of the arms of the attractor, it might not change things that much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3288.724,
    "end": 3295.514,
    "text": "But then there might be some other points where it does lead to taking a bifurcation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3296.395,
    "end": 3306.049,
    "text": "So if you can break up systems so that the coarse graining captures those bifurcations,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3306.316,
    "end": 3323.16,
    "text": " into two discrete categories then it discretizes a continuous chaotic system well but then if you are applying a grid that's incommensurate with what's actually happening",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3323.478,
    "end": 3346.212,
    "text": " then any grid you draw is going to include trajectories that that have radically different outcomes so the overall predictive efficacy or the variance retention of the svd is going to be low like if there's actually two zones in a city",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3346.327,
    "end": 3376.317,
    "text": " they're one mile squared and they have different properties and you have a one mile grid and you actually capture it you you carve nature of the joints or articulate it at the joints but if every block has mixed zoning and all you have is a one mile grid it's that you could do the best placement of your one mile grid but it still is always going to capture something that's kind of mixed and this kind of related to a few of our thoughts and questions like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3377.36,
    "end": 3406.624,
    "text": " how how do we determine what window to use just just from a generic perspective like there was 10 levels in the discretization of a grayscale image or there was a four by four or the mnist images were pre-processed to 32 by 32 pixels and then they were",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3406.942,
    "end": 3425.743,
    "text": " blocked in four by four grids so how much sweeping or how do you do inference on the number of discretizations and then and the window size and all these other features",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3426.5,
    "end": 3455.089,
    "text": " like what kinds of trade-offs computationally do you look for or how many levels of meta modeling do you feel like are relevant to engage in when you could sweep across discretization of n and windows of m and then you could have well window size of six with a discretization of three gives this performance but something so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3455.693,
    "end": 3458.416,
    "text": " How do you even navigate through that combinatorics?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3461.76,
    "end": 3462.501,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3464.202,
    "end": 3465.564,
    "text": "Yeah, really good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3465.604,
    "end": 3479.119,
    "text": "So, yeah, at the moment, it's very much... I mean, because this is very much a new thing, for the moment, these are hyperparameters, and we're very much in the exploratory phase of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3480.348,
    "end": 3482.574,
    "text": " Okay, well, this works and this doesn't work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3483.617,
    "end": 3489.793,
    "text": "I'm assuming for... I'm thinking for the paper, there wasn't much hyperparameter tuning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3489.893,
    "end": 3496.45,
    "text": "It was all powers of two that were chosen and a small number of layers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3496.43,
    "end": 3526.437,
    "text": " um but when you think about it i mean you could uh do renormalization by powers of three powers of four um you could choose to have smaller or bigger patches um increase or decrease the number of patches so there's many things you can be looking at um and i would say that's also a problem that you would get if you were to do structure learning with a genetic model that are not specifically",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3526.417,
    "end": 3528.362,
    "text": " renormalizing terms and models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3529.424,
    "end": 3533.934,
    "text": "You also have the problem of, okay, how many patches, how many layers and so forth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3535.819,
    "end": 3539.768,
    "text": "So this is not a problem that's like specific to this approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3540.254,
    "end": 3552.469,
    "text": " What this approach has, which makes the problem a lot easier, is that there is a lot of interplay between the number of layers and the number of patches, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3552.489,
    "end": 3556.174,
    "text": "So if you choose, I'm going to renormalize by two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3557.195,
    "end": 3566.447,
    "text": "So it means that two states at one level become one state at the next level, and two states at that level become one state at the next level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3566.427,
    "end": 3574.159,
    "text": " This gives you a relationship between the number of states and the number of layers that you have, and also implicitly the number of patches that you have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3575.16,
    "end": 3584.554,
    "text": "So you have this big constraint that comes in Renown Residentiality Models that makes the search a lot simpler than otherwise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3584.534,
    "end": 3595.328,
    "text": " But I think ultimately what you would probably want is to infer, and I think you hinted at that, infer the number of patches and so forth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3595.469,
    "end": 3596.911,
    "text": "Yeah, we're not doing that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3597.051,
    "end": 3598.272,
    "text": "It would be cool to do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3604.2,
    "end": 3613.613,
    "text": "I think another possible thing we could try is maybe start with a budget of this many",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3613.762,
    "end": 3624.304,
    "text": " layers, patches, like basically combinatorics and said, OK, you have this much computational power for understanding this data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3626.409,
    "end": 3633.103,
    "text": "Figure out the best way of allocating that, because at some levels you might have more variability than others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3633.353,
    "end": 3642.184,
    "text": " And maybe you want to allocate your computational budget at the higher abstract levels than you do more so than you want to do at the pixel level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3643.085,
    "end": 3648.071,
    "text": "And perhaps we could learn that from the data itself, given a constraint of this many parameters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3648.772,
    "end": 3650.795,
    "text": "And I think you could probably code that up multiple ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3650.875,
    "end": 3655.26,
    "text": "But one way you could have priors on those hyper parameters, and then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3655.73,
    "end": 3665.268,
    "text": " I think as Daniel suggested in the point zero, do a free energy calculation on that compared to your priors on those hyperparameters and just minimize free energy that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3666.27,
    "end": 3670.338,
    "text": "But you could also probably do a hacky approach as well and just go, well, what gives me the best performance?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3670.619,
    "end": 3672.422,
    "text": "Call it that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3674.596,
    "end": 3679.686,
    "text": " Yeah, and just to kind of echo that and complement that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3679.927,
    "end": 3685.077,
    "text": "So, as you both mentioned, the issue is, well, there's so many hyperparameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3685.097,
    "end": 3687.542,
    "text": "I mean, there's so many quote-unquote, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3687.662,
    "end": 3692.892,
    "text": "Because if we're using general models that we're not, we don't realize there would be even more of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3694.175,
    "end": 3696.199,
    "text": "But even here, we have a lot of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3696.888,
    "end": 3697.77,
    "text": " hyperparameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3698.051,
    "end": 3706.494,
    "text": "And so that's a separate thing that we're also working on, which is, can we infer the structure of the model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3708.019,
    "end": 3710.806,
    "text": "Instead of just saying, oh, well, we have this data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3710.826,
    "end": 3712.872,
    "text": "This is the model that we get.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3712.852,
    "end": 3722.671,
    "text": " I think we need to be recognizing the fact that with limited data, you're always going to be unsure about the resulting model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3723.332,
    "end": 3727.62,
    "text": "And so we need to have probability distributions of the models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3728.41,
    "end": 3739.266,
    "text": " And so, one instance of that is what you mentioned, like, we have probability distribution prior over the number of patches and we optimize that with respect to free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3740.608,
    "end": 3747.077,
    "text": "But we could also have probability distributions over three layers or four layers and so forth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3747.057,
    "end": 3761.137,
    "text": " I think this is where we, this is kind of, I mean, yeah, beyond this paper, but where we need to be going is having uncertainty about the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3761.958,
    "end": 3769.268,
    "text": "And so then if I have uncertainty about the model, I can take actions upon the world that maximize the expected information gain about the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3769.248,
    "end": 3784.668,
    "text": " So I'm going to get data that's maximally informative to refine my beliefs, ultimately converging about the best model of the world, or maybe a set of candidate bests, if there is a fundamental structure where you cannot find which one fits best.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3786.21,
    "end": 3798.006,
    "text": "But the point is, in this approach to structural learning, and I think in every other approach that we have in active improvement so far, we're not recognizing the inherent uncertainty about the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3799.032,
    "end": 3812.355,
    "text": " And so what we're doing in all these structured learning approaches is a kind of... Well, imagine if you have a prior over model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3813.397,
    "end": 3816.602,
    "text": "And if you have data, you have implicitly a posterior over model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3817.78,
    "end": 3831.669,
    "text": " Now this is what I think we need to do and what we're currently doing implicitly by taking the model with the lowest free energy when we actually do that is taking a flat prior over models and then taking the most likely model in the posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3832.771,
    "end": 3838.303,
    "text": "So we're doing this maximum a posteriori estimation when we're optimizing model free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3839.752,
    "end": 3848.634,
    "text": " And yeah, ultimately we want to have a distribution of a model and also recognize that a priori models are more likely than others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3850.719,
    "end": 3854.207,
    "text": "That's funny about having a flat prior over models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3854.408,
    "end": 3857.355,
    "text": "It's almost like return of the frequentism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3857.892,
    "end": 3882.786,
    "text": " all models within this class are equally likely so that's the special case of bayesianism where it sort of anachronistically is frequentist again because then you're selecting the maximum likelihood model structure or weighting model reliance in a portfolio on its",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3883.93,
    "end": 3910.225,
    "text": " maximum likelihood estimation but then rather than using an ml value the the model itself is actually engaging in a bayesian inference process um how about representations of uncertainty within the model like just taking a given architecture as fixed i'm curious about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3911.977,
    "end": 3930.964,
    "text": " how are uncertainties represented there was some discussion of lossless and lossy compression and and do we have any way to to have interpretability of the uncertainties across layers",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3931.687,
    "end": 3938.281,
    "text": " Like, do you find that you can trace those state estimations and uncertainty estimates and they ring true?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3938.301,
    "end": 3950.607,
    "text": "Or once we're past the pixel level, is through the SVD and all of this, are we already in spaces that are not human semantically interpretable?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3953.202,
    "end": 3954.785,
    "text": " Good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3955.026,
    "end": 3969.675,
    "text": "So coming back to one of the points that Arun made, because we do this SVD and we throw away some less relevant components, we are throwing away information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3969.795,
    "end": 3974.164,
    "text": "And so we're always in this lossy compression kind of setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3974.144,
    "end": 3994.077,
    "text": " now what we've done in this paper and also in other experiments is to just try to reconstruct expert play or any other kind of video or agent from the rgm and usually it works pretty well so we as you can see with the dove or with many other examples",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3994.799,
    "end": 4012.066,
    "text": " The RGM does a good job at compressing and reconstructing, but we haven't actually looked into mechanistic interpretability of like this state in the RGM actually encodes this and this state in the RGM actually encodes that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4013.008,
    "end": 4015.592,
    "text": "So that would be interesting to look into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4019.622,
    "end": 4037.682,
    "text": " I think in the MNIST example, there is a little section where it said like, okay, at the very top level, we say there's basically a value per class of digit, which feels very much like, okay, in the intermediate stuff, it's very",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4046.504,
    "end": 4072.528,
    "text": " we're designing a classifier uh it's a i think it's a really interesting question that's not just specific to this paper or to active inference i think it's a semi-supervised also self-supervised learning in general which is how do you interpret that if you're learning the structure of data from the data without anything labeled how do you get that interpretability um and i don't think there's an easy answer to that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4073.47,
    "end": 4102.11,
    "text": " yeah like duh so here at level four okay so so um this this also notes the matrices in this figure are not simple likelihood mappings they're concatenated likelihood mappings from all hidden states at one level to all hidden states and paths at the subordinate level where the sum to one constraint is applied to states each child could be in so we're taking some higher level",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4103.373,
    "end": 4130.595,
    "text": " path trajectory and pulling lower level observations from a probability distribution sum sum to one at that lower level for the child so here at the top level there's 10 states so it's almost like if you came across an alien handwritten text how would you know how many letters there were",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4131.571,
    "end": 4139.942,
    "text": " or if there were several writers with different styles, how would you say how many discrete symbols?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4141.163,
    "end": 4145.409,
    "text": "Because that's kind of like this unstructured or semi-structured learning question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4146.09,
    "end": 4150.996,
    "text": "You have cursive handwriting from a language where you don't know how many discrete symbols there are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4152.057,
    "end": 4159.587,
    "text": "You know there's a discrete compositionality at the level of the word, let's just say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4159.668,
    "end": 4176.875,
    "text": " However, you're getting the raw data and then the pixels to planning in the linguistic case or the phonemes to planning is like, how do you go from a continuous visual or sound data to inference and planning over language production?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4178.397,
    "end": 4187.211,
    "text": "But then you don't know how many discrete elements to have per se.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4187.731,
    "end": 4194.882,
    "text": " But if you can be making a domain specific model, that may not be a relevant question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4195.243,
    "end": 4199.249,
    "text": "You may just be able to say, we know we're gonna get to 10, find me the best 10.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4202.514,
    "end": 4213.772,
    "text": "But it's interesting that the compositionality of the RGM could extend to higher orders of structure",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4215.153,
    "end": 4244.67,
    "text": " with the trade-off that there's just more and more as you continue to expand how many states there can be it doesn't escape the curse of dimensionality it's like swimming in the curse of dimensionality or casting the spell of the curse of dimensionality but at least in a way where the model architecture is going to be able to be implemented using the inference methods that are the same across different scales",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4250.152,
    "end": 4252.555,
    "text": " Quick question on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4252.795,
    "end": 4262.385,
    "text": "Do we think that the PCA part of this could give you a clue as to how many values a particular state could have in a layer?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4262.905,
    "end": 4273.797,
    "text": "I think, Daniel, you had this idea in the point zero of saying, well, maybe we just have as many values a state could occupy that explains 80% of the variance at that level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4274.873,
    "end": 4285.751,
    "text": " So then you could say, then, I mean, we're sort of moving the complexity from this part into construction of the training data, which we should definitely talk about at some point on this call.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4287.274,
    "end": 4291.381,
    "text": "But you could then say, yeah, exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4291.461,
    "end": 4292.723,
    "text": "That's the graph that I wanted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4294.005,
    "end": 4299.835,
    "text": "If we're going to just say, I only need to explain 80% of the variance on this stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4300.169,
    "end": 4301.333,
    "text": " Chuck some training data at it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4301.734,
    "end": 4304.141,
    "text": "And then we say, ah, this training data had like 10 digits.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4304.623,
    "end": 4314.212,
    "text": "And then you basically end up picking 10 values because that explains enough variance in the training data to do the good, a good enough job.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4320.149,
    "end": 4320.791,
    "text": " Yeah, for sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4320.951,
    "end": 4327.667,
    "text": "And I would say that's also implicitly what happens when we're optimizing model free energy, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4327.727,
    "end": 4331.897,
    "text": "Because we're trading off accuracy and complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4331.917,
    "end": 4335.525,
    "text": "And what you're mentioning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4335.505,
    "end": 4340.098,
    "text": " maybe a more deliberate way of saying, well, we have this target.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4342.003,
    "end": 4346.575,
    "text": "What is the minimally complex model to achieve this accuracy target, for example?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4347.658,
    "end": 4350.426,
    "text": "And yeah, that would be super cool to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4351.908,
    "end": 4371.132,
    "text": " I think specifically for more like engineering and industry applications, that would be something that people would be very interested in because, for example, regulators, they don't talk in terms of, oh, your free energy should have lower than this value, and then you can use your model for self-driving cars, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4371.212,
    "end": 4371.792,
    "text": "You're approved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4372.834,
    "end": 4380.463,
    "text": "It's more like, oh, when some kind of accuracy or some kind of explanation of some data about a certain threshold and, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4381.523,
    "end": 4409.539,
    "text": " would be very worthwhile for this kind of application yeah how to how to convert from a sort of model intrinsic currency the way that different structural models are compared with each other or the way that alternative parameterizations are compared within the same active inference model through comparison of their free energy values how to convert that into",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4410.633,
    "end": 4430.768,
    "text": " a value or a currency that matters like an actual risk profile or a cost or a time estimate that's the critical question how does the reliability of the inference translate um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4433.684,
    "end": 4436.888,
    "text": " What would be an interesting way to go, Lance?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4437.069,
    "end": 4441.875,
    "text": "And then for those in the live chat, please feel free to write some specific questions that I'll ask.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4446.081,
    "end": 4449.725,
    "text": "Sorry, specific interesting way to go far away?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4449.866,
    "end": 4453.05,
    "text": "Or just what do you feel like we should continue with?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4453.07,
    "end": 4455.473,
    "text": "Oh, yeah, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4456.921,
    "end": 4480.06,
    "text": " also how do how do others pick up and continue with this work beyond studying the background 11 and a half phds needed to continue with this knowing that better and more advanced open source tools are under active development here and elsewhere but i mean",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4480.934,
    "end": 4491.032,
    "text": " What's the way to engage with this material with the current state, or what are your next plans for how it continues from this pre-print form?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4493.075,
    "end": 4494.818,
    "text": "Yeah, so good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4495.199,
    "end": 4497.643,
    "text": "I think there's already a lot of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4498.298,
    "end": 4500.204,
    "text": " ideas that have come up in this role.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4502.25,
    "end": 4511.599,
    "text": "I think my interesting idea is what Arun mentioned, like using tools from machine learning to improve generalizability in RGMs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4512.76,
    "end": 4537.975,
    "text": " um more broadly my personal take-home message uh because we we've been talking a lot about uh well first of all how our gems work but also what their limitations are so uh this is my understanding is that this is a very new kind of model and there are a lot of limitations um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4537.955,
    "end": 4548.891,
    "text": " But the really cool thing about this paper, and this is why I'm personally excited about RGMs, is this universality claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4550.794,
    "end": 4554.68,
    "text": "The fact that RGMs are super expressive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4554.74,
    "end": 4563.152,
    "text": "You have this one architecture that can learn many, many things that are pixel-based, as we've seen in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4563.132,
    "end": 4582.626,
    "text": " and so this is what we've seen empirically here and in other places then there's the more theoretical reason for why that's the case and I would say that's more of a physics question of like understanding renormalizing groups and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4582.606,
    "end": 4602.471,
    "text": " why the world may be or may not be renormalizable to some extent so I think it would be super cool from a theoretical perspective to have a better understanding of that from an applied perspective so we've seen all these limitations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4602.451,
    "end": 4630.652,
    "text": " um and it was already clear on this call that for each of these limitations we don't know exactly whether it's a fundamental limitation whether the limitation lies from the current implementation or maybe from the current instance of rgns but we can modify them in some clever way to actually overcome the limitation so there's many different places where improvements could come",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4630.632,
    "end": 4639.68,
    "text": " code, the actual structure of the thing, or maybe even the theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4639.74,
    "end": 4643.584,
    "text": "Maybe we need more than renormalizing general models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4643.604,
    "end": 4646.106,
    "text": "Maybe renormalization is not all you need.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4646.126,
    "end": 4646.987,
    "text": "You need something else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4648.168,
    "end": 4659.458,
    "text": "So at the moment, I think we should be looking at where each of those limitations are and how to go forward from there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4659.438,
    "end": 4668.423,
    "text": " The other thing is classical active inference, like the discrete planning, does actual planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4668.664,
    "end": 4674.46,
    "text": "It plans multiple steps ahead and it has this counterfactual aspect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4674.44,
    "end": 4694.389,
    "text": " in rgms you don't have that you just learn the transitions from state to state at each level and then you infer them from the data so you're just like you're like in this uh self-fulfilling prophecy mode where you've seen your training data and you're reproducing that from the rgm",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4695.398,
    "end": 4717.626,
    "text": " And it would be cool to know if you can combine the strength of classical active inference and the RGMs to have some planning at one or multiple levels, some actual planning with information gain to actually help this generalization aspect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4719.428,
    "end": 4740.053,
    "text": " by by improving the model with some you know new relevant data so there's many many uh you know directions this work could be taken in personally the direction i'm most excited in is this idea of a moral uncertainty because in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4741.518,
    "end": 4748.629,
    "text": " So, I mean, a big question in machine learning and also developmental cognitive science is this idea of structure learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4748.709,
    "end": 4751.253,
    "text": "How do you learn the structure of your model of the world?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4751.293,
    "end": 4761.89,
    "text": "Now, there's a lot of papers, evidence, and I think there's also a lot of debate, but one interesting paradigm is this idea of model inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4763.833,
    "end": 4764.133,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4765.447,
    "end": 4786.83,
    "text": " uh the way we've been thinking about structural learning and active inference so far is about optimizing model free energy so we take the model that that has the lowest free energy when we do that we are frequent we are basing in the states and parameters but we are frequentest in the model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4786.81,
    "end": 4796.415,
    "text": " And that goes exactly to what we were saying before, this idea that you have this flat prior and you're doing maximum posterior estimation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4797.538,
    "end": 4803.132,
    "text": "And so we know that being frequent is fine, but this means that you can overfit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4804.833,
    "end": 4826.993,
    "text": " um it means uh yeah basically you're selecting the model structure that overfits that best fits the data and which may overfit you're not recognizing any kind of uncertainty and there's actually a lot of theorems that show that uh with limited data but even unlimited data",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4827.344,
    "end": 4853.487,
    "text": " there's many instances where multiple models could explain the data equally well which means that they would have the same free energy now which one do you pick and and two different models could yield two different decisions so if you're in a real world scenario one model may be you know the true model or what one of the agents have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4853.467,
    "end": 4881.735,
    "text": " the other one would be wrong and could have some you know unsafe decisions being made down the line um so what we want to be moving to is this idea of full model inference not just uh not just map estimation but actually having a full procedure over models and this would be for example a particle approximate posterior where you're entertaining a mixture of models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4881.715,
    "end": 4909.41,
    "text": " and so basically it means that we would be doing Bayesian model averaging for all your of your predictions and yes we want to be moving towards that in my opinion and what this affords which I think is super important is so when you have this uncertainty about models you have this idea of taking actions that maximize the expected information being about your model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4910.825,
    "end": 4933.963,
    "text": " and and so now you can start to learn your model in a self-supervised way and hopefully in a way that also generalizes because you're making this epistemic search that informs your model which we're currently not doing at the moment we're seeking data that's informative for the states and parameters and we're overfitting the model and we want to be moving beyond that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4939.107,
    "end": 4939.608,
    "text": " Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4939.628,
    "end": 4940.909,
    "text": "Yeah, very interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4941.129,
    "end": 4948.258,
    "text": "It's like equivalent to only doing policy selection on pragmatic value is just utility seeking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4949.039,
    "end": 4963.917,
    "text": "So then if the utility of the modeler is model fit, they have entered into a pragmatic only analytic mode that in...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4964.065,
    "end": 4985.348,
    "text": " single-minded pursuit of what appears to be a totally valid defensible analytic goal of accuracy or of data poster posteriori fit ironically produces local overfitting",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4986.121,
    "end": 5012.837,
    "text": " so it's like exactly why we use expected free energy for policy inference because it does have the epistemic value component and then now with this level among portfolios of models it's like we need to remember why we put the epistemic value into the architecture at the base layer because it isn't enough to just have the epistemics at the base layer",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5013.205,
    "end": 5042.166,
    "text": " and then forget about it at the modeler's level there's actually a role for the epistemic value and and also for the lifelong learning whereas in the examples here there was a training phase and then a test phase as opposed to like sleep wake type train and test and updating with online inference",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5042.787,
    "end": 5045.271,
    "text": " like if the rules of the game changed or something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5049.497,
    "end": 5050.198,
    "text": "Yeah, totally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5050.939,
    "end": 5053.342,
    "text": "Yes, you want to be able to handle environments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5054.424,
    "end": 5060.032,
    "text": "Let's say, going back to games, because I guess we love games, but it doesn't have to be games.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5060.913,
    "end": 5063.817,
    "text": "Let's say you're in an environment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5064.134,
    "end": 5088.623,
    "text": " um and you learn how to play the environment you learn the genetic model and then you you get to the end of the level you get to a new level and the environment changes somehow the number of categories changes and so forth you want to be able to handle that in a in a graceful way and you want to be able to handle the inherent uncertainty about the world um so there's a lot of um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5088.603,
    "end": 5092.69,
    "text": " Worked on AI driven scientific discovery.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5093.592,
    "end": 5100.704,
    "text": "And you can argue that, I mean, science is about understanding the mechanisms that generate the data that we have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5100.744,
    "end": 5104.892,
    "text": "And in particular, the mechanisms of cause and consequence, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5105.012,
    "end": 5107.837,
    "text": "What causes what among our leading states?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5108.698,
    "end": 5109.7,
    "text": "So this is like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5110.675,
    "end": 5136.396,
    "text": " a totally uh i mean like an example that all of us can relate of the fact that we have uncertainty about causal structure and we may also have uncertainty about the number of representations uh used to explain a particular data set so let's say i'm i'm a young child or my zoologist and i'm in the forest and i see an animal i've never seen before",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5136.933,
    "end": 5162.788,
    "text": " is that animal part of an existing species that i know or is it part of a totally new species and and there's two hypotheses at this moment i don't have enough data to decide between either of them i'm going to conduct as a scientist experiments well just going back a little bit it means that i have a posterior with two different models that are equally likely or somewhat likely",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5163.663,
    "end": 5171.016,
    "text": " And then I'm going to conduct an experiment to decide whether this animal is part of an existing or new species.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5172.158,
    "end": 5180.153,
    "text": "Which means that to do that, I need to have some notion of what would happen if I did that, like information gain about the model that I'm using about the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5181.702,
    "end": 5211.405,
    "text": " this is like a super simple example of like we fundamentally need that in a for one in a biomimetic agenda of like creating agents that you know resemble us and modeling and so forth also from a statistical perspective of like not overfitting but it's like pretty hard to do in practice how about coming back to one of arun's questions um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5212.567,
    "end": 5241.645,
    "text": " in what ways is time a special dimension we talk about planning through time and and that's intuitive from a folk psychological perspective how does the model handle time similarly or differently about rgms or just in general i mean what what what is time how is it being treated similarly or differently to other dimensions",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5243.701,
    "end": 5245.725,
    "text": " Yeah, good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5245.865,
    "end": 5249.412,
    "text": "I think it's a very fundamental and also physical question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5251.636,
    "end": 5258.368,
    "text": "But just in terms, I mean, very, very simply in terms of the model, time is the only direction that we can control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5259.766,
    "end": 5270.273,
    "text": " I mean, we can't control the flow of time, but we can control the evolution through state-space as time unfolds, and those are actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5271.576,
    "end": 5276.83,
    "text": "Now, one interesting thing about the paper is that we not only renormalize in space,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5276.81,
    "end": 5279.115,
    "text": " in space-space, but we normalize in time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5279.877,
    "end": 5294.852,
    "text": "And so we have this, in the current architecture, this one step ahead actions at each level, time horizon of one, it could also be two or four or whichever you want, as long as it is the same as at each level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5296.351,
    "end": 5317.245,
    "text": " um but yeah the point is we renormalize both in space and time and uh i would be i think this would be a good question for carl of like why is it important to renormalize both in space and time i don't really have a sense for uh why that is but he probably has a very compelling reason for for what that is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5320.094,
    "end": 5323.097,
    "text": " I'll give a little bit of detail as to why I asked the question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5323.137,
    "end": 5326.7,
    "text": "So there's a very technical reason and then there's like a wider reason.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5327.24,
    "end": 5330.944,
    "text": "The very technical reason is to do with the overlapping part that we talked about before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5331.664,
    "end": 5341.513,
    "text": "And I noticed in the paper that doesn't seem to be overlapping time sort of factors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5341.953,
    "end": 5348.599,
    "text": "You go from one state above to generates the initial state at the level below and then a transition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5348.933,
    "end": 5350.134,
    "text": " and then you do the next pair.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5350.575,
    "end": 5353.558,
    "text": "But the pair of observations at the level below don't overlap.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5354.199,
    "end": 5364.07,
    "text": "Whereas in the MNIST example, there were radial basis functions that were like four pixels wide or whatever, but they overlapped, which I thought was really interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5364.23,
    "end": 5372.359,
    "text": "So that was the very technical reason why I asked, oh, is time separate here when the pairs don't overlap as you're doing the renormalization?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5372.693,
    "end": 5378.246,
    "text": " But I think the wider question of why it's interesting is that I don't really understand how you would plan with respect to space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5379.349,
    "end": 5382.275,
    "text": "But as you say, with time, it's the rollout.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5382.576,
    "end": 5387.648,
    "text": "That's the critical dimension of you go, if I do this, then in the future something happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5388.303,
    "end": 5392.168,
    "text": " but my brain doesn't compute what planning would look like in space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5393.469,
    "end": 5400.277,
    "text": "But yeah, we'll definitely ask Carlin the dot too, and probably be just as confused at the end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5402.179,
    "end": 5415.795,
    "text": "That kind of makes me think of a wave propagating out, like in a game of life situation, a wave is propagating out at one click per time step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5416.231,
    "end": 5419.634,
    "text": " So it's moving, it's a wavefront in space-time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5419.675,
    "end": 5429.505,
    "text": "From the surfer on the wave, they're not moving, but then renormalized over space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5429.525,
    "end": 5433.348,
    "text": "It's like, what will happen to that time step at the next time step?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5433.669,
    "end": 5436.552,
    "text": "Well, if the wave's going to hit it or it's going to leave.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5437.713,
    "end": 5442.778,
    "text": "But from the wave's perspective, renormalizing through space-time, it's stationary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5444.497,
    "end": 5473.255,
    "text": " it's a stationary traveling wave that still is treating time in a little bit of a different way than space but for all systems that we're studying in time which basically are the natural systems we can't really get away from it but maybe there's like a hyper time crystal view on some of these systems that spatializes time",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5479.951,
    "end": 5481.375,
    "text": " Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5481.395,
    "end": 5490.139,
    "text": "In some of our last pieces, again, if anyone has questions, feel free to write it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5490.159,
    "end": 5490.38,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5490.64,
    "end": 5494.27,
    "text": "Rex asks, how has the progression been with the Atari challenge?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5494.531,
    "end": 5495.614,
    "text": "Encouraging results?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5497.703,
    "end": 5527.71,
    "text": " um yeah i mean really good question i'm not sure how much i'm able to share um just because of confidentiality issues but i would say um overall it's quite challenging uh definitely very interesting results um many different approaches that are being tried because of course you could i mean you have this rgm approach but there's many other types of generative models that you know you could be exploring for solving this type of task",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5527.69,
    "end": 5539.004,
    "text": " The really interesting question is what kind of structure or structures is sufficiently universal to be able to express any kind of Atari game?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5540.145,
    "end": 5543.289,
    "text": "And the day we solve that, we'll actually have learned a great deal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5544.37,
    "end": 5555.824,
    "text": "At the moment, we have some leads, we have some promising results, but we are still far away from being able to solve all the games with the same structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5555.804,
    "end": 5560.052,
    "text": " So I think there's a very interesting progress in terms of scaling up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5561.294,
    "end": 5572.716,
    "text": "And as always, with these research questions, it is always hard to know, you know, how long we'll need to actually solve the challenge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5578.163,
    "end": 5604.12,
    "text": " yeah maybe just think of the game how children pick up games and calvin ball making up games and what cognitive capacities support the idea like maybe there's a game hanger or high level game",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5605.265,
    "end": 5613.676,
    "text": " virtualizer that then can be like a sandbox for creating games with arbitrary structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5614.277,
    "end": 5618.563,
    "text": "You know, you're going to tell me a number that ends in a seven and then I'm going to do this dance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5618.883,
    "end": 5619.784,
    "text": "It's like, that's our game.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5620.986,
    "end": 5626.353,
    "text": "But because it's a rule set within a space, within a container that's understood.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5626.393,
    "end": 5631.66,
    "text": "And so although generalized coordinates, RGM and so on,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5632.872,
    "end": 5660.061,
    "text": " in theory can go for infinite number of dimensions for any finite system it may only be several levels of generalization or path extraction or just in the example of time even with two time steps per level at some point with time doubling you're talking about a transition that's longer than a lifetime",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5661.205,
    "end": 5664.889,
    "text": " So it becomes a kind of an extraneous inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5665.91,
    "end": 5676.802,
    "text": "And similarly, making it finer scale, you're going to quickly get to the state transitions of walking at a picosecond, which again, don't really matter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5677.783,
    "end": 5690.217,
    "text": "But if there were either automated ways or interpretable human in the loop type ways to say, okay, the SVD is looking pretty",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5691.648,
    "end": 5700.102,
    "text": " pretty uninformative at this small scale and at this large scale.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5701.304,
    "end": 5705.031,
    "text": "Here's the bulk of the mesovariants that we're working with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5705.071,
    "end": 5710.5,
    "text": "Here's the information content across these coarse grainings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5711.088,
    "end": 5714.771,
    "text": " Here's sweeping across different windows and grainings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5715.612,
    "end": 5718.255,
    "text": "This looks like a good graining approach.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5719.275,
    "end": 5722.538,
    "text": "Here's where the meat is to chop up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5723.84,
    "end": 5730.185,
    "text": "And that relates to the focusing the computational resources on where the information content is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5730.205,
    "end": 5740.875,
    "text": "Focus the resources on where there's information to glean and then truncate the model's dimensionality",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5742.155,
    "end": 5744.419,
    "text": " beyond the point of diminishing returns,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5745.985,
    "end": 5775.857,
    "text": " It goes without saying, slash is hard to say sometimes, but that's an extremely different paradigm for fitting small to very large models than coming with a fixed number of parameters of a large model and a fixed data set as much as you can and then colliding the two until you can optimally reproduce the training data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5777.373,
    "end": 5789.337,
    "text": " While there is this element of parameterizing it on training data, in principle, you can just specify generative models and generate synthetic data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5789.577,
    "end": 5791.381,
    "text": "We do this all the time for different models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5792.002,
    "end": 5794.046,
    "text": "You don't have to train them on anything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5794.087,
    "end": 5798.335,
    "text": "You can just make a thermometer in a synthetic room and just let it play.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5800.306,
    "end": 5828.878,
    "text": " So it's just interesting how with these new Lego toolkits and new composabilities that can deal with data and play in that sort of empirical test train mode, but they also lend themselves to a lot more dynamic reconfiguring that I think is the main piece we've been",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5829.483,
    "end": 5856.638,
    "text": " wrestling with which is it gives us more affordances in building and modulating these models but every degree of freedom in the modeler's toolkit is double-edged because it expands the combinatorics of what is possible possibly diminishing the proportion of good solutions",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5856.837,
    "end": 5861.823,
    "text": " but maybe those good solutions get better and better, though they're rarer and rarer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5867.589,
    "end": 5877.5,
    "text": "Just want to come in on a quick point, which I think you've talked about the... at the very high scale, nothing really happens across, you know, beyond a lifetime at the very small scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5877.54,
    "end": 5879.282,
    "text": "You don't want to consider walking on picoseconds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5880.123,
    "end": 5883.267,
    "text": "From a practical point of view, I guess that's going to be very limited by your training data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5883.768,
    "end": 5885.089,
    "text": "So, for example,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5885.069,
    "end": 5889.676,
    "text": " on the spatial point of view, what does a pixel mean in your training data?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5889.936,
    "end": 5898.449,
    "text": "And presumably you have to normalize across all your different samples to be a pixel means the same distance in an image regardless, potentially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5899.03,
    "end": 5913.912,
    "text": "Or do you have to do some sort of pre-processing to mean that you're only ever taking data from the same, pictures from the same camera at the same distance for that to mean the same thing across the different bits of your data?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5914.465,
    "end": 5920.153,
    "text": " Or if they are different, does your model then have to learn that from a structural point of view?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5921.274,
    "end": 5924.258,
    "text": "And then going on the time one, I think that's also quite interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5924.298,
    "end": 5925.72,
    "text": "Maybe it's another reason why it's different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5926.361,
    "end": 5928.223,
    "text": "If you're introducing videos of different lengths.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5929.225,
    "end": 5937.296,
    "text": "So if you say, okay, here's some data where in this particular video, it's 100 frames and this one is 200 frames.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5937.976,
    "end": 5942.903,
    "text": "There's different levels of... You're limited in how...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5943.17,
    "end": 5949.399,
    "text": " far up you can go if you're just going to continually pair and pair and pair if you've only got 100 frames compared to 200 frames.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5950.361,
    "end": 5959.474,
    "text": "So there could be very practical considerations here for the number of levels you can have and what time scale you can operate on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5960.195,
    "end": 5969.869,
    "text": "But then also I think it does beg the question at the very top level, if you've only got like, I think, let's say for the music example in this paper,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5970.946,
    "end": 5988.415,
    "text": " you've if you've got a length of music and you it breaks it down like it was jazz music and you break it down to like notes and bars and potentially you could go up to a movement but you can only go up to the maximum level like length of your like a piece of music",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5989.306,
    "end": 6010.909,
    "text": " that is that you're that you're exposing in the training data you can't go a level above that and that sort of like highest level thing could only really have like one value so you might as well get rid of it so there's some there might be some redundancy at the very top there that you just sort of can always implicitly throw away yeah I think so I mean when",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6012.121,
    "end": 6036.829,
    "text": " yeah um and and when we have the current architectures i mean we always show the the top level as having for example one state or or two states with a transition to another two states but then implicitly you have this um even higher level that has one state uh and that's static but yeah somehow you i mean it doesn't do anything so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6036.809,
    "end": 6044.22,
    "text": " But yeah, there's many things, I guess many questions and many things that can be explored.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6045.362,
    "end": 6054.936,
    "text": "The other thing, another question that I have is, so intuitively, let's say we're thinking, okay, I need to go to work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6054.916,
    "end": 6058.863,
    "text": " I need to take a certain amount of actions to go to work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6059.644,
    "end": 6066.555,
    "text": "Intuitively, when we plan in that setting, there's several actions that happen at the same level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6067.497,
    "end": 6075.49,
    "text": "Or arguably, maybe not everybody's like this, but it's like, I need to go down, I need to take my car.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6075.47,
    "end": 6082.217,
    "text": " and then I need to go up the elevator at the workplace and so forth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6083.519,
    "end": 6093.71,
    "text": "It seems that this plan maybe happens at the same level of abstraction, or like there's many cases where we plan on the same level of abstraction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6093.83,
    "end": 6104.802,
    "text": "And in the current RGM architecture, we just have one step ahead or like a fixed amount of steps ahead that are reproduced at each level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6106.233,
    "end": 6106.828,
    "text": " So,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6109.0,
    "end": 6121.219,
    "text": " Yeah, I mean, you can definitely reproduce the example that I talked about by saying, okay, well, we're going to find, you know, 10 steps ahead at each level, and then it would fit with more complex plans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6121.279,
    "end": 6125.585,
    "text": "But, you know, how can we allow some flexibility there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6125.605,
    "end": 6131.374,
    "text": "Or is there some flexibility that we need for the time horizon at each level?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6131.695,
    "end": 6136.442,
    "text": "Should it be different from one level to another and so forth?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6138.903,
    "end": 6167.509,
    "text": " yeah well it's like the controls in the studio are being explored and fleshed out because you could sweep across different planning horizons or you could plan for the same amount across horizons like just like it's brought up with the when it's connected to the convolutional neural network",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6168.569,
    "end": 6181.221,
    "text": " it talks about how the special case where the likelihood mappings are conserved over groups, one has the discrete homologue of convolutional neural network.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6181.241,
    "end": 6187.507,
    "text": "So if you're just trying to make the best single filter to pass over an image, you have a CNN.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6188.709,
    "end": 6196.416,
    "text": "Whereas if you open it up to different locations of the image having different filters,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6197.054,
    "end": 6198.497,
    "text": " That's the blessing and the curse.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6199.158,
    "end": 6207.436,
    "text": "Now you have that many times larger of a state space, but for problems that have that statistical structure, that would be the way to go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6207.496,
    "end": 6214.911,
    "text": "So that's what motivates this metamodeling question of how would we recognize whether we're in a situation where",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6215.684,
    "end": 6242.974,
    "text": " single filter is better than n number of filters like these are where the modeling questions quickly rise in a way because where our inference hits the metal we know how that's going to happen in terms of bayesian graphical model and variational free energy it's just how",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6243.629,
    "end": 6249.797,
    "text": " to know what level of abstraction to enter into the problem and really what's the purpose of the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6249.857,
    "end": 6261.17,
    "text": "Because it's really easy to set up a situation where the, for example, policy inference is a slam dunk.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6262.192,
    "end": 6268.219,
    "text": "And it's easy to set up situations where the policy inference is hopeless by design.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6268.705,
    "end": 6295.776,
    "text": " so what is that sort of goldilocks zone where if you could curate only the expert gameplay examples and do resemblance modeling but if you already knew who is expert then you already have those traces so it's like just it it's interesting how with a strong floor",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6297.258,
    "end": 6316.819,
    "text": " and grounded in a really low level way to balance accuracy and complexity, we really quickly hit these data science questions about what the analysis is for and what structure the model should be taking on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6318.065,
    "end": 6320.748,
    "text": " Um, okay, in our last minutes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6321.889,
    "end": 6323.33,
    "text": "Okay, another question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6324.632,
    "end": 6326.654,
    "text": "Are any other benchmarks being looked at?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6327.515,
    "end": 6329.196,
    "text": "Or just what kinds of benchmarks?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6329.897,
    "end": 6334.362,
    "text": "Do you think for the open source community would be interesting for us to pursue?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6337.085,
    "end": 6341.229,
    "text": "We've had given from searching and with our gems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6345.213,
    "end": 6345.253,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6347.022,
    "end": 6352.791,
    "text": " With RGMs, so yeah, I mean, there's several things, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6352.831,
    "end": 6355.555,
    "text": "So there could be imitation learning benchmarks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6356.576,
    "end": 6366.771,
    "text": "I think this would be very interesting to go into because arguably this isn't, I mean, the current state of RGMs, it's an imitation learning tool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6367.673,
    "end": 6369.075,
    "text": "It's not really a planning tool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6370.116,
    "end": 6372.921,
    "text": "It's also a compression tool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6374.743,
    "end": 6375.865,
    "text": "In terms of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6377.127,
    "end": 6380.911,
    "text": " So there's Atari.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6383.054,
    "end": 6387.719,
    "text": "But arguably, if we really want to solve Atari, we want to put a planner in the RGM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6387.739,
    "end": 6392.584,
    "text": "So we don't want to learn necessarily from expert data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6392.604,
    "end": 6394.746,
    "text": "We want to learn in a self-supervised way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6395.647,
    "end": 6402.595,
    "text": "And so the very things that we're exploring there, extensions of RGM in various ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6403.587,
    "end": 6423.621,
    "text": " um and then and then you know i mean there's uh there's so many benchmarks out there uh one thing that's interesting for going to atari is mini atari um and then there's uh all the robotic uh benchmarks that i think are quite interesting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6423.601,
    "end": 6435.147,
    "text": " um i mean you probably know uh many many other interesting examples that yeah i think these are the most yeah interesting ones at least from my perspective",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6440.543,
    "end": 6443.906,
    "text": " It also depends on the feature that you're developing, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6443.946,
    "end": 6447.77,
    "text": "So maybe RGNs are particularly good for imitation learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6449.551,
    "end": 6460.362,
    "text": "But if you're in multi-agent active inference, then you probably want to look at multi-agent games or things that require cooperation to solve certain types of problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6461.683,
    "end": 6467.108,
    "text": "Yeah, I would say it's very much open-ended and depending on the strength of the particular approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6478.242,
    "end": 6481.169,
    "text": " Okay, what are your next moves?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6481.369,
    "end": 6487.924,
    "text": "I mean, how will your year proceed and what are you excited for?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6490.329,
    "end": 6496.403,
    "text": "I'm super excited about this model uncertainty thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6497.902,
    "end": 6512.923,
    "text": " this idea of how do we do Bayesian principle models in a way that's fast, fast enough so that we can plan to take actions that improve our model over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6512.903,
    "end": 6537.055,
    "text": " And this is also interesting, I guess, from bridging multiple fields together, because when we look at, for example, the work in computational cognitive science by folks like Dustin Brown, Sam Gershman, they think very much in terms of inferring the model of the world, I mean, the distribution of the models of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6537.035,
    "end": 6541.981,
    "text": " It's not something that we're doing again at the moment, and I think this is a limitation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6543.683,
    "end": 6560.545,
    "text": "When you look at other folks like Yoshua Bengio, who are interested in AI safety and also AI-driven scientific discovery, they also have this uncertainty about models and this Bayesian inference, which is very important and interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6560.525,
    "end": 6574.199,
    "text": " So then when you accept that this is the way that things need to be done, then there's the question of how do you infer, how do you do the Bayesian inference in practice?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6574.94,
    "end": 6580.626,
    "text": "And there's a wide set of tools for doing approximate inference of the models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6581.727,
    "end": 6584.49,
    "text": "It's still a relatively young field, so there's lots of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6584.47,
    "end": 6586.255,
    "text": " improvements to be done there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6586.315,
    "end": 6590.567,
    "text": "Lots of hardcore statistics and machine learning, very deep questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6591.61,
    "end": 6595.901,
    "text": "So this is like one direction that I think is interesting to pursue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6595.921,
    "end": 6600.133,
    "text": "And then once you have that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6600.113,
    "end": 6616.3,
    "text": " working well and by working well I mean you want a method that's able to infer models very fast it doesn't need to be super accurate when you think about humans we typically",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6616.28,
    "end": 6638.136,
    "text": " only have uh you know a few hypotheses about the call structure of something or something in the world so we don't necessarily need to have a super complex approximate posterior models also that would be very computationally complex so we want to look for uh things that are fast and that operate online",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6638.116,
    "end": 6654.476,
    "text": " And so once you have these kind of methods for inference about the model, then putting that into an agent and having the agent learn to know, you know, in a self-supervised way in its environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6655.417,
    "end": 6658.521,
    "text": "And the other challenge for that is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6658.501,
    "end": 6675.008,
    "text": " because you're doing model inference there's no it's not strictly speaking it's not model growing or pruning anymore you're just doing model inference so your space of models is fixed from the outset",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6675.612,
    "end": 6689.31,
    "text": " And so therefore, if you want developmental agents or lifelong learning agents, you want a space of models that can pretty much explain anything the agent would ever encounter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6690.572,
    "end": 6697.08,
    "text": "Or you want a space of models that is able to express anything that the agent would need to survive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6698.309,
    "end": 6720.064,
    "text": " um so you don't necessarily want something that's very incomplete but you want something that's you know a classic model that's pretty expressive but it should also be sufficiently coarse that you're able to do efficient inference on it so you have this trade-off which is very difficult to navigate of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6720.044,
    "end": 6731.088,
    "text": " trying to find a class of models that is universal in some sense, but also sufficiently coarse that you can do things manageably.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6732.01,
    "end": 6738.323,
    "text": "And I think this is where RGMs can potentially be very fruitful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6738.303,
    "end": 6759.552,
    "text": " because they are very expressive and they're also I mean they have very powerful inductive biases this like renormalization aspect that makes your model space a lot smaller than it would be with other methods so this uh yeah this is a one way forward and like particularly excited about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6762.67,
    "end": 6762.99,
    "text": " Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6763.071,
    "end": 6774.906,
    "text": "Yeah, expert learning is kind of the inductive side, and then the creativity and the abduction, and being able to jump to an adjacent possible from what has been induced.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6775.547,
    "end": 6776.228,
    "text": "That's exciting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6776.869,
    "end": 6778.01,
    "text": "Arun?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6779.132,
    "end": 6781.675,
    "text": "And then we kind of have our last thoughts here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6782.448,
    "end": 6788.14,
    "text": " I thought that all of those directions of future research sound really interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6788.861,
    "end": 6800.305,
    "text": "I had a very possibly silly question, which is on when we're talking about learning about structure, are we also learning about potential new actions that an agent could take?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6800.285,
    "end": 6810.676,
    "text": " And I think that ties in with the AI safety part quite nicely of currently in Active Inference, if you come up with your own generative model, as the modeler, I can say, these are the actions available to my agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6810.777,
    "end": 6811.938,
    "text": "It can only do these things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6812.398,
    "end": 6815.001,
    "text": "It has to pick one of those things and it can't do anything else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6815.902,
    "end": 6824.892,
    "text": "But if we're going to learn online about possible actions, like new actions I could take, suddenly now I've learned that I have the choice to drive a car.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6825.547,
    "end": 6839.29,
    "text": " Whereas before I could only walk, then suddenly the range of impacts that I could have me as the agent can have on the world massively increases and is possibly not predicted by the modeler at the time they're creating their agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6840.392,
    "end": 6848.866,
    "text": "So I think that, so yeah, my question is sort of about what type of structure do we want to learn with these new models?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6849.147,
    "end": 6851.25,
    "text": "And does that include actions that an agent could take?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6852.867,
    "end": 6871.264,
    "text": " yeah um i mean really interesting question and um so so i'll give you a couple of thoughts um there is a toby sinclair smith uh which you've probably had had here on the show um he",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6871.244,
    "end": 6883.05,
    "text": " Yeah, he does category theory, and in his latest formulation of structure learning, active inference with category theory, he talks about blankets that change over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6884.293,
    "end": 6888.763,
    "text": "And so this would be this idea of adding or removing actions of observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6888.743,
    "end": 6894.213,
    "text": " So I think that's interesting, and he would probably have some really cool thoughts about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6895.395,
    "end": 6911.663,
    "text": "The other perspective is, let's say you fix the observation space and the action space, and let's suppose that I as a person exist only in a small part of my head,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6911.643,
    "end": 6918.89,
    "text": " And my observations and actions are the information that's coming in and out of this small part of the head.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6919.873,
    "end": 6922.041,
    "text": "Now, when you're a baby, you don't know",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6922.527,
    "end": 6951.69,
    "text": " that you can act on your body right so you don't know that your foot is you and your arm is you but you're gonna learn eventually that there is a very precise mapping from the information that's coming out of your action neuron to what your arm can do and so eventually even though your arm is a latent state you're going to associate moving my arm with an action that you're taking because there is a very precise mapping from your neuron to what the arm does",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6951.67,
    "end": 6972.793,
    "text": " And I think this would be, basically, when you think about it this way, there is maybe a lot of actions that we can lump into the latent states of the environment that we have direct, very precise control over.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6972.834,
    "end": 6975.096,
    "text": "That's the way I'm thinking about things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6981.556,
    "end": 7007.327,
    "text": " yeah that's that's the babbling it's interesting i'm also just thinking of expert video of figure skating but then there that doesn't mean it's safe for a non-expert or there could have been a body position that was safely reached but then if a different object in a different context is so there's so many interesting um fundamental",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7007.628,
    "end": 7027.273,
    "text": " issues and that is the sort of benchmark and reproducibility question is how can we compare models with these radically different forms possibly in the future also radically different substrates solving these problems in different ways such that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7027.642,
    "end": 7038.327,
    "text": " The ways that benchmarks are even conceptualized in terms of like CPU or RAM may only be a constrained way to think about how some of these embodied problems are solved.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7038.627,
    "end": 7062.643,
    "text": " lance thank you for this and all the authors for the work we're very excited to uh talk with carl and others in 58.2 during the applied active inference symposium so good luck with your works see you next time thank you so much thanks everyone",
    "speaker": "SPEAKER_02"
  }
]