[
  {
    "start": 1.82,
    "end": 30.19,
    "text": " hello it's February 22nd 2023 we're in meeting five for cohort three we're in our second discussion on chapter two today we'll be mostly looking at questions from chapter two hearing people's like thoughts on it written or whatever they want to bring up today and then in the last few minutes we'll look ahead to chapter three",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 31.267,
    "end": 53.713,
    "text": " first though wanted to note underneath live meetings on February 27th in five days we will have Thomas Parr join for a live stream hashtag first author so it's at 17 UTC um for likely an hour if anybody wants to join the live stream itself",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 54.419,
    "end": 68.462,
    "text": " then just email active inference at gmail and let us know and we'll add you to the calendar event if you want to watch along live here's the or share it and this is like the watch and the rewatch link",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 69.927,
    "end": 91.058,
    "text": " then if you have any specific questions it could be something that we've already raised or it could be something more general slash personal so just before we jump to chapter two what does anyone think would be interesting or meaningful to ask thomas",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 103.93,
    "end": 132.3,
    "text": " feel free to think about it or type it um here but basically when the day comes it's going to be whoever has um thank you jonathan it's going to be whoever's there in the moment so just email if you want to join on that stream and whichever questions are here slash questions that we've just curated and then if there's time or if anyone is watching live they can put a question in the live chat too",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 133.276,
    "end": 153.394,
    "text": " so um we'll continue to explore like what kinds of engagements with Thomas gianni and Carl are best for the book and everything but this is gonna be a lot of fun okay",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 161.812,
    "end": 164.438,
    "text": " Well, we have many chapter two questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 164.499,
    "end": 175.826,
    "text": "Does anyone have a specific one they want to jump into first or just any chapter two reflection or comment that they want to share?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 176.488,
    "end": 178.673,
    "text": "There's totally time to do that if you want to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 199.19,
    "end": 220.624,
    "text": " okay let's just try to pick off some comments and questions kind of just drawing drawing from the question posterior how does active inference go beyond the recognition that action and perception have the same inferential nature page 24.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 230.392,
    "end": 259.808,
    "text": " do people think so this is probably referring to section 2.4 um how do we go beyond recognizing well maybe perception and learning have a similar inferential nature maybe we can have a unified framework that models perception and action together and maybe they even have a unified imperative i think the simplest answer is they're different parameters",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 261.745,
    "end": 264.337,
    "text": " That's how we move past that recognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 264.759,
    "end": 267.37,
    "text": "They're modeled as different parameters in a unified model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 268.194,
    "end": 270.625,
    "text": "Does anyone want to add another thought or question on that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 284.83,
    "end": 311.158,
    "text": " okay again anyone else want to pick a specific question to go to otherwise we have many that we can come to okay why express potential energy and expected free energy in the space of log probabilities on page 33",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 311.358,
    "end": 334.969,
    "text": " consistent with the notion of potential energy in physics expected free energy is expressed in the space of log probabilities nice question any first thoughts let's look at where it was in the textbook so we're talking about taking the expected free energy of each policy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 337.16,
    "end": 364.99,
    "text": " so equation 2.6 expected free energy over policies that's sharpening our action prior our habits into the action posterior that we're actually going to sample our actions from does anyone want to give a thought on that question",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 367.079,
    "end": 370.903,
    "text": " Yeah, so I'm in one of my math modules.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 370.983,
    "end": 372.765,
    "text": "We're currently studying Bayesian maths.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 373.686,
    "end": 381.555,
    "text": "And one of the benefits of using log probabilities is it makes it easier to calculate derivatives when you're modeling Gaussians.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 382.236,
    "end": 384.679,
    "text": "And a second point was like computational benefit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 385.239,
    "end": 391.947,
    "text": "You might encounter floating point errors when dealing with, I think, marginal evidence, which can be very small for some values.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 392.728,
    "end": 396.732,
    "text": "So calculating the log version of those",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 397.201,
    "end": 402.627,
    "text": " reduces the likelihood of encountering floating-point issues and precision errors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 402.647,
    "end": 406.391,
    "text": "That's what I'm trying to say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 406.411,
    "end": 406.611,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 407.292,
    "end": 407.693,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 408.774,
    "end": 416.102,
    "text": "Yeah, the log is something that's very simple, whether it's log base 2 or ln, the natural log.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 417.123,
    "end": 421.808,
    "text": "It does a lot, and it also has one...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 422.176,
    "end": 444.117,
    "text": " foot in the kind of computational tractability benefits like being able to keep track of small probabilities like if you have 100 options then most of them are going to be small like less than one percent now if you have a thousand options most of them are going to be small like on average less than a tenth of a percent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 444.721,
    "end": 472.77,
    "text": " so as you get many options or probability distributions you want to be able to keep track with high resolution of these very small numbers on real computers so it helps purely pragmatically in the kinds of computers we have today then a little bit more mathematically the log connects to um jensen's inequality and also to um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 473.189,
    "end": 502.403,
    "text": " information theory and self-surprisal and then something that's unpacked a lot more in bayesian physics and less in this textbook itself is like physics uses kind of like gravity is like a self-information not exactly you know read where it's actually connected but it turns out that like the ball rolling to the bottom of the hill to minimize the potential energy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 503.058,
    "end": 516.652,
    "text": " has a lot to do with the, quote, ball rolling to the bottom of the hill of a statistical distribution if we think about self-surprise, self-information in a log probability space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 517.053,
    "end": 517.354,
    "text": "Ali?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 519.865,
    "end": 546.7,
    "text": " Yes, and one more advantage of using log probabilities or more generally to use logs instead of the actual parameters is to convert some of the multiplications to addition and hence trying to convert at least parts of the nonlinearities of the equations to linear equations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 546.68,
    "end": 575.978,
    "text": " In that case, well, of course, we know dealing with linear equations is much more tractable and also much more, I mean, linear techniques has much more developed than just dealing directly with nonlinear equations and nonlinear calculations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 577.004,
    "end": 577.324,
    "text": " Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 577.645,
    "end": 580.71,
    "text": "Yeah, two of the log properties that come into play a lot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 581.591,
    "end": 584.976,
    "text": "And you can go back and forth, like they're used in both directions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 585.978,
    "end": 590.384,
    "text": "Here, log of m times m. So log of 5 times 10.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 590.544,
    "end": 594.871,
    "text": "Log of 50 equals log of 5 plus log of 10.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 595.652,
    "end": 598.677,
    "text": "So you can break multiplication inside of the parentheses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 598.737,
    "end": 603.484,
    "text": "You can break it into two logs with the same a value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 604.072,
    "end": 623.92,
    "text": " analogously if you have like log m minus log n it's the same as log of m divided by n and these kinds of maneuvers and rewritings are used greatly and it turns out that the kl divergence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 624.153,
    "end": 627.256,
    "text": " which is one divergence measure that's used.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 627.316,
    "end": 635.044,
    "text": "So just like you'll know that you're doing better in the least squares, sum of squares, linear regression world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 635.704,
    "end": 639.428,
    "text": "You know that you're doing better when the sum of squares is going down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 640.849,
    "end": 649.738,
    "text": "In the KL divergence world, variational inference world, your model is getting better fit when the KL divergence is going down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 650.09,
    "end": 670.268,
    "text": " Again, there's more detail, but these all are empowered by the ability to have something within a log that's multiplied, which also gives this the interpretation as potentially a self-surprisal, self-information, and then separate that out and do addition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 676.614,
    "end": 679.236,
    "text": "So it has computational benefits.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 679.925,
    "end": 700.988,
    "text": " has statistical benefits and has also a deeper connection to bayesian physics okay again not not okay i'll let you go for it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 702.503,
    "end": 710.796,
    "text": " Sorry, before going into the next question, I just wanted to comment on the previous question, the question number two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 711.758,
    "end": 720.992,
    "text": "Sorry, I raised my hand a little bit later, so you didn't notice, but yeah, about the relation between the perception and action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 721.033,
    "end": 723.837,
    "text": "So very briefly,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 724.12,
    "end": 732.072,
    "text": " Alan Berthoud actually proposes that perception is simulated action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 732.212,
    "end": 740.704,
    "text": "So it basically implies that perception and motion are kind of irreducibly interconnected.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 740.724,
    "end": 749.076,
    "text": "And actually, he also claims that the former, I mean, the perception defines the action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 749.998,
    "end": 751.039,
    "text": "So",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 751.238,
    "end": 757.738,
    "text": " Yeah, it's also another viewpoint, which is way before",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 758.005,
    "end": 762.511,
    "text": " the development of active inference and pre-energy principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 762.591,
    "end": 781.137,
    "text": "But these ideas of the interconnection between the action and perception has been discussed throughout the history of cognitive science, and especially the last few decades in terms of embodied cognition and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 781.478,
    "end": 784.722,
    "text": "But in my view, Alan Berthouze's",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 784.702,
    "end": 808.819,
    "text": " claim about this specific interconnection between perception and action and basically making them equivalent to each other in terms of their, one of which being the simulation of the other is an interesting viewpoint to have in mind beyond the inferential nature of them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 809.71,
    "end": 839.312,
    "text": " nice yeah like even qualitatively we can draw connections with different threads like Helmholtz perception is unconscious inference okay no just save that thank you for that okay now what's the pragmatic turn well that's about in the Bayesian brain it's about thinking about action alongside inference so it's like okay we have Helmholtz perception is unconscious inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 839.95,
    "end": 844.737,
    "text": " Now let's extend that to action and perception as unconscious inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 846.219,
    "end": 864.186,
    "text": "That's still a qualitative idea, and ACNF and FEP are helping us develop quantitative methods that are compatible with those kind of qualitative ways of thinking about perception, cognition, and action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 866.14,
    "end": 885.212,
    "text": " okay upper bound I think we came to last week so what is meant by bounded computational and mnemonic resources anyone have a thought on this or related idea",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 895.148,
    "end": 920.177,
    "text": " this is a great answer just you can write an equation you know 10 to the 10 to the 10 to the 10 to the 10 to the 10 to the 10 power but just because you can write it on a piece of paper doesn't mean that there's like a calculator that has that much ram it might just you know the number of digits that you need to store might be outside of the heat capacity of earth or something like that so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 921.423,
    "end": 927.714,
    "text": " We want to be able to express models in an open-ended way in principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 929.537,
    "end": 946.485,
    "text": "Also, especially if we're talking about what kind of inference is optimal, it's important to take this probably approximately correct approximate Bayesian computation heuristics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 947.714,
    "end": 974.38,
    "text": " angle that respects the actual time space trade-offs that are fundamental for any actual system and any model that we make of a given system like it's not behaving accurately and you know if it remembered every single pixel",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 974.933,
    "end": 1000.958,
    "text": " it's like well yeah but there's not enough space for it to remember every pixel so it might be doing something that's actually very adaptive involving forgetting the vast majority of information and there's there's no trade-off there but if we can only state the models in principle and we don't keep it bounded with the um limitations of real systems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1002.322,
    "end": 1012.836,
    "text": " and the approximate Bayesian computation framework, then, you know, maybe the scripts don't run because, and that's also really, yeah, there's other angles there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1013.197,
    "end": 1015.74,
    "text": "Any thoughts or comments on this, or this is a good answer?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1022.83,
    "end": 1031.822,
    "text": "Also kind of a nice link to mnemonic resources, like Memory Palace.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1032.95,
    "end": 1059.379,
    "text": " like what if you didn't have to remember every single word in the poem but you remembered some nested model where the higher part of the nested model involved touching parts of the environment or walking through an imagined space are the cognitive constraints or challenges associated with those types of mnemonic resources that cue one's action",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1060.979,
    "end": 1080.355,
    "text": " does that have some properties that are beneficial relative to kind of like the naked memory how does active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1084.182,
    "end": 1111.54,
    "text": " incorporate feelings into the framework theory in the apple frog example when the human believes she is confronted with an apple before the observation is she feeling hungry or low on glucose when she subsequently observes the thing jump does that observation include the feeling of disappointment the release of stress hormones Etc what would anyone say on this Jonathan and then anyone else",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1113.359,
    "end": 1123.15,
    "text": " Yeah, so I wrote the thing below there that I think that there's a strong relationship there between feelings and observations in the sense that we observe our bodily states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1123.611,
    "end": 1129.258,
    "text": "But I think this ties in nicely with some of Mark Solman's work on affect and consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1131.42,
    "end": 1139.47,
    "text": "Yeah, so I think that, yeah, one should think about bodily states and the inferences we make about the state that we're in based on those observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1141.652,
    "end": 1142.253,
    "text": "Nice, thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1142.573,
    "end": 1143.214,
    "text": "Anyone else?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1149.826,
    "end": 1161.051,
    "text": " would put this in the category oh yeah ali first go for it uh yeah i just uh wanted to point out that there's actually a theory of emotions or feelings developed",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1161.25,
    "end": 1172.741,
    "text": " within active inference framework, namely deeply felt affect theory developed by Casper Hesp and Ryan Smith and others.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1173.802,
    "end": 1190.278,
    "text": "So if anyone's interested in exploring how we can theoretically frame feelings purely in terms of active inference, I would highly recommend reading this fascinating paper",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1191.203,
    "end": 1193.186,
    "text": " from I guess to 2020.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1193.206,
    "end": 1195.93,
    "text": "Yes, thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1199.716,
    "end": 1213.397,
    "text": "I would put it in the category of possible to model, like you could make a model about it, you could write a paper about it, but not intrinsic within the simplest kernel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1214.575,
    "end": 1223.263,
    "text": " Because feelings also, as Psalms will be keen to point out, feelings implies a feeler.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1224.364,
    "end": 1231.491,
    "text": "And so that is bringing in the qualia, phenomenology, experience, awareness topic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1232.511,
    "end": 1240.299,
    "text": "But the model can also be stated without those considerations playing an outsized role.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1241.159,
    "end": 1244.042,
    "text": "But if someone's making a map, like a generative model,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1244.478,
    "end": 1268.781,
    "text": " and they want to include those variables there are some strategies that people have been implementing for years to engage with affective states in a computational psychiatry approach like and just an empirical strategy might be like we start with a simple model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1268.963,
    "end": 1295.308,
    "text": " then we find oh there's like this interesting residual pattern where people are um overestimating how likely apples are around noon and then we get a new sensor in our laboratory now we're measuring glucose or we um are getting some health data so now we can differentiate people who have this metabolic condition from that and we're finding that they have a different inference strategy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1296.537,
    "end": 1325.447,
    "text": " so it's not about just sketching it and just saying up it's a done deal because it's on paper it's about that iterative modeling and a plurality of possible ways that feelings could be implemented though I think Psalms and others will say that they have um in silico feeling agents so that again opens up a whole nother level of discussion",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1334.54,
    "end": 1357.543,
    "text": " all right when quantifying dissimilarity between the prior and posterior so for example bayesian surprise so the surprise alone just surprisal is about one data point coming in how surprised are we measured in information theoretic units like a knot or a bit",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1358.958,
    "end": 1369.269,
    "text": " But if we're talking about Bayesian surprise, we're talking about how much the prior shifts to become the posterior as a function of the observation coming in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1369.99,
    "end": 1372.893,
    "text": "Why do we choose the KL divergence over other measures?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1375.836,
    "end": 1377.078,
    "text": "Is it just a canonical choice?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1377.118,
    "end": 1377.638,
    "text": "Does it matter?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1378.279,
    "end": 1383.204,
    "text": "Since KL divergence is asymmetric, is there any reason we have chosen this particular order?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1383.485,
    "end": 1385.026,
    "text": "Is there any intuition motivating the choice?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1385.507,
    "end": 1387.429,
    "text": "Does anyone want to give a first thought?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1403.795,
    "end": 1427.389,
    "text": " okay one example of an alternative measure here's with um sajid at all this is getting um kind of as far as we might want to visit it here but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1427.74,
    "end": 1449.31,
    "text": " it's important note the KL divergence as the questioner notes it's not actually a measure in the proper metric sense and i don't mean like european metric system like if it the measurement between a and b has to be the same between b and a for it to be a distance measure",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1449.728,
    "end": 1473.424,
    "text": " um whereas the kl divergence it is a quantitative value but the divergence from a to b is not necessarily b to a in fact it's generally not so kl divergence is an asymmetric divergence quantification now it's possible to have a very closely related divergence called the jeffries",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1476.796,
    "end": 1481.102,
    "text": " which is just the KL plus the other direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1484.507,
    "end": 1491.316,
    "text": "So it calculates like, it's basically the KL of A to B plus the KL of B to A. And so that is symmetric.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1491.857,
    "end": 1494.38,
    "text": "Hence, that is a real distance measure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1495.742,
    "end": 1503.192,
    "text": "Other measures have been proposed, the Raney, and they may discuss other options as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1505.395,
    "end": 1506.617,
    "text": "Why is it used?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1508.555,
    "end": 1533.955,
    "text": " in the context of variational Bayesian inference and probability it just turns out that the log properties work and um in equate one of the earlier equations which maybe Ali will remember specifically like Ali go for it and I'll think about which equation is the one with the KL definition",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1536.044,
    "end": 1537.626,
    "text": " It was equation 2.3.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1538.046,
    "end": 1560.81,
    "text": "And yeah, also, there's a lemma called Neyman-Pearson lemma, which actually proves that the most efficient way to distinguish between two probability distribution based on a given observation is KL divergence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1561.37,
    "end": 1564.954,
    "text": "So it's not just an arbitrary choice, but",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1565.255,
    "end": 1569.266,
    "text": " I believe it's a proven theorem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1569.947,
    "end": 1575.462,
    "text": "I mean, it's the most efficient method for comparing those two probability distributions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1579.312,
    "end": 1579.753,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1586.281,
    "end": 1604.931,
    "text": " also just to kind of give one one related angle to connect like why this whole discussion matters for those who saw that as in the weeds it definitely is um the way that that um pragmatic value is gonna be determined",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1605.265,
    "end": 1632.96,
    "text": " is ultimately through something KL is used for information and on the pragmatic side but this is how when we talk about expectation and preference and we want to evaluate policies based upon how well they align with our preferences that is going to be operationalized by reducing a KL divergence between our preferences and observations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1635.337,
    "end": 1651.656,
    "text": " And that task of optimization of the incremental reduction of divergence relative to our generative model of incoming observations, that's what we want to solve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1652.457,
    "end": 1656.301,
    "text": "And it also turns out to have some good computational properties.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1658.724,
    "end": 1661.547,
    "text": "So, Jonathan?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1663.535,
    "end": 1669.283,
    "text": " Yeah, I was just going to say, just in terms of the the equation that, sorry, excuse me, for the expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1669.984,
    "end": 1679.477,
    "text": "Although I feel very comfortable in general with with mathematics and physics, I find it very hard to get intuition from that equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1679.517,
    "end": 1686.927,
    "text": "I think it would be useful, maybe it's something that I'm going to do, but to actually run through a sort of really concrete example at that stage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1686.907,
    "end": 1691.354,
    "text": " with numbers so you can see how the two terms differ for a particular example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1691.454,
    "end": 1695.781,
    "text": "I think that would be quite enlightening for me to go through at some stage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1697.203,
    "end": 1697.503,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1697.704,
    "end": 1701.449,
    "text": "I know some may have notebooks that do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1701.489,
    "end": 1705.215,
    "text": "So however people want to share that or build that, that sounds good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1705.275,
    "end": 1711.124,
    "text": "Yeah, many ways to go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1714.349,
    "end": 1715.631,
    "text": "But great questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1719.543,
    "end": 1747.272,
    "text": " thank you for who's sharing these so KL plays nicely with logs in the sense that it's defined essentially in terms of the divergence between Q to P again not the distance between Q and P the divergence between Q to P is defined as triangle equals",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1747.454,
    "end": 1775.622,
    "text": " expectation over the variational distribution on hidden states so over the map not over the territory expectations over the map so the center of gravity of our map's inference on hidden states of the difference between the log Q and P the log",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1776.091,
    "end": 1805.001,
    "text": " again connects us to all of those nice mathematical computational statistical properties of logs and um has this divergence interpretation too expectation of a difference of logs is a kl divergence and the reason why it's not symmetric is because um p to q would be flipped and so it'd be a different number",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1805.099,
    "end": 1806.541,
    "text": " unless they were literally both zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1825.942,
    "end": 1830.587,
    "text": "Under some conditions, one can reduce variational free energy to other notions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1831.408,
    "end": 1832.389,
    "text": "Which conditions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1847.32,
    "end": 1874.307,
    "text": " here they're showing it for expected free energy these kinds of special reduction conditions um or special cases and something analogous can be um kind of proposed for variational free energy it's just not directly shown there so um coming from so in variational free energy f q and y",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1876.109,
    "end": 1877.112,
    "text": " expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1878.155,
    "end": 1880.241,
    "text": "Epistemic value, pragmatic value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1881.204,
    "end": 1888.566,
    "text": "And the special cases are when, for example, pragmatic value, which here is shown as the first term,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1890.082,
    "end": 1916.427,
    "text": " then here epistemic value is the second term so where section one is zero this term is just zeroed out there's no preferences preferences are flat all outcomes are equally pragmatically valuable then we only have elements two three four five in play that is equivalent to bayesian surprise",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1917.419,
    "end": 1944.372,
    "text": " novelty search optimal information game in contrast if we had discarded two two three four five because it's a fully discovered fully known situation there's no epistemic value to harvest then we only have the left term one which is classical pragmatic decision theory and so on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1965.665,
    "end": 1978.826,
    "text": " By acting on the world to change the way in which data are generated, we can ensure a model is fit for purpose by choosing those data which are least surprising under our model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1979.988,
    "end": 1984.354,
    "text": "Is active inference the process that can explain treatment resistance?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1986.918,
    "end": 1992.347,
    "text": "I can kind of imagine what that is, but if somebody who wrote that wants to describe like what treatment resistance is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1998.352,
    "end": 2014.117,
    "text": " Okay, under just this first pass understanding that treatment resistance, let's just copy this information in, has to do with recalcitrance or resilience to a given therapeutic intervention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2014.157,
    "end": 2024.173,
    "text": "There might be different ways to frame it, but if there's a model with a low learning rate,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2025.453,
    "end": 2028.477,
    "text": " I am the kind of person who does this action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2030.68,
    "end": 2048.946,
    "text": "Then from the clinician's perspective, various interventions might be characterized, the person may be characterized as resistant to those interventions because the interventions are not updating some aspect of their generative models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2051.542,
    "end": 2072.368,
    "text": " so is it the process can explain treatment resistance well again that's like asking is linear regression the process that can explain the relationship between heart disease and cancer it's like i don't know if you write the paper and the community of experts use it then it's a going scientific explanation is just putting these words down the explanation no",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2073.243,
    "end": 2074.966,
    "text": " What else needs to be built?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2075.728,
    "end": 2078.413,
    "text": "How can that question be modeled and engaged with?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2079.075,
    "end": 2082.181,
    "text": "But does the framework itself simply explain it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2082.762,
    "end": 2083.002,
    "text": "No.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2083.904,
    "end": 2090.156,
    "text": "Could you explain it and attempt to build a model that provides unique explanations, predictions, and control options?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2090.758,
    "end": 2094.164,
    "text": "I believe so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2094.184,
    "end": 2095.487,
    "text": "Any comments or questions on this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2108.005,
    "end": 2123.366,
    "text": " Can someone read Bayes' rule for me once again in plain English, equation 2.1, now taking into consideration that quote, Bayesian inference minimizes surprise, is equivalent to maximizing Bayesian model evidence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2125.148,
    "end": 2127.892,
    "text": "And then they're suggesting that this is computing the posterior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2134.141,
    "end": 2135.262,
    "text": "Any thought on this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2151.863,
    "end": 2152.897,
    "text": " Equation 2.1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2174.746,
    "end": 2201.732,
    "text": " maybe if anyone wants to type it out in the coming weeks just i i'm not 100 sure but if you have the model that's parameterized tuned such that bayesian model evidence is maximized you have found the most likely parameter comp the maximum likelihood estimate for a given sequences of actions given your priors",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2201.915,
    "end": 2205.959,
    "text": " So you have the most supported model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2207.54,
    "end": 2214.687,
    "text": "That is equivalent to saying that with your most supported model, you've minimized your surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2218.071,
    "end": 2228.901,
    "text": "So how you read different terms and like which one you see as kind of upstream or feeding into the other one depends on the structure of what your experiment actually is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2236.778,
    "end": 2237.07,
    "text": " Okay."
  },
  {
    "start": 2244.406,
    "end": 2250.572,
    "text": " Page 24, it then generates an action, sends it to the environment in an attempt to make the environment less surprising.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2250.893,
    "end": 2253.235,
    "text": "Could this be translated to a clinical scenario as follows?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2253.976,
    "end": 2255.417,
    "text": "One, I predict bodily integrity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2255.558,
    "end": 2259.842,
    "text": "Two, I receive sensory observations disconfirming my prediction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2260.543,
    "end": 2270.113,
    "text": "Three, I generate an action undergoing treatment to receive sensory observations that confirm my prediction of bodily integrity, thereby making my environment less surprising, aka active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2271.374,
    "end": 2272.455,
    "text": "Anyone have a thought on that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2286.796,
    "end": 2289.48,
    "text": " For qualitative ACT-INF, sounds good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2290.261,
    "end": 2294.547,
    "text": "Let's just contrast that with other stories that people could tell.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2295.849,
    "end": 2298.112,
    "text": "One would be the reward learning story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2299.193,
    "end": 2301.577,
    "text": "I'm rewarded by bodily integrity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2302.738,
    "end": 2305.923,
    "text": "I seek out actions that increase my reward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2306.664,
    "end": 2310.93,
    "text": "So I decided to go undergo treatment to increase my reward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2313.253,
    "end": 2316.297,
    "text": "ACT-INF, generative model made a prediction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2317.171,
    "end": 2343.752,
    "text": " then based upon sensory observations policies were selection selected to reduce surprise there's some interplay of change your mind and change the world the other story three this is 3a and then 3b is i got the sensory observation disconfirming my prediction i updated my prior",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2346.263,
    "end": 2373.655,
    "text": " now expect low bodily integrity issue solved so normative in how we describe statistical problems sure normative in terms of in the human clinical environment suggesting how to act certainly not but great start",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2380.148,
    "end": 2388.561,
    "text": " Policies associated with lower expected free energy, G, are assigned higher probability and become the policies that an organism expects to pursue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2389.763,
    "end": 2393.068,
    "text": "Is this a reason why in a therapeutic setting change is often so hard to achieve?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2394.43,
    "end": 2401.22,
    "text": "Because the person often has to select different policies than they normally do and these new policies are therefore assigned lower probability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2401.941,
    "end": 2402.542,
    "text": "Great question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2402.923,
    "end": 2403.844,
    "text": "Any thoughts?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2412.852,
    "end": 2440.615,
    "text": " g updates the policy prior so we can look at we're gonna come to this more in chapter five when we start talking thanks jay we're gonna talk about it more um in chapter five there's a physical human in case that didn't make any sense um we're gonna talk about it more in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2442.552,
    "end": 2447.678,
    "text": " Five, E can be seen as the policy prior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2447.718,
    "end": 2459.772,
    "text": "It's the list of affordances that are possible and the number in each of those cells is how likely those are to occur, a priori.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2460.333,
    "end": 2463.917,
    "text": "So I turn right 60% of the time, I turn left 40% of the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2464.517,
    "end": 2471.125,
    "text": "A priori, if nothing else intervenes, I'm gonna continue to replicate that 60-40 behavioral pattern.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2473.045,
    "end": 2493.062,
    "text": " expected free energy evaluation sharpens that policy prior into a policy posterior that better reflects expected free energy minimization as we just discussed which can be decomposed into the epistemic and pragmatic value so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2496.772,
    "end": 2517.143,
    "text": " various ways of thinking about it but certainly in certain settings if one has a strong habit they have a precise prior on action then yes it would be hard to update because they have a precise prior on action",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2519.705,
    "end": 2525.593,
    "text": " But in the end, it would come down to the specific model that you actually make of that therapeutic setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2526.134,
    "end": 2534.365,
    "text": "But again, just qualitatively, conversationally, that broadly makes sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2534.385,
    "end": 2542.076,
    "text": "Especially if there's a new policy introduced, one can imagine that it has a low prior because empirically it's never been seen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2544.739,
    "end": 2549.526,
    "text": "Like how can one be the kind of person who runs every day if they haven't observed themselves doing that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2553.353,
    "end": 2554.295,
    "text": " Any other comments on that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2558.723,
    "end": 2561.087,
    "text": "Can I just ask if there's a zero prior?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2561.648,
    "end": 2564.734,
    "text": "Can it still be updated such that there is a nonzero posterior?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2565.916,
    "end": 2569.523,
    "text": "Yes, that is going to come in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2575.257,
    "end": 2595.763,
    "text": " with the Dirichlet conjugate prior we were just talking about it in the chapter seven and that's what's called learning by counting so in that setting you basically like each time you observe the two options you drop one ball of that color into an urn and then your posterior is just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2595.98,
    "end": 2622.882,
    "text": " sampling from that urn so if you have one um one blue and one green then the third ball is gonna like update your posterior a lot whereas if you had a thousand of each then that two thousandth and first ball is not going to update it that much so that's like more recalcitrant to learning and then now someone says oh now there are orange balls okay i observed an orange ball okay now we have one orange ball and a thousand blue and a thousand green",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2630.067,
    "end": 2652.97,
    "text": " one reason why those models are not like those models are very situational like there's no general answer or or solution about like adding and also from a um computational perspective like that you need to start some of the variables need to change their dimensionality and so currently tools are being developed to facilitate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2654.772,
    "end": 2681.286,
    "text": " specifying and updating the dimensionality of these models because a lot of the things that people are just intuitively curious about are like well what happens when somebody gets a piece of information that helps them realize that a new affordance is possible and that new affordance then in the future may or may not open up another affordance it's like yeah cool situation to model not going to have a general solution at this point",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2685.569,
    "end": 2708.303,
    "text": " and last of the pre-stated questions at 38 they say vfe minimization is the key outside loop of act-inf sufficient to optimize perception and beliefs about policies however the notion of policy was introduced in the context of efe which is an imagined future thing whereas vfe is right now how can beliefs about policies come into vfe without efe",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2716.248,
    "end": 2717.029,
    "text": " Any thoughts on this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2732.234,
    "end": 2742.07,
    "text": "Expected free energy is explicitly calculated over policies about future observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2744.632,
    "end": 2754.046,
    "text": " Variational free energy, as the question suggested, is about the current status of the variational distribution and incoming data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2755.087,
    "end": 2758.312,
    "text": "So they're just calculating something slightly different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2762.338,
    "end": 2765.883,
    "text": "Without EFE, we simply have energy-based learning via minimization of EFE.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2767.726,
    "end": 2772.493,
    "text": "Only by calculation of expected free energy over policy do we get the active part of active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2773.094,
    "end": 2773.795,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2774.753,
    "end": 2802.06,
    "text": " expected free energy could be applied at the one time step horizon um I'm sure there's other nuances and ways to address it but broadly variational free energy is reactive in that it's an ongoing unfolding flow between the generative model and the incoming data",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2803.61,
    "end": 2823.812,
    "text": " but it could it can be calculated of active or passive entities expected free energy makes a proactive yeah and vfe the the it could describe unplanned reflexive optimal activity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2825.378,
    "end": 2837.875,
    "text": " Whereas to explicitly consider policy counterfactuals as such and evaluate sequences of future possibilities, only EFE has that capacity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2843.623,
    "end": 2845.466,
    "text": "Okay, great, great question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2846.868,
    "end": 2849.972,
    "text": "Scott, when one models a candle flame or pendulum, will they only use VFE?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2850.533,
    "end": 2852.736,
    "text": "Yeah, so some years ago, I'll let you go for it first.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2854.64,
    "end": 2858.283,
    "text": " Yeah, just about VFE and EFE.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2859.144,
    "end": 2872.095,
    "text": "Well, actually, EFE includes both planning, I mean, action selection planning and also decision making.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2872.155,
    "end": 2880.002,
    "text": "But variation of free energy is just about, I mean, it's not just about planning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2880.082,
    "end": 2883.145,
    "text": "So EFE also includes",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2883.344,
    "end": 2887.448,
    "text": " includes the action selection or policy selection.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2888.149,
    "end": 2894.395,
    "text": "And of course, it's a requirement for planning and any kind of decision making.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2894.815,
    "end": 2906.847,
    "text": "But in VFE, it's just an inference we get by minimizing that parameter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2907.367,
    "end": 2913.233,
    "text": "But in the next stage, when we want to act upon that inference,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2913.398,
    "end": 2917.823,
    "text": " We use EFE for the action selection and decision making and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2920.005,
    "end": 2920.365,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2920.645,
    "end": 2920.926,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2921.626,
    "end": 2924.149,
    "text": "A few answers on using a candle flame.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2924.389,
    "end": 2935.08,
    "text": "So here in the strange particles paper, thinking about a modeling iterative process, first, we could say we're going to model it as an inert particle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2936.161,
    "end": 2941.667,
    "text": "And then if there's no statistical variance left to describe, you've done good enough.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2942.356,
    "end": 2965.022,
    "text": " you might also need to appeal to a latent cause like oh it's like it's a guitar string that's resonating but it's also like there's like a little gnome with a circadian rhythm latent cause inside and then it's like the next level of strange particles like oh this guitar string is resonating and there's a circadian gnome and i think the gnome thinks about what i'm going to do",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2966.757,
    "end": 2974.327,
    "text": " But each of those are an empirical question about what level of sophistication of cognitive model is relevant for a given situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2978.752,
    "end": 2994.132,
    "text": "And yes, earlier versions before expected free energy was even introduced, ACK-DIMF was VFE based and EFE was proposed to explicitly account for counterfactuals and planning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2994.618,
    "end": 3020.845,
    "text": " because in the earliest iterations it was like well we'll just calculate vfe that's like the real variable anyway so let's just do vfe on generative models and then like just sort of be guided step by step and then efe like kind of ultimately describes and and invokes variables that vfe doesn't like expected future observations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3023.93,
    "end": 3052.958,
    "text": " great um questions um just want to quickly look through where we're gonna go in chapter three um we can of course come back to it for the coming two weeks but any questions or thoughts or structuring or notes that people want to add um leading up to it of course the more the better so beginning with a Dawkins quote about survival machines",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3053.849,
    "end": 3077.578,
    "text": " chapter two was free energy as a means free energy as a how variational bayesian inference as a how here free energy is going to be approached from the why which is going to be the avoidal of surprising states and the ways that that is manifest across like self-organized systems and self-modeling systems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3079.87,
    "end": 3107.076,
    "text": " markov blankets are introduced i'm sure we'll have a lot of fun discussion so please all questions that people have on the topic just write them out you leverage it by like a hundred thousand when you actually write it out and improve others questions because there are many questions that we have about these areas um markov blankets are defined a certain way in a certain way that's carrying less philosophical baggage than many initially suspect",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3111.022,
    "end": 3121.238,
    "text": " The action perception loops, which were presented as loops in the previous chapter, are here presented in what's known as the particular partition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3122.0,
    "end": 3125.345,
    "text": "It's a particular partition because it's a joke.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3125.365,
    "end": 3127.188,
    "text": "First off, it's a specific way to do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3127.208,
    "end": 3128.31,
    "text": "It's not the only way to do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3128.33,
    "end": 3129.672,
    "text": "It's particular.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3129.938,
    "end": 3159.372,
    "text": " also what it partitions is called a particle the particle is the blanket and internal states that's why these are called inert active conservative and strange particles the particle is the generative model of the agent so the particular partition helps us operationalize the action perception loop scheme into a more proper bayesian graph setting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3160.347,
    "end": 3162.606,
    "text": " which enables message passing, all these other things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3163.755,
    "end": 3165.328,
    "text": "Figure 3.2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3165.46,
    "end": 3194.809,
    "text": " is showing a simple example of how Markov blankets are used in inference, not in some super recursive clinical setting, just in terms of like some stochastic variables and the ways that different variables have information about one another, and particularly how internal and external states can still contain information about each other despite being mediated only through the blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3196.308,
    "end": 3215.683,
    "text": " 3.3 agents with Markov blankets appear to model the external environment in the sense that internal states correspond to a representation of external states of the system so there's not like a little thermometer inside of the head of the generative model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3216.001,
    "end": 3242.093,
    "text": " but there are some statistical patterns such that we can say that there's mutual information between some part of the temperature and some part of the generative model otherwise the agent's actions would be insentient with respect to that environmental variable so that's like where we get cybernetics good regulator theorem law of requisite diversity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3242.073,
    "end": 3261.567,
    "text": " there's a turn towards uh or a nod to some of the bayesian physics by framing the process of surprise minimization as a hamiltonian principle of least action we're going to talk about it more short summary least action does not mean most lazy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3261.614,
    "end": 3266.842,
    "text": " If you shoot a ball out of a cannon and it follows a parabola, that is the path of least action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3267.423,
    "end": 3274.834,
    "text": "So least action does not mean least ATP using, it doesn't mean least carbohydrate burning, doesn't mean smallest computational model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3275.475,
    "end": 3280.061,
    "text": "It's a technical physics term that has a very important meaning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3280.822,
    "end": 3287.993,
    "text": "And you'll hear Friston and others characterize FEP as a principle of least action for cognitive systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3291.415,
    "end": 3320.325,
    "text": " 3.4 relationship between inference cognition and stochastic dynamics like why are we even talking about cognition as inference and talking about all of this statistical stochastic stuff so here they juxtapose statistical physics which has long had an imperative of minimizing free energy with Bayesian inference and information theory",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3320.963,
    "end": 3330.394,
    "text": " which can be mobilized to provide cognitive interpretations under the Bayesian brain framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3330.414,
    "end": 3335.72,
    "text": "Free energy, again, we're not simply talking about ATP being burnt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3337.582,
    "end": 3342.988,
    "text": "It's not Gibbs free energy, it's not calories, but it might have some relationships.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3344.555,
    "end": 3348.261,
    "text": " 3.41, variational free energy model evidence and surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3349.563,
    "end": 3353.73,
    "text": "Fancy letter surprise as model evidence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3354.05,
    "end": 3354.812,
    "text": "We'll come back to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3356.374,
    "end": 3357.336,
    "text": "Expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3359.419,
    "end": 3361.723,
    "text": "Here we had VFE and surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3362.344,
    "end": 3365.028,
    "text": "Real-time unfolding model evidence as surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3365.89,
    "end": 3370.377,
    "text": "Here's prospective EFE and inference to the most likely trajectory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3371.42,
    "end": 3393.732,
    "text": " and 3.5 active inference a novel foundation to understand behavior and cognition some summary of the above and a little bit of unpacking about how behavior and cognition are being unified in active inference 3.6 models policies and trajectories",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3394.522,
    "end": 3421.761,
    "text": " more discussion about those topics reconciliation of inactive cybernetic and predictive theories under active inference those three apparently disconnected theoretical perspectives are reconciled in this section according to the authors and then moving even further active inference from the emergence of life to agency is where again in only a several short paragraphs so just the tip of the iceberg",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3423.85,
    "end": 3452.136,
    "text": " there's some discussion of general um sentience and agentic properties of the generative models the kind that we're modeling with active inference side box on entropy minimization yes hardly any maths in chapter three yeah let's see um not in the second half okay equation 3.2",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3454.715,
    "end": 3480.216,
    "text": " equation 3.1 but both of them are kind of definitional and surely are described naturally in the text definition in the box three so yes different style but it's a breather before chapter four hits hard again with the math so thank you all looking forward to the comments and talk to you next week",
    "speaker": "SPEAKER_01"
  }
]