[
  {
    "start": 2.326,
    "end": 5.831,
    "text": " All right, we're in an open slash general session.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5.851,
    "end": 8.995,
    "text": "So Adam, perhaps begin with the question and then Andrew, go for it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 10.457,
    "end": 11.818,
    "text": "Okay, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 11.838,
    "end": 30.122,
    "text": "So in chapter seven, in the summary, it says that inference using both simple and more complex generative models can always proceed through free energy minimization, which illustrates the generality of the approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 31.435,
    "end": 38.887,
    "text": " And my question is about whether or not there is a partition function for the model of the minimum free energy state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 40.249,
    "end": 56.434,
    "text": "And I wanted to note how about in section 7.3, they talk about sorting the states of the world into categories of whether the creature has control or whether it does not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 57.115,
    "end": 58.557,
    "text": "And then it says that the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 58.857,
    "end": 62.12,
    "text": " the transition probabilities for the ones that it doesn't are invariant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 62.721,
    "end": 68.546,
    "text": "And then each state that the creature has a control over the world has like a unique transition probability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 68.646,
    "end": 78.855,
    "text": "So then it's always going to try to select the transition probability, which is most effective at bringing it towards a free energy minimum state, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 81.758,
    "end": 86.282,
    "text": "So that would be the equilibrium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 86.397,
    "end": 90.682,
    "text": " I suppose, which was making me think about whether or not there's a partition function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 96.568,
    "end": 97.389,
    "text": "yeah so.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 97.429,
    "end": 107.44,
    "text": "it's kind of like to answer that there are a few different pieces going on so yeah with like you can see in that chapter where.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 108.341,
    "end": 111.004,
    "text": "let's see age.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 112.115,
    "end": 122.248,
    "text": " 126 that just the second page of the chapter, you can see like, like the breakdown of the B matrix is they call it at the bottom of the page.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 122.868,
    "end": 131.599,
    "text": "And so, like, yeah, you're gonna have a unique B matrix for every hidden state factor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 132.52,
    "end": 139.489,
    "text": "And it's the dimensionality is kind of like the, we're gonna",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 140.363,
    "end": 170.134,
    "text": " what is the state going to be at the next time step conditioned on uh what you infer the state to be in the current time step as well as um a policy so it's kind of like the agent will uh you know they'll try to think what can i do now to change what i think is going on now in terms of the in state to um you know a particular hidden state that i i kind of want to see in the next step and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 170.62,
    "end": 178.05,
    "text": " I would say in a kind of all things controlled for kind of way, what you said is correct.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 178.271,
    "end": 189.466,
    "text": "It will go with what the action that is most probable to get it to a state it wants to be in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 189.947,
    "end": 199.26,
    "text": "And that said, because free energy is being run across all of these different components of the model,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 199.73,
    "end": 213.013,
    "text": " It's not necessarily the case that you can just look at the B matrix and immediately know what the agent is going to do just because one state transition is more probable than another.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 213.348,
    "end": 220.538,
    "text": " when it's computing expected free energy, for example, that, you know, it's broken down into epistemic and pragmatic value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 221.399,
    "end": 224.464,
    "text": "An agent might choose to transition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 224.484,
    "end": 230.853,
    "text": "It might choose to do something to make a state transition that it isn't really clear on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 231.093,
    "end": 235.559,
    "text": "For example, it might compute like, oh, there's epistemic value there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 237.181,
    "end": 242.629,
    "text": "You know, and then if you have your agent like learning its B matrix, those values will get updated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 242.997,
    "end": 243.799,
    "text": " over time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 245.522,
    "end": 254.739,
    "text": "So I hope that that kind of framing is is useful in some way, as far as a partition function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 256.463,
    "end": 265.039,
    "text": "So I just want to I want to better understand and maybe it'll be helpful for others to how would you define a partition function and in the way that you mean it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 266.943,
    "end": 289.086,
    "text": " yeah you know what um i don't even really know like honestly i've never actually formally studied um statistical physics so when i like i've asked there's also like a partition function in is it number theory and i was i asked all over nil about it on on youtube and he gave me this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 290.146,
    "end": 291.148,
    "text": " I'm going to be rambling on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 291.589,
    "end": 299.143,
    "text": "He sent me a paper that was actually discussing the relationship between the partition function in number theory with the partition function in statistical physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 299.243,
    "end": 301.186,
    "text": "And my question to him was, was it the same one?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 301.868,
    "end": 302.89,
    "text": "And he said he didn't really know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 302.93,
    "end": 304.913,
    "text": "And I had the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 305.034,
    "end": 305.615,
    "text": "I was reading.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 305.635,
    "end": 306.156,
    "text": "It was interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 306.196,
    "end": 306.456,
    "text": "I forget.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 306.476,
    "end": 307.398,
    "text": "I don't have it offhand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 307.959,
    "end": 310.163,
    "text": "And in this case, I'm kind of wondering, like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 310.143,
    "end": 329.873,
    "text": " the word partitioning in terms of sorting the two states of the world from the ones we can change to the ones that we cannot and then at equilibrium like the um those states become stationary i suppose in some sense and uh so but i'm also wondering",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 331.118,
    "end": 341.5,
    "text": " I'm also wondering, would the partition function manifest as the different aspects of active inference that are supposedly emerging, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 342.425,
    "end": 349.416,
    "text": " Let me give a few thoughts on this just really briefly, because you're in the right track.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 350.037,
    "end": 355.546,
    "text": "Partition is being used in a, I hate to reuse the pun, but it's a particular way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 356.127,
    "end": 365.361,
    "text": "And so a lot of the momentum in the current kind of wave of active inference is from a 2019 paper from Carl Friston.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 365.341,
    "end": 389.408,
    "text": " so a free energy principle for a particular physics particular here's the joke it cleaves off particles we call the entity a cognitive particle whether it's rock metronome or like more sophisticated etc and then it's a physics for those kinds of partitioned systems so that is taking a bayesian graph and then doing certain partitions on the graph",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 389.675,
    "end": 413.758,
    "text": " there's other uses for the term partition like you brought up the term from stat Mac so here partition function describes statistical properties of a system in thermodynamic equilibrium so there the free energy is like Gibbs free energy like why do candles burn once they're activated forward like why is time going that way why don't candles like unburn so that's on the thermodynamics",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 414.076,
    "end": 430.195,
    "text": " Then over the last like 50, 100 years, all of these mega developments with information and thermodynamics, like analogies between them or isomorphisms, but also unity between them, like with the Landauer limit and how much energy does it take to read or write a bit?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 430.175,
    "end": 455.794,
    "text": " it's a kind of info thermodynamic space that the free energy principle is related to um so are there well described summary variables that describe systems that are in different kinds of info dynamic equilibrium there are so the simpler case is like a fixed point so i'd be like the rock is just resting on the ground it's like the belief is not updating",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 455.926,
    "end": 460.334,
    "text": " Then the next step would be like the simple update, like this billiard ball hit the rock.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 460.394,
    "end": 461.236,
    "text": "It moved this much.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 461.276,
    "end": 463.24,
    "text": "That's like this data point hit the prior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 463.36,
    "end": 464.262,
    "text": "It moved that much.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 465.344,
    "end": 469.01,
    "text": "And then there's all kinds of like steady states that could be like an oscillator.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 469.07,
    "end": 475.302,
    "text": "So you're going in the right area to see how those things are formalized.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 483.601,
    "end": 497.113,
    "text": " Yeah, that um, so I guess it isn't like it wouldn't be describing, because I did read on on YouTube, there was saying the thermodynamic properties of a system like the temperature and volume.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 497.133,
    "end": 506.462,
    "text": "And so if in what would those be parallel to like in an active inference system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 506.502,
    "end": 512.207,
    "text": "Would it be the aspects like decision making and balancing exploration and learning?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 515.714,
    "end": 544.455,
    "text": " great question andrew what would you say to that um i mean yeah it's trying to figure out how how to phrase that well i mean it's you'd want to look at the i would just refer to like the the breakdowns the variational and expected free energy i suppose it's it's it's expected free energy where you're going to see that as i mentioned earlier that epistemic and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 545.009,
    "end": 570.662,
    "text": " pragmatic value, differentiation, and that that plays out in learning as well, like expect, like free energy is being minimized during the process of, of learning where rather than, you know, inference, in the context of, of active inference, like inference is inferring states of the world, learning is inferring",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 571.25,
    "end": 575.255,
    "text": " uh, sort of model like parameters values, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 575.595,
    "end": 580.941,
    "text": "So you're, you're going to be like the, the agent learns to adjust its own parameter values.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 580.961,
    "end": 595.017,
    "text": "It's also going to infer moment by moment states, um, uh, the pragmatic and epistemic value play into that overall process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 595.497,
    "end": 597.78,
    "text": "And, and I mean, all these things are kind of happening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 598.537,
    "end": 625.422,
    "text": " um simultaneously so so so for me it's i'm a it's a little tough for me to like kind of rip out one part of that process and say that one thing is like what's happening um but i'm not sure if i'm answering that yeah questions super well or not but that's that's i think that was a key piece which is the epistemic and pragmatic value are a way to like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 625.958,
    "end": 655.797,
    "text": " reweight the policy prior into the policy posterior so for a kind of thing that's not doing the cognitive task of something like policy updating so if something's drawing from habit that could be like a go to the simplest and fixed habit it's like the rock is always in location one so it's like it's being sampled from location one with a hundred percent again and again it's kind of like a redundant or a tautological statistical distribution",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 655.777,
    "end": 685.193,
    "text": " and that is also what comes up is like defining things as they're measured to be so then rather than the the space of possibly dissipative things he's like well the measurements over this time scale are such that it is returning to an attractor and then what are the dynamics of that attractor is it like just a marble going to the bottom of a bowl and perturbation brings it back or does the bottom of the bowl adjust that's like learning",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 686.067,
    "end": 689.332,
    "text": " Is there another landscape than all those kinds of questions?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 697.284,
    "end": 712.868,
    "text": "Do you think it'd be helpful to, I don't know if there's the, I like the, one of the simpler equations from active inference for just like computing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 713.388,
    "end": 742.078,
    "text": " like the final posterior over policies i i just i've always found that interesting and like helpful for like describing to folks lesser familiar with active inference it's like like your your posterior over policies typically is like a softmax function softmax function over negative expected free energy times gamma which is referred to as it's like a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 742.75,
    "end": 755.012,
    "text": " precision over actions, and then minus, I'd rather pull it up, actually, just so I don't misspoke here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 755.894,
    "end": 765.13,
    "text": "The main point is that it includes expected free energy and variational free energy and habits, all of which, you know, Daniel just mentioned.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 765.97,
    "end": 793.058,
    "text": " a moment ago and it helps to give a an intuitive sense of like all three of these components are are going into the agent's behavior like what action they end up selecting right it's like what expect expected free energy as what it expects to happen and that's where it's uh priors over observations come in so it's that's where its preferences come in and then uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 793.612,
    "end": 798.399,
    "text": " variational free energy is just reducing kind of uncertainty in the moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 798.419,
    "end": 803.186,
    "text": "And then habits are like these empirical priors that have been built up over time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 806.07,
    "end": 806.431,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 808.494,
    "end": 815.704,
    "text": "Another kind of big moment in helping think about this was this particular kinds",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 816.73,
    "end": 843.514,
    "text": " showing continua from like in a continuum of modeling continuity not as much as like an ontological claim about any actual system but in terms of a modeling continuity with systems that are being interfaced with differently ranging from kind of like inner unidirectional cause to kind of simpler inert to simpler non-planning like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 843.747,
    "end": 872.387,
    "text": " on through like planning like with other cognitive phenomena like reflexivity meaning creation things like that so the simple ones really do look like this the graphs but this graph on the bottom is way more of like a schematic and then play those graphs might be very large um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 872.705,
    "end": 877.251,
    "text": " Sriharsha or Courtney have any question or like different direction to explore?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 888.646,
    "end": 889.748,
    "text": "I don't at the moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 890.068,
    "end": 901.243,
    "text": "I was just kind of listening to your guys' conversation and seeing what you gleaned from that since I'm not that far along yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 901.898,
    "end": 928.446,
    "text": " cool thank you yeah it's like always like skipping around on on a record here's one this is the bayesian mechanics paper this is kind of a summary slide thank you sri harsha so this paper this is like doctrine's activity and maxwell ramsted and others working on the bayesian mechanics so here's classical physics classical mechanics",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 929.0,
    "end": 951.345,
    "text": " stationary action that's like why the baseball goes in the parabola then statistical physics says well it's not just like planets and baseballs and gravity it's other certain behaved summary statistics like temperature and pressure that was what we were just looking at with the partition functions um quantum",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 952.945,
    "end": 969.992,
    "text": " moves that into the not just the scale that was being explored but also like the imaginary or like another axis that's orthogonal so that's why there's the imaginary numbers and the rotation and it's an equivalent physics of uncertain systems",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 970.259,
    "end": 993.448,
    "text": " especially interpreted in this kind of scale free way so it's not just like unique mechanisms related to electrons but those contribute to it and and uh constitute why the variability patterns are the way they are but people have applied Quantum formalisms across different systems even without relying on like some sort of um reliance on electrons or protons or anything",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 994.373,
    "end": 1012.635,
    "text": " then kind of in that same frame and generalization and you can generalize quantum to be statistical physics with no um wave distribution and you could summarize statistical physics to be like that's why the baseballs moves like a parabola instead of like diffusing",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1013.425,
    "end": 1018.115,
    "text": " Bayesian physics extends that to arbitrary state space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1018.255,
    "end": 1031.704,
    "text": "So quantum mechanical state spaces, maps of quantum mechanical or stat or classical are within certain categories of maps and models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1032.713,
    "end": 1044.192,
    "text": " So this Bayesian mechanics thread, especially a lot of the rigor that Dalton and Chris Fields and some others brought in, is only in the last, like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1044.323,
    "end": 1073.048,
    "text": " to post again post 2019 friston kind of entry into that fundamental uh level of the interface but it's kind of also threaded going prior but took a lot of uh consolidation and development turn and this is not brought up in the 2022 textbook so it's kind of like the textbook is at this checkpoint",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1073.585,
    "end": 1079.813,
    "text": " where the baseline, so in the textbook, it's like, well, what are the math areas?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1079.953,
    "end": 1089.206,
    "text": "And it says linear algebra, so matrix multiplication, and then dynamical and stochastic systems, like probability on dynamical systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1090.628,
    "end": 1093.131,
    "text": "That is like a checkpoint.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1093.331,
    "end": 1102.123,
    "text": "And then that's been some of the most interest over the last years was what is the basis of Bayesian mechanics",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1102.492,
    "end": 1108.803,
    "text": " How does it matter or differ from the 2022 textbook style?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1110.606,
    "end": 1111.187,
    "text": "Thank you, Andrew.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1117.117,
    "end": 1119.842,
    "text": "Anyone can give a thought or a different question?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1140.983,
    "end": 1165.945,
    "text": " yeah sorry daniel what what were you referring to in terms of the linear algebra and the stochastic probability um but in in the textbook so one part is where they sort of uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1166.228,
    "end": 1187.528,
    "text": " mention the kinds of maths that are needed like those are good keywords to see like here linear algebra calculus and and series expansion and then also there's the appendices but these appendices are kind of just like the the um the tip of the iceberg uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1187.677,
    "end": 1194.083,
    "text": " A is kind of some of the code, but there could be a lot of work in MATLAB and other languages to make code examples.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1194.143,
    "end": 1195.925,
    "text": "Like that's what we're doing in Julia right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1196.746,
    "end": 1200.509,
    "text": "Appendix B goes through the equations, but still it's only showing some.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1200.529,
    "end": 1204.052,
    "text": "And then here's OC is the code.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1204.573,
    "end": 1206.234,
    "text": "So A must be the backgrounds.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1210.859,
    "end": 1211.74,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1212.3,
    "end": 1215.563,
    "text": "Have you ever watched Oliver Nell's YouTube?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1216.384,
    "end": 1216.964,
    "text": "Put a link.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1217.045,
    "end": 1217.565,
    "text": "I don't.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1218.018,
    "end": 1244.211,
    "text": " put a link I don't recognize no so here's the four topics linear algebra series approximation like series expansions function approximation variational calculus and stochastic dynamics so systems that have dynamical nature and probabilistic nature but that's the math",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1245.845,
    "end": 1272.274,
    "text": " that's what but this is also foundational for going further into Bayesian mechanics because in many ways it's just like more um remixes and and kind of like concatenations of these core mathematical motifs there's been um there's been many people's contributions to making the math more um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1274.819,
    "end": 1291.883,
    "text": " relatable it's just like it's a it's a it's a great question and to an area to kind of run towards and contribute to and explore like jonathan shock is a math professor he wrote this great text um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1292.15,
    "end": 1320.334,
    "text": " however it it may be like you know more or less than someone is looking for but it is really cool even like like like even a p-value or or um like a bit there's like a lot of things to return to so it's not like a check it off your list because the basis of this is just like surprise and entropy so then that's like why it's important to return to it many times",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1321.09,
    "end": 1326.716,
    "text": " Because it's not like you can just cram it and finish the topic and then just like never returned to that node.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1326.756,
    "end": 1336.747,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1338.449,
    "end": 1341.012,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1345.057,
    "end": 1345.377,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1349.677,
    "end": 1373.862,
    "text": " yeah and then in the textbook group like the work that uh octopus is doing right now over the years people have brought up many questions and thoughts about learning math and about how math connects and then octopus is now like more um holding down these meetings and just trying to coordinate more math educational work",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1374.145,
    "end": 1379.793,
    "text": " That's something that's always there, always improvable if somebody wants to start, like just on any part.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1384.3,
    "end": 1390.709,
    "text": "I think Axel made some models and also mentioned that if people were interested in that, he'd be open to collaboration too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1393.453,
    "end": 1394.234,
    "text": "Octopus said that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1394.755,
    "end": 1395.356,
    "text": "Axel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1396.197,
    "end": 1396.958,
    "text": "Axel Constant?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1398.08,
    "end": 1401.224,
    "text": "Axel Sorensen, I think in the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1401.244,
    "end": 1402.045,
    "text": "Oh, Axel Sorensen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1402.105,
    "end": 1402.726,
    "text": "Okay, cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1402.766,
    "end": 1403.207,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1403.778,
    "end": 1423.913,
    "text": " cool yeah like for the math and stuff so people could see the interrelationship between the terms and things like that yeah on on well on the terms uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1424.365,
    "end": 1449.647,
    "text": " if people want to follow up that like more formal but natural language so not using equations per se but um going into like terms in their relationship that's like another dimension with the active inference ontology so that's the like that's the generic system description",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1450.775,
    "end": 1477.947,
    "text": " then those are the terms that actually apply to the generic system so in certain ways it's simpler than trying to give examples from systems because it could be like oh the action state of the robot well that's like you know that motor it's like well but then the motor has a sense element and then from the world's perspective it's it is a you know so it gets really specific when you are dealing with specific systems but the core ontology",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1478.062,
    "end": 1501.048,
    "text": " is you don't even need to use these 64 terms it's very small and the kind of kernel of it is the particular partition and why and how there's a least action principle on a certain kind of partitioned graph so all the equations just setting up the path",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1501.383,
    "end": 1523.88,
    "text": " then that's why these kinds of um nodes and edge figures come up all the time because that is the setting that's being considered and that's coming more from like the basie mechanics free energy principle side whereas um in in the textbook they actually set a target for active inference",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1525.058,
    "end": 1540.775,
    "text": " which is why in figure 1.2, active inference is at the middle between that free energy principle, Bayesian mechanics, and then the bottom-up construction of real math and computational models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1542.597,
    "end": 1552.467,
    "text": "So this is more like applied math and applied computer science, because it's like you're making matrices that represent a certain system,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1552.548,
    "end": 1581.272,
    "text": " or certain measurements and then up here is more like the generic it's like like why does gas burn why does wood do this and then here's like this specific this particular engine so then that helps recognize like somebody will make a claim analogously to something like well because candles burn my car will get 200 miles per gallon it's like not necessarily",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1582.214,
    "end": 1588.182,
    "text": " or because metal has some structural integrity, this bridge design is gonna be fine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1589.945,
    "end": 1596.053,
    "text": "So the bottom and the low road is like a very empirical inquiry and building.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1597.075,
    "end": 1602.082,
    "text": "And then here is just some of the more generic elements that are related to physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1605.046,
    "end": 1609.993,
    "text": "So that's why this book brought things together and structured it in a different way than like was existing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1612.015,
    "end": 1624.196,
    "text": " Because it brings in that low road, high road approach, which can be like dug into and you can go deeper into low and high road.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1625.018,
    "end": 1632.471,
    "text": "But just the layout of like kind of setting context, low in the high road, just one way to think about it, but a very useful one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1632.603,
    "end": 1659.758,
    "text": " then chapter four when they come together and then chapter five which is the most well-studied domain at this time which is mammal neuroscience so that's why even though there's sections like especially in four that are just like whoa what is happening um and and eventually we'll have more of like generative dials like turn up the math detail turn down the math detail but um in a balanced form",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1659.822,
    "end": 1669.309,
    "text": " going from here's the context then take these two paths here's what it is here's where it's being used it does have those trails",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1686.637,
    "end": 1711.362,
    "text": " um yeah the math the math learning education Courtney thank you all copy it in so like octopus can explore it yeah people have made many continua um what's kind of fun is there's there's a hope for like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1711.561,
    "end": 1736.269,
    "text": " doing something in a very different way because if you think about a technical concept like a p-value it's hard enough to communicate technically and bayesian um prior and posterior and updating even before getting into it just if they're learned one by one and through the kind of tech tree learning trees that are how they're currently taught",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1737.616,
    "end": 1762.763,
    "text": " it's going to be a very long road with a lot of attrition so i think that's what motivates some of these questions like about math learning that people have um brought up over the years that's a really interesting layer to pull back to because like computers are used without math um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1763.013,
    "end": 1783.452,
    "text": " needed by the user so as that continuum and that stack starts to materialize like what and how are people learning what would be of epistemic and pragmatic value for them all those kinds of questions then sanjeev's textbook the fundamentals uh which he has finished the first volume of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1784.309,
    "end": 1787.993,
    "text": " It's two volumes, or this is just what I understand now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1788.534,
    "end": 1790.876,
    "text": "First volume is related to active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1791.857,
    "end": 1794.981,
    "text": "So that's kind of coming at it from the low road, largely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1795.021,
    "end": 1799.626,
    "text": "Second volume is free energy principle, Bayesian mechanics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1801.267,
    "end": 1808.275,
    "text": "However, the first volume is extremely comprehensive, gives a mega...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1809.031,
    "end": 1832.71,
    "text": " synthesis that's that will be um comprehensive enough for like very serious extended study and also use in language models Etc um so that will be very nice on the low road and then I think that's wise because it gives a more time for codification and synthesis on the high road elements",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1833.618,
    "end": 1847.104,
    "text": " which I mean even if there is as uh minimum I mean that's the whole thing with Maxwell's equation and Newton's equation is sometimes it it projects down to these expressions that are just so small",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1869.359,
    "end": 1897.712,
    "text": " yeah i mean there's a lot of a lot of there's a lot to go into here i suppose i suppose that um actually like typically in an active inference you're you're dealing with non-equilibrium states but you're always working it's always working to minimize the free energy so like it's it's non-equilibrium",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1899.937,
    "end": 1903.533,
    "text": " Yes, importantly, it can include that situation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1903.553,
    "end": 1908.394,
    "text": "So like you could have a cup of coffee in the room and they're at thermal equilibrium.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1909.15,
    "end": 1937.537,
    "text": " then you have non-equilibrium thermodynamics which is like heating and cooling and more phenomena if it was like a huge temperature difference or something so similarly it's good to check like yes i'm taking in this one data point i'm updating the prior here it is like and have a kind of um like it's at equilibrium like the temperature the thermometer is saying 70 my estimate is 70 it should stay at 70.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1938.023,
    "end": 1942.869,
    "text": " But then you can explore all of these situations where that is relaxed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1945.753,
    "end": 1946.634,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1946.654,
    "end": 1952.162,
    "text": "So you have like a Kalman filter, which is like kind of a sliding window memory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1953.023,
    "end": 1958.73,
    "text": "Then if you had it as just one thermometer measurement, it's going to jerk around and just reflect the measurements.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1959.431,
    "end": 1963.997,
    "text": "Or if you had it really like too heavy, it would just start taking the long run average.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1964.23,
    "end": 1970.398,
    "text": " So then that's like a Bayesian question, like what should the window and the forgetting be on the common filter?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1971.519,
    "end": 1978.768,
    "text": "And then the whole thing with the particular partition is like, now imagine if you were fitting that on the flows of all four of these.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1980.51,
    "end": 1991.624,
    "text": "So for each variable, they're all kind of undergoing that flow-based unfolding, which could be static, or it could be noisy, or it could be bimodal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1991.644,
    "end": 1994.187,
    "text": "It's like trapped here, and then it's trapped here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1994.268,
    "end": 2019.786,
    "text": " and then like what is the structure of all those variables it's not just for if you want to do something more than a thermometer abstraction but this is like the kernel that describes the particular partition and why and how that's coming from um or why and how you can have a path of least action on that flow which is what is set up here",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2022.736,
    "end": 2049.047,
    "text": " and and improved and clarified also in but but this will always come up it's like there's the four states sense action internal and external fun and different letters depending on different people's use and so on um and then what their their time development is plausibly a function of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2050.394,
    "end": 2075.035,
    "text": " and that's reflected by the connections between the nodes um like that is what this is showing which is that there isn't a direct edge between internal and external that's tautological because it's what defines the interface if there was a direct edge you're just talking about a different situation",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2075.217,
    "end": 2077.219,
    "text": " But these don't necessarily map on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2077.479,
    "end": 2080.321,
    "text": "Again, none of this is a claim about how things are structured in the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2080.501,
    "end": 2090.51,
    "text": "It's like, if you are using a base graph, anything other than a fully connected graph, so if you have everything connected to every node, then there's no partition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2090.85,
    "end": 2093.052,
    "text": "It's just like one connected mass.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2095.474,
    "end": 2101.759,
    "text": "If there are pieces that aren't connected to each other, then this situation comes into play.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2103.361,
    "end": 2104.802,
    "text": "That's interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2105.086,
    "end": 2128.647,
    "text": " yeah totally and it's like a it's like a separate sort of um little subgraph yeah exactly like the the um this is the niche and this is our Roomba you know the motors again just simplifying the motors and the internal states and the temperature reading it's like we we have partitioned the Roomba from the niche but if there was like some sort of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2129.032,
    "end": 2154.499,
    "text": " wire between some inter then it wouldn't be internal state so it's like that's the whole chapter six plus plus plus question how do you make these kinds of maps for cognitive systems and and that helps sometimes to clarify like the the epistemic status of these maps because but why is this reflected that way it's like because it was constructed that way as the map",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2155.88,
    "end": 2162.767,
    "text": " But they don't like, just take it alone, support or reject some kind of way that the world is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2165.81,
    "end": 2173.438,
    "text": "But making them within a certain type brings the generality of cognitive modeling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2173.458,
    "end": 2179.804,
    "text": "And then that's kind of just like the, how specific will you make the model?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2180.145,
    "end": 2182.427,
    "text": "Like, is the engine just one chamber?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2183.032,
    "end": 2210.203,
    "text": " and just like I'm just looking at heat across an engine overall or do you go and model heat at like the components or would you model heat transfer with this but those are all empirical and the the person of the team building that just addresses those as they actually happen how many Chambers should we model this engine is having it's like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2211.331,
    "end": 2232.867,
    "text": " are we building the model who's it for what questions are being asked that's what chapter six goes into um jeff also this morning and just like we're that was fun it was about the inspiration and the dream but it was",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2233.538,
    "end": 2252.863,
    "text": " it was fun and and uh but the the pendulum is going to give more of that's going to come across more as like a uh that's more like solving an exercise in a physics class if it's like we have an oscillator with two states it's oscillating due to this",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2253.67,
    "end": 2277.501,
    "text": " write the generative model that does this that's kind of that i mean it has like a kind of homework style feel not that there'd be only one answer but there'd be a continuum of problems from like there's only one answer as stated to there's multiple ways that you could have done that on through i mean it was just like where's time time perception",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2278.747,
    "end": 2302.898,
    "text": " but then those those are those can you can still play with it and and provide and take different thoughts on it even if it's not and then it just is like oh well it's not about generating one specific model but if it was um if we're a startup and it the the financial um incentive was to make the thermometer with this or that property then it'd be again just more of an engineering question",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2333.32,
    "end": 2360.644,
    "text": " also how it kind of revisits like chapter four shows discreet and continuous in one chapter like what's shared about them and then seven and eight revisit it but like just showing even from the beginning like it's the situation choice to model even how time is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2363.662,
    "end": 2364.243,
    "text": " Okay, okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2368.347,
    "end": 2372.631,
    "text": "Yeah, I'll put this in math learning resources.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2376.155,
    "end": 2383.002,
    "text": "You can add things, Adam or anyone, like, and if you're not sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2383.843,
    "end": 2386.405,
    "text": "Yeah, that's collaborative fun.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2387.787,
    "end": 2389.028,
    "text": "It's adding questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2389.188,
    "end": 2393.112,
    "text": "I mean, the hundreds of questions that have been asked did not come from nowhere.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2393.362,
    "end": 2417.631,
    "text": " and somebody with many questions could contribute many questions and someone who goes through many resources could just say here's what this one I just found it this way no one's gonna think it's like a total final judgment just this was useful for me learning this from here at least it helps show what different kinds of activity and different like practices can mean",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2419.062,
    "end": 2448.428,
    "text": " and it it just helps show example yeah these are ways to there's no um death gap between like not knowing linear algebra and slightly understanding it but then that that comes down to everyone's specific situation how much time and what kind of thing and like yeah graphs like the learnable Loop",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2449.792,
    "end": 2472.053,
    "text": " we this most recent blog post where kobus is able to from the rx and fur for the drone model for this to be automatically generated it's it's an incredible game changer it's it's amazing work it like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2472.252,
    "end": 2499.171,
    "text": " leapfrogs what visualization capacity for example exists in um python or matlab not because it's like a new visualization package it's just like you would be kind of starting on square zero it's like okay i have a base graph represented in matlab or python but i'm gonna just do like spread them all out or how is this even gonna work and for it to output like publication ready",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2499.505,
    "end": 2514.206,
    "text": " And with the verified integrity from how it's actually specified, not being like this extensive PowerPoint, just kind of off-chain moves, which is doing one's best in the absence of this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2514.246,
    "end": 2516.91,
    "text": "But I mean, this is like, whoa.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2518.632,
    "end": 2523.279,
    "text": "So what exactly is that graph figure there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2523.94,
    "end": 2525.162,
    "text": "Yeah, great question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2525.682,
    "end": 2527.605,
    "text": "So there's...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2529.577,
    "end": 2530.593,
    "text": " you like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2531.095,
    "end": 2535.101,
    "text": " to continue to dig and explore the papers and live stream where this is explored more.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2535.701,
    "end": 2542.891,
    "text": "But basically briefly, there's two primary kinds of graphs that come into play in active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2543.592,
    "end": 2545.355,
    "text": "The first one is a Bayesian graph.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2545.635,
    "end": 2552.405,
    "text": "So in that situation, the nodes are random variables and the edges resemble like causal influence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2552.445,
    "end": 2559.955,
    "text": "So that's like causal modeling, all those kinds of like Bayesian models from Jadet Pearl and others.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2561.099,
    "end": 2585.318,
    "text": " nodes are variables edges are like functions that relate variables they're maps it turns out over the last like 10 years being applied more to to like Bert de Vries and Carl Friston but the fundamentals kind of lying in the previous decades every base graph has also this dual representation as what's called a Forney graph",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2598.157,
    "end": 2598.437,
    "text": " Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2601.081,
    "end": 2606.449,
    "text": "Forney graphs, basically the nodes and the edges have the opposite character.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2606.509,
    "end": 2614.041,
    "text": "So it's like, whereas in a Bayes graph, you could have one node with like 50 connections because it could just be influenced by 50 variables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2615.483,
    "end": 2618.888,
    "text": "Whereas the edge can only have two nodes it's connected to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2619.889,
    "end": 2625.598,
    "text": "The Forney graph kind of inverts that where the nodes are like...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2626.523,
    "end": 2628.906,
    "text": " edges in the base graph and vice versa.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2629.747,
    "end": 2632.09,
    "text": "And there's like a dual relationship.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2632.11,
    "end": 2635.414,
    "text": "You can kind of represent them both ways and go between those two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2635.914,
    "end": 2645.766,
    "text": "But it turns out that in certain forny graphs, you can take the Bayesian causal graph, you know, probability of rain, probability of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2645.926,
    "end": 2646.867,
    "text": "Here's the observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2646.887,
    "end": 2650.492,
    "text": "So that's the kind of like systems thinking, how are things connected to each other?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2650.552,
    "end": 2655.838,
    "text": "And then there's this rendering that RxInfer does under the hood.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2656.578,
    "end": 2664.748,
    "text": " to another structure that's equivalent and does the same calculation, but it does it in this way that can be like scheduled.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2665.066,
    "end": 2671.175,
    "text": " Whereas on a base graph, there'd be a lot of degrees of freedom in like, how do you properly update this and percolate messages?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2672.276,
    "end": 2675.541,
    "text": "And the factor graph gives a much stronger way to do that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2676.082,
    "end": 2687.759,
    "text": "This is a technical detail, but it's like, what is making the Rx infer method more oriented towards the scaling and the engineering type efficacy?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2688.56,
    "end": 2694.769,
    "text": "Because it's a super strong engine under the hood for running these 40 factor graphs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2695.846,
    "end": 2711.725,
    "text": " but also enables this more Bayesian semantic layer, possibly for people to interact with it, but to see it like we've seen it before and flip it also into the version that actually relates to how like the different things connect.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2713.687,
    "end": 2722.157,
    "text": "So just like new level of ability to look into the kind of base computational layers of these models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2722.998,
    "end": 2734.172,
    "text": " in a but not by just making like custom visualizations like here's one some other large one like for and also",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2735.232,
    "end": 2763.265,
    "text": " time-varying autoregressive this highlights which is so um wise by kobus like this isn't just about cybernetics this is just doing Bayesian statistics like on time series which could be like temperature climate markets Etc so it doesn't always need to relate to more questions about like embodiment or communication amongst agents it can just be like this is the graph and then that's just a regression",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2767.025,
    "end": 2790.265,
    "text": " so it's not a theory about agents anything specific or any specific type of agent per se I mean everything of course I'm just saying saying informal takes but the fact that Phyllis is showing no you can use rx infer to do these just linear regression auto regression no no perception action here",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2797.163,
    "end": 2797.544,
    "text": " Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2798.525,
    "end": 2800.688,
    "text": "Well, whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2800.828,
    "end": 2807.057,
    "text": "Also, I updated the calendar events so that it should say a little more clearly which piece is being discussed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2807.137,
    "end": 2808.96,
    "text": "But yeah, we'll just continue on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2810.723,
    "end": 2814.849,
    "text": "Any last comment or otherwise?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2815.449,
    "end": 2815.71,
    "text": "Thanks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2816.01,
    "end": 2816.491,
    "text": "Thanks a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2817.232,
    "end": 2817.452,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2818.734,
    "end": 2819.555,
    "text": "Appreciate it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2819.575,
    "end": 2819.936,
    "text": "Farewell.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2820.156,
    "end": 2820.657,
    "text": "See you later.",
    "speaker": "SPEAKER_03"
  }
]