[
  {
    "start": 1.715,
    "end": 2.395,
    "text": " Hello everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2.836,
    "end": 8.24,
    "text": "Thanks for joining the second meeting where we're going to be discussing chapter one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9.24,
    "end": 12.883,
    "text": "It's the Act-Inf textbook group and it's May 12th, 2022.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 14.204,
    "end": 18.287,
    "text": "You can click on my screen and that will show you the full screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 20.889,
    "end": 29.515,
    "text": "We updated the live meeting page a bit and it's just like all these other pages, a work in progress, but hopefully this will be a structure where",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 31.158,
    "end": 51.452,
    "text": " be able to hear everyone's perspective and leave the coda in a better place than we found it so what we'll do in the live meetings which from here on out or at least for here for the next two and a half months or so are going to be like driven by the material in the chapters and in the appendices",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 53.226,
    "end": 78.204,
    "text": " we're going to go to the questions page and we're going to look at the questions that have been asked for that week for that theme and we're just going to start with the most upvoted questions and then we're going to be taking notes in the answers in the discourse and we'll go into a little bit more detail when we flip to that page and then after addressing questions for probably most of the time and discussing that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 79.065,
    "end": 85.616,
    "text": " We'll go pull back a little bit more broadly, like ideas for that week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 87.403,
    "end": 98.148,
    "text": " And then in the last minutes, we can just see if there's been any changes to the project ideas and start to see what people are excited about applying active inference to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 98.869,
    "end": 102.991,
    "text": "And then we'll end at the top of the hour and take a quick break.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 103.011,
    "end": 110.355,
    "text": "And then there'll be a tools organizational unit meeting following for those who want to just like listen or participate in .tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 111.365,
    "end": 117.588,
    "text": " So let's head over to questions and I'm going to hide the sidebar because we're going to be mostly here in questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 118.549,
    "end": 119.949,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 120.09,
    "end": 120.69,
    "text": "So it's awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 121.67,
    "end": 127.854,
    "text": "And also control and plus minus or control and scroll is like a good way to resize how it looks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 130.975,
    "end": 134.197,
    "text": "So this is our first week with this format.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 135.811,
    "end": 141.774,
    "text": " And anyone's welcome to suggest a variant or a different way to carry this out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 142.394,
    "end": 150.078,
    "text": "But the co-organizers of the textbook group kind of thought we could do something along these lines.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 150.899,
    "end": 153.8,
    "text": "The questions we're going to be looking at are in chapter one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 154.52,
    "end": 157.362,
    "text": "So that's the chapter we're discussing today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 158.302,
    "end": 165.086,
    "text": "And we're going to start with the ones that have the most upvotes in the interesting and just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 166.232,
    "end": 190.454,
    "text": " spend a couple minutes on each of the questions and at any point there are the affordances of just listening and also of course re-watching this recording there's also the affordance in gather to raise your hand if you'd like to share on that question that we're going to have up and additionally in the um by clicking on the answers in discourse",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 191.673,
    "end": 219.075,
    "text": " that will pull up like a focused view on that question and everybody can collaboratively edit the answers and discourse and so it's better to like add and be noisy even if it's a bullet point list or an incomplete sentence or there's incoherence or it's contradictory those are all fine it just like adds information and perspectives to the question so yeah we're gonna go to each question open up the answers and discourse",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 221.055,
    "end": 248.847,
    "text": " read the question see what has already been contributed in the answers and discourse and then also like if people want to share other thoughts that they're having that's awesome and then also if anybody wants to be like taking other notes just things that are coming to mind that they don't want to share in a speaking way or just taking some notes on what other people are saying um so let's just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 250.905,
    "end": 274.842,
    "text": " go into it and i'll be just keeping an eye for the raised hand in gather for anybody who wants to speak so um starting with this first question uh maybe we can have like a like addressed during recording or something like that but so how do you understand the distinction between the high road and the low road to active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 276.104,
    "end": 279.168,
    "text": " What do you think is interesting or useful about this distinction?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 279.949,
    "end": 285.535,
    "text": "So does anybody want to just summarize how they were thinking about the high and the low road?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 285.736,
    "end": 289.36,
    "text": "Or we can look at what others have already written here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 302.745,
    "end": 314.913,
    "text": " what is the difference between the high road and the low road are there other roads are there high and low roads to other theories what is this metaphor with the roads",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 330.902,
    "end": 333.824,
    "text": " So let's check out, yes, Ali and then Mallory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 338.207,
    "end": 344.892,
    "text": "Well, I believe it's just another term for top-down or bottom-up approach in a kind of way.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 345.792,
    "end": 351.136,
    "text": "And well, the high road, I believe, starts from...",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 353.014,
    "end": 381.212,
    "text": " the actualized mind itself and tries to derive the underlying mechanisms or underlying principles but the barma approach or the in other words low road tries to start from the elements tries to start from the unorganized elements let's say and",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 382.811,
    "end": 389.514,
    "text": " uh, derive the higher mechanisms or higher order mechanisms, uh, actualizing the mind itself.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 392.695,
    "end": 393.055,
    "text": "Thank you.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 393.436,
    "end": 393.776,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 394.536,
    "end": 394.916,
    "text": "Valerie?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 398.538,
    "end": 409.162,
    "text": "Um, yeah, I was just gonna maybe recapitulate, I guess what I wrote in the comments and I see now that I probably should have written straight in the answers and discourse section.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 409.202,
    "end": 409.923,
    "text": "So sorry about that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 409.943,
    "end": 410.423,
    "text": "Um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 411.493,
    "end": 439.492,
    "text": " But I really appreciated this schematic because I've read papers that I think come at active inference from both of these angles and in trying to understand, I don't know, the framework, I think it wasn't super clear to me how all of these different terms that are like really nicely outlined in this figure",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 440.633,
    "end": 444.474,
    "text": " figure 1.2 are related to one another.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 444.494,
    "end": 451.015,
    "text": "So just to have it, I think, laid out like this, it was really very, very helpful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 451.035,
    "end": 465.819,
    "text": "And I think still being kind of new to the concepts and such, I liked the way they framed it in terms of kind of the high road describing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 468.971,
    "end": 473.673,
    "text": " the kind of what and why and the low road being more about the how.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 473.693,
    "end": 480.757,
    "text": "I thought that was really very useful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 480.777,
    "end": 486.22,
    "text": "So yeah, I really, I loved it and I saved it and we'll probably reference it quite often.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 488.462,
    "end": 511.308,
    "text": " yeah agreed it's it's really uh useful and it it touches on aristotle's multiple y's where some of the y's are are more like hows um or they're sort of proximate mechanisms or more ultimate mechanisms um and and we can like look at figure 1.2 so active inference is in the middle",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 512.148,
    "end": 540.091,
    "text": " and the high road i guess this is the starting train stop here with a free energy principle which some later questions also might invoke and then it kind of goes down to active inference whereas starting with bayes theorem also gets us to sentience behavior sentient being like sensing and feeling and acting not as much on the um qualia and experiential side",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 541.033,
    "end": 565.061,
    "text": " um so what else do we have in the answers so high road what and why that is starting with sort of the organismal imperative or or like um ali i think said there that the actualized mind and then what are the underlying principles that make adaptive behavior adaptive behavioral systems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 566.343,
    "end": 584.131,
    "text": " working down you know the castle in the sky is the adaptive behavior and intelligent cognitive behavior what is under it and then the low road doesn't begin with that imperative it starts with like the elements like the low road starting with bees",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 585.669,
    "end": 611.178,
    "text": " none of these necessarily have to be or at least maybe until you get to like bayesian brain these don't have to be adaptive a generative model doesn't have to be resisting entropy so it's sort of like here's where we see a lot of the elements in the machinery and then on the top is more of the self-organization resistance to dissipation autopoiesis how are you going to get there you have to be minimizing your surprise",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 612.802,
    "end": 631.907,
    "text": " what does that actually entail and then active inference is like this intermediate stop and again maybe there's other roads or there's other paths um yeah so any other thoughts on high road and low road or we'll continue to the next question",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 632.81,
    "end": 643.719,
    "text": " This is just being introduced in chapter one because the following chapters two and three, which we're gonna get to after the appendix A and B are going to detail the low road and the high road.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 645.501,
    "end": 650.745,
    "text": "So this is kind of like a map for some of the next steps that we're gonna be engaging in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 653.407,
    "end": 653.627,
    "text": "Okay."
  },
  {
    "start": 656.59,
    "end": 657.731,
    "text": "Next question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 659.552,
    "end": 660.093,
    "text": "The concept",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 661.536,
    "end": 665.32,
    "text": " of organisms minimizing surprise is introduced on page six.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 666.221,
    "end": 672.188,
    "text": "How are prior assumptions or beliefs established when the organism is in new or novel environments?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 678.194,
    "end": 682.539,
    "text": "So anyone can raise their hand or take a note here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 698.086,
    "end": 700.078,
    "text": " Mallory or Ali with raised hands?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 712.652,
    "end": 719.177,
    "text": " One helpful approach might be to think about like the questions asking about new and novel environments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 719.838,
    "end": 727.464,
    "text": "So are we dealing with categorical novelty or with like quantitative novelty?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 727.904,
    "end": 733.068,
    "text": "Like I was measuring the temperature and then I'm in a new environment where the temperature is different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 733.988,
    "end": 749.911,
    "text": " that's one type of novelty, but there might also be like this like novelty at an even higher level with like, I was looking at, previously I was looking at temperature and now I'm in a place where I'm having priors about smell.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 750.591,
    "end": 758.393,
    "text": "So that's like a sort of intermodal or like a different type of thing that's being tracked.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 758.413,
    "end": 759.813,
    "text": "So that's a categorical novelty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 761.178,
    "end": 766.463,
    "text": " as opposed to just updating the temperature parameter in a different temperature room.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 770.226,
    "end": 775.972,
    "text": "Whether the person who asked it is here or not... Oh yes, Ali and Mike, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 781.831,
    "end": 803.826,
    "text": " Yeah, well, again, if we're talking about the human mind, I mean, from the priors, we can infer that, well, it's something that's kind of innate in human minds, something wired in.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 805.607,
    "end": 813.169,
    "text": " I mean, perhaps genetically or in any other biologically hardwired way.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 814.289,
    "end": 825.852,
    "text": "But, well, again, yes, the definition of novel situation varies according to what we're exactly referring to.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 826.832,
    "end": 834.114,
    "text": "And if a novel situation is something that the organism hasn't",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 835.634,
    "end": 847.877,
    "text": " ever presented with, well, in that case, these priors or these innate tendencies won't help it very much.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 848.357,
    "end": 864.641,
    "text": "So in that case, it should probably go along the way of constructing posteriors more actively, I believe, than in any regular situation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 866.783,
    "end": 867.284,
    "text": " Thank you, Ali.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 868.465,
    "end": 870.749,
    "text": "Jessica, and then Mike, and then Steve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 873.312,
    "end": 874.214,
    "text": "Hi.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 874.734,
    "end": 877.538,
    "text": "I think maybe in this situation, even though",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 879.062,
    "end": 882.944,
    "text": " The agent might be encountering something that has an experience before.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 883.044,
    "end": 892.889,
    "text": "They might use something as proxy that they already know and sort of like project those understanding into that new situation.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 893.449,
    "end": 900.953,
    "text": "And then it's through action, et cetera, then they're going to be updating like, okay, how true is it or isn't to what they understand.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 901.133,
    "end": 908.357,
    "text": "But they might be making some kind of projection based on what they already know and things that look similar to that new experience.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 911.263,
    "end": 911.944,
    "text": " Awesome, thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 912.384,
    "end": 913.185,
    "text": "Mike and Steven.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 915.027,
    "end": 916.589,
    "text": "Yeah, I was just going to comment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 917.249,
    "end": 933.366,
    "text": "In the case where the organism is brand new and has no experience, I think Ali's comments covered this a bit, that it will have to be updating its priors fairly rapidly and presumably starting with sort of a wider distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 940.196,
    "end": 940.436,
    "text": " Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 940.876,
    "end": 941.197,
    "text": "Steven?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 951.103,
    "end": 951.363,
    "text": "Yes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 951.903,
    "end": 965.191,
    "text": "Along the lines of what Jessica was saying, there has been some work in systematizing that as case-based reasoning, not necessarily in a",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 966.55,
    "end": 989.741,
    "text": " Bayesian framework here, but as a derivative of expert systems where when you get a new scenario, you try to match that against previous scenarios that you've already seen and adapt it however necessary to meet the new observations.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 991.522,
    "end": 995.804,
    "text": "So that might be a place to look for inspiration.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 998.463,
    "end": 1022.054,
    "text": " thanks yeah and in in the ontology work and in a lot of these questions there's often like a narrow answer and then a broader answer like the narrow answer would be well again if all your bayesian model is doing is looking at the thermometer reading and then doing a kalman filter and inferring the temperature in the room",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1022.995,
    "end": 1033.522,
    "text": " Well, then the answer of what happens when you put it underwater or what happens when you ask it to predict scent, it's kind of like a trivial answer, which is it's just not a parameter in that script.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1035.043,
    "end": 1035.703,
    "text": "Nothing happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1036.664,
    "end": 1044.189,
    "text": "And then that's like the narrower answer, which is often very deflationary or like very trivial answers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1044.85,
    "end": 1052.435,
    "text": "And then there's also a broader question, like in the ecological context or in the organismal context, in the expert applied context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1053.496,
    "end": 1075.477,
    "text": " what happens when there are these different qualitative and quantitative types of novelty and so sometimes it's like um there we are in the middle again with the deflationary or the narrow being too obvious and too simple to be brought into action and then the bigger question like how do experts in medicine or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1077.29,
    "end": 1082.053,
    "text": " some other field, how do they handle different types of novelty?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1082.193,
    "end": 1084.754,
    "text": "That's its own research question and agenda.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1090.458,
    "end": 1090.738,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1091.739,
    "end": 1095.961,
    "text": "Any other thoughts on this question about priors?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1096.461,
    "end": 1101.905,
    "text": "And it's also a very important note that surprise is always relative to expectations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1102.881,
    "end": 1128.353,
    "text": " which are priors in the bayesian context and those are granted by the generative model so surprise is not just free floating it's in relationship to the outcomes as expected by an organism for example jessica your hands raised otherwise we'll go to the next question awesome okay this question i think is pretty similar to the previous",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1129.688,
    "end": 1132.669,
    "text": " So if anybody wants to give a thought, otherwise, no worries.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1133.669,
    "end": 1137.65,
    "text": "Are the high road and low road the only roads to active inference, or might Act-Inf be like Rome?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1138.45,
    "end": 1140.311,
    "text": "Which I guess we can unpack a little bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1141.391,
    "end": 1144.072,
    "text": "Many slash all roads leading to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1152.234,
    "end": 1152.574,
    "text": "J.F.?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1155.235,
    "end": 1157.856,
    "text": "Yes, it's more of a general question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1160.669,
    "end": 1182.519,
    "text": " For example, if what you're trying to understand is race cars, and you develop a mathematical framework, given a number of measurements like the weight of the car, the length of the car, the torque of the engine, the adhesion of the tires, the friction and whatnot, you're able to predict how well the race car is going to perform in different conditions and whatnot.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1183.799,
    "end": 1185.66,
    "text": "Does that mean that you're an expert in race cars?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1185.7,
    "end": 1187.341,
    "text": "Does that explain the race car?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1187.381,
    "end": 1189.222,
    "text": "Could you engineer a race car",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1190.083,
    "end": 1191.624,
    "text": " based on this knowledge.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1192.404,
    "end": 1214.838,
    "text": "So talking about multiple different roads, one road through the free energy principle, I think, is an analytical road that looks at the outcomes of the machinery of the living beings that try to maintain homeostasis.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1215.559,
    "end": 1219.041,
    "text": "But how much does it say about the implementation",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1219.918,
    "end": 1222.319,
    "text": " of those organisms?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1224.32,
    "end": 1230.942,
    "text": "It says many things, but does it say everything that we might deem interesting?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1233.123,
    "end": 1243.847,
    "text": "So what are the limitations of this framework, the active inference framework defined by the free energy principle?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1243.967,
    "end": 1246.748,
    "text": "What are its limitations on top of what",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1249.463,
    "end": 1252.885,
    "text": " given its capabilities, which are, I think, enormous.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1252.925,
    "end": 1254.126,
    "text": "But there are limitations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1254.166,
    "end": 1264.333,
    "text": "And if there are limitations, that means there must be other roads that can be taken to circumvent these limitations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1267.055,
    "end": 1267.395,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1267.475,
    "end": 1268.256,
    "text": "Great comment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1268.616,
    "end": 1268.776,
    "text": "Ali?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1273.982,
    "end": 1284.632,
    "text": " Well, Deleuze and Guattari in A Thousand Plateaus has laid out the concept of rhizome.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1285.072,
    "end": 1291.257,
    "text": "I don't know if you're familiar with the concept of rhizome as opposed to an arborescent structure.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1292.098,
    "end": 1295.761,
    "text": "Well, basically, the concept of rhizome",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1297.663,
    "end": 1311.999,
    "text": " expounds a structure, a knowledge structure in which every concept can potentially be connected to every other concept without having to go through a principal trunk",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1313.44,
    "end": 1317.584,
    "text": " of a knowledge tree, let's say.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1317.985,
    "end": 1328.495,
    "text": "But in an arborescent structure, an arborescent knowledge structure, everything branches from a principal trunk, from a principal",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1330.375,
    "end": 1331.275,
    "text": " let's say, base.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1332.776,
    "end": 1341.478,
    "text": "And I believe that in active inference, a rhizomatic approach can also be explored.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1342.218,
    "end": 1358.022,
    "text": "And I mean, not only by approaching two different concepts via the high road or the low road main or principal trunk.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1359.378,
    "end": 1365.582,
    "text": " it can potentially be approached from seemingly unrelated concepts too.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1370.226,
    "end": 1371.206,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1371.426,
    "end": 1386.297,
    "text": "To maybe even approach a limitation or a seemingly unrelated concept, both the high and the low road in this textbook are formal, and they're both grounded in mathematical symbols.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1387.412,
    "end": 1405.093,
    "text": " so are there qualitative or non-mathematical roads maybe some of the early roads are mathematical but is it possible that a future road or path or tunnel or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1406.178,
    "end": 1435.163,
    "text": " choose your travel metaphor might not be that case and then then thanks for sharing that um the resource there because um this is another interesting angle which um various people have traced this evolution of visual metaphor where it's like things are ladder-like and scalar and then there's more of a bifurcating tree and then that becomes um critiqued or complexified into more of a network",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1436.189,
    "end": 1457.932,
    "text": " like with integration among species for example so there's sort of this movement from linear through a tree like a directed acyclic graph towards something that's more networked so that's um a lot of interesting ideas anything else that people want to add or we'll continue on okay",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1461.041,
    "end": 1468.748,
    "text": " On page 10, they write, creatures engaging in active inference actively seek out salient sensory observations that resolve their uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1469.709,
    "end": 1476.134,
    "text": "So what is the relationship between salience and the kind of observation that reduces uncertainty?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1476.975,
    "end": 1481.699,
    "text": "Why is the relationship between salience, observation, and uncertainty this way?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1482.86,
    "end": 1488.045,
    "text": "How does active inference frame this relationship similarly or different from which other specific frameworks?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1490.222,
    "end": 1513.13,
    "text": " so someone wrote I like this question a lot eager to get a better understanding of what constitutes salience is salience referencing information that is self-evidence or information that is precise and surprising or dot dot dot yes I think um attention and salience is addressed more in papers on active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1515.154,
    "end": 1535.588,
    "text": " than at least just from a preliminary pass of the book so attention and metacognitive mechanisms are not going to be um a core feature in the book however there's again been a lot of interesting work on like the neurobiology and the computational aspects of salience and attention",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1541.158,
    "end": 1547.143,
    "text": " We can click on the word and see a definition, but this is not like the final definition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1547.383,
    "end": 1550.565,
    "text": "This is just what some have gotten to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1551.186,
    "end": 1557.17,
    "text": "Salience is the extent to which a cue or an observation commands the attention of an agent given their regime of attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1557.631,
    "end": 1565.277,
    "text": "So potentially a little bit tautological, like a salient observation is something that is grabbing attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1565.457,
    "end": 1567.538,
    "text": "A salient cue is something that commands attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1568.119,
    "end": 1568.339,
    "text": "Steven?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1575.34,
    "end": 1584.783,
    "text": " Yes, I would say that, especially if we're defining it in that way, that there are two elements to salience.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1585.503,
    "end": 1592.365,
    "text": "And one is what was pointed out in the question, I guess, that you are reducing...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1593.593,
    "end": 1599.815,
    "text": " uncertainty, but there is also the question of what uncertainty is worth reducing.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1600.695,
    "end": 1608.197,
    "text": "And that gets into utility and where it makes sense to explore.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1608.217,
    "end": 1620.4,
    "text": "So I don't know if we want to choose to change the definition of salience to just be the second of those or leave it as having both of those elements.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1623.291,
    "end": 1623.551,
    "text": " Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1625.151,
    "end": 1625.552,
    "text": "Mallory?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1628.172,
    "end": 1650.598,
    "text": "I think something I don't necessarily understand, which I would appreciate maybe somebody speaking to a little bit is, and this is related actually to a question I've put in earlier about the distinction between perception and learning, but something that grabs attention",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1652.577,
    "end": 1659.718,
    "text": " Are we distinguishing, so that would say that something is, like the point that was just made, something is salient if it reduces uncertainty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1661.239,
    "end": 1676.802,
    "text": "If we're also attending to things in order to actively construct a niche that is consistent with our model of the world, would we not consider that something",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1678.936,
    "end": 1686.402,
    "text": " like that object as attracting attention as opposed to our, like, how do we distinguish, I guess, between active sampling and attending?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1686.422,
    "end": 1689.945,
    "text": "Um, and how is that related to salient?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1689.985,
    "end": 1700.835,
    "text": "So something salient, either if it, um, is surprising or if it is like, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1703.18,
    "end": 1708.081,
    "text": " serving the purpose of kind of like fulfilling a prediction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1708.101,
    "end": 1711.122,
    "text": "I'm not sure I understand that kind of distinction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1711.142,
    "end": 1712.402,
    "text": "I'm not sure that makes sense, but.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1713.922,
    "end": 1715.083,
    "text": "Awesome question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1715.723,
    "end": 1725.985,
    "text": "And this is one reason why looking at the formalisms and how they're framed will help us because in the purely English linguistic realm,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1727.25,
    "end": 1731.611,
    "text": " We could imagine sentences of any type.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1732.491,
    "end": 1740.433,
    "text": "So in the active inference formalisms, what are being tagged with salience?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1740.853,
    "end": 1743.154,
    "text": "Which variables are said to reflect salience?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1743.294,
    "end": 1755.697,
    "text": "And then are they, or in what ways are they related to this concept of surprise, which we're gonna get to in a question soon, versus utility?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1756.593,
    "end": 1766.56,
    "text": " And this is also speaking to the way that expectations and preferences in active inference are framed differently than in certain other frameworks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1768.982,
    "end": 1773.245,
    "text": "Can I jump in and just ask another question about this question rather than an answer, which is...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1775.37,
    "end": 1780.895,
    "text": " Wouldn't some data be salient even if it's sensible?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1781.095,
    "end": 1782.797,
    "text": "We might have two levels of salience.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1783.618,
    "end": 1793.427,
    "text": "So I just put this quote in about the notion of a umfeldt being a more or less broad series of elements called carriers of significance or marks, which are the only things that interest the animal.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1793.867,
    "end": 1799.793,
    "text": "Now, interest the animal is one thing, but even just perceiving those marks as existing, I mean, active inference does have room for that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1800.313,
    "end": 1803.774,
    "text": " in terms of each agent having some sensory data.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1803.854,
    "end": 1812.777,
    "text": "So you could say, well, since I can't see infrared light, it's not salient to me when I'm out in a field of flowers.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1812.857,
    "end": 1814.938,
    "text": "But a bee can see that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1816.038,
    "end": 1817.919,
    "text": "I think it can see infrared or ultraviolet.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1817.939,
    "end": 1821.42,
    "text": "I can't remember which one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1821.44,
    "end": 1828.242,
    "text": "So it may be a salient concept for me as a thinking agent, but it's not one that's salient for me when I'm navigating a field of flowers, basically.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1831.502,
    "end": 1831.742,
    "text": " Nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1831.942,
    "end": 1833.503,
    "text": "Thanks for bringing in umwelt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1833.784,
    "end": 1840.508,
    "text": "And a lot of ecological psychology terms do make their way to act-inf.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1841.068,
    "end": 1844.15,
    "text": "And so then you brought up like levels of perception salience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1844.27,
    "end": 1847.652,
    "text": "For example, there's things that are outside of the wavelength that can be perceived.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1848.093,
    "end": 1851.315,
    "text": "So photons are not going to be perceived at that wavelength.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1851.855,
    "end": 1858.74,
    "text": "But then there might be within the visible range novel arrangements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1859.568,
    "end": 1860.889,
    "text": " There's something moving there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1861.77,
    "end": 1867.036,
    "text": "Or there might be something that is static yet commands attention, like the Mona Lisa.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1868.297,
    "end": 1881.672,
    "text": "So what is happening when somebody's regime of attention is fixated on a static artifact versus something where they're being fixated on something that's rapidly changing, like a movie?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1887.819,
    "end": 1890.34,
    "text": " Mallory, in the chat you wrote, can folks recommend papers?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1890.54,
    "end": 1894.782,
    "text": "So definitely people can recommend papers anywhere they see fit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1895.422,
    "end": 1899.944,
    "text": "And one place to check out is in the bottom of our coda in the live streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1901.304,
    "end": 1910.108,
    "text": "Under the live stream tab, you'll find like 45 papers that we've relatively extensively discussed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1911.288,
    "end": 1916.831,
    "text": "And so these are not like the only or the canonical papers or anything, but there's a lot of important ones in there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1917.719,
    "end": 1929.248,
    "text": " So especially if you're interested in looking at papers where people in the lab might have familiarity or there's some things to listen to or watch about it, then these are some good places to start.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1929.268,
    "end": 1932.891,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1934.692,
    "end": 1935.032,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1935.773,
    "end": 1936.693,
    "text": "Next question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1936.713,
    "end": 1940.316,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1940.757,
    "end": 1942.498,
    "text": "This is a contextualization question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1943.218,
    "end": 1946.061,
    "text": "This is not a metadata contextualizing sentence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1946.98,
    "end": 1950.842,
    "text": " On page 9 and 10, they talk about differences from alternative frameworks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1951.042,
    "end": 1959.087,
    "text": "For example, in contrast with other frameworks, policy selection in active inference automatically balances exploration and exploitation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1960.168,
    "end": 1965.551,
    "text": "And later, active inference extends the inferential approach to domains of cognition that are rarely considered.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1967.252,
    "end": 1976.077,
    "text": "What are five to seven examples, names in a sentence, of other theories and frameworks that active inference improves upon or updates?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1978.325,
    "end": 1979.646,
    "text": " Anyone can raise their hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1979.766,
    "end": 1986.53,
    "text": "This is an excellent homework slash collaborative StigmaG question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1987.051,
    "end": 2005.343,
    "text": "Because even if each person only thought of one novel answer here with a link and a name, or somebody improved what somebody else had already brought, very quickly, as a textbook group, we could have quite a coherent and comprehensive list.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2009.123,
    "end": 2016.431,
    "text": " The idea of balancing exploration and exploitation, so-called, is going to be a key theme.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2017.933,
    "end": 2023.378,
    "text": "And the way that Active Inference does handle this trade-off",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2024.565,
    "end": 2052.231,
    "text": " not through the use of like an exploratory mode or exploitative mode or some parameter that is like governing the the handoff there like some sort of you know x times exploration plus one minus x of exploitation that is like one approach that's commonly used but it would be um a question of like where you know what citations use that type of an approach and it's going to come",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2054.113,
    "end": 2078.164,
    "text": " to the epistemic and pragmatic value whereas um when there's little epistemic value to be gleaned little informational uncertainty result to resolve then pragmatic value can be pursued which is reducing the surprise about outcomes in relationship to preferences and then on the other hand when there's a lot of uncertainty",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2079.835,
    "end": 2107.126,
    "text": " exploratory behavior might be engaged in because there isn't enough certainty around how to pursue those pragmatic aims and these are going to come into play with like the teammates mouse model that's going to be later in the book but this is a great question so anyone want to like just give an example of some other theory or framework or some other approach to thinking about exploration exploitation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2122.097,
    "end": 2131.771,
    "text": " One starting reading if anyone is interested there is a 2015 paper that is looking at exploration and exploitation trade-offs in different domains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2132.132,
    "end": 2132.292,
    "text": "Ali?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2135.883,
    "end": 2155.969,
    "text": " Well, I don't know if it necessarily improves upon, but certainly an alternative approach to this theory can be Steven Grossberg's art theory, the adaptive resonance theory that we talked about in the previous session.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2156.989,
    "end": 2162.391,
    "text": "In that theory, the problem of learning and cognition",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2164.003,
    "end": 2170.025,
    "text": " is attacked from the viewpoint of solving the stability slash plasticity dilemma.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2170.825,
    "end": 2192.633,
    "text": "And in this context, in the context of art or adaptive resonance theory, well, or let's say the difference between the active inference, one of the main differences between the active inference or any predictive coding schemes from adaptive resonance theory is that",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2193.621,
    "end": 2223.393,
    "text": " In Bayesian models, generally, the fully suppressive matching circuits, I mean, the circuits that can propagate the information, it cannot solve the stability slash plasticity dilemma as opposed to the ART or adaptive resonance theory.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2227.529,
    "end": 2241.814,
    "text": " So plasticity being more exploratory and openness to updates and stability being more like parametric lock-in, more exploitative within a certain realm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2241.875,
    "end": 2248.997,
    "text": "Yeah, the plasticity refers to a system that doesn't have catastrophic forgetfulness.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2257.395,
    "end": 2257.715,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2262.918,
    "end": 2263.159,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2263.259,
    "end": 2267.401,
    "text": "So we can just, you know, have this question up and check back and people can add things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2268.081,
    "end": 2270.163,
    "text": "We'll just look at a few more questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2271.223,
    "end": 2281.91,
    "text": "So on page eight, they write, the high road perspective is useful to understand the normative nature of active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2283.351,
    "end": 2303.298,
    "text": " what the living organisms must do to face their fundamental existential challenges minimize free energy and why the what and the why in the high road why to vicariously minimize the surprise of their sensory observations what does it mean to minimize surprise vicariously",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2304.571,
    "end": 2307.334,
    "text": " So someone has written, interesting choice of words.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2307.994,
    "end": 2309.295,
    "text": "Here are two possible answers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2309.716,
    "end": 2313.679,
    "text": "Also the authors or the readers, participants may have something else in mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2314.66,
    "end": 2323.869,
    "text": "Vicarious might refer to the point on page six that agents cannot tractably minimize surprise as the authors technically defined it in chapter two coming up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2324.75,
    "end": 2330.255,
    "text": "So instead they're gonna minimize an approximation to surprise, which is variational free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2331.749,
    "end": 2345.959,
    "text": " However, I'm not sure if they're referring to the two types of surprise that are going to be approached in chapter two, which is the marginal surprise, like informational surprise, and then the Bayesian surprise, or both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2346.579,
    "end": 2354.404,
    "text": "So one option is surprise as defined, one way or the other or both, cannot be directly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2355.578,
    "end": 2383.988,
    "text": " calculated or it's not tractable to to pursue and so the vicarious could mean like indirect or via a proxy and in that case something like variational free energy is being vicariously minimized and then that is going to be used to get at the surprise minimization and the second option the person has written vicarious might refer to the point that agents minimize free energy not only in response to real sensory observations but in anticipation of them",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2385.066,
    "end": 2392.652,
    "text": " Those anticipations could come from internal simulations by subroutines or other modules or memory from recall of past observed events.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2395.414,
    "end": 2405.322,
    "text": "Page 32, which is probably in chapter two, the author seemed to be referring to engaging models vicariously in a counterfactual sense, dealing with imagined surprise at presumed observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2406.403,
    "end": 2408.645,
    "text": "So these are really important comments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2416.448,
    "end": 2438.457,
    "text": " have the indirect minimization of surprise using a proxy so some type of heuristic to minimizing surprise now and so that is vicarious but contemporary and then the second sense is whether we're using a proxy or not is referring to um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2442.091,
    "end": 2460.441,
    "text": " observations that haven't occurred so anticipated or expected observations some of these hopefully we'll come back to in chapter two",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2461.906,
    "end": 2463.447,
    "text": " But these are important questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2463.907,
    "end": 2472.91,
    "text": "And it's going to speak to variational free energy and expected free energy and free energy of the expected future, a few other constructs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2473.55,
    "end": 2474.03,
    "text": "Stephen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2474.57,
    "end": 2475.891,
    "text": "And then I'll leave.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2475.911,
    "end": 2478.932,
    "text": "Yeah, I put that last comment in.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2478.972,
    "end": 2482.833,
    "text": "I was just thinking that should probably go under number two there.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2483.113,
    "end": 2487.574,
    "text": "I guess that would be evidence of that second interpretation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2488.795,
    "end": 2489.055,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2492.466,
    "end": 2496.57,
    "text": " Okay, so we'll maybe return to this in chapter two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2496.59,
    "end": 2501.776,
    "text": "Okay, let's just see if we can look up just a few of these questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2501.836,
    "end": 2503.177,
    "text": "It's awesome, like how many there are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2503.337,
    "end": 2507.061,
    "text": "And of course, anyone can always read and contribute asynchronously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2509.424,
    "end": 2509.744,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2511.989,
    "end": 2539.833,
    "text": " subtitle of the book is the free energy principle in mind brain and behavior what is the relevant distinction between mind and brain in the context of the free energy principle someone has written really appreciate how the researchers have started proposing biological implementations of active in the brain",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2541.016,
    "end": 2559.934,
    "text": " it's not clear to me how this maps onto related psychological concepts like colloquial surprise prediction salience arousal yeah awesome and there's been some recent work and some work that we're going to be looking at in um live stream 46 on active inference and folk psychology",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2560.908,
    "end": 2590.017,
    "text": " about connecting some of the formalisms to to folks psychological concepts so that's one place we'll be looking at that but um how does or does active approach this mind brain question whether the Cartesian dualist question hard problem of Consciousness intentional stance of Dennett",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2593.308,
    "end": 2595.029,
    "text": " Why is the subtitle of the book that way?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2608.956,
    "end": 2611.017,
    "text": "Jessica, and then anyone else with a raised hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2612.049,
    "end": 2612.429,
    "text": " Um, yes.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2612.51,
    "end": 2617.594,
    "text": "I mean, I don't know the answer, but I, I guess make a guess.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2617.674,
    "end": 2622.998,
    "text": "I think maybe the, um, mine would be more the cognition and the brain looking at the physiology.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2623.018,
    "end": 2628.623,
    "text": "Um, and then, you know, looking at behaviors, that would be my guess.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2633.507,
    "end": 2633.727,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2634.188,
    "end": 2634.468,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2636.49,
    "end": 2640.153,
    "text": "The bacterium does not have a brain, but does it have a mind?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2641.826,
    "end": 2668.503,
    "text": " also great questions we'll just continue just um these questions with fewer upvotes because there's a bunch just so we can get them in so generative model is used in the singular or is using the singular as in the generative model or in the plural as in hierarchical generative models is a generative model composed of generative models i.e is it structurally fractal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2671.894,
    "end": 2682.619,
    "text": " Someone has written, personally, I think the answer is yes, or it's possible to answer yes, via referencing a paper that talks about blankets of blankets, Markov Blankets Life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2682.879,
    "end": 2700.087,
    "text": "This paper definitely does think about the nesting of multi-scale complex systems in terms of like nested generative models that then are constituting, yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2701.448,
    "end": 2705.757,
    "text": " that are then constituting generative models at a higher level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2706.719,
    "end": 2712.431,
    "text": "So there's people with their generative model, and then the team has a generative model of a different type, JF.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2713.769,
    "end": 2733.427,
    "text": " Yes, but even an individual, myself, yourself, could be characterized as having a generative model composed of other generative models dealing with less abstract umwelt, for example.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2735.444,
    "end": 2753.227,
    "text": " So I think, yes, almost trivially in the sense of a collective, but in the sense of an individual, does an individual also can be said to possess a generative model that is itself composed of sub generative models?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2755.171,
    "end": 2783.429,
    "text": " awesome point and we've in several live streams and settings discussed like there's one sense where nesting is used to refer to systems that are like potentially even physically nested and then we also see the nesting architecture for example here it's live stream number 25. when we discussed it but this is a nesting of attentional and cognitive models",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2784.932,
    "end": 2803.471,
    "text": " so this is even of a so-called individual so what is it about model nesting when sometimes it can refer to physical enclosure and other times it is something that enables counterfactual reasoning attention and metacognition",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2804.963,
    "end": 2806.345,
    "text": " So what is the nesting?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2807.046,
    "end": 2816.818,
    "text": "And if someone is just seeing this kind of a notation or this kind of a graph for the first time, we're gonna totally go into it, but it's gonna be one of the core formalisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2817.158,
    "end": 2820.603,
    "text": "And also this paper is gonna deal with nested models and other papers do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2821.063,
    "end": 2823.146,
    "text": "The textbook is gonna spend almost all the time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2824.267,
    "end": 2852.477,
    "text": " um on just one level so just sort of the kernel or the essence or the archetype or the essential motif of this partially observable markov decision process and the textbook is going to focus on juxtaposing the discrete time partially observable markov decision process with the continuous time but it will deal less with hierarchical nesting but it does bring it up but it's not going to be focused on okay",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2854.56,
    "end": 2877.584,
    "text": " what is the information content of a prediction I'm just going to read these ones just so that those who are listening can see like the kinds of questions that they could be adding or addressing this question has to do with the relationship between active inference and pleasant surprises potentially even love languages receiving money on the pavement page five",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2879.318,
    "end": 2903.554,
    "text": " is speaking to the author's rhetoric around theory, proliferation, and integration, where basically they are saying, well, we could have a dedicated explanation for every neurotransmitter, for every synaptic junction, every unique behavior, every cognitive phenomena, or we could somehow utilize first principles, whatever those are, to result in theory integration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2904.654,
    "end": 2906.896,
    "text": "And that gets mapped onto the scruffies and the neats",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2911.374,
    "end": 2932.498,
    "text": " is it really helpful to redefine terms such as probability and surprise to sometimes mean utility and diversions from utility if that's what the authors are doing there appears to be an unhealthy ambiguity in how they use these terms this is where the formalisms are going to really come into play um and also the um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2934.636,
    "end": 2945.358,
    "text": " The live stream on Free Energy, a user's guide 37 deals with this dual interpretation of expectations and preferences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2945.718,
    "end": 2964.062,
    "text": "And this is like one of the most essential differences between active inference and reward learning or reinforcement learning frameworks is a dual deployment of the same variable in formalisms to represent preferred states as well as expected states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2965.066,
    "end": 2968.287,
    "text": " like homeostatic range is expected and preferred.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2968.528,
    "end": 2972.469,
    "text": "It's where one wants to be found and it's where one expects to be found.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2973.05,
    "end": 2984.074,
    "text": "And so one can realize those preferences by reducing their surprise about the observations rather than saying, well, homeostatic states are valuable and we're gonna pursue maximum value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2987.416,
    "end": 2991.598,
    "text": "How might an acceptable state space relate to the idea of a comfort zone?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2992.848,
    "end": 3021.537,
    "text": " seems the acceptable state space for an organism is necessary for it to persist whereas a comfort zone seems to be a less necessary state repertoire which if exceeded may only indicate to an organism that it's at risk of leaving the acceptable state space interesting and then the last written question here looking ahead into part two have people been looking in the computational complexity of the active inference model and how far are we in terms of making this computable",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3023.979,
    "end": 3049.207,
    "text": " and the reference 2019 paper computational resource demands of the predictive bayesian brain excellent and important question to understand like the analytical computational complexity like the big o notation does nesting a model make it two or is it you know log the number of levels or is it number of levels to the some exponents",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3050.917,
    "end": 3059.453,
    "text": " And then also in practice, like using active block for ints or PyMDP, what is the actual runtime of different algorithms?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3060.737,
    "end": 3089.913,
    "text": " so um this is awesome with the questions that everyone's added to one like we're going to keep on returning to chapter one just like we're going to keep on returning to ideas but people can fold it and continue to add to two and to the appendices which we're gonna go to next week um so just as a reminder next week we're going to be approaching appendix a and b which are mathematical and so just a few thoughts on that before we return back to the ideas in the book",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3091.016,
    "end": 3119.507,
    "text": " in appendix a you can see that all the equations have already been added so if anyone like wants to reference like what does equation a point 44 mean um and obviously like there's 60 equations and you could get your phd learning about some sub function of just one so we're just trying to familiarize and get a first coat of paint so for those with different mathematical backgrounds if somebody can derive the proof",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3120.635,
    "end": 3140.687,
    "text": " amazing let's take some notes on it and if somebody is just going to be asking beginner questions that's also very important so um that will be in next week's questions and discussions but let's just look at what ideas people wrote and then see if there's any ideas percolating so um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3141.86,
    "end": 3150.528,
    "text": " having addressed some specific uncertainties, I get with the questions, we can think about like, what are some impressions that people were having?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3151.368,
    "end": 3153.33,
    "text": "And like, what was exciting ideas?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3154.971,
    "end": 3162.138,
    "text": "So if Ben or Mike want to speak to this, or if anybody else like wants to share something, JF, and then anyone else?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3165.18,
    "end": 3168.003,
    "text": "Yeah, JF, and then Ben, or is your hand raised?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3169.025,
    "end": 3170.867,
    "text": " No, my hand was not raised.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3170.967,
    "end": 3172.128,
    "text": "Ben, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3173.289,
    "end": 3173.929,
    "text": "Yeah, thanks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3174.389,
    "end": 3174.85,
    "text": "Can you hear me?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3175.29,
    "end": 3175.41,
    "text": "Yep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3176.531,
    "end": 3177.172,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3177.212,
    "end": 3179.153,
    "text": "Yeah, maybe I should have posed this as a question, actually.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3180.274,
    "end": 3188.721,
    "text": "I just thought it was interesting, this connection between perception and learning as essentially the same process unfolding over different timescales.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3189.581,
    "end": 3196.407,
    "text": "Because on the one hand, this makes sense to me, because one example of learning might be, you can imagine an agent moving to a new city,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3197.413,
    "end": 3199.114,
    "text": " with which they're completely unfamiliar.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3199.535,
    "end": 3205.959,
    "text": "And the agent could sit at a fixed point in the city or walk around the city and just perceive the city.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3206.499,
    "end": 3208.781,
    "text": "And they would learn over a longer timescale.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3208.801,
    "end": 3211.563,
    "text": "They would observe certain regularities or certain occurrences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3212.543,
    "end": 3214.665,
    "text": "And clearly that's one form of learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3214.825,
    "end": 3221.589,
    "text": "But then there's maybe another example where, you know, my mathematical background's fairly weak.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3221.83,
    "end": 3226.913,
    "text": "And so if I were to try and learn the kind of fundamentals of the equations that we were just looking at,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3228.097,
    "end": 3234.462,
    "text": " No matter how, for how long I kind of perceive those equations, I'm not going to learn them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3234.502,
    "end": 3237.865,
    "text": "There's going to be that I have no access to kind of, there's no information gain there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3238.605,
    "end": 3243.669,
    "text": "It seems like to learn certain things, we need to scaffold perception in certain ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3243.729,
    "end": 3253.156,
    "text": "And so I suppose my question would be when somebody teaches us something that we don't understand, is that merely a kind of scaffolded perception of,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3253.86,
    "end": 3260.183,
    "text": " Or is that kind of learning underwritten by distinct cognitive processing completely separate from perception?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3262.204,
    "end": 3263.224,
    "text": "Great question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3263.404,
    "end": 3264.945,
    "text": "Thanks for unpacking that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3265.665,
    "end": 3271.307,
    "text": "And to give one thought, let's imagine a ball moving across the visual fields.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3272.308,
    "end": 3274.569,
    "text": "It seems like a canonical example of perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3274.609,
    "end": 3276.069,
    "text": "We're perceiving the ball.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3276.47,
    "end": 3280.751,
    "text": "But it could also be understood as parameter updating or parameter learning of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3282.677,
    "end": 3283.617,
    "text": " the location of the ball.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3284.618,
    "end": 3294.04,
    "text": "And then that's one approach, but then also you pointed towards like this deeper sense of learning, referring to like the underlying structures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3294.06,
    "end": 3304.263,
    "text": "Like in the ball movement examples, it seems like learning and perception are the same, but then learning might also refer to something deeper, like the tendencies of how balls move.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3304.443,
    "end": 3311.965,
    "text": "Or one could, as probably many of us have, look at these symbols and perceive them visually",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3313.086,
    "end": 3322.088,
    "text": " But because we wouldn't have learnt the underlying generative model that gives rise to these pixels, we could continually be surprised.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3323.548,
    "end": 3339.951,
    "text": "So what is happening when there's perception and learning seemingly happening hand in hand, and then other times where somebody's speaking a language you don't understand, you certainly hear it, you may even be paying attention to it, yet the next phoneme may still continually surprise you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3340.771,
    "end": 3341.851,
    "text": "So it's a really important question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3345.948,
    "end": 3352.073,
    "text": " And then Mike wrote, yes, please go for it, Mike.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3352.834,
    "end": 3365.504,
    "text": "Yeah, so I think these are straightforward but foundational concepts that the dependence of sensory input on action and vice versa creates a framework where we can have feedback.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3365.865,
    "end": 3370.949,
    "text": "And then the mathematical constructs let us think about how we model that and simulate it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3372.813,
    "end": 3375.355,
    "text": " Thanks for this also essential point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3375.976,
    "end": 3386.545,
    "text": "In active inference, there isn't a perception and inference module that passes the perceptions to the learning module and the learning module passes it to the decision-making module and the decision-making module to the action model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3387.005,
    "end": 3391.148,
    "text": "The inference is conditioned upon policy selection and action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3392.051,
    "end": 3407.142,
    "text": " and that is going to approach this nexus of perception cognition and action in an integrated way that not that may differ from other frameworks which was also to the point of that um previous question so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3408.359,
    "end": 3411.98,
    "text": " This was an awesome session, everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3412.561,
    "end": 3414.501,
    "text": "Really appreciated it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3415.302,
    "end": 3419.623,
    "text": "I'll upload the video recording following the meeting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3420.764,
    "end": 3429.087,
    "text": "Next week at the same time, we'll be looking at questions and ideas from Appendix A and B. So just approach those however you'd like and annotate the coda.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3430.007,
    "end": 3437.55,
    "text": "And also, if anybody wants to specify another time when they just want to discuss or co-work,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3438.888,
    "end": 3453.531,
    "text": " that can be added or in the act in flab discord people can like join and we can have like a voice like a study hour or just a time to talk about stuff or write down the questions we have so awesome work everybody thanks a lot",
    "speaker": "SPEAKER_01"
  }
]