[
  {
    "start": 6.943,
    "end": 8.104,
    "text": " Hello and welcome everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8.744,
    "end": 15.268,
    "text": "It is September 14th, 2023, and we are in the course, Physics as Information Processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 15.948,
    "end": 16.768,
    "text": "It's lecture five.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 18.269,
    "end": 20.971,
    "text": "Looking forward to this lecture and then a little conversation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 20.991,
    "end": 21.731,
    "text": "Chris, off to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 21.871,
    "end": 22.191,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 24.973,
    "end": 25.373,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 25.974,
    "end": 26.674,
    "text": "Thank you, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.115,
    "end": 31.957,
    "text": "And welcome to session five of Physics of Information Processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 33.718,
    "end": 35.659,
    "text": "And today we're going to talk about space-time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 38.024,
    "end": 46.288,
    "text": " And particularly about the idea that space-time is emergent from information processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 47.548,
    "end": 54.672,
    "text": "And this has now become a very mainstream idea in the quantum information and quantum gravity communities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 57.593,
    "end": 58.994,
    "text": "And there's still, of course...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 61.215,
    "end": 65.197,
    "text": " some people holding out for the idea that space-time is fundamental.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 66.258,
    "end": 88.27,
    "text": "But I would say that at least in these communities, I expect it's become now the dominant idea that space-time is not fundamental, that space-time is not part of the basic ontology of reality or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 89.702,
    "end": 92.745,
    "text": " and that instead, spacetime is a construct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 93.786,
    "end": 98.451,
    "text": "So that's what today's session is going to be about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 99.892,
    "end": 111.404,
    "text": "So for those of you who are just joining or who would like a little review, we started this course talking about quantum information theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 112.862,
    "end": 122.984,
    "text": " And the idea that quantum information theory is actually a new science about systems that communicate across a boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 124.005,
    "end": 130.146,
    "text": "And the systems are always called Alice and Bob for kind of historical reasons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 131.526,
    "end": 137.608,
    "text": "And emphasize that this new science is topological.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 137.688,
    "end": 140.669,
    "text": "It's about connectivity between systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 140.869,
    "end": 142.089,
    "text": "It's not geometric.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 142.947,
    "end": 145.97,
    "text": " So it doesn't assume a spacetime embedding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 146.85,
    "end": 152.115,
    "text": "So it leaves open the possibility that spacetime is actually a construct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 152.215,
    "end": 154.817,
    "text": "It doesn't assume spacetime up front.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 156.841,
    "end": 179.767,
    "text": " And in the second session of the course, I think, we talked about how this boundary could always be represented as an array of qubits, and that what the systems on each side of the boundary do to communicate is prepare and then measure the states of these qubits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 179.887,
    "end": 182.568,
    "text": "So they communicate by exchanging",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 187.236,
    "end": 191.277,
    "text": " classical information via a quantum channel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 192.617,
    "end": 206.161,
    "text": "And this introduces a particular kind of quantum noise whenever they don't share the reference frames that they use to prepare the bits and measure the bits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 207.181,
    "end": 214.103,
    "text": "So it's not necessarily a perfect communication channel from a classical fidelity point of view,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 214.872,
    "end": 224.88,
    "text": " but all of the noise is quantum noise, it's not classical, and it always derives from differences in the reference frames that are used by the two agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 227.022,
    "end": 236.21,
    "text": "We reformulated the free energy principle in this setting, and the free energy principle turns out to be very simple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 237.262,
    "end": 244.707,
    "text": " It turns out to be a classical limit of the principle of unitarity, which is just the principle that information is conserved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 245.988,
    "end": 261.338,
    "text": "And we saw that the approach to perfect alignment between the two agents or perfect prediction on the part of the two agents becomes more challenging, not surprisingly, as system complexity increases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 262.619,
    "end": 263.62,
    "text": "So the more complex",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 264.69,
    "end": 268.953,
    "text": " the communication, the harder it is to predict, as one would expect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 271.155,
    "end": 282.064,
    "text": "In the last session, we talked about how constraints on thermodynamic free energy induce compartmentalization in agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 283.445,
    "end": 291.412,
    "text": "So whenever agents interact with their environments in fairly complex ways,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 292.955,
    "end": 299.622,
    "text": " then they end up being compartmentalized into compartments that have to communicate classically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 300.563,
    "end": 304.988,
    "text": "And this is solely a result of quantum information theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 305.028,
    "end": 309.953,
    "text": "You don't have to assume any biology to get this compartmentalization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 310.885,
    "end": 314.428,
    "text": " But clearly this is something that we see in biological systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 314.588,
    "end": 329.762,
    "text": "Not only do we see compartments, we also see hierarchical control, which is likewise a sort of automatic outcome of the theory for complex systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 331.076,
    "end": 349.27,
    "text": " And finally, last time, we talked a little bit about how these compartments communicate and introduced the idea of communication protocols that involve local operations on a shared quantum resource of some kind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 350.271,
    "end": 351.952,
    "text": " and classical communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 352.052,
    "end": 372.402,
    "text": "We talked a fair amount about how classical communication is a little bit problematic to define in quantum theory because, of course, you're introducing classicality, and so you have to make some very specific assumptions about what's classical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 373.758,
    "end": 385.944,
    "text": " And we'll see later on today what the key assumption that gives you classicality is as we talk about space time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 387.844,
    "end": 401.015,
    "text": " But before I go into the topic of space-time, I want to spend a little time... Okay, so this... Sorry, this is where we're going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 401.055,
    "end": 405.899,
    "text": "We're talking about space-time, and we'll talk about applications to biology next time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 407.28,
    "end": 412.785,
    "text": "But before we get going on this, I want to spend a little bit of time talking about explanation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 414.226,
    "end": 416.008,
    "text": "And this is motivated...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 417.282,
    "end": 426.71,
    "text": " by a question that came up, a very long question that touched on many different topics that came up in the interactive Q&A last time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 429.252,
    "end": 441.842,
    "text": "And a fair amount of that question had to do with, directly or indirectly, the question of what scale-free explanation looks like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 442.839,
    "end": 450.084,
    "text": " and how it compares to scientific explanation in general, most of which is reductive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 451.765,
    "end": 466.114,
    "text": "So I want to make a short detour into the question of how reductionist theories, which all of you are probably very familiar with, relate to scale-free theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 468.275,
    "end": 472.118,
    "text": "And particularly, the free energy principle is a scale-free theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 473.246,
    "end": 484.133,
    "text": " So it's a theory that's unlike most of the theories that most of you probably learned about in college.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 485.313,
    "end": 500.923,
    "text": "So we're all familiar with reductionist theories and the reductionist idea of scientific explanation, which is really an outcome of philosophy of science in the 20s and 30s.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 500.983,
    "end": 502.564,
    "text": "People like Rudolf Carnap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 504.061,
    "end": 510.003,
    "text": " were among the first to actually make precise what this idea of reductive explanation is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 511.204,
    "end": 525.83,
    "text": "But the basic idea is that the laws or the dynamics or the formalism that describes behavior at some micro scale, the behavior of little things,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 528.593,
    "end": 531.615,
    "text": " actually explains the behavior of big things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 532.776,
    "end": 551.55,
    "text": "So the basic reductionist idea is that what the little things are doing is what's important, and what big things are doing are either emergent phenomena or they're just epiphenomenal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 551.731,
    "end": 553.452,
    "text": "They're essentially just appearances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 555.291,
    "end": 558.572,
    "text": " And this defines a fundamental scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 559.272,
    "end": 574.618,
    "text": "So the real assumption in any reductionist theory is that there's some fundamental scale at which the real dynamics takes place and everything else is just an appearance or it's some sort of emergent phenomenon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 575.438,
    "end": 575.558,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 577.662,
    "end": 587.329,
    "text": " I try to be very careful when I use the word emergence because it's one of the most ambiguous words in the philosophy of science and people use it to mean all sorts of different things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 590.272,
    "end": 599.279,
    "text": "But whenever you say emergent, it always sort of implies the idea that it's emergent from something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 600.62,
    "end": 605.724,
    "text": "And so the idea of emergence is essentially a reductionist idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 607.561,
    "end": 616.965,
    "text": " because it at least implicitly assumes that there's some microscale from which the macroscale is emergent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 618.705,
    "end": 630.009,
    "text": "And so the discussions of emergent phenomena are often very consistent with reductionism, even if they claim not to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 630.029,
    "end": 630.089,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 633.743,
    "end": 638.364,
    "text": " We're all taught that science is reductionist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 639.525,
    "end": 644.626,
    "text": "And there are certainly people who publicly claim that science is reductionist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 646.007,
    "end": 649.968,
    "text": "Richard Dawkins is certainly a shining example of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 651.629,
    "end": 658.811,
    "text": "But I suspect that a lot of scientists just kind of play lip service to reductionism without really believing in it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 660.05,
    "end": 679.376,
    "text": " because they don't really believe that the macroscopic phenomena that they are studying, life, for example, is completely determined by what's going on at the microscale, or what's going on at the microscale plus some stochastic noise or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 680.856,
    "end": 686.598,
    "text": "So I want to explicitly contrast this with a scale-free theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 687.999,
    "end": 689.419,
    "text": "In a scale-free theory,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 691.112,
    "end": 693.753,
    "text": " is not simply a holistic theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 694.313,
    "end": 695.673,
    "text": "It's much more precise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 696.653,
    "end": 709.196,
    "text": "In a scale-free theory, little things and big things obey the same laws, or they have the same dynamics, or they're described by the same formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 710.557,
    "end": 714.738,
    "text": "So it's not that the macroscale is emergent from the microscale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 715.998,
    "end": 719.939,
    "text": "The macroscale and the microscale actually obey the same laws.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 721.724,
    "end": 730.129,
    "text": " And the relationship between macro and micro is probably best stated as one of implementation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 732.491,
    "end": 749.101,
    "text": "Macroscale things have microscale components, and those microscale components are doing something or other, and whatever they're doing implements the macroscale system and its behaviors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 751.152,
    "end": 761.815,
    "text": " But this implementation is not an explanation, or at least it's not an explanation all by itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 763.056,
    "end": 767.577,
    "text": "And the bumper sticker version of scale-free theories is just as above, so below.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 767.657,
    "end": 774.179,
    "text": "Whatever laws you have at the macro scale are the same ones you have at the micro scale and vice versa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 775.079,
    "end": 777.42,
    "text": "So scale-free theories, in a sense, are simple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 777.7,
    "end": 780.981,
    "text": "It's the same theory at every level of description.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 783.519,
    "end": 791.264,
    "text": " So what is this idea of scale, and how does it relate to what we've talked about in this course?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 792.584,
    "end": 798.728,
    "text": "Well, what we've talked about in this course all has to do with what an agent can observe on its boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 799.769,
    "end": 805.052,
    "text": "So scale has to do with how information is encoded on the boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 806.613,
    "end": 810.095,
    "text": "And we can describe that scale in many different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 811.913,
    "end": 821.262,
    "text": " Here's a commonplace way to describe it in physics, by a relationship between energy and distance or size.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 825.946,
    "end": 827.988,
    "text": "You've probably all heard of the Planck scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 829.149,
    "end": 833.553,
    "text": "The Planck scale is the smallest scale at which current physics makes any sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 837.211,
    "end": 847.274,
    "text": " And in energetic terms, it's defined by energies on the order of 10 to the 19th GeV, which is giga electron volts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 849.914,
    "end": 858.597,
    "text": "The LHC, the Large Hadron Collider in Switzerland, gets to about 10 to the 4th GeV.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 858.877,
    "end": 862.758,
    "text": "So many, many orders of magnitude less than the Planck scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 864.147,
    "end": 869.872,
    "text": " So the Planck scale is extremely energetic compared to what we can probe experimentally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 871.933,
    "end": 883.663,
    "text": "The Planck scale energy of 10 to the ninth GeV corresponds to a distance of about 10 to the minus 35 meters, which is incredibly tiny.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 885.684,
    "end": 891.029,
    "text": "An intermediate scale on this diagram is about the scale of a nucleon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 891.109,
    "end": 893.471,
    "text": "So for example, a proton or a neutron.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 894.5,
    "end": 901.062,
    "text": " They have a rest mass of about one GeV and a size of about one femtometer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 902.062,
    "end": 906.223,
    "text": "So this intermediate scale is roughly the scale of nuclear physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 908.163,
    "end": 920.346,
    "text": "And then if you go to our scale, the scale of things that are about a meter in size, human beings, tables and chairs, lots of animals,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 921.877,
    "end": 927.118,
    "text": " the things we're most familiar with, that corresponds to an incredibly tiny energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 927.138,
    "end": 934.4,
    "text": "10 to the minus 5 electron volts is about the energy of a photon of radiation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 935.22,
    "end": 940.962,
    "text": "And a meter is about the wavelength of long wave radio.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 942.222,
    "end": 944.003,
    "text": "So if you think about visible light,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 947.13,
    "end": 951.612,
    "text": " has a wavelength of about 10 to the minus five meters and energy of about an electron volt.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 952.212,
    "end": 967.358,
    "text": "So it's not surprising that visible light feels energetic to us because it's orders of magnitude above our natural scale of energy, of this sort of thermal environment in which we exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 969.199,
    "end": 974.601,
    "text": "So it's the encoding scale and the boundary",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 975.797,
    "end": 984.302,
    "text": " that is going to relate theories of things that we see to each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 985.722,
    "end": 988.884,
    "text": "And this ends up giving a kind of complicated picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 988.984,
    "end": 994.427,
    "text": "If you think of Alice interacting with Bob and measuring things on the boundary,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1000.103,
    "end": 1001.883,
    "text": " Sorry, I'm a little bit ahead of myself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1002.083,
    "end": 1004.904,
    "text": "I just wanted to show you a picture of a reductive theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1004.964,
    "end": 1006.024,
    "text": "This is the Big Bang.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1006.044,
    "end": 1007.285,
    "text": "You're all familiar with this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1008.205,
    "end": 1016.867,
    "text": "Something happens at the Planck scale, and the entire universe results from it by just a scale change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1017.867,
    "end": 1020.107,
    "text": "So this is a reductive theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1020.127,
    "end": 1023.548,
    "text": "A scale-free theory is much more complicated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1024.888,
    "end": 1027.289,
    "text": "So here's what a scale-free theory looks like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1029.351,
    "end": 1041.682,
    "text": " Alice interacts with Bob, and she's looking at her boundary, and her boundary states, the boundary states she sees could be encoded at different scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1043.264,
    "end": 1047.808,
    "text": "So there may be a small scale, scale one, and a bigger scale, scale two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1049.59,
    "end": 1054.174,
    "text": "And what Alice is looking for is some sort of theory that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1055.051,
    "end": 1059.533,
    "text": " that relates the first scale, the microscale, to the macroscale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1061.614,
    "end": 1069.277,
    "text": "And so it's not that the microscale came first like it did in the Big Bang and the macroscale came later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1069.297,
    "end": 1075.099,
    "text": "These are encodings that can be happening simultaneously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1076.383,
    "end": 1083.448,
    "text": " And the theoretical task is to find theories that relate between these scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1083.528,
    "end": 1090.793,
    "text": "And these are implementation theories, or you might call them embedding theories from one scale into another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1092.394,
    "end": 1100.059,
    "text": "And what we want as a consistency criterion is for these theories to be constant in time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1100.139,
    "end": 1102.141,
    "text": "So as Bob evolves in time,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1103.471,
    "end": 1107.292,
    "text": " And so what Alice sees are these encodings on her boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1108.152,
    "end": 1116.754,
    "text": "She wants the relationship between encodings at different scales to stay constant, because if it doesn't, she'll never be able to figure anything out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1119.075,
    "end": 1125.596,
    "text": "She'll just have this chaotic relationship between things happening at different scales, and nothing will make sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1127.91,
    "end": 1132.814,
    "text": " So you have this complicated picture in scale-free theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1133.774,
    "end": 1154.129,
    "text": "And if you look at this and it seems vaguely familiar or even very familiar, then it should, because this is exactly the kind of explanatory structure or semantic structure that you have in computer science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1156.301,
    "end": 1169.971,
    "text": " If you're studying the behavior of a computer, which is just some piece of hardware, some physical system, then you can describe what that piece of hardware is doing at different scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1171.232,
    "end": 1178.558,
    "text": "And in fact, what we call the hardware level of description, when we talk about our laptops, for example—",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1179.426,
    "end": 1187.809,
    "text": " is typically the level of description of circuits of transistors inside microprocessors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1188.049,
    "end": 1189.689,
    "text": "We think of that as the hardware level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1190.329,
    "end": 1207.635,
    "text": "But of course, that's just a description, too, that's layered on top of lots of much smaller-scale dynamics, all the way down to the scale of atoms and eventually nuclei and elementary particles and all that other stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1208.877,
    "end": 1216.959,
    "text": " So there's some quantum stuff that's going on that we describe as having a classical hardware level of bit exchange.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1218.779,
    "end": 1222.88,
    "text": "And then we describe the behavior of programs on top of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1224.841,
    "end": 1234.723,
    "text": "So what we want, what makes a computer useful, is that we can assign semantics to programs",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1236.187,
    "end": 1240.069,
    "text": " And we can talk about semantic relationships between programs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1240.169,
    "end": 1255.498,
    "text": "For example, the relationship between the internet protocol stuff that Zoom is doing and what you actually see on your user interface and hear on your user interface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1256.448,
    "end": 1267.713,
    "text": " That needs to stay fixed over time or Zoom becomes incomprehensible and not programmable, and in fact, not even well-defined as an algorithmic system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1268.693,
    "end": 1276.716,
    "text": "And the same is true for the relationship between the operating system and the hardware description, or between the operating system and Zoom as a program.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1279.642,
    "end": 1284.284,
    "text": " Computer science works in exactly this scale-free way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1285.124,
    "end": 1291.427,
    "text": "And so, in a sense, scale-free explanation is very familiar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1291.547,
    "end": 1296.208,
    "text": "It's exactly the kind of explanation that we have in computer science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1296.989,
    "end": 1307.473,
    "text": "And that's why I referred to the relationship between scales as one of implementation, because that's a term that we're familiar with from thinking about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1308.459,
    "end": 1310.421,
    "text": " computers implementing programs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1312.142,
    "end": 1313.664,
    "text": "So what are these theories?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1314.364,
    "end": 1327.996,
    "text": "If we think in biological terms, we can think of pathways being embedded in a cell or cells being embedded in tissues all the way up to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1330.487,
    "end": 1338.811,
    "text": " niches of various kinds, which may be social niches being embedded in ecosystems and ecosystems being embedded in the biosphere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1339.812,
    "end": 1348.296,
    "text": "And so we have all of these essentially semantic theories that talk about how one scale embeds in another scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1349.858,
    "end": 1375.922,
    "text": " And if we have these sorts of scale transitions, we can think of representing the relationship between transitions at different scales in terms of the activity of some kind of renormalization group, which is transforming entities and processes at one scale into entities and processes at another scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1377.503,
    "end": 1379.103,
    "text": "And I think in biology,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1381.089,
    "end": 1402.997,
    "text": " we can at least put forward the hypothesis that in all the way from pathways embedding in cells to ecosystems embedding in the biosphere, we could put forward the hypothesis at least that the renormalization group flow across all of these scales is trivial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1404.471,
    "end": 1427.61,
    "text": " That is that the embedding theories all have the same formal structure, that the structure that describes how pathways embed into cells is the same structure that describes how ecosystems embed into the biosphere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1428.516,
    "end": 1430.716,
    "text": " Now, I certainly can't prove that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1432.877,
    "end": 1434.377,
    "text": "I believe that it's likely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1435.797,
    "end": 1438.998,
    "text": "So I think it's an interesting hypothesis to investigate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1440.478,
    "end": 1449.96,
    "text": "And this is an hypothesis that I want to leave you with as a result of this class is something to think about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1451.88,
    "end": 1457.041,
    "text": "To what extent in thinking about biological systems or even social systems",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1459.766,
    "end": 1461.567,
    "text": " are the embedding theories the same?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1464.008,
    "end": 1484.714,
    "text": "So, in thinking this way, that the physics of the situation has the same formal structure as computer science has in terms of explanation, we're of course faced with a problem",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1486.479,
    "end": 1490.241,
    "text": " which is that we're not just reconstructing physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1491.742,
    "end": 1496.344,
    "text": "We're talking about the physics of interacting observers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1496.524,
    "end": 1498.585,
    "text": "We're talking about the physics of communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1499.786,
    "end": 1503.388,
    "text": "So we're modeling how we do physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1505.068,
    "end": 1507.83,
    "text": "And that makes our theory self-referential.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1509.091,
    "end": 1513.693,
    "text": "And so we have to base the music from Gödel's theorem",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1514.807,
    "end": 1521.168,
    "text": " which tells us essentially that powerful self-referential theories can't be both consistent and complete.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1522.108,
    "end": 1528.229,
    "text": "And by powerful, I just mean powerful enough to express arithmetic, so not terribly powerful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1529.93,
    "end": 1534.671,
    "text": "So this becomes an issue that we have to live with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1537.191,
    "end": 1542.832,
    "text": "We will always be faced with this issue",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1544.151,
    "end": 1551.534,
    "text": " of having to construct meta-theories, which tell us how our lower-level theories work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1552.374,
    "end": 1554.315,
    "text": "But we never get to the end of that process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1554.375,
    "end": 1566.62,
    "text": "We never can get to theories that are both consistent and complete, because our tower of theories becomes progressively actually more powerful as it goes up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1572.701,
    "end": 1588.056,
    "text": " in a sense, poses a problem, but in another sense, just tells us what life is like as a scientist, that you can't have everything all the time doing science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1588.797,
    "end": 1590.418,
    "text": "But we probably all already knew that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1591.579,
    "end": 1595.403,
    "text": "So let's now talk about space, end of digression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1597.02,
    "end": 1613.432,
    "text": " and see how these ideas apply to a system or a tower of systems that can construct a spatial embedding in its world, in its observed world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1614.653,
    "end": 1626.501,
    "text": "So let's start out thinking about a system that can see its environment, but what it sees is a completely uniform environment where nothing is happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1628.962,
    "end": 1638.907,
    "text": " So if you have a uniform environment where nothing is happening, you can't distinguish one part of the environment from another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1639.187,
    "end": 1642.668,
    "text": "So you have no sense of space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1644.749,
    "end": 1654.714,
    "text": "So what I want to do is build up from scratch what's needed to have a sense of space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1656.443,
    "end": 1662.424,
    "text": " And then we'll talk a little bit about what organisms are doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1662.504,
    "end": 1676.666,
    "text": "And I think a very interesting question is, if you look at phylogeny, at what points in phylogeny, what lineages in phylogeny actually need to have a sense of space?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1677.907,
    "end": 1685.508,
    "text": "And what do they have to have in terms of computational power to have that sense of space?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1687.352,
    "end": 1691.916,
    "text": " So if you just have a uniform environment, you don't have a sense of space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1694.138,
    "end": 1705.168,
    "text": "But the first thing we can do with an environment is to divide it up into some number of parts that are somehow distinguishable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1706.83,
    "end": 1711.414,
    "text": "So suppose we can segment the environment into two different parts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1712.774,
    "end": 1721.319,
    "text": " And if you think about E. coli, for example, E. coli has a bunch of sensors on the front and a bunch of effectors on the back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1722.6,
    "end": 1728.984,
    "text": "So it can sense much more about the front part of the environment than the back part of the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1730.025,
    "end": 1737.009,
    "text": "So already with E. coli, you have this kind of segmentation of the environment into parts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1738.305,
    "end": 1740.966,
    "text": " But so far, nothing has happened in this environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1741.046,
    "end": 1743.648,
    "text": "We just have segments that can be distinguished.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1746.029,
    "end": 1754.353,
    "text": "So let's consider an environment like this that has distinguishable segments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1756.494,
    "end": 1763.618,
    "text": "What one next wants to know about these segments is whether they're next to each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1765.479,
    "end": 1767.7,
    "text": "And if we just have a bunch of segments,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1768.493,
    "end": 1778.122,
    "text": " We just have a set, and a set doesn't have any order or any relationship information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1779.763,
    "end": 1788.351,
    "text": "So I've drawn this environment as a rectangle of rectangles, but that's just a representation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1791.727,
    "end": 1798.369,
    "text": " And it looks like there are relationships between these rectangles, but if they're just a set, then there are no relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1799.53,
    "end": 1803.391,
    "text": "If we want to add relationships, then we have to add them explicitly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1804.851,
    "end": 1815.235,
    "text": "So let's add some connections between these different segments of the environment to turn that set into a graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1816.411,
    "end": 1826.518,
    "text": " that says explicitly, for example, that the light green segment is attached to the light blue segment, and it's also attached to the dark green segment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1827.999,
    "end": 1833.823,
    "text": "And the dark blue segment is attached to the light blue segment and attached to the dark green segment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1834.904,
    "end": 1839.707,
    "text": "So now we have something that's much more mathematically complicated than a set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1839.767,
    "end": 1843.03,
    "text": "We have a graph that has some connection information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1843.13,
    "end": 1844.931,
    "text": "So we have a connection topology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1847.048,
    "end": 1850.209,
    "text": " Now, adding this topology does something very important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1850.229,
    "end": 1855.572,
    "text": "It breaks the exchange symmetry that is there if you just have a set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1856.212,
    "end": 1870.699,
    "text": "So if we just have a set, it doesn't make any difference if I exchange, for example, the positions of the upper right light blue segment with the upper left light green segment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1871.799,
    "end": 1875.861,
    "text": "But if we have this connection topology, then it does make a difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1877.071,
    "end": 1881.552,
    "text": " I've twisted the graph around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1882.773,
    "end": 1888.234,
    "text": "And if I have to break connections to exchange things, then I've actually changed the topology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1889.715,
    "end": 1900.758,
    "text": "So adding a topology, adding connections, can disrupt a symmetry that's there if there is no topology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1903.154,
    "end": 1909.937,
    "text": " So now let's think about, now we have the structure that's required to think about something happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1911.577,
    "end": 1923.982,
    "text": "So suppose that at some time, as measured in the bit counter time reference frame of the observing system, something happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1924.142,
    "end": 1926.723,
    "text": "So a dot appears in the light green segment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1928.826,
    "end": 1933.789,
    "text": " And we can express this actually in the notation of quantum field theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1933.849,
    "end": 1946.898,
    "text": "We can think of the light green segment as a field, and the dot appearing is the occurrence of an excitation in that field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1948.539,
    "end": 1956.364,
    "text": "And so we can write this notation that says that the green field was excited to produce a dot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1957.363,
    "end": 1959.125,
    "text": " which is up arrow green dot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1962.388,
    "end": 1975.702,
    "text": "And sometime after that, it may turn out that the dot disappears in the green field, and some sort of dot appears down in the dark blue field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1977.171,
    "end": 1984.996,
    "text": " And again, we can write this in this kind of creation and destruction operator notation that one has in quantum field theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1986.457,
    "end": 1993.741,
    "text": "And so this says that the green field is no longer excited, but now the dark blue field is excited.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1995.322,
    "end": 2000.285,
    "text": "So this doesn't imply anything about these excitations being the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2000.345,
    "end": 2002.046,
    "text": "In fact, they're completely different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2003.347,
    "end": 2007.511,
    "text": " One is an excitation of the green field and one is an excitation of the blue field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2008.452,
    "end": 2011.295,
    "text": "But at least now something is happening in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2012.336,
    "end": 2022.865,
    "text": "So we can think about what does it take for an observer to notice that something is happening in its environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2023.045,
    "end": 2025.367,
    "text": "It has to be able to detect",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2028.012,
    "end": 2032.013,
    "text": " a change occurring in some segment of its environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2033.234,
    "end": 2042.497,
    "text": "And that change can involve something happening or something stopping happening in that segment of its environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2043.597,
    "end": 2049.239,
    "text": "But it doesn't yet have to have any idea of what an object is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2050.919,
    "end": 2052.32,
    "text": "But we can add that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2054.64,
    "end": 2056.381,
    "text": "If the system has a memory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2062.466,
    "end": 2071.008,
    "text": " we can have the system connect these events happening in different parts of its environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2072.228,
    "end": 2089.333,
    "text": "So if the system has a memory that has some number of steps, say, n steps, but here it could even just be two steps, it can see transitions between these two different states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2090.558,
    "end": 2103.008,
    "text": " where there's a dot in the green field, and then a dot in the dark blue field, and then a dot in the green field, and then a dot in the dark blue field, and then a dot in the green field, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2103.909,
    "end": 2111.775,
    "text": "So I've expressed this in this sort of field theory notation over on the right side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2112.936,
    "end": 2114.937,
    "text": "And what this is is a flip-flop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2115.778,
    "end": 2118.06,
    "text": "It's an observed periodic behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2119.582,
    "end": 2124.244,
    "text": " So this is the basic idea behind a clock.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2125.224,
    "end": 2140.251,
    "text": "So any observer that can see this, a number of time steps internally, can interpret what's going on in its external environment as a clock ticking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2141.971,
    "end": 2143.532,
    "text": "It can see some periodicity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2145.316,
    "end": 2155.519,
    "text": " So as long as you can have memory and the ability to detect change, you can see periodic behavior in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2156.079,
    "end": 2159.14,
    "text": "So you can see the environment acting like a clock.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2162.121,
    "end": 2167.823,
    "text": "So let's think a bit about what this does and does not require.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2168.643,
    "end": 2170.824,
    "text": "So seeing a clock in the environment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2171.929,
    "end": 2177.811,
    "text": " requires having distinguishable, non-exchangeable sectors of the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2177.911,
    "end": 2183.012,
    "text": "So you have to have this connection topology that breaks the exchange symmetry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2184.713,
    "end": 2192.115,
    "text": "It requires having these sectors implement some sort of flip-flop, so something periodic happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2193.135,
    "end": 2196.936,
    "text": "And you have to have enough memory to see that periodicity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2198.871,
    "end": 2202.592,
    "text": " But it doesn't require any sense of object identity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2204.072,
    "end": 2215.315,
    "text": "So the excitation in the green part and the excitation in the blue part can still just be field excitations of the green part and the blue part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2215.715,
    "end": 2219.736,
    "text": "There's nothing that says that those have to be the same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2219.796,
    "end": 2223.457,
    "text": "They just have to appear and disappear in some periodic way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2225.114,
    "end": 2228.395,
    "text": " And having a clock doesn't require a metric space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2229.115,
    "end": 2233.437,
    "text": "You don't need to have any sense of distance defined on the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2234.577,
    "end": 2239.379,
    "text": "You just have to have this segmentation that is not rearrangeable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2240.459,
    "end": 2247.061,
    "text": "So this tells us something extremely important, which is that time is more fundamental than space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2248.291,
    "end": 2256.214,
    "text": " Time in the exterior environment is much simpler and easier to observe than space in the exterior environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2257.175,
    "end": 2263.878,
    "text": "So if we're thinking biologically about phylogeny, we might expect to see organisms",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2264.875,
    "end": 2273.739,
    "text": " that can detect periodic behavior in the external environment long before they can detect spatial organization in the exterior environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2274.779,
    "end": 2282.102,
    "text": "And we know that organisms, even down to microbial mats, can respond to the diurnal cycle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2283.51,
    "end": 2289.934,
    "text": " So we know that organisms, in a sense, can detect environmental clocks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2291.255,
    "end": 2302.222,
    "text": "Even organisms that we have no reason to believe divide the environment up into spaces or the sort of space that we're used to, like a Euclidean space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2304.163,
    "end": 2310.307,
    "text": "So now we're talking about adding space to this idea of time and the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2313.317,
    "end": 2317.54,
    "text": " So the next step is to be able to see motion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2319.321,
    "end": 2333.509,
    "text": "And being able to see one thing move from one segment of the environment to another segment, as opposed to something happening in one segment and then something happens in another segment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2335.03,
    "end": 2342.334,
    "text": "One has to have this idea of object persistence, that there's a thing that has an identity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2343.41,
    "end": 2346.471,
    "text": " and its identity doesn't change over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2348.152,
    "end": 2354.314,
    "text": "And it doesn't change when you move it someplace else, when it appears someplace else in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2354.815,
    "end": 2356.335,
    "text": "It's the same object.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2358.496,
    "end": 2369.781,
    "text": "So this is an idea that psychologists call object persistence, and it's an idea that physicists call translational invariance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2371.081,
    "end": 2372.482,
    "text": "Translational invariance",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2374.022,
    "end": 2374.883,
    "text": " means two things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2375.784,
    "end": 2381.909,
    "text": "It means that if I have an object and I move it to a different location, I don't change the object.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2382.449,
    "end": 2385.712,
    "text": "It's the same object that I move from here to there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2386.613,
    "end": 2388.875,
    "text": "So the location doesn't change the object.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2390.216,
    "end": 2392.438,
    "text": "But it also means the reverse of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2393.339,
    "end": 2395.981,
    "text": "It means that the object doesn't change the location.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2399.476,
    "end": 2404.3,
    "text": " my container remains invariant even though I move the object around in it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2405.08,
    "end": 2412.607,
    "text": "So these are kind of the two faces of translational invariance, and they're the two faces of object persistence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2414.949,
    "end": 2423.716,
    "text": "As the object moves through time, its identity remains fixed, and it doesn't change the time that it's moving through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2425.0,
    "end": 2432.201,
    "text": " So if I'm measuring its motion with a clock, moving the object doesn't change the clock.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2434.242,
    "end": 2437.202,
    "text": "These are clearly very classical ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2439.483,
    "end": 2443.583,
    "text": "And we talked about earlier classical communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2445.744,
    "end": 2453.945,
    "text": "And when we talked about classical communication in, for example, the context of a Bell EPR experiment,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2454.67,
    "end": 2468.596,
    "text": " We talked about the observers being able to write down some data on a piece of paper or on a disk drive or something and hand those data to someone else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2469.556,
    "end": 2471.757,
    "text": "So this is translational invariance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2471.797,
    "end": 2475.718,
    "text": "The data can't change when Alice gives it to Bob.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2476.739,
    "end": 2479.7,
    "text": "Otherwise, there isn't classical communication taking place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2481.235,
    "end": 2485.576,
    "text": " And of course, there's an up to noise built into here, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2485.616,
    "end": 2491.678,
    "text": "The piece of paper might get wet and the ink might run a little bit, but it's still the same message.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2491.798,
    "end": 2494.939,
    "text": "There's still some identity being assumed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2496.319,
    "end": 2501.521,
    "text": "So object persistence is not an idea we get from quantum theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2501.841,
    "end": 2505.442,
    "text": "It's an idea that we impose on top of quantum theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2506.562,
    "end": 2509.843,
    "text": "And it's this idea that's intrinsically classical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2511.3,
    "end": 2516.161,
    "text": " So we're looking right here at the quantum to classical transition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2516.241,
    "end": 2518.362,
    "text": "This is it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2518.522,
    "end": 2522.322,
    "text": "This is what gets added to quantum theory to get classical physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2522.442,
    "end": 2524.463,
    "text": "It's this idea of object persistence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2526.083,
    "end": 2531.864,
    "text": "Now, once we have object persistence, we can kind of go to town constructing space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2536.685,
    "end": 2538.966,
    "text": "And here's how we do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2542.494,
    "end": 2564.949,
    "text": " We all learned about object persistence this way when we were six months old, doing motor babbling and observing our hands and feeling how our bodies worked and seeing objects that we could manipulate and that didn't change when we manipulated them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2566.63,
    "end": 2569.571,
    "text": " So this is the birth of object persistence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2569.731,
    "end": 2575.194,
    "text": "This is the birth of classicality in human psychology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2579.596,
    "end": 2582.457,
    "text": "So now let's start thinking about building a coordinate system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2582.777,
    "end": 2583.918,
    "text": "What's a coordinate system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2583.978,
    "end": 2589.72,
    "text": "A coordinate system is just a set of labels that are attached to these segments of the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2591.281,
    "end": 2593.842,
    "text": "And to build a coordinate system, you have to have an origin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2595.293,
    "end": 2601.856,
    "text": " And an origin means an object, something that's fixed, something that doesn't move around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2603.676,
    "end": 2621.744,
    "text": "And so a coordinate system requires the ability to identify a stigmatic memory, requires the ability to find something in the environment that has a meaning that stays constant over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2622.762,
    "end": 2625.504,
    "text": " And that's what a stigmergic memory is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2625.604,
    "end": 2633.108,
    "text": "It's something in the environment that provides us with a memory resource that we can count on being the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2634.889,
    "end": 2649.497,
    "text": "And it's having this fixed point that allows us to label these connected segments of the environment that contain objects that move.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2650.578,
    "end": 2656.182,
    "text": " and be able to say, okay, the object moved from this part of the environment to another part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2657.003,
    "end": 2664.989,
    "text": "And I can give those parts labels with respect to this other part that doesn't move, this origin point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2666.55,
    "end": 2670.673,
    "text": "And once I have this, I can construct other invariances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2671.734,
    "end": 2678.379,
    "text": "So for example, I can consider an object that rotates around this origin without changing its identity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2679.605,
    "end": 2682.767,
    "text": " And that defines what's called rotational invariance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2684.568,
    "end": 2694.495,
    "text": "And I can also talk about an object that gets bigger and smaller compared to this fixed point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2695.656,
    "end": 2697.597,
    "text": "And that defines radial distance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2698.478,
    "end": 2709.385,
    "text": "And if you think about the baby in the previous slide that's doing motor babbling, it sees things getting smaller as it moves them farther away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2711.041,
    "end": 2724.11,
    "text": " So the visual system does this computation for us and constructs this radial coordinate for us with respect to our bodies, or specifically our heads, our eyes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2726.271,
    "end": 2737.159,
    "text": "So in doing this very early motor activity, we're actually building the spatial coordinate system",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2738.446,
    "end": 2744.009,
    "text": " for our brains that's implemented by the hippocampus, the play cells in the hippocampus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2745.83,
    "end": 2758.617,
    "text": "And if I have an origin point in the environment, I can also infer that I am moving, that I have changed my location with respect to that object.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2759.953,
    "end": 2770.776,
    "text": " And that's a considerably more complicated inference because you have to have a representation of the self, of you, to say, I moved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2771.456,
    "end": 2776.397,
    "text": "So this is something that comes after you've developed this spatial coordinate system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2776.817,
    "end": 2785.019,
    "text": "You have to be able to locate, in a sense, metacognitively, a particular object that's you in that coordinate system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2786.991,
    "end": 2795.054,
    "text": " So we're going to set that aside and now talk about adding some numbers, so adding a metric.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2796.714,
    "end": 2810.679,
    "text": "And adding a metric requires another particular kind of object, which is a ruler, a particular fixed object that can be moved around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2812.119,
    "end": 2820.384,
    "text": " and that has translational invariance and rotational invariance up to some transformation, up to some tensor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2822.005,
    "end": 2825.047,
    "text": "And in Euclidean space, that tensor is the identity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2826.268,
    "end": 2832.131,
    "text": "So in Euclidean space, you have perfect translational and rotational invariance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2833.792,
    "end": 2835.834,
    "text": "As you get into general relativity,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2836.673,
    "end": 2843.918,
    "text": " then the ruler can actually change its length as you rotate, or the ruler can change its length as it moves through space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2844.878,
    "end": 2848.281,
    "text": "So effectively, your spacetime can deform.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2848.361,
    "end": 2855.185,
    "text": "The coordinates of your spacetime can deform, and that gives you the representation of mass, of course, in general relativity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2857.026,
    "end": 2862.59,
    "text": "So we talked several sessions ago about quantum reference frames.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2863.863,
    "end": 2867.606,
    "text": " And I use the example of rulers and clocks as quantum reference frames.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2868.687,
    "end": 2886.66,
    "text": "So now we see how to construct those from observations and symmetry breaking and object identity, all of which we need to define a quantum reference frame out in the environment, like a ruler.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2888.222,
    "end": 2891.984,
    "text": "And notice that we don't need any of that environmental stuff",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2893.988,
    "end": 2898.51,
    "text": " to define those QRFs within our own processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2898.85,
    "end": 2906.715,
    "text": "And in fact, the ones that exist within us, we have no direct access to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2907.595,
    "end": 2919.002,
    "text": "We can look at someone else's brain and talk about their spatial representation system, but we can't look inside our own brains and talk about our spatial representation system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2921.252,
    "end": 2926.374,
    "text": " So this is how we get a metric space from the ground up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2928.255,
    "end": 2934.198,
    "text": "And we've talked about this from a very psychological or biological point of view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2937.659,
    "end": 2944.162,
    "text": "Starting from sort of motor capabilities, motor babbling, for example,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2946.405,
    "end": 2973.327,
    "text": " a measure of effort which gives you some sense of mass so if it's easy to move something it's light and if it's hard to move something it's heavy and we understand that when we're six months old because we can measure how much force we're having to apply with our muscles we have a reference internally for this force that we're applying and we",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2975.414,
    "end": 2982.036,
    "text": " use that internal measurement to attribute this idea of mass to things in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2983.196,
    "end": 2985.377,
    "text": "We have to have memory for manipulations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2986.257,
    "end": 3001.262,
    "text": "We have to be able to identify variances that define objects, object persistence, and we have to be able to build a ruler that we can move around and use to define a metric space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3002.93,
    "end": 3006.033,
    "text": " Now, this is very different from the way physicists approach this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3008.035,
    "end": 3013.079,
    "text": "If you look at the physics literature, then people start with information transfer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3013.159,
    "end": 3017.243,
    "text": "They talk about entanglement as a basic resource.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3019.725,
    "end": 3025.911,
    "text": "There's a lot of discussion of bulk boundary duality, and the most well-known one is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3027.571,
    "end": 3039.922,
    "text": " the duality between anti-de Sitter space, which is the sort of space you see inside a black hole, and conformal field theory, quantum field theory on the boundary of the black hole.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3040.343,
    "end": 3053.575,
    "text": "So things you can see, for example, going on on the horizon of a black hole are dual to the geometry and the interior by this mathematical relationship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3054.724,
    "end": 3072.618,
    "text": " You can use that mathematical relationship to construct a quantum error correcting code by using the symmetries of the field theory as a resource for redundancy that allows you to represent the same thing in different places.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3074.019,
    "end": 3080.664,
    "text": "And as soon as you can do that, you can build up a network of elements that look basically like elements of a lattice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3081.966,
    "end": 3092.533,
    "text": " And a lattice is a graph to which you can assign symmetric relationships and you get a metric space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3094.135,
    "end": 3106.323,
    "text": "And in physics, typically the goal is to get Einstein's equations out of this, to start with some information theoretic sorts of constructs and get the equations of general relativity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3107.844,
    "end": 3110.346,
    "text": "But what are the equations of general relativity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3111.52,
    "end": 3132.985,
    "text": " These are things that Einstein derived by doing fairly simple thought experiments using the invariances of ordinary Euclidean space combined with ideas from special relativity about the speed of light being constant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3134.505,
    "end": 3138.426,
    "text": "And he added the principle of equivalence, which is the idea that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3141.917,
    "end": 3151.582,
    "text": " essentially mass and acceleration are the same thing, or that gravity and acceleration are the same, that weight and acceleration are the same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3153.443,
    "end": 3171.612,
    "text": "So it's at least reasonable to expect that this inferential process that's going on in theoretical physics is generating the same thing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3172.426,
    "end": 3181.573,
    "text": " although in a very formalized way, that we can generate by thinking about how organisms deal with their environments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3183.274,
    "end": 3192.06,
    "text": "And so I want to leave this with you as the second hypothesis here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3192.26,
    "end": 3201.487,
    "text": "The first one was the hypothesis about a trivial renormalization group flow across scales in biology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3203.042,
    "end": 3218.636,
    "text": " The second hypothesis is that these two approaches to emergent spacetime are actually giving us the same information and maybe starting out with the same information, in fact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3219.817,
    "end": 3225.161,
    "text": "We may be able to think about these fundamental building blocks",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3227.263,
    "end": 3237.851,
    "text": " of information flow and entanglement in terms of the sorts of perceptual relationships that we've been talking about in this class.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3239.452,
    "end": 3246.357,
    "text": "So there's our second hypothesis to think about going forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3248.119,
    "end": 3252.342,
    "text": "And I just want to leave you with the idea that organisms, at least,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3253.638,
    "end": 3267.17,
    "text": " manage this very interesting process that we can think of as starting with the construct of memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3269.051,
    "end": 3279.28,
    "text": "Organisms have memory of multiple scales, and it's memory that allows them to formulate the idea that they're objects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3281.292,
    "end": 3287.416,
    "text": " And as soon as you have objects that persist, you have a source of redundancy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3288.576,
    "end": 3290.157,
    "text": "So you can do error correction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3291.838,
    "end": 3303.345,
    "text": "And if you can do error correction, if you can move the same thing from one place to another and have it encode the same information, then you can build spacetime.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3305.386,
    "end": 3310.449,
    "text": "And as soon as you have spacetime, you can use the spacetime as more memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3312.317,
    "end": 3325.366,
    "text": " You can use the space-time itself as an error-correcting code because space-time has the nice ability to hold lots of copies of some informative structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3325.466,
    "end": 3339.135,
    "text": "So you can build libraries, you can build computers, or you can build the internet if you have space-time, which gives you more memory, which gives you more object persistence, which gives you more error correction, and the circle just spins around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3339.956,
    "end": 3341.277,
    "text": "So organisms do this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3342.148,
    "end": 3344.53,
    "text": " And the question is, how does it get off the ground?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3345.891,
    "end": 3364.444,
    "text": "And next time we can at least speculate about that kind of origin of life type of question in the context of the FEP and its realization in simple systems of communicating observers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3366.129,
    "end": 3371.713,
    "text": " So as always, I encourage you to use the interactive Q&A.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3373.234,
    "end": 3386.544,
    "text": "The fifth discussion session with Andrew, who's unfortunately not here today, will be the last day of September, Saturday at 5, as usual, 5 o'clock European time, 8 o'clock California time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3387.945,
    "end": 3390.827,
    "text": "And then the last session of the class will be the 12th of October.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3392.774,
    "end": 3398.639,
    "text": " So thank you very much, and I look forward to your questions in the interactive Q&A.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3408.908,
    "end": 3409.429,
    "text": "Thank you, Chris.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3409.589,
    "end": 3411.411,
    "text": "Can I ask some short questions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3412.691,
    "end": 3412.971,
    "text": " Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3413.492,
    "end": 3413.772,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3414.613,
    "end": 3423.785,
    "text": "So first from Lana wrote, is the periodicity the time lengths between and during the excitations built in?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3424.866,
    "end": 3431.034,
    "text": "So this was when we had the four cells and there was the inklings of a clock coming into play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3441.784,
    "end": 3467.874,
    "text": " I think the simplest answer is that if nothing else is happening in the environment except this periodic behavior, then it's not actually meaningful to talk yet about the time between the events.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3469.884,
    "end": 3497.491,
    "text": " So if I have a periodic, a system that's quasi-periodic, for example, and nothing else is going on in my environment, then I can't distinguish that from a perfectly periodic system because I would have to have a perfectly periodic reference to know that the other system was aperiodic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3498.991,
    "end": 3515.958,
    "text": " And if you think about the internal clock being driven by information flow into the system, then something has to be happening in the environment for information to be flowing into the system and being counted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3517.238,
    "end": 3527.322,
    "text": "So again, as we talked about a few sessions ago, the internal memory only gets updated when something happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3529.548,
    "end": 3533.111,
    "text": " So internal and external get tied together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3534.472,
    "end": 3537.795,
    "text": "And this is why we can use external clocks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3540.137,
    "end": 3550.185,
    "text": "But it's also why we depend on external clocks, because our intuitive sense of time is very malleable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3552.227,
    "end": 3557.251,
    "text": "And so we actually, as humans, use external clocks",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3558.257,
    "end": 3564.182,
    "text": " to correct for the malleability of our own intuitive sense of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3566.964,
    "end": 3567.224,
    "text": "Wow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3567.764,
    "end": 3587.96,
    "text": "And there's probably a lot to be said for that Procrustean nature of having the chronometer, the clock on the wall, and the tick, tick, tick as an evolutionarily novel ruler of time playing a logistical role in time-bound society.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3589.676,
    "end": 3596.3,
    "text": " Yeah, and think of earlier clocks that earlier cultures have used and that animals use.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3596.32,
    "end": 3600.063,
    "text": "I mean, we have the solar clock, the lunar clock, etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3601.084,
    "end": 3608.769,
    "text": "And the orbit of Venus clock that was so important to the Mayans and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3608.789,
    "end": 3619.256,
    "text": "So there are lots of available clocks in the environment if you have the ability to notice them and enough memory to realize that they're clocks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3621.693,
    "end": 3622.033,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3622.513,
    "end": 3622.794,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3623.094,
    "end": 3625.035,
    "text": "Here's a question from Upcycle Club.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3625.275,
    "end": 3634.719,
    "text": "They wrote, how does representing the network structure and dynamics with quantum embeddings affect the semantic interpretation of the network?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3642.943,
    "end": 3648.586,
    "text": "The embedding theory is the simplest semantic interpretation of the network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3651.085,
    "end": 3665.614,
    "text": " And again, a good way to think of this is through the lens of computer science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3667.836,
    "end": 3679.843,
    "text": "As soon as you have a programming language that allows variable binding, then you've built a very simple kind of semantics into the language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3682.742,
    "end": 3702.734,
    "text": " if you have X as a variable and you have variable binding, then at different times in the execution of the program, X can have different causal consequences for downstream computation because it's been bound to a different value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3702.834,
    "end": 3704.715,
    "text": "So it has different semantics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3706.576,
    "end": 3708.037,
    "text": "So the semantics of X",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3710.122,
    "end": 3712.985,
    "text": " Again, go back to Gregory Bateson.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3716.167,
    "end": 3723.373,
    "text": "The basis of semantics is differences that make a difference, make a difference to behavior, make a difference to actionability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3724.994,
    "end": 3732.22,
    "text": "So variable binding gives you differences that actually make a difference to what the program does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3734.802,
    "end": 3738.025,
    "text": "So what is that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3739.409,
    "end": 3752.012,
    "text": " that is the semantics that's assigned by your embedding theory between what the programming language is doing and what the operating system is doing and so forth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3753.733,
    "end": 3763.375,
    "text": "And I think it's no surprise that the semantics of programming languages end up being",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3764.344,
    "end": 3782.347,
    "text": " represented with these very general mathematical constructs like category theory, which are essentially tools for representing arbitrary relations between systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3784.228,
    "end": 3785.908,
    "text": "And that's what embedding theories are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3787.488,
    "end": 3792.269,
    "text": "They're theories that state relationships between systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3796.337,
    "end": 3796.657,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3796.997,
    "end": 3814.242,
    "text": "And very provocative to explore on the biological and life and on the space-time and matter sides, which are, of course, seamlessly integrated through, if only, our own experiences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3815.967,
    "end": 3824.69,
    "text": " Yeah, this is another place where it's useful to go back to this difference between reductive theories and scale-free theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3825.15,
    "end": 3833.433,
    "text": "And scale-free theories are all about semantics because they represent the existence of stuff happening at different scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3833.533,
    "end": 3838.495,
    "text": "And so they naturally raise the question of what are these relationships?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3840.176,
    "end": 3841.456,
    "text": "What are these embedding theories?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3842.973,
    "end": 3849.217,
    "text": " And in reductive theories, there's a very deep sense in which semantics doesn't matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3852.82,
    "end": 3865.449,
    "text": "If you think that all that's going on that's important is the stuff that's going on at the Planck scale, then you don't need any semantics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3867.13,
    "end": 3867.55,
    "text": "And so...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3870.429,
    "end": 3876.834,
    "text": " You see this in late 60s, early 70s old-fashioned AI, where people talk about...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3884.929,
    "end": 3886.989,
    "text": " Computation is purely syntactic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3887.63,
    "end": 3891.35,
    "text": "And this is a very reductionist view of computation that leaves out the semantics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3892.671,
    "end": 3895.991,
    "text": "And without the semantics, the computation is useless.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3896.931,
    "end": 3900.112,
    "text": "It doesn't tell us anything at all unless we can map it to something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3902.473,
    "end": 3911.955,
    "text": "So, we have this philosophy of science tradition that tells us that semantics is not important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3913.255,
    "end": 3913.975,
    "text": "And we end up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3915.003,
    "end": 3921.109,
    "text": " with tools like the FEP that essentially tell us that semantics is all important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3924.011,
    "end": 3931.819,
    "text": "And from a biological point of view, the most natural response is, of course, we knew that all the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3932.199,
    "end": 3933.68,
    "text": "That's why we're doing biology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3936.343,
    "end": 3938.545,
    "text": "So all of this ties together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3940.7,
    "end": 3949.144,
    "text": " Would you say that FEP says semantics is important, and then what does it say about what semantics are important?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3949.264,
    "end": 3952.046,
    "text": "Or is that entirely left up to the modeler?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3956.628,
    "end": 3963.491,
    "text": "Well, it tells you a lot about what's important for the system itself, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3963.552,
    "end": 3966.353,
    "text": "The system itself is dealing with its environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3968.073,
    "end": 3972.537,
    "text": " And it's trying to increase its predictive power.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3973.838,
    "end": 3976.66,
    "text": "So it's building a theory of the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3978.181,
    "end": 3981.924,
    "text": "And that theory is intrinsically semantic, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3981.984,
    "end": 3983.385,
    "text": "It's about the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3985.026,
    "end": 3986.427,
    "text": "And it's actionable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3988.889,
    "end": 3997.135,
    "text": "The theory is meant to drive action on the environment that will either yield more information,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3998.297,
    "end": 4006.805,
    "text": " or get the environment to behave, to do what I'm predicting it's going to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4008.927,
    "end": 4017.736,
    "text": "So I think the FEP is intrinsically semantic in that sense, that it's about an agent modeling its environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4019.178,
    "end": 4032.407,
    "text": " yes and about the semantics of action as opposed to a partial or limited semantics of passive inferrers or semantics of abstraction",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4034.864,
    "end": 4051.61,
    "text": " Which kind of leaves the important link between the agent and the environment through sense-making and decision selection basically unaddressed because it's kind of Descartes in the thought experiment in the room, and here when we actually engage with the boundary of the room, that's where we start.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4052.97,
    "end": 4053.17,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4053.97,
    "end": 4061.433,
    "text": "Yeah, the FEP completely destroys this classical notion of the passive observer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4063.906,
    "end": 4065.367,
    "text": " as does quantum theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4065.987,
    "end": 4068.308,
    "text": "There are no passive observers in quantum theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4069.768,
    "end": 4077.712,
    "text": "So this is a construct that we inherited from a classical worldview that is seriously misleading.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4077.732,
    "end": 4087.776,
    "text": "A lot more to say, but that's a great place to end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4088.176,
    "end": 4088.696,
    "text": "Thank you, Chris.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4090.194,
    "end": 4090.575,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4090.655,
    "end": 4091.597,
    "text": "Thank you, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4091.797,
    "end": 4092.879,
    "text": "And thanks to you all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4093.2,
    "end": 4094.482,
    "text": "And ask questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4095.404,
    "end": 4095.885,
    "text": "See you next time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4095.905,
    "end": 4096.145,
    "text": "Cheers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4096.165,
    "end": 4097.047,
    "text": "We'll see you next time.",
    "speaker": "SPEAKER_00"
  }
]