[
  {
    "start": 4.638,
    "end": 8.202,
    "text": " Hello everyone, and welcome back to Active Inference Insights.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8.722,
    "end": 14.909,
    "text": "I'm your host, Darius Parvizi-Wayne, and today I'm absolutely thrilled to be speaking with Professor Chris Frith.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 14.929,
    "end": 20.595,
    "text": "Chris is a neuropsychologist and a pioneer in the application of brain imaging to the study of mental processes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 21.156,
    "end": 28.664,
    "text": "He has contributed more than 500 papers to peer-reviewed scientific journals, and is known especially for his work on agency, schizophrenia, and social cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 29.305,
    "end": 33.97,
    "text": "Within this latter field, he has worked extensively with his wife, Professor Uta Frith.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 34.456,
    "end": 37.96,
    "text": " Together, they have published seminal papers on theory of mind and social signaling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 38.36,
    "end": 41.163,
    "text": "And last year, they published the book, What Makes Us Social?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 42.004,
    "end": 48.331,
    "text": "Again, it is no overstatement to say that Chris possesses a legendary status in the spheres of psychology and neuroscience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 48.751,
    "end": 51.514,
    "text": "And so it is a real honor on my part to be chatting to him today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 52.035,
    "end": 54.637,
    "text": "Chris, thank you so much for joining me and welcome to the show.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 55.458,
    "end": 56.94,
    "text": "Well, thanks for those nice words.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 57.881,
    "end": 58.301,
    "text": "You're welcome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 58.842,
    "end": 60.744,
    "text": "Are you in London currently?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 60.764,
    "end": 61.405,
    "text": "It's a beautiful day.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 61.925,
    "end": 62.826,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 64.038,
    "end": 64.959,
    "text": " albeit a bit frosty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 65.48,
    "end": 67.043,
    "text": "Excellent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 67.243,
    "end": 77.438,
    "text": "So as I mentioned in my introduction, you root many, or you ground many of our social capacities in mentalizing, which requires theory of mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 77.979,
    "end": 84.289,
    "text": "Now, some of our audience might not, we, our audience is diverse, you know, brings in people from maths, physics, all sorts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 84.689,
    "end": 89.657,
    "text": "They might not have a psychology background, so they might not be aware of what mentalizing or theory of mind actually is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 90.312,
    "end": 96.479,
    "text": " So it might be worth just setting the stage and giving a brief exposition of what those terms mean, if possible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 97.56,
    "end": 97.84,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 98.321,
    "end": 107.651,
    "text": "Yes, theory of mind is a rather misleading phrase, because it's not a theory of how the mind works, and it's probably not even a theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 108.372,
    "end": 112.877,
    "text": "So mentalizing is a slightly better term, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 112.897,
    "end": 120.285,
    "text": "But the idea is that one way into this is to say we're trying to predict",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 120.755,
    "end": 125.94,
    "text": " is useful to be able to predict what people are going to do and to understand why they're doing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 127.382,
    "end": 136.051,
    "text": "And theory of mind originally said people do things because of their hidden mental states, such as beliefs and intentions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 137.512,
    "end": 142.077,
    "text": "So if somebody takes an umbrella with them, this doesn't mean that it's raining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 142.618,
    "end": 145.861,
    "text": "It means that they believe it is raining or is going to rain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 146.902,
    "end": 149.665,
    "text": "And the key, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 150.64,
    "end": 159.691,
    "text": " to the experiments on people's ability to understand these hidden mental states is the impact of false beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 161.393,
    "end": 178.032,
    "text": "Because if you know it's not raining and this person goes out with an umbrella, then you can say he has a false belief that it's going to rain, and his belief is different from mine, and I have to take this into account when I predict what he is going to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 178.568,
    "end": 181.432,
    "text": " So that's basically what mentalizing is about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 181.492,
    "end": 184.797,
    "text": "That's the process of predicting what other people's mental states are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 185.879,
    "end": 189.845,
    "text": "And mental states meaning things like intentions, beliefs and desires.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 190.786,
    "end": 196.855,
    "text": "And we think that this is probably different from understanding people's emotions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 198.698,
    "end": 201.081,
    "text": "Yes, I can imagine a lot of people make that conflation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 201.702,
    "end": 205.588,
    "text": "I guess a further thing to unpack there is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 205.957,
    "end": 213.326,
    "text": " when people hear about sort of mentalizing, they might think of autism and the associated difficulties in mentalizing that seem to be associated with autism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 213.887,
    "end": 220.475,
    "text": "But over time, uh, many autistic people use heuristics or tricks or social cues to mentalize.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 221.216,
    "end": 221.977,
    "text": "Is there a difference?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 222.738,
    "end": 229.527,
    "text": "Because behaviorally they might manifest similarly permit kind of harmonious social interaction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 230.248,
    "end": 234.293,
    "text": "Oh, it's theory of mind or mentalizing committed to saying that, uh,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 234.475,
    "end": 240.721,
    "text": " those who are mentalizing actually have a mental representation, a kind of recursive mental representation of what the other person is thinking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 242.382,
    "end": 243.744,
    "text": "Well, that's what I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 243.764,
    "end": 245.866,
    "text": "I don't think everybody agrees with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 246.566,
    "end": 263.082,
    "text": "There is, I mean, more recently, there is evidence that there are two, I mean, depends on how you decide to talk about it, two levels of mentalizing, which some people say the lower one is not really mentalizing, but that is to say some sometimes called behavior reading.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 263.855,
    "end": 272.748,
    "text": " that you can make many of these predictions without needing to know about other people's mental states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 274.11,
    "end": 279.678,
    "text": "And it's also, in some sense, automatic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 279.698,
    "end": 289.592,
    "text": "So it happens you don't have to think about it, you just know this is the right way to behave next in this interaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 290.247,
    "end": 304.222,
    "text": " And in relation to autism, there's some suggestion that it's this lower level part that they find difficult and that the heuristics, as you call them, are in fact something that we all use.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 304.322,
    "end": 315.073,
    "text": "So there's this thing called folk psychology, which is supposed to be inferior, but I think is actually very important, which is that we know",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 315.408,
    "end": 319.973,
    "text": " This is the idea that people do indeed behave because of their beliefs and desires.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 320.053,
    "end": 323.517,
    "text": "And that's how we can predict their behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 323.557,
    "end": 326.5,
    "text": "And this is a cultural phenomenon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 326.56,
    "end": 332.687,
    "text": "So in different cultures, you may have different ideas about how folk psychology works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 333.708,
    "end": 344.74,
    "text": "And in particular, there's some anthropological work on the certain people who come from the Pacific Rim, which includes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 344.905,
    "end": 357.317,
    "text": " Mayas in Mexico and Fiji and these various other places where they There's a cultural Attitude that it's impossible to know what other people's mental states are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 357.677,
    "end": 364.464,
    "text": "Mm-hmm And that you shouldn't bother to try and in fact children are brought up not you know You shouldn't be doing this sort of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 364.484,
    "end": 374.153,
    "text": "You just look at their behavior and it even extends to sort of interesting semi-legal situations where in the West",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 374.437,
    "end": 378.323,
    "text": " we're very concerned that it's the intention that counts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 379.745,
    "end": 382.549,
    "text": "The intention is more important than the outcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 383.33,
    "end": 386.094,
    "text": "Whereas in these other cultures, the outcome is all that matters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 386.775,
    "end": 390.781,
    "text": "And even if it's an accident, you'll be punished equally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 391.322,
    "end": 396.77,
    "text": "So there's an interesting level of, I think, cultural effects on some of these mentalising stories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 397.15,
    "end": 401.777,
    "text": "Yes, philosophically, I certainly have issues with that, but we won't go into that too much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 402.5,
    "end": 403.401,
    "text": " Yes, that's interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 403.421,
    "end": 408.348,
    "text": "I guess because it also maps onto our scientific institutions and our way of actually viewing what's going on mentally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 408.929,
    "end": 413.895,
    "text": "I can't help but notice that we are presupposing mental representations even when I ask that question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 414.516,
    "end": 418.081,
    "text": "And I've been sort of delving into the world of radical inactivist cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 418.722,
    "end": 421.966,
    "text": "And they would say, well, there are no representations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 422.447,
    "end": 423.408,
    "text": "There is no content.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 424.27,
    "end": 430.618,
    "text": "All we have are these dynamic relationships between or these dynamic couplings between agent and arena.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 431.62,
    "end": 432.0,
    "text": "Does that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 432.841,
    "end": 442.192,
    "text": " Is that, does theory of mind collapse if we just permit that these are, I guess they talk about sort of perceiving correlations in the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 442.252,
    "end": 448.72,
    "text": "That's something that they're very excited about, but actually this isn't a, you know, this isn't necessarily a representation or intentional stance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 450.943,
    "end": 457.11,
    "text": "Does it, does it, is it compatible with these sort of ramped up versions of an activist cognition?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 458.693,
    "end": 459.514,
    "text": " Hello, everyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 459.594,
    "end": 463.08,
    "text": "And I do apologize for interrupting the flow of the conversation with Chris.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 463.781,
    "end": 475.138,
    "text": "I wanted to add this little bit because I realized upon watching the conversation that I had with Chris, at this juncture, I did misspeak and misconstrue and overgeneralize the claims of REC, at least explicated by Hato and Mayan.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 475.819,
    "end": 481.488,
    "text": "So I made it out as if they say that all cognition is contentless.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 482.008,
    "end": 483.11,
    "text": "This is not actually what they say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 483.17,
    "end": 486.996,
    "text": "They say that basic mind or basic cognition is contentless.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 487.33,
    "end": 511.617,
    "text": " whereby basic cognition means all cognitive activities except those involving public language and cultural symbol systems so again they do not say that all cognition is contentless because they because there are also these higher order forms of cognition which might be content involving and again those require public symbols social practices of symbolic uh communication so they're therefore governed by semantic norms and these correctness conditions",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 512.002,
    "end": 517.431,
    "text": " So where the theory of mind is that, that higher order form or lower order form, I guess, is for you to decide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 517.972,
    "end": 526.786,
    "text": "But you'll see later on, I speak about these kind of scaffolded developmental capacities, which might involve content as if it wasn't part of the theory of heart and mind, but it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 527.367,
    "end": 533.537,
    "text": "And so I really wanted to clarify that before this goes, before this podcast goes live again, just more broadly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 534.26,
    "end": 539.849,
    "text": " I do want to take responsibility as your podcast host for saying things are accurate and truthful and owning up when I make mistakes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 540.23,
    "end": 545.578,
    "text": "This was one of those places I would have edited out, but it really would have messed up the flow of the conversation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 545.598,
    "end": 551.728,
    "text": "So I thought it was easier for me to just come on here and clarify that I made a mistake and hopefully clear up any confusion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 551.708,
    "end": 570.78,
    "text": " Again, I don't mind too much if I mess up describing what I think because they're my thoughts, but I know that authors far more senior than me have put a lot of time and a lot of effort into their accounts, and so it would be doing a disservice to them, a disservice to you, if I misconstrue or misspeak when describing their thoughts and their writings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 570.76,
    "end": 577.348,
    "text": " So when I do this again, because, you know, in the heat of the moment, in the moment, I will make mistakes as I did here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 577.368,
    "end": 580.452,
    "text": "And again, it's just because these are live conversations I'm having to think on my feet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 581.212,
    "end": 584.476,
    "text": "But when I do it again, because unfortunately I'm fallible, please do tell me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 585.858,
    "end": 587.3,
    "text": "I will always look out for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 587.34,
    "end": 588.561,
    "text": "I'm happy that I spotted this one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 588.581,
    "end": 593.547,
    "text": "But again, I feel a very strong responsibility to be as accurate as possible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 593.828,
    "end": 594.929,
    "text": "So that relies on you as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 594.969,
    "end": 596.751,
    "text": "So please do inform me when I make a mistake.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 597.288,
    "end": 606.023,
    "text": " And I will not keep you any longer, because this is a cracking conversation with Chris, and I hope you enjoy the rest of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 606.043,
    "end": 608.287,
    "text": "Yeah, I'm not very keen on these ramped-up versions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 609.629,
    "end": 622.671,
    "text": "It's conceivable that this might be a useful way of looking at the sort of automatic mentalising, but I think the sort of cultural folk psychology story",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 624.254,
    "end": 626.397,
    "text": " very much depends on representations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 626.497,
    "end": 628.58,
    "text": "I mean, we almost were talking about them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 632.687,
    "end": 642.922,
    "text": "There's a philosopher called Davidson, and I can't remember precisely what he said, but it's all about applying rational arguments to what we believe are these mental states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 642.982,
    "end": 648.65,
    "text": "So you're saying if he believes that the chocolate is in the cupboard, he will go and look in the cupboard.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 648.851,
    "end": 653.097,
    "text": "It's the sort of philosophical approach to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 653.414,
    "end": 653.895,
    "text": " Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 653.915,
    "end": 660.985,
    "text": "I mean, no, as you say, I mean, these are, uh, sort of an activist cognition on steroids.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 661.566,
    "end": 672.843,
    "text": "Um, that of course people, and I don't think you would disagree with them that recognize that if there are representational schema, those are built off scaffolds that occur from social cognition, developmental psychology, being with others.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 672.863,
    "end": 673.904,
    "text": "And I don't think you would disagree with that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 673.924,
    "end": 679.913,
    "text": "And that is something that I want to touch upon, um, in terms of self modeling and self perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 680.514,
    "end": 680.814,
    "text": "But yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 681.135,
    "end": 681.295,
    "text": "Um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 681.595,
    "end": 682.576,
    "text": " Actually, I'll backtrack.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 682.596,
    "end": 689.526,
    "text": "I don't think they would say that cognition is non-intentional, just that it's non-contentful or non-representational.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 690.367,
    "end": 692.871,
    "text": "But there are obviously quite severe critiques of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 692.891,
    "end": 696.716,
    "text": "And there probably are of representation as well, as they make clear in their works.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 697.918,
    "end": 707.792,
    "text": "So now expanding that out to away from didactic or not didactic, dyadic interactions into broader social contexts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 708.693,
    "end": 710.556,
    "text": "Why going beyond just",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 710.823,
    "end": 711.985,
    "text": " the coupled duo?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 712.025,
    "end": 717.153,
    "text": "Why is theory of mind or mentalizing so important just for social institutions more broadly?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 719.297,
    "end": 725.246,
    "text": "Well, I would claim that we don't think that necessarily.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 726.428,
    "end": 727.65,
    "text": "We think that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 728.778,
    "end": 732.721,
    "text": " that some people seem to equate social cognition with theory of mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 733.482,
    "end": 733.602,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 733.622,
    "end": 734.443,
    "text": "And we do not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 735.083,
    "end": 735.504,
    "text": "Sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 735.524,
    "end": 735.764,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 735.784,
    "end": 736.765,
    "text": "Let's clarify that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 736.785,
    "end": 737.065,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 737.625,
    "end": 745.832,
    "text": "So we think there are all sorts of social cognitive processes that are not to do with representing mental states or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 746.773,
    "end": 752.698,
    "text": "And many of those might be more relevant to larger group interactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 753.839,
    "end": 758.683,
    "text": "And we talked about having what's and the original paper that we read,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 759.575,
    "end": 764.002,
    "text": " in 1999, I think, which is sort of starting in social cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 764.063,
    "end": 770.874,
    "text": "We had mentalizing on one side and we had mirror neurons on the other side because they had only recently been confirmed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 771.695,
    "end": 782.133,
    "text": "And mirror neurons are all about how we can imitate others and how we get, what's the word, contagion from others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 782.253,
    "end": 783.355,
    "text": "So for example,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 783.993,
    "end": 785.715,
    "text": " emotions are contagious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 785.855,
    "end": 788.938,
    "text": "We tend to feel the emotions that other people are expressing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 788.958,
    "end": 791.541,
    "text": "We tend to do what other people do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 793.183,
    "end": 794.945,
    "text": "We imitate their actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 795.806,
    "end": 800.491,
    "text": "And one very important aspect of human sociality is over-imitation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 800.611,
    "end": 801.652,
    "text": "Do you know about that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 802.213,
    "end": 812.304,
    "text": "Yes, I've seen some of it in sort of linguistic innovation, where a language learner learning another's language will over-imitate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 812.404,
    "end": 813.966,
    "text": "And so there'll be sort of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 814.486,
    "end": 819.494,
    "text": " They'll all speak in RP, for example, even though no one's spoken in RP since 1910.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 821.116,
    "end": 824.741,
    "text": "Yes, but I haven't thought about it so much in that respect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 824.882,
    "end": 828.808,
    "text": "It's more to do with simple actions like shaking hands.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 830.65,
    "end": 832.393,
    "text": "And you have to do it in the right way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 832.745,
    "end": 840.716,
    "text": " And the early experiments where they had these puzzle boxes which you have to solve by going through a series of maneuvers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 841.677,
    "end": 848.046,
    "text": "And the trainer puts in a couple of maneuvers that are not actually necessary to open the box.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 849.148,
    "end": 857.119,
    "text": "But the children all imitate these as part of the, that's the over-imitation bit, so that they do them even though they're not necessary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 857.619,
    "end": 860.203,
    "text": "And the interesting thing is that chimpanzees don't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 861.82,
    "end": 891.675,
    "text": " interesting so this is we're imitating not to get to the reward we're imitating to show that we are doing it properly we are part of the group we are the people who behave like this and they're all yes yeah so it's kind of in a sense directed at what in active inference terms kind of a higher a higher order prior uh yes that's very interesting yeah i mean um i guess to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 892.162,
    "end": 893.404,
    "text": " return to my initial question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 893.945,
    "end": 896.209,
    "text": "Yes, I recognize it might be an overextension of theory of mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 896.229,
    "end": 899.195,
    "text": "I didn't mean it in terms of everything is theory of mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 900.016,
    "end": 906.327,
    "text": "Clearly not the case, because then it would be sort of serious cognitive overload if I was just mentalizing everyone and everything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 906.347,
    "end": 911.597,
    "text": "And it sounds borderline schizophrenic to be thinking that, you know, my chair has intentions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 912.058,
    "end": 913.36,
    "text": "But it seems to me that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 913.93,
    "end": 919.116,
    "text": " even in making or acting to confirm that higher order prior that, uh, I am like you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 919.196,
    "end": 923.08,
    "text": "And so you're going to like me and we're going to be able to establish this recursive relationship.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 923.901,
    "end": 937.415,
    "text": "I need to have at the very fundamental of that, a notion that you are an intentional conscious agent, which kind of seems to me to be a very low level form of theory of mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 937.475,
    "end": 941.76,
    "text": "It might be implicit in our interactions, but that still seems to be present.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 943.141,
    "end": 943.381,
    "text": " Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 943.421,
    "end": 944.823,
    "text": "That's a very interesting idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 944.843,
    "end": 952.471,
    "text": "Um, one of the things that we've written about is sort of addressing this question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 952.511,
    "end": 966.827,
    "text": "How do we know when we're wanting to in competitive situations and which usually means you're playing an economic game like hide and seek.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 966.847,
    "end": 968.229,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 968.329,
    "end": 968.389,
    "text": "Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 969.618,
    "end": 973.464,
    "text": " you need to know what sort of agent you're competing against.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 974.084,
    "end": 976.107,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 976.127,
    "end": 980.934,
    "text": "And, um, if it's a very, you know, it could be a completely random agent that just is biased.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 980.954,
    "end": 989.927,
    "text": "So it's very easy to beat one of those, or it could be a simple learning agent that, um, depends on what's, you know, the pattern of reward in the past.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 991.469,
    "end": 993.452,
    "text": "And it's fairly easy to beat one of those.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 993.512,
    "end": 994.073,
    "text": "Hmm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 994.306,
    "end": 1003.462,
    "text": " And the most difficult ones to beat are the ones that are intentional and are trying to predict what you're going to do as well as the same time as you're trying to predict what they're going to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1003.683,
    "end": 1006.027,
    "text": "Like rock, paper, scissors or something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1006.047,
    "end": 1014.442,
    "text": "Yes, and then that's where you get into this infinite recursion where you say, does he have a representation of what I think he's going to do next?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1014.642,
    "end": 1017.327,
    "text": "Yeah, yeah, yeah, yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1017.475,
    "end": 1030.588,
    "text": " And what is interesting, at least the bits of information I have, it's very difficult to work out that you're competing against an intentional agent from their behaviour.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1031.569,
    "end": 1034.232,
    "text": "And therefore we tend to depend on our prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1034.312,
    "end": 1037.996,
    "text": "If we think it's an intentional agent, we'll behave in such and such a way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1038.036,
    "end": 1040.418,
    "text": "If we think it's not, we won't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1040.478,
    "end": 1042.2,
    "text": "And there's this nice experience from...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1042.619,
    "end": 1051.192,
    "text": " John Donizzo's group in Paris, where he has people, he has artificial agents that can do recursive tom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1053.416,
    "end": 1056.741,
    "text": "And he has people playing against them, you know, at various levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1056.821,
    "end": 1061.828,
    "text": "You can have zero tom, one tom, two tom, and so on, in terms of recursion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1061.848,
    "end": 1070.061,
    "text": "And if you tell them they're playing against a one-armed bandit, they assume that it's not intentional and they lose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1071.273,
    "end": 1078.807,
    "text": " when the agent is functioning at two levels of recursion, even though they have several hundred files.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1079.508,
    "end": 1087.002,
    "text": "If they think it's a person, they will adopt the high-level strategy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1087.563,
    "end": 1090.328,
    "text": "And of course, this is reasonable because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1090.696,
    "end": 1097.125,
    "text": " this high level mentalizing is extremely cognitively demanding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1097.585,
    "end": 1097.846,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1098.567,
    "end": 1101.15,
    "text": "So you're going to avoid going to that level if you can.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1101.23,
    "end": 1102.552,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1102.792,
    "end": 1109.221,
    "text": "And there's this nice, and they do know about the beauty contest game, which is a nice example of this suit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1109.241,
    "end": 1109.421,
    "text": "I don't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1111.324,
    "end": 1113.927,
    "text": "Ah, this is invented by John Maynard Keynes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1114.048,
    "end": 1118.053,
    "text": "Anyway, the task is you're part of a group,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1119.012,
    "end": 1129.23,
    "text": " everybody has to produce a number between one and a hundred and the person who produces half the mean production will win.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1129.27,
    "end": 1130.973,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1133.318,
    "end": 1142.995,
    "text": "Key Keynes called it a beauty contest game because when you have to say who is the most beautiful person is not who is the most beautiful person, but who people think is the most beautiful person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1143.633,
    "end": 1149.641,
    "text": " Anyway, the argument is you have to think about what the other people are going to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1149.681,
    "end": 1158.814,
    "text": "And you think if they're completely stupid, then 50 will be the average number and therefore you'll win with 25.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1159.115,
    "end": 1166.485,
    "text": "If they're not completely stupid, they think it's going to be 25, therefore you'll win with 12.5.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1166.853,
    "end": 1173.459,
    "text": " if you've read about Nash equilibrium, you think everybody's super rational and you're saying one, so you always lose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1174.36,
    "end": 1182.087,
    "text": "Um, and the average, I mean, there've been huge experiments on this in newspapers where they get thousands of people to take part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1182.127,
    "end": 1185.25,
    "text": "And the average number of level of recursion is two and a half.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1187.593,
    "end": 1187.953,
    "text": "Interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1188.193,
    "end": 1188.413,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1188.433,
    "end": 1189.835,
    "text": "It has to be a cutoff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1189.855,
    "end": 1194.499,
    "text": "This is what we call, I think Carl would call it bounded rationality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1194.559,
    "end": 1194.939,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1195.36,
    "end": 1195.56,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1196.35,
    "end": 1210.125,
    "text": " Yeah, well, yes, I guess it's also, I guess in some sense to do with the depth of your temporal hierarchy, um, because each recursive step seems to me at least to be kind of a, an N plus one in your kind of information space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1210.226,
    "end": 1213.069,
    "text": "And so you'll just go into the next one and it has to be an end at some point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1213.109,
    "end": 1213.93,
    "text": "We can't plan forever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1213.97,
    "end": 1215.552,
    "text": "That's fascinating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1215.772,
    "end": 1215.992,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1216.092,
    "end": 1216.753,
    "text": "That's fascinating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1216.973,
    "end": 1221.658,
    "text": "Yeah, no, that's, that's the other game I'm interested in is the, um, stag hunt game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1222.58,
    "end": 1223.941,
    "text": "Yeah, I know the fact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1223.981,
    "end": 1224.101,
    "text": "Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1224.161,
    "end": 1224.822,
    "text": "Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1225.156,
    "end": 1233.445,
    "text": " And that's, again, seems to be recursive, because if I'm going to hunt stags, I have to believe that you're going to hunt stags, and I have to believe that you think that I'm going to hunt stags.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1234.806,
    "end": 1240.612,
    "text": "And it seems to me the heuristic there that solves all this to say, we are cooperative people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1242.855,
    "end": 1244.617,
    "text": "And I don't have to worry about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1245.558,
    "end": 1246.819,
    "text": "Yeah, a couple of things come to mind there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1246.839,
    "end": 1250.463,
    "text": "I mean, Dennett, as I'm sure you know, has this notion of an intentional stance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1251.384,
    "end": 1253.526,
    "text": "You think that maps",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1253.658,
    "end": 1264.91,
    "text": " ontologically onto our sort of priors, in some sense that we, we start off with the notion that things are intentional, animate, conscious, however you want to term it, and then we start pruning?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1265.911,
    "end": 1267.392,
    "text": "Or is it the other way?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1267.413,
    "end": 1269.555,
    "text": "I think it's, I think it's the other way around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1269.595,
    "end": 1272.718,
    "text": "We want to start with the idea that it's all very easy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1273.659,
    "end": 1275.261,
    "text": "Yes, yeah, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1276.002,
    "end": 1281.167,
    "text": "But we do have, I think we have a prior that people are intentional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1282.75,
    "end": 1288.443,
    "text": " And would that be, and would we get that evidence from the phenotype of people, so to speak?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1288.483,
    "end": 1294.097,
    "text": "So, so if you have a similar body to me, you move in a similar way to me, you speak in a similar way to me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1294.738,
    "end": 1301.113,
    "text": "That is evidence to confirm that prior, but I guess it has to be an evolutionary prior, quite a non.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1301.735,
    "end": 1303.978,
    "text": " conceptual level, because evolution doesn't work like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1303.998,
    "end": 1307.602,
    "text": "It's not gonna say if you've got if you're six foot, you're an agent, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1307.622,
    "end": 1311.266,
    "text": "It's, it needs to be a little bit more subtle than that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1311.747,
    "end": 1312.327,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1312.347,
    "end": 1317.514,
    "text": "But certainly, there's this somewhat discouraging work on in groups and out groups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1317.614,
    "end": 1320.217,
    "text": "Yeah, groups are considered to be less intentional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1321.738,
    "end": 1323.941,
    "text": "Gosh, yeah, that's quite terrifying.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1324.582,
    "end": 1325.423,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1325.443,
    "end": 1325.703,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1326.204,
    "end": 1329.668,
    "text": "But that said, I mean, we do have it makes me think of the fusiform facial area.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1330.088,
    "end": 1330.729,
    "text": "And the fact that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1330.895,
    "end": 1334.099,
    "text": " That certainly constitutes some kind of perceptual prior, at least.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1335.982,
    "end": 1336.282,
    "text": "Excellent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1336.302,
    "end": 1336.823,
    "text": "That's very good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1337.183,
    "end": 1341.91,
    "text": "I mean, I was listening to an interview that you and Uta did with, I think it was the dissenter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1342.05,
    "end": 1343.191,
    "text": "It would have been about a month ago.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1343.772,
    "end": 1352.964,
    "text": "And I think I just was listening to the beginning and Uta, I think it was Uta mentioned that we could consider cognition all, like entirely social cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1353.385,
    "end": 1354.867,
    "text": "So all cognition is social cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1354.887,
    "end": 1359.012,
    "text": "It makes me think my master's thesis was exploring what's called social baseline theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1359.245,
    "end": 1360.407,
    "text": " And I wonder what you thought about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1360.427,
    "end": 1361.89,
    "text": "I'm not sure you're aware of social business.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1362.591,
    "end": 1368.361,
    "text": "So this is a kind of, the experimental work for it started in sort of 2006, 2007.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1368.402,
    "end": 1371.567,
    "text": "And then the theory was fleshed out sort of early last decade.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1371.587,
    "end": 1372.93,
    "text": "So this is people like James Cohen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1372.99,
    "end": 1373.551,
    "text": "I think it's Cohen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1373.611,
    "end": 1375.915,
    "text": "It might be Cohen, Elizabeth Gross.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1376.156,
    "end": 1377.959,
    "text": "These are people that the audience can search up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1378.44,
    "end": 1383.649,
    "text": "But the notion is, is that the primary ecological niche we find ourselves in is social.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1383.916,
    "end": 1384.377,
    "text": " Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1384.397,
    "end": 1397.271,
    "text": "And so what that means is that the human brain for adaptive reasons expects social resources because it, and in doing so it, that acts to mitigate risk and also preserve energy expenditure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1397.751,
    "end": 1398.972,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1398.992,
    "end": 1404.539,
    "text": "So what they then say, and why it's called social baseline theory is that being with others constitutes a cognitive baseline.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1404.999,
    "end": 1413.248,
    "text": "So that when we actually put people in an FMRI scanner and we get them to do a task alone, which is the standard in cognitive psychology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1413.937,
    "end": 1423.508,
    "text": " we're actually viewing them as a deficit because they have to engage in all of this self-regulatory processes that they would be doing to a lesser degree if they were trusted others.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1424.008,
    "end": 1426.351,
    "text": "How does that sound to you as a theory?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1427.492,
    "end": 1429.715,
    "text": "Oh, I love that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1429.795,
    "end": 1433.038,
    "text": "I'm very sad that I didn't know about it until now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1433.178,
    "end": 1435.801,
    "text": "There's these really beautiful experimental studies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1435.841,
    "end": 1440.346,
    "text": "I think the most famous one is that people perceive a hill to be less steep if they're with someone else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1441.588,
    "end": 1442.329,
    "text": "Oh, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1442.389,
    "end": 1443.69,
    "text": "Because I think the...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1444.345,
    "end": 1452.093,
    "text": " perception in some ways, I guess it feeds into a broader question about to what degree is perception influenced by top down factors?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1452.133,
    "end": 1452.854,
    "text": "Is it modular?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1453.515,
    "end": 1456.878,
    "text": "I mean, I come from active inference something no, like it's definitely influenced.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1457.159,
    "end": 1458.56,
    "text": "But I think notion is a perceptual.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1459.441,
    "end": 1470.633,
    "text": "Yeah, a percept is influenced by your notion of how much effort is going to be in some sense, the affordance, how much effort is going to be to exploit that affordance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1470.653,
    "end": 1472.395,
    "text": "So being with others reduces our efforts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1473.083,
    "end": 1474.966,
    "text": " No, I think that I would entirely agree with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1475.006,
    "end": 1481.077,
    "text": "And there's other experiments that we did talk about in the book, which I didn't know how they relate to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1481.117,
    "end": 1483.721,
    "text": "And I'm not sure whether the baseline people know about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1483.741,
    "end": 1485.584,
    "text": "This is about affordance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1485.624,
    "end": 1486.526,
    "text": "This is this business.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1487.608,
    "end": 1493.758,
    "text": "If you have a table with mugs on it, you can show that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1495.831,
    "end": 1505.047,
    "text": " you will get, when the mug appears, as it were, if it's within your reach, you will get activity in motor cortex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1506.79,
    "end": 1508.593,
    "text": "And there's a social version of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1508.653,
    "end": 1511.258,
    "text": "If there's a second person sitting at the table,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1511.66,
    "end": 1522.714,
    "text": " Even a mug that's out of your reach but in his reach will activate the motor system so that you're treating this as sort of group affordance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1524.456,
    "end": 1525.617,
    "text": "I call it the we mode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1525.637,
    "end": 1526.959,
    "text": "It's within our reach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1527.84,
    "end": 1529.462,
    "text": "And that seems to happen automatically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1529.482,
    "end": 1531.204,
    "text": "So that's entirely consistent with this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1532.305,
    "end": 1533.727,
    "text": "That is wonderful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1533.767,
    "end": 1541.076,
    "text": "I guess in some sense, from an active influence perspective, it's worth predicting others' actions as if they were our own because their actions are so...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1541.731,
    "end": 1544.174,
    "text": " influential on personal outcomes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1544.614,
    "end": 1549.699,
    "text": "But I was thinking more, it's like the monkey and the rake, we can use this person as a tool to get Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1551.461,
    "end": 1551.842,
    "text": "Ah, yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1552.502,
    "end": 1552.863,
    "text": "Ah, okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1552.883,
    "end": 1553.944,
    "text": "So mine was a bit more generous.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1554.004,
    "end": 1555.746,
    "text": "I guess it was a little bit more altruistic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1556.787,
    "end": 1557.968,
    "text": "Okay, okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1557.988,
    "end": 1558.489,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1558.509,
    "end": 1560.211,
    "text": "Yeah, that's, that's, that's an interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1561.292,
    "end": 1562.473,
    "text": "That's an interesting stance on it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1562.994,
    "end": 1563.274,
    "text": "I guess.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1564.875,
    "end": 1570.101,
    "text": "I mean, the answer, you know, a test of that would be for the other person sitting at the table is your enemy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1571.887,
    "end": 1575.03,
    "text": " Would it would you then not get the affordance from the things?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1575.05,
    "end": 1575.21,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1576.251,
    "end": 1577.392,
    "text": "Has someone done that experiment?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1577.792,
    "end": 1578.573,
    "text": "I don't think so.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1579.174,
    "end": 1579.614,
    "text": "worthwhile.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1580.215,
    "end": 1589.403,
    "text": "An interesting experiment for experiment that I think you've used and Carl has used is let's say we're on some exoplanet and it's just me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1590.264,
    "end": 1590.644,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1592.366,
    "end": 1596.83,
    "text": "I don't I want to leave the questions about agency and sense of self for a bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1597.15,
    "end": 1597.951,
    "text": "Because I do want to get there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1597.971,
    "end": 1599.092,
    "text": "That's kind of more my",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1599.41,
    "end": 1606.4,
    "text": " Speciality, the work that I focus on is more to do with self modeling, but we say, okay, all cognition is social cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1606.42,
    "end": 1607.342,
    "text": "It's built into us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1607.362,
    "end": 1608.403,
    "text": "It's, it's our baseline.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1608.784,
    "end": 1609.705,
    "text": "We have social priors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1611.227,
    "end": 1616.015,
    "text": "Therefore, what happens when we start denying evidence for those priors?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1616.395,
    "end": 1619.48,
    "text": "If I'm in the planet, which was just end of one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1620.221,
    "end": 1629.214,
    "text": "And I guess, are there differences there for, if that was always the case versus I've just been plopped there and I've now I have a memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1629.43,
    "end": 1632.855,
    "text": " in some sense, of being a social creature, which is now being denied to me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1634.237,
    "end": 1636.44,
    "text": "I think, yes, there would be a huge difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1637.602,
    "end": 1645.072,
    "text": "If you just drop there, it's a bit like being put into solitary confinement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1645.393,
    "end": 1654.105,
    "text": "I'm sure you will start thinking about the past or making up stories or about social interactions and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1654.557,
    "end": 1659.403,
    "text": " And I was thinking also your nice point about being an MRI scanner all by yourself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1660.184,
    "end": 1666.591,
    "text": "I suspect what most people do when they're an MRI scanner all by myself are thinking about what on earth is the experimenter doing this for?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1667.612,
    "end": 1667.812,
    "text": "Sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1668.193,
    "end": 1673.339,
    "text": "I think that when I get x-rays, actually, I'm like, why are they doing this with the blocks of lead and stuff?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1673.359,
    "end": 1673.599,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1673.839,
    "end": 1683.771,
    "text": "If you'd never had social interactions, I would think you would be, well, in the extreme, I had a strange interaction long ago with Christophe Koch talking about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1684.679,
    "end": 1689.485,
    "text": " I was trying to talk about, you know, what's the function of consciousness and I was putting down with it's all social.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1690.606,
    "end": 1695.372,
    "text": "So my argument would be if you were never had interactions with other people, you would not be conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1695.672,
    "end": 1696.774,
    "text": "I think Carl has a similar.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1696.814,
    "end": 1698.216,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1698.576,
    "end": 1698.796,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1699.417,
    "end": 1700.919,
    "text": "And what was Christoph's response to that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1703.382,
    "end": 1705.605,
    "text": "Consciousness is in these special neurons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1706.766,
    "end": 1708.989,
    "text": "I don't think that one's got very far.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1709.469,
    "end": 1710.13,
    "text": "Sorry, Christoph.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1710.346,
    "end": 1712.669,
    "text": " You're far more senior than me, but I don't think that one's got very far.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1712.689,
    "end": 1714.051,
    "text": "And he lost that bet to David Chalmers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1714.071,
    "end": 1715.533,
    "text": "I think he had to give him that case of wine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1716.454,
    "end": 1718.456,
    "text": "So I think he lost.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1719.457,
    "end": 1720.479,
    "text": "Well, that's a really interesting point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1720.499,
    "end": 1725.385,
    "text": "Let's go there then, because as I said, this is really where I want to go is this self-modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1726.466,
    "end": 1739.863,
    "text": "I'm thinking, and again, this is something that I've spoken to Carl about and I've heard Carl mention, which is that we need in some sense to be able to infer the agency of others or their self-model to be able to apply to ourselves a self-model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1740.569,
    "end": 1742.932,
    "text": " Um, there's a wonderful paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1743.232,
    "end": 1747.898,
    "text": "I like shouting out papers here so that people can go read and also just to give credit where it's due by Jacob Howie.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1748.579,
    "end": 1750.761,
    "text": "Um, and I think his last name is Michael.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1750.781,
    "end": 1757.109,
    "text": "I'm not sure what his first name is and it's called, why does anybody have a self it's any body too much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1757.129,
    "end": 1769.304,
    "text": "And they talk about sort of cultural imitation as really being foundational to the development of a sense of agency in the sense that I'm going to shape myself model on what I see as kind of optimal agentic behavior on the part of others.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1769.985,
    "end": 1770.105,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1770.145,
    "end": 1770.205,
    "text": "So.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1770.877,
    "end": 1781.521,
    "text": " I guess the question here is how necessary is this capacity for inference of the agentic state of another or the mental states of another for our own formation of agency and selfhood?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1783.966,
    "end": 1789.358,
    "text": "I certainly think that selfhood depends on interacting with others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1790.249,
    "end": 1794.254,
    "text": " Though I think you could get quite a long way without doing mentalizing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1794.354,
    "end": 1799.281,
    "text": "It could be based on behavior to a certain extent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1799.962,
    "end": 1811.017,
    "text": "But one of the things that we talk about quite a lot in our book is reputation, which is very important economically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1811.337,
    "end": 1818.687,
    "text": "Adam Smith, who invented economics, talked about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1819.139,
    "end": 1828.795,
    "text": " he didn't call it reputation, I can't quite remember, the esteem with which other people hold you in was more important than wealth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1829.716,
    "end": 1836.988,
    "text": "And what the main driving factor in human behaviour is to get the esteem of others, to have a good reputation in other words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1837.85,
    "end": 1841.856,
    "text": "Though sometimes money can be a sort of marked proxy for this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1842.73,
    "end": 1857.138,
    "text": " And there are all sorts of interesting experiments on this because if you have a good reputation then people will trust you, they will choose to work with you, and they will invest money in you and all that sort of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1857.158,
    "end": 1863.591,
    "text": "And then you have a very interesting arms race.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1865.343,
    "end": 1882.249,
    "text": " with the free riders, because you want to have a good reputation, but you want to cheat people at the same time, and then you have to, that's why being anonymous is jolly useful for this sort of competitive situation, because no one, you don't have a reputation that carries with you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1883.471,
    "end": 1888.359,
    "text": "And it seems to me that reputation is an important aspect of the self.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1889.38,
    "end": 1893.747,
    "text": "And of course, the reputation is not in you, it's in the minds of others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1895.144,
    "end": 1895.886,
    "text": " Yes, exactly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1895.906,
    "end": 1898.431,
    "text": "But in some sense, it then gets transferred onto you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1898.451,
    "end": 1901.518,
    "text": "I mean, I think it's quite classic literary trope in some sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1901.538,
    "end": 1903.241,
    "text": "I've mentioned Luigi Pirandello before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1903.281,
    "end": 1905.646,
    "text": "I don't know why, but he's come up again here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1906.187,
    "end": 1909.795,
    "text": "He's got a very peculiar book called",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1910.18,
    "end": 1913.124,
    "text": " Uno Nessuno Cento Mila, one, no one, 100,000.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1913.164,
    "end": 1917.43,
    "text": "The notion is that these are different ways of modeling oneself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1917.79,
    "end": 1934.053,
    "text": "And what he goes around doing in this book, his protagonist, is he goes around trying to spot himself in mirrors so that he can perceive himself not... So he's trying to catch himself looking at himself not as others would perceive him, but sort of in this raw moment of self-perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1934.073,
    "end": 1937.858,
    "text": "And he eventually dissolves or goes a bit mental.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1938.175,
    "end": 1940.417,
    "text": " Yeah, that's one thing that came up into mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1940.477,
    "end": 1943.68,
    "text": "This is a far more folk or popular culture thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1943.7,
    "end": 1950.346,
    "text": "There's a very interesting show on the BBC right now called The Traitors, which I highly recommend.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1950.446,
    "end": 1957.672,
    "text": "It's about sort of 20 people in a castle and three of them are traitors and 17 of them are so-called faithfuls.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1958.173,
    "end": 1959.714,
    "text": "And they have to kind of guess who's who.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1960.415,
    "end": 1962.597,
    "text": "And if the traitors stay in, they win all the money.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1962.637,
    "end": 1964.118,
    "text": "If the faithfuls stay in, they win all the money.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1964.138,
    "end": 1966.36,
    "text": "So there's some trash reality element to it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1966.627,
    "end": 1989.124,
    "text": " it's a very interesting psychological recursive thing where there's lots of triple quadruple bluffings going on so that's really that in inaction and reputation yes plays a very big role in in trustworthiness and you're watching that as the objective sort of god-like figure and say well how could you not see that this person is so maligned um but you're not there in some sense okay that's that's interesting i guess",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1990.218,
    "end": 1993.262,
    "text": " A further question I had, and this is actually something I would love to explore personally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1993.562,
    "end": 1995.685,
    "text": "Um, cause I don't think anyone's done that much work on this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1996.125,
    "end": 2004.355,
    "text": "Um, so I've, I put this down as a sort of thing that I might want to explore in the PhD, which is that we seemingly have homogeneity in self-modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2005.397,
    "end": 2008.701,
    "text": "Um, so there are certain things that just come out of the literature here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2008.721,
    "end": 2019.634,
    "text": "I'm thinking about people like Danza, Danza Harvey and Sean Gallagher and, um, Yakob that it's in some way in the rational, in some ways it's, uh, epistemic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2020.238,
    "end": 2022.38,
    "text": " It's somewhat coherent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2023.041,
    "end": 2026.003,
    "text": "Um, again, this goes all the way back to like people like Derek Parfit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2026.023,
    "end": 2030.988,
    "text": "Um, but it's, and that is homogenous across us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2031.989,
    "end": 2046.261,
    "text": "I was wondering, do you think that that is a, quite a thought I had is that that's rooted in the fact that we all engage in similar processes to arrive at that self modeling, to arrive at that self conception, namely inference about others.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2047.503,
    "end": 2049.064,
    "text": "Does that seem reasonable?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2050.85,
    "end": 2051.611,
    "text": " Yes, I'm not sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2051.631,
    "end": 2080.637,
    "text": "I mean, I would have thought that there's a I mean, I'm not sure are you saying that because of our in inherent individual cognitive processes being similar to others, we arrive at the same end result, in some sense, but it's a little bit more specific in the sense that, let's say I'm a, I'm a child, and I watch my parents enact",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2081.663,
    "end": 2083.605,
    "text": " presumably agentic behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2084.146,
    "end": 2085.287,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2085.307,
    "end": 2088.951,
    "text": "My model of agentic behavior therefore starts to align with theirs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2090.313,
    "end": 2096.58,
    "text": "And what I do is I in according to active inference, I act in order to provide evidence for that prior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2097.501,
    "end": 2108.633,
    "text": "And so you see this kind of convergence over time on a self model of course, there's going to be variety, but these core features are present.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2109.76,
    "end": 2115.846,
    "text": " I would think that that certainly has a role, but I think there's also a role of a sort of top-down cultural effects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2116.907,
    "end": 2120.571,
    "text": "So you're told this is what agents, how agents behave.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2121.331,
    "end": 2121.471,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2122.352,
    "end": 2130.68,
    "text": "As I was saying, you're told, I mean, even the very simple level, you're told that people, you know, when people are, if people are eating a lot, it means they're hungry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2130.76,
    "end": 2136.426,
    "text": "I mean, even at this simple level, our behavior is determined by our desires.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2137.047,
    "end": 2140.711,
    "text": " is something that to some extent is top-down imposed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2141.331,
    "end": 2145.556,
    "text": "But I was thinking, you were mentioning all these various people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2145.596,
    "end": 2151.862,
    "text": "There's an interesting Galen Strawson objects to this narrative story.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2152.383,
    "end": 2152.883,
    "text": "Yes, he does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2154.044,
    "end": 2158.068,
    "text": "And I'm inclined to, I think there are different individual differences in this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2158.188,
    "end": 2159.049,
    "text": "I have no idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2159.069,
    "end": 2160.331,
    "text": "I don't have a plan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2160.351,
    "end": 2163.173,
    "text": "I never had a plan for my life as it were.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2163.974,
    "end": 2164.675,
    "text": "Me neither, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2165.397,
    "end": 2168.94,
    "text": " And I might be a quite different person next week.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2171.403,
    "end": 2171.583,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2171.643,
    "end": 2174.265,
    "text": "So, so yeah, Galen's critique is very apt here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2175.106,
    "end": 2182.153,
    "text": "And here, I guess he's kind of actually criticizing Dennett because Dennett is quite keen on talking about the linguistic form of this narrational sense of self.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2182.533,
    "end": 2193.463,
    "text": "Jacob Howie's got a similar point there, which is that maybe we can replace the word narrational with it's not as catchy, but something like a predictive coherence or hierarchical",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2193.595,
    "end": 2221.071,
    "text": " constraints or something like that in the sense that the higher levels of your uh generative hierarchy are tracking lower levels and so your preferences right like i like ice cream is going to dictate my behavior in the moment that i'm more likely to go get ice cream and that feeds back and forward right i think that maybe we could just i i don't know what that term would be um but no i think it's a reasonable critique cool that's interesting yeah let's um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2222.08,
    "end": 2224.705,
    "text": " Let's go to consciousness then, because it was something that you brought up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2225.326,
    "end": 2235.767,
    "text": "Um, so there were two quotes that I'll read back to you, if I may, that you've said, and I'm curious about what you think these are from papers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2235.807,
    "end": 2238.412,
    "text": "I haven't just, I was a completely different person then.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2238.452,
    "end": 2239.595,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2239.675,
    "end": 2239.895,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2239.935,
    "end": 2240.056,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2240.076,
    "end": 2240.456,
    "text": "That's right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2240.497,
    "end": 2240.697,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2240.717,
    "end": 2241.599,
    "text": "Very dark profit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2241.759,
    "end": 2242.44,
    "text": "There are lots of you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2242.961,
    "end": 2243.262,
    "text": "Um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2244.187,
    "end": 2250.315,
    "text": " In 1995, this is a while ago, in a very, I like the title of this paper, consciousness is for other people.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2251.115,
    "end": 2255.901,
    "text": "You wrote, the primary function of consciousness is to permit high level interactions with other conscious beings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2256.802,
    "end": 2259.205,
    "text": "And then this is, so that's about function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2260.167,
    "end": 2267.055,
    "text": "And then in another paper you wrote, phenomenological consciousness is necessary for taking an intentional stance towards other agents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2267.095,
    "end": 2270.119,
    "text": "To do this, we have to be able to treat ourselves as agents also.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2270.139,
    "end": 2273.603,
    "text": "I think we can just break off that second sentence, because we kind of touched upon that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2274.089,
    "end": 2296.907,
    "text": " there's there's one point where it's function is interactions and the second one is almost nature the necessity for uh intent the necessity for consciousness to take an intentional stance i don't know which order you want to take that in but it would be really interesting to unpick both of those well i think",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2299.165,
    "end": 2327.603,
    "text": " we've taken that a bit further actually start with the first one sure so this is a study on metacognition with various people particularly nick shea and cecilia hayes and the idea is and it but it comes from originally from our the work with bahadur which is about people working together you know this study i'm sure so people are working together to detect a weak visual signal",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2329.287,
    "end": 2340.719,
    "text": " And we show that two people working together and coming up with a consensus answer are more accurate than the more accurate person working on their own in the right context at least.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2341.42,
    "end": 2349.448,
    "text": "And the reason that this happens is that they're able to tell each other how confident they are in their belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2350.649,
    "end": 2356.375,
    "text": "And on a trial by trial basis, you choose the answer of the more confident person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2357.047,
    "end": 2363.076,
    "text": " So in other words, it depends on them telling each other about the phenomenal state, if you like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2365.5,
    "end": 2365.82,
    "text": "Why?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2365.86,
    "end": 2373.692,
    "text": "I've come across as David Chalmers as parrot on many times in this in this podcast, and I'm going to do it again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2374.473,
    "end": 2374.954,
    "text": "Why?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2375.609,
    "end": 2377.732,
    "text": " why is that necessarily the case?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2377.792,
    "end": 2390.149,
    "text": "So why could it not, why could it not just be an offline computation whereby we have two probability distributions that are just done completely like offline, non-phenomenal, they're just numbers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2391.07,
    "end": 2396.998,
    "text": "Um, and you know, you have a higher order agent or, or one of them, you know, there's just a, there's just a algorithm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2397.279,
    "end": 2404.148,
    "text": "If choose the higher one and none of this is done online, why do the lights need to be on, um, for that, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2404.921,
    "end": 2430.777,
    "text": " that successful interaction the information has to get from one mind to the other yes yes if if we presuppose that uh well what for adaptive behavior in this example yeah yes could that not be achieved also",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2430.925,
    "end": 2433.267,
    "text": " with offline minds, I guess is my point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2434.669,
    "end": 2441.135,
    "text": "Why do we need to invoke intentionality, qualia, subjectivity, all the fundamental tenets of consciousness?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2441.595,
    "end": 2444.398,
    "text": "I don't really quite understand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2444.938,
    "end": 2450.163,
    "text": "So Chalmers in 1995 speaks about how you can give me a function of consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2451.004,
    "end": 2457.49,
    "text": "So whether it's like a global workspace, or whether it's binding, or whether it's this, and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2457.993,
    "end": 2463.598,
    "text": " But you can never tell me about how that function maps onto its phenomenal nature and why that function couldn't happen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2463.858,
    "end": 2470.745,
    "text": "I think what's wrong with that is he's talking about the individual brain and I'm talking about interactions between two people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2471.626,
    "end": 2475.149,
    "text": "And the key thing of the interaction is that they have to communicate with each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2475.189,
    "end": 2477.651,
    "text": "In this case, confidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2479.453,
    "end": 2479.733,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2480.234,
    "end": 2486.92,
    "text": "But could we not have something like an artificial agent, which has precision, which could be a proxy for confidence?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2489.414,
    "end": 2495.88,
    "text": " And they're not conscious, they just have done some mathematical computations, the inverse entropy, and this is my confidence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2496.821,
    "end": 2498.723,
    "text": "You could have that with a large language model, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2500.385,
    "end": 2506.651,
    "text": "So you would have to have, so your argument would be if you had two artificial agents, they could also get better than one working on their own.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2507.152,
    "end": 2507.592,
    "text": "Precisely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2507.732,
    "end": 2508.713,
    "text": "In this situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2514.939,
    "end": 2517.842,
    "text": "Yeah, that would be my contention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2518.202,
    "end": 2518.763,
    "text": "Not that...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2519.283,
    "end": 2524.809,
    "text": " I again, that doesn't discount the that doesn't discount the putative role of consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2525.51,
    "end": 2529.975,
    "text": "It just discounts or calls into question the necessity for consciousness, I guess.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2530.475,
    "end": 2532.077,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2532.097,
    "end": 2547.113,
    "text": "But I mean, on the on the basis of that sort of experiment, we went a bit further, and started talking about do we actually learn from each other, how to interpret these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2547.65,
    "end": 2549.231,
    "text": " in the states that we have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2552.294,
    "end": 2575.615,
    "text": "Um, and again, it becomes very intentional and the intro and I'm not sure if this is relevant or not, but when we talk to each other about how confident we are, we can actually, then you get in competitive situations, we can express more confidence than is actually justified in order to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2577.198,
    "end": 2579.801,
    "text": " in this experiment was to become an advisor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2579.841,
    "end": 2586.65,
    "text": "So people would want to take your advice because you seem to be more confident about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2586.67,
    "end": 2588.032,
    "text": "That seems Yeah, yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2588.353,
    "end": 2598.967,
    "text": "My only concern, I guess, is that there are these interesting works coming out about sort of extended trust in mind robot interactions or mind artificial agent interactions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2599.768,
    "end": 2605.315,
    "text": "And if I have a belief that even a robot is extremely",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2605.615,
    "end": 2613.142,
    "text": " predictable and reliable and productive, I can offload a lot of my capacities to that robot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2613.362,
    "end": 2625.372,
    "text": "And actually, if we were in this kind of task, I could very happily take its interpretation of the events or its position as my own, and I might receive great outcomes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2625.893,
    "end": 2630.817,
    "text": "But I don't need to invoke in that any representational space within that robot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2633.7,
    "end": 2634.12,
    "text": "Does that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2634.708,
    "end": 2642.036,
    "text": " in some ways not called into question, even something like confidence, metacognition, whatever it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2643.217,
    "end": 2644.959,
    "text": "Again, I'm not doing that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2644.979,
    "end": 2647.182,
    "text": "I'm not calling into question the fact that it might be this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2648.043,
    "end": 2649.704,
    "text": "It's more the necessity of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2650.986,
    "end": 2656.011,
    "text": "Anyway, it's an interesting little rabbit hole.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2656.232,
    "end": 2657.093,
    "text": "Consciousness does this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2657.433,
    "end": 2661.998,
    "text": "Everywhere I've had on and we talk about consciousness, it leads into these rabbit holes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2662.518,
    "end": 2670.728,
    "text": " We had an interesting discussion on Tuesday at the Institute of Philosophy, because they're all obsessed with large language models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2671.169,
    "end": 2671.75,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2671.77,
    "end": 2678.879,
    "text": "And they were talking about, does it mean, does it understand what it's saying?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2680.321,
    "end": 2688.912,
    "text": "And it was interesting that the presenter was finishing up by saying, there is meaning, but it doesn't mean what it says.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2688.952,
    "end": 2690.854,
    "text": "So basically they decided that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2692.201,
    "end": 2695.409,
    "text": " together, the proper you had to have intentionality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2696.772,
    "end": 2696.993,
    "text": "Right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2697.594,
    "end": 2700.361,
    "text": "Yes, large language models don't currently have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2701.544,
    "end": 2708.24,
    "text": "How much of this is sort of rooted in John Searle's work, Chinese room and excellent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2708.321,
    "end": 2709.463,
    "text": "Yeah, it's good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2709.544,
    "end": 2710.125,
    "text": "I like to see that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2710.443,
    "end": 2712.286,
    "text": " 80s philosophy still has its role.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2713.288,
    "end": 2714.81,
    "text": "This is why I was sort of brought up on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2716.373,
    "end": 2716.934,
    "text": "Excellent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2716.954,
    "end": 2728.694,
    "text": "Let's now, it's not a jump, because I think the wonderful thing about your work is that although it seems diverse, they all sort of trickle down into these fundamental questions of agency and selfhood.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2730.056,
    "end": 2731.558,
    "text": "I want to talk about schizophrenia.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2732.28,
    "end": 2733.161,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2734.363,
    "end": 2736.687,
    "text": "And maybe we can start with the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2736.937,
    "end": 2739.221,
    "text": " very interesting symptom, which is delusions of control.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2739.241,
    "end": 2739.922,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2739.942,
    "end": 2743.929,
    "text": "So you spoke, you wrote very extensively on delusions of control.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2743.969,
    "end": 2752.664,
    "text": "So, again, people who are not schizophrenic or don't have a psychological or psychiatric background might not know what I mean by delusions of control.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2752.684,
    "end": 2756.731,
    "text": "So it might be worthwhile starting there, just outlining what that phrase means.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2758.033,
    "end": 2762.32,
    "text": "So this is where the patient says, it is not me,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2763.228,
    "end": 2768.514,
    "text": " causing these actions, there's some external agent making me do these things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2770.477,
    "end": 2780.369,
    "text": "And they could be quite trivial things like combing my hair, or they could be more dangerous things like attacking people or something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2780.509,
    "end": 2788.999,
    "text": "And this is interesting because there's a delusion",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2790.211,
    "end": 2792.614,
    "text": " typically is considered to be a belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2792.834,
    "end": 2801.005,
    "text": "So you can say that they believe that external agents are causing their actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2802.787,
    "end": 2819.188,
    "text": "But it seems more likely, and the early psychiatrists had more or less stated this, is it's not so much that I believe that external agents are causing my actions, it's I feel as if external agents are causing my actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2819.759,
    "end": 2826.385,
    "text": " It's not just a belief in the sort of philosophical senses, something stronger than that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2827.046,
    "end": 2827.927,
    "text": "Well, that's interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2828.007,
    "end": 2830.149,
    "text": "So it goes beyond the propositional in some sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2830.589,
    "end": 2841.78,
    "text": "And there is part of a whole slew of symptoms called passivity phenomena, whereby you can say it's not my emotion, it's being implanted in me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2841.86,
    "end": 2845.743,
    "text": "And the most perplexing one of all, they're not my thoughts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2846.844,
    "end": 2848.686,
    "text": "Yes, I wanted to get to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2849.003,
    "end": 2853.812,
    "text": " That is very weird.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2854.533,
    "end": 2866.354,
    "text": "It might be worth, um, distinguishing the, uh, delusions of control from something like an alien hand syndrome, just so people don't be aware of this notion of a wandering hand.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2867.313,
    "end": 2872.219,
    "text": " So the alien hand syndrome is typically caused by a brain lesion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2872.98,
    "end": 2875.443,
    "text": "And that's where the hand starts moving by itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2875.923,
    "end": 2879.047,
    "text": "And the patient says, I'm not controlling it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2879.187,
    "end": 2880.669,
    "text": "Oh, I don't have control over it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2880.749,
    "end": 2882.891,
    "text": "It's doing these things that I don't want it to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2883.732,
    "end": 2889.179,
    "text": "But typically the patient doesn't really say there's some alien force making it do these things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2890.08,
    "end": 2891.201,
    "text": "And they try to stop it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2891.341,
    "end": 2895.166,
    "text": "I mean, the classic, it's a strange love in the film.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2896.527,
    "end": 2897.168,
    "text": "If you do,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2898.228,
    "end": 2899.75,
    "text": " I actually haven't seen it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2899.77,
    "end": 2900.03,
    "text": "I know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2900.43,
    "end": 2900.731,
    "text": "I know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2900.751,
    "end": 2902.112,
    "text": "I'm going to get shout to that in the comments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2902.793,
    "end": 2911.521,
    "text": "Um, Peter is playing amongst many other characters as Dr. Strangelove, who's an ex-Nazi scientific advisor in a wheelchair.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2911.541,
    "end": 2912.703,
    "text": "And he keeps making these.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2915.325,
    "end": 2919.87,
    "text": "Well, it seems to have some strange overlap, perhaps with Tourette's.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2920.691,
    "end": 2925.155,
    "text": "Um, I'm working on, again, don't come at me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2925.275,
    "end": 2927.998,
    "text": "I'm not saying they're the same, but it seems like that, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2928.94,
    "end": 2941.998,
    "text": " I've come up with this term called oppositional self-modeling, which is that at one level of some prior, at one lower level of generative hierarchy, you have a habitual action policy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2942.519,
    "end": 2943.58,
    "text": "So you'll just do it, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2943.6,
    "end": 2953.915,
    "text": "So there's got to be some part of your motor loop where you will move your hand or you will do a tick, but then you have a higher conceptual level where you really don't want to do it because you want the type of agent that does ticks or does move your hand randomly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2953.935,
    "end": 2957.58,
    "text": "So that's what I mean by the overlap there with Tourette's.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2957.813,
    "end": 2968.464,
    "text": " There's also utilization behavior after frontal lesions where people make these habitual responses in situations where they shouldn't, they can no longer inhibit them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2969.866,
    "end": 2970.406,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2970.426,
    "end": 2970.887,
    "text": "Interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2970.947,
    "end": 2971.147,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2971.828,
    "end": 2985.082,
    "text": "So in terms of delusions of control, perhaps you could explain to people where the model that you proposed for where this might come from, at least some of the versions of it in terms of the inverse modeling and forward modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2985.442,
    "end": 2985.542,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2986.248,
    "end": 3000.251,
    "text": " Well, I guess it goes back to Helmholtz who noted that when we move our eyes, obviously the image on the retina jumps about, but we don't perceive it jumping about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3001.033,
    "end": 3012.492,
    "text": "And the idea is that we use what's so-called corollary discharge so that when you send the message to move your eye, you also send the message to the visual system saying,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3013.028,
    "end": 3017.215,
    "text": " there's going to be movement now, but it's not caused by something happening in the outside world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3017.255,
    "end": 3018.677,
    "text": "It's due to my own eye movement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3019.739,
    "end": 3022.163,
    "text": "And that applies to all sorts of movements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3023.445,
    "end": 3029.815,
    "text": "And more recently, particularly associated with Daniel Wolpert, you have this idea of inverse and forward models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3029.875,
    "end": 3035.965,
    "text": "So it says, when I move my arm, I actually have a forward model that tells me what, what,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3037.21,
    "end": 3043.588,
    "text": " where my arm is going to be when the movement is finished and what sort of sensations are going to be accompanying the movement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3044.21,
    "end": 3046.717,
    "text": "And because I can predict them, I can discount them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3046.737,
    "end": 3048.663,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3048.723,
    "end": 3049.746,
    "text": "So sensory attenuation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3050.307,
    "end": 3051.09,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3051.11,
    "end": 3051.912,
    "text": "And, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3053.225,
    "end": 3056.389,
    "text": " This is the difference between a passive movement and an active movement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3056.449,
    "end": 3064.5,
    "text": "So in a passive movement, when somebody else moves my arm, I feel all these sensations because there's no discounting and that's why you can't tickle yourself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3065.161,
    "end": 3065.361,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3065.742,
    "end": 3071.81,
    "text": "And the idea was that in schizophrenia, perhaps something went wrong with this system of control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3072.471,
    "end": 3077.037,
    "text": "So it literally was the case that when they moved their arm, it felt as if somebody else was moving it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3078.799,
    "end": 3079.941,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3080.258,
    "end": 3085.123,
    "text": " Yeah, and we showed, Sarah Jane Blatmore showed that they could tickle themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3086.264,
    "end": 3086.685,
    "text": "Oh, really?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3086.985,
    "end": 3088.227,
    "text": "I didn't actually see, I didn't see that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3088.487,
    "end": 3089.348,
    "text": "I'm aware of her work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3089.368,
    "end": 3092.511,
    "text": "I know you've got, you three all did wonderful work in this, in this domain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3093.232,
    "end": 3096.716,
    "text": "Maybe it's worth, um, unpicking exactly what that looks like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3096.816,
    "end": 3097.497,
    "text": "Technically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3097.717,
    "end": 3105.886,
    "text": "It's a shame that I can't get up all of the nice diagrams because there are some really nice diagrams, but it might be worth, um, talking about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3106.707,
    "end": 3108.088,
    "text": "So people might think, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3108.322,
    "end": 3111.907,
    "text": " Okay, I want to move my hand to grip this mug.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3112.308,
    "end": 3112.508,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3113.189,
    "end": 3117.176,
    "text": "This I love Dante mug, oddly enough, because I'm a bit of a Dante acolyte.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3118.337,
    "end": 3118.978,
    "text": "That's beside the point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3119.299,
    "end": 3127.732,
    "text": "And I can just, I just know what motor action to employ and I just do it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3128.112,
    "end": 3129.474,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3129.494,
    "end": 3132.9,
    "text": "I think you term that, I think that might be termed the inverse problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3134.342,
    "end": 3136.405,
    "text": "Why is that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3136.773,
    "end": 3145.284,
    "text": " Why is that sort of folk psychology notion not possible for cognitive creatures like us?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3147.427,
    "end": 3158.781,
    "text": "As far as I understand it, the inverse problem is that whenever you have a goal of your action, which is to reach that mug in the appropriate way,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3159.183,
    "end": 3163.528,
    "text": " but there are an infinite number of different ways in which the movement could proceed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3163.628,
    "end": 3166.732,
    "text": "And the question is, how do you decide which one to use?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3166.752,
    "end": 3174.44,
    "text": "And there are various arguments like, do you minimize the energy requirement or the distance?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3175.221,
    "end": 3185.012,
    "text": "Or I think, um, Daniel Walpert, I don't know whether he still thinks this thinks what you minimize is the end point error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3186.494,
    "end": 3186.574,
    "text": "Hmm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3187.364,
    "end": 3196.241,
    "text": " And they're always, so that's the sort of argument about, and also there are always different muscles you can use and it's all very complicated and luckily we don't have to think about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3196.301,
    "end": 3196.963,
    "text": "We just do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3197.944,
    "end": 3198.045,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3198.065,
    "end": 3205.499,
    "text": "But underlying, there is something underlying all that and certain kinds of lesions you can becomes extremely difficult to grasp things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3206.721,
    "end": 3207.503,
    "text": "Interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3207.523,
    "end": 3210.148,
    "text": "So, so, so there are,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3210.517,
    "end": 3219.427,
    "text": " potentially infinite ways of choosing a suite of motor movements to achieve a goal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3219.828,
    "end": 3225.554,
    "text": "So it's computationally intractable to find a unique sequence or a singular sequence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3226.515,
    "end": 3231.501,
    "text": "However, we can predict the outcome of good sequences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3231.521,
    "end": 3232.542,
    "text": "Now, that's a different point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3233.223,
    "end": 3237.047,
    "text": "Yes, that is the critical idea with the inverse model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3238.006,
    "end": 3242.493,
    "text": " is intractable to work out what's the best thing to do with a forward model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3242.593,
    "end": 3249.804,
    "text": "Once you have given a set of instructions, you can predict precisely where you're going to finish up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3249.824,
    "end": 3251.828,
    "text": "Okay, excellent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3252.108,
    "end": 3264.267,
    "text": "So we've got the inverse problem, the forward model now, and if we then fold in what's going to be another kind of inverse type, which is the efference copy, what's the role of the efference copy here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3265.293,
    "end": 3273.08,
    "text": " as far as I understand it, the inference copy is just a way of saying we can predict what sensations are going to arise from this movement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3275.843,
    "end": 3286.092,
    "text": "And that's the thing that enables you to stop the image currently moving about because you're, you know what the movement is going to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3286.552,
    "end": 3292.838,
    "text": "And if the outcome is the real outcome matches the predicted outcome and everything is fine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3292.878,
    "end": 3293.899,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3294.638,
    "end": 3298.983,
    "text": " But if it, in the case of schizophrenia, the prediction is wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3299.964,
    "end": 3301.546,
    "text": "So it doesn't match the outcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3302.206,
    "end": 3306.071,
    "text": "So we explain this prediction error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3307.552,
    "end": 3312.778,
    "text": "And one way of explaining the prediction error is saying somebody moved my arm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3314.48,
    "end": 3314.881,
    "text": "I see.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3314.921,
    "end": 3323.43,
    "text": "And this, and does this require us in some ways to go to fourth insertion to say that action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3323.917,
    "end": 3345.435,
    "text": " in some ways many people believe that thought is thinking is an activity this goes right back to luria i think in russian psychology um but this philosophically becomes very complicated because you can say um you have to say i intended to have a thought",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3347.069,
    "end": 3350.933,
    "text": " Yes, and that's definitely, the Buddhists might have a problem with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3352.054,
    "end": 3359.001,
    "text": "If you're thinking about a problem, you would have some idea of what sort of outcome you want to have as you work your way through this problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3360.082,
    "end": 3369.591,
    "text": "And so there is room there for, you know, metacognitive approach to thinking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3369.651,
    "end": 3374.916,
    "text": "So you could certainly say this, I have not succeeded in my thinking task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3375.183,
    "end": 3400.566,
    "text": " yes exactly say i think i have a good even when you begin you can say i have a good chance of achieving this thinking task and i guess one might relate that to tip of the tongue phenomena where you say i can't remember at this moment but i'm pretty sure if i try a bit harder i should get there so these would be examples of putting thinking into a sort of active framework",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3401.153,
    "end": 3406.759,
    "text": " Yes, there are some very nice metacognitive models, actually, or meta awareness models with an active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3406.779,
    "end": 3411.244,
    "text": "So there's one by Lars Sandberg Smith 2021, which is very beautiful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3411.524,
    "end": 3416.77,
    "text": "And these really rich base graphs with these hierarchical layers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3418.732,
    "end": 3427.482,
    "text": "How so I believe there are, I believe there's good evidence that people with schizophrenia do not have major problems in motor control.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3429.183,
    "end": 3430.464,
    "text": " How is this accounted for?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3430.784,
    "end": 3431.045,
    "text": "Oh, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3431.085,
    "end": 3432.105,
    "text": "Well, that's exactly right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3432.126,
    "end": 3433.867,
    "text": "There's always a proper schizophrenic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3434.187,
    "end": 3440.373,
    "text": "Whenever you come up with a serious schizophrenia, they should be much worse than they actually are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3440.393,
    "end": 3440.553,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3441.213,
    "end": 3441.534,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3442.614,
    "end": 3458.548,
    "text": "But the, um, they do have, they have eye movement abnormalities sort of smooth pursuit and things like that, which would be consistent with failing to predict properly the consequences of eye movements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3459.22,
    "end": 3462.063,
    "text": " I can't, there's a, there was a nice experience from Germany.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3462.103,
    "end": 3464.126,
    "text": "You can do strain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3464.186,
    "end": 3465.127,
    "text": "How is this work?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3465.167,
    "end": 3469.933,
    "text": "You can do experiments where you have to track a moving target.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3471.335,
    "end": 3480.666,
    "text": "And this means that you, your expression is that the target stays in the middle of your field of view and the background moves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3483.069,
    "end": 3486.493,
    "text": "No, it's the target that's moving in the background is stationary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3487.064,
    "end": 3495.855,
    "text": " And you can, so you obviously have to correct for the sort of the moving background as it were.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3495.875,
    "end": 3502.904,
    "text": "And you can measure how much, how successfully people make these corrections and schizophrenia patients are less good at doing that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3502.944,
    "end": 3507.61,
    "text": "So there are some subtle effects that you can see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3507.65,
    "end": 3508.812,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3509.172,
    "end": 3509.733,
    "text": "Interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3509.753,
    "end": 3510.574,
    "text": "Does this,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3510.706,
    "end": 3516.374,
    "text": " actually, I've got one more question before we go to delusions and hallucinations, because I sense those are slightly different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3516.974,
    "end": 3519.498,
    "text": "I mean, this is in some sense a delusional belief.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3521.901,
    "end": 3523.063,
    "text": "So there's some interesting stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3523.243,
    "end": 3531.113,
    "text": "There's some very, there's some very adjacent or actually overlapping work in active inference about agency.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3531.854,
    "end": 3539.505,
    "text": "And it's very much a offshoot of the comparator models and what we've been talking about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3540.166,
    "end": 3540.426,
    "text": "So",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3540.811,
    "end": 3544.795,
    "text": " And a lot of this is actually now being focused on depersonalization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3545.415,
    "end": 3545.495,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3546.056,
    "end": 3549.239,
    "text": "So the idea I really like comes from George Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3549.279,
    "end": 3551.781,
    "text": "He's got this idea of an allostatic control model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3552.422,
    "end": 3570.379,
    "text": "And what that means is that if I can predict the sensory outcomes of my actions, very similar to what you were saying, and I get a sort of non-prediction error, I get the results that I expect, I can start to develop the inference that there is an agent in my generative model that does these things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3570.73,
    "end": 3571.551,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3571.571,
    "end": 3579.602,
    "text": "And what happens is let's say, let's say now that that's an inference and I need to keep providing evidence for that inference to keep it high precision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3579.743,
    "end": 3583.588,
    "text": "Let's say now let's say I'm in a torture chamber.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3583.888,
    "end": 3584.67,
    "text": "This is an example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3585.11,
    "end": 3591.399,
    "text": "Uh, torture is a very reliable, uh, producer of symptoms of depersonalization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3592.44,
    "end": 3592.601,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3592.621,
    "end": 3593.582,
    "text": "I'm now getting tortured.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3593.933,
    "end": 3604.838,
    "text": " I have a prior that I am the type of agent that should be able to do things to confirm evidence for my own model of the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3604.987,
    "end": 3614.216,
    "text": " in the torture situation, I might have a desired action, but I'm not able to actually do it and therefore provide sensory evidence for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3615.017,
    "end": 3623.126,
    "text": "And so what you start seeing here is the disentangling of that very inference that there is some, some agent, uh, at the heart of my generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3623.926,
    "end": 3626.329,
    "text": "Does that, how does that sound to you?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3626.369,
    "end": 3629.833,
    "text": "Does it sound very much aligned with the way you think about agency?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3631.875,
    "end": 3632.595,
    "text": "Yes, I know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3632.615,
    "end": 3633.757,
    "text": "I think that's very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3633.957,
    "end": 3634.217,
    "text": "Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3636.323,
    "end": 3640.729,
    "text": " I mean, I've been very interested in the feeling of being in control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3640.749,
    "end": 3644.774,
    "text": "And there are experiments on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3645.335,
    "end": 3655.568,
    "text": "And I guess the torture situation is where you're totally not in control, which we luckily don't normally experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3656.95,
    "end": 3658.051,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3659.654,
    "end": 3660.455,
    "text": "I'm just trying to think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3660.475,
    "end": 3663.799,
    "text": "Yes, I love this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3664.167,
    "end": 3664.808,
    "text": " Go on, please.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3664.848,
    "end": 3676.082,
    "text": "I mean, it's a very Bayesian story that the feeling in control of being in control depends not only on the intention to do something, but also on the outcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3677.644,
    "end": 3678.305,
    "text": "Yes, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3678.345,
    "end": 3679.066,
    "text": "Exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3679.386,
    "end": 3679.707,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3679.727,
    "end": 3679.907,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3679.967,
    "end": 3684.192,
    "text": "I I've been writing with car and others on so-called flow states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3684.513,
    "end": 3685.554,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3685.574,
    "end": 3691.221,
    "text": "Uh, flow states, uh, surfing, rock climbing, playing musical instrument in there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3691.758,
    "end": 3698.247,
    "text": " Although you don't have this rich sense of self, this epistemic agent model, this propositional agent, you do feel in control.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3698.267,
    "end": 3707.279,
    "text": "And that is exactly as you say, because you have this alignment between the predicted consequences of your action and the actual sensory outcomes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3707.299,
    "end": 3710.543,
    "text": "And there's very tight motor loops.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3711.164,
    "end": 3715.533,
    "text": " And I think it's worth folding in this notion of interoceptive inference as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3715.593,
    "end": 3719.34,
    "text": "So this is people like Anil Seth and Lisa Feldman Barrett.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3719.982,
    "end": 3725.713,
    "text": "This notion that at the very core, what Thomas Metzinger would call your minimal phenomenal self,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3726.773,
    "end": 3736.545,
    "text": " They've argued that this is rooted in successful interoceptive inference, either through autonomic reflex or eating, some actual volitional action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3737.046,
    "end": 3745.236,
    "text": "And I guess something else there is that torture would also deny the possibility for successful interoceptive inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3745.577,
    "end": 3755.97,
    "text": "If I'm not getting fed, I am weakening, I am unable, that prior that I need to have a certain level of glucose is not going anywhere.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3756.929,
    "end": 3764.684,
    "text": " So I think what happens there is that the agentic model itself dissolves rather than the homeostatic requirements.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3765.465,
    "end": 3769.333,
    "text": "So there's some really beautiful work being done here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3769.994,
    "end": 3770.395,
    "text": "Excellent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3771.677,
    "end": 3777.148,
    "text": "Before we go on to delusions and hallucinations, I wanted to ask...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3777.567,
    "end": 3779.974,
    "text": " So my sort of forays into psychiatry are limited.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3781.017,
    "end": 3783.604,
    "text": "I'm more adept at cognitive science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3783.925,
    "end": 3786.533,
    "text": "But I did read over the summer R.D.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3786.593,
    "end": 3788.438,
    "text": "Lange's The Divided Self.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3789.413,
    "end": 3801.003,
    "text": " I was curious, he's famous for sort of instituting a more, I would say, empathetic and understanding approach to psychiatry, that these people are not just crazy, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3801.023,
    "end": 3809.049,
    "text": "But they are what we would now say are actually base optimal, just confirming priors that don't really correspond to what we would see as adaptive behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3810.07,
    "end": 3819.218,
    "text": "I was just curious about what your opinions are of whether you have any of Adi Lange and what he puts forward in The Divided Self.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3820.666,
    "end": 3828.475,
    "text": " I had no, I didn't have a very high opinion of RD Lang, but then this is mostly due to interacting with other psychiatrists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3828.495,
    "end": 3839.387,
    "text": "Um, and I, I don't think I might've read the divide itself, but I don't think I did the idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3839.407,
    "end": 3845.053,
    "text": "I mean, put it into that Bayesian story is quite interesting because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3845.827,
    "end": 3847.129,
    "text": " That seems a very good idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3847.149,
    "end": 3849.833,
    "text": "That is to say they have the wrong prize, but they're behaving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3849.973,
    "end": 3857.704,
    "text": "I mean, certainly all the stuff on delusions is the suggests that the original idea was that they're irrational.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3858.825,
    "end": 3859.727,
    "text": "Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3859.747,
    "end": 3861.469,
    "text": "Whatever that means, whatever that means.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3861.689,
    "end": 3873.266,
    "text": "And that in other words, they are not arguing, you know, they're not appropriately arguing from the evidence and, um, all the experiments that ever been done show they're extremely rational.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3873.306,
    "end": 3875.749,
    "text": "They're probably more rational than other people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3876.269,
    "end": 3879.155,
    "text": " And as you say, it's just that they start with the wrong priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3880.677,
    "end": 3891.759,
    "text": "Yes, there's something in Bayesian modeling called the complete class for a theorem, which is that any, any action perception can be cast as Bayes optimal, just given a certain set of priors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3892.861,
    "end": 3897.67,
    "text": "It's slightly worrying, you know, slightly worrying, but it counts for things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3898.004,
    "end": 3903.472,
    "text": " it comes for all I mean, basically all phenomena, because if you speak to call, but actually wouldn't go that far.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3903.492,
    "end": 3906.436,
    "text": "But you could cast it all as this kind of variational Bayesian inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3906.456,
    "end": 3909.06,
    "text": "So it's always optimal, and everything is based on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3910.682,
    "end": 3927.606,
    "text": "But I guess the the flip side of that the positive side of that is that maybe it does license a more humanistic approach to psychiatric patients, insofar as there's this interesting argument, I don't know if it's an argument is an interesting point, which is that maybe something like this going slightly away from",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3928.058,
    "end": 3929.399,
    "text": " schizophrenia, but it's relevant.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3929.92,
    "end": 3938.909,
    "text": "Something like PTSD, or OCD, or general anxiety disorder, actually is, could be quite adaptive in a certain ecological niche.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3939.55,
    "end": 3939.77,
    "text": "Absolutely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3939.79,
    "end": 3955.205,
    "text": "If I'm in a war zone, being, you know, having hyper salience, and being really, you know, having very high precision over the likelihood of some sensory input and downweighting priors, like, you know, arguably in PTSD is actually really useful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3956.967,
    "end": 3958.048,
    "text": "It's just not adaptive in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3958.366,
    "end": 3986.162,
    "text": " modern you know calm london on leafy regents park so how do you think in your experience in psychiatry this work has altered the way that we view psychiatric patients yes i think it has um i mean in psychiatry in reality of course it's very difficult because there aren't enough of them and there's no money and they can't find any drugs at work but i mean that's the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3987.155,
    "end": 3988.757,
    "text": " how that really operates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3989.278,
    "end": 3996.107,
    "text": "But going back to the slightly earlier question, people like, gosh, I can't remember his name.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3998.571,
    "end": 4010.547,
    "text": "There is the idea that the symptoms of schizophrenia are not understandable, which is another, they have nothing to do with reality or our lives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4010.647,
    "end": 4011.829,
    "text": "And I guess one of my,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4012.484,
    "end": 4017.275,
    "text": " aims in the sort of story of delusion is control is to say they are understandable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4018.558,
    "end": 4022.226,
    "text": "It literally does feel as if somebody was moving my arm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4023.99,
    "end": 4030.584,
    "text": "And, and how much would you say this has come from your, would you say Schneider?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4030.624,
    "end": 4031.647,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4032.148,
    "end": 4032.248,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4033.274,
    "end": 4045.392,
    "text": " Do you sense that this, um, empathy that you have in the, in the very literal sense of empathy that you can, that it's understandable comes from direct work directly working with these people.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4047.134,
    "end": 4047.896,
    "text": "Oh, to some extent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4047.956,
    "end": 4048.196,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4048.296,
    "end": 4057.41,
    "text": "I mean, when I was with the medical research council, my lab so-called was in the middle of the acute psychiatric ward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4059.513,
    "end": 4061.796,
    "text": "So I was interacting with them every day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4063.447,
    "end": 4066.43,
    "text": " And it was quite good because they were actually very bored.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4066.49,
    "end": 4070.494,
    "text": "So they would come and knock on the door and say, have you got another experiment for me to do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4073.117,
    "end": 4073.397,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4073.637,
    "end": 4079.043,
    "text": "I think, I think, uh, that's where Cole started was in psychiatric rotations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4079.383,
    "end": 4079.563,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4079.903,
    "end": 4080.064,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4080.604,
    "end": 4082.506,
    "text": "Well, how did you guys first meet?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4082.546,
    "end": 4083.987,
    "text": "If I may ask, was it at UCL?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4084.988,
    "end": 4092.576,
    "text": "No, we met at the, um, the cyclotron units at the hospital where we had, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4093.45,
    "end": 4105.882,
    "text": " there was a project, I think, run by Peter Little to basically start scanning patients with schizophrenia to test various theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4106.803,
    "end": 4114.871,
    "text": "And if I remember rightly, Carl was appointed because he had the psychiatric background to work on this project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4115.472,
    "end": 4120.977,
    "text": "And that was in the very early days before we knew how to analyze brain imaging data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4121.395,
    "end": 4121.715,
    "text": " Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4121.996,
    "end": 4125.601,
    "text": "So he was given the task of analyzing the brain imaging data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4126.803,
    "end": 4130.208,
    "text": "And the rest is history, as they say, quite quite.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4130.268,
    "end": 4130.989,
    "text": "What was it like?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4132.411,
    "end": 4140.262,
    "text": "What was your your most cited paper on ever is the statistical parametric mapping?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4140.643,
    "end": 4141.584,
    "text": "Yeah, what you did?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4142.225,
    "end": 4143.767,
    "text": "Again, we're going a little bit off pace.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4143.787,
    "end": 4145.129,
    "text": "But this is the beauty of this podcast.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4145.149,
    "end": 4146.571,
    "text": "Like, you know, we can go wherever we want.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4147.032,
    "end": 4147.653,
    "text": "What was it like?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4147.893,
    "end": 4150.277,
    "text": "Be again, I don't know how SPM works.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4150.357,
    "end": 4151.098,
    "text": "I don't know how",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4151.348,
    "end": 4158.297,
    "text": " I'm not a brain scanner, so maybe one day, um, or voxel based morphometry or any of these things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4158.958,
    "end": 4160.7,
    "text": "But I'm just curious about what it was like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4162.002,
    "end": 4164.845,
    "text": "No, it was very exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4165.586,
    "end": 4177.442,
    "text": "And I think what was wonderful about Carl is that, I mean, there's lots of other people doing imaging for the first time and they were tending to invent new ways of analyzing the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4178.223,
    "end": 4178.503,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4178.821,
    "end": 4184.228,
    "text": " Whereas Carl very sensibly said, but there are all these statistical paradigms already there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4185.049,
    "end": 4185.27,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4185.45,
    "end": 4186.872,
    "text": "These are what we should be using.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4186.912,
    "end": 4189.155,
    "text": "And that's.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4189.175,
    "end": 4189.415,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4190.056,
    "end": 4194.382,
    "text": "I've always kind of wondered how Carl knew about them in the first place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4195.723,
    "end": 4204.575,
    "text": "Um, but I, I sense that your work on, uh, forward modeling, um, sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4204.595,
    "end": 4206.077,
    "text": "I, I, you know, I was reading.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4206.462,
    "end": 4232.402,
    "text": " had the joy of going not obviously through the entire catalog of your works because that would take me until next year but going for a couple of them again and some of them are sort of canonicals i've read them before um and it's what struck me almost like reading thomas metzinger i've said this before about thomas metzinger how incredibly full like in retrospect it just seems like you're speaking the same language as we're saying what we're saying now in active inference",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4233.26,
    "end": 4237.386,
    "text": " landscapes quite but nearly quite but well, there's a lot of overlap.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4237.546,
    "end": 4238.868,
    "text": "And it's incredibly influential.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4238.888,
    "end": 4246.538,
    "text": "And I would say that for you and Sarah Jane and someone like Thomas Metzinger, it's really remarkable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4247.539,
    "end": 4256.632,
    "text": "How you know how much was how much how in conversation were you with Carl when he was beginning to develop the free energy?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4256.772,
    "end": 4258.594,
    "text": "No, all the time we share an office.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4259.616,
    "end": 4259.976,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4260.783,
    "end": 4263.366,
    "text": " I have lots of passive smoking experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4266.451,
    "end": 4268.173,
    "text": "Yeah, he does like a cigarette.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4269.375,
    "end": 4269.855,
    "text": "Fair enough.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4269.875,
    "end": 4271.457,
    "text": "I think he's I think he's warranted one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4271.918,
    "end": 4276.204,
    "text": "And have you given much thought I guess we are on the active inference podcast.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4276.224,
    "end": 4277.586,
    "text": "So I ought to ask something more specific.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4278.907,
    "end": 4283.313,
    "text": "I know we spoke before an email and you said, you know, this is not directly your line of work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4283.754,
    "end": 4285.356,
    "text": "But you were around for when",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4285.657,
    "end": 4287.199,
    "text": " The 2010 paper was released.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4287.219,
    "end": 4288.821,
    "text": "The 2009 paper was released.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4289.802,
    "end": 4294.227,
    "text": "I think 2005 might be the sort of beginnings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4295.648,
    "end": 4300.173,
    "text": "What were your kind of experiences around then and how did you contribute?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4301.515,
    "end": 4302.316,
    "text": "Well, I'm not quite sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4302.336,
    "end": 4306.04,
    "text": "Yes, Carl has this habit of putting my name on papers from time to time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4306.901,
    "end": 4314.229,
    "text": "And I guess I contribute to some extent by saying we need more independent references or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4314.597,
    "end": 4316.84,
    "text": " sometimes change the wording a bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4317.802,
    "end": 4335.469,
    "text": "And what I was particularly interested in, I was very keen, and it really goes right back to Richard Gregory and people like that, the approach to perception and the idea that we, if there's a prediction error, we have to update our model of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4336.07,
    "end": 4341.178,
    "text": "And I thought that was very exciting and wrote about that in my previous book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4341.884,
    "end": 4347.054,
    "text": " And so I was particularly excited with active inference, because that gave you the other side of the picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4347.515,
    "end": 4353.025,
    "text": "And when we get a prediction error, we don't have to update our model of the world, we can change the world instead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4353.686,
    "end": 4354.488,
    "text": "Isn't that amazing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4355.41,
    "end": 4356.431,
    "text": "That was wonderful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4357.073,
    "end": 4358.034,
    "text": "I know it is wonderful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4358.075,
    "end": 4358.836,
    "text": "What were your thoughts?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4358.856,
    "end": 4363.845,
    "text": "So this is kind of what if anyone's familiar, this is what we would call the low road to active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4364.146,
    "end": 4365.208,
    "text": "Yeah, this is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4365.391,
    "end": 4372.624,
    "text": " Predictive coding, Helmholtzian perception and the like, and action as inference, I guess you could say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4373.326,
    "end": 4373.426,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4373.446,
    "end": 4375.93,
    "text": "Have you given any thought to the so-called high road?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4376.231,
    "end": 4381.02,
    "text": "And by that, I mean, dynamical stochastic systems and no.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4381.04,
    "end": 4382.583,
    "text": "That's too difficult for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4383.564,
    "end": 4384.566,
    "text": "I'm trying to learn the maths.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4385.308,
    "end": 4385.528,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4385.728,
    "end": 4386.249,
    "text": "You're not wrong.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4386.49,
    "end": 4387.011,
    "text": "You're not wrong.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4387.512,
    "end": 4388.293,
    "text": "It is rather tricky.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4388.695,
    "end": 4390.036,
    "text": " Excellent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4390.096,
    "end": 4393.039,
    "text": "Okay, so I said we will talk about hallucinations and delusions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4393.86,
    "end": 4402.048,
    "text": "I think delusions we've somewhat touched upon, which is kind of this fixity of priors that is not allowing for updating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4402.568,
    "end": 4412.818,
    "text": "But I read, you know, Kapoor's work on sort of the dope aberrant salience model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4413.819,
    "end": 4417.723,
    "text": "I never thought that any of this stuff really accounted for hallucinations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4419.121,
    "end": 4439.813,
    "text": " where to the best of your knowledge do you think hallucinations might come from well i i'm with paul fetcher we wrote a paper which we're basically saying there's no fundamental difference between hallucinations and delusions okay if you take a bayesian approach yes yes because the hallucinations are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4441.328,
    "end": 4448.159,
    "text": " It's just about perception rather than beliefs, but in both cases, it's all about whether you update and where the evidence comes from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4448.78,
    "end": 4459.017,
    "text": "But the thing you have to remember about schizophrenia is these hallucinations are predominantly auditory and they're predominantly hearing voices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4460.659,
    "end": 4464.906,
    "text": "And one symptom is so-called thought broadcast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4465.948,
    "end": 4468.652,
    "text": "I hear my thoughts as if they're being spoken aloud.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4469.797,
    "end": 4482.894,
    "text": " And you can even have a sort of very similar story with the forward model and there's work on this so that when you speak, you hear your own voice, but you suppress it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4484.336,
    "end": 4494.69,
    "text": "And there's some evidence that when patients speak that again, the suppression system seems to go wrong in relation to speaking as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4495.615,
    "end": 4497.7,
    "text": " And you have inner speech and all these sorts of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4497.76,
    "end": 4507.782,
    "text": "So one idea is that they're perceiving their own inner speech as if it was from an external source, which is not that far away from a delusion of control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4509.847,
    "end": 4510.087,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4511.35,
    "end": 4514.417,
    "text": "I sometimes think how",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4515.612,
    "end": 4526.987,
    "text": " true is that if one meditates, for example, if one is doing Vipassana, it does seem like those thoughts are coming from not from you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4527.027,
    "end": 4532.714,
    "text": "So this might be looping back into our sort of humanistic approach to psychiatric disorders.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4532.854,
    "end": 4534.757,
    "text": "So don't tell that to your psychiatrist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4534.997,
    "end": 4536.059,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4536.079,
    "end": 4538.181,
    "text": "Yes, yeah, yeah, I won't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4538.622,
    "end": 4539.443,
    "text": "It's true.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4539.912,
    "end": 4550.442,
    "text": " There's these very odd overlaps between Buddhism and psychiatry and ego death and all of these kinds of things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4551.644,
    "end": 4558.09,
    "text": "Do you think that this notion that self-talk, let's say, let's stick with that because it's very interesting, is self-talk?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4560.292,
    "end": 4565.177,
    "text": "From a very raw Buddhist perspective, that doesn't get off the ground because there is no self.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4566.237,
    "end": 4568.24,
    "text": " These thoughts are just popping into awareness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4569.261,
    "end": 4571.324,
    "text": "And it's all process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4571.825,
    "end": 4573.046,
    "text": "It's process ontology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4573.567,
    "end": 4574.789,
    "text": "There's no substance there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4574.849,
    "end": 4576.271,
    "text": "It's coming and going.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4576.311,
    "end": 4578.974,
    "text": "It's just the field of awareness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4578.994,
    "end": 4585.984,
    "text": "So is it just an adaptive tool for us to presume or have this illusion that it's self generated?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4590.807,
    "end": 4601.939,
    "text": " I guess that depends what you mean by self generated generated, but it's self talk mean then that maybe that's because it's yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4601.979,
    "end": 4609.867,
    "text": "I mean, clearly it's not, I'm not intention intentionally saying these things per se, but I'm perceiving them as belonging to me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4610.227,
    "end": 4610.448,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4611.349,
    "end": 4613.631,
    "text": "So they're not coming from outside.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4613.651,
    "end": 4614.592,
    "text": "Yeah, sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4615.012,
    "end": 4619.817,
    "text": "But what's in this, in this way, we have to kind of ask, well, what is inside and outside?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4620.178,
    "end": 4620.358,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4620.98,
    "end": 4624.745,
    "text": " So, so, well, that's, I mean, that's a common one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4624.885,
    "end": 4633.737,
    "text": "I mean, one quite dominant theory of schizophrenia, they'd lost the boundary between outside.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4634.318,
    "end": 4635.219,
    "text": "That's really interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4635.6,
    "end": 4636.942,
    "text": "They've lost their Markov blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4637.542,
    "end": 4638.003,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4638.043,
    "end": 4638.584,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4639.525,
    "end": 4639.785,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4640.066,
    "end": 4643.29,
    "text": "But I guess, I guess the reality is you never lose a Markov blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4643.31,
    "end": 4649.839,
    "text": "I mean, this, this, to be honest, it points to quite, it points to theoretical difficulties in active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4650.292,
    "end": 4655.979,
    "text": " which is something that's been brought up in this podcast before and in other works, which is where do you even cast the Markov blanket?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4656.3,
    "end": 4658.723,
    "text": "And what is it to say that you have internal states and external states?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4659.304,
    "end": 4668.536,
    "text": "Really what those actually mean, and I give credit to Maxwell Ramstein for pointing this out to me, is that internal you can just say are tracking and external are tracked.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4670.098,
    "end": 4677.948,
    "text": "But that said, you have someone like Andy Clark who might say, well, in my tracking mechanism, I might have my telephone or my notepad.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4677.968,
    "end": 4679.37,
    "text": "And then you have Jacob Howie who says, no, no, no.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4679.671,
    "end": 4683.196,
    "text": " The evidential boundary is the mind, and even the body is being predicted.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4684.758,
    "end": 4695.212,
    "text": "Does any of those dichotomies or debates inform something like what we've been talking about, self-talk and delusions of control?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4698.557,
    "end": 4702.362,
    "text": "Well, self-talk, inner speech, people used to call it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4703.103,
    "end": 4703.284,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4704.485,
    "end": 4706.488,
    "text": "And that is great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4707.38,
    "end": 4729.04,
    "text": " And again, the Russian psychologist, I mean, Vygotsky, I think, and there's some evidence for this, that young children, particularly doing difficult tasks, what one might call frontal tasks, you actually talk aloud, I must now do this and I must now do this, and this becomes internalised, so you're doing that internally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4729.06,
    "end": 4734.805,
    "text": "And I think for some difficult tasks and things like mental arithmetic, there is indeed inner speech.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4736.692,
    "end": 4741.059,
    "text": " which is being used to control what you're doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4741.5,
    "end": 4751.336,
    "text": "And, um, some schizophrenic hallucinations where the, where they hear a voice commenting on their actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4751.436,
    "end": 4752.738,
    "text": "So now he's going to do this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4752.838,
    "end": 4754.701,
    "text": "And then why is he doing that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4754.721,
    "end": 4760.37,
    "text": "And it's all very weird what they, but how you can see a sort of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4763.202,
    "end": 4765.085,
    "text": " thread coming through this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4765.185,
    "end": 4769.692,
    "text": "I mean, that's what I would call self-talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4769.712,
    "end": 4772.597,
    "text": "And the fourth is not important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4772.637,
    "end": 4785.818,
    "text": "I wonder whether there is some, uh, some space for a predictive model here in so far as if we're going to talk about what we meant by self, self generated and agency, we were talking about, uh, deploying some prediction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4786.287,
    "end": 4797.062,
    "text": " And having in association with that prediction, I don't just deploy an action policy, I also have precise predictions about the sensory outcomes I'm expecting to receive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4797.683,
    "end": 4812.964,
    "text": "And perhaps we can talk about self-talk in a similar way, which is that at the inception of my self-talk, let's say I'm predicting the sensory, in speech marks, consequences of an action policy of saying this at T plus one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4813.504,
    "end": 4816.108,
    "text": "And then I receive that back and that seems self-generated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4817.506,
    "end": 4830.207,
    "text": " And I guess if that mechanism itself is disrupted through synaptic problems, precision weighting problems, then that is not only just going to be motor action, but also mental action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4831.129,
    "end": 4831.229,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4831.249,
    "end": 4832.091,
    "text": "Is that appropriate?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4832.351,
    "end": 4832.872,
    "text": "Absolutely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4832.892,
    "end": 4834.034,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4834.054,
    "end": 4835.276,
    "text": "Oh, maybe I should be a psychiatrist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4835.296,
    "end": 4837.6,
    "text": "Mental action is a good term.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4837.62,
    "end": 4838.842,
    "text": "Yeah, mental action is a very good term.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4838.862,
    "end": 4841.927,
    "text": "Well, I mean, all of this, it's kind of become very clear to me that all",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4842.515,
    "end": 4849.142,
    "text": " such a plethora of behavior in active inference is mental action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4849.722,
    "end": 4858.391,
    "text": "I mean, the very deployment of precision over what now we're using these Bayesian graphs, these so-called POMDP schemes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4858.872,
    "end": 4864.838,
    "text": "So you have your sensory expectations, your C matrix, your state transitions, your B matrix.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4865.398,
    "end": 4869.282,
    "text": "Deploying precisions over those are all mental actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4869.683,
    "end": 4870.224,
    "text": " Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4870.304,
    "end": 4870.664,
    "text": "Excellent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4870.724,
    "end": 4870.905,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4870.925,
    "end": 4871.886,
    "text": "That's, that's okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4872.767,
    "end": 4873.227,
    "text": "Interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4873.508,
    "end": 4873.708,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4873.728,
    "end": 4875.21,
    "text": "That's very, that's very cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4875.811,
    "end": 4888.967,
    "text": "Um, I was wondering, so there's a, uh, I believe he was a philosopher called Louis SAS, or maybe he was a psychologist and he wrote a book called madness and modernity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4889.608,
    "end": 4890.089,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4890.109,
    "end": 4892.392,
    "text": "It wasn't even more modernism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4894.755,
    "end": 4897.158,
    "text": "It might be, it might be, it's been a while since I read it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4897.178,
    "end": 4897.378,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4898.438,
    "end": 4900.823,
    "text": " Please, please educate me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4900.883,
    "end": 4904.53,
    "text": "I mean, I read it too, but it was a very long time ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4904.55,
    "end": 4916.555,
    "text": "So, I mean, it's a removal of sort of structures and standard procedures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4917.096,
    "end": 4917.537,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4917.777,
    "end": 4918.759,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4918.739,
    "end": 4948.476,
    "text": " stream and how does this stuff and how does that feed into schizophrenia is sort of the etiology of schizophrenia somewhat linked to having an unstable lifestyle yes I mean there's an interest this is very unlikely to be true but there's interesting stuff on volatility so with when the when the environment is volatile you should have a faster learning rate yes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4948.658,
    "end": 4951.622,
    "text": " And I think that somehow interacts with the dopamine system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4951.642,
    "end": 4951.743,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4954.226,
    "end": 4960.015,
    "text": "So you could, and there is some evidence that children brought up in very volatile environments are more at risk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4961.617,
    "end": 4968.107,
    "text": "And one wonders whether, and then you've got this dopamine aspect coming in as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4968.187,
    "end": 4970.43,
    "text": "If you've got too much dopamine, so you get the,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4972.857,
    "end": 4984.237,
    "text": " There's that sort of story and the modernism in the sense is increasing the volatility because you no longer rely on cultural givens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4984.698,
    "end": 4997.7,
    "text": "Currently an interesting idea in relation to schizophrenia, which is bringing the cultural thing is that most of our beliefs at this high level are constrained by interactions with other people and culture more generally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4998.389,
    "end": 5012.083,
    "text": " And you could argue that what's odd about what the reason that schizophrenic beliefs don't update is because they're no longer constrained by this high level cultural and what other people say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5012.103,
    "end": 5018.269,
    "text": "So these are yes, your work is all coalescing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5020.471,
    "end": 5021.032,
    "text": "That's cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5021.612,
    "end": 5022.073,
    "text": "That's nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5022.453,
    "end": 5024.515,
    "text": "Yeah, that's very, yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5025.372,
    "end": 5026.253,
    "text": " It's interesting, isn't it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5026.273,
    "end": 5039.188,
    "text": "Because we think of ourselves as these, we live in the rather individualistic society where we think of ourselves as these atomistic beings and we're not, and we're not, that's terrifying.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5041.711,
    "end": 5042.011,
    "text": "Good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5042.892,
    "end": 5043.192,
    "text": "Excellent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5043.212,
    "end": 5045.755,
    "text": "So, so the book came out last year.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5045.795,
    "end": 5046.376,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5047.177,
    "end": 5052.703,
    "text": "What's on the, what's on the horizon for Chris Frith, Uta Frith, the Friths?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5053.945,
    "end": 5055.126,
    "text": "Well, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5056.203,
    "end": 5057.685,
    "text": " We're in our eighties now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5059.247,
    "end": 5062.592,
    "text": "You wouldn't be able to tell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5062.912,
    "end": 5067.919,
    "text": "We haven't got a major project in line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5071.484,
    "end": 5077.632,
    "text": "We have a quite exciting interaction with our friends in Aarhus in Denmark.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5077.652,
    "end": 5077.893,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5078.213,
    "end": 5083.24,
    "text": "Where they have uploaded all our papers and are trying to construct a large language model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5084.637,
    "end": 5086.64,
    "text": " Just interesting who we really are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5087.06,
    "end": 5089.163,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5089.183,
    "end": 5089.824,
    "text": "Interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5090.885,
    "end": 5092.427,
    "text": "Uh, is this Andreas?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5093.349,
    "end": 5093.99,
    "text": "Well, no, it's in his.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5094.931,
    "end": 5095.572,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5095.912,
    "end": 5096.813,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5096.833,
    "end": 5101.5,
    "text": "Cause I, you have a, you have a partnership with him or is that still going?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5101.7,
    "end": 5102.781,
    "text": "We visit every year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5102.821,
    "end": 5103.042,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5103.342,
    "end": 5104.163,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5104.183,
    "end": 5104.424,
    "text": "Excellent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5104.444,
    "end": 5105.685,
    "text": "He's got, I think he might be coming on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5106.687,
    "end": 5108.769,
    "text": "Um, certainly talk to him now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5108.789,
    "end": 5110.091,
    "text": "I'm extremely interested in this one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5111.253,
    "end": 5113.716,
    "text": "Chris, this was, um, this was a delight.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5113.865,
    "end": 5119.676,
    "text": " It's been a delight on my part to go back and read your texts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5119.696,
    "end": 5123.003,
    "text": "I mean, I did finish my master's just background about myself in case you didn't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5123.023,
    "end": 5126.409,
    "text": "I finished my master's at UCL in experimental psychology last year.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5126.449,
    "end": 5132.16,
    "text": "And I would say sort of your presence and Carl's presence",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5132.63,
    "end": 5137.267,
    "text": " sort of lingers in a positive way, not in a sort of ghoulish way through the corridors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5138.833,
    "end": 5139.415,
    "text": "So thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5140.719,
    "end": 5141.783,
    "text": "My pleasure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5141.803,
    "end": 5142.787,
    "text": "It's been an absolute pleasure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5142.807,
    "end": 5143.75,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5143.771,
    "end": 5144.192,
    "text": "Excellent.",
    "speaker": "SPEAKER_02"
  }
]