[
  {
    "start": 8.047,
    "end": 9.269,
    "text": " Hello, welcome everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9.809,
    "end": 19.422,
    "text": "It's April 9th, 2025, and we're here in Active Inference Guest Stream 102.1 with Majid, Benny, and Dean as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 20.143,
    "end": 28.995,
    "text": "So we're looking forward to a presentation and a discussion on scientific explanation, causality, and agency, a free energy account.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 29.716,
    "end": 31.438,
    "text": "Thank you, Majid, for joining again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 31.859,
    "end": 34.442,
    "text": "Looking forward to the presentation and go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 35.772,
    "end": 38.074,
    "text": " All right, thank you very much for inviting me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 38.495,
    "end": 46.223,
    "text": "It's great to be here and I'm going to cut to the chase and start to introduce the project, to speak about the project.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 46.243,
    "end": 56.673,
    "text": "So, Scientific Explanation, Causality and Agency is the name of the book and you can see the image in the next page.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 58.675,
    "end": 64.581,
    "text": "Well, it's a 2024 book by Rutledge and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 64.662,
    "end": 71.061,
    "text": " so i'm going to briefly speak about the main themes of the book uh it is about the agency",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 72.205,
    "end": 80.479,
    "text": " in the next page, sorry to just interrupting by saying the next page, but it is an aspect of my book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 80.499,
    "end": 89.554,
    "text": "So it tries to develop a philosophical articulation of agency in terms of the free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 89.594,
    "end": 97.487,
    "text": "So I presume most people who are watching this or listening to this are familiar with the free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 97.703,
    "end": 118.986,
    "text": " which has been developed by Carl Friesen and colleagues and provides an account of perception, cognition and action in terms of minimization of free energy principle, which is an information theoretic threshold, an upper bound on surprisal or prediction error.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 118.966,
    "end": 139.489,
    "text": " so agency agents are self-organizing systems and uh but a particular kind of self-organizing systems they have this peculiar capacity to minimize not only their free energy but their expected free energy or the free energy that is associated with the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 140.819,
    "end": 147.453,
    "text": " future sequences of action on the basis of their evaluation of counterfactual outcomes of their action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 147.513,
    "end": 150.279,
    "text": "So other people have been doing that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 150.359,
    "end": 160.06,
    "text": "Of course, Carl Princeton himself and his colleagues have been working on this theory of agency and a number of other significant people such as",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 160.04,
    "end": 181.93,
    "text": " um andy clark for example amongst others have been developing age theories of agency in terms of the free energy principle so i delved a bit more deeper in this respect and tried to provide a more uh specific and clear identification of agency in terms of the free energy principle what it is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 181.91,
    "end": 189.364,
    "text": " not the main contribution of the work, as I said, this book, as I said, other people have been trying to do that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 189.704,
    "end": 205.453,
    "text": "So the main contribution of the book is to try to cast philosophy of science, theories of causality and scientific explanation and causal explanation in terms of this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 205.433,
    "end": 227.779,
    "text": " uh theory of agency in terms of the free energy principle so and this is something that uh i have uh i'm going to discuss in the next page of this slide so the next slide is about the main contribution of the uh of this uh of this book so it uh there have been theories of this science for",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 229.683,
    "end": 235.639,
    "text": " sense for, at least for scientific realists, is basically about scientific explanation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 235.679,
    "end": 243.962,
    "text": "Science aims at explaining things, and there have been causal theories of explanation for a while.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 245.275,
    "end": 267.334,
    "text": " No, this book tries to, instead of treating causal scientific explanation as something that is totally objective and totally about the mind independent structure of the world, it tries to cast causal explanation in terms of agents",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 268.428,
    "end": 298.435,
    "text": " models of their environment and agents are specified in terms of the free energy principle so and there are a number of interesting philosophical questions here at least interesting for me so whether this kind of causal explanation are building on some sort of totally objective conception of causality or it is something that is projected from the mind of agents on to the world and it is the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 298.415,
    "end": 308.169,
    "text": " the accounts that I'm defending in this book, the projectivist account, and I'm supporting that on the basis of the free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 308.249,
    "end": 324.692,
    "text": "At the same time, I do not think that it necessarily undermines realist commitments that might be associated with causal explanations, because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 326.444,
    "end": 342.701,
    "text": " by the very fact that this theory tries to support its accounts of scientific explanation by the best scientific theories, or at least the most progressive scientific theories of the field, it comes with degrees of objectivity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 342.802,
    "end": 353.413,
    "text": "It bestows upon its theories a degree of objectivity that might be otherwise missing from theory of explanation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 355.182,
    "end": 364.294,
    "text": " In the next slide, I'm referring to the philosophical background of this proposal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 364.394,
    "end": 367.218,
    "text": "The project of the book is ambitious.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 367.298,
    "end": 374.647,
    "text": "At the same time, it might be a bit confusing because it tries to bring together two different cultures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 374.848,
    "end": 379.654,
    "text": "There is free energy principle and philosophy of mind and cognitive science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 379.634,
    "end": 397.035,
    "text": " Philosophers of mind and cognitive science are more or less quite familiar with free energy principle, Bayesian theories of cognition and this kind of stuff and they try to explore its implications, ramifications for",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 397.015,
    "end": 402.507,
    "text": " theories of perceptual representation, cognition, action, self, consciousness, whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 403.129,
    "end": 412.83,
    "text": "On the other hand, there is philosophy of science and there is philosophy of action and there is philosophy of causation and philosophy of explanation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 412.81,
    "end": 434.717,
    "text": " uh so people who are working in cognitive science or people who are working on philosophical aspects of free energy principle are not always i mean are not necessarily interested in that kind of philosophy or philosophy of science and philosophers of science usually are not that uh that that much concerned with progress in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 434.697,
    "end": 453.533,
    "text": " uh cognitive sciences there have been philosophers of science good philosophers of science who have been concerned with progress in in uh cognitive sciences i'm thinking of uh paul churchland and ron geary and uh and narcissus and so on but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 453.513,
    "end": 460.691,
    "text": " more recently philosophers of science started to move to other directions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 460.711,
    "end": 469.834,
    "text": "But this branch of philosophy of science that sets the stage for my agentic theory of causality is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 469.814,
    "end": 497.188,
    "text": " manipulability theory originally developed by pragmatists and then advanced by Hugh Price and Peter Menzies and James Woodward and others and it tried to account for causality there has been an agency theory of causality and then I developed that into agency theory of explanation as well",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 498.265,
    "end": 518.704,
    "text": " and it is a more or less well established theory in philosophy of science or at least it has been a very well established theory in philosophy of science for in 1990s and for two decades but it became a bit overshadowed by manipulability theory and interventionism uh what i did try to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 518.684,
    "end": 540.76,
    "text": " cast this theory in terms of uh advancement in cognitive science in terms of free energy principle and so on uh so which has been more or less an innovative move and then came with some ramifications that that even i didn't think of when i started to develop the project",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 540.74,
    "end": 544.708,
    "text": " So, next slide speaks about price projects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 544.769,
    "end": 550.842,
    "text": "I don't think that we need to dwell on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 551.102,
    "end": 559.44,
    "text": "And I'm moving to the next slide on the central role of the free energy principle in my project.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 561.783,
    "end": 567.83,
    "text": " Yeah, philosophers of science sometimes rely on scientific advancement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 567.99,
    "end": 573.898,
    "text": "So, of course, philosophers of physics are always concerned with what happens in physics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 573.918,
    "end": 579.624,
    "text": "Other physics and philosophers of cognitive science are concerned with what happens in cognitive science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 579.685,
    "end": 590.878,
    "text": "But what I'm trying to do in this project is to go beyond that and use free energy principle as a framework for",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 592.057,
    "end": 599.282,
    "text": " embedding, entrenching my theory of philosophy of science or my philosophy of science in the sense that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 600.545,
    "end": 623.481,
    "text": " I see science as something that takes place by cognitive agents, by cognitive self-organizing systems, both individually and collectively, and then I think that free energy principle with its account of how self-organizing systems model the environment to themselves and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 623.461,
    "end": 639.428,
    "text": " uh use these models to steer in the world to to fare and make decisions and so on and prosper provides a good basis for uh for a theory of philosophy of science",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 639.408,
    "end": 651.545,
    "text": " And then it comes with some sort of projectivism, which is, again, a view that has been defended by Hugh Price before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 652.286,
    "end": 659.897,
    "text": "But interestingly enough, it finds a nice counterpart in Free Energy Principle and its",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 660.4,
    "end": 688.467,
    "text": " hierarchical organization of minimization of free energy and how cognition starts from generative models in the top levels of these organizations and then how cognition and perception take place when the agents try to project these models onto the world and then minimize the discrepancy between these models by either acting on the world or updating their model",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 689.999,
    "end": 710.505,
    "text": " so yeah so the next slide is also about projectivism we can return to that later but i'm going to wrap up quickly because i want to leave more time to uh discussion so i go to the slide about the book's structure uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 712.595,
    "end": 716.803,
    "text": " So early chapters of the book set the stage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 716.944,
    "end": 733.978,
    "text": "So the first chapter describes the project of the book and its attempt to outline a humanistic perspective on causality and scientific explanation and how",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 733.958,
    "end": 757.013,
    "text": " uh free energy principle plays a role and the second the second chapter is about the free energy principle i provide an articulation of the free energy principle i also explain in what sense i'm a structural realist about free energy principle and what justifies my realism about the free energy principle",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 756.993,
    "end": 766.446,
    "text": " then there is a substantive chapter on agents and agency and how agency could be specified in terms of the free energy principle",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 767.0,
    "end": 776.833,
    "text": " and how free energy principle could be used to model different kinds of entities and then set a distinction between them in terms of levels of complexity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 778.515,
    "end": 791.151,
    "text": "Then later chapters deal with some more specific technical notions and concepts in philosophy of science, such as modern realism, where I try to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 792.346,
    "end": 810.827,
    "text": " deconstruct modalities in terms of counterfactual model making in the regenerative model or tick-generative models of agents and some other topics such as the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 815.178,
    "end": 839.785,
    "text": " progress of science and scientific practice in terms of the collaboration between humans and artifacts or how science and scientific representation is something that takes place in the networks of collaboration of human humans and human artifacts and also some other technical notions and yeah perhaps technical is not",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 839.765,
    "end": 864.456,
    "text": " the right term perennial notions in philosophy of science such as physicalism and non-physicalism and so on and I think that this is the last slide that I'm going to discuss and then open the floor to discussions which provides a sketch of the chapters of the book and now it's the time for me to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 866.782,
    "end": 874.656,
    "text": " wait for your input and your demonstration of your superior understanding of the content of my work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 877.281,
    "end": 879.545,
    "text": "Dean, you've never been set up like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 879.565,
    "end": 881.128,
    "text": "I know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 883.555,
    "end": 897.615,
    "text": " So I got about five questions, and I hope all of them don't give away because my my first suggestion anybody watching today is go buy this book and read it because I think you'll come away",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 898.861,
    "end": 923.502,
    "text": " changed because i think it just brings up so many different ideas that people probably have never contemplated and you've made it available whereas i don't think that was necessarily something um that existed before you set out on this on on completing this work but my first question first question i just wanted to say that you are too kind thank you very much okay well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 924.19,
    "end": 924.751,
    "text": " I don't think so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 924.831,
    "end": 932.939,
    "text": "Anyway, the strategy for pushing theories that are typically within the mind out into the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 937.023,
    "end": 942.508,
    "text": "Was there some hope on your part to address that question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 942.528,
    "end": 949.135,
    "text": "Because there's a lot of stuff in here around sort of coming up with strategy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 949.385,
    "end": 978.615,
    "text": " So I'm wondering, like when you were sort of laying out the outline of this, was that one of your goals was to sort of speak to how things within that umbrella of agency are then tested by sort of the environment acting as a scrutineer on what we can hold up as objective versus subjective?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 980.941,
    "end": 981.682,
    "text": " Very well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 983.325,
    "end": 986.03,
    "text": "It's a very fundamental question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 986.13,
    "end": 987.353,
    "text": "I try to answer that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 987.673,
    "end": 998.072,
    "text": "I may start to delve into too much details about the history of philosophy of science, but I think that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 998.052,
    "end": 1004.26,
    "text": " it gives me the necessary vocabulary, the jargon to answer to your question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1004.34,
    "end": 1024.988,
    "text": "So, look, when we speak of theories, bringing theories from the mind to the world and test them and so on, look, philosophy of science, in a sense, started with this concern with theories, what are these theories, how they are tested and so on, and this was what have been happening for a very long time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1024.968,
    "end": 1032.878,
    "text": " in the early 20th century in works of logical positivists and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1034.781,
    "end": 1045.795,
    "text": "The term scientific theory and its logical implications, I do not want to delve too much into logic and how theories have been understood.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1046.516,
    "end": 1054.266,
    "text": "So the contemporary conception of theory that I'm familiar with comes from",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1055.765,
    "end": 1070.639,
    "text": " a number of eligible and very good philosophers, works of a number of eligible and very good philosophers of science, such as Patrick Supes, Botsman-Frossen, Stephen French, Hans Holderson.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1070.659,
    "end": 1073.385,
    "text": "So they used to see theories",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1073.365,
    "end": 1089.973,
    "text": " as representation of phenomena, regardless of whether you consider these phenomena as parts of the structure of the real world, mind, independent world, or just as experiences and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1091.067,
    "end": 1097.494,
    "text": " And there is a very vast literature on that and very interesting debate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1098.855,
    "end": 1108.245,
    "text": "What has been a bit underestimated, I mean, there have been, of course, also people to consider that, as I said, such as Ron Geary and others.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1108.305,
    "end": 1115.893,
    "text": "But what has been underestimated a bit was that these theories are the byproduct of the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1115.873,
    "end": 1135.3,
    "text": " cognitive agents, which are basically self-organizing systems that are evolved in this form and are systems that are having this specific perceptual and cognitive faculties that they have in order to be able to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1136.984,
    "end": 1143.513,
    "text": " to maximize their chance of survival in the evolutionary context and evolutionary condition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1144.074,
    "end": 1148.24,
    "text": "But theories have not been used in these specific terms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1148.441,
    "end": 1160.578,
    "text": "So, on the other hand, there is pre-energy principle, which speaks about generative models and hypothesis about the words that are cast in these generative models, and then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1160.558,
    "end": 1175.119,
    "text": " self-organizing systems try to check the veracity or reliability of these models against the evidence that they get from the environment and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1175.539,
    "end": 1188.017,
    "text": "But it seems to be some sort of, yeah, it seems that there are two different cultures, people who speak about theories in science, in philosophy on science, and people who speak about hypotheses or models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1187.997,
    "end": 1201.269,
    "text": " in cognitive science as the modeling tools for the cognitive structure of the cognitive system and brain of self-organizing system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1201.469,
    "end": 1204.371,
    "text": "It seems that they are speaking in two different cultures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1205.512,
    "end": 1217.683,
    "text": "So I'm interested in trying to ground the traditional technical concept of theories in philosophy of science in this more",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1218.592,
    "end": 1241.781,
    "text": " practical, more scientific notion of hypotheses and models as the tools that self-organizing systems are using to be able to represent their environment to themselves and then use them to be able to fare in the world, to be able to interact with their environment",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1241.761,
    "end": 1269.017,
    "text": " successfully enough to maximize their chance of survival for a while at least so it is a very complicated because the relation is reciprocal so in a way of course the way that's that that car freeston and others speak of models and hypothesis they are using bayesianism which is basically a part of science so there is a reciprocal relation between one notion of theories which is quite which is quite",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1268.997,
    "end": 1280.069,
    "text": " theoretical and the other notion of models, which is also theoretical but is used to represent some embodied mechanisms and processes in cognitive systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1280.089,
    "end": 1293.925,
    "text": "So I'm not trying to just ground the philosophical notion of theories and models into the Bayesian notion of theories of models, but the embodied processes, embodied cognitive processes,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1293.905,
    "end": 1295.688,
    "text": " that are represented by this model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1296.128,
    "end": 1307.145,
    "text": "In a nutshell, I'm trying to see this philosophical notion of theories, to ground this philosophical notion of theories into embodied mechanisms of interaction of organisms with their environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1307.205,
    "end": 1316.84,
    "text": "So in that sense, yes, I think that theories are things that are basically grounded in the cognitive system of self-organizing system and they are tested in this fashion and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1317.28,
    "end": 1320.385,
    "text": "And I think that this sophisticated notion of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1320.517,
    "end": 1327.768,
    "text": " theory testing, falsification, confirmation, scientific explanation and so on and so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1327.788,
    "end": 1342.831,
    "text": "They all could be explicated and explained on the basis of this embodied mechanism of interaction of individual organisms as well as the communities and groups of organisms with their environment and with one another.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1342.892,
    "end": 1347.098,
    "text": "Does it answer to your point at all?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1347.533,
    "end": 1350.617,
    "text": " And it Yeah, and it sets up my perfectly my next question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1350.657,
    "end": 1365.236,
    "text": "So we were all I think we're all probably familiar with the with the expression philosophy of science, which is which is basically both something that's familiar, established.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1365.256,
    "end": 1370.423,
    "text": "And there's also an entailment like one of those things grips the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1371.264,
    "end": 1373.507,
    "text": "Here's my next question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1374.753,
    "end": 1390.137,
    "text": " If I come at the problem after reading your book, and the book actually made me ask these questions, this is what a scientist or how a scientist thinks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1390.838,
    "end": 1392.601,
    "text": "So I set that down over here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1392.661,
    "end": 1397.869,
    "text": "This is what a philosopher thinks or how a philosopher thinks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1397.91,
    "end": 1399.512,
    "text": "Set that down over here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1399.897,
    "end": 1402.72,
    "text": " left me with a question after reading the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1403.32,
    "end": 1410.387,
    "text": "So what title should we self-ascribe or self-organize if we're between those two worlds?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1411.729,
    "end": 1412.549,
    "text": "Oh, that's very good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1412.79,
    "end": 1414.671,
    "text": "Is that place non-hyphenated?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1416.773,
    "end": 1425.282,
    "text": "Because that's what you got me thinking about through doing this exploration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1427.504,
    "end": 1428.705,
    "text": "Very good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1430.761,
    "end": 1436.888,
    "text": " Yeah, so perhaps it is a bit of my personal take in philosophy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1436.908,
    "end": 1442.033,
    "text": "So I do not see philosophy of science as two different things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1442.173,
    "end": 1454.167,
    "text": "I think that, again, perhaps I'm too much fascinated or perhaps fooled by my own ideas about everything that started from embodied mechanisms and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1454.187,
    "end": 1456.069,
    "text": "But I think that there are basically two problems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1456.569,
    "end": 1460.093,
    "text": "What's the nature of the world and what's the nature of the mind?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1460.073,
    "end": 1465.982,
    "text": " which could be, in a way, one problem if you are interested in scientific representation and how minds represent the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1466.523,
    "end": 1477.339,
    "text": "And I think that most of the intellectual enterprises in the world, being scientific or philosophical, are organized around these two main questions, the nature of the world and the nature of the mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1478.0,
    "end": 1483.268,
    "text": "So, some people engage in more formalism, more experimentation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1484.47,
    "end": 1487.835,
    "text": "I think that... Did we lose Dean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1489.03,
    "end": 1490.051,
    "text": " Briefly, possibly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1494.235,
    "end": 1494.455,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1495.336,
    "end": 1496.157,
    "text": "Pause there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1496.677,
    "end": 1499.48,
    "text": "Let me ask another question from the live chat and he'll join.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1499.72,
    "end": 1499.92,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1500.781,
    "end": 1501.002,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1502.303,
    "end": 1510.09,
    "text": "Susan Hasty wrote, is manipulation theory another category of control theory or a child?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1511.632,
    "end": 1515.055,
    "text": "So how would you relate manipulability theories to control theory?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1516.182,
    "end": 1521.29,
    "text": " I do not know in which context we are speaking of control theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1521.31,
    "end": 1531.725,
    "text": "I mean, some manipulability theory, by manipulability theory, because there are control accounts of thermodynamics, for example, as opposed to resource theories of thermodynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1531.745,
    "end": 1534.329,
    "text": "So I do not know about the context or the background.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1534.349,
    "end": 1545.025,
    "text": "But the way that I was using manipulability theory, actually the way that Hugh Price and James Woodward and others were using manipulability theory, and it was coming from the context of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1545.528,
    "end": 1551.455,
    "text": " pragmatism, so causation and causal relations, how to define them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1552.496,
    "end": 1562.167,
    "text": "I think that people, at least since Aristotle, people were trying to define causation, causality and cause-effect relation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1562.567,
    "end": 1567.873,
    "text": "So this tradition defines causation in terms of manipulability, in terms of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1567.853,
    "end": 1578.448,
    "text": " if you want to know what is causing what, what is bringing about what, start to manipulate what you think is the cause and see whether there would be any changes in the set of your effect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1578.628,
    "end": 1596.072,
    "text": "So, manipulability... And James Woodward has developed that in terms of interventionist theories of causation, which can be represented and modeled in terms of, for example, amongst other things, could be represented in terms of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1596.052,
    "end": 1602.443,
    "text": " Markovian networks and Markovian blankets and so on, Markovian chains.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1603.224,
    "end": 1614.803,
    "text": "And then there could be a relation between this and control, but I do not know the context in which our audience was mentioning control.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1615.998,
    "end": 1616.599,
    "text": " Perfect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1617.521,
    "end": 1621.089,
    "text": "After the seventh inning stretch, Dean is back on the plate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1621.109,
    "end": 1623.453,
    "text": "Or Majeed, pick up from where you were on Dean's question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1623.614,
    "end": 1625.518,
    "text": "Don't worry about that, guys.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1625.538,
    "end": 1627.201,
    "text": "I have no idea of everywhere.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1627.802,
    "end": 1629.045,
    "text": "I told you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1631.168,
    "end": 1651.506,
    "text": " continue on yeah science science and philosophy so what i was trying to say is that yeah i i i think uh uh this is something that i learned from of course the tradition of philosophy of science in which i was brought up which are works of rodolf karnap and willard van orman coins",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1651.891,
    "end": 1656.836,
    "text": " but also something that I learned from my friend and mentor, Stephen French.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1656.856,
    "end": 1660.52,
    "text": "So I think that philosophy is best when it is informed by science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1661.281,
    "end": 1665.966,
    "text": "And science, some people would say, is best when it is informed by philosophy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1666.026,
    "end": 1673.154,
    "text": "I'm a bit skeptical about the latter because there are different philosophies and I don't know how science could be informed by philosophy precisely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1673.194,
    "end": 1680.582,
    "text": "But I think that philosophy is best when informed by science in the sense that, in my opinion, philosophers and scientists are basically",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1680.562,
    "end": 1687.068,
    "text": " working on the same topic, the nature of the world and the nature of mind and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1687.088,
    "end": 1691.752,
    "text": "So scientists are usually focusing more on experimentation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1691.812,
    "end": 1708.527,
    "text": "Some scientists, theoretical scientists, are focusing a bit more on modeling the consequences of experimentation or the theoretical context that is necessary for being able to do this kind of experimentation at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1710.802,
    "end": 1720.724,
    "text": " But none of these people are necessarily interested in the shape that this experimentation and theories make of the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1720.804,
    "end": 1728.642,
    "text": "So we are living in a world, we like to know what are the features of this world, how it looks like, what is actually there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1728.622,
    "end": 1734.772,
    "text": " or conception of what we think is there is justified.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1735.333,
    "end": 1742.464,
    "text": "And philosophers are people who are trying to engage with this set of latter questions, this set of final questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1742.985,
    "end": 1746.31,
    "text": "Which makes sense from my perspective, because we are",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1746.29,
    "end": 1765.378,
    "text": " all some sort of self-organizing systems, collaborating with one another, or to state it in another way, we are just parts of a self-organizing network, parts of scientists, philosophers and other intellectuals, parts of a self-organizing system,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1765.358,
    "end": 1791.4,
    "text": " whose parts are interacting with one another so it is in a very natural to have similar concerns but we are engaging so much as the division of labor is concerned we are doing this we are engaging with these questions at different levels of generality so experimentalists for example are engaging with very detailed experimentation theoreticians are",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1792.679,
    "end": 1795.754,
    "text": " engaging with them at a higher level of generality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1795.835,
    "end": 1800.377,
    "text": "And philosophers are basically, in my opinion, people who are trying to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1800.762,
    "end": 1815.322,
    "text": " unpack the ontological, existential and epistemological ramifications of this engagement with these questions in the sense of trying to work out... And this is what I was trying to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1816.664,
    "end": 1825.015,
    "text": "Carl Priester and others were developing this fascinating framework and I was just getting interested to know",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1824.995,
    "end": 1837.898,
    "text": " What would be the philosophical ramifications in the sense that what would be the universe that we are living in, assuming that what they say about the nature of self-organizing system is true?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1837.938,
    "end": 1849.939,
    "text": "And what implication it would have for the way that we garner knowledge about our environment and the justification of those pieces of knowledge and so on?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1852.822,
    "end": 1854.784,
    "text": " If it's okay, I'd like to ask one last question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1854.824,
    "end": 1855.565,
    "text": "I apologize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1855.785,
    "end": 1859.129,
    "text": "I do not know why one of my laptops shut down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1859.189,
    "end": 1862.232,
    "text": "It's got lots of battery, but fortunately I have a backup.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1862.272,
    "end": 1871.201,
    "text": "So my last question, and this one has a bit of a historical context to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1871.682,
    "end": 1880.871,
    "text": "So I think it was in 2022, we were on a live stream together and we were talking about instrumentalism versus an action and stuff like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1881.475,
    "end": 1895.253,
    "text": " I think essentially at that point we were kind of agreeing on the fact that you kind of need an understanding of both, kind of like you need an understanding of philosophy and an understanding of science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1896.435,
    "end": 1910.554,
    "text": "What I'm really curious about, my active engagement with the Active Entrance Lab and then the Institute started out with a question around where do we place",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1911.023,
    "end": 1913.365,
    "text": " the emphasis in terms of ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1913.385,
    "end": 1929.041,
    "text": "And I know in your book, you have made it very clear where you think ontology fits into this triangulation between pragmatism and free energy principle and agency theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1929.942,
    "end": 1936.609,
    "text": "Do you mind kind of sharing how you got to the place where you, well, maybe for sharing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1937.5,
    "end": 1944.595,
    "text": " what you think the emphasis on ontology should be, and then maybe explain how you got there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1945.962,
    "end": 1946.464,
    "text": "Very well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1946.765,
    "end": 1947.406,
    "text": " Very well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1947.947,
    "end": 1958.63,
    "text": "I think that I remember the moment when we were discussing in a previous event, and I think that I see your point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1958.69,
    "end": 1962.638,
    "text": "So let me also start to share a bit of personal history.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1962.678,
    "end": 1967.929,
    "text": "So I think that I'm basically a philosopher of science in the sense that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1967.909,
    "end": 1996.212,
    "text": " uh i spend a lot of time about uh pondering the questions of realism and anti-realism in theory mentalism in philosophy of science and what struck me what did it strike me as odd when i was pondering this question was that how much repeat repeat reputation do this debate include so there are people who are anti-realist and just uh state their point and offer some",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1996.192,
    "end": 2026.148,
    "text": " uh some arguments and the realist defender point on the basis of some arguments and there is of course this is of course a a very vibrant tradition so there is of course some always some progress but there is also loads of repetition in the sense that you really notice a totally new or totally convincing new argument for either of these positions",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2026.128,
    "end": 2047.242,
    "text": " At some point, I started to wonder what would be the point of taking a straightforward and unshakable stance on realism or anti-realism and self-identify as a tag-bearing realist or anti-realist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2048.099,
    "end": 2060.185,
    "text": " I thought that it would be in a way incompatible with commitment to naturalism in the sense that you try to develop this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2061.464,
    "end": 2088.147,
    "text": " organic connection between science and philosophy and try to inform them with one another so and science is always about so when i say that there hasn't been that much progress or new ideas in realist anti-realist debate i particularly compare that with science and progress in scientific field and and and and the diversity of new arguments and new evidence that is most of the time come",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2088.127,
    "end": 2106.692,
    "text": " considered in different scientific fields and i think that this is something that i find interesting when i say that i try i take free energy principle as a framework uh into which i can cast my philosophy of science this is what i mean that you don't need to take",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2106.672,
    "end": 2130.84,
    "text": " uh a rigid stance on realism or anti-realism you don't need to take a general a rigid stance or but you can focus on specific topics a specific argument and then see where they take you and how much uh realist commitment you would be ready to invest in those specific claims and theories on the basis of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2131.006,
    "end": 2139.445,
    "text": " the evidence that you find for these theories, these arguments and ideas at any given moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2139.705,
    "end": 2147.142,
    "text": "So this evidential decision theory has been a part of this agency approach to causality that I",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2147.122,
    "end": 2174.665,
    "text": " uh that i revived that i defend but at the same time uh the relation between hypothesis and evidence and trying to explain it to find evidence for one's existence in terms of carl freeston and yakub hawi and then try to always update your hypothesis on the base of the new evidence that you find and so on i think that it can a dynamic version of realism",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2174.982,
    "end": 2200.112,
    "text": " or no realism for that matter could be uh could be uh developed on the basis of that idea i do not care about so again i think that this is something that you price said somewhere it is not about being realist or a no realist was about being not being a naive realist or a known known known realist and i think that free energy principle",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2200.092,
    "end": 2215.3,
    "text": " provides the opportunity for this sophistication in the sense that you can see all of this in terms of a hierarchical structure of minimizing your errors, minimizing your prediction errors of your commitments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2215.28,
    "end": 2241.861,
    "text": " and then you can consider the evidence that you have and the possibility for being able to make to to take a specific statement a specific model as the locus of your ontological and epistemic commitments and then try to do that rationally on the basis of this this this opportunity so it is possible it would be possible to cast that in terms of for bayesian updating of course but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2241.841,
    "end": 2260.162,
    "text": " I do not think that it needs to make commitment to a specific formalism even, so much as you are ready to make concession on revising not only your theories in terms of new evidence, but also your commitments, realist commitments, in light of the new evidence that you receive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2260.702,
    "end": 2265.688,
    "text": "I think that it should be a more dynamic and a bit more sophisticated version.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2265.668,
    "end": 2272.702,
    "text": " of a philosophical stance on science than the traditional versions of realism or non-realism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2273.483,
    "end": 2284.926,
    "text": "In this sense, I do not think that the interesting debate, philosophical debate, about free energy principle is about being realist or",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2284.906,
    "end": 2307.859,
    "text": " instrumentalists about free energy principle, but taking free energy principle itself as something that allows you to regulate the weight of your realist commitment or the weight of your ontological and epistemological commitment with regard to any scientific model at any given moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2308.598,
    "end": 2319.358,
    "text": " I didn't receive enough feedback from philosophers of science to know whether they find these ideas plausible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2320.019,
    "end": 2332.041,
    "text": "But then again, I don't think that traditional realists or anti-realists would have any reason to like these ideas particularly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2333.86,
    "end": 2353.29,
    "text": " And when saying traditional realist and anti-realist, I really do not know of... Sometimes this naive realist or anti-realist are mainly parts of dogmatic philosophers that live in any of us, rather than any particular person.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2353.33,
    "end": 2355.413,
    "text": "So I'm not referring to any particular person.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2355.393,
    "end": 2381.586,
    "text": " but to any philosopher or intellectual that in any moment decides to insist on some ideas in which i mean some specific ideas or models that have been that that have been the topic of their work for a very long time uh so we used to invest in their ideas and then at some point to become a bit too dogmatic and try to defend them a bit rapidly and and i think that free energy principle",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2381.566,
    "end": 2409.649,
    "text": " provides a way when casting philosophical commitments in terms of free energy principle provides enough flexibility to be able to a bit lag on some of your ideas when you think that you don't have enough evidence or argumentation for supporting them at the same time it allows you to defend them vigorously enough when you think that the weight of the evidence and argumentation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2409.629,
    "end": 2439.518,
    "text": " uh variants investing investing enough ontological and epistemological commitments into those models and theories did it make any sense i mean what i was trying to say well clearly yeah i was just wondering what daniel you you you started the institute in the uh how many years now six five yeah so in those five years",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2439.7,
    "end": 2466.518,
    "text": " like how would you see the free energy principle stirring the pot because that's essentially i think what i think five years later it it it at least does that in terms of of what what's between philosophy and science yeah well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2466.683,
    "end": 2468.273,
    "text": " Both of you have been along for the ride.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2468.313,
    "end": 2472.458,
    "text": "We've had many fun points in that adventure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2473.231,
    "end": 2495.759,
    "text": " I'll connect a quote from the book to also some of the sort of undergraduate and graduate type philosophy of biology and epistemology that I saw and maybe this speaks to how what Majeed and others are pointing towards gives us a blended or more nuanced take.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2495.819,
    "end": 2498.462,
    "text": "So this is on page 87.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2499.337,
    "end": 2508.236,
    "text": " The central question is, how can agency theory, which has an empiricist leaning, establish the truth value of counterfactual statements?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2509.218,
    "end": 2517.075,
    "text": "So, I mean, if what's factual is actual and what's actual is empirical and empiricism is about describing the actual and...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2517.207,
    "end": 2524.458,
    "text": " deriving justified true beliefs and all of that kind of materialist, realist, everything in that camp.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2525.279,
    "end": 2546.91,
    "text": "Yet, our actuality includes counterfactuals and the adjacent possible, the cognitive actual, the expected free energy, the simulated possibilities, you know, entertained or virtualized considerations as actual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2547.127,
    "end": 2568.898,
    "text": " so then in response this is continuing quote i propose that the truth value of counterfactual statements could be grounded in factual information about how sophisticated organisms which are presumed to possess agency can model their counterfactual expectations about law-like stability in their environment and of course the the quote and the book",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2568.878,
    "end": 2583.394,
    "text": " goes on so it's a cognitive realist take but as you kind of pointed out whether it were cognitive instrumentalist or cognitive realist that's not necessarily even the axis that separates",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2584.437,
    "end": 2603.425,
    "text": " it's about an informed cognitive scientific approach to philosophy so that there's the philosophy of science and the science of philosophy which is like pragmatism which is okay there's cognition about that inquiry what is the temperature in that room",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2603.405,
    "end": 2630.796,
    "text": " and then there would be like a meta science or pragmatism of a science or some kind of nested layer about going across and switching between different inquiries some that are more data driven some that are more speculative or axiomatically or ontologically driven but whether your ontology is from another frame entirely nonsensical",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2631.198,
    "end": 2656.328,
    "text": " entirely whimsical super small very large heterogeneous whatever kinds of commitments it makes or whatever commitments it commits to commit to commit to make however you want to compose all those possibilities they are plain cognitive embodied realities as well and so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2656.848,
    "end": 2677.911,
    "text": " that is kind of some of the space of bringing in a descriptive first showing up with a posture and an openness then a descriptive analytical layer now moving on through implementational and computational methods to take it all the way through",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2678.87,
    "end": 2696.89,
    "text": " from just standing on the shore of justified true belief, like we're gonna use frequentist statistics, we're gonna accept or reject binary hypotheses, and we're gonna have an epistemology that's based upon is this a justified true belief or is this not a justified true belief?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2698.071,
    "end": 2704.438,
    "text": "On through the continual Bayesian or meta-Bayesian updating",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2705.363,
    "end": 2734.341,
    "text": " with all that it entails in terms of probability densities and like agentic realities so do you think both of you do you think then when you kind of pick up the free energy principle and you pick up active inference and you pick up majeed's book is one of the should one of the takeaways be don't get stuck",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2735.485,
    "end": 2764.058,
    "text": " be able to sort of continually update, continue to be able to move back and forth, swing the pendulum and, and not find yourself getting in your own way or, or, you know, if you, if you decide that you want to pause for a moment, that's fine, but, but free energy principle, agency theory, pragmatism together, if you allow it, we'll create a virtuous vortex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2764.73,
    "end": 2779.245,
    "text": " I'm really curious about this because you can spend lots and lots of time sort of trying to figure out what the jargon is and what people are talking about, but isn't the lesson to take away, don't get stuck.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2782.28,
    "end": 2790.336,
    "text": " I think that is sort of pointed to, and Majeed, maybe you could expand on this, chapter three, Rolling Stones, simple and sophisticated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2790.376,
    "end": 2796.848,
    "text": "So other than the, of course, cultural reference, what does it mean that it's a Rolling Stone?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2796.908,
    "end": 2804.423,
    "text": "Why did you put it in the critical third position in the book to break it down that way?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2805.314,
    "end": 2806.095,
    "text": " All right, very well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2806.795,
    "end": 2820.487,
    "text": "I'm going to make a very small remark on the part of the book that you quoted earlier, and then I'm going to relate that to the Rolling Stones.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2822.629,
    "end": 2828.454,
    "text": "With regard to Rolling Stones, sometimes I think that I have some title in mind and I'm writing books and papers about them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2828.474,
    "end": 2835.0,
    "text": "But aside from that, let's return to the points that you mentioned earlier about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2834.98,
    "end": 2861.967,
    "text": " yeah uh truth value of counterfactual so we we usually let's just let's see that in this way and then i'm going to to explain the relation to pragmatism and the way that i see the situation and so uh there are causal claims causality claims claims about what causes what right so we already decided concept let us him that we consider that we don't have any uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2863.246,
    "end": 2867.351,
    "text": " any decisive answer about the question of what causes what.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2867.391,
    "end": 2871.555,
    "text": "We don't have any first-hand access to the causal structure of the universe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2872.096,
    "end": 2877.382,
    "text": "So we can decide that in a dogmatic way what is causing what.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2877.402,
    "end": 2889.895,
    "text": "So the best thing that we can do is to consider our evidence about what is causing what and then try to probabilistically work out our notion of the causal network of the events and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2889.915,
    "end": 2892.358,
    "text": "So seeing in that way,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2892.338,
    "end": 2905.015,
    "text": " having a notion of counterfactual relation between different things provides a very reliable",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2906.716,
    "end": 2929.669,
    "text": " source or resource for being able to make some evaluation of of the truth of causality claims so i'm i'm going to claim that for example if this active we didn't have this conversation in 2022 in this this active inference lab session i was not going to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2930.611,
    "end": 2945.802,
    "text": " write that chapter for example and this is a counterfactual play how would we be able to evaluate that some people would try to use sophisticated semantic tools such as possible words",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2945.782,
    "end": 2963.809,
    "text": " and then decide the truth value of these counterfactual claims on the basis of their truths in all other worlds that are similar to our own, then there would be a fascinating philosophical debate about the reality of this possible world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2964.249,
    "end": 2965.631,
    "text": "Are they just unreal?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2965.691,
    "end": 2971.059,
    "text": "And there's trade-off of intuition about the reality of this possible world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2971.099,
    "end": 2974.945,
    "text": "So what I'm suggesting here is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2974.925,
    "end": 2999.751,
    "text": " uh in my own opinion a more pragmatic dawn to earth solution to just try to evaluate the truth value of this counterfactual on the basis of factual information that we have about also as some sort of self-organizing systems that have representation of the future consequences of our actions or the or the consequences of future courses of action",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2999.731,
    "end": 3028.033,
    "text": " and evaluate them counterfactually so we have this cognitive faculty and this is what underlies our capacity to form counterfactuals and in order to be able to decide to justify the objectivity of the way that we decide the truth value of counterfactuals we don't need to necessarily get engaged in metaphysical debates about the reality of possible war but just take a closer look as how",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3028.013,
    "end": 3050.967,
    "text": " uh factual organism like ourselves are engaging in this kind of thing so from this perspective all that we need to pay attention to in order to be able to deal with sophisticated uh philosophical questions around us and this is the uh pragmatist layer of my work is to to to take a look at",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3050.947,
    "end": 3078.827,
    "text": " uh very simple or sometimes sophisticated objects and events around us such as rolling stones so uh we can learn so so the main point of the third chapter so this is in fourth chapter where i speak about modality and it builds on what i said earlier in the third chapter of the book about agency and how agents could be modeled and what's the difference between",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3081.524,
    "end": 3105.237,
    "text": " a simple rolling stone that just come down from as a physical as as a rock that just rolls down uh asleep or something and let's say a sophisticated agent which is the member of the band rolling stone so in the first case the action of the stone the action of the rock is simply determined by some",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3105.217,
    "end": 3131.393,
    "text": " uh external uh factors some external trajectories debate debate the angel the and so on with regard to the more sophisticated uh entity a self-organizing system that is capable of having some sort of intrinsic action uh the difference is in the way that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3131.609,
    "end": 3139.699,
    "text": " They are trying to... Actually, they don't try to... I mean, the simple rolling stones, the simple rocks don't try to do something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3139.719,
    "end": 3145.226,
    "text": "They are just subject to some extrinsic forces, what I'm trying to speak metaphorically here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3145.587,
    "end": 3152.155,
    "text": "So the difference is that in the first case, the rock just rolls down the slope or the valley.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3152.676,
    "end": 3156.34,
    "text": "The second one is capable of choosing its path.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3156.36,
    "end": 3160.806,
    "text": "And when we speak of choosing its path, then again,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3160.786,
    "end": 3174.795,
    "text": " uh we would be able to explicate that in terms of the free energy principle in terms of how this self-organizing systems can represent the future the consequences of their action and make decision on the base of data so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3176.007,
    "end": 3192.902,
    "text": " And the point that I tried to develop in the fourth chapter was just building on that to explain or ways of evaluating the truth value of counterfactual events on the basis of this cognitive capacity to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3192.882,
    "end": 3207.87,
    "text": " uh to choose amongst the uh diverse paths of action on the basis of one conception of their consequences so and and in my opinion it's a pragmatist and pragmatic",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3208.019,
    "end": 3224.374,
    "text": " approach to solving the question of evaluation of the truth of counterfactual claims, which are totally necessary for being able to justify the objectivity of the truth that we assign to causality claims.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3228.32,
    "end": 3249.687,
    "text": " awesome i can ask another question or dean do you want to give any comments on it no all right so one other part to touch upon in the book near the very end i won't spoil the ending but in section 8.5 on page 175 you talk about enculturation and ai so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3250.173,
    "end": 3257.261,
    "text": " Again, there's the whole section and there's the whole discussion, but how did you make the work timely and relevant?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3258.162,
    "end": 3269.235,
    "text": "And even in your own years of thinking about this and exploring these topics, how have you seen empirically the evolution in our generative landscape?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3269.696,
    "end": 3275.843,
    "text": "How did those changes play into how you thought about and positioned the end of the book there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3281.763,
    "end": 3282.704,
    "text": " Oh, you're muted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3286.408,
    "end": 3286.769,
    "text": "Very well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3287.289,
    "end": 3291.434,
    "text": "A part of it about artificial intelligence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3292.776,
    "end": 3295.279,
    "text": "The third chapter is about agency.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3295.319,
    "end": 3303.568,
    "text": "We usually think of agents as natural self-organizing systems like ourselves.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3304.105,
    "end": 3322.155,
    "text": " The project of the book was to go beyond intuition and try to articulate agency in scientifically plausible terms, in terms of making counterfactual, as I say, I repeated it so many times, I'm not going to do that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3323.657,
    "end": 3330.248,
    "text": "If this is the mark of agency, the ability to form counterfactual models of the outcomes of the action,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3330.228,
    "end": 3340.07,
    "text": " in order to choose the path of action that is compatible with my desires and expectations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3340.491,
    "end": 3347.005,
    "text": "So does it need to be a human thing only or could also artificial systems",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3347.153,
    "end": 3366.337,
    "text": " demonstrate some properties and capacities that are related to the capacity to form counterfactual models and choose the option between them that corresponds to their expectations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3366.517,
    "end": 3369.921,
    "text": "So I think that to some extent this is a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3371.504,
    "end": 3391.065,
    "text": " difficult question because then we have to consider what it means for an artificial system to have desires and expectations but then again what we know about desires and expectations in terms of free energy principle uh is basically specified in terms of the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3391.045,
    "end": 3421.052,
    "text": " uh the factors that eventually contribute to maximizing the chance of the serve so it goes back to existential imperative of free energy principle to speak about the factors that contribute to maximize the chance of the survival of the organism or the species of the that of which the organism is a representative and there is no reason to think that an artificial system",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3421.032,
    "end": 3442.146,
    "text": " cannot have some desires in the sense that there is no reason to think that an artificial system shouldn't be able to have expectations as to how to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3444.539,
    "end": 3460.793,
    "text": " increase the chance of its existence so uh i'm not claiming that the present day artificial intelligence systems are capable of doing that but i i know that you are familiar with this literature so the present",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3460.773,
    "end": 3477.313,
    "text": " artificial intelligence systems are basically specified by Princeton and colleagues as passive artificial intelligence system, they already started to think of active artificial intelligence systems as systems that are not",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3477.293,
    "end": 3506.085,
    "text": " just designed to be passive, to execute prompts that are fed to them by an external agent, but as artificial systems that are capable of evolving in a specific environment and form their own expectations of the environment in terms of models of the environment and in terms of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3507.955,
    "end": 3523.635,
    "text": " some prior beliefs about uh which which aspects of this environment contribute to increasing their chance of existence so assuming that there could be some sort of artificial intelligent sorry you wanted to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3525.775,
    "end": 3529.641,
    "text": " You wanted to say something, Daniel, I thought, no?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3529.701,
    "end": 3530.983,
    "text": "No, carry on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3531.704,
    "end": 3553.757,
    "text": "I think that seeing this from this perspective, to seeing the mark of agency as the capacity to form expectations about the consequences of action and pick up amongst them, it provides some basis for being able to also ascribe some level of agency to artificial intelligence systems",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3553.737,
    "end": 3581.23,
    "text": " and then i also see that in the context of scientific practice so human beings were supposed to be agents scientists so when we started to speak of scientists and philosophers in this talk we basically had human beings in mind but science is not an individual uh project science is to some extent a social institute in in the sense that what happens in science is a result of collaboration between",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3581.21,
    "end": 3605.344,
    "text": " different agents and assuming that these agents don't need to be only human beings, I think that considering artificial artifacts as agents that are capable of collaboration with human beings also has some ramifications for",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3606.488,
    "end": 3624.493,
    "text": " or conception of scientific practice as a social institute, as something that happens in the network of collaboration between different entities that are capable of engaging in intellectual practices.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3630.041,
    "end": 3630.581,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3630.601,
    "end": 3631.703,
    "text": "Dean, do you have any",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3633.607,
    "end": 3646.84,
    "text": " ways to take the only thing that I can say in my defense, I mean, if what I say is sometimes a bit incoherent is that I thought I write with far more clarity than I demonstrate in my speaking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3646.9,
    "end": 3650.043,
    "text": "We all do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3654.667,
    "end": 3659.532,
    "text": "Well, I'm not, I'm not your I'm not your agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3659.932,
    "end": 3661.133,
    "text": "But I am.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3661.298,
    "end": 3669.993,
    "text": " I am really impressed with what you were able to organize and cohere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3670.754,
    "end": 3684.859,
    "text": "My takeaway from all of this is lots of times we hear people express the desire to go beyond, and I appreciate that, but then there's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3685.649,
    "end": 3689.655,
    "text": " a small proportion of those people that have that desire that actually get beyond.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3689.995,
    "end": 3695.263,
    "text": "I think the nature of the project, it's your book now, it's your baby.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3698.247,
    "end": 3705.157,
    "text": "That ability to actually not just hope to get beyond, but actually do, depends on not getting stuck.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3706.359,
    "end": 3714.07,
    "text": "I'm kind of stuck on that idea of not remaining static, like keeping the active and the active inference going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3715.366,
    "end": 3721.653,
    "text": " I think that the book sets up a preparation space from which wayfinding can originate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3722.274,
    "end": 3725.097,
    "text": "Now, wayfinding is kind of my baby.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3725.157,
    "end": 3733.207,
    "text": "It's the whole navigation journey aspect of trying to figure out what's going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3734.028,
    "end": 3745.221,
    "text": "I think that this work is very complementary to the idea of agentic training, because I hold the two things up as being quite different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3745.724,
    "end": 3751.172,
    "text": " more biased towards the exploratory, whereas the other is more biased to the exploitive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3752.113,
    "end": 3770.398,
    "text": "And so my kind of last comment is this to both of you, like when I hold up or when I watch some of the stuff that Daniel's doing in the inference series, which I find fascinating, because I would say 80 to 90% of it goes completely over my",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3770.632,
    "end": 3772.794,
    "text": " I don't know exactly what's going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3773.195,
    "end": 3784.848,
    "text": "And I say that respectfully, because I do want to kind of figure out what's going on there, which is, I think, a lot of work that's done on the exploitive end of the continuum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3785.228,
    "end": 3800.385,
    "text": "And then I read what you were able to put together in terms of this book, which I think opens up the possibility of trying to get beyond not just wishing for it, but actually doing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3800.602,
    "end": 3822.793,
    "text": " I kind of wonder how like to the person who's not the originator of the book and not the originator of the inference series, how, how I can try and just want to learn how I can triangulate off both, like how I can put those two policy form formats into some sort of coherency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3823.093,
    "end": 3825.276,
    "text": "Cause I think together,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3825.762,
    "end": 3833.691,
    "text": " It would actually multiply the ability to sort of resolve a lot of these questions quicker.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3833.972,
    "end": 3836.194,
    "text": "Maybe it might leave things messy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3836.695,
    "end": 3847.888,
    "text": "It might be like racing on a downhill mountain bike, and that takes a certain amount of commitment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3848.223,
    "end": 3858.778,
    "text": " But I'd still like to be able to figure out some way to be able to put those two worlds together, the one that you're working through on the philosophical side and that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3860.32,
    "end": 3864.746,
    "text": "How do we explore this world in between and then the exploitive side?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3864.926,
    "end": 3872.577,
    "text": "What's already been put out there and how can we not take advantage of that at the same time?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3873.232,
    "end": 3878.88,
    "text": " So that kind of ties in with Daniel's pointing at the AI thing, because I don't want to be a Luddite.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3878.9,
    "end": 3883.127,
    "text": "I don't want to sort of run away from it because I don't get it right away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3883.708,
    "end": 3894.784,
    "text": "But at the same time, I do find that the barrier to entry part of this and trying to put those two worlds together, that's a pretty big wall to climb.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3895.844,
    "end": 3914.157,
    "text": " i'll give a short first thought and then majid you can you can give a sort of last last piece however you want to take it out so it it uh sort of resonated with thinking about the the learners paths learning paths and training paths and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3914.305,
    "end": 3925.482,
    "text": " On the ontological level, we could ask, like, how have advances in the natural sciences led to changes in the ways that we might want to scale in natural sciences?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3926.082,
    "end": 3940.043,
    "text": "Like, should we still be using the domains and journals and disciplines and textbooks and departments of the university or has complex adaptive system studies or other kinds of approaches",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3940.799,
    "end": 3966.672,
    "text": " helped evolve on on the ontological level what the topics are now let's put that aside and focus on the agentic epistemology and that's like well now seeing that just historically those departments were functioning in a frequentist justified true belief theory of science environment that was like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3967.006,
    "end": 3982.14,
    "text": " Majeed characterized as being about theories and with all of these kind of big topics underneath it and not that the departments caused the epistemology or vice versa, but it was part of a co-extant environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3982.921,
    "end": 3996.574,
    "text": "So what would be from a process perspective different in the learner's epistemology and how do increasingly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3996.622,
    "end": 4023.456,
    "text": " agentic learning resources in the learner's niche influence their path taking when it goes from being like I wonder if that book exists to okay the book exists in a library look up but how will I get it to here's the book to here's the custom generated book for me right now and that is getting more agentic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4023.723,
    "end": 4034.391,
    "text": " And so how does that change how we train and learn and skill as high-level investigators, like the kind who write synthetic books like Majeed?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4035.687,
    "end": 4057.307,
    "text": " But increasingly, all kinds of investigators and being able to dispatch these multi-scale inquiries, like doing a deep research search on perplexity or other services, it is dispatching nested sequences of agents in their inquiry, and that becomes part of your inquiry as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4060.679,
    "end": 4079.38,
    "text": " very well very very well i i think that i totally agree so uh look i think that this is a fine point for the final load so i'm going to make it like my also final statement so uh as organisms",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4079.512,
    "end": 4086.279,
    "text": " We like to keep the amount of our free energy low, the amount of our surprize are low.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4086.319,
    "end": 4088.281,
    "text": "So we do not like to get surprized.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4088.922,
    "end": 4098.251,
    "text": "And some people would say that the best way of doing that is to just stay in a cave and never leave the room because we wouldn't be surprised at all so far as we stay here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4098.832,
    "end": 4105.198,
    "text": "But on the other hand, and this is the exploitation part, just to stay in your environment, just exploit it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4105.178,
    "end": 4125.111,
    "text": " and there wouldn't be any surprise and I mean to a first approximation to the known initiated free energy principle might look like that but then again there is the exploration part and we don't just survive by by sitting in a room we need to go outside",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4125.091,
    "end": 4126.734,
    "text": " and try to explore.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4126.834,
    "end": 4135.228,
    "text": "On the other hand, just being a vendor and just going around doesn't contribute to our survival that much enough.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4135.268,
    "end": 4141.598,
    "text": "So the key is to strike the balance between the right amount of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4141.578,
    "end": 4169.172,
    "text": " exploitation the right amount of sitting in the room and the right amount of exploration and in order to be able to survive we need to be able to strike this balance i mean just not go around and spend all of your resources to explore new possibly non-existent resources and on the other hand don't just spend all of your time to uh sit in a seat in a small room i think that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4169.152,
    "end": 4187.042,
    "text": " It also, as a strategy, and I think that it is because we are basically formed in this fashion, we are shaped in this fashion, we are wired in this fashion, and there is no wonder that in other aspects of our life too, such as in our research,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4187.022,
    "end": 4196.518,
    "text": " our research would be maximally optimal if we could strike the balance between exploitation and exploration.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4196.538,
    "end": 4200.365,
    "text": "I think that in general it also applies to scientific progress.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4200.505,
    "end": 4209.3,
    "text": "To state that in terms of Thomas Kuhn's theory of a structural scientific revolution, there are of course paradigms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4209.719,
    "end": 4236.385,
    "text": " no that that that captured the normal science that is uh that's what's already there and it's it it gets orthodox i'm passionate about what science would waste away and die if we only stick to this kind of paradigms on the other hand there are luminaries visionaries that go out and and and speculate new possibilities and research them and sometimes they stumble on new things so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4237.681,
    "end": 4254.121,
    "text": " I think that if science could strike the balance between this exploitation being conservative enough and at the same time being innovative enough, there would have been copious amount of scientific progress, I suspect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4254.641,
    "end": 4266.996,
    "text": "And I only suspect that because I think that science is something that is done by scientists that are basically self-organizing systems that are in the business of striking the balance between exploitation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4266.976,
    "end": 4267.858,
    "text": " exploration.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4267.918,
    "end": 4287.533,
    "text": "Sometimes I wonder, as an academic, I wonder whether the present science has invested too much in the exploitation part and ignored exploration at the risk of being a bit",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4288.829,
    "end": 4300.965,
    "text": " I don't want to say stagnant or a bit too orthodox, but I think that if science could strike that balance, possibly things would have been more progressive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4301.384,
    "end": 4310.994,
    "text": " I think that possibly with these new changes, I mean, technological developments and so on, there should be some further changes in scientific institutes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4311.054,
    "end": 4317.321,
    "text": "No one knows in which direction it's going to spin, whether it will make the life of academics better or worse.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4317.361,
    "end": 4330.075,
    "text": "But I think that it will contribute to the distributed nature of science, make it even more distributed, make people to be able to access the information",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4330.713,
    "end": 4347.203,
    "text": " in a more collaborative manner and they would be able to collaborate more and more with progress of this kind of technologies in the same way that we could communicate and collaborate",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4347.183,
    "end": 4351.17,
    "text": " and possibly it would lead to development of new projects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4351.19,
    "end": 4359.384,
    "text": "So I'm not necessarily pessimistic, even though there might be reasons for being pessimistic about this new development, carrier-wise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4359.925,
    "end": 4365.715,
    "text": "I'm not that pessimistic with regard to scientific progress so far as",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4365.695,
    "end": 4383.355,
    "text": " It may bring about the chance of striking the balance between traditional conservative academic strategies and more brave exploratory new ways of finding the path of your research and intellectual progress.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4387.22,
    "end": 4387.8,
    "text": "That's perfect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4388.101,
    "end": 4388.361,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4390.366,
    "end": 4397.116,
    "text": " Thank you again, Majid, for the awesome book, for Dean, for the prep and the annotations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4397.938,
    "end": 4400.782,
    "text": "And let us look forward to discussing again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4402.424,
    "end": 4403.847,
    "text": "Thank you very much for inviting me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4404.027,
    "end": 4409.515,
    "text": "So thanks to you, this book is not a steel bone, which is a very, very good reason for me to celebrate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4409.876,
    "end": 4414.283,
    "text": "And thank you very, very much for your kind words and your attention and your grace.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4414.543,
    "end": 4417.488,
    "text": "And I thank our viewers for their attention too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4418.209,
    "end": 4419.09,
    "text": "Thank you, fellas.",
    "speaker": "SPEAKER_02"
  }
]