[
  {
    "start": 0.129,
    "end": 2.791,
    "text": " Introducing myself, I can go on at great length.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2.811,
    "end": 3.511,
    "text": "I'll try to be brief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4.452,
    "end": 5.252,
    "text": "I'm from New Zealand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5.392,
    "end": 6.533,
    "text": "That's why my English is weird.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7.353,
    "end": 11.676,
    "text": "I currently live in Italy, though, because I wanted to be connected to everything that's happening in Europe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 13.635,
    "end": 20.561,
    "text": " I studied engineering at university, so I've got that frame of reference of thinking in terms of systems and modular parts and how things plug together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 22.983,
    "end": 32.591,
    "text": "And in the last 10 years, I kind of drifted away from technology and that kind of innovation and got more interested in what you might call social technology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.751,
    "end": 39.677,
    "text": "So how do we organize people, what kind of systems support them to work together effectively",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 41.603,
    "end": 46.308,
    "text": " But with a different set of values than are usually applied in most organizations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 46.588,
    "end": 59.719,
    "text": "So instead of, for instance, prioritizing efficiency or quality or how quickly can we deliver stuff, I'm interested in some other values, which are more like, how do people develop as humans?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 60.36,
    "end": 62.101,
    "text": "How do we create relationships that really",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 63.007,
    "end": 64.028,
    "text": " make a difference in our lives?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 64.308,
    "end": 68.011,
    "text": "How do we pursue something that feels meaningful and has a positive impact?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 68.432,
    "end": 69.332,
    "text": "Those kind of values.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 69.352,
    "end": 73.776,
    "text": "And then what kind of organizational structures support those kind of outcomes?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 74.036,
    "end": 75.337,
    "text": "So that's my jam.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 76.078,
    "end": 77.539,
    "text": "I've done that in lots of different formats.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 77.579,
    "end": 83.684,
    "text": "So building a startup company, working in an entrepreneurial ecosystem, which is all self-managed with a couple of hundred people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 84.885,
    "end": 88.588,
    "text": "And now I do a lot of, I guess, designing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 89.764,
    "end": 95.405,
    "text": " general purpose community and organizational structures that can be reproduced in lots of different contexts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 97.91,
    "end": 99.65,
    "text": " Thanks for the intro.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 99.87,
    "end": 109.312,
    "text": "And I guess here on the slide, we have one of your ongoing projects, patterns for decentralized organizing, just every word in there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 109.392,
    "end": 110.032,
    "text": "It's pretty cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 110.072,
    "end": 119.414,
    "text": "It's like pattern languages and decentralization and organization, all topics that are important inside of Active Inference, as well as outside.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 120.234,
    "end": 126.495,
    "text": "And in this work, as well as in episode 51 on the Jim Rutt Show,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 127.335,
    "end": 132.517,
    "text": " you talked about this multi-scale view on social systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 133.157,
    "end": 141.68,
    "text": "So we're going to kind of structure this conversation along this ladder of nested systems or nested processes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 142.281,
    "end": 145.322,
    "text": "We might call them nested Markov blankets in Active Inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 145.602,
    "end": 154.725,
    "text": "So maybe could you go over this multi-scale nesting of social structures from the individual on up and why is it important to think about it that way?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 155.626,
    "end": 155.866,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 157.04,
    "end": 163.686,
    "text": " So this is a lens that you can put on to understand social physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 164.746,
    "end": 176.216,
    "text": "And it's not making any claims about defining reality or something like that, but it is a really useful lens to put on to like, what is going on in these group dynamics in this organization, in this community?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 177.605,
    "end": 179.126,
    "text": " So the smaller scale is the individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 179.646,
    "end": 186.809,
    "text": "And even at that scale, the one person, it's useful sometimes to think of a person as a group, to think about, I'm not just Richard.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 187.089,
    "end": 193.572,
    "text": "I am all of these different tendencies, all these different personalities, affordances, parts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 193.612,
    "end": 194.473,
    "text": "There's different parts of me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 194.933,
    "end": 199.135,
    "text": "Some of my parts are very enthusiastic and confident and bold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 199.535,
    "end": 202.076,
    "text": "Other parts are anxious and withdrawn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 202.096,
    "end": 204.077,
    "text": "There's like all these different tendencies going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 205.903,
    "end": 215.908,
    "text": " and it's interesting and useful to think about the metaphor between like there's a kind of parallel between the way that my parts are related to each other",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 216.969,
    "end": 219.53,
    "text": " and the way that I relate to other people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 220.19,
    "end": 224.791,
    "text": "So there's like a kind of internal relationship going on, which is a metaphor for the relationship that I have with you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 225.431,
    "end": 235.334,
    "text": "So if I am very constricted and defensive around, if I want to disown my anxious parts, if I want to pretend like I don't have anxiety,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 236.232,
    "end": 238.034,
    "text": " and just kind of like remove that whole part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 239.315,
    "end": 244.08,
    "text": "If you show up as my friend with anxiety, I'm going to be defensive against that too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 244.3,
    "end": 248.504,
    "text": "It's like, if I can't accept my anxiety, I'm not going to be able to accept yours.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 248.744,
    "end": 251.787,
    "text": "So this is a metaphor that's been really fruitful for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 252.788,
    "end": 252.928,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 254.791,
    "end": 279.568,
    "text": " i i kind of came across it through some amateur theorists and friends of mine just thinking about this way and then discovered that actually it's used in um therapeutic context so this thing transactional analysis internal family systems probably a few other systems that i don't know so well therapeutic modalities which which kind of treat the individual as a group and use that as a metaphor for getting insights into what's going on in a person's life",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 280.544,
    "end": 301.1,
    "text": " that's one that's one dimension and as i described that it sort of implies um the way of working that i'm interested in this more decentralized participatory collaborative shared power structures etc it seems to involve or require interior curiosity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 302.861,
    "end": 314.01,
    "text": " that all of the agents have to be curious about themselves and the impact that they're having and what are their motivations and values and drives and why did I get really upset when that happened?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 314.09,
    "end": 316.532,
    "text": "And those kinds of questions sort of have to be on the table.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 318.206,
    "end": 338.42,
    "text": " then the next scale is the dyad and a dyad is just two people and at this point i think it's really useful to pull in ryan eisler who's this amazing theorist author historian um and she has she's named this framework which i find really helpful which is the partnership domination spectrum",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 339.451,
    "end": 349.5,
    "text": " And it's a way of saying, like oversimplifying obviously all of history and all of human relationships and saying there's a spectrum in any relationship, which can be more like a domination or more like a partnership.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 349.52,
    "end": 353.703,
    "text": "So more partnership being we're different, but we're equal in some important way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 354.204,
    "end": 355.965,
    "text": "We've got different competencies that we bring together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 355.985,
    "end": 361.33,
    "text": "And a domination saying there's like a ranking system where one person has more power than the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 361.37,
    "end": 362.931,
    "text": "One person is kind of controlling the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 362.971,
    "end": 363.992,
    "text": "The other person is submitting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 364.957,
    "end": 371.482,
    "text": " And that in any interpersonal relationship, we can be anywhere on that spectrum from very partnerish to very domineering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 372.603,
    "end": 376.125,
    "text": "And not just at the interpersonal scale, but also at the very large scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 376.265,
    "end": 388.274,
    "text": "So in a lot of her work, she's described the connection between, for example, what's happening in Nazi Germany in the 30s and 40s and what's happening in German families at that time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 389.035,
    "end": 391.617,
    "text": "How do those two scales interact with each other?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 393.56,
    "end": 403.066,
    "text": " So the diet, let's assume you agree with my values, which is I'd like to live in a culture that has less domination, less submission, more partnership, more equity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 404.547,
    "end": 407.169,
    "text": "The diet is the first place really where we get to practice that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 407.849,
    "end": 412.132,
    "text": "To say, when I'm in a relationship with you, am I trying to assert dominance?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 413.533,
    "end": 415.193,
    "text": " Or can I find a different way to relate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 416.134,
    "end": 417.934,
    "text": "Do we always have to compete and make a ranking?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 418.174,
    "end": 427.056,
    "text": "Or can we find different ways of linking and making these multidimensional connections which are not so focused on who's the best and the strongest and the coolest and the fastest and the smartest?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 428.296,
    "end": 432.757,
    "text": "But just let's discover all of our unique competencies and see how they fit together in interesting ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 432.797,
    "end": 434.918,
    "text": "So that's a dyad scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 436.109,
    "end": 443.756,
    "text": " And if you think about a really great friend or a coach or a therapist or a partner, those are really crucial diets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 444.637,
    "end": 456.067,
    "text": "And if you're interested in growing and developing and maturing or evolving, I think a lot of that developmental work happens in a dyadic relationship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 456.367,
    "end": 458.549,
    "text": "I think there's often someone else there who's like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 459.082,
    "end": 486.543,
    "text": " know sometimes we say holding the space you know it's a very vague term but they're they're creating some kind of nurturing container for you to do your thing then the next scale up is called the crew and i use the word crew because i was thinking about a sailing ship you know it's a very active people have different roles um there's there's this expectation that we're different but we're also doing something together it's practical it's hands-on and a crew is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 488.456,
    "end": 510.266,
    "text": " small um i usually say it's the size of a dinner table conversation so like five people maybe and i think there's actually some good science on this now i was listening to a recent podcast with um robin dunbar and he says that five people can have one conversation because they can all model each other's perspective simultaneously and kind of hold a shared state",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 511.292,
    "end": 514.634,
    "text": " And our brains can kind of natively manage that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 515.014,
    "end": 517.775,
    "text": "But six or seven people, they just can't hold everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 518.095,
    "end": 522.217,
    "text": "All the different combinations of that gets too much complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 522.237,
    "end": 526.079,
    "text": "And so you'll notice this if you're having a conversation with five people and then two others show up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 527.197,
    "end": 529.738,
    "text": " the conversation will split into multiple sub conversations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 529.798,
    "end": 531.718,
    "text": "It just completely natural happens all the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 532.359,
    "end": 540.621,
    "text": "So the point of focusing on the crew scale is saying there's something that we can do with a group of four or five people that we can't do with 11.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 542.422,
    "end": 543.082,
    "text": "We can't do with 17.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 544.622,
    "end": 566.493,
    "text": " can't do it too you know there's there's unique affordances and competencies for that group for that size and and and a big part of what i'm doing with this framework that we call micro solidarity is trying to train people in a literacy of scales and understand there's an articulation at each of these different scales um the groups are good for different things",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 567.572,
    "end": 596.403,
    "text": " know um if if you want to have an intimate conversation probably a couple of people but if you want to have like a dance party you're going to need more you know it's like we can do different stuff with different groups um and and the crew is like when people are starting up in micro solidarity practice the crew will often be a space for peer support belonging connection um you know maybe you take a course together and they're your buddies that you're thinking through this new information",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 598.867,
    "end": 600.048,
    "text": " It's kind of about connecting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 600.749,
    "end": 615.422,
    "text": "And then once those connections are established, then it might evolve to the next stage, which is much more about action, getting stuff done, having some kind of shared investment, collaborating on projects that really mean a lot to you, starting companies, that sort of activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 616.809,
    "end": 619.151,
    "text": " And so then the question is, how do you find your crewmates?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 619.591,
    "end": 621.332,
    "text": "Because you don't have chemistry with everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 621.472,
    "end": 622.813,
    "text": "We don't all fit together with everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 623.594,
    "end": 625.115,
    "text": "And that's what I call the congregation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 625.295,
    "end": 625.955,
    "text": "That's what that's for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 625.975,
    "end": 633.2,
    "text": "So the congregation could be 30 people, but I capped it around 150 or 200 people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 633.88,
    "end": 642.626,
    "text": "So a group that's big enough to have some diversity, but small enough that there's no strangers there, that everyone has some sense of who everyone else is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 642.786,
    "end": 646.529,
    "text": "They might not be super close, but we're on first name basis with everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 647.469,
    "end": 650.431,
    "text": " And it's called a congregation because you congregate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 650.631,
    "end": 657.896,
    "text": "That's the main thing that happens is these occasional gatherings where people come together and you get to meet all these other people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 658.276,
    "end": 660.558,
    "text": "And it's like a dating pool where you can find your crewmate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 661.978,
    "end": 663.499,
    "text": "And this could be a conference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 663.559,
    "end": 664.48,
    "text": "It could be a retreat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 664.52,
    "end": 667.202,
    "text": "It could be a summer holiday.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 667.222,
    "end": 668.743,
    "text": "There's lots of different ways of doing this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 670.884,
    "end": 673.766,
    "text": "But again, there's the scale factor where we say,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 674.704,
    "end": 683.969,
    "text": " there's a boundary here around 150 people maximum, because again, there's some things you can do with a group of that scale that you can't do with a group of 500.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 685.05,
    "end": 691.374,
    "text": "And especially if you're doing governance, you can govern a group of 150 people basically with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 692.318,
    "end": 698.021,
    "text": " dialogue, trust, mutual exchange of who is this person?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 698.041,
    "end": 698.842,
    "text": "What do they care about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 700.083,
    "end": 705.566,
    "text": "We can have good enough rough models of each other and then maybe articulate a few agreements or a few principles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 705.586,
    "end": 708.908,
    "text": "And that's kind of enough to keep the system coherent and organized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 710.041,
    "end": 712.846,
    "text": " You don't need a whole complex bureaucracy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 712.866,
    "end": 714.588,
    "text": "You don't need a lot of checks and balances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 714.608,
    "end": 721.478,
    "text": "You don't need some kind of legislation system or a police service or any of that sort of stuff, which you do as you get into the larger scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 721.518,
    "end": 725.985,
    "text": "So it's saying, let's draw a boundary and say, there's a kind of efficiency that happens at that scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 727.082,
    "end": 732.403,
    "text": " And then in my framework, at least for now, anything bigger than 150 people is what I call a crowd.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 733.223,
    "end": 738.204,
    "text": "Because once you get beyond that scale, you can just assume that most people are going to be strangers to each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 738.924,
    "end": 749.346,
    "text": "So you might, for example, go to a festival or a conference with 5,000 people, and you might feel some sense of imagined community, some sense of like, these are my people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 751.247,
    "end": 756.608,
    "text": "And that can actually be a little bit confusing because it feels like they're your community.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 757.478,
    "end": 761.319,
    "text": " you don't actually have enough mutual knowledge of each other that you can do stuff, you know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 761.359,
    "end": 773.942,
    "text": "So like if you, if you don't show up one day because you're sick or there's some dramatic thing happening in your family, you can't really count on those people to look out for you because there's, there's just a lack of visibility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 773.962,
    "end": 776.362,
    "text": "You know, there's just too many, too many relationships to track.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 776.983,
    "end": 781.644,
    "text": "And so I just put everything from 150 up to 8 million in the box called crowd.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 781.964,
    "end": 786.925,
    "text": "And it's kind of like, that's a, that's a problem for someone else to solve when I'm focused on the small scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 789.841,
    "end": 793.065,
    "text": " Thanks for the overview and there's many",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 794.406,
    "end": 798.71,
    "text": " multi-scale systems and active inference ideas that we'll return to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 798.77,
    "end": 810.32,
    "text": "And I think how those different levels of organizations play out in the past, present, and future of science and research and in other domains, I think we'll return to that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 810.58,
    "end": 813.463,
    "text": "But let's go to relationship first.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 814.464,
    "end": 820.189,
    "text": "So here, just to sort of bring the active inference into play, is a figure from our",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 821.91,
    "end": 839.365,
    "text": " uh 2020 paper on active inference and online teams and online organization so active inference as the name suggests is about action and inference it's about how perception in the context of a generative model of the individual",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 840.427,
    "end": 842.149,
    "text": " translates into action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 842.95,
    "end": 845.053,
    "text": "And here we have two teammates.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 845.073,
    "end": 849.658,
    "text": "So this is really getting at that minimal relationship, the minimal dyad.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 850.479,
    "end": 858.489,
    "text": "And each teammate is perceiving the digital information, that's their shared informational niche.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 859.17,
    "end": 866.056,
    "text": " And then they're each perceiving it, uniquely unpacking it in light of their own experiences, and then acting, and that's modifying the niche.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 866.136,
    "end": 870.379,
    "text": "So this is like two people on a video chat or editing a shared document.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 871.06,
    "end": 882.73,
    "text": "And this is sort of an overview that is reminiscent of many other perception action loops, although in active inference, there's a lot more math and technical details that underlie it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 883.43,
    "end": 883.57,
    "text": "So...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 884.574,
    "end": 901.8,
    "text": " How do we design for healthy interactions and multi-scale resilience, especially online, knowing that there's so many degrees of freedom and so many ways to just each little point and interface in this diagram, how do we know how to design what works?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 904.241,
    "end": 904.901,
    "text": "This is so great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 904.941,
    "end": 912.324,
    "text": "I love looking at this diagram and just doing the translation between the cybernetics and what I'm into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 914.898,
    "end": 918.985,
    "text": " I mean, what first comes to mind looking at this diagram is the two speech bubbles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 921.73,
    "end": 925.738,
    "text": "As they come closer together, like in common parlance, we call it intimacy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 927.168,
    "end": 944.36,
    "text": " I think like when we get closer and closer in our shared context where I can trust that I know you and you know me and that we actually do have shared understanding that when I'm saying something, you've got more or less the same picture in mind as what I've got.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 944.6,
    "end": 945.241,
    "text": "That's intimacy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 945.261,
    "end": 952.446,
    "text": "And that's this very, I mean, the idea of like, how do you engineer intimacy is a very clumsy concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 952.486,
    "end": 955.668,
    "text": "You know, it's a very unfamiliar concept, but that's a lot of what we're doing, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 957.405,
    "end": 962.286,
    "text": " Another thing that comes to mind looking at this diagram is you've got the thought bubble of perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 962.306,
    "end": 969.148,
    "text": "Of course, the perception includes the other person, and it also includes your imagination of what the other person is thinking about you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 970.488,
    "end": 972.728,
    "text": "And I mentioned interior curiosity, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 972.748,
    "end": 984.471,
    "text": "This is all part of the whole system of when people are starting out in this way of working, in this participatory, collaborative, shared way of working,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 985.436,
    "end": 992.862,
    "text": " One of the things that often needs to be developed is self-awareness, meaning, do I know what impact I'm having on the group?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 994.463,
    "end": 999.927,
    "text": "So it's not just me broadcasting, like, I've got these things to say and I just show up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1000.007,
    "end": 1002.129,
    "text": "It's also kind of tracking what's my impact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1002.889,
    "end": 1004.05,
    "text": "How do other people perceive me?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1005.491,
    "end": 1008.173,
    "text": "And does my self-perception match their perception?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1008.193,
    "end": 1009.975,
    "text": "And there's always a gap there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1010.055,
    "end": 1010.976,
    "text": "What do I do about that gap?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1011.036,
    "end": 1013.798,
    "text": "And how do I bring those two things closer into alignment?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1014.608,
    "end": 1017.011,
    "text": " And again, in my experience, that happens in relationship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1017.051,
    "end": 1018.913,
    "text": "That's not something you can really do on your own.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1019.594,
    "end": 1020.715,
    "text": "Maybe some people know how to do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1020.775,
    "end": 1024.119,
    "text": "I certainly don't know how to cultivate a great deal of self-awareness on my own.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1024.179,
    "end": 1029.305,
    "text": "It's always in these feedback loops with other people that are helping me to tune in my self-evaluation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1031.688,
    "end": 1039.531,
    "text": " So there's some very concrete, practical stuff you can do to improve self-awareness in relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1040.191,
    "end": 1052.636,
    "text": "And that can be like, sometimes it almost sounds maybe naive or childish or something, but often we'll start with a very concrete, what we call listen and loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1053.056,
    "end": 1058.298,
    "text": "So I'll share something and you'll reflect back to me what you heard as close as you can track it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1059.488,
    "end": 1069.476,
    "text": " And then maybe the next look would be, I'll share something and then you'll share what you heard was important to me, some kind of interpretation or some kind of abstraction of what you heard.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1069.956,
    "end": 1076.661,
    "text": "And we're really, as I hear what you're saying back to me, I realize, ah, that is what I said, but it's not what I meant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1076.942,
    "end": 1078.363,
    "text": "And I need to add this extra information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1078.643,
    "end": 1080.885,
    "text": "And there's this tuning process that's going on between us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1081.565,
    "end": 1108.999,
    "text": " so we do a lot of that a lot of really intentional like here's a process do this then do this then you know five minutes of this person sharing and then three minutes of this person repeating back and we kind of drive people through these very um defined choreographies and that very quickly helps people to see oh when i'm communicating people are not tracking what i'm saying you know the thing the reflection i'm getting back doesn't actually feel very close to the picture i had in my head",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1109.94,
    "end": 1114.557,
    "text": " uh and it helps you um tune that and basically learn how to communicate more effectively",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1116.823,
    "end": 1142.75,
    "text": " so in active inference we talk a lot about having a shared generative model and there's another figure where narrative is playing the role of a shared generative model and that concept of thinking through other minds which is like our cognition is intrinsically about others world models as well as it including their model of us so these are all um important",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1143.59,
    "end": 1152.26,
    "text": " topics and things that again we kind of have the space at the high level mapped out the possibilities are there",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1153.283,
    "end": 1178.009,
    "text": " in the formalism and then which islands of parameter combinations actually lead to the kind of positive social relationships that we want to foster that's the empirical question and then also to connect that to the interior curiosity so the way that policy selection or basically behavioral selection works in active inference is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1178.849,
    "end": 1183.554,
    "text": " it's always a combination of the pragmatic and the epistemic value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1183.874,
    "end": 1185.176,
    "text": "So like, what is the utility?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1185.616,
    "end": 1187.999,
    "text": "What is the external motivation of this action?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1188.599,
    "end": 1190.902,
    "text": "And then what information do I gain?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1191.022,
    "end": 1196.327,
    "text": "What is the knowledge gain or the intrinsic motivation of the action?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1196.908,
    "end": 1199.41,
    "text": "And then just like you said, with the choreography,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1200.071,
    "end": 1224.446,
    "text": " like contact improv that's at the physical level there's sequences of actions that dyads can participate in over the hour over the month over their lifetime so that they can learn how to have a better joint model of inference and action so that they can do the tango better or so that they can do some sort of physical operation better choreography that we see in the operating theater and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1225.166,
    "end": 1228.709,
    "text": " And then we take it into the realm of symbolic communication.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1229.269,
    "end": 1239.858,
    "text": "And so it's easy to see when your hands don't match or you look at the video, you look at the golf swing, but then in communication, it's a little bit of a less tangible space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1240.378,
    "end": 1246.683,
    "text": "And so it's really important to have these kinds of practices that help us calibrate our meaning transmission.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1248.918,
    "end": 1249.759,
    "text": " I want to add on this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1249.999,
    "end": 1251.639,
    "text": "You're getting my brain going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1252.039,
    "end": 1258.381,
    "text": "So I just talked about the dyad scale, but obviously I'm always passing it through other scales and seeing how do we play there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1258.441,
    "end": 1267.003,
    "text": "So at the crew scale, what we discover is that in any group, you will have a unique contribution to make to that group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1267.543,
    "end": 1268.623,
    "text": "You'll be the best at something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1268.663,
    "end": 1270.744,
    "text": "You'll be the most ready for something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1270.784,
    "end": 1271.724,
    "text": "And you don't know what that is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1272.344,
    "end": 1273.204,
    "text": "People don't know what that is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1273.224,
    "end": 1275.125,
    "text": "They discover it through the reflections of others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1275.345,
    "end": 1275.705,
    "text": "So that's...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1278.322,
    "end": 1279.543,
    "text": " That's a beautiful process, actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1279.803,
    "end": 1286.966,
    "text": "But in the larger scale, when you get up to 30 people or 50 people, there's something incredible that happened to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1287.626,
    "end": 1301.231,
    "text": "My whole process in this accelerated hugely through my involvement in the Occupy Wall Street movement, where we were doing a lot of consensus decision making with 30 to 50 people sitting in circles day after day after day after day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1302.252,
    "end": 1303.252,
    "text": "And what was happening there was",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1306.036,
    "end": 1334.125,
    "text": " know we had a camp and we were trying to organize our camp and people needed a place to stay and to eat food and then the media would show up and have to talk to the media like there's all these decisions that need to be made as a community and we've decided we're going to do it by consensus which means someone brings a problem or a proposal or a need and we're literally sitting around in a circle and it's as if as you hear from all the different people you're just adding more and more perspectives like these little glimpses into truth that i can't see on my own",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1335.285,
    "end": 1342.509,
    "text": " but with the right kind of group process and listening and like, there's a ways of assembling all of that knowledge into like a three-dimensional picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1343.39,
    "end": 1348.653,
    "text": "And actually it's like a 50 dimensional picture when you've got 50 different people with their own different models and experiences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1348.853,
    "end": 1359.26,
    "text": "And, and I got so motivated by that because it was obvious that the collective intelligence, when the conditions are right, the collective intelligence is so much superior to any individual intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1359.5,
    "end": 1364.223,
    "text": "Like the group with the right process, the group is always going to be the smartest person in the room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1365.697,
    "end": 1376.891,
    "text": " And that is so motivating because once you see the brilliance of the intelligence and the creativity and the joy of it, there's so much enthusiasm that gets kicked off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1376.931,
    "end": 1378.333,
    "text": "It's like, oh, I want to be part of this thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1379.437,
    "end": 1396.895,
    "text": " And now me as an individual, coming back to the individual scale, I often get feedback from people saying that, like in my blog post, for example, that people value the way that I articulate complex things in simple ways, the way that I can put into language experiences they've had, but they've never quite known how to articulate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1398.004,
    "end": 1400.626,
    "text": " And the reason I can do that is because of all of that consensus practice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1401.126,
    "end": 1416.835,
    "text": "It's because I've brought proposals and had them disagreed with and challenged from all these different perspectives and learned through many iterative loops, how do I communicate in a way that many different people with all of their different ideological baggage are going to be able to listen and recognize the thing that I'm talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1418.216,
    "end": 1425.826,
    "text": " And that's now one of my favorite skills that I get to bring to the group is like, oh, I know how to articulate stuff without alienating people along the way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1426.246,
    "end": 1429.871,
    "text": "And so it's like we're going up and down the scale all the time with this developmental process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1431.866,
    "end": 1432.206,
    "text": " Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1432.567,
    "end": 1440.554,
    "text": "So you mentioned the person as a group and the organism is involved in unified action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1440.934,
    "end": 1445.038,
    "text": "So if one leg's walking backwards, one's walking forward, you're just going to rip in half.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1445.098,
    "end": 1446.8,
    "text": "So we're involved in unified action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1446.84,
    "end": 1449.442,
    "text": "That's when the individual is acting as an individual and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1449.922,
    "end": 1459.931,
    "text": " And consensus governance is a protocol for generating unified action, not necessarily unified inference, because you can have consensus.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1459.991,
    "end": 1463.514,
    "text": "It's like, yes, I consent that our co-op will buy almond milk.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1464.486,
    "end": 1486.478,
    "text": " have a different take on that than somebody who needs to buy it for a health reason but that's okay we have a different unpacking we have a different perception but we're involved in shared action and so that's a very um key point that consensus allows us to have groups act as individuals but not necessarily in thought indeed",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1487.663,
    "end": 1491.385,
    "text": " and that that may not scale to all levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1491.565,
    "end": 1498.148,
    "text": "If one veto can take down a whole congregation's actions, that's a very different question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1498.188,
    "end": 1504.631,
    "text": "So how do governance mechanisms change across scales is definitely something you've brought up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1505.391,
    "end": 1506.072,
    "text": "Let's go to this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1506.092,
    "end": 1512.215,
    "text": "Do you want to add anything or we can go to- Yeah, one thing on this organism, like this is really animating me at the moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1514.175,
    "end": 1514.936,
    "text": "So in your body,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1516.656,
    "end": 1521.4,
    "text": " It's clear, like if I need to mute the microphone because there's a noise going on, I just need to move one finger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1522.882,
    "end": 1523.062,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1523.122,
    "end": 1525.564,
    "text": "That's the action here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1526.325,
    "end": 1529.528,
    "text": "If I need to pick up my water bottle, that kind of takes my whole arm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1529.588,
    "end": 1530.929,
    "text": "It's got to have this coordinated action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1531.51,
    "end": 1533.291,
    "text": "And let's say then I need to go to the bathroom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1533.311,
    "end": 1536.054,
    "text": "Well, I'm going to have to move my entire body and it's going to have to move as a whole.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1536.814,
    "end": 1542.56,
    "text": "And this is where consensus kind of breaks down is because it usually treats the group as a single limb.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1543.612,
    "end": 1549.513,
    "text": " And what we need is the articulation to be like, there's some things that are like go to the bathroom where you need to move the whole group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1549.913,
    "end": 1558.495,
    "text": "But there's lots of things that are more like switching off the microphone or taking a drink where a much smaller subgroup is the appropriate site for the decision making to happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1559.115,
    "end": 1567.177,
    "text": "And it's really difficult if you're used to doing everything with the full group to then break off into small groups, so that triggering a whole bunch of conflict and alarm bells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1568.137,
    "end": 1570.379,
    "text": " And that's basically what I'm trying to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1570.439,
    "end": 1578.968,
    "text": "Like the very biggest picture of what's going on in the world, how do we pull through with climate change and inequality in society and all these things that are going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1580.15,
    "end": 1588.138,
    "text": "I think what we need is the ability to articulate different scales of coordination, something like climate change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1588.158,
    "end": 1589.8,
    "text": "We need the whole global body to move.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1591.147,
    "end": 1595.71,
    "text": " And there's some things that are happening in my neighborhood where we just need the wrist and the fingers, you know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1596.531,
    "end": 1601.134,
    "text": "And we need to have, in order to be able to do that, we need to be able to address these different groups at different scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1601.935,
    "end": 1611.922,
    "text": "And that means we need to have like a nested collective identity that goes all the way from me and my family and my flat and my building and my street, you know, that kind of way of having an address.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1612.643,
    "end": 1614.464,
    "text": "It needs to go all the way up to the global scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1614.484,
    "end": 1617.146,
    "text": "I need to be able to sort of identify who am I",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1618.302,
    "end": 1620.524,
    "text": " globally, who am I in this bioregion?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1621.524,
    "end": 1631.192,
    "text": "And working at the small scale of at least let's track the self, the crew and the congregation, there's three scales at least, can we get the competency and the literacy there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1631.212,
    "end": 1637.797,
    "text": "And maybe that will equip us to be more familiar and coherent and literate at the larger scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1637.917,
    "end": 1638.998,
    "text": "That's kind of the big project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1641.917,
    "end": 1668.631,
    "text": " okay very cool and just thinking about like a active inference lab or the field we have individuals who have buddies in the lab we have crews that work on specific projects the organizational unit is more verging towards the congregation there's people who are on non-overlapping projects and then a field is like a crowd people check in and leave to scientific fields all the time and no one",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1669.591,
    "end": 1690.732,
    "text": " knows or cares all the time so it's like a music festival like you brought up earlier so let's continue our walk up the ladder although i suspect that we're going to close the loop so um there's a few topics here and and uh dean um and i spoke yesterday so it was a good convo and we got a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1694.07,
    "end": 1697.312,
    "text": " First let's think about this crew and congregation levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1698.272,
    "end": 1704.595,
    "text": "This idea of a threshold model for collective action and the way that's related to skin in the game.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1705.095,
    "end": 1721.023,
    "text": "So previously I studied foraging regulation in ants and we used threshold models for ant decision-making and they quite literally have exoskeleton in the game when they forage as nest mates and the colony has",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1721.983,
    "end": 1723.643,
    "text": " foragers on the line when they send them out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1724.303,
    "end": 1731.645,
    "text": "And then it's like they take the model from neuroscience with neural activation and we apply it to the behavior of a different system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1731.765,
    "end": 1739.046,
    "text": "And then here we're thinking about threshold behavior in human systems and collective action across scales.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1739.246,
    "end": 1744.167,
    "text": "So where does threshold modeling come into play for group decision-making in people?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1745.848,
    "end": 1746.328,
    "text": "So good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1746.628,
    "end": 1747.608,
    "text": "No one's asked me that before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1750.148,
    "end": 1751.849,
    "text": " I hope I understand the question well enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1751.929,
    "end": 1752.349,
    "text": "I'll try.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1754.05,
    "end": 1762.333,
    "text": "One thing that was really striking to me in the first, so I'm in Italy, which is the first kind of Western country to have to deal with the COVID pandemic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1764.514,
    "end": 1773.058,
    "text": "And then there was kind of maybe a month, you know, time's dilated, but I think it was a month or two where COVID was very active in Europe, but it hadn't arrived in the States yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1774.158,
    "end": 1778.06,
    "text": "And then there was this moment as it was kind of, people were realizing the seriousness of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1779.193,
    "end": 1782.676,
    "text": " And people in the States weren't dealing with it yet, but they were awake to the threat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1783.117,
    "end": 1788.842,
    "text": "There's this couple of weeks window of opportunity where I'm quite active on Twitter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1788.862,
    "end": 1792.405,
    "text": "I do a lot of connecting with people there and thinking out loud there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1793.205,
    "end": 1799.15,
    "text": "And it felt like the entire network of Twitter was all focused on the one topic of there's a pandemic coming.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1800.071,
    "end": 1801.032,
    "text": "How do we get prepared?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1802.153,
    "end": 1802.934,
    "text": "What's the truth?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1804.175,
    "end": 1804.755,
    "text": "What do we know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1804.815,
    "end": 1805.596,
    "text": "What do we don't know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1806.237,
    "end": 1806.557,
    "text": "All of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1808.399,
    "end": 1813.822,
    "text": " And because everyone had skin in the game, it was such a good conversation that I was connecting into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1813.942,
    "end": 1817.164,
    "text": "It was such high quality decision-making and feedback.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1817.204,
    "end": 1819.685,
    "text": "And, hey, we discovered this, and this is a model that you can use.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1819.745,
    "end": 1823.067,
    "text": "And did you realize that this whole thing is corrupt?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1823.107,
    "end": 1829.49,
    "text": "And all of this was happening very, very rapidly and very efficiently because everyone was really, they had skin in the game because they were thinking about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1829.85,
    "end": 1854.774,
    "text": " my family is at risk here how do i keep them safe it was very meaningful to find this connection between the global pandemic and the very local immediate the choices that i make maybe the difference between life and death for the people i care about and that was the the most uh coherent and high quality exchange i've ever seen on twitter at that scale now most people don't experience twitter that way most of the time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1856.557,
    "end": 1866.159,
    "text": " Usually people experience Twitter as a much more polarized, you know, there's a lot of in-groups and out-groups and kind of battles around these political ideologies and culture wars and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1866.98,
    "end": 1884.424,
    "text": "And I think a lot of that is about this lack of skin in the game to a degree or this confusion about skin in the game where there's a mismatch between my sphere of influence and my sphere of awareness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1885.598,
    "end": 1898.466,
    "text": " So the last few decades of information technology have expanded my sphere of awareness to a global level where I can be aware of this horrible atrocity that just happened in this small country that I'd never heard of until yesterday.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1900.595,
    "end": 1908.818,
    "text": " But my sphere of influence, while it has grown, like we've got all of these extra capabilities because of the internet, it hasn't grown nearly as far as my sphere of awareness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1908.958,
    "end": 1917.8,
    "text": "So I think I'm continuously absorbed by all of the stuff that's happening and I've got all of this stimulation coming in, but my impact is still relatively small.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1917.86,
    "end": 1918.981,
    "text": "It's much smaller than global.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1919.001,
    "end": 1922.862,
    "text": "I can't do anything about that atrocity that's happening in that small country I've never heard of before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1923.542,
    "end": 1951.326,
    "text": " even though i can feel a lot of stress and like it's really important to me and i've got something to say on the topic and so that is part of what i think we're seeing happen on twitter is if someone is not really clear on their own agency like what impact can i have what decisions are up to me where's my autonomy how do i how do i achieve things in the world how do i do action that's effective",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1952.188,
    "end": 1977.701,
    "text": " just as an individual but with a committed crew of people that are doing it with me or with a neighborhood or a community of people that are doing it with me if you don't have that experience of agency and autonomy at those smaller scales it's very easy to just kind of get distracted by the global scale and have an opinion about everything and make everything into a big drama and debate and organize yourself into these polarized camps and say i'm on the good team and everyone else bad team it's really easy to just kind of slip into that um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1979.898,
    "end": 1982.3,
    "text": " And you're not achieving anything a lot of the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1982.74,
    "end": 1985.902,
    "text": "It's like this feeling of participation without actually any impact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1986.742,
    "end": 2003.393,
    "text": "And once you get activated, once you discover your own agency, once you discover a few committed citizens who are going to change the world with you, once you have a company or a crew or whatever, then suddenly you realize, okay, this is what I can achieve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2003.953,
    "end": 2004.914,
    "text": "This is what's realistic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2005.074,
    "end": 2007.896,
    "text": "I can change the consumption habits of my neighborhood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2008.136,
    "end": 2008.977,
    "text": "That's something I can do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2009.918,
    "end": 2014.54,
    "text": " I can't change the whole global economy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2014.6,
    "end": 2017.281,
    "text": "That's not really within my sphere of influence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2017.701,
    "end": 2023.923,
    "text": "And so I'm going to spend more of my time focusing my intelligence and my energy on the stuff that I can make a difference on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2025.063,
    "end": 2029.225,
    "text": "And that's another part of the project here is to get people activated into their agency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2029.245,
    "end": 2034.347,
    "text": "And once they do that, they focus on the stuff where there's skin in the game and have a bit more",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2035.458,
    "end": 2041.965,
    "text": " I don't know if it's like humility or modesty or something, or a little bit more of like, hmm, I don't actually know what to do with the global scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2042.706,
    "end": 2049.194,
    "text": "I'm going to relax a little bit on my intense opinions about how I know what's the right thing to do and just focus on where I can have a meaningful impact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2051.343,
    "end": 2051.884,
    "text": " Very cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2052.224,
    "end": 2070.38,
    "text": "So one key difference between active inference and a lot of reward centric frameworks is that in contrast to thinking that the maximization of reward is the imperative for action, we frame the reduction of uncertainty as the imperative for action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2070.56,
    "end": 2075.125,
    "text": "So we can update our models, that's learning, or we can act to reduce our uncertainty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2075.705,
    "end": 2077.667,
    "text": "And that's what motivates behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2078.507,
    "end": 2085.35,
    "text": " And it has that pragmatic component, which is like utility or reward, but it's not just simply reinforcement or reward learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2086.17,
    "end": 2089.052,
    "text": "So we can connect that to what you were saying.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2089.472,
    "end": 2092.493,
    "text": "There is so much uncertainty in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2092.593,
    "end": 2094.694,
    "text": "There's things we just simply don't know about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2094.734,
    "end": 2095.914,
    "text": "We don't know we don't know about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2096.555,
    "end": 2106.179,
    "text": "And now that recently we have been able to have our sphere of awareness expand to the global or even the intergalactic scale,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2107.165,
    "end": 2109.888,
    "text": " that breeds uncertainty of action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2110.608,
    "end": 2115.834,
    "text": "And so there is that overlap between our sphere of influence and our sphere of action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2116.835,
    "end": 2124.002,
    "text": "And we can think about how can we reduce uncertainty if only to reduce our anxiety or anxiety",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2124.926,
    "end": 2132.072,
    "text": " feelings of negative valence, but actually to be more effective as well locally in our local situation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2132.132,
    "end": 2137.897,
    "text": "We can reduce our uncertainty about the volatility of the housing conditions locally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2138.497,
    "end": 2148.906,
    "text": "And then also that aligns us with just other people who we then actually in a bottom-up way start to be able to do more and more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2149.307,
    "end": 2152.649,
    "text": "People start connecting, bringing their perspectives and skills together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2153.43,
    "end": 2161.553,
    "text": " the awareness and the capacity for action is increasing because you entered at the level of individual agency.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2161.933,
    "end": 2176.439,
    "text": "So that's a very important step that when we activate, we are also starting to build from the bottom up rather than just looking at how high the mountaintop could be or looking at how many mountaintops there are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2176.479,
    "end": 2178.38,
    "text": "There must be infinite ways to get there as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2180.481,
    "end": 2182.802,
    "text": " I want to riff on this uncertainty thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2182.862,
    "end": 2183.503,
    "text": "I've never heard of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2183.523,
    "end": 2184.703,
    "text": "It's a really cool way to think about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2186.384,
    "end": 2192.187,
    "text": "So we talked about how the sphere of awareness is growing, and we kind of have been using these spatial metaphors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2193.608,
    "end": 2195.329,
    "text": "But it's not just that there's more coming in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2195.569,
    "end": 2197.75,
    "text": "It's also that there's more incoherence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2198.03,
    "end": 2206.255,
    "text": "So we used to have this thing called the six o'clock news, and you would turn it on, and it would say, these are the things that happened today that are important for you to know about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2206.935,
    "end": 2232.789,
    "text": " and everyone was referring back to the same six o'clock news and then they'd go to work in the next morning and they'd have opinions they might disagree but they were all referring to a shared baseline and the other thing that's happened with the internet is that we don't have six o'clock news we have all the time news and it's coming from many different perspectives and they all disagree with each other and so we've lost that shared baseline now i don't think that six o'clock news was ever telling the truth or was particularly representative of reality",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2233.209,
    "end": 2256.247,
    "text": " but it was simple it did provide at least here's our zero line and we can discuss here or there about it um so there's so much more complexity of perspective that we're having to confront as well and so this the sense of uncertainty has just magnified so much not just because the volume of information but the incoherence of it and so how do we create what's the shortcut to create certainty",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2257.418,
    "end": 2261.119,
    "text": " Well, there's two that I know very well, which you see online all the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2261.239,
    "end": 2262.5,
    "text": "One is moral superiority.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2263.94,
    "end": 2265.04,
    "text": "Me and my people are right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2265.841,
    "end": 2266.261,
    "text": "There we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2266.621,
    "end": 2267.601,
    "text": "Solved all of the problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2267.721,
    "end": 2269.342,
    "text": "The people that are like me are the ones who are right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2269.422,
    "end": 2270.282,
    "text": "All the other ones are wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2270.722,
    "end": 2271.342,
    "text": "They're ignorant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2271.402,
    "end": 2271.963,
    "text": "They're stupid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2272.023,
    "end": 2272.443,
    "text": "They're evil.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2273.891,
    "end": 2275.812,
    "text": " That's efficient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2276.253,
    "end": 2287.581,
    "text": "And then the other one is conspiracy theories, where me and my little cabal of people who have somehow access to this superior knowledge have worked out there's a plot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2288.362,
    "end": 2293.025,
    "text": "And if you just connect all the dots, you'll see how this is definitely what's happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2293.065,
    "end": 2293.786,
    "text": "Here's the plan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2294.006,
    "end": 2295.207,
    "text": "This is who's pulling the strings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2295.247,
    "end": 2298.449,
    "text": "This is why you've just got to follow the money, man.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2298.469,
    "end": 2300.091,
    "text": "That's really flourishing at the moment as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2300.831,
    "end": 2314.342,
    "text": " And it's this desperation to cling on to a certainty and incapacity for the degree of uncertainty that actual reality actually looks like when you start hearing from all the different people simultaneously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2316.169,
    "end": 2320.411,
    "text": " So in active inference, the preferences are over sensory states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2320.651,
    "end": 2323.092,
    "text": "So that's what ties it to perceptual control theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2323.112,
    "end": 2327.154,
    "text": "Like we want to perceive temperatures that we can live within, like homeostasis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2327.814,
    "end": 2333.296,
    "text": "But to a large extent, the inference is on unseen causes of the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2333.476,
    "end": 2335.117,
    "text": "And so there's interesting work about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2335.697,
    "end": 2342.745,
    "text": " Bayesian views on conspiracy theory where you can have a simple model that explains all of the observables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2342.925,
    "end": 2345.008,
    "text": "So that's a nice point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2345.608,
    "end": 2353.577,
    "text": "And another way that we can sort of shortcut the uncertainty is we can make nested models like agree to disagree.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2354.358,
    "end": 2375.426,
    "text": " So rather than uncertainty at the sort of lateral level, you can encapsulate that in a model that both people can actually have shared precision on, which is like we agree to disagree or, you know, this is a really wildly inaccurate thermometer, but we're going to kind of bound that within a way of thinking about that thermometer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2375.466,
    "end": 2377.747,
    "text": "So we're not going to be stressed out when the thermometer goes up and down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2378.607,
    "end": 2382.849,
    "text": " we have a precise action strategy for dealing with this thermometer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2383.229,
    "end": 2392.233,
    "text": "So then we start to identify or seek precision at a higher level and understanding that there's volatility at a lower level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2393.994,
    "end": 2399.536,
    "text": "You wrote a really cool 2019 Medium post, I Will If You Will.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2400.357,
    "end": 2404.939,
    "text": "And there's almost a few readings of even the title because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2406.081,
    "end": 2429.632,
    "text": " on one hand like i will do that if you will do that but also to will is to want so it's like i want to if you want to so that actually speaks to how we need to have the shared action thresholding but then there's that thinking through other minds shared intention mapping so how does i will if you will",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2430.892,
    "end": 2455.765,
    "text": " scale or work in the dyad you know in the i do's that's the sort of minimal unit of i will if you will how do we go to these levels like the crew the congregation maybe even the crowd to start thinking about i will if you will bringing skin in the game and having real effective action i think this is legitimately one of the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2456.57,
    "end": 2464.996,
    "text": " the most promising places for communication technology to make a big difference in society and for the good, to have a positive impact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2466.497,
    "end": 2476.184,
    "text": "And it's solving these kind of coordination challenges where one example that comes to mind, I think actually from that article that kind of triggered this whole",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2477.327,
    "end": 2486.27,
    "text": " research is it's quite common that tenants will have a bad relationship with their landlord and the landlord has a lot of power and the tenants have very little power.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2486.35,
    "end": 2492.752,
    "text": "And so they'll often be in unfair conditions or they're being mistreated or it's somehow exploitive, that situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2493.612,
    "end": 2505.256,
    "text": "But because of the way the information is flowing and the way the relationships are structured, there's kind of nothing that an individual tenant can do about it, apart from find another landlord, often with the same problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2506.557,
    "end": 2515.705,
    "text": " Um, but if the tenants could be coordinated with each other, then they can meet the, uh, they can kind of counterbalance that, that power dynamic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2516.405,
    "end": 2529.175,
    "text": "So for example, I will, if you will, if you could get everyone in a building or in a neighborhood, they had a shared like slum Lord landlord to say, I will go on rent strike.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2529.235,
    "end": 2535.581,
    "text": "If you do like, if everyone in the block agrees, we're not going to pay rent until we see this improvement in our housing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2536.454,
    "end": 2559.491,
    "text": " then you better believe that they're going to get the action that they desire if they can coordinate that agreement and then say to the landlord look everyone we've got this pledge here you can't evict 300 people like just fix the leaky roof you know um whereas if it's one individual that says to the landlord i'm not going to pay the rent well then you just get evicted and so i think that example",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2560.842,
    "end": 2564.744,
    "text": " applies to how do we reduce carbon emissions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2565.384,
    "end": 2570.627,
    "text": "How do we confront the really large challenges we face as society?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2571.167,
    "end": 2579.111,
    "text": "Often there's a disadvantage to being the first mover, or there's a disadvantage to doing something on your own without other people doing it with you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2580.492,
    "end": 2583.313,
    "text": "Sometimes the disadvantage is so great that it's meaningless.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2583.453,
    "end": 2586.115,
    "text": "I often say there's no such thing as a boycott of one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2586.735,
    "end": 2588.536,
    "text": "I can decide to not fly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2589.497,
    "end": 2601.208,
    "text": " But that doesn't have any impact on carbon emissions unless I'm participating in some kind of organized coordination movement where other people are also not flying with me and we're actively growing that shared power.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2601.228,
    "end": 2603.93,
    "text": "And we're saying, look at all these people who have agreed not to fly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2604.271,
    "end": 2610.977,
    "text": "We need to see electric airplanes, please, or more green forms of transit and to be able to counterbalance that force.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2613.009,
    "end": 2619.881,
    "text": " And so that's the kind of thing that can very easily be solved with the right, the right precise use of technology, which is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2622.011,
    "end": 2629.917,
    "text": " basically asking the right question of the right people and giving them the button to text that says, yes, if 10,000 people in my neighborhood agreed to this action, then certainly I would do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2630.437,
    "end": 2632.359,
    "text": "Like I would love to do it, but I'm not going to do it on my own.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2632.579,
    "end": 2634.801,
    "text": "And let's see if you can get that conditional commitment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2635.381,
    "end": 2637.703,
    "text": "And if it reaches a certain threshold, then yes, we all act.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2638.443,
    "end": 2641.666,
    "text": "That's the kind of problem that computers were basically designed to solve, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2641.726,
    "end": 2644.348,
    "text": "So that gives me a sense of, a little sense of optimism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2646.243,
    "end": 2646.543,
    "text": " Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2647.443,
    "end": 2658.146,
    "text": "Thinking about that flying example, it's almost like there's an attractor and if you just pull out individually, you've reduced the demand and actually that might lower the price.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2658.166,
    "end": 2659.807,
    "text": "So now another person jumps in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2660.247,
    "end": 2669.67,
    "text": "So as long as there's an attractor in the system, then uncoordinated action is just part of the structure of that attractor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2670.45,
    "end": 2673.611,
    "text": " How do we actually shift the nature of the attractor?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2674.311,
    "end": 2676.451,
    "text": "That's where the coordination comes into play.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2676.832,
    "end": 2684.913,
    "text": "And that's kind of what we wrote down with like Web3 and distributed autonomous organizations and different kinds of cryptographic technologies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2685.414,
    "end": 2693.135,
    "text": "It's not just you're seeing 10,000 likes on something and that could just be basically a PSYOP on you from the side of the server.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2693.576,
    "end": 2699.097,
    "text": "How could that be verified information so you know those are real people who have made a commitment to action?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2699.777,
    "end": 2702.658,
    "text": " that's when it starts to get very interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2702.798,
    "end": 2716.163,
    "text": "And then we wrote down a few active inference terms, like thinking through other minds, which we talked about the importance of the counterfactual, because for any definite statements, there's so many counterfactuals we can go off into.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2716.383,
    "end": 2722.746,
    "text": "And when people are even talking about what kinds of worlds they want to see, it's sometimes a mixture of their preferences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2723.946,
    "end": 2726.57,
    "text": " as well as counterfactual action policies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2727.251,
    "end": 2739.669,
    "text": "So it helps to have a formal model, not the only possible way with active inference, but a formal model so we can separate someone's preferences, like what they do want to see, from counterfactuals on action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2740.49,
    "end": 2761.203,
    "text": " other things we could do and then just separating the discussion that way helps us be really creative with the counterfactuals of action and ask which will actually reduce our uncertainty about realizing the preference so um that's hopefully going to be an active and interesting area with getting people to um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2763.809,
    "end": 2788.676,
    "text": " structure commitment because without a lot of intentionality across different scales and careful design the internet is a low trust place so making it high trust at multiple scales is very crucial yeah the um the the piece about dow's web 3 i guess that has some promise i mean i should clarify i think the concept of a dow decentralized autonomous organization",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2789.892,
    "end": 2793.194,
    "text": " from my research over the last couple of months, it means almost nothing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2793.674,
    "end": 2795.476,
    "text": "It doesn't really have a formal definition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2795.576,
    "end": 2807.103,
    "text": "It's like a parentheses that we put in the conversation, which means all of my hopes and dreams about how organizations could be better, which is a very useful object to have in a conversation, but it doesn't tell you much about how to do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2809.172,
    "end": 2817.274,
    "text": " But I'm very enthusiastic and optimistic about it because you've got these groups that are experimenting with resources that they really care about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2817.374,
    "end": 2824.335,
    "text": "Like a lot of the DAOs that are running have multimillion dollar treasuries that are being governed by tens up to thousands of people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2825.195,
    "end": 2828.516,
    "text": "And they're confronting the real hard problems of how do you do that well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2829.016,
    "end": 2834.257,
    "text": "And one of the main bottlenecks is not like I described, you know, asking people the question and giving them the button to tick.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2834.897,
    "end": 2837.698,
    "text": "It's the attention economy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2838.925,
    "end": 2847.848,
    "text": " Because to actually get people coordinated to look at, hey, here's the button you need to click, that's something that you want to spend that wisely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2848.389,
    "end": 2856.792,
    "text": "And in Spiral, in the community that I've spent most of my time in, we've sometimes even talked about that the attention economy is kind of like a shared credit card.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2857.435,
    "end": 2859.397,
    "text": " And you want to be really responsible when you spend that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2859.997,
    "end": 2861.818,
    "text": "You can't be putting up a vote every five minutes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2861.838,
    "end": 2863.059,
    "text": "You've really got to be careful about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2863.44,
    "end": 2869.224,
    "text": "And that's one example of a kind of bottleneck, which requires a lot of sophistication and nuance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2869.284,
    "end": 2871.846,
    "text": "And we don't really know how to program that yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2872.146,
    "end": 2877.731,
    "text": "It seems to be like a human strategic governance challenging communication problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2879.192,
    "end": 2883.115,
    "text": "Totally agree about the sort of everything and nothingness of DAO.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2883.555,
    "end": 2887.018,
    "text": "And I think maybe even the word DAO is a subtle nod.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2888.393,
    "end": 2893.258,
    "text": " to that because distributed is on a continuum and there's not a single definition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2893.858,
    "end": 2896.04,
    "text": "Autonomous, it's also on a continuum.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2896.381,
    "end": 2899.224,
    "text": "Like people will say, oh, the embryo is a self organizing system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2899.744,
    "end": 2902.427,
    "text": "Oh yes, but of course there's the system that supports it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2902.467,
    "end": 2904.689,
    "text": "So nothing is really self arising.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2904.729,
    "end": 2906.771,
    "text": "So that's a continuum and kind of has nuance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2907.231,
    "end": 2909.093,
    "text": "And then organization, which is what?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2910.194,
    "end": 2937.92,
    "text": " people and other systems have been doing forever so it's kind of just saying we're using digital technology to organize which is awesome and it's many of those discussions that we would have in the co-op living room again about the almond milk but now it's happening with digital scarcity and real assets and lives on the line and then you you mentioned the attention economy so another active inference term is like regime of attention",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2938.76,
    "end": 2945.604,
    "text": " which is kind of just describing how attention and salience is being distributed",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2946.596,
    "end": 2947.717,
    "text": " through space and through time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2947.957,
    "end": 2952.66,
    "text": "So just doing a mindfulness exercise in the body and okay, pay attention to your feet and your knee, et cetera.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2953.26,
    "end": 2956.182,
    "text": "That is a personal level regime of attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2956.722,
    "end": 2959.644,
    "text": "And you're speaking to collective regimes of attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2960.464,
    "end": 2963.746,
    "text": "And then where do governance decisions come into play?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2963.826,
    "end": 2965.167,
    "text": "Are we going to micromanage?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2965.387,
    "end": 2967.749,
    "text": "Are we going to try to get everyone's attention?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2968.469,
    "end": 2975.674,
    "text": "Or might it be sort of a distributed regime of attention that doesn't require as much centralization?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2979.157,
    "end": 2994.751,
    "text": " good jumping off points for of course org number one in our last few minutes let's kind of close with the crowd and to paraphrase slash mutate a quote",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2995.612,
    "end": 3014.659,
    "text": " any sufficiently advanced crowd is indistinguishable from an individual so that's kind of where that multi-scale ladder loops back because of course we're an ensemble of cells and so on so this multi-scale nesting it ends up kind of closing the loop between a true crowd mob",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3015.399,
    "end": 3018.78,
    "text": " And then the individual, because once it's a crowd, it's just one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3019.221,
    "end": 3020.101,
    "text": "You don't say crowds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3020.561,
    "end": 3021.482,
    "text": "It's just a singular.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3021.962,
    "end": 3027.484,
    "text": "So that relates a lot to some technical discussions we have about mean field approximations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3027.824,
    "end": 3031.466,
    "text": "Like, can you just assume that that cup has infinite water molecules?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3031.506,
    "end": 3032.766,
    "text": "Just take the total average.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3033.767,
    "end": 3033.827,
    "text": "Or...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3034.767,
    "end": 3040.388,
    "text": " how do we contrast that with a unique trajectory based or a particle based approach?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3040.629,
    "end": 3046.65,
    "text": "So those are physics questions, but they come into play with this dialectic between individuals and crowds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3047.17,
    "end": 3051.331,
    "text": "And then also what's outside of the crowd or what is the niche of the crowd?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3051.831,
    "end": 3054.852,
    "text": "So those were some crowd related thoughts we had.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3054.972,
    "end": 3056.393,
    "text": "Any anything to say on that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3056.493,
    "end": 3057.413,
    "text": "Yeah, definitely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3058.353,
    "end": 3061.334,
    "text": "Probably the most inspiring examples of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3062.318,
    "end": 3087.603,
    "text": " to advance participatory democracy uh in the decade that i've been paying attention to anyway they've been happening in taiwan since 2014. and one of the tools that they use is called polis which sometimes they describe as like a ai ml facilitator and basically the way it works is you ask a question of a large crowd um or you you poll for opinions or responses",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3088.749,
    "end": 3094.172,
    "text": " And then people can basically say, I'm close to this or I agree or I disagree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3094.212,
    "end": 3095.913,
    "text": "That's basically the responses that they can do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3096.253,
    "end": 3102.097,
    "text": "And then it clusters all these sentiments and says, oh, all of these people seem to more or less agree with each other and these ones agree with each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3102.137,
    "end": 3104.038,
    "text": "But there's a disagreement between these two crowds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3104.558,
    "end": 3110.882,
    "text": "And so essentially what happens is you take thousands of people and you'll see there's like three or six opinion groups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3111.662,
    "end": 3114.444,
    "text": "It's like you can boil the crowd very easily to a crew.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3115.504,
    "end": 3120.145,
    "text": " And then what you need to do, well, first of all, the crucial thing here is it's rough consensus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3120.245,
    "end": 3120.986,
    "text": "It's not consensus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3121.066,
    "end": 3121.866,
    "text": "It's rough consensus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3121.946,
    "end": 3124.327,
    "text": "It's like there's a cluster here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3124.687,
    "end": 3128.408,
    "text": "There's not a firm boundary, but there's a kind of coherence at that scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3129.208,
    "end": 3134.69,
    "text": "And then once you've identified the four or five opinion groups, you just need to find a trustworthy representative of each one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3135.31,
    "end": 3145.524,
    "text": " bring them into a deliberation that's facilitated by a human and broadcast that conversation and the five of them sense making together and uncovering, okay, what's our rough consensus between the five of us?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3146.145,
    "end": 3150.471,
    "text": "And you very rapidly generate very high quality policy that people can get behind",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3151.357,
    "end": 3164.003,
    "text": " to the extent that the quality of the policy development they're doing in Taiwan, those kinds of processes will get rubber stamped by the appropriate ministry and government to say, yes, we can approve this right away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3164.163,
    "end": 3164.684,
    "text": "So that's like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3165.732,
    "end": 3167.173,
    "text": " so inspiring to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3167.693,
    "end": 3177.019,
    "text": "And I guess the process of going from those five opinion groups to the one policy that everyone can more or less live with, that's kind of the process of going from the crew to the individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3177.359,
    "end": 3182.382,
    "text": "It's like, this is what the collective body can tolerate, or this is what we have in common.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3182.422,
    "end": 3183.663,
    "text": "This is our island of agreement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3184.223,
    "end": 3188.526,
    "text": "So that's so incredibly exciting for me to track that happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3190.88,
    "end": 3198.962,
    "text": " I've heard of Polis and several other related tools in MetaGov, and we talk about these different levels of governance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3199.082,
    "end": 3202.823,
    "text": "That's the body politic, and we can trust the process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3203.003,
    "end": 3219.307,
    "text": "We can have high confidence and precision on a process to really that highest level where you just basically suggested that they have so much trust in it that whatever the outcome is, whatever that thermometer reads, we trust the thermometer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3219.887,
    "end": 3225.732,
    "text": " And so we can have precision on that, even if, again, so trusting the process way of kind of bounding our uncertainty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3225.752,
    "end": 3240.623,
    "text": "And I think this is a fun kind of closing notion for the first time that we're speaking here about theory and practice, which is something that came up in multiple podcasts and writings of yours.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3241.284,
    "end": 3246.328,
    "text": "Theory and practice, otherwise known as kind of inference and action theory,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3246.946,
    "end": 3247.786,
    "text": " they're inseparable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3248.487,
    "end": 3251.768,
    "text": "They're the two swirls in that DAO.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3252.428,
    "end": 3257.81,
    "text": "So how do theory and practice come together across these scales?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3258.91,
    "end": 3267.393,
    "text": "And just as we move forward, how does our individual theorizing and practicing relate to these community levels?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3269.634,
    "end": 3270.414,
    "text": "Great question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3270.614,
    "end": 3274.896,
    "text": "If you read the original Microsolidarity proposal,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3276.13,
    "end": 3301.852,
    "text": " called a proposal because it starts with this is my plan of action this is what i'm doing uh that's that for me the verb always comes first and then oh along the way i'll have to explain some theory so you understand what i'm talking about but it's always for me it's really important to keep it grounded in action i think there's um i have a model in my head there's action and then there's talk about action and then there's talk about talk",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3302.711,
    "end": 3305.292,
    "text": " And I've got very little capacity for talk about talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3305.592,
    "end": 3321.396,
    "text": "There's occasionally you need to go there, but I think it's very easy for a sort of culture to get one way or the other where it's all action and there's no reflection, there's no thoughtfulness, or it's all talk about talk and there's never any delivery, there's never any action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3321.456,
    "end": 3326.417,
    "text": "So it's really important to me to have a balance there, but a balance that's biased towards the verbs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3327.185,
    "end": 3328.386,
    "text": " I'm on a war against nouns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3328.406,
    "end": 3332.548,
    "text": "You might actually subtly notice that in my website that I try and get rid of the nouns wherever I can.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3336.089,
    "end": 3345.934,
    "text": "I think the other thing on that is, again, a very practical, concrete step that we recommend in all of the crews that we support to form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3347.364,
    "end": 3367.624,
    "text": " is to institute a rhythm of reflection intentional reflection so it might be one in five or one in ten of your meetings should be spent looking backwards retrospecting and saying looking back on the last five meetings we had what was good that we wanted to do more of what was irritating let's do less of that what are we going to do differently in the next cycle",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3368.464,
    "end": 3381.852,
    "text": " and cultivating that shared landscape of how do we view the shared project that we're doing and what kind of adjustments can we make and putting that into a rhythmic context where it's a dependable, this is another way to reduce uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3382.232,
    "end": 3394.519,
    "text": "So we don't know what's going to happen next, but we do know that every five meetings we have a retrospective and that rhythm is dependable and that settles people to make peace with all the change and the uncertainty and the disruption that comes along.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3394.939,
    "end": 3397.561,
    "text": "It's one of the things that you can really count on and rest on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3398.181,
    "end": 3400.745,
    "text": " So that's completely essential as a practice for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3401.707,
    "end": 3406.674,
    "text": "And my theory, I think, is always four or five steps behind my practice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3406.734,
    "end": 3410.299,
    "text": "I'm always just like, let's just do the work and talk about it afterwards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3411.104,
    "end": 3419.108,
    "text": " Well, multi-scale nested rhythms happen in the brain, like the EEG rhythms, as well as monthly, annual, et cetera.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3419.888,
    "end": 3426.311,
    "text": "And our lab motto is act, infer, serve, because we have to act first.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3426.371,
    "end": 3428.432,
    "text": "That's that critical action orientation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3429.472,
    "end": 3433.717,
    "text": " And when we act, we start to reduce the space of the counterfactuals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3433.737,
    "end": 3438.702,
    "text": "We're kind of like plucking the strings that are the sinews of the causal structure of the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3439.003,
    "end": 3443.447,
    "text": "Not that we see the strings themselves, but when we observe the outcomes, we start to learn more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3443.908,
    "end": 3446.511,
    "text": "And so we have to act first, though.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3446.851,
    "end": 3449.714,
    "text": "If we start with inference, if we start with just theory...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3450.615,
    "end": 3460.824,
    "text": " Some people do exit that attractor, but also there's so much to think about and we're never going to reduce our uncertainty by thinking alone, or we could just reduce our uncertainty and be super precise and incorrect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3461.925,
    "end": 3464.087,
    "text": "So that's like a very important call.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3465.608,
    "end": 3468.411,
    "text": "If you have any final thoughts, please feel free to add them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3468.511,
    "end": 3473.355,
    "text": "Otherwise, Richard, this was an awesome first org stream and we really appreciate the visit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3474.537,
    "end": 3475.078,
    "text": " Thanks, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3475.198,
    "end": 3484.549,
    "text": "Yeah, I could go on many different tangents and rant a great length about plucking the strings of causality, which kind of starts the touch into my own homemade cosmology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3484.589,
    "end": 3488.834,
    "text": "But I think we'll save that for later, the rant about the cosmic harpsichord.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3490.919,
    "end": 3492.961,
    "text": " Maybe I can come back for another conversation sometime.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3493.222,
    "end": 3493.722,
    "text": "Very cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3493.863,
    "end": 3495.605,
    "text": "So you're always welcome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3496.105,
    "end": 3499.589,
    "text": "And I hope to continue the conversation with you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3499.729,
    "end": 3504.956,
    "text": "So again, great conversation and good luck with everything you're working on, Richard.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3505.776,
    "end": 3506.216,
    "text": " Thanks so much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3506.496,
    "end": 3512.399,
    "text": "I would just say to the lovely people listening, if you like my way of thinking, join me on Twitter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3512.439,
    "end": 3515.801,
    "text": "That's where my stream of consciousness is broadcasting into the void 24-7.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3515.941,
    "end": 3519.063,
    "text": "And I'm more slowed down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3519.223,
    "end": 3527.107,
    "text": "From my Twitter page, Rich Decibels, you'll find links and other things if you want to go deeper into some other projects and follow websites and things like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3528.027,
    "end": 3528.208,
    "text": "Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3528.528,
    "end": 3529.388,
    "text": "Very much recommended.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3529.448,
    "end": 3530.789,
    "text": "So see you later, Richard.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3531.409,
    "end": 3531.729,
    "text": "Thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3532.33,
    "end": 3532.53,
    "text": "Ciao.",
    "speaker": "SPEAKER_00"
  }
]