[
  {
    "start": 0.998,
    "end": 22.979,
    "text": " hello it's february 15th 2023 we're in cohort 2 of the active textbook we are in our first discussion on chapter 7. so let's just first look at how chapter 7 is anticipated in the text",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 23.905,
    "end": 47.071,
    "text": " then any of you are welcome to give some thoughts or just raise any thoughts or questions on chapter seven and then that will go wherever it goes we can also look at previously submitted questions as well as walk through the text and get a big picture of what's happening so the first mention of chapter seven is in chapter one when they're summarizing chapter seven",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 48.07,
    "end": 77.206,
    "text": " and they describe that in chapter seven they're going to discuss active inference models addressing problems formulated in discrete times as hidden Markov models and partially observable Markov decision processes and they mention the examples they're going to use which is a left or right at a T maze and they also bring in topics information seeking learning novelty seeking they talk about how preference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 79.286,
    "end": 95.676,
    "text": " represented by the c parameter is going to be unpacked in chapter seven in chapter four they talk about how message passing will be unpacked further in chapter seven in chapter five",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 96.67,
    "end": 100.013,
    "text": " They talk about E and policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 100.633,
    "end": 109.4,
    "text": "So as they're mentioning a bunch of the parameters, E, pi, C, message passing, they're describing that they're gonna come back to it in chapter seven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 112.583,
    "end": 116.326,
    "text": "If we want to change the way the signal is interpreted, we need to rely on learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 116.426,
    "end": 118.448,
    "text": "We will return to this in detail in chapter seven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 120.349,
    "end": 124.293,
    "text": "In chapter seven, we will discuss a biologically plausible example of factorization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 125.959,
    "end": 150.824,
    "text": " specifically the what and the where streams and in chapter six in the recipe they talk about the updating in the form of the updating so several more mentions of chapter seven in chapter six and then we actually get to chapter seven itself all right so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 154.989,
    "end": 179.936,
    "text": " anyone just to begin with what were your thoughts or feelings on reading chapter 7 or what came to mind as you read or remembered reading chapter 7 active inference in discrete time just unmute and go for it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 185.553,
    "end": 193.816,
    "text": " Well, I didn't read it completely, but there's a number of questions that popped up in, for instance, in figure 7.3.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 194.396,
    "end": 204.839,
    "text": "So the A matrix is conditioned not only on one state, but a couple of states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 207.597,
    "end": 209.719,
    "text": " Is that correct?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 212.803,
    "end": 222.953,
    "text": "So the sequence of preceding states plays a role.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 223.994,
    "end": 226.117,
    "text": "That's different to hidden Markov model, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 227.569,
    "end": 233.451,
    "text": " And then so this would be one question, how this could be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 233.491,
    "end": 249.316,
    "text": "And then another question is whether this pi actually makes this whole automaton more powerful, or is this just a convenient way of representing it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 253.706,
    "end": 262.129,
    "text": " So could this pi actually be merged into the state as an additional factor or something?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 262.549,
    "end": 271.912,
    "text": "So multiply the number of states and, or does it really increase the computational power of that whole automaton?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 273.113,
    "end": 273.773,
    "text": "Great questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 279.508,
    "end": 297.888,
    "text": " right so yeah yeah jacob go for it first um i think that the in terms of putting the pie into the states themselves um i",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 299.088,
    "end": 306.897,
    "text": " I don't think I've seen that ever being done in an actual model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 307.858,
    "end": 309.66,
    "text": "And I think this is more of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 311.317,
    "end": 321.199,
    "text": " a representation rather than really how the model would be implemented, because the pie is just is just the policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 321.279,
    "end": 337.603,
    "text": "And it's I think it's it like branches out to the to the two bees from like a single node only to represent that each bee is also conditioned on the policy, but not necessarily that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 340.265,
    "end": 366.778,
    "text": " it's like a one that that it happens within like one time snapshot yes yeah in in some other work jacob and i have talked a lot about like why is pi shown to intervene twice and even more generally why is it shown with three time steps yes it helps us understand that it's like past present and future",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 368.087,
    "end": 395.782,
    "text": " but the action perception loop also could be shown with just the transition between two steps and pi intervening once whereas this is a little bit ambiguous whether it's a policy of length two intervening at this time point or whether it's just showing the continual unfolding of policy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 396.903,
    "end": 420.308,
    "text": " interleaving between the hidden states in a sort of open-ended way um but what what do you mean michael by increasing the computational power um i mean it it would be possible to have the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 422.988,
    "end": 449.866,
    "text": " dynamics of the hidden states through B be complex but by removing pi and the action selection apparatus then if we only had the rake down below it would just be a passive inference algorithm with a potentially complex endogenous dynamic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 454.534,
    "end": 457.415,
    "text": " Well, I had to, can I give an example?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 457.435,
    "end": 458.475,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 459.675,
    "end": 464.676,
    "text": "So I was thinking of, so is that some kind of recursion possible?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 465.076,
    "end": 468.297,
    "text": "For instance, I was thinking of the following example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 468.857,
    "end": 484.14,
    "text": "Assume that I want to go and buy a bread, and then I go out, and then on my way to the bakery, I see a haircut, and I think, oh, before buying this bread, I could go to the haircutter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 484.7,
    "end": 491.585,
    "text": " And then crossing the street, I see a shop with journals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 491.665,
    "end": 497.309,
    "text": "And then I think, oh, when I sit there with a haircut, I should maybe buy a journal to read something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 497.349,
    "end": 499.19,
    "text": "Then I go to that journal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 499.25,
    "end": 500.171,
    "text": "I see a friend.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 500.291,
    "end": 502.512,
    "text": "And the friend tells me, oh, I have a new car.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 503.053,
    "end": 504.554,
    "text": "You want to come to see my car?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 505.134,
    "end": 509.317,
    "text": "And so I pass the half of the day going forward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 509.377,
    "end": 513.36,
    "text": "And then eventually, I backtrack, coming back from the car, going",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 513.84,
    "end": 517.581,
    "text": " by going to the hair cutter, buying the bread, and in the evening I go home.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 518.081,
    "end": 520.582,
    "text": "So this is a kind of a recursive thing, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 521.682,
    "end": 526.643,
    "text": "So there is an action, and then there is an intervention with another action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 528.644,
    "end": 531.905,
    "text": "So it's a kind of a recursive thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 531.985,
    "end": 536.326,
    "text": "And each of those actions maybe follows a policy, but that can be...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 538.046,
    "end": 542.749,
    "text": " There can be another policy that intervenes, but then I backtrack from there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 542.809,
    "end": 550.294,
    "text": "So that would actually be, yes, a recursive kind of a policy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 550.574,
    "end": 552.075,
    "text": "Is something like this possible?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 552.175,
    "end": 557.519,
    "text": "So this would really, I guess, increase the computational power",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 559.847,
    "end": 575.18,
    "text": " with respect to just completing one policy or one sequence of actions and then going to the next where one iterates the stuff instead of the possibility to do that recursively.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 575.22,
    "end": 577.702,
    "text": "So something like this I was thinking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 577.762,
    "end": 583.207,
    "text": "So is it possible to have some recursive policies there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 586.528,
    "end": 608.662,
    "text": " One quick note is to Livestream 42, which was on robotics and the SLAM, simultaneous localization and mapping, there's a higher level policy selection around what location the robot wants to go, and then a lower level tactical level that is about the actual motor actuation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 609.403,
    "end": 611.885,
    "text": "So in that example that you gave,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 612.759,
    "end": 616.922,
    "text": " There might be like a higher level model of which location you want to go towards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 618.023,
    "end": 620.365,
    "text": "And then there's a lower level footstep model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 621.525,
    "end": 631.793,
    "text": "And then this shifting of decision could be modeled as policies on which location one is seeking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 633.094,
    "end": 638.818,
    "text": "So as with many features, it's not necessarily intrinsic to this figure 7.3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 640.894,
    "end": 646.802,
    "text": " as the kernel but you can compose it in order to capture some of those dynamics ali and then yakup",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 654.269,
    "end": 676.675,
    "text": " Yeah, well, actually, I think described in those terms, I mean, recursively updating the generative model is just for the can just be for the purpose of building a comprehensive generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 676.735,
    "end": 678.656,
    "text": "I mean, as comprehensively as we can.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 678.736,
    "end": 682.157,
    "text": "But when we include the policies",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 684.065,
    "end": 687.647,
    "text": " as the additional parameter in our generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 689.048,
    "end": 708.398,
    "text": "Actually, this is a kind of a technique used for bringing the elements of action selection to or within the Bayesian belief updating, which is called the planning as inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 708.938,
    "end": 711.1,
    "text": "So in order to do that,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 713.046,
    "end": 727.936,
    "text": " policy selection or, I mean, constructing a space of all possible actions is a necessity, a requirement to do these kinds of planning as inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 727.996,
    "end": 737.143,
    "text": "But yeah, it's just a kind of mathematical trick, if you will, to somehow bring together",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 738.18,
    "end": 744.768,
    "text": " the action selection into the mechanism of Bayesian belief updating.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 749.134,
    "end": 751.277,
    "text": "But this possibility... Oh, sorry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 751.817,
    "end": 752.098,
    "text": "Continue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 754.881,
    "end": 760.365,
    "text": " Yeah, so this possibility is not in picture 7-3, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 760.385,
    "end": 769.112,
    "text": "So because these arrows go from pi to the B matrix, but there's not a kind of an arrow going back.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 769.712,
    "end": 784.083,
    "text": "So are you saying the trick would be that one learns a pi inside a pi somehow?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 785.242,
    "end": 791.123,
    "text": " Yeah, you see, this is just one policy, a picture, a snapshot of a one policy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 792.024,
    "end": 805.927,
    "text": "But in more comprehensive models, we have the state of... I mean, we have policies and not just one single policy to select from.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 806.587,
    "end": 808.687,
    "text": "So, yeah, that picture just shows...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 810.948,
    "end": 827.52,
    "text": " how choosing a single policy can affect the generative model and how it can do the inference via planning or action selection.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 828.421,
    "end": 835.366,
    "text": "But in reality, when dealing with more comprehensive models,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 836.656,
    "end": 844.284,
    "text": " we don't necessarily have just one single policy to select from.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 844.304,
    "end": 852.772,
    "text": "I mean, it would be tautological to have just one single policy, so we need a space of possibility.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 854.794,
    "end": 860.2,
    "text": "If there was just one policy and there was no agency around selecting it,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 861.505,
    "end": 889.999,
    "text": " then it reverts to a passive inference challenge whereas the structure of the b matrix which you can explore from a hands-on perspective like by looking at the dimensionality of it in pi mdp the inference problem is set up such that agents are deciding between pi 1 and pi 2 which are evaluated according to their expected free energy and pi 1 and pi 2 do different things",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 891.161,
    "end": 907.587,
    "text": " to be so we can think of like a b1 and b2 not time point one and two but variant or slice one and two that change how hidden states change their time so jacob um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 909.588,
    "end": 927.98,
    "text": " I guess on the question of recursion and with your example of going to a barber and then seeing, oh, I want to buy a magazine to read and the policy changing throughout.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 928.92,
    "end": 945.769,
    "text": " I guess I'm not really sure I see the recursion there in an active inference model because I think it's more, I'd say it's more like a very high dimensional model where you are perhaps performing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 947.034,
    "end": 968.71,
    "text": " uh where you're always like narrowing down your policy search space um and with new observations you're like adjusting that search space based on your preferences in that particular uh observational modality like you get reminded that there are magazines and you can buy magazines to read",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 969.857,
    "end": 973.92,
    "text": " while you're at another place, so it kind of extends that computation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 974.02,
    "end": 978.323,
    "text": "But I don't think it's necessarily recursive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 978.523,
    "end": 990.931,
    "text": "And also, I think the figure... I think you mentioned something about prediction errors or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 991.191,
    "end": 995.013,
    "text": "I don't think that's necessarily encapsulated in the figure because that only shows...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 995.894,
    "end": 1023.884,
    "text": " Well, I guess it's not explicit, but we can assume that the B there is static and you can imagine a lot of other things happening if you would be learning the B matrix or doing model selection as well and adjusting your policy based on what observational modality has the highest precision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1029.83,
    "end": 1032.812,
    "text": " And can I answer to this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1033.072,
    "end": 1041.276,
    "text": "So I think, well, maybe you can represent this in a way of an iteration or the way you say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1041.316,
    "end": 1054.342,
    "text": "But it would be recursive in my understanding of these terms if going, for instance, to the baker is a policy, means it's a series of actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1055.663,
    "end": 1055.923,
    "text": " Right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1056.063,
    "end": 1063.609,
    "text": "And so if this is a policy, and then in the middle of this, there is somehow another policy that pops up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1063.749,
    "end": 1067.332,
    "text": "Oh, I go first to the hair cutter or to the barber or whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1067.953,
    "end": 1077.14,
    "text": "And then this one policy still exists, but inside there is another kind of sequence of actions, another plan, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1077.7,
    "end": 1081.083,
    "text": " popping up, and if this could happen recursive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1081.583,
    "end": 1089.29,
    "text": "I mean, in my understanding of these terms, it would be kind of recursive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1092.372,
    "end": 1101.58,
    "text": "Yeah, it can be through nested modeling, which is one canonical way that recursion is implemented.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1101.66,
    "end": 1104.702,
    "text": "So it's unfolding sequentially through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1105.783,
    "end": 1110.725,
    "text": " but also like this higher level discrete time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1110.745,
    "end": 1113.686,
    "text": "So that's again, we're chapter seven, we're in discrete time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1114.826,
    "end": 1117.627,
    "text": "And so this might be a slower click.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1118.528,
    "end": 1133.393,
    "text": "So maybe the footsteps are taking place on a second to second policy tick timeline, whereas a policy in which location one wants to go is being evaluated at a slower level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1134.306,
    "end": 1150.638,
    "text": " And if this nested level is playing out at a similar frequency to the lower level, then as a modeler, you might be better off just having it as a single level model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1150.658,
    "end": 1159.725,
    "text": "And as an organism, you'd get into these kind of like paralysis cases where if you were actually switching policies about where you want to go,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1161.348,
    "end": 1164.709,
    "text": " then this would be incoherent down in the lower level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1173.011,
    "end": 1181.853,
    "text": "So just to return to the initial question, is it possible to merge policy into the hidden states as a causal latent factor?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1182.593,
    "end": 1189.875,
    "text": "Well, in a way, policy intervenes in how hidden states change through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1190.72,
    "end": 1194.742,
    "text": " So policy does influence hidden states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1196.302,
    "end": 1201.984,
    "text": "Without an action selection apparatus, it's not active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1202.764,
    "end": 1204.745,
    "text": "It's not even a control theory problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1205.485,
    "end": 1214.669,
    "text": "It's just a question of identifying latent causes from the unfolding of a hidden states and observables that you can't control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1215.089,
    "end": 1217.19,
    "text": "And that's a classical SPM type",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1218.621,
    "end": 1247.093,
    "text": " challenge like S might be the latent unobserved neural activity and O might be multi-sensor fusion with fMRI EEG and MEG so this can still be very complex in its unfolding through time with the observations in the hidden states what would make it an active inference problem well if you weren't just observing sensor modalities but if the experimenter could take a policy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1248.131,
    "end": 1265.785,
    "text": " that was intervening how neural dynamics change through time, which is what experimental design is, which is why it's so compatible with thinking about the meta-Bayesian approach with a behavioral researcher.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1270.129,
    "end": 1276.113,
    "text": "So Pi influences hidden states, but if we merely folded into B,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1277.025,
    "end": 1280.186,
    "text": " we would lose the ability to do actual action selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1283.306,
    "end": 1289.067,
    "text": "But if it were a passive inference problem, we still could use variational inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1290.347,
    "end": 1292.568,
    "text": "We still could use free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1293.788,
    "end": 1296.449,
    "text": "We still could even align outcomes with our preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1296.489,
    "end": 1298.489,
    "text": "We could still calculate and bound surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1300.089,
    "end": 1303.33,
    "text": "The active embedding of active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1304.463,
    "end": 1308.285,
    "text": " is to include action as a parameter, like Ali mentioned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1308.925,
    "end": 1333.255,
    "text": "Within the Bayesian brain context, to have a parameter that you do Bayesian inference on, and then extend that not just from perception and causal inference, which is what's happening on the bottom, like perception is the A. Causal inference can be understood as B, but action selection does require an additional apparatus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1336.363,
    "end": 1339.086,
    "text": " Passive inference, more like signal processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1340.567,
    "end": 1342.469,
    "text": "Action, more like control theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1343.51,
    "end": 1344.491,
    "text": "Unified imperative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1345.692,
    "end": 1351.898,
    "text": "So the G would then be predicting the future, expectations, developing of expectations, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1353.219,
    "end": 1353.9,
    "text": "What would it be?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1355.862,
    "end": 1356.463,
    "text": "What is G?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1357.404,
    "end": 1358.525,
    "text": "The G, the pi.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1359.406,
    "end": 1359.806,
    "text": "Oh, sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1361.482,
    "end": 1368.166,
    "text": " Well, pi is the combinatorics of affordances over a given time horizon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1369.127,
    "end": 1375.651,
    "text": "So merely generating pi as a list is not intrinsically difficult.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1375.731,
    "end": 1380.575,
    "text": "It's just the search space of possible action sequences over a given time horizon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1381.215,
    "end": 1385.738,
    "text": "If there's two options and you're doing a time horizon of three, then it's two cubed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1387.259,
    "end": 1389.821,
    "text": "G is the expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1390.953,
    "end": 1393.715,
    "text": " which updates the policy prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1394.635,
    "end": 1409.383,
    "text": "So take that list and it's your prior probability of those policies, which could be either just a uniform prior or could reflect habit, like a priori, how likely are policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1410.223,
    "end": 1418.688,
    "text": "And then G sharpens or updates that policy vector into a policy posterior,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1419.417,
    "end": 1422.158,
    "text": " which then the agent samples their actions from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1426.66,
    "end": 1429.482,
    "text": "And how is this meant?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1429.602,
    "end": 1435.384,
    "text": "So assume that I'm... So you're saying the first is the past, and then... So is this...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1438.577,
    "end": 1441.841,
    "text": " Is this re-estimated at every state?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1443.722,
    "end": 1451.93,
    "text": "So this pi would somehow have expectations over future affordances, as you say, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1453.572,
    "end": 1459.157,
    "text": "Would say which transitions are more likely to the right of this graph?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1461.508,
    "end": 1469.011,
    "text": " And would that be re-estimated at each time step?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1469.831,
    "end": 1475.733,
    "text": "Or how would that... Yeah, there's multiple possible levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1475.893,
    "end": 1477.114,
    "text": "Ali, go first, then I'll give a thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1480.695,
    "end": 1487.258,
    "text": "Well, basically, pi actually is just an additional parameter multiplied to...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1488.314,
    "end": 1492.896,
    "text": " the basic Bayes theorem formula we had before.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1493.436,
    "end": 1506.683,
    "text": "So instead of just multiplying likelihood and the priors simply, we also multiply the probability of selecting a policy and that's just it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1506.743,
    "end": 1512.245,
    "text": "So pi is just an additional parameter in that equation from back in chapter two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1515.58,
    "end": 1543.762,
    "text": " yeah equation 2.6 is where g is defined so g is a a function of policies so it takes in as arguments the vector of policies and then conditioning as we see in every single of these rephrasing every single one is conditioned upon a given policy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1545.802,
    "end": 1553.006,
    "text": " And then different policies are compared by their expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1554.087,
    "end": 1563.753,
    "text": "And then depending on the precision on the action posterior, which isn't shown in 7.3, you can have a spectrum of behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1564.333,
    "end": 1571.738,
    "text": "If you have extremely high precision, like it could be thought of as low temperature, in that case,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1573.158,
    "end": 1588.478,
    "text": " one policy that's um let's just say one is um it's one percent better than the other then under the low temperature asymptote the high precision asymptote the policy that's even tiny tiny bit better will always be selected",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1589.733,
    "end": 1615.041,
    "text": " under the neutral temperature zone policies are selected based upon their posterior likelihood so if one of them is 51 and the other is 49 when you soft max it then it's selected 51 and 49 of the time respectively and then in the high temperature or low precision asymptote also known as shaky hand",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1616.32,
    "end": 1621.023,
    "text": " the differences amongst policies in their expected free energy basically get erased.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1622.123,
    "end": 1630.648,
    "text": "And at that point, policies are selected essentially without respect to their posterior likelihood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1636.154,
    "end": 1661.792,
    "text": " this is one of the key pieces though because again we're not calculating different policies and asking well how rewarding are they how much expected reward do they have and then ranking or selecting based on that rather there's a unified imperative expected free energy which under different decompositions can be shown to have these different interpretations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1662.972,
    "end": 1688.394,
    "text": " that is then used to generate a policy posterior and then as just described that policy posterior in the context of a of a temperature or precision variable can exhibit behaviors ranging from always selecting the slightly preferred policy in the low temperature limit neutral temperature selecting according to the posterior high temperature erasing differences in the posterior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1692.759,
    "end": 1703.406,
    "text": " Yeah, sorry, I just wanted to point out that this G matrix here is still prior to learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1703.586,
    "end": 1717.574,
    "text": "So if we want to add learning to the policies, things would get a little bit more, not to say complicated, but more extended equations would be needed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1718.075,
    "end": 1721.597,
    "text": "So we haven't included learning",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1722.39,
    "end": 1726.531,
    "text": " in this specific formulation yet, it's prior to learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1727.652,
    "end": 1729.052,
    "text": "Yes, thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1730.333,
    "end": 1740.616,
    "text": "I also want to highlight that in the category of phenomena that we can model but are not just simply in this image,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1741.914,
    "end": 1745.018,
    "text": " you mentioned like learning new policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1745.378,
    "end": 1756.31,
    "text": "So it's like in the fixed, fixed, fixed case, you're still able to do action selection, but you're not learning or changing which policies you can enact",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1757.073,
    "end": 1768.566,
    "text": " you're not changing what affordances you believe you have, nor are you updating B, which is to say you're not updating your beliefs about how policies influence hidden state changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1769.647,
    "end": 1778.357,
    "text": "The next level of introduction of novelty is learning on B, where you can learn about the different consequences of policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1779.198,
    "end": 1798.408,
    "text": " And then another level, which is starting to approach into like the structural learning, because you're actually changing not just parameters within the model, but dimensionality of parameters within the model is like, well, what if I take a policy that opens up another set of possible policies?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1800.029,
    "end": 1804.952,
    "text": "So this is like, see the cat run of sentences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1806.468,
    "end": 1813.47,
    "text": " And to introduce recursive or referential clauses or learning, it's a more complex sentence, so to speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1815.391,
    "end": 1825.634,
    "text": "But this is the archetype that sets the stage for what cognitive model structures could exhibit that kind of a phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1825.914,
    "end": 1826.154,
    "text": "Michael?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1829.215,
    "end": 1839.643,
    "text": " Yeah, so a policy would be a number of actions, would be a sequence of states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1840.504,
    "end": 1843.366,
    "text": "Am I understanding correct?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1843.967,
    "end": 1849.972,
    "text": "And if this is the case, then a policy would select a number of states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1851.61,
    "end": 1861.394,
    "text": " And my question, I guess, is so then I come at the end, or at what point are these policies then calculated?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1861.414,
    "end": 1875.241,
    "text": "So I come to the end of an action, and then only is the new policy computer selected, or is it constantly the case?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1879.383,
    "end": 1891.49,
    "text": " So if I decide to buy a bread, for instance, and then I go out and I cross the street and do this and that, so there is a couple of actions involved.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1891.91,
    "end": 1895.532,
    "text": "And so my decision to buy a bread was done before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1895.652,
    "end": 1900.635,
    "text": "But on the way, is that policy recalculated?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1900.715,
    "end": 1903.036,
    "text": "And maybe on the way, I think, oh,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1906.813,
    "end": 1909.534,
    "text": " something else is more reasonable to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1913.396,
    "end": 1921.279,
    "text": "Okay, so again, that's a slightly nested scenario with multiple levels of policy that you're looking at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1921.719,
    "end": 1925.08,
    "text": "And then just to be clear, so policy, it's a sequence of actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1925.14,
    "end": 1929.162,
    "text": "So let's just say that the affordances, there's two affordances, up or down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1930.282,
    "end": 1931.523,
    "text": "And then time horizon is three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1932.776,
    "end": 1933.597,
    "text": " Well, let's just say it's two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1935.279,
    "end": 1939.724,
    "text": "There are four policies, UU, UD, DU, DD.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1940.885,
    "end": 1947.073,
    "text": "So generating the state space of policies is trivial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1948.074,
    "end": 1951.318,
    "text": "It's just all of the strings of affordances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1952.97,
    "end": 1957.133,
    "text": " Now you ask, where does policy inference happen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1957.534,
    "end": 1958.474,
    "text": "Where and how does it happen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1958.494,
    "end": 1959.635,
    "text": "And there's a few different answers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1960.015,
    "end": 1964.099,
    "text": "So first off, here's from our active inference and modeling conflict paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1964.479,
    "end": 1967.221,
    "text": "Here, we chose to show only a two-step model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1968.562,
    "end": 1973.025,
    "text": "So instead of the three, because we were anticipating that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1973.991,
    "end": 2002.054,
    "text": " um ambiguity where pi is intervening twice when actually control is only exerted at any given moment but it's it's anticipated um and then we map this onto the uda observe orient decide act this isn't a formal mapping per se but it it helps understand sequentially for example in a reactive mass message passing paradigm",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2003.323,
    "end": 2030.64,
    "text": " what different informally categorized states of the perception cognition action cycle how that maps onto this bayesian graph so since states come in cognition on occurs or one could also take a broader perspective then but this updates one's beliefs about the world then there's an inference on action",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2031.724,
    "end": 2039.129,
    "text": " So here are the antecedents of policy selection, which are E, what can be done, the affordances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2039.849,
    "end": 2044.072,
    "text": "C, what is preferred, the preferences, preferred slash expected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2044.952,
    "end": 2060.382,
    "text": "And then with C and E, as it shows here, G is a function of policies conditioned upon C and E.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2061.867,
    "end": 2085.943,
    "text": " with those antecedents taken care of we can update our beliefs on pi to move from a policy prior to a policy posterior those policy posteriors can then be sampled from as discussed earlier at high low or neutral temperature and then the selected policy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2087.992,
    "end": 2098.295,
    "text": " intervenes and ends up choosing a slice in B. And then the slice of B that's chosen influences how the hidden states change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2099.816,
    "end": 2110.36,
    "text": "For example, if there's two policies on a one time set basis, so same as the affordances in this case, turn on the heater or do not turn on the heater.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2111.24,
    "end": 2117.322,
    "text": "So maybe if we don't turn on the heater, then the B matrix just passes the hidden state forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2117.981,
    "end": 2118.881,
    "text": " the temperature doesn't change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2120.041,
    "end": 2123.302,
    "text": "If we do turn on the heater, the temperature increases immediately.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2123.702,
    "end": 2124.802,
    "text": "Again, simple example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2126.302,
    "end": 2134.424,
    "text": "So we looked at the thermometer, O, updated our belief given our priors about the temperature of the room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2135.644,
    "end": 2147.126,
    "text": "Then with respect to what we can do, E, and what we expect slash prefer, C, we updated our policy prior into a policy posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2148.342,
    "end": 2161.374,
    "text": " We then selected the action that's most likely, not the most rewarding action, the most likely action, and that influenced how the hidden states change through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2162.815,
    "end": 2164.457,
    "text": "And then the OODA cycle begins again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2167.44,
    "end": 2173.946,
    "text": "So action intervenes in the discrete time formalization, which is where we're in chapter seven,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2176.013,
    "end": 2179.476,
    "text": " It intervenes in every time click.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2183.199,
    "end": 2184.319,
    "text": "Okay, thank you so much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2186.401,
    "end": 2205.476,
    "text": "And also, The Pragmatic Turn is a book co-edited by Friston, but it discusses what has happened in neuroscience with people embedding action and thinking about action in neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2207.216,
    "end": 2210.037,
    "text": " And that's relatively recent, which is really exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2213.118,
    "end": 2213.378,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2213.498,
    "end": 2214.758,
    "text": "But these are, these are great questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2215.238,
    "end": 2224.321,
    "text": "And then let's just also go to the second question that you raised there, and then we'll scan through all of chapter seven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2225.181,
    "end": 2231.783,
    "text": "So is the A matrix in figure 7.3 conditioned on one state or a series of states?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2232.363,
    "end": 2235.024,
    "text": "So yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2236.755,
    "end": 2264.038,
    "text": " Jakob feel free to add any more details on this one but as it's shown here from a base graph perspective it is O is only conditioned on S but when we think about across the vector of observations they can be understood as being conditioned upon the time series of hidden states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2266.812,
    "end": 2294.999,
    "text": " so each observation is only conditioned upon its associated hidden state that's the partially observable and hidden states pass through the markov needle of the presence that's the markovian property the past only influences the future through the present which isn't to say that's how reality is that just to say it's a simplifying structural assumption that one could vary if they chose",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2299.96,
    "end": 2301.961,
    "text": " but it is a little ambiguous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2301.981,
    "end": 2317.928,
    "text": "I can see why somebody might think that observation at a given T, let's say T plus one, is a function that's conditioned upon all the previous times, but not directly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2321.409,
    "end": 2323.01,
    "text": "Observations are like cul-de-sacs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2325.851,
    "end": 2328.052,
    "text": "And again, A is the tail of two densities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2329.195,
    "end": 2353.721,
    "text": " the recognition density which is from observations updating beliefs about hidden states bayesian recognition model and the generative density which is from a hidden state generating pseudo observations and the way that those two densities can be alternated",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2354.691,
    "end": 2384.274,
    "text": " is used and has been used for decades in expectation maximization algorithms okay cool great questions here um does anyone want to go to any of the chapter seven questions or should we scan through in the last 15 minutes here just like what happens in chapter seven",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2388.584,
    "end": 2417.569,
    "text": " all right let's scan raise your hands when you want and i'll immediately go to you if you want to um just add a note on like as we scan through so we will scan through the whole thing in the next 10 minutes okay starting with the quote what i cannot create i do not understand famous quote take it or leave it but now we're into the building the recipe has been disclosed in chapter six",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2419.5,
    "end": 2440.608,
    "text": " prerequisite knowledge has been distributed in chapters one through five ideally they start with perceptual processing this is very much like the step-by-step paper step by step starts even simpler with starting with just a static inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2441.53,
    "end": 2467.827,
    "text": " but here they go immediately to dynamic perceptual inference this is just the bottom of the rake this is a passive inference but it is changing through time they're going to be using a music example speaking to their target audience which is ali um a musical example",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2468.931,
    "end": 2495.016,
    "text": " so we're listening to some music not necessarily playing the music but the outcome is the note that's actually intended i'm sorry the outcome is what is actually played and the hidden state is the intended note and just from looking at this a matrix we can see that like on the diagonals if it was the identity matrix",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2496.249,
    "end": 2520.807,
    "text": " that would mean that there was a perfect mapping between hidden state and observations but this is not an identity matrix it has off diagonal values which is to say it's like a blurry a matrix and in the limit of a blurry a an ambiguous a you can imagine if it was all 2.5s across then there would be no information on hidden state given the outcome",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2521.906,
    "end": 2524.908,
    "text": " The other extreme would be perfect information with the identity matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2525.429,
    "end": 2527.43,
    "text": "And you can see that it's also rescaled.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2528.211,
    "end": 2535.216,
    "text": "So the numbers can be shown kind of simply as integers and then it's rescaled so that it's a proper probability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2536.157,
    "end": 2539.419,
    "text": "So 70% of the time, the musician hits their intended note.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2541.14,
    "end": 2543.122,
    "text": "Row one, column one, seven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2546.324,
    "end": 2549.147,
    "text": "B is the probability of transitions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2550.256,
    "end": 2553.378,
    "text": " So we go from note one to note two with 97.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2553.698,
    "end": 2555.279,
    "text": "So notice the diagonal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2556.819,
    "end": 2564.523,
    "text": "If that was the identity matrix on B, if that was all B was, you would basically dwell wherever you began.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2565.964,
    "end": 2571.227,
    "text": "If B is all off diagonal, you never stay in the same spot twice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2572.247,
    "end": 2573.548,
    "text": "And so here is a sequence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2574.941,
    "end": 2596.29,
    "text": " of notes because one almost always moves to two two almost always moves to three three almost always moves to four and four almost always moves to one then d is the prior and so it's just being taken as a noiseless estimate that the first note is the beginning note michael",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2597.748,
    "end": 2603.711,
    "text": " So is this a very boring tune that plays four notes in the round eternally?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2604.832,
    "end": 2605.292,
    "text": "Exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2605.392,
    "end": 2613.817,
    "text": "It's like G-E-B in Eternal Golden Braid, except it's like G-E-B-X.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2614.237,
    "end": 2615.698,
    "text": "G-E-B-X.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2616.458,
    "end": 2617.519,
    "text": "Okay, very boring.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2618.099,
    "end": 2619.6,
    "text": "Yes, it is a simple one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2620.805,
    "end": 2650.055,
    "text": " so 7.1 to 7.3 equations completely specify the hmm note that it's a hidden markov model because it has this partially observable character but it's not a decision process because there's no action selection but all we needed to do was to specify a b and d so to totally specify the hmm was a b d we didn't have to say which notes we preferred we didn't have to say anything about what we could do with c or e okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2651.201,
    "end": 2677.191,
    "text": " then there are some simulations shown um there's a few things about this simulation first as the earlier question has raised why are there continuous interpolations when we're in the discrete time world a general comment is these graphs with multiple black lines are a little hard to interpret because of course we can't tell which line is which",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2678.777,
    "end": 2704.36,
    "text": " another issue with 7.2 figures specifically is the bottom left quadrant is empty so just a few points but what's basically happening is in this simulation run which would only happen this way um several percent of the time but they're showing it um basically um in the upper right um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2706.522,
    "end": 2729.839,
    "text": " the retrospective beliefs are shown so the retrospective beliefs are shown with a correct song even though the actual observations were note one two two four so this observation was recognized and it did increase the posterior on note three being played",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2730.865,
    "end": 2742.907,
    "text": " However, because the belief was so strong that note three would be played in this time, it did not move the needle far enough to actually hear that note.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2744.248,
    "end": 2749.369,
    "text": "So that's like when somebody hears something that isn't said because it's likely that it was said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2751.649,
    "end": 2756.35,
    "text": "Okay, so that's a fun model, but it's not action inference yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2756.43,
    "end": 2759.811,
    "text": "So that's where we get to 7.3, where we've been spending a lot of today's discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2762.015,
    "end": 2767.437,
    "text": " 7.3 discusses the addition of an extra variable on which transition probabilities are conditioned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2768.157,
    "end": 2788.083,
    "text": "So it's like really, when we think B, we should really think B vertical line pi, because the inference on action means that we have actual options for action, which is to say there are multiple Bs that can influence how S unfolds,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2789.181,
    "end": 2801.553,
    "text": " So we're really talking about B's condition on policy, unless we're talking about like the whole B caterpillar, the whole tensor of B. Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2803.255,
    "end": 2809.641,
    "text": "Here's where expected free energy and one of the partitionings is shown.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2810.782,
    "end": 2839.43,
    "text": " which is discussed in chapter two equation 2.6 and in chapter four so next week when we're in chapter seven for the second time let's can let's return talk a little bit more about the technical parts of like what exactly equation 7.4 means um it's a decomposition that enables epistemic drive towards information gathering that's this first part of the right hand side and the pragmatic drive",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2840.424,
    "end": 2854.631,
    "text": " which is about realizing prior beliefs, reducing surprise about prior beliefs, not maximizing a reward function, reducing diversions between preferences and outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2856.351,
    "end": 2867.937,
    "text": "They're going to unpack the full 7.3 figure in the context of a teammates, which is a rat that's able to go left or right to find food or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2869.751,
    "end": 2895.441,
    "text": " or it's able to get a q that's the q location r there's four locations that it can be in and there's modeler degrees of freedom and how different things are represented so this isn't even the only way to represent this toy example but this matrix does a really good job of showing like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2896.667,
    "end": 2923.304,
    "text": " what are the states what are the dimensionality of the difference variables which we can come to next week so here's context two here's context one here we have black on the right side white on the left here we have black on the left white on the right and there's some subtle differences which you can note like specifically with lines two and three here's a one here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2924.673,
    "end": 2929.935,
    "text": " Here's a one on the third line because the cue is suggesting that it's on the right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2930.955,
    "end": 2933.016,
    "text": "Here, the cue is showing it's on the left.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2933.596,
    "end": 2942.339,
    "text": "And in model stream 7.2, that example is like very hands-on and in some ways even better than this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2942.82,
    "end": 2947.241,
    "text": "And it includes things like learning, but it's a very similar task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2949.922,
    "end": 2950.762,
    "text": "Here is B2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2953.652,
    "end": 2969.373,
    "text": " so they're showing the dimensionality of what those B slices look like for different policies this is representing the B tensor here are preferences",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2971.857,
    "end": 2974.058,
    "text": " This is what a preference vector looks like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2974.799,
    "end": 2984.464,
    "text": "And in step-by-step, the paper and Model Stream 1 series and in Model Stream 7 series, there's some discussion on what does C mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2985.205,
    "end": 2989.427,
    "text": "Is it being reflected as log probabilities?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2990.548,
    "end": 2994.91,
    "text": "Why would one do 6 and negative 6 versus 6,000 and negative 6,000 or 0.6 and negative 0.6?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2994.95,
    "end": 2996.031,
    "text": "What do those values actually mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3001.579,
    "end": 3003.181,
    "text": " and the priors provided.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3004.062,
    "end": 3017.695,
    "text": "So now that we've provided a controllable B, which is the manifestation of policy options, and provided a C, we can do active inference because we have now",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3021.007,
    "end": 3050.283,
    "text": " we need those two pieces really that's what brought us from the hmm to the pomdp was what we can do and what we prefer um section 7.4 goes into information seeking it unpacks the epistemic value into a few more sub decompositions and it talks about how that plays out there's some nuance here again there's also some semi-confusing black and white graphs",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3051.564,
    "end": 3053.405,
    "text": " but other ones are clear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3054.585,
    "end": 3060.447,
    "text": "We can talk about how epistemic value is being realized in this example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3069.97,
    "end": 3077.673,
    "text": "Box one is a bit of a side note on uncertainty and precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3078.795,
    "end": 3107.565,
    "text": " and here's showing really the temperature or the precision highest temperature lowest entropy most uniform distribution lowest temperature highest entropy most specific distribution here you're sharpening here you're blurring okay 7.9 as mentioned um two pages earlier is an isocate so um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3109.096,
    "end": 3112.939,
    "text": " There are four locations and the I's are circading.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3113.7,
    "end": 3123.407,
    "text": "Again, one could ask about where are these continuous interpolations coming from since we're in chapter seven in a fully discrete situation, but it's all good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3124.068,
    "end": 3133.796,
    "text": "So I circading different sequences or traces of I circades across four locations driven by epistemic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3138.126,
    "end": 3154.014,
    "text": " in section 7.5 learning and novelty is introduced so as we were mentioning earlier learning with respect to the a or the b matrix so far we've been talking about them as fixed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3155.239,
    "end": 3180.386,
    "text": " here is where learning happens on a and b and just like you would do with any bayesian inference whether on action or on the consequences of action or on perception learning is modeled as a hyper prior or a variable that governs a prior on another parameter so here is like a parameter um that is adding a layer",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3181.306,
    "end": 3195.603,
    "text": " to the rake we still see the core figure 4.3 figure 7.3 motif but there are these new little edges that are the learning edges so it's the same POMDP as figure 7.3",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3197.318,
    "end": 3202.721,
    "text": " But the priors for each hidden states now depend on the variables which themselves come with prior beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3203.481,
    "end": 3216.288,
    "text": "So the prior on the variables A and B is in the Bayesian paradigm how we learn or update our values on A and B. Brief discussion on conjugate priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3217.729,
    "end": 3225.694,
    "text": "Some more equations that we can come to next week about updating and learning on A.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3231.05,
    "end": 3258.102,
    "text": " another look in equation 711 on g which is very similar to what we saw in equation 2.6 different partitionings on expected free energy policy then there's a final example that's now in a maze and so this is some maze seeking entity we can come to this next week",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3260.095,
    "end": 3271.308,
    "text": " in hierarchical inference, hierarchical or deep inference, something we kind of mentioned today, but we'll look more at next week, is first there's a box on structure learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3272.574,
    "end": 3294.839,
    "text": " which as mentioned earlier is when we think about regular non-structure learning as like fine-tuning quantitative parameters within a given dimensionally defined generative model structure learning and what you can do with structure learning like specifically Bayesian model reduction is when we're actually modifying the dimensionality of the generative model that's in box 7.3",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3297.028,
    "end": 3312.177,
    "text": " Here is a nested generative model, which is almost exactly the form that we looked at from live stream 42, where we see like the rake, classical, figure 4.3, figure 7.3 paradigm, and then there's like a meta rake.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3313.058,
    "end": 3317.74,
    "text": " where here's another E, downward facing, and we have policy at a higher level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3318.261,
    "end": 3323.583,
    "text": "And different generative models have taken different interpretations on what the lower and the higher level are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3324.083,
    "end": 3331.127,
    "text": "Like in Livestream 42, the lower level was tactical movement of a robot, and the higher level was strategic location preference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3331.627,
    "end": 3339.811,
    "text": "Whereas in Livestream 28, Sanved Smith et al., the higher levels were associated with attention, and the lower levels with perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3342.088,
    "end": 3347.05,
    "text": " Another example with decision-making we'll come to, and then the chapter summarizes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3347.29,
    "end": 3350.052,
    "text": "So thank you for this session.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3350.452,
    "end": 3353.413,
    "text": "We'll stop recording and take a break before the next one.",
    "speaker": "SPEAKER_00"
  }
]