[
  {
    "start": 2.292,
    "end": 30.358,
    "text": " All right hello everyone it is cohort five meeting two and we're in our first discussion of chapter one so to begin with what is anyone's just first take or on chapter one or where does anybody want to begin and then we'll look at the specific questions but is there any just first overviews or just pieces that people want to share about chapter one or just this first discussion",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 36.768,
    "end": 38.631,
    "text": " You can just go for it if you want to ask me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 46.523,
    "end": 55.216,
    "text": "So my biggest question is around surprise and what the I guess the parameters and boundaries of that is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 55.276,
    "end": 64.53,
    "text": "And well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 71.632,
    "end": 83.022,
    "text": " Sorry, I think a part of my long time preceding the literature is like the use of some terms like this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 83.802,
    "end": 98.014,
    "text": "And this might be because I'm also a non-native speaker, but like the term of like a normative principle, like I'm still not sure what it means or like, you know, later on, they say like epistemic this and stuff.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 98.034,
    "end": 101.217,
    "text": "And I'm just like very confused by those terms.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 101.635,
    "end": 108.967,
    "text": " So maybe clarifying what it means to be a normative principle will be a very useful thing for me.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 115.477,
    "end": 115.838,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 116.679,
    "end": 124.251,
    "text": "Let's just see if it's been asked overall, because as Ali can probably attest to,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 128.213,
    "end": 141.972,
    "text": " Well, let's just like at least think of it doesn't want to add a thought on this, like just on it uses the terms overall or we can look more specifically at what is meant by normativity like in Chapter one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 147.119,
    "end": 150.103,
    "text": "I was also having some.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 151.484,
    "end": 180.124,
    "text": " um uncertainty about the use of the term I had previously had an understanding that normative uh the term described something that uh the way that some something should be as opposed to being descript a descriptive um theory for example which is which is simply stating what what is observed but I",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 181.859,
    "end": 201.792,
    "text": " uh in the way that it's introduced here uh normative is used more i think uh placing an emphasis on the ability to to look at a quantity and measure some behavior in terms of that quantity and um",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 204.539,
    "end": 228.167,
    "text": " uh emphasizing that's better behavior or behavior that's more in alignment with what the theory is suggesting will will optimize that quantity that's my understanding so far but i'd like to be more clear thank you ali go for it",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 231.438,
    "end": 246.901,
    "text": " So normative, I mean, the use of the term normative here in active inference literature is closely related to the meaning of this term in, say, philosophical literature and stuff.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 246.961,
    "end": 260.601,
    "text": "So basically in philosophy or more specifically in ethics, when we talk about the normative behavior or, I don't know, normative behavior,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 261.357,
    "end": 283.618,
    "text": " action uh it's uh it's interpreted as something ethical uh or moral uh and the reason we ascribe uh this kind of meaning to normans to this term normative is because we have a standard of action or behavior against which we can compare our own action",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 283.598,
    "end": 289.71,
    "text": " and then judge by way of comparing it whether it is ethical or not.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 290.251,
    "end": 303.497,
    "text": "So by the same token, we can talk about normativity here in this context of active inference when we talk about the standard for optimization of our action and perception.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 304.22,
    "end": 322.146,
    "text": " namely the free energy against which the error or the deviation of the action and perception from data standard can be evaluated and then corrected or accounted for.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 322.526,
    "end": 328.455,
    "text": "So that's why, I mean, researchers in active inference area",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 328.79,
    "end": 344.622,
    "text": " I use the term normative or normativity to refer to this kind of comparison between the action and kind of a standard for optimization of that action.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 350.204,
    "end": 377.427,
    "text": " would kind of question whether that would be tied to ethics though because norms don't necessarily um align with ethical behaviors and of course ethical is subjective but you know norms have been you know for example been leaning more toward coercive um and exploitive behaviors",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 377.896,
    "end": 402.233,
    "text": " uh which in my in my world is not ethical but uh you know so I don't know I'd like to see the yeah those two tied apart especially as far as how people act because ethics are you know are not um are not universal um and coercive coercive behaviors",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 403.124,
    "end": 413.974,
    "text": " tend to get more benefits in U.S.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 413.994,
    "end": 415.756,
    "text": "society, but maybe not other places.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 420.14,
    "end": 423.603,
    "text": "Yeah, I guess it's not so obvious to me the connection with ethics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 423.623,
    "end": 431.19,
    "text": "You know, I come to these ideas from like searching first principle ways to understand",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 431.407,
    "end": 436.692,
    "text": " Gorka Puente , Self organization of main components, so my feeling is that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 437.633,
    "end": 446.481,
    "text": "Gorka Puente , You know there's nothing about our subjective ethical more or more things here so some so yeah I mean the fact that we have this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 446.501,
    "end": 456.891,
    "text": "Gorka Puente , Confusion really reveals that maybe normally shouldn't be the word that is being used here because it's just like what we have so many meanings in so many contexts so.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 458.152,
    "end": 458.713,
    "text": "Gorka Puente , I don't know.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 460.297,
    "end": 461.599,
    "text": " It is very cultural.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 462.54,
    "end": 488.852,
    "text": "But perhaps, I mean, if we look at it as just a standard for optimization within a certain, a certain definition of the system, then, you know, if we don't get too caught up on our, whatever our conceived notions or subjective notions of normative as a normal and social norms, but just look at it as a optimal behavior within the parameters of the system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 490.857,
    "end": 492.879,
    "text": " Yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 492.9,
    "end": 497.826,
    "text": "So if I may clear that up a little bit.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 498.166,
    "end": 513.485,
    "text": "Well, I mean, what I meant was not that the the word normativity is used in exactly the same way as it's used in, I don't know, philosophical literature or ethics.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 514.326,
    "end": 516.088,
    "text": "It's just",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 516.473,
    "end": 522.805,
    "text": " I mean, a related term that's used in its technical sense in active inference literature.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 522.845,
    "end": 534.668,
    "text": "So I agree that we can, maybe it's too naive to take that same meaning from philosophical literature",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 534.648,
    "end": 543.382,
    "text": " and use it directly in this context to refer to something, I don't know, as a social norm or standard or whatever.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 543.422,
    "end": 559.407,
    "text": "But again, in this technical context, norm here just means a standard against which the optimization of the system happens.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 559.387,
    "end": 562.12,
    "text": " that's what all there is to it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 562.2,
    "end": 566.038,
    "text": "So it's not something",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 566.744,
    "end": 591.334,
    "text": " it's not something that can be applied to derive any kind of ethics or morality or whatever it's just a way of describing a system against a specific standard for optimization namely the free energy so that's why this term is used here and also",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 591.652,
    "end": 600.483,
    "text": " Rameen Mohammadi, If we want to use the first principle way of describing things we need to have these kinds of.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 600.543,
    "end": 603.127,
    "text": "Rameen Mohammadi, It is the precise.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 603.707,
    "end": 611.938,
    "text": "Rameen Mohammadi, Precise definitions for those standards for optimization because it's a way of rigorously building up.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 611.918,
    "end": 614.743,
    "text": " our descriptive model.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 615.204,
    "end": 638.162,
    "text": "So that's necessary to have a very strict and rigorous definition for any standard if we want to build up models rigorously enough to be useful for modeling any complex behavior of cognitive agents.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 642.563,
    "end": 655.989,
    "text": " So basically, if I understand from this discussion, can I, you know, when in part 1.4.1 says active inferences a normative framework to characterize base optimal behavior and cognition in living organisms.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 657.331,
    "end": 660.437,
    "text": "Does that mean that what it's saying is that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 662.071,
    "end": 675.329,
    "text": " Pablo Padilla- Active inference as a theoretical framework just sets the objective function of what systems must do, which is to minimize the ratio of free energy so normative just refers to.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 675.369,
    "end": 685.243,
    "text": "Pablo Padilla- The fact that active in France establishes the rules by which systems have to play kind of thing is that a good interpretation of what normative means.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 686.168,
    "end": 687.229,
    "text": " Yeah, more or less.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 687.669,
    "end": 689.711,
    "text": "That's what all there is to it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 689.751,
    "end": 690.492,
    "text": "Yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 690.512,
    "end": 705.487,
    "text": "And also there's a more explicit definition of this term normativity in, I guess, notes one from Chapter one on page let me see the 267.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 705.807,
    "end": 714.015,
    "text": "So yeah, here the term normative means there is some evaluative standard against which behavior can be scored.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 714.333,
    "end": 722.685,
    "text": " Active inference is normative in the sense that perception and action are scored by free energy, a quantity we will unpack throughout this and the next chapters.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 728.513,
    "end": 730.115,
    "text": "These are all really great points.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 730.876,
    "end": 737.505,
    "text": "One analogy that I find very useful or a set like more machine learning and more classically statistical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 737.789,
    "end": 754.212,
    "text": " is by now the variational free energy playing the role of the l2 regression fitting norm in linear modeling so linear modeling doesn't just mean straight lines so check out the earlier friston fmri work on spm which extends generalized linear",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 754.31,
    "end": 778.393,
    "text": " modeling so fitting the l2 norm doesn't mean that the model is adequate it doesn't mean it's going to work if something changes about the underlying data process and so on like it's none of no modeling process can say anything about how well the outcome works but this loss function the l2 norm and linear regression or like the loss function",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 778.373,
    "end": 804.043,
    "text": " in uh training a neural network these are analogous to the variational free energy such that however you set up a generative model it's going to have this like base optimal like it it's it's going to look like it's on its path of least action given how it's set up with this loss function so I agree with Ali absolutely it's very it's a more of like a methodological or a computational normativity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 805.913,
    "end": 832.191,
    "text": " in terms of being variational free energy being more like a loss function okay that's one that's one angle on the normativity but I think this is also one discussion that we return to many times which is just how does something that can describe anything like we describe things to the to the extent of their thingness for some statistical pattern",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 833.808,
    "end": 858.145,
    "text": " or for all these other ways of modeling which is kind of what this um approach ends up looking like in generating these cognitive models like how how can it be measuring everything what is what is something that measures everything say what does the a meter stick say so understanding like measurement and then all this susan",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 861.196,
    "end": 863.819,
    "text": " Barbara Kirby, So so that's that's an interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 864.82,
    "end": 868.424,
    "text": "Barbara Kirby, concept so it's it's not pointing toward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 869.325,
    "end": 872.589,
    "text": "Barbara Kirby, The outcome as much as it is the value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 874.651,
    "end": 883.761,
    "text": "Barbara Kirby, The optimized value would that be, in other words, or is the model yeah I understand it's ideology free.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 884.348,
    "end": 897.288,
    "text": " Um, or, you know, I'm assuming I'm, I'm inferring that, um, but yeah, you, the, the perception is, uh, aiming toward a goal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 897.789,
    "end": 902.436,
    "text": "So the goal being a value versus an outcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 911.49,
    "end": 911.79,
    "text": "There's a lot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 912.142,
    "end": 916.903,
    "text": " there but it it there's just and of course these are just like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 919.297,
    "end": 942.62,
    "text": " various different people's perspective on it, but in one view, it has equal ideological status to a measurement tool, as a measurement tool, the kind of narrow sense, which it actually looks like when we get through chapter six, the recipe for making the active inference generative model, which was like alluded to earlier, like that's the difference between having a generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 942.72,
    "end": 947.785,
    "text": "Once the generative model is specified slash to the extent it's specified,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 947.765,
    "end": 961.234,
    "text": " it is going to do the most statistically likely thing but that can include a noisy distribution for perception action so something being uncertain doesn't mean that it's not the likeliest path",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 962.328,
    "end": 967.757,
    "text": " That is done in the model with like a parameter that describes how noisy something should be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 968.818,
    "end": 972.103,
    "text": "That's like variance estimation, Bayesian hyperparameters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 973.325,
    "end": 990.192,
    "text": "So just because it seems it shouldn't feel constraining in terms of developing like a phenomena that seeks information or something like this normativity isn't a like far reaching claim.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 994.913,
    "end": 1016.82,
    "text": " and then there then there's all of these other kind of aspects that come into play in the actual modeling mostly from the system of interest just like people use linear modeling across fields and then there's statistics into all of the development that happens in statistics just that that's one kind of deflationary view",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1018.673,
    "end": 1030.966,
    "text": " that is more like the statistical parametric mapping earlier Fristen work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1030.986,
    "end": 1046.622,
    "text": "And also one other point perhaps worth mentioning here is that FEP and active inference is employed to describe any complex system or any self-organizing system",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1047.209,
    "end": 1063.885,
    "text": " that looks as if it takes the action through which the free energy or that norm I was talking about is minimized or optimized, regardless of whether the,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1063.865,
    "end": 1093.585,
    "text": " uh agent of interest has any conscious awareness of its intentions or not so it can be applied both to um conscious cognitive agents uh as well as to uh i don't know uh anything that's that only has uh very simple basal cognition and uh a very simple sense of um",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1094.358,
    "end": 1095.84,
    "text": " C Sinan Gunturk, Ph.D.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1095.48,
    "end": 1107.52,
    "text": ": agency and goal directed behavior so that makes FEP and active inference broad enough to encompass all of these systems under.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1107.54,
    "end": 1109.223,
    "text": "C Sinan Gunturk, Ph.D.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1109.203,
    "end": 1114.071,
    "text": ": A similar or even identical mathematical technology.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1118.759,
    "end": 1119.36,
    "text": " Thank you, Ali.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1119.76,
    "end": 1125.186,
    "text": "Just like the linear regression can be used across different scales of the system, all the work is in the modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1126.708,
    "end": 1139.062,
    "text": "So this is like the textbook is oriented towards people on the first half who want to learn about the topic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1140.604,
    "end": 1143.147,
    "text": "Also, this is the first textbook, so it's kind of like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1144.257,
    "end": 1153.997,
    "text": " We bring in a lot of other things that have happened since, and people can continue to bring things in because this is just one view, but the first five chapters are more on learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1155.665,
    "end": 1180.479,
    "text": " active inference, or then the second half, even though we don't have all the kind of pieces in place, but making the generative model the second half, a lot of the very philosophical, very general questions, it becomes easier to partition the questions into like, what's a question more about an implementation in a given system of interest?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1182.362,
    "end": 1185.486,
    "text": "And then what is the question about the more general",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1186.9,
    "end": 1200.657,
    "text": " um usage of the term but to kind of return all the way to the initial point which is certainly felt by all like the active inference ontology which is to say like the language and the terms like is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1202.543,
    "end": 1232.533,
    "text": " some terms that are used uh commonly but used in seemingly a different sense here's one way that through the active inference ontology we like at least start to make sense of this and and you're always welcome to use the at sign to like connect it to an ontology term i don't know if every single word but it benefits to see it that way um but like it helps emphasize that it isn't an infinite slash open-ended set of terms that are being used",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1232.513,
    "end": 1261.339,
    "text": " um it's from a few subfields where terms are being used exactly and specifically and technically mostly from bayesian statistics there's also some terms from on the inbound and on the sense making side from like signal processing ecological psychology as well as on the outgoing more action and control theory so there's those kinds of terms",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1261.319,
    "end": 1267.178,
    "text": " that describe like broadly cybernetic agents are being used essentially exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1268.305,
    "end": 1288.551,
    "text": " And then for many of the terms, these are just proposed, just which, which may or may not be used exactly by any given author, but a lot of the terms have like a narrower technical sense and then a more general uses like attention or anticipation or normativity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1288.571,
    "end": 1296.0,
    "text": "It's like, it like can be used in seemingly different or, um, a narrow, a broader way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1298.917,
    "end": 1307.889,
    "text": " There's a lot to say in how we all, I guess, learn and use the terms correctly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1307.929,
    "end": 1321.347,
    "text": "Another piece to add just on the ontology is the terms are not just mostly drawn from these computational areas, but the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1326.659,
    "end": 1328.201,
    "text": " I'll just leave it at that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1328.221,
    "end": 1329.362,
    "text": "Anyone else want to add something?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1331.325,
    "end": 1339.175,
    "text": "Just on that, following that path, I'd like to clarify a few things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1339.696,
    "end": 1353.233,
    "text": "So when we're talking about surprise, we're using that term essentially in the terms of like entropy in information theory, more or less like the Shannon entropy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1354.454,
    "end": 1354.995,
    "text": "Correct?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1355.279,
    "end": 1366.853,
    "text": " and slash, if so, when we're talking about, because minimizing surprise turns out to be challenging for technical reasons, we use variational free energy as a proxy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1368.335,
    "end": 1374.562,
    "text": "So I'd just like a little clarity on those technical reasons that minimizing surprise is so difficult.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1374.602,
    "end": 1381.911,
    "text": "Is that because it's just too broad of a series of possibilities for a Bayesian calculation?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1383.275,
    "end": 1392.23,
    "text": " And then so what's the and then what's the mechanism of using free energy as the principal bits because we're just we're doing a divergence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1395.836,
    "end": 1396.978,
    "text": "That's my understanding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1398.782,
    "end": 1400.845,
    "text": "But clarification would be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1402.027,
    "end": 1402.267,
    "text": "Nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1402.688,
    "end": 1408.438,
    "text": "Yeah, Ali, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1410.713,
    "end": 1413.378,
    "text": " Martin Anderson- yeah we'll come to these questions.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1414.741,
    "end": 1426.684,
    "text": "Martin Anderson- In Chapter two, I guess, and particularly in on page 19 and 20 so yeah The idea here is, although.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1427.566,
    "end": 1432.215,
    "text": "Martin Anderson- The value that needs to be optimized exactly is.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1432.364,
    "end": 1460.464,
    "text": " the free energy but in practice uh optimizing or minimizing this value uh precisely or uh in its exact uh bayesian inference way uh would prove intractable so um the way to somehow solve this solve this issue of intractability is to provide a kind of lower bound",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1460.714,
    "end": 1479.567,
    "text": " uh that needs to be optimized uh called variational free energy so uh except for very simple scenarios in every real time uh real time real real world situations uh there is this",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1479.547,
    "end": 1497.569,
    "text": " lower bound that needs to be optimized and not exactly the free energy or the surprise, although the theory of active inference evolves around this idea of optimizing this specific normal value, namely free energy.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1497.609,
    "end": 1503.917,
    "text": "But in practice, that's the variation of free energy that needs to be",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1504.201,
    "end": 1507.065,
    "text": " optimize as the lower bound of surprise.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1507.566,
    "end": 1521.066,
    "text": "So yeah, surprise or surprisal is used in its statistical sense in active inference literature, and it doesn't exactly map onto the psychological sense of the term.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1521.927,
    "end": 1532.082,
    "text": "And again, it's a technical word and it doesn't necessarily refer to, it doesn't require any",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1532.062,
    "end": 1559.993,
    "text": " um cognitive or conscious agent uh for this kind of informational or statistical surprisal uh to be defined uh it's just uh yeah something that can be defined purely in its mathematical terms uh using the parameters of the system of interest um yeah inks",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1564.242,
    "end": 1565.684,
    "text": " Hi.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1565.704,
    "end": 1571.671,
    "text": "So I come from linguistics, so I plan to learn all this math very soon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1572.272,
    "end": 1580.422,
    "text": "But my question is this, the low road and the high road, are they like the same?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1580.622,
    "end": 1582.564,
    "text": "Oh, you guys can't see because I've blurred.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1583.886,
    "end": 1589.052,
    "text": "Are they like the same journey from two points of view, like a tube?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1589.167,
    "end": 1594.357,
    "text": " which is a microscope if you look on one side and a telescope if you look on the other side?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1594.557,
    "end": 1610.989,
    "text": "Or are they completely traversing different domains the way like syntax and semantics, they do meet and they kind of like interlock, but they are, they walk the chessboard with a different stitch step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1618.698,
    "end": 1619.839,
    "text": " Manuel, thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1622.363,
    "end": 1629.732,
    "text": "Just before, I guess, addressing that, I wanted to say how I understand the limitations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1629.772,
    "end": 1634.619,
    "text": "So to Jesse, I don't know if I'm able to share my screen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1634.819,
    "end": 1635.74,
    "text": "So I have a presentation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1635.78,
    "end": 1638.324,
    "text": "I've been planning to give this to my research group.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1638.964,
    "end": 1645.633,
    "text": "So I have sort of like visuals to explain at least the way I understand why minimizing free energy",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1645.613,
    "end": 1667.014,
    "text": " it's it's a it's a good alternative so if is it okay if I would sure okay how long is the presentation no it's like three slides just to share the concept of why integrate like why computing all right go for it very very fast yeah go for it so can you see my slides yep",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1668.158,
    "end": 1677.578,
    "text": " yeah so basically you know we're in the in the task of computing base theorem so computing some latent variable data given our observation sex",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1677.946,
    "end": 1681.15,
    "text": " And this always involves an integral of this form.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1681.17,
    "end": 1692.806,
    "text": "So the denominator of base theorem can be computed basically integrating the numerator through all of the possible unobserved or latent variables.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1693.747,
    "end": 1701.237,
    "text": "And the way you will do this computationally, if most of these integrals don't have a closed form solution, so you cannot solve them analytically,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1701.79,
    "end": 1707.257,
    "text": " So what you do numerically is you would imagine you have like a grid and you evaluate.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1707.277,
    "end": 1714.626,
    "text": "So you don't know the height of this function and what the way you're going to integrate is by dividing the grid into different points.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1715.247,
    "end": 1721.675,
    "text": "And then at each point of alerting the height and the integral is going to be basically sort of like base time times high.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1722.076,
    "end": 1725.3,
    "text": "So you're going to add all of these small contributions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1725.28,
    "end": 1749.195,
    "text": " but if you look at this example that i drew here most of the evaluations don't contribute at all to the to the integral because they're all at zero but you don't know that to begin with so evaluating these numerically will become incredibly challenging and furthermore the more the dimensionality of your problem increases like the more dimensions you have the more variables you're trying to infer",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1749.631,
    "end": 1755.119,
    "text": " the more and more and more grid points you will have to evaluate so it grows exponentially.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1755.159,
    "end": 1763.871,
    "text": "So it just becomes, in high dimensional spaces, evaluating these would become just basically impossible numerically.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1764.772,
    "end": 1771.582,
    "text": "So what we propose is to say, OK, what I really want is my posterior distribution, latent variables given my observations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1772.102,
    "end": 1774.626,
    "text": "And I'm going to propose a good enough approximation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1775.146,
    "end": 1781.278,
    "text": " So this is my true belief that I want to get, and this is my proposed close enough approximation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1782.059,
    "end": 1788.131,
    "text": "So what we say is like, okay, I want my close enough approximation to be as close as possible as the true model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1788.712,
    "end": 1792.339,
    "text": "And that is done by minimizing the scale divergence.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1792.359,
    "end": 1797.829,
    "text": "But, you know, that minimizing that distance or pseudo metric already involves.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1798.467,
    "end": 1801.573,
    "text": " the distribution that I don't want to work with, the one that is really hard to compute.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1802.094,
    "end": 1811.431,
    "text": "But then you do some math that you'll see in the book, I guess, and you arrive at this, that the free energy is a lower bound on what we want to compute.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1811.471,
    "end": 1816.24,
    "text": "So basically, I don't know how to compute the right-hand side of this equation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1816.22,
    "end": 1826.471,
    "text": " But I know that if I make the left-hand side of the equation as small as possible, I will have also made the other one as small as possible, given my approximation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1827.152,
    "end": 1830.135,
    "text": "So that's how I understand it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1830.196,
    "end": 1833.659,
    "text": "And there's different, yeah, I guess that's good enough for what I want to say.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1834.24,
    "end": 1844.151,
    "text": "Just to shed some light on the technicalities of actually implementing these things computationally, it just, you need a proxy because there's too many dimensions to handle.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1846.578,
    "end": 1870.611,
    "text": " awesome cool yeah very um relevant it's discussed a lot in livestream 52 series with Lance da Costa some of the relationships with like sampling based methods variational methods all these things um and yeah um Susan and then Rob Moore",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1875.282,
    "end": 1904.445,
    "text": " so yeah that was very helpful um it kind of speaks to the requisite variety aspects I guess um and and that kind of connects to um the uh in terms of belief updating and learning um you know I know that there's um the the variation that is more in the moment or emergent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1905.067,
    "end": 1929.555,
    "text": " but the and the there's a time lapse in the belief updating but would um would that mean that the goal of learning and updating is widening those boundaries right right widening um yeah the the requisite choices",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1936.083,
    "end": 1962.141,
    "text": " yeah there's a lot to say there it is related to the cybernetics the principle of requisite diversity and good regulator theorem and those are discussed a lot in the chapter as it's kind of like um like and then uh often these these three scales of inference um for for so as Ali emphasized there's like continuity with the simpler or simplest systems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1962.121,
    "end": 1978.624,
    "text": " like things that don't have these higher cognitive functionalities at all, things that do only trivial belief updating, like even the case of a ball on the ground, you can think of it as doing inference and doing nothing and being at equilibrium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1979.465,
    "end": 1983.15,
    "text": "So it's a measurement framework that, on one hand, you can have a totally...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1983.485,
    "end": 2008.716,
    "text": " non-cognitive or basely cognitive like ball rolling down a hill truly as doing some path of least action that's exactly from mechanical physics and the basing mechanics extends that ability to model like mechanical systems and then introduces the faster level of inference and then attention which is precision modulation and then learning",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2009.253,
    "end": 2022.149,
    "text": " David Price- Which is the slower parameter updating that's within one time within one scale of time and then nested models could implement arbitrary other learning schemes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2022.87,
    "end": 2029.398,
    "text": "David Price- Like here's just another switch like higher variable that just switches between these knees so that's not learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2029.458,
    "end": 2037.808,
    "text": "David Price- In the sense of those parameters might be fixed so it's like a narrower statistical learning definition versus like broader human learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2039.307,
    "end": 2068.791,
    "text": " so again that's another term like learning and inference and updating are they're not being applied to the human psychological usage it like learning is used in statistics to describe parameter updating parameter erupting so but this model does um allow for human learning and I guess would human learning be or you know if it doesn't say so now but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2069.227,
    "end": 2082.805,
    "text": " And are there models around policy in terms of if the goal is human learning?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2089.013,
    "end": 2090.235,
    "text": "Anyone want to speak to that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2095.582,
    "end": 2096.483,
    "text": "Or Ra, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2104.715,
    "end": 2105.236,
    "text": " So.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2105.256,
    "end": 2113.068,
    "text": "I don't have an answer to your question Susan so i'm going to.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2113.128,
    "end": 2117.314,
    "text": "ask another question and maybe if someone has a comment.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2118.696,
    "end": 2121.12,
    "text": "For you, they can think about it in the meantime.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2122.585,
    "end": 2129.491,
    "text": " My question is related to something that's called first and touches on a bit in the preface.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2130.552,
    "end": 2141.822,
    "text": "And then it's, it's discuss another summaries of the free energy principle that you could find, for example, Wikipedia.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2142.843,
    "end": 2152.491,
    "text": "And it's the falsifiability of the energy principle and a distinction",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2153.416,
    "end": 2168.505,
    "text": " that you might make between a framework or a principle versus a theory that's making testable or measurable",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2169.97,
    "end": 2197.8,
    "text": " predictions uh that would allow you to confirm or reject a provide evidence for or reject a theory and uh what carverson and thomas parr allude to in the book is that the free energy principle is is just that it's a principle akin to the theory of evolution",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2198.337,
    "end": 2214.372,
    "text": " And in somehow I haven't been able to make sense of what what it is about the free energy principle or or the theory of evolution as a more",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2216.022,
    "end": 2221.333,
    "text": " a common theory or framework that people are more familiar with?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2221.534,
    "end": 2233.66,
    "text": "What is it about those principles or frameworks that makes them hard to falsify or not falsifiable?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2233.64,
    "end": 2242.842,
    "text": " and then they go on to specify that when these frameworks do become testable is when you introduce the generative model.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2243.123,
    "end": 2251.463,
    "text": "So an active inference, the core of the theory comes to",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2251.78,
    "end": 2256.254,
    "text": " producing a general model producing some description of what's.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2257.839,
    "end": 2258.32,
    "text": "causes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2258.36,
    "end": 2261.149,
    "text": "In the world's generates.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2262.513,
    "end": 2266.144,
    "text": "could could be generating the observations that you're you're seeing.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2267.71,
    "end": 2285.466,
    "text": " and and then that's something that you can go and measure or maybe in a human brain or or look for observations to to test against but so the essence of my question is what uh distinguishes",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2287.876,
    "end": 2292.741,
    "text": " the free energy principle as a framework that isn't falsifiable?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2293.662,
    "end": 2302.472,
    "text": "And how does a generative model convert it, the free energy principle or active inference into a theory that can be tested?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2306.957,
    "end": 2308.979,
    "text": "Great question, Ali, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2311.742,
    "end": 2316.027,
    "text": "So the reason the free energy principle is described as",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2316.462,
    "end": 2339.702,
    "text": " as an unfalsifiable principle is because it's basically a variational principle which we use as a mathematical tool to describe the kind of theory that",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2339.682,
    "end": 2349.833,
    "text": " accounts for the behavior of particular kinds of self-organizing systems or agents.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2349.893,
    "end": 2364.509,
    "text": "But if we look at this issue in a much broader perspective, the same problem of falsifiability applies equally to predictive coding frameworks as well.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2365.49,
    "end": 2369.655,
    "text": "So the question around is predictive coding",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2369.635,
    "end": 2377.086,
    "text": " theories are falsifiable or not, has been going around for several decades now.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2377.106,
    "end": 2391.306,
    "text": "But a very illuminating paper published just a couple of days ago, namely is predictive coding falsifiable by Brown, by Bowman at all, in which",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2391.455,
    "end": 2413.632,
    "text": " they argue that although it looks as if these kinds of theories as predictive coding or active inference and so on looks as if they are falsifiable, but the unfalsifiable, sorry, but the unfalsifiability of these theories is nothing",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2413.966,
    "end": 2416.81,
    "text": " inherent to these theories at all.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2418.332,
    "end": 2431.251,
    "text": "It's just the problem of precision that needs to be accounted for if we want to look at the problem of falsifiability for these theories.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2431.591,
    "end": 2439.923,
    "text": "So their conclusion is that these kinds of theories as predictive coding or predictive processing and active inference",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2440.156,
    "end": 2449.787,
    "text": " can indeed be viewed as falsifiable theory, at least in theory.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2452.57,
    "end": 2459.157,
    "text": "There isn't any inherent barrier for describing these theories as unfalsifiable.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2459.197,
    "end": 2463.121,
    "text": "There isn't any fundamental unfalsifiability for these theories.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2464.283,
    "end": 2469.268,
    "text": "But then again, if we come back to active inference again,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2470.261,
    "end": 2475.892,
    "text": " There are two parts for the theory of active inference.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2476.233,
    "end": 2483.848,
    "text": "The underlying variational principle, mainly free energy principle, and then the",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2484.436,
    "end": 2487.36,
    "text": " empirical theory itself, namely the active inference.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2487.941,
    "end": 2500.018,
    "text": "So even if the underlying principle or FEP is unfalsifiable, it doesn't necessarily apply to active inference as well.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2500.258,
    "end": 2508.89,
    "text": "So active inference can be viewed as a perfectly empirical, testable and falsifiable theory.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2510.292,
    "end": 2513.937,
    "text": "But there are some arguments that",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2514.288,
    "end": 2540.667,
    "text": " the underlying principle being as variational principle is in essence on falsifiable so yeah thank you Ali there's a lot there um you you can always follow where I am in the coda by clicking on the icon to like improve the notes which would be really helpful or add more information but in this interview",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2542.047,
    "end": 2566.401,
    "text": " that was where friston provided this response that's one answer to this kind of question another is like again to connect it to the linear regression like the statements about variational free energy bounding surprise minimization and then surprise minimization being equivalent to model evidence maximization",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2566.955,
    "end": 2569.358,
    "text": " They are two sides literally of the exact same thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2569.398,
    "end": 2575.444,
    "text": "If you have the optimal model, you have the lowest bounded surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2576.666,
    "end": 2579.649,
    "text": "Lowest surprise, that's the exact Bayesian results.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2580.47,
    "end": 2589.079,
    "text": "It's like you're doing the best that you possibly could have on the inbound sensemaking side and then on the outbound control side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2589.74,
    "end": 2592.523,
    "text": "So again, a deflationary statistical...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2592.925,
    "end": 2615.372,
    "text": " description which is accurate of variational free energy is it being a unified tractable bound to surprise minimization whereas there isn't a tractable analogous bound directly to model evidence maximization which is why there's the whole question about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2615.858,
    "end": 2619.683,
    "text": " hill climbing algorithms and model maximization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2620.023,
    "end": 2634.821,
    "text": "But this understanding between minimizing something is like equivalent to maximizing something is commonly used, like minimizing the training loss on a neural network or minimizing the L2 norm, like the sum of squares on a linear regression.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2636.383,
    "end": 2644.954,
    "text": "As was mentioned by someone earlier, like that doesn't mean that you made the generative model adequate to the real world in any way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2645.693,
    "end": 2665.525,
    "text": " it's just a statement that the statistical model will have a certain um ability just to process the data routinely like a t-test does that mean that that was an ideology for a t-test or something that that has always been the question but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2666.281,
    "end": 2691.192,
    "text": " that is a separate question than the relationship between variational free energy and surprise which is just a technical finding that it can't be falsified it's just a construction made but then once something is proposed like as a structural hypothesis like in the spm days they were testing does uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2692.235,
    "end": 2696.221,
    "text": " Presenting A then B influenced this response pattern.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2696.582,
    "end": 2716.774,
    "text": "And in testing structural hypotheses in the brain, active inference kind of elaborates on this idea of creating structural hypotheses that themselves being specific or particular and specified or just evidently not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2719.403,
    "end": 2725.45,
    "text": " it would be analogous to asking about an unspecified linear regression, whether you'd expect this or that result.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2730.676,
    "end": 2732.498,
    "text": "Let's look at a few other of the questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2739.325,
    "end": 2742.829,
    "text": "Can I quickly make a comment about Russ?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2743.298,
    "end": 2746.963,
    "text": " A question I recently read this paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2747.023,
    "end": 2751.189,
    "text": "The math is not the territory navigating the energy principle by.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2752.07,
    "end": 2754.053,
    "text": "Mail Andrews, and.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2754.754,
    "end": 2758.379,
    "text": "You know, my take away from that paper, which I highly recommend.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2759.421,
    "end": 2764.287,
    "text": "It's the way to think about the 300 principle is more like a statistic.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2764.307,
    "end": 2766.15,
    "text": "Yeah, like a statistical.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2766.552,
    "end": 2794.888,
    "text": " uh framework like you don't falsify calculus calculus is uh you know mathematical framework but if you apply newton's laws and let's say you have an alternative hypothesis to newton's flaws and they don't agree with the data then those laws are wrong but calculus is still right like calculus is still the mathematical framework to analyze you know differential equations so in that sense uh the 300 principle i think",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2795.223,
    "end": 2800.812,
    "text": " Sort of place an analogous role where now the falsifiable thing will come with us.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2801.513,
    "end": 2804.618,
    "text": "Then it wasn't like you build your generative model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2805.339,
    "end": 2809.666,
    "text": "Maybe you think about neuroscience, so you think about how the brain connects, or maybe you think about.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2809.687,
    "end": 2812.812,
    "text": "I don't know biophysics how genes talk to each other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2812.852,
    "end": 2818.18,
    "text": "So, in that, that is what is going to be falsifiable and the, and the principle.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2819.062,
    "end": 2821.686,
    "text": "It's just a way to look at that generative model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2822.155,
    "end": 2833.521,
    "text": " And you know, in a way, to make sense of it like what you're proposing kind of thing so so that's my understanding my take away message from from this paper yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2833.541,
    "end": 2836.688,
    "text": "yeah great can you please link the paper.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2837.512,
    "end": 2864.7,
    "text": " in the live stream 14 also it was discussed with melon with others but yeah that's kind of like a key reference point that helped clarify some of this like map territory and the map territory fallacy the map territory fallacy fallacy we discussed this actually earlier in the cohort for discussion if people wanted to look but let's look in our last like little bit to some of these written questions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2867.633,
    "end": 2876.784,
    "text": " While the FEP is applicable across many timescales, how applicable is active inference as a process theory instantiation of the FEP?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2877.465,
    "end": 2879.127,
    "text": "Very much plays into our discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2879.707,
    "end": 2884.933,
    "text": "Do organisms need a nervous system for it to make sense to describe them as doing active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2885.814,
    "end": 2888.117,
    "text": "No, you don't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2888.137,
    "end": 2891.501,
    "text": "It can include inert systems, passive systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2892.803,
    "end": 2895.666,
    "text": "This isn't the psychological account.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2895.646,
    "end": 2899.762,
    "text": " but it can be applied to mind as a system of interest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2900.826,
    "end": 2905.403,
    "text": "But the basal machinery that is described in this textbook",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2906.176,
    "end": 2930.479,
    "text": " um like what chapter four describes generative models of are not psychological accounts of humans they're statistical examples so no there's no need for any kind of specific material or or to have to to be material at all could you say oh it's a matrix that just flips between two states",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2930.83,
    "end": 2940.002,
    "text": " It could be as simple as that, or you could be applying it just like another analytical or measurement or modeling tool to a system of interest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2942.225,
    "end": 2946.972,
    "text": "So, and how applicable is active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2948.294,
    "end": 2949.295,
    "text": "That's the empirical question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2952.059,
    "end": 2964.116,
    "text": " i'm hoping to get intuitive understanding of how free energy represents a measure of the discrepancy between the organisms internal model the world and its sensory inputs, what is the underlying relationship between information and energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2965.478,
    "end": 2972.367,
    "text": "What is the relationship between this free energy and active inference and the thermodynamic concept of free energy that's also present in any organism environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2974.21,
    "end": 2976.413,
    "text": "Anyone have a thought on this what's the relationship between.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2976.473,
    "end": 2981.56,
    "text": "variational free energy or expected free energy and.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2983.649,
    "end": 3008.712,
    "text": " thermodynamic concept of free energy um can i say share my thoughts on that yeah go for it yeah so my understanding is the following so you know in the industrial revolution people are trying to improve uh steam engines",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3009.299,
    "end": 3024.708,
    "text": " And they come to the realization that doesn't matter, you know, how good your design is, how well, you know, that as perfect as your engine becomes, you put some energy, but you don't get the same amount of work out of it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3024.728,
    "end": 3026.13,
    "text": "There's always some loss.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3026.331,
    "end": 3029.637,
    "text": "There's always something that you cannot really utilize.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3029.785,
    "end": 3039.059,
    "text": " So that leads to Clausius to make the statement of like, oh, let's just come up with a concept that we're going to call entropy, which is always increasing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3039.139,
    "end": 3047.572,
    "text": "And it's kind of like this part of the energy that I input into my system that I wasn't able to make use of.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3047.652,
    "end": 3048.874,
    "text": "It's just dissipating.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3049.374,
    "end": 3058.408,
    "text": "You can think of friction and other things that just make all of the energy that you put into the system not being utilized.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3059.148,
    "end": 3064.977,
    "text": " Later on, Boltzmann comes in and then he says, look, entropy is not mysterious.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3065.257,
    "end": 3070.044,
    "text": "Entropy is just a measure of how many ways you can arrange the system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3070.605,
    "end": 3076.093,
    "text": "How many different, you know, if I have the gas molecules in this room,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3076.073,
    "end": 3105.321,
    "text": " uh nothing in the laws of physics uh prohibited them to certainly like you know have some random trajectories and collecting that corner and then i'll be suffocating because i'm in a vacuum kind of nothing in the laws of physics forbids that but it's just incredibly unlikely it's just there's so many many many more ways to have them uniformly spread throughout the room that you have to wait longer than the age of the universe to see that random event of having them",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3105.858,
    "end": 3106.74,
    "text": " in that corner.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3107.783,
    "end": 3121.42,
    "text": "So now when Shannon comes in and he formalizes the idea of information as a mathematical quantity that you can put a number on,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3121.585,
    "end": 3129.494,
    "text": " Turns out that the metric that he derives is exactly of the same functional form as Boltzmann's entropy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3130.094,
    "end": 3133.398,
    "text": "So, you know, the two equations look exactly the same.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3134.038,
    "end": 3139.945,
    "text": "And the story goes that I think von Neumann told Shannon, oh, just use the word entropy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3140.045,
    "end": 3142.588,
    "text": "It's the same equation and nobody understands the other one either.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3142.648,
    "end": 3144.69,
    "text": "So on a divide, you'll win.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3145.463,
    "end": 3156.941,
    "text": " So then later on, I think he's ET James, a very famous and important physicist in all of these statistical mechanics and its relationship based in statistics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3157.662,
    "end": 3167.438,
    "text": "But I think finally makes a connection between thermodynamic and informational entropies in that case, where.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3167.654,
    "end": 3175.243,
    "text": " from my readings and interpretations of what Jane said, is that thermodynamic entropy is something I can measure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3175.403,
    "end": 3181.33,
    "text": "I measure the amount of heat dissipated by my system at a constant temperature, and I put a number.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3181.35,
    "end": 3183.093,
    "text": "That's my entropy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3183.113,
    "end": 3186.537,
    "text": "The information entropy is not something I measure like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3186.717,
    "end": 3188.399,
    "text": "It's in units of bits.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3189.46,
    "end": 3194.286,
    "text": "But it has to do with, in a system, if I push a piston,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3194.705,
    "end": 3201.216,
    "text": " how much information I, or how many degrees of freedom I control of that system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3201.757,
    "end": 3209.09,
    "text": "Well, I can push all of the atoms in the gas and compress them, but I don't really have control over their particular trajectories.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3209.711,
    "end": 3217.084,
    "text": "So the work that I get out of that effort has to do with how many degrees of freedom I actually control.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3217.435,
    "end": 3228.473,
    "text": " If I was able to go into the atomic level and point all of the gas molecules into the same direction, my system will be much stronger and push and give me more work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3228.974,
    "end": 3231.237,
    "text": "But I don't have access to those degrees of freedom.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3231.658,
    "end": 3235.244,
    "text": "So the information I have access to is limited.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3235.344,
    "end": 3241.654,
    "text": "Therefore, if I were to reproduce that piston pushing and went over and over again.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3241.786,
    "end": 3245.291,
    "text": " it will give me the same result given my limited information.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3245.991,
    "end": 3246.993,
    "text": "So I don't know if that's helpful.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3247.293,
    "end": 3255.244,
    "text": "It's a long explanation, but that's my current understanding of how these two things are connected.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3258.348,
    "end": 3260.971,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3261.432,
    "end": 3261.752,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3262.188,
    "end": 3263.851,
    "text": " Christoph, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3263.871,
    "end": 3267.458,
    "text": "I just want to say something, present this from a slightly different angle.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3267.498,
    "end": 3270.624,
    "text": "This is something that I took away from my undergrad.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3270.804,
    "end": 3282.446,
    "text": "I particularly studied two kinds of semantics of programming languages, the notational semantics and operational semantics, which is, you know, you take a program fragment and you're trying to assign a meaning to it.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3282.506,
    "end": 3285.732,
    "text": "And the operational semantics is some kind of sequence of reductions",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3286.167,
    "end": 3295.077,
    "text": " Mateusz Piorkowski- Using big or small steps that tells you like you know how the program evolves over time and what the sort of state transitions of the virtual machine kind of are.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3295.497,
    "end": 3301.984,
    "text": "Mateusz Piorkowski- And there's a different way of assigning semantic to a program is to say, well, there is a mathematical object.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3302.605,
    "end": 3311.014,
    "text": "Mateusz Piorkowski- This program represents a good example that would be, for instance, something like an like an infinite list it's not actually realizable in a finance computer and yet.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3311.315,
    "end": 3314.318,
    "text": "Mateusz Piorkowski- We have programs that act as if they were infinite lists.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3314.703,
    "end": 3333.347,
    "text": " So where it really hit me specifically in this case was that the common presentation of the issue of entropy in information theory versus thermodynamics is that people often mention like, oh, these two things have the same mathematical form, but they're two different things.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3334.529,
    "end": 3340.096,
    "text": "And I would say that because these things have the same mathematical form, there must be the same thing.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3340.677,
    "end": 3341.638,
    "text": "They must be the same thing.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3342.057,
    "end": 3356.938,
    "text": " It's just the depth and the nature of the relationship may not be precisely understood by us just yet, but the mathematics suggests that it's precisely exactly the same phenomenon, because it has the same mathematical form.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3358.18,
    "end": 3361.264,
    "text": "This is kind of a more philosophical approach.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3362.729,
    "end": 3363.89,
    "text": " Thank you, Christoph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3365.131,
    "end": 3366.132,
    "text": "Another angle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3366.312,
    "end": 3369.915,
    "text": "So that's a philosophical kind of angle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3372.077,
    "end": 3380.845,
    "text": "One is to say the variational free energy is an information, theoretic free energy that has that resonance in form or the analogy in form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3381.566,
    "end": 3392.095,
    "text": "And then when we apply this to self-organizing systems, then if we look at things that are existing already,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3392.294,
    "end": 3408.75,
    "text": " they are representing a small um like they're unlikely in one way but then they're likely in their own way so perhaps one way to see it is it's about finding what makes it have a thingness which is what ali alludes to in the chat with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3408.73,
    "end": 3437.202,
    "text": " uh FEP and a theory of everything again thing here is used in a rather specific ontological sense definitely we can return to this like and it's come up many times with like this notion of particular States and a particular thing um a lot more to say but um Susan um yeah and that was that was a great explanation manual and what piques my interest and I just want to put a pin",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3437.755,
    "end": 3466.969,
    "text": " in uh what you talked about was um the um the correlation between that and the constructal law um and yeah i think that that's um you know as far as how i kind of tease that apart is is is um the confusion over who designs and i think yeah that uh that has a bearing in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3467.135,
    "end": 3470.083,
    "text": " You know, in our updating belief updating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3471.387,
    "end": 3472.951,
    "text": "So that'd be interesting to pursue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3473.051,
    "end": 3479.71,
    "text": "I don't know that it's covered in this course, but it would be an interesting exercise outside of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3485.039,
    "end": 3486.861,
    "text": " Well, yeah, go ahead.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3486.962,
    "end": 3500.78,
    "text": "Quick point, people, if there's a great, great paper, what is information by, let me find it in my, David, do you remember the author?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3505.286,
    "end": 3511.013,
    "text": "It's just, that's, I think, if I find it, I'll paste it on the,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3512.157,
    "end": 3519.528,
    "text": " on the chat, but that just explains some of these ideas of entropy, you know, entropy is in the eyes of the beholder.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3519.588,
    "end": 3523.273,
    "text": "The entropy of a coin is not one bit.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3523.954,
    "end": 3527.6,
    "text": "If I only, if I focus only on the faces, yeah, it's one bit.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3527.66,
    "end": 3529.362,
    "text": "I just can't have either heads or tails.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3529.643,
    "end": 3531.145,
    "text": "Just one, yes, no question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3531.412,
    "end": 3539.246,
    "text": " But what if I not only care about the face of the coin, but the angle when I toss it, like, is it like hitting this way or this way?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3539.507,
    "end": 3543.574,
    "text": "And I can discretize it into four corners or eight corners or as many as I want.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3544.536,
    "end": 3554.213,
    "text": "So the question of what is the entropy of the system, it's really a matter of who's asking the question and what they want to answer in a sense.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3556.808,
    "end": 3560.014,
    "text": " That is a great point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3560.335,
    "end": 3572.337,
    "text": "And the relationality is a theme that comes up again and again, like just the fundamental active role of the interactants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3572.317,
    "end": 3583.223,
    "text": " like the passive observer and the kind of receptive filter in only like all these ways that the active inference helps reformulate that relationality, like even in the cases that you're mentioning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3583.764,
    "end": 3589.498,
    "text": "And then the strongest statement, I believe, to Kristof's point,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3589.478,
    "end": 3611.959,
    "text": " uh of going further like like the Overton window on this side I think is Alex Kiefer in some of these discussions where he's like it is for like it is further that it is informational but but the the um the actuality of biological systems makes it so that this theoretical construct",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3612.682,
    "end": 3640.528,
    "text": " has like a stronger than um instrumental relationship with thermodynamic free energy like if you had the best foraging algorithm your colony is going to exist in the future but best foraging algorithm doesn't mean the most it just you know means given the niche so that's a normativity that has like a survival normativity to things that survive",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3642.922,
    "end": 3671.899,
    "text": " that's another piece of how it relates to today nikos yeah it sounds like there might be some unifying concept here that both in the thermodynamic concept there's an energy gradient that has some potential utility for some agent with some goal and in the information there is also from some specific perspective the potential for harnessing that there's",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3673.162,
    "end": 3673.904,
    "text": " If that makes sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3673.964,
    "end": 3683.273,
    "text": "It's like if you take a specific vantage point of an agent within that system, you can harness information or energy gradients to some end result.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3685.227,
    "end": 3704.637,
    "text": " yeah that's very resonant with chris fields and mike levin's work on like polycomputing which is that the computational um attributes are themselves relational so like if something is doing a totally encrypted computation it can't be distinguished from noise",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3705.207,
    "end": 3729.645,
    "text": " but that's like kind of like a um but then encryption is something that is procedural whereas so that has a different set of formalisms than like a statistical distribution but those are all really good points and ones that that that connect very provocatively but not um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3731.228,
    "end": 3733.574,
    "text": " You know directly necessarily to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3734.957,
    "end": 3738.967,
    "text": "Some of these felt ways of thinking about that which.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3741.112,
    "end": 3742.475,
    "text": "yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3742.495,
    "end": 3748.309,
    "text": "interesting times and discussions does anyone want to like add any other comments in the last minutes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3754.718,
    "end": 3758.525,
    "text": " Well, hope that was a fun first chapter discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3761.19,
    "end": 3763.675,
    "text": "We'll have the earlier time next week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3764.817,
    "end": 3769.285,
    "text": "People can add more questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3769.585,
    "end": 3799.288,
    "text": " add and and update the the answers that they're finding relevant um often we have like more people's general reflections in the first of the discussions and then try to address any and all that because that makes us think about so many things after these discussions that people can just add them here and uh yeah any other comments or thoughts or we'll end it i just want to say that some",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3799.657,
    "end": 3802.105,
    "text": " very enlightening discussion towards the end.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3802.125,
    "end": 3803.911,
    "text": "And thank you all for the contributions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3806.58,
    "end": 3807.443,
    "text": "Yeah, thanks a lot, guys.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3807.925,
    "end": 3808.707,
    "text": "Thank you, everyone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3809.008,
    "end": 3809.53,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3810.754,
    "end": 3810.955,
    "text": "Bye.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3811.677,
    "end": 3812.299,
    "text": "Thank you, Daniel.",
    "speaker": "SPEAKER_00"
  }
]