[
  {
    "start": 1.496,
    "end": 9.942,
    "text": " Hey everyone, welcome to week 12 of Aktiv textbook group cohort one.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 11.584,
    "end": 15.567,
    "text": "We are in the review and synthesis weeks.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 17.168,
    "end": 21.011,
    "text": "It's been a great three month ish journey.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 22.701,
    "end": 43.064,
    "text": " and it doesn't stop here but we'll go over that so two points of process for those who are here live and of course re-watching and then we'll move to the more conceptual parts so first in the onboarding page you'll see these two columns",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 44.209,
    "end": 53.997,
    "text": " The two columns are RSVPing yes to join cohort two, part one, going through chapters one through five, if you would like to for a second time.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 55.097,
    "end": 56.799,
    "text": "Many people will be just doing it",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 57.875,
    "end": 60.276,
    "text": " for fun or for learning or however they want.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 60.877,
    "end": 70.202,
    "text": "And also there's the opportunity to continue on with the second half of the textbook, which is going to get into a lot of the hands-on modeling.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 71.003,
    "end": 79.288,
    "text": "And we'll be especially looking forward to developing a lot of the notebooks and interactive formats that'll help us get a lot of understanding there.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 80.929,
    "end": 85.412,
    "text": "So please check yes for whichever row your name is in",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 86.252,
    "end": 114.377,
    "text": " for whether you would like to continue on with part two as well as retake uh part one as well you'd be welcome to be just a participant and also feel free to get in touch if you are interested in taking some other role such as like facilitating or scaffolding some aspect but we can talk more about that for those who are interested so point one go to the onboarding list and",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 115.632,
    "end": 118.293,
    "text": " continue on however you want.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 120.293,
    "end": 130.776,
    "text": "Second point, if you go to future textbook groups page, you'll see an embedded form as well as a link to the form if you want it in a new window like that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 132.156,
    "end": 144.279,
    "text": "This would be exceptionally requested and helpful for you to provide some evaluations numerically and as short or as long as you want on providing feedback",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 145.811,
    "end": 149.074,
    "text": " Those are one way that you can provide feedback anonymously.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 149.094,
    "end": 155.338,
    "text": "The second way is building on some of the ideas that people are already adding here.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 156.519,
    "end": 164.306,
    "text": "This is an editable page, so people can add thoughts as they see fit about what would be awesome for future textbook groups.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 165.478,
    "end": 173.488,
    "text": " or any other feedback, or as always, they can email activeinference at gmail.com if they want like a response to any specific points.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 174.97,
    "end": 179.696,
    "text": "And then also it's provided here at the link to share for people who want to join future cohorts.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 180.277,
    "end": 183.04,
    "text": "So that link will be like getting people",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 184.48,
    "end": 206.756,
    "text": " onboarded into the next cohort which is September 2022 in this case but this is going to be like an evergreen form that will just continue to have a list of people who expressed interest and be onboarding them into um subsequent cohorts of which will begin several per year going forward any",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 208.62,
    "end": 223.693,
    "text": " and next week we'll be talking more about the feedback specifically and about projects and about carrying on today is like a little bit of a more conceptual synthesis and review",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 225.18,
    "end": 231.002,
    "text": " And again, next week will be more like logistical and project-oriented review.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 231.362,
    "end": 239.644,
    "text": "So just on these points or anything else, does anyone want to just raise their hand or unmute and share anything that they like?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 259.986,
    "end": 288.088,
    "text": " okay let us conceptually review then um we read the first five chapters of the active inference textbook does anyone have overall thoughts that they'd like to provide at the five chapter scale",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 289.042,
    "end": 314.674,
    "text": " we're going to go into a chapter scale then we'll be continuing to dive in as um granularly as required but at the scale of the first five chapters you can see them here on this preface page as well as here in the chapters list as a unit of five chapters what were people's sense",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 323.462,
    "end": 324.323,
    "text": " How did it update?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 324.663,
    "end": 325.303,
    "text": "Yes, please, Ben.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 325.323,
    "end": 326.484,
    "text": "And then Oli.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 327.545,
    "end": 341.874,
    "text": "Well, I was just going to say, I think, you know, as I've said to people before, I think coming from a non-mathematics background, I thought that these chapters were really accessible in terms of the kind of conceptual things that they were putting on the table.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 341.914,
    "end": 352.001,
    "text": "But I just wondered what other people's opinions were in terms of, you know, understanding the conceptual toolkit of active inference methods",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 353.017,
    "end": 360.82,
    "text": " before you've built up a kind of mathematical understanding, because I'm about to start kind of learning some of the mathematics behind it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 361.361,
    "end": 369.364,
    "text": "And I wondered what people thought of the potential to fully grasp these concepts without the mathematics and what the relationship between the two might be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 369.424,
    "end": 371.445,
    "text": "I'm just curious what other people think about that, I guess.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 373.706,
    "end": 373.946,
    "text": "Thanks.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 374.006,
    "end": 375.146,
    "text": "Great question.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 375.847,
    "end": 378.788,
    "text": "Ali, and then Mike, and then anyone else who wants to chime in.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 384.042,
    "end": 399.228,
    "text": " Yeah, it was a pretty exciting journey for me, but I'll definitely need to read over all those five chapters once again, at least once again, in order to grasp more fully the contents of those chapters.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 402.529,
    "end": 426.219,
    "text": " One personal opinion about the way Materials is organized in the first part of the textbook is I couldn't see a kind of hierarchical or structural organization for these chapters as much as I like to see them because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 427.88,
    "end": 448.654,
    "text": " Sometimes they delve into theoretical aspects of all the things much more deeply than the mathematical side, and sometimes it's vice versa, but I think that if it was organized in a way that, as Ben mentioned, we can",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 449.534,
    "end": 472.886,
    "text": " go from a firm conceptual foundation into the granular formalism and mathematics, at least for me, that would be much more accessible and I would be able to organize the materials in a much more coherent way in my mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 473.386,
    "end": 484.59,
    "text": " So one thing that I really enjoyed about these chapters is the kind of vision it",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 494.215,
    "end": 508.369,
    "text": " tries to put forward regarding the future possible research and also things, especially in Chapter 5, and the path that can be taken from this point on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 510.531,
    "end": 510.992,
    "text": "Thank you, Ali.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 511.752,
    "end": 512.974,
    "text": "Mike, then anyone else?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 515.196,
    "end": 517.478,
    "text": "Yeah, I'll pick up from where Ali left off.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 517.718,
    "end": 518.159,
    "text": "I think it's",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 519.108,
    "end": 525.199,
    "text": " um somewhat remarkable that they were able to fit everything they did into those first five chapters um",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 527.362,
    "end": 538.41,
    "text": " and understanding they probably had some idea of how much space they wanted in that part of the book before getting into the practical or applied components in part two.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 538.43,
    "end": 549.057,
    "text": "The high road, low road contrast and sort of coming at the problem from two different angles I think was useful.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 552.759,
    "end": 566.509,
    "text": " Like Ben, I found the math to be generally accessible, although I confess I think I still go through this sort of pattern where I feel like I get it and I have this intuitive understanding of it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 566.569,
    "end": 579.439,
    "text": "But then there are things where I sort of bogged down and looking at some of the mathematical details or some of the graphical representations related to things like message passing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 581.401,
    "end": 584.916,
    "text": " have to slow down and sort of take those apart more and",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 586.263,
    "end": 594.806,
    "text": " So I guess related to that, I should add, I think this group has been so good at taking apart the ideas of the book.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 595.006,
    "end": 611.792,
    "text": "This is perhaps one of the most effective settings I've seen for really wringing concepts out of a text and the work that's going on with the coda to build up the ontology and take apart the equations and things like that, I think is just tremendous.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 613.652,
    "end": 613.973,
    "text": "Awesome.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 614.033,
    "end": 615.093,
    "text": "Thank you, Mike.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 616.587,
    "end": 624.608,
    "text": " Yeah, it's, you know, the British call them maths, plural, instead of math as an area.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 625.249,
    "end": 638.211,
    "text": "And it really does engage, like, there's visual formalisms, which could be represented with a sparsity matrix, or it could be represented with other ways.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 639.011,
    "end": 645.492,
    "text": "But there are almost like a multi-scale diversity of formalisms involved.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 646.129,
    "end": 671.861,
    "text": " ranging from more traditional equal sign in the middle mathematics to fusion schematic equation graphics different types of notations even within the equation and the difficulty is not",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 673.229,
    "end": 697.187,
    "text": " signaled not that it has to be but the difficulty does provide a little whiplash sometimes because it moves variously in the main thread of the text the boxes and the appendices from like this is how linear algebra works and this is what bayes theorem is all the way to",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 698.686,
    "end": 724.398,
    "text": " topics that are approaching physics flows on partitioned states various kinds of fundamental or like in principle relationships about mathematics generally all the way to postulated architectures where message passing is implemented",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 725.885,
    "end": 736.17,
    "text": " to achieve some computational function and or thread the needle with resembling neurocomputational architectures, the math is doing a lot.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 737.531,
    "end": 752.619,
    "text": "Many things are happening and so it's only to be expected that the perception is challenging and there's probably a lot more to even say and",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 754.969,
    "end": 756.01,
    "text": " unpack there.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 756.77,
    "end": 763.854,
    "text": "Anyone else want to raise their hands and give a thought on this section one area?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 775.021,
    "end": 776.102,
    "text": "Jeff, and then anyone else?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 778.463,
    "end": 784.167,
    "text": "I have kind of a general question about the limits of mathematics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 785.611,
    "end": 812.872,
    "text": " the notion of computational irreducibility that you have to go through every step of a process to get that state n plus one from state n from state n minus whatever that certain problems cannot be solved by plugging",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 813.41,
    "end": 819.612,
    "text": " values into a formula and generating a future state, you have to compute all the intermediate states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 821.872,
    "end": 825.393,
    "text": "I wonder where that fits in in this picture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 826.233,
    "end": 834.996,
    "text": "Are there hard limits to the application of mathematics to the problem of active inference?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 835.396,
    "end": 836.476,
    "text": "It's just a general question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 854.833,
    "end": 863.578,
    "text": " Returning to some earlier comments on the firm conceptual grounds.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 865.639,
    "end": 880.368,
    "text": "What is an area, no matter how narrow or distal from Act-Inf, where people believe that there is a firm conceptual ground that felt like that provided a foundation for them to learn further?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 882.189,
    "end": 883.57,
    "text": "Are we seeking an analogy?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 884.844,
    "end": 889.551,
    "text": " to some other field of theory or practice or domain?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 890.732,
    "end": 897.582,
    "text": "Or are we kind of seeking for a epistemic territory that we haven't quite seen?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 910.427,
    "end": 919.832,
    "text": " I'll just add, I think, that in active inference, what you're talking about there, Jeff, is literally blankets and uncertainty.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 921.473,
    "end": 930.297,
    "text": "The corollary there of computation and irreducibility is that there's some large amount of uncertainty and hidden states in the world that you're just never going to get at.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 931.137,
    "end": 936.18,
    "text": "The blanket is, in some sense, not just how you're relating to it,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 938.1,
    "end": 947.902,
    "text": " but some hard limit on your, you know, your surprisal and things like that, so.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 951.403,
    "end": 951.863,
    "text": "Thanks, Brock.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 954.023,
    "end": 959.024,
    "text": "Blue had written, oh yes, Mike, please.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 959.144,
    "end": 965.946,
    "text": "So responding to the question about maybe adjacent SpaceX or spaces or topic areas,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 968.234,
    "end": 980.442,
    "text": " I think there's certainly overlap with concepts from system dynamics, and certainly a lot of agent-based modeling has been applied to model systems that have feedback loops and adaptation and things like that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 981.903,
    "end": 997.073,
    "text": "We discussed during the past weeks relationships with reinforcement learning, and I think there's a belief that active inference kind of cleans up some of the challenging, or maybe not challenging,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 998.754,
    "end": 1009.682,
    "text": " less formalized or less defined aspects related to reinforcement learning, such as how do you engineer a utility function that makes sense in the context of what you're trying to model.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1020.37,
    "end": 1020.65,
    "text": "Thanks.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1021.231,
    "end": 1027.015,
    "text": "Agreed about creating a integrated utility function.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1028.473,
    "end": 1052.967,
    "text": " There's so many unprincipled, not to say ineffective, or not even to say not elegant, but unprincipled methods of creating a Chimera utility model, like delay discounting, novelty bonus, curiosity bonuses, alternating phases or hyperparameters,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1054.048,
    "end": 1080.182,
    "text": " that as well as purely implementational strategies like discarding burn-in parallel chains there's like a whole toolkit and indeed fields on creating effectively integrated utility models and putting that work",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1081.388,
    "end": 1100.559,
    "text": " into the construction of the generative model and how the generative model is partitioned from the generative process allows a generic free energy functional or set of related free energy formulations to play that role",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1103.345,
    "end": 1125.114,
    "text": " so that's one very interesting angle as well as the way that that process of specifying the generative model and generative processes and so on are world models whether in the Yann LeCun sense or in the Adam Safran sense",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1126.55,
    "end": 1134.273,
    "text": " these generative models, and compass world models, and deep learning approaches, and various topics like that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1137.775,
    "end": 1138.955,
    "text": "So, let's see.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1139.956,
    "end": 1144.778,
    "text": "Blue wrote, I wish there was practice problems in the book to develop our understanding.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1148.959,
    "end": 1149.219,
    "text": "Yes.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1151.861,
    "end": 1151.961,
    "text": "Um...",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1153.038,
    "end": 1161.583,
    "text": " to a large extent, and also it's whether people want to reflect on any specific questions or even just on this scheme.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1162.964,
    "end": 1165.065,
    "text": "These are many of these questions.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1166.626,
    "end": 1175.611,
    "text": "These questions can be open, infinite game type questions about the material.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1176.571,
    "end": 1179.373,
    "text": "They can be clearly addressable questions about the material.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1180.387,
    "end": 1194.093,
    "text": " They can be checks for understanding, but we'll be continuing to develop and improve and curate questions around the material.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1195.233,
    "end": 1199.435,
    "text": "So I think it's a great comment and",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1200.899,
    "end": 1221.489,
    "text": " This is why we have this future textbook groups and all of these affordances for people to stay involved and be improving this as well as experimenting in their own spaces and ways to develop the kinds of material that are helping them learn and understand.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1225.631,
    "end": 1227.592,
    "text": "Any more section one",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1229.364,
    "end": 1255.519,
    "text": " overview thoughts chapters one through five and the framing of the book being that the first five chapters are more focused on the conceptual background and the second five chapters are going to be starting with a recipe for designing the active models and and getting more into the modeling itself",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1258.484,
    "end": 1262.161,
    "text": " So any section one through five commentary.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1289.517,
    "end": 1309.669,
    "text": " the book comprises two parts page three these are aimed at readers who want to understand active inference first part and those who seek to use it for their own research second part the first part of the book introduces active inference both conceptually and formally contextualizing it within current theories of cognition",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1314.73,
    "end": 1339.541,
    "text": " how did they succeed and where was there a divergence between what you preferred a priori or now comprehensive formal and self-contained introduction to active inference its main constructs and implications for the study of brain and cognition",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1353.067,
    "end": 1366.315,
    "text": " I'm interested in the distinction between understanding active inference and using it for our own research and the way that that's set up as those being two completely separate things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1370.498,
    "end": 1380.764,
    "text": "It seems to suggest that one could fully understand active inference and yet not be in a position to use it in their own research, not having worked through the second half of the book, and I think that's quite interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1385.481,
    "end": 1410.11,
    "text": " it is good comment thank you um not to uh spoil the ending but the last sentence is ultimately we are confident that you will continue to pursue active inference in some form there may be a multi-year incubation for different people in contexts",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1411.533,
    "end": 1440.954,
    "text": " many people now or even in some amazing decentralized science future they may not think of themselves as researchers or of doing research though they may be even included on research projects um so it's it's very interesting uh comments about how they distinguish like theory and learning from",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1442.619,
    "end": 1466.046,
    "text": " part two research and practice however um they discuss applications but this isn't the playbook it's not the toolkit it's not the modeling tool ecosystem mike",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1469.147,
    "end": 1471.489,
    "text": " Yeah, that's an interesting comment at the end.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1471.509,
    "end": 1481.198,
    "text": "And I know this is my perceptual bias, but there seems to be this implicit assumption that active inference is the way to go.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1481.538,
    "end": 1486.402,
    "text": "Basically, this is the tool to use within the text.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1487.243,
    "end": 1492.168,
    "text": "And so as a result, what's not there is a discussion of",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1493.605,
    "end": 1502.813,
    "text": " Maybe these are cases where you might not want to use active inference, or these are cases where applying active inference could create challenges in what you're solving for.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1502.833,
    "end": 1513.022,
    "text": "Ali and anyone else?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1516.221,
    "end": 1527.255,
    "text": " And in fact, one of the most popular criticisms put toward the active inference or FEP in general is that it tries to explain everything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1528.096,
    "end": 1529.578,
    "text": "It ends up explaining nothing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1534.264,
    "end": 1550.476,
    "text": " Yeah, I think there's a risk of maybe not sufficiently constraining the problem space or leaving things undefined in a way that allow for active inference to be the solution without a critical point of view.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1576.255,
    "end": 1605.22,
    "text": " they highlight behavior and cognition i mean one could almost see even the name active inference as being a synthesis of action behavior and cognition inference in ways that as we're discovering and and unpacking they're integrated in ways that other formalisms of",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1606.653,
    "end": 1633.435,
    "text": " perception as a type of cognition so we can just lump it there other frameworks of behavior and cognition have not integrated or have approached from a uh non-first principles or maybe they do follow first principles like the higher the impact factor the better the paper something like that that's a first principle um no just kidding um but",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1635.629,
    "end": 1664.194,
    "text": " placing it within the framework of cognition while also surfing on a wave of something like pan-cognitivism or like pan-computationalism does expand the scope and that's even before one starts to enter into the more recent research",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1665.774,
    "end": 1693.429,
    "text": " especially where there is a highlight on system persistence not simply in terms of the resistance to dissipation and tropically but in a relational context as repeated measurements like in the quantum work so it's like cognition oh like brains like that schema with the brain or with like a person",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1695.285,
    "end": 1704.328,
    "text": " Well, oh, by cognition, it's any system with a blanket that we're interacting with through repeated measurement.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1706.108,
    "end": 1707.049,
    "text": "Is that cognition?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1707.469,
    "end": 1708.629,
    "text": "Where did cognition go?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1709.609,
    "end": 1709.869,
    "text": "Brock?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1712.59,
    "end": 1721.593,
    "text": "I kind of want to, I guess, echo all those things that were just said about the common criticism and this...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1722.912,
    "end": 1723.652,
    "text": " Where does it apply?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1723.692,
    "end": 1724.513,
    "text": "Where does it not apply?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1724.573,
    "end": 1738.081,
    "text": "But also, I guess, all those things that you were just listing, like, I wonder... I always hear that from people that have not engaged with the material.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1740.443,
    "end": 1749.368,
    "text": "And from my engagement with it, it seems like all of the examples in which it is used are...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1752.662,
    "end": 1765.729,
    "text": " complex dynamical systems that don't have great, that have at best mathematical approximations and have almost no, or literally no kind of analytical approaches.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1768.03,
    "end": 1774.894,
    "text": "It just seems like a good way to model a system of things, of entities that are interacting.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1777.115,
    "end": 1779.216,
    "text": "And I don't, I guess what I'm,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1781.035,
    "end": 1791.83,
    "text": " To put it into one question, is that kind of some anthropomorphizing or whatever projecting of like, well, it's applied to this, it's applied to that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1792.742,
    "end": 1793.863,
    "text": " It must apply to everything.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1794.023,
    "end": 1796.584,
    "text": "And how can it apply to all those things?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1796.684,
    "end": 1797.705,
    "text": "How can it apply everywhere?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1798.165,
    "end": 1799.325,
    "text": "It's not applying to everywhere.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1799.345,
    "end": 1813.272,
    "text": "It's just applying to these complex systems, which are everywhere, but also don't have... And we're not trying to model the apple falling from the tree or these sorts of simple cases or something.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1813.312,
    "end": 1814.473,
    "text": "It's not being applied there.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1815.253,
    "end": 1816.054,
    "text": "I mean, is it?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1816.074,
    "end": 1819.796,
    "text": "I haven't seen, actually, now that I think about it, any...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1820.839,
    "end": 1841.715,
    "text": " of those sorts of situations where it's applied to things that we already understand in this, like maybe in some back checking way, but not in a like way that suggested that we should use this much more complex, you know, approach to something that's kind of check already got that, you know.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1845.738,
    "end": 1846.899,
    "text": "Thanks, Brock, Ali.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1850.174,
    "end": 1865.606,
    "text": " I kind of feel that some of these criticisms stem from a serious lack of deep understanding of concepts related to FVP and active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1866.307,
    "end": 1871.971,
    "text": "For example, I came across a PhD thesis just today in which",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1876.174,
    "end": 1881.656,
    "text": " It tries to critique everything related to Markov blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1882.236,
    "end": 1895.619,
    "text": "But as I was glancing over it, I observed some serious gaps in our argument throughout all the thesis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1895.739,
    "end": 1899.06,
    "text": "And I think materials such as this book",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1900.06,
    "end": 1910.723,
    "text": " can definitely help in filling up these gaps of understanding, which even the serious researchers are suffering from.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1914.304,
    "end": 1915.064,
    "text": "Yes, thanks.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1916.365,
    "end": 1920.306,
    "text": "So to this thread.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1922.326,
    "end": 1923.927,
    "text": "I've never heard it about the linear model.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1925.527,
    "end": 1927.948,
    "text": "How could the linear model be used in so many settings?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1930.683,
    "end": 1956.693,
    "text": " explains nothing well is the linear model an explanation or is it an investigative tool in the investigators toolbox so at least for me personally doesn't need to have broader reach than those who resonate with it but again i always try to ask would somebody say this or could they say that about a linear model",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1957.938,
    "end": 1973.421,
    "text": " And then if the active formalism with F equals dot dot dot dot or G equals dot dot dot dot and all of the predicates that it's associated with and the partition and all of that, could someone say that about Y equals MX plus B?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1974.882,
    "end": 1981.483,
    "text": "And then if not, and there may be cases where it is not the same, what is it that's different about active inference?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1982.495,
    "end": 2002.068,
    "text": " Or is it a valid and important and even reasonable question, but one that might be bumping up like what JF phrased about computational irreducibility or about map territory, even disguised or camouflaged questions about relationality?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2002.749,
    "end": 2005.49,
    "text": "Well, how can complexity science apply to so many topics?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2007.552,
    "end": 2010.594,
    "text": "We're applying complexity science to whatever topic we want to.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2011.977,
    "end": 2012.697,
    "text": " Where's the issue?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2016.099,
    "end": 2017.28,
    "text": "Mike and then Ron.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2018.861,
    "end": 2025.885,
    "text": "Yeah, a lot of it hinges on how the model is to be applied and what the intent of model application is.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2026.125,
    "end": 2033.129,
    "text": "So taking the linear model as an example, we might use something like that to be predictive about a linear system.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2033.529,
    "end": 2035.63,
    "text": "And so there's potential value there.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2036.991,
    "end": 2038.792,
    "text": "When we do system dynamics models,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2040.043,
    "end": 2051.266,
    "text": " A lot of times, the value in doing a system dynamics model is aligning the stakeholders around what are the model components and how do we think about those model components.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2051.286,
    "end": 2063.509,
    "text": "So working through a process similar to what we've done in this textbook group, although few do it as rigorously, to identify the system elements and how they interact and interrelate and so forth.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2063.829,
    "end": 2068.21,
    "text": "And that can lead to more advanced implementation like agent-based models.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2070.543,
    "end": 2082.954,
    "text": " But a lot of times, at least in my experience, those agent-based models are used for deeper systems understanding more than, say, predictive power for what the system is going to do at some point in the future.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2083.234,
    "end": 2093.442,
    "text": "So again, it comes back to the reason for applying the models and thinking about how the model fits with that reason and what sort of results you would expect from that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2095.324,
    "end": 2095.804,
    "text": "Thank you, Mike.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2096.125,
    "end": 2096.325,
    "text": "Rohan?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2099.899,
    "end": 2122.994,
    "text": " uh yeah i i generally agree with what both you and mike said so from a practitioner's perspective uh i mean we do hear criticisms of linear models right it's not that we don't but it's usually about which domain is applied in uh yeah but generally speaking",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2126.696,
    "end": 2152.566,
    "text": " well uh let me go this way if because active inference is probably more complex and it takes a lot more time to crop than y equals mx plus b which could be one reason for these kind of criticisms and it's probably like that they're falling back into old habits okay why should i jump my old model as opposed to adopting this newer more",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2155.565,
    "end": 2157.446,
    "text": " How much more does it explain than what I owe people?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2158.306,
    "end": 2163.507,
    "text": "I think that probably is driving a lot of the criticism.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2166.287,
    "end": 2166.667,
    "text": "Thank you.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2169.548,
    "end": 2172.108,
    "text": "I can't help but add a domain-specific example.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2173.849,
    "end": 2181.21,
    "text": "This is a 2016 paper that is speaking to a multi-decade, multi-career",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2183.243,
    "end": 2211.688,
    "text": " brouhaha about different approaches to modeling evolution and selection for example in the eusocial insects and in social animals as well and this article is very fascinating because they use a bayesian causal graph to identify situations where two different formulations can in the multi-level selection models have identical predictions",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2213.024,
    "end": 2238.961,
    "text": " where the causal graphs have identical predictions any measurement you can think of as being like on a y equals x manifold where it doesn't resolve your uncertainty about which framework is correct or not yet the literature is littered with we measured these ovaries so kin selection is or isn't happening however a vast set of those empirical cases",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2239.887,
    "end": 2246.509,
    "text": " might be essentially falling on this manifold where those two models are not distinguishable.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2248.129,
    "end": 2268.295,
    "text": "And so this is a theory-driven approach, like a first principles approach, to identify situations that are providing unique informative value, in this case about kin and multilevel selection, and knowing what territories",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2269.713,
    "end": 2276.859,
    "text": " measurements will not have explanatory value, which relates to active inference.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2278.66,
    "end": 2296.895,
    "text": "Just like Rohan and like many people have brought up, especially when we kind of take like a meta-science or like a communicating science or onboarding people into active concern, like people are asking explicitly or implicitly, why should I update my cognitive model?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2297.575,
    "end": 2299.097,
    "text": "What is the value of active inference?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2300.302,
    "end": 2312.173,
    "text": " Can you appetize me with a two-minute video so I can understand it or with a two-minute video so it's enough to want to continue going down that path?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2316.477,
    "end": 2323.904,
    "text": "There's a lot to say and there's a lot of work to identify",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2325.876,
    "end": 2353.878,
    "text": " the situations and the ways of truly addressing and perhaps even resolving long-standing scientific divergences like if it is the case that the explore exploit dialectic is addressed in a novel way through the free energy functional balancing pragmatic and epistemic reward that is",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2356.294,
    "end": 2378.09,
    "text": " quite a vast scope people continue to use explore and exploit today and it is even that that those ontology terms wouldn't be useful in the future in fact some of the um discussions on like folk psychology with the belief desires intentions",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2379.346,
    "end": 2386.79,
    "text": " Can we say what an active inference entity wants or intends based upon its beliefs and its desires, for example?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2389.892,
    "end": 2404.181,
    "text": "Can we still talk about exploratory and exploitative behavior as a phenomena but have a different way of modeling how that behavior arises or is regulated?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2407.183,
    "end": 2408.323,
    "text": "What are the settings in",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2409.52,
    "end": 2437.988,
    "text": " behavioral cognitive science what are the settings in where systems dynamics has been applied where we can now use active inference to identify where have we been just throwing a thousand darts at the same grain of sand",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2439.511,
    "end": 2466.797,
    "text": " where are the vast fields where we don't even know and as people have highlighted the book is written with a specific rhetorical bent both explicitly and implicitly um for the regime of attention of the book to be about active inference",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2467.902,
    "end": 2495.833,
    "text": " one can read as an implicit endorsements that this is something that is valid or valuable to pursue and especially at this stage in the field it is almost like an exhortation to persist amidst uncertainty to learn and apply a few disjointed thoughts there but",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2497.83,
    "end": 2498.47,
    "text": " Hope it makes sense.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2500.731,
    "end": 2503.592,
    "text": "Let's look back to the sections of the book.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2507.113,
    "end": 2517.455,
    "text": "Anyone can raise their hand or give a thought like, how could the book you write begin?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2521.557,
    "end": 2525.898,
    "text": "What reviewer comments, whether you're reviewer one, reviewer two, reviewer three,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2527.099,
    "end": 2535.221,
    "text": " What comments would you have provided if this were like a draft and you could even make structural suggestions?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2545.224,
    "end": 2546.684,
    "text": "So I have a lot of comments there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2547.465,
    "end": 2548.465,
    "text": "Yes, Blue and then Ron.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2549.597,
    "end": 2550.097,
    "text": " Oh, sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2550.117,
    "end": 2554.099,
    "text": "I didn't mean to cut you off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2554.639,
    "end": 2571.206,
    "text": "So having taught lots of classes before, I think a list of key terms and definitions would be critical, and learning objectives for each chapter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2573.987,
    "end": 2578.571,
    "text": " like I said, like a practice quiz, like test your knowledge of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2578.871,
    "end": 2581.253,
    "text": "Like, like what is surprise?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2581.313,
    "end": 2583.134,
    "text": "Like how many different forms of surprise are there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2583.475,
    "end": 2589.78,
    "text": "You know, I mean like, like just some practice questions to see if you grasped the concepts prevented in each chapter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2589.8,
    "end": 2594.804,
    "text": "And especially like what I was mentioning in the chat, like math questions,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2595.54,
    "end": 2599.563,
    "text": " problems, like practice, like, can you set up your own generative model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2600.263,
    "end": 2605.186,
    "text": "Like, like what would the, like, or even just the Bayesian graph, like, can you make a Bayesian graph?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2605.206,
    "end": 2614.773,
    "text": "Like, what would that look like for, you know, give a, give a question, like a verbal description and then give the Bayesian graph like answer or like make the answers available online.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2614.813,
    "end": 2617.375,
    "text": "So you could test your own knowledge of the subject first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2618.075,
    "end": 2624.119,
    "text": "I think that that would be like totally instrumental in using this functionally like a textbook anyway.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2624.599,
    "end": 2625.1,
    "text": "So, sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2627.041,
    "end": 2627.501,
    "text": " Thanks, Blue.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2627.721,
    "end": 2629.202,
    "text": "Nice predictive programming.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2630.383,
    "end": 2631.644,
    "text": "Rohan, and then Brock.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2634.486,
    "end": 2641.29,
    "text": "Yeah, so as a practitioner, I work in the engineering field.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2641.31,
    "end": 2642.591,
    "text": "I'm a control systems engineer.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2644.151,
    "end": 2652.537,
    "text": "My preference would be to immediately see some application, not necessarily to control systems, but something that it begins with",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2653.723,
    "end": 2657.705,
    "text": " like a project and explains how active inference is better than baseline.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2658.666,
    "end": 2660.547,
    "text": "That would be interesting to see.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2662.148,
    "end": 2670.192,
    "text": "Like a perfect example of this would be, I don't know if you've heard of FastAI by Rachel Thomas and Jeremy Howard.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2670.812,
    "end": 2673.914,
    "text": "They have a very unique way of teaching",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2677.095,
    "end": 2679.416,
    "text": " So they have a computational linear algebra course.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2679.536,
    "end": 2689.541,
    "text": "So the way they teach the linear algebra part is by basically implementing Gaussian Blur, for example, and then connecting it to... So you start with the code, and then you do the math.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2689.801,
    "end": 2690.962,
    "text": "Then you connect it to the math.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2691.822,
    "end": 2695.164,
    "text": "So something like that might be far more useful.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2696.345,
    "end": 2701.747,
    "text": "Maybe not from an academic point, but it would definitely be useful for practitioners around the world.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2701.987,
    "end": 2702.568,
    "text": "Okay, so this...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2703.508,
    "end": 2709.251,
    "text": " So if, you know, controls engineer gets this, okay, this looks like a better form of model predictive control.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2709.511,
    "end": 2714.253,
    "text": "I can replace my model predictive control with something that resembles active inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2715.133,
    "end": 2721.976,
    "text": "It might actually make, we might actually make more progress that it actually gets out of the loop.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2725.277,
    "end": 2725.818,
    "text": "Thank you, Rowan.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2726.298,
    "end": 2726.498,
    "text": "Brock?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2729.322,
    "end": 2757.033,
    "text": " um yeah i i think i mean i've had similar comments to that of um you know fast ai and benchmarks that that's kind of the ultimate way that's just the way that um practitioners change their um attention now um and that would be really useful but in in the context of the book um",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2758.37,
    "end": 2760.651,
    "text": " I think I agree with everything else that was said too.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2760.671,
    "end": 2769.994,
    "text": "I'm not sure how realistic it is to do that from the point, you know, where the whole field is at right now.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2770.094,
    "end": 2771.315,
    "text": "Sorry about that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2771.895,
    "end": 2772.115,
    "text": "But",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2774.005,
    "end": 2787.19,
    "text": " You know, I think just having some things in context, like there's always this comment about like, you know, it's a nonlinear thing, a text is linear, so of course it will be out of order.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2787.871,
    "end": 2797.935,
    "text": "But like, often the definitions of things are kind of scattered throughout the explanation of them.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2799.085,
    "end": 2827.62,
    "text": " and kind of italicize instead of kind of brought up to the top, you know, in some way you might expect that I, at least from my pedagogical experience, everything, like all math is taught to, you know, like to define your knowns and unknowns and variables at the top and this sort of thing, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2827.68,
    "end": 2827.88,
    "text": "In the",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2828.613,
    "end": 2849.35,
    "text": " context of like the appendices um again there's like i understand that it's a lot you can't you know do you can't add that all in or whatever but just if there was like um either every whenever the next part of the appendice became relevant",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2850.051,
    "end": 2858.798,
    "text": " You know, again, just like having it at the top, like at each section, you're like, okay, so we're going to use part, you know, now building on, you know, what we've done already.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2858.858,
    "end": 2876.273,
    "text": "Like now we're going to use this part of the, this section in the appendices in this section, our equation one, two, three, whatever in, in, in this next section, like just stating it upfront again, just like a, like a, you know, big box at the top or whatever.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2877.853,
    "end": 2893.526,
    "text": " It just would help in wayfinding and disentangling the unfortunate linear format of books that is mapped to this complex thing.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2895.567,
    "end": 2898.61,
    "text": "And so, yeah, I don't know.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2898.75,
    "end": 2900.371,
    "text": "Those general things would be helpful.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2900.892,
    "end": 2903.734,
    "text": "One other thing that is maybe not in the scope of this book, but",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2904.443,
    "end": 2908.284,
    "text": " I spoke to Ali about very briefly at one point about the notation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2909.304,
    "end": 2922.888,
    "text": "Like even in the basic example of the frog here, like Bayesian notation, it's incredibly easy to manipulate variables when they're one letter and subscripts.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2923.748,
    "end": 2926.709,
    "text": "But when the whole variable is like 10 or 20 letters,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2928.766,
    "end": 2946.774,
    "text": " you know, frog P of X equals frog jump, you know, condition on Y. It's like, it becomes a larger, I don't know if this is just me and dyslexic, you know, like, I don't know, but it just seems harder to cognitively kind of work with that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2947.714,
    "end": 2952.476,
    "text": "I don't know.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2952.496,
    "end": 2953.216,
    "text": "Thank you, Brock.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2954.217,
    "end": 2956.938,
    "text": "Yes, the chunking is multilevel.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2958.448,
    "end": 2964.171,
    "text": " and it will be great to explore ways to learn around that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2966.392,
    "end": 2972.494,
    "text": "Here are a few forays where we can copy quotes and have inline definitions.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2973.855,
    "end": 2987.541,
    "text": "So for those who are interested in this kind of work, with an open source textbook, it is not an infinite task or even a non-automatable task to copy out the plain text",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2989.381,
    "end": 3017.81,
    "text": " and integrate it with a versioning ontology so that the definition can be like even rendered differently it could be in a different language it could be every single time that a term comes up there's like so much enrichment that this seed can lead to of the textbook and a lot of it is for us to pick up honestly",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3019.85,
    "end": 3021.051,
    "text": " Rohan, and then anyone else.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3025.775,
    "end": 3027.596,
    "text": "Oh, I forgot to put down.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3027.756,
    "end": 3028.116,
    "text": "Oh, no worries.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3028.477,
    "end": 3028.777,
    "text": "Thank you.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3032.24,
    "end": 3036.563,
    "text": "So in our last seven or so minutes for this session,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3043.86,
    "end": 3049.826,
    "text": " Next week, we will continue with any conceptual points and questions that people want to raise.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3051.027,
    "end": 3065.5,
    "text": "We'll also be turning our attention a bit more to making sure, first off, that please, please, everyone complete the feedback form in the future textbook groups and or",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3067.199,
    "end": 3074.421,
    "text": " add information here or contact us because it's just one of the most important feedback mechanisms we have.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3076.261,
    "end": 3081.902,
    "text": "We'll also be exploring a little bit different project ideas.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3084.103,
    "end": 3089.164,
    "text": "Several of these threads involving different system models.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3090.37,
    "end": 3114.841,
    "text": " we've already found a home for in the act of blockference project where we're meeting uh twice on wednesdays weekly other projects we're going to have new vistas on during and after going through the second half of the textbook",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3115.785,
    "end": 3143.836,
    "text": " which is still black and white static PDFs but we'll be able to augment this heavily with some simulation tools as well as other work like the plain text enrichment or even anyone who wants to collaborate on an audiobook version there's",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3145.347,
    "end": 3150.33,
    "text": " No lack of act-inf tasks today.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3151.771,
    "end": 3168.901,
    "text": "And these are like high leverage point moments where staying in the game and improving the game will do tremendous service towards reducing research debt and improving the rigor in the applications that we see.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3169.842,
    "end": 3170.042,
    "text": "Rohan?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3175.034,
    "end": 3198.992,
    "text": " yeah uh can i make a project suggestion that's fine yes please or everyone can yeah so that yeah okay so there is uh i'm gonna put this in the chat there's this online lab by georgia tech's intelligence systems unit uh called robotaria uh that's basically a bunch of swarm it's to test swarm controllers",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3200.313,
    "end": 3227.755,
    "text": " so uh there's a good baseline over here it would be a good idea to try like an active inference version like an active inference inspired swarm controller to finish the tasks so this runs on actual robots in that lab and you can see the results this is awesome um i had some",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3229.022,
    "end": 3254.279,
    "text": " colleagues who worked with some of the ant groups here it's right at the intersection of like JF's work and many's interest in embodied and robotic angle and we have somewhat extensive um multi-scale generative models of ants",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3255.987,
    "end": 3258.128,
    "text": " which would apply to other swarm settings as well.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3258.708,
    "end": 3281.899,
    "text": "So absolutely, we want to scaffold those projects and one way to start, but not the only way to start is to copy a version of these fields and add and remove as relevant for you and give some handle",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3283.117,
    "end": 3304.99,
    "text": " for others to be involved or just stay in the game so that um more people can join there will be a flow of people entering active inference forever how will we greet them so uh what would i need to put in over there um",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3308.228,
    "end": 3331.463,
    "text": " like it depends on how you want to carry forward the project but you can feel in this row add any notes you'd like and um more details on what you're thinking of doing and then however you want to be more specific about like directions and and just signal it in the idea",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3332.449,
    "end": 3339.873,
    "text": " Or you can in the notes or draft catechism, which is what these templates are based on.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3342.395,
    "end": 3353.981,
    "text": "And if there's ever something you're not sure about, then ask around and different projects are going to proceed differently.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3356.763,
    "end": 3357.683,
    "text": "Okay, yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3357.783,
    "end": 3360.525,
    "text": "So I'll fill that out with my talks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3362.003,
    "end": 3387.149,
    "text": " awesome well interesting meeting it's our penultimate discussion in this section then we hope that everybody who is motivated and ready to do so continues for part two",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3389.511,
    "end": 3414.317,
    "text": " and or rejoins for part one cohort two both of these will be starting in september so we'll take august um off of the textbook and uh at this point the tentative plan is that we'll have two sequential hours like section one and then followed by section two",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3415.478,
    "end": 3435.121,
    "text": " so that those who are on section one can um see how section two is we can explore different architectures and stuff and again this is like why people's active participation and their feedback and the oversharing",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3437.151,
    "end": 3464.377,
    "text": " on topic and just writing all the questions that came in their mind and all the things that they would want to ask somebody to check like every contribution is important does anyone else have any thing they'd like to add before we stop the recording okay stopping the recording",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3466.564,
    "end": 3467.407,
    "text": " Oh yeah, someone go for it?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3472.223,
    "end": 3473.266,
    "text": "Alright, stopping the recording.",
    "speaker": "SPEAKER_08"
  }
]