[
  {
    "start": 7.102,
    "end": 8.143,
    "text": " Hello and welcome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8.524,
    "end": 10.166,
    "text": "It's September 30th, 2024.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 10.226,
    "end": 24.785,
    "text": "We're in Active Inference Gas Stream 89.1, Generic Framework for a Coherent Integration of Experience and Exposure Rating and Reinsurance with Stefan Berneger and also joined by Roland Berge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 25.025,
    "end": 27.489,
    "text": "So thank you both for joining.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 27.989,
    "end": 32.535,
    "text": "Stefan, to you for a presentation and we'll look forward to that and the discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 34.498,
    "end": 34.818,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 34.838,
    "end": 35.539,
    "text": "Thank you, Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 35.958,
    "end": 56.447,
    "text": " welcome everyone um let me quickly give an overview of what i'm going to present it's about reinsurance and reinsurance maybe some of the people on the call are familiar with what the insurance is if you are not no problem i'm going to explain everything you need to know",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 57.035,
    "end": 81.321,
    "text": " basic what reinsurers do they provide coverage to insurance companies and when they provide the contract to cover the risks they of course need somehow to rate this risk and there's two different approaches which are traditionally used one is experience rating the other exposure rating and what I'm to present a new framework which is integrating the two into one",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 83.09,
    "end": 103.95,
    "text": " integrated framework basically and just to what you can see what is highlighted there are three components to it the first component is a generative model the second is i mean the generative model he will create artificial or simulated claims",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 104.555,
    "end": 132.857,
    "text": " and what we need to do before we can do an analysis we need somehow to reduce this high dimensional complex objects into some smaller number of what i call reduced random variables and then we use invasion inference to basically calibrate the model this is basically what is supposed to do so and what you see on the bottom i made a reference to some people in the history so the traditional",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 133.225,
    "end": 159.182,
    "text": " approach where you use a experience rating you're taking the claims from the past you somehow project this into the future and use this data as a model for the future claims activity so that's why i put the kepler who basically took the data from tycho brahe and then he derived his laws for the motion of the planets and then a contrast is newton which",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 159.483,
    "end": 163.773,
    "text": " basic and derive these laws by some much more fundamental principles.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 163.813,
    "end": 168.022,
    "text": "So basically in one case you model the data and the other case you model the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 168.083,
    "end": 169.706,
    "text": "So this is the difference between the two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 170.789,
    "end": 176.682,
    "text": "Of course, in biology would have the Aristotle on one hand side and then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 179.041,
    "end": 180.302,
    "text": " Darwin on the other side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 180.503,
    "end": 186.47,
    "text": "And from the statistics, what you see on the left side, this is the father of the classical statistics of Fisher.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 187.15,
    "end": 189.693,
    "text": "And on the other side, they put the base.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 189.733,
    "end": 193.418,
    "text": "So this is where the frame where we are operating.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 193.438,
    "end": 198.804,
    "text": "Now to my talk, I will first give some background information and explain why this is relevant.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 199.885,
    "end": 203.529,
    "text": "Then I will somehow make a link to active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 203.549,
    "end": 208.575,
    "text": "Then also point out to some of the challenges which we are facing in this attempt.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 208.842,
    "end": 238.309,
    "text": " and then i'll provide with a roadmap for a solution and then i will show some examples and just for your information i will not show any formulas here so whenever you want to look into the formulas we can go back to the paper you find all the technical details so i'll just describe um with the help of numbers and some charts or some graphics what i'm going to or the basic ideas are so just if you expect any formulas you will be disappointed",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 240.618,
    "end": 263.824,
    "text": " okay so first um what i've done i've taken some real numbers from a reinsurance company and this is swissery and from swissery i've taken not the whole business but just one segment which is the pnc reinsurance which is uh property casualty and specialty lines",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 263.888,
    "end": 288.765,
    "text": " um two other segments which history has is a corporate solution so this is then direct insurance provided to large corporations and there is also life and health so what i'm showing here is only pnc reinsurance so range contracts with insurance companies and switzerland has developed about 20 or not 25 years ago an internal framework for",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 289.15,
    "end": 310.18,
    "text": " economic valuation of the business and it has started in 2013 to publish the numbers so evm results which is an economic valuation of the business in contrast to the traditional financial numbers which have been published and what is relevant for us here i'm not going to into details of evm but what we have is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 310.683,
    "end": 334.328,
    "text": " so-called present values of future cash flows this is the basis for it and then it's the analysis done by underwriting year and not by financial year so these are the two main of the most important elements of evm and what we have is let's say the gross premiums and then commissions and the commissions are the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 334.966,
    "end": 363.758,
    "text": " amount of the premiums which goes to the intermediaries so brokers and or goes back to the insurance company in the form of a contribution to the claim or to the internal expenses so what matters is what they've shown here as net premiums so this is it has been increasing for about from 13 billion in 2013 to roughly 18 billion in 2023 and on the right you see the mean and then i use the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 364.21,
    "end": 394.099,
    "text": " the mean yeah over the of the net premiums as a base so this is 100 and then you can see what happens to these premiums so the more the largest part of it is used to pay claims so this is about 85 then you have about 10 is the internal the expenses of the reinsurer of swiss three then we have some other elements like taxes taxes depend on the on the profit so it's linked to the bottom line then we have",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 394.636,
    "end": 395.938,
    "text": " capital cost.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 396.098,
    "end": 399.704,
    "text": "Capital cost is linked to the risk, but these are relatively small numbers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 399.764,
    "end": 404.471,
    "text": "And then the finance people have introduced some small details which they put on the other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 404.832,
    "end": 408.377,
    "text": "So there is a lot of work going into the small elements.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 408.998,
    "end": 421.858,
    "text": "But what really matters for the success of the company is what we have here in claims and benefits and how much premium the company earns to cover these claims.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 422.429,
    "end": 447.053,
    "text": " and just as a what we see here is the numbers published at time one so one year after inception so the 2013 numbers are published in 2014 based on the information which is available at that point in time but claims they have a relatively long um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 448.332,
    "end": 453.162,
    "text": " they can take quite some time until they are known and paid and reported.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 453.182,
    "end": 458.053,
    "text": "So there is only little information available after one year.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 458.133,
    "end": 465.97,
    "text": "So there is some development taking place later and all the developments of prior years is shown at the very bottom.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 466.675,
    "end": 468.979,
    "text": " And we can now see two important things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 469.2,
    "end": 472.967,
    "text": "One is if you go here to the EVM reals, you see kind of a cycle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 473.568,
    "end": 478.998,
    "text": "So there is some positive results, then it becomes very negative for a couple of years, and then it becomes positive again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 479.058,
    "end": 480.04,
    "text": "So this is one thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 480.08,
    "end": 481.984,
    "text": "This is the nature of the business.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 481.964,
    "end": 485.187,
    "text": " And the cycle has two components.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 485.308,
    "end": 487.45,
    "text": "One, the premium rates go up and down.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 488.011,
    "end": 494.858,
    "text": "And second, also the terms and conditions of the policies, they might be tighter or they might be released.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 494.878,
    "end": 498.742,
    "text": "So there's also the claims might change during the cycle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 498.782,
    "end": 501.445,
    "text": "But what we see here is the bottom line result.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 502.266,
    "end": 509.794,
    "text": "And then there is another element here, the EVM profit, the EVM profit of prior years.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 510.23,
    "end": 532.187,
    "text": " and here we can see some quite negative numbers and then here again this is something which you want to avoid this is the big surprise which at the time of underwriting you put aside a certain amount of the premium for the reserves for the claims and then it turns out that this is not sufficient and then you have to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 532.707,
    "end": 538.253,
    "text": " find some means or take capital to increase the reserves in later years.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 538.313,
    "end": 541.897,
    "text": "And this is basically what reinsurers want to avoid.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 543.199,
    "end": 552.269,
    "text": "So of course, what is not shown here is the initial assessment of the underwriters at the time when they look at the business.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 552.349,
    "end": 555.352,
    "text": "So they also have an estimate for the claims.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 555.693,
    "end": 557.555,
    "text": "This would be the claims at time zero.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 558.035,
    "end": 559.657,
    "text": "These are the initial reserves.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 559.717,
    "end": 562.14,
    "text": "What we see here is the claims at time one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 563.15,
    "end": 582.846,
    "text": " and what is important to know is of course the estimate is quite on a contract or a transaction level is quite high the uncertainty but the problem is that underwriting functions they tend to underestimate the claims during the soft market",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 583.467,
    "end": 595.013,
    "text": " they're too optimistic and then the adverse developments and they overestimate the claims cost during the hard market so there may be too conservative and they might miss some opportunities",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 595.803,
    "end": 622.198,
    "text": " and if you just look at this picture here then you can say there is a potential for improvement in this case of swissery i mean this is my from the outside view maybe the entire people will say something different but just looking at these numbers i would say that adverse development so the numbers which we have here which in the order of one to two billion this could be improved",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 622.972,
    "end": 627.267,
    "text": " potentially by about 10% of the premiums.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 627.749,
    "end": 630.197,
    "text": "So about, let's say, one or two billion per year.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 630.218,
    "end": 634.332,
    "text": "So there is quite some potential to reduce this uncertainty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 634.649,
    "end": 658.497,
    "text": " that's one motivation to do this and the second motivation is of course by better risk selection you could also increase the bottom line results so this 470 million the average but let's say one which is three percent maybe for one or two percentage points of the premium volume so these are is the motivation so we talk about quite substantial numbers in the case of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 658.477,
    "end": 680.299,
    "text": " the profit maybe 100 or 200 million per year which additional profits could be done but better six collection and we come to adverse development which is basically the unwanted uh development in future years maybe one or two billion this is my claim people can prove me wrong but this is what i think is possible",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 681.41,
    "end": 707.198,
    "text": " now sorry now if you look at this slide there is three uh charts with the temporal development and what we have done here i've taken the numbers by uh sub line of business so this is also published by swiss reese i'm not inventing anything and let's first look on the left hand side what we see here is different lines of business so the red one here will be um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 708.038,
    "end": 728.511,
    "text": " liability on the top we have here property and we see they develop quite differently now what is this development which i'm showing here this chart shows which percentage of the claims is reported after one year and we see in casualty it's only about 10 in properties maybe 50 percent",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 729.453,
    "end": 755.528,
    "text": " and then it takes maybe in casualty 10 years maybe or even longer until all the claims have been reported so this is just a reporting pattern and which is lined up business dependent then report it means that there is a an initial the insurance company they have notified the reinsurer there is this in this claim and they have put up some case reserves and reserves for it",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 756.065,
    "end": 761.11,
    "text": " But then it can take another couple of years until the claims are paid.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 761.25,
    "end": 764.313,
    "text": "And this payment pattern is shown here on the right hand side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 764.353,
    "end": 768.877,
    "text": "So you see again here, in the case of liability, it's very slow.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 768.897,
    "end": 772.441,
    "text": "So the payments can take 10, 20, 30 years.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 773.081,
    "end": 778.807,
    "text": "In the case of short tail or property, this is normally settled within a few years.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 780.488,
    "end": 785.633,
    "text": "And then what I have shown in the middle, this is the key topic of today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 786.17,
    "end": 815.248,
    "text": " so one point is the initial estimate of the claim so this is what underwriting is doing and the question is what is happening with this estimate down the road and this is shown here in the middle and here in the for the red which is a liability again you can see here at time one it's only between depending on 70 80 percent of the latest numbers so there is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 815.684,
    "end": 825.133,
    "text": " In time one, the reserves are maybe here 80 or 70%, and then these reserves have to be gradually increased until they reach a stable level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 826.334,
    "end": 831.919,
    "text": "In the case of property or X and Ls, at time one, we are higher, and then it decreases.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 831.939,
    "end": 835.021,
    "text": "So here we have kind of a favorable development.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 835.682,
    "end": 844.51,
    "text": "So reserves can be released, and here we have an adverse development, which means you have to constantly increase the reserves in order to be able to pay all the claims.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 845.367,
    "end": 851.375,
    "text": " And if you go back here, we can see in the first, after one year, it's only 10% of the claims have been reported.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 851.936,
    "end": 855.861,
    "text": "So whatever reserves we have here is the estimate of the underwriters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 855.921,
    "end": 857.924,
    "text": "There is nothing else, no other information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 858.625,
    "end": 868.418,
    "text": "So here we can be very confident that the initial estimate of the underwriter was more or less on the same level because there is no additional information coming in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 868.438,
    "end": 874.767,
    "text": "So they started 20 to 30 percentage points below the ultimate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 875.118,
    "end": 897.767,
    "text": " which is quite substantial in the case of short tail lines it's not so clear because you see here about 50 of the claims have already been reported so it could be that the claims manager they're quite conservative at the beginning they reserve more than what is necessary and then it comes down here we don't know maybe we started higher it came down maybe started below and it came up in the first year",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 898.287,
    "end": 922.168,
    "text": " it's not so clear but overall we can say some business starts too high whichever and then it has a favorable development some starts just at the right level and it's all flat or we have an adequate estimate at the beginning and in other cases it's adverse and this is basically what we want to avoid now there is another complication",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 922.57,
    "end": 925.653,
    "text": " And this is that the market is not stable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 925.673,
    "end": 932.081,
    "text": "The market goes through cycles, as we've seen at the beginning with the numbers of Swiss Re.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 933.002,
    "end": 950.181,
    "text": "And what I've tried to show here is if you take each and every contract, you can put a tag on each one and say it either contributes to the economic profit or it's just adequate to cover the expenses and all the costs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 950.802,
    "end": 979.577,
    "text": " or maybe some business you even if it is negative but you want to keep it because you want to keep the client relationship so this is then and the problem is nobody knows what the true color is so basically the underwriters they take each contract and they do an assessment and they say one contract is green one is amber one is red but it could be false positives or false negatives this is not known",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 980.266,
    "end": 1001.802,
    "text": " of course if a contract is red and you say it's green then you write as much as possible of it and then you end up having with adverse and adverse development and of course you also then you have the winner's car so you're much much more likely to get this contract than if having one which is positive and everyone else also sees it positive so this is kind of the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1002.203,
    "end": 1029.207,
    "text": " um broader context in which the underwriting or the market is operating and if you say the underwriters are biased then you can say they um are so there is a true let's say that the true border between the three buckets but the underwriters they believe that the borders may be up here um in the case of a hard market",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1029.541,
    "end": 1031.564,
    "text": " So they are too conservative.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1031.604,
    "end": 1044.484,
    "text": "They say some business which actually is already amber, they put it into the red bucket and some business which is green, they would put it into the amber bucket and vice versa during the soft market.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1044.504,
    "end": 1046.968,
    "text": "So this is the problematic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1046.988,
    "end": 1052.376,
    "text": "And by improving the underwriting,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1052.744,
    "end": 1064.696,
    "text": " And by avoiding the bias and reducing the uncertainty, you can get this dashed line here closer to the true border and here as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1064.716,
    "end": 1066.297,
    "text": "So that's the aim of the whole thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1066.357,
    "end": 1073.924,
    "text": "So this is where I'm making a claim that there is quite some potential for improvement for a reinsurance company.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1075.026,
    "end": 1077.548,
    "text": "Now, there is, of course, also different approaches to reinsurance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1077.568,
    "end": 1081.772,
    "text": "So if you're a big company like Swiss Re, then you have to do these assessments",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1082.343,
    "end": 1109.65,
    "text": " in other cases if you are a small you say i don't do this myself i save this cost and i just follow the leaders yeah then you just basically can do it for free and you try to write the same business ever as the large ones and then you have the same at the lower cost ratio this is also a possible approach or you can say i don't care over the cycle the market will correct itself and i just write and that i'm sure that i can survive the soft market",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1109.63,
    "end": 1112.153,
    "text": " and then I will earn during the hard market.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1112.173,
    "end": 1114.195,
    "text": "That's also possible approach.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1114.215,
    "end": 1123.086,
    "text": "So we talk here about a company which does a fundamental assessment, and that's why it's necessary to go through this analysis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1123.106,
    "end": 1128.752,
    "text": "Okay, now just a few thoughts about how to link this to active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1128.792,
    "end": 1137.122,
    "text": "And what I've first been thinking about the corporation, so the corporate agents, they act very similar to humans,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1137.507,
    "end": 1163.076,
    "text": " um i mean they're also competing for resources they have an incomplete knowledge of the external world they also use the internal representation of the external world with the help of models and so on then we have multiple departments which in our corporation and they use of course they have a different picture of the outside world and they also have different",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1163.393,
    "end": 1167.663,
    "text": " interest, so they are not always pursuing the same goals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1167.683,
    "end": 1172.594,
    "text": "So this is kind of, maybe we feel the same as humans, we are also not always sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1172.634,
    "end": 1177.405,
    "text": "One thought wants to go in one direction, then the other direction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1177.506,
    "end": 1180.693,
    "text": "So I think this is very similar to corporations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1181.5,
    "end": 1210.579,
    "text": " and of course corporations at the end they have people there at least this is still the case so we have also biological brains driving them and i think active inference is a very good tool to also understand the behavior of corporate agents in many different levels but what i'm doing here i'm just focusing on underwriting or in reinsurance and um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1212.601,
    "end": 1219.329,
    "text": " what I'm going to show how generative models can be used in this process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1220.51,
    "end": 1238.01,
    "text": "And maybe just if you want to look at a broader role of active inferences or in economics, then there is one link which also introduced the term of cognitive economics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1238.05,
    "end": 1241.494,
    "text": "So this is where it's in a broader picture where it would fit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1242.098,
    "end": 1269.878,
    "text": " okay now what i'm showing here is what you need to understand about how reinsurance works so we have the external world where we have objects at risk this can be buildings this can be people this can be airplanes this can be corporations which maybe could default and so on so these are the objects at risk then we have the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1270.583,
    "end": 1298.953,
    "text": " range of the insurance company which i call here the sedent which issues policies to cover some risk for these objects then there is the external world where you have the generative process which creates all kind of events and some of these events like an earthquake or windstorm or an accident or a defaulting company results in insured claims now",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1299.625,
    "end": 1305.635,
    "text": " The reinsurer doesn't get all this information which is available on the side of the seeding company.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1306.216,
    "end": 1311.185,
    "text": "What the seeding does, it creates a submission and the submissions, you can put it into three buckets.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1312.006,
    "end": 1315.953,
    "text": "In one bucket, we have the claims which are reported to the reinsurers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1316.313,
    "end": 1319.659,
    "text": "Normally, this is claims above a certain threshold.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1320.533,
    "end": 1343.267,
    "text": " the second bucket contains the contract terms so of course you have the what were the reinsurance conditions in the past but maybe also some insurance conditions so insured retentions or some limits and the like so what is which act like a filter on the claims and the third bucket is the exposure profile which is basically",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1343.737,
    "end": 1358.539,
    "text": " some statistics about sometimes also details about the insured qualities and the objects at risk so in the case of earthquake you maybe want to know is my the building which i'm covering um in",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1358.924,
    "end": 1367.778,
    "text": " California on top of fault or is it somewhere in the center of Africa where there is no earthquake risk?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1367.798,
    "end": 1370.522,
    "text": "So there it's important to have also some additional information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1370.863,
    "end": 1375.971,
    "text": "But what exactly we find in the exposure profile depends very much on the line of business.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1376.407,
    "end": 1402.819,
    "text": " the games of claims this is much more standardized basically what you have is the amount of the claim and the payments so you can put it into cash flows and some outstanding claims so this is some it's much easier to standardize the claims within the exposure you need specific information depending on the line of business then what reinsurers then have there as i mentioned already before you have two models one is experience rating",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1403.238,
    "end": 1405.266,
    "text": " The other is exposure rating.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1405.286,
    "end": 1408.057,
    "text": "Experience rate takes the claims and the contract terms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1408.098,
    "end": 1411.712,
    "text": "The exposure rating takes the exposure and the contract terms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1412.249,
    "end": 1441.176,
    "text": " then there is a quite heavy involvement of the underwriter or the actuary which is depending who does it and in both models you then get some results with some statistics and since these two results can be quite different there is some blending process thank you place and then you end up with the projective statistics for the cover year then you take into consideration other",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1442.017,
    "end": 1465.915,
    "text": " things like you have of course underwriting consideration client management which has some saying and risk management and finance so there is now this information is just one element in the decision process and at the end of the day you end up with a reinsurance contract for the future so this information is about the past and the present you and you use it to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1466.384,
    "end": 1486.57,
    "text": " project some statistics and and the expectations for the future this is basically where you have the expected loss cost which i mentioned before which you want to be on by be unbiased and as minimize the uncertainty so this is where the circle is closing you could also represent it with a",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1487.208,
    "end": 1494.682,
    "text": " Markov blanket, you have some things happening inside of the blanket, the information coming in and some action going out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1494.702,
    "end": 1500.012,
    "text": "So this is where active inference is basically visualized.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1501.816,
    "end": 1504.12,
    "text": "Okay, now the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1504.91,
    "end": 1528.133,
    "text": " step to the integrated approach and is so basically we are looking now into these two parts so these two models the experience rating and exposure made model this is the focus area and what we do here we have two things first we have a generative model now this generative model",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1528.687,
    "end": 1554.627,
    "text": " is very similar to the exposure rating model but the difference is the exposure rating is only applied to the future to the cover year while the generative model is basically taking the same sorry model and you apply it to the past so you don't only apply it for the cover year this is then comes later but you first do a calibration of this model",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1555.045,
    "end": 1559.069,
    "text": " And this calibration is done with the reported claims.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1559.169,
    "end": 1565.676,
    "text": "So you use the claims not to project them into the future, but you take the model and project the model to the past.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1565.696,
    "end": 1569.66,
    "text": "And then you compare the outcome of your model with the actual claims.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1570.301,
    "end": 1572.022,
    "text": "And then you calibrate the model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1572.082,
    "end": 1579.45,
    "text": "And once it's calibrated, you can take this model project into the future and produce all the statistics you need for the future cover year.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1580.211,
    "end": 1582.453,
    "text": "So this is the basic",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1582.855,
    "end": 1585.058,
    "text": " secret of this presentation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1585.239,
    "end": 1587.702,
    "text": "So, as I mentioned before, it's a generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1588.483,
    "end": 1595.734,
    "text": "You have reduced claim statistics and you have Bayesian inference, which you apply to calibrate the model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1595.754,
    "end": 1602.384,
    "text": "Maybe you have to go through multiple iterations, but this is basically where the matching is happening.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1603.466,
    "end": 1611.057,
    "text": "And what I have done in my paper, I've basically looked at this part here, because here the generative model",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1611.509,
    "end": 1616.159,
    "text": " you need to come up with a very specific model for each business segment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1616.179,
    "end": 1621.951,
    "text": "So for each line of business, you have different data available, you have different models which you are using.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1622.633,
    "end": 1627.764,
    "text": "So this is where really the expertise of the reinsurer comes into play.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1627.824,
    "end": 1631.712,
    "text": "So they will have to provide these exposure models",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1632.063,
    "end": 1647.962,
    "text": " generative models for each segment but once this is done then you can basically standardize this part here the model has to produce some claims in a standard format you compare them with the reported claims and you then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1648.6,
    "end": 1652.285,
    "text": " come up with some calibration parameters, which you feed back into your model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1652.765,
    "end": 1660.055,
    "text": "And once this is calibrated, you can then apply it to the future and do everything you need to do on this right-hand side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1660.075,
    "end": 1663.599,
    "text": "So that's basically the magic here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1664.701,
    "end": 1672.11,
    "text": "And we will see it's much, again, you need much less",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1673.305,
    "end": 1700.663,
    "text": " input from the underwriter because here in the past when you need to when you do experience right you have to project these claims to the future so there's a lot of assumptions going into this process because then if you go to the past the portfolio was different maybe the claims that in the past are no longer representative so there's many many assumptions which come from the underwriter and this can be avoided in this approach here",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1702.212,
    "end": 1706.636,
    "text": " Okay, now, so far, it sounds relatively easy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1706.736,
    "end": 1709.919,
    "text": "But of course, if it was easy, maybe it wouldn't have been done.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1709.959,
    "end": 1713.803,
    "text": "So there are some challenges which you need to resolve.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1713.923,
    "end": 1720.289,
    "text": "And to understand this, what I've done here, I'm just taking a few simulated claims.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1720.409,
    "end": 1722.531,
    "text": "And what we have here is the time axis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1724.493,
    "end": 1731.78,
    "text": "In the vertical, we have the incurred amount, so the estimate of what the ultimate is going to be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1732.452,
    "end": 1738.557,
    "text": " And in the Y axis, I have the paid amount.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1738.577,
    "end": 1740.839,
    "text": "And let's assume here at the end it's settled.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1741.36,
    "end": 1743.261,
    "text": "So you can see the estimate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1743.842,
    "end": 1750.167,
    "text": "So first it goes up and then it comes down and then there is some adjustments.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1750.808,
    "end": 1752.069,
    "text": "At the end it goes up again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1752.209,
    "end": 1754.631,
    "text": "So you can see this in this curve here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1755.051,
    "end": 1762.037,
    "text": "The paid, first there is nothing paid and then it goes up and then eventually we have the final payment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1763.283,
    "end": 1764.585,
    "text": " So this is one example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1764.625,
    "end": 1770.212,
    "text": "But what can also happen is that at the beginning, you know nothing about the claim.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1770.713,
    "end": 1773.556,
    "text": "So the claim is reported with some delay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1773.616,
    "end": 1780.345,
    "text": "So the accident date is here in 2016, but the reporting date is 2020.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1781.046,
    "end": 1787.434,
    "text": "So in this time, you have to put up so-called IBNRs, incurred but not reported.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1788.275,
    "end": 1806.469,
    "text": " reserves for all the claims which will be reported later you have also seen this at the beginning the case of history the reporting pattern was the chart on the left so this is the the nature of the business now if i take one claim so the whole graph here is one claim and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1806.837,
    "end": 1822.442,
    "text": " I can either present it with a graph in a three-dimensional space as I did here, or you can take each payment and each incurred adjustment and say that's just one element and then you put it into a high dimensional space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1823.263,
    "end": 1832.558,
    "text": "So you can say that each claim is an element in a high dimensional sample space and the dimension here is maybe something between",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1832.538,
    "end": 1857.533,
    "text": " uh 10 in the best case or connect will be up to 100 so it's very high and it's just a high dimensional space where it's very very thinly populated imagine you get about maybe 100 or in a or 1000 claims per submission and in a um if you have a claim with 100 or 50 or even 20 dimensions you're completely lost there's nothing you can do",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1858.222,
    "end": 1875.884,
    "text": " So what is done here, and this is maybe the only formal symbols I'm using, here I say the sample space is high dimensional and what we do, we decompose it in m one-dimensional spaces.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1875.964,
    "end": 1877.686,
    "text": "That's basically the whole idea behind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1877.726,
    "end": 1881.09,
    "text": "So we need to find some variables which are more or less independent",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1881.965,
    "end": 1891.267,
    "text": " and we project these claims to these subspaces, and then we can solve the problem in a one-dimensional space a couple of times.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1891.347,
    "end": 1900.969,
    "text": "But it's then with a one-dimensional problem, which is much easier, of course, because then we have 100 to 1,000 claims in a one-dimensional space, and this is easy to handle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1902.417,
    "end": 1912.913,
    "text": " So this is the second part, so the reduction, and I will show you how this is done, but just to understand that this step is necessary, else there's nothing you can do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1914.215,
    "end": 1917.7,
    "text": "Now, if I go here, how can we solve this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1917.72,
    "end": 1923.008,
    "text": "So this is again, another representation of the standard approach.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1923.275,
    "end": 1929.282,
    "text": " So what you have down here, you have claims which are, in this case, 10 years old.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1929.622,
    "end": 1932.786,
    "text": "So I use minus for relative to the underwriting year.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1932.806,
    "end": 1934.608,
    "text": "So it's underwriting year minus 10.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1935.429,
    "end": 1940.095,
    "text": "Here, these claims have been reporting pattern of 10 years.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1940.175,
    "end": 1943.939,
    "text": "So you know the first 10 years of the development.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1945.141,
    "end": 1951.408,
    "text": "But for the most recent year, so which is minus one, you have only one year of development.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1952.198,
    "end": 1976.873,
    "text": " so this is now if you try to do traditional experience rating there is two things you need to do you need to project all the past to the future so this is one step yes you need to trend the claims and say on an as if basis a claim which happened in the year minus 10 what would it be if it would happen in the year plus one which is basically my cover period",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1977.747,
    "end": 2003.468,
    "text": " then what you see here is you get this kind of triangle so some claims you have 10 years of development but the most recent one they have only one now the problem is that these recent claims are maybe representative for the portfolio but they have very little development the old claims you have a lot of development but they are no longer representative and now what you need to do is you need to take this triangle and project it to the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2003.887,
    "end": 2030.333,
    "text": " uh to the end and see what is the end of this thing so there's a lot of as i said a lot of underwriting assumptions going into these two these fundamental steps and this is the experience-based approach in the case of exposure rating when you take the information which is available at normally the minus one so the market experience these are the market models you have the exposure profiles",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2030.566,
    "end": 2059.054,
    "text": " insurance conditions you project everything to the cover period then you apply your model and you get an exposure based result and then you take the two and blend them and that's then the result um i can take the same now and represent what is it in the this gene integrated approach so again the three steps so first i now use my exposure model",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2059.895,
    "end": 2085.632,
    "text": " not only for the future this is then the last step this is what i will have to do but before i do this i'm calibrating my model so i apply the model to the past so i take all the market experience which i had in the past the profiles from the past the the models which cannot change over time and the insurance conditions so i have a one model for each year",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2086.456,
    "end": 2108.093,
    "text": " some of the information might be the same but basically i can now run this model for the year minus 10 and i can create not only one but 100 or 1000 or as many as i want simulated sets with claims and i do this for the entire period so i have here now a large number of sets",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2108.579,
    "end": 2114.085,
    "text": " I could say it's K different sets and I have one observed set.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2114.105,
    "end": 2128.521,
    "text": "And now I can say the general statement is my model is calibrated if this one observed set of claims is not an outlier in the set of all simulated claims.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2128.541,
    "end": 2137.371,
    "text": "So if this is one element or basically one member of this family here, then I can say, yes,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2137.722,
    "end": 2160.203,
    "text": " um i cannot reject my model because it is compatible with the data and once this is the case then i can project it to the future and around the model now on the problem is now doing a comparison on this level so to compare the all the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2161.212,
    "end": 2168.842,
    "text": " claims which I've in here with all the claims over here, we are operating in this high dimensional space, and there is basically no way to do it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2168.862,
    "end": 2172.847,
    "text": "So what we do in first is we reduce the claims.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2173.188,
    "end": 2174.689,
    "text": "So this is happening here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2174.71,
    "end": 2181.819,
    "text": "And we represent the simulated claims in the same way as we represent the observed claims.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2181.859,
    "end": 2183.381,
    "text": "So we use the same statistics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2183.982,
    "end": 2187.947,
    "text": "So from the latest year, I could, of course, I could simulate it till the end.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2188.547,
    "end": 2190.51,
    "text": "But I'm only taking the first year.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2191.52,
    "end": 2197.875,
    "text": " So the system knows behind what's happening to the end, but for the analysis, I'm only taking the first year.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2197.975,
    "end": 2201.984,
    "text": "And if I go back 10 years, I take the first 10 years of the simulation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2202.726,
    "end": 2209.461,
    "text": "So basically, exactly the same representation of the claims in the simulated sets and in the observed set.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2210.133,
    "end": 2240.022,
    "text": " now i project it as i said before to these one-dimensional spaces and then i can do the analysis and i can come up with calibration parameters this is the um how this basically works now we can have now a look at the how do we reduce the claims and i have shown here two very simplified developments one is the reported pattern and the other",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2240.204,
    "end": 2243.73,
    "text": " or the incurred, and then the paid amount.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2243.75,
    "end": 2252.685,
    "text": "So the in the case of the incurred is again, it takes a couple of years until the sometime until the claim is reported.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2252.745,
    "end": 2254.307,
    "text": "So I've here a reported leg.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2255.63,
    "end": 2266.127,
    "text": "And then the claim, then first estimate of the incurred and then here there's an adjustment and here again, and then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2266.36,
    "end": 2283.897,
    "text": " it got this continues into the future until the claim is closed but of course this information i don't have so what i'm taking here is the latest estimate for the ultimate this is what i call i for the incurred star",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2284.619,
    "end": 2310.087,
    "text": " for the case simulation for instance on the right hand side i have then the payment patterns and what is important to make sure that the payments are always smaller than the incurred because usually um as there will be this is one of the boundary conditions in this information but we don't really care about the individual numbers",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2310.252,
    "end": 2337.863,
    "text": " what we do is we take here an average legs it's basically the area which i have here above the curve so this gray area here if i divide it by the amount then i get the incurred leg this is this part here this is one of these reduced numbers so i'm not looking at the details i'm just taking the average leg which i have here so this is one figure i'm taking",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2338.315,
    "end": 2345.401,
    "text": " And then another statistic I can use is the number of adjustments, which I have seen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2345.421,
    "end": 2347.383,
    "text": "This is one, two, three.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2347.884,
    "end": 2350.626,
    "text": "That's also one number I'm using to calibrate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2350.786,
    "end": 2355.23,
    "text": "So to say how many adjustments is an insurance company making for the claims?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2355.311,
    "end": 2356.632,
    "text": "Is it large or is it small?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2357.553,
    "end": 2359.875,
    "text": "So these are the reduced statistics here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2359.895,
    "end": 2365.74,
    "text": "So the reporting lag, the amount, of course,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2366.243,
    "end": 2369.975,
    "text": " in card lag and the number of adjustments.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2369.995,
    "end": 2378.261,
    "text": "And on the paid side, I can take very similarly the paid amount or the ratio which is paid.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2378.361,
    "end": 2379.645,
    "text": "I can also take",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2380.267,
    "end": 2397.448,
    "text": " a paid lag and also the number of payments so these are some of these reduced random variables which i'm using for calibration so i'm simplifying and these numbers are considered to be largely they're not completely independent but they are largely independent",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2399.2,
    "end": 2419.909,
    "text": " now here is another um representation of the of the process um so we again we have now at the bottom the events which are leading to insured claims we have the set twist claims and the the part which is observed so this is more or less what the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2420.311,
    "end": 2448.006,
    "text": " seeding company is reporting to the insurer and then we have a set of reduced claims on the other side we have now the generative model which is creating the case sets with simulated claims this can be very detailed then maybe in the first step you align these claims representation with the observed claims and then in the next step we reduce them and then we take",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2448.239,
    "end": 2468.391,
    "text": " this information here to come up with a conditional distribution functions then you take the observations and you apply base and you end up with the calibration parameters which you can feed back into the model so this is the another representation of this process",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2469.569,
    "end": 2478.641,
    "text": " And once the model is calibrated, then of course you can go and apply to the future and do everything you need to be able to rate your business.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2481.965,
    "end": 2484.208,
    "text": "Okay, now let's look at some results.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2487.453,
    "end": 2490.316,
    "text": "First, what I've done here is very simple.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2490.797,
    "end": 2494.682,
    "text": "I've used, in this case, not actual claims, but",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2494.814,
    "end": 2500.002,
    "text": " I've used a simulator for the generative process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2500.984,
    "end": 2505.251,
    "text": "And what I've done here, it's a log-normal process, and I assume there is some trend.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2506.072,
    "end": 2516.168,
    "text": "So I go back the years and I have the true probability distribution for each year, which is represented in the vertical axis here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2516.188,
    "end": 2517.57,
    "text": "You see here the probability.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2518.211,
    "end": 2521.817,
    "text": "And I've drawn one random number",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2522.422,
    "end": 2527.288,
    "text": " for each year, which is shown here with these small diamonds.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2528.67,
    "end": 2532.515,
    "text": "And what we also have here is then the projection to the future.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2532.535,
    "end": 2546.453,
    "text": "So assuming this trend continues, we have then the, this is then the true, in this case, for the generative process, which is simulated, but this is the true distribution in the future.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2547.575,
    "end": 2550.859,
    "text": "Now, here I have my generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2551.362,
    "end": 2577.285,
    "text": " and you can see my initial model is how it is flat so there is no trend in there and what i can do in in a simple approach simply say okay let me try to adjust the level so i'm just moving this model up and down and try to align it with the data this is done down here so here we have then again a flat model but you can see at the beginning it's",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2577.94,
    "end": 2581.105,
    "text": " too high, because the observations are on the lower side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2581.506,
    "end": 2584.831,
    "text": "And at the end, it's too high, because the observations are on the higher side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2584.851,
    "end": 2588.097,
    "text": "So actually, there seems to be some trend in the data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2588.137,
    "end": 2594.467,
    "text": "And which, of course, reflects the trend in the underlying model, which is unknown.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2595.429,
    "end": 2601.779,
    "text": "Now, if I can also do is to say, Okay, I'm trying, I'm calibrating the level and the trend.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2601.799,
    "end": 2604.724,
    "text": "And this is what I've done here in this third picture here,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2605.345,
    "end": 2609.031,
    "text": " Now I have, you can see a model which is increasing over time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2609.111,
    "end": 2616.142,
    "text": "So this is the generative model and you can see now it's well aligned with the data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2616.883,
    "end": 2627.84,
    "text": "And if I compare now just the first two moments, so the mean and the standard deviation, then here I'm quite close to the true hidden model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2627.86,
    "end": 2632.467,
    "text": "So this is basically unknown, but this is what I've put behind the scenes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2632.885,
    "end": 2636.31,
    "text": " The true model is 83 with a standard deviation of 8.3.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2636.851,
    "end": 2641.698,
    "text": "And here I have 88 with a standard deviation of 8.8.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2642.078,
    "end": 2643.741,
    "text": "So it comes pretty close here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2643.841,
    "end": 2648.067,
    "text": "My initial model was 60 with a sigma of 6.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2648.828,
    "end": 2655.478,
    "text": "If I calibrate only the level, I end up with 72 and the standard was a sigma of 7.2.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2656.86,
    "end": 2662.268,
    "text": "So you can see if I use this approach, then I can",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2662.67,
    "end": 2665.194,
    "text": " get very close to the hidden true model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2666.375,
    "end": 2669.941,
    "text": "Here is a second example, which is now a compound model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2669.961,
    "end": 2674.087,
    "text": "So I have a simulating the number.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2674.107,
    "end": 2682.9,
    "text": "I take a negative binomial distribution to simulate the number of claims and then the log normal distribution to simulate the severity of the claims.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2682.98,
    "end": 2685.884,
    "text": "And this is again shown here and the same approach.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2687.306,
    "end": 2689.69,
    "text": "You have the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2690.834,
    "end": 2713.483,
    "text": " just calibrate the level and you calibrate the level and the trend and you get pretty close to the initial model so just a different process behind but the principle is the same now here i have another mod approach where i show you a little bit more in detail what's actually happening",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2714.02,
    "end": 2718.833,
    "text": " Here I have again a negative binomial distribution for the generative process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2718.873,
    "end": 2723.085,
    "text": "Now here I've shown the probability mass",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2724.432,
    "end": 2753.342,
    "text": " uh function so the probabilities for each outcome and what you show see here in the second part is then a log normal fit to this distribution and i could i could do the analysis with the discrete distribution which is possible but it could be computation a little bit more challenging but it's doable but",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2753.812,
    "end": 2780.14,
    "text": " what we can see as long as we we want to assume that the observations are in the high density region of the model so we can easily replace it by a fictive distribution which is a much easier to handle because here we can use a um oh can i find the term",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2782.432,
    "end": 2789.942,
    "text": " So the whole Bayesian analysis is basically much easier if you take a log-normal distribution than compared to a negative binomial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2791.164,
    "end": 2793.868,
    "text": "Now, here again, done the same.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2794.369,
    "end": 2802.6,
    "text": "Now, here what I have, the probability distribution is not the model behind it directly, but simulated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2803.002,
    "end": 2830.36,
    "text": " uh models where i have the take my generative model i'm simulating a large number of claims and then i take the empirical distribution as a basis for my analysis and here again i fit a log normal distribution so we're just fitting the first two moments and then i do the analysis with this fitted distributions what i've also shown here is then i've aggregated the whole",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2831.2,
    "end": 2837.868,
    "text": " 10 years or 12 years here into the into the mean and show the distribution of the mean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2839.29,
    "end": 2845.197,
    "text": "And I can use this distribution to calibrate the level if I want.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2845.257,
    "end": 2854.208,
    "text": "So the level calibration I can do by using the annual data, but I can say I'm just looking at this overall distribution and I calibrate it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2854.268,
    "end": 2858.473,
    "text": "So this is when you see here, then you see the observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2858.453,
    "end": 2887.448,
    "text": " and the calibrated observation is more or less in the center of the distribution but still if i look then at each and every year then i still have this trend which is missing so if i am calibrating level end trend then you can see here i come i'm up with a model which is very close to the initial or to the true hidden generative process so this is um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2888.879,
    "end": 2914.195,
    "text": " the how it works so you take your generative model to create the simulated distributions you fit discrete sorry a continuous distribution to it and then you apply base by using your priors and you find out you can find out the calibration parameters now",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2914.613,
    "end": 2938.714,
    "text": " here what i've now put everything into one chart to say at the end what we have is we have seen we have different reduced random variables so here's the number of reported claims then we have the reported lag and the incurred amount the incurred lag",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2939.133,
    "end": 2941.055,
    "text": " the number of incurred adjustments.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2941.556,
    "end": 2947.884,
    "text": "Then for the paid, we have the paid lag and the number of payments.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2947.904,
    "end": 2959.378,
    "text": "And what I've shown on the right is some additional strongly dependent variables, which we can use to observe, to check if the model is OK.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2960.119,
    "end": 2965.386,
    "text": "But in this case, I've only calibrated this green area here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2965.506,
    "end": 2968.009,
    "text": "And here, I've just shown one",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2968.208,
    "end": 2989.542,
    "text": " a hand where i can change the level and another one where i can change the trend and maybe i run multiple iterations in this case i think i run it five times to basically be able to deal with the dependencies and what i've shown now is that as you can see here this is now the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2990.635,
    "end": 3019.343,
    "text": " the distribution which i'm using in as a as a prior and then behind this is in light gray you can see the true distribution so you see here there is an offset and after calibration you can see these two distributions are basically overlapping which means there is no gap anymore and this is here is another big gap here it's already at the beginning okay",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3020.521,
    "end": 3044.875,
    "text": " um and so you can see the calibrated model is basically very close or the deviation like here is smaller than one standard deviation so this is basically as good as you can get so this is the um how the whole framework works so we apply to multiple random variables so the ones i introduced before so the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3045.243,
    "end": 3065.057,
    "text": " which is shown here you can have some additional random variables which you just monitor and then you run your your calibration model until you are satisfied with the result and then you apply the model to the future now just to summarize i've looked here this also you can find in the paper",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3065.29,
    "end": 3072.002,
    "text": " the comparisons of the integrated framework, what are the pluses and compared to the standard approach.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3072.022,
    "end": 3080.498,
    "text": "And you can see it is when you use all information in a coherent way, you don't waste any information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3080.731,
    "end": 3096.225,
    "text": " in the standard framework there's a lot of information you cannot use and it's not aligned so it's this approach here is superior in all regards but there is of course it it's not for free the price you have to pay is the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3096.205,
    "end": 3103.213,
    "text": " the computational effort and also the effort to set up the whole system because you need to be able to run it to the past.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3103.233,
    "end": 3113.305,
    "text": "Of course, this effort is much higher, but you have the benefit that maybe you can substantially reduce the uncertainty and the bias in your estimates.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3113.325,
    "end": 3115.948,
    "text": "So this was the motivation which we addressed at the beginning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3117.41,
    "end": 3118.951,
    "text": "Okay, here's just the summary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3119.071,
    "end": 3124.778,
    "text": "So basically we have the process and the traditional model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3124.943,
    "end": 3133.502,
    "text": " and over here the integrated approach and it's a kind of a paradigm shift",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3134.107,
    "end": 3155.946,
    "text": " which requires that you have a new mindset to approach it because the actuaries especially in certain in the anglo-saxon region they have well-defined processes how they are supposed to rate the and assess the range of spaces this is you will not find in any of these uh um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3157.833,
    "end": 3184.448,
    "text": " documents which are used so it's a completely different approach and this will the market will probably is in some areas maybe not open to it so you need you need a different mindset you need the different skills so i think once you want to introduce something like this you need to run this in parallel to traditional approach until you realize that it has a benefit and maybe it's a similar process when as when swiss reintroduced the evm framework it took about",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3184.833,
    "end": 3187.417,
    "text": " more than 10 years until they went public with it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3187.497,
    "end": 3189.921,
    "text": "So these things can take quite some time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3190.422,
    "end": 3200.117,
    "text": "But maybe there is a new technology which is around in artificial intelligence, maybe there is some way to shorten this transition period.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3200.137,
    "end": 3201.699,
    "text": "Okay, this is my part.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3203.422,
    "end": 3205.245,
    "text": "So thank you for the attention.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3205.525,
    "end": 3209.912,
    "text": "And I think we're open for the discussion and questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3211.192,
    "end": 3231.208,
    "text": " thank you for the great presentation anyone in the live chat can write a question otherwise roland it would be great for you to say hello give any remarks in a first question and then scott thank you sure so first of all congratulations stefan so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3231.644,
    "end": 3241.978,
    "text": " Stefan used to be my boss at Swiss Re and he's one of the OGs who came up with all the pricing frameworks that are still in place today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3241.998,
    "end": 3251.712,
    "text": "I was super happy when I met him again and he showed me what he's been up to here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3251.978,
    "end": 3274.408,
    "text": " and i think that's really where to take it because when i look back in the last 20 years or so there were like almost no developments in this area and i think nowadays with all the ai happening it's it's really time to do something like this but now comes my biggest question to you stefan",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3274.388,
    "end": 3276.914,
    "text": " Do you think that the world is ready for this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3276.994,
    "end": 3282.728,
    "text": "Do you think that anyone will look at this, that there is any form of acceptance for this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3284.372,
    "end": 3291.57,
    "text": "You see, I mentioned it before, I'm very skeptical, because we have",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3292.023,
    "end": 3314.841,
    "text": " standardized approaches and i have already tried to also to approach some i mean i left switzerland about 10 years ago and i was doing something completely different to me and this then came up somehow as a side product of other activities and then i remembered i had this problem in the back of my mind which i wanted to already address at that time i presented some ideas at that time and nobody was open for it",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3315.192,
    "end": 3327.058,
    "text": " and if i by talking to some of the former colleagues i have the impression they are not ready that's why i mentioned here it requires a new mindset maybe a new mindset requires new people",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3327.41,
    "end": 3346.33,
    "text": " and i don't know what has to happen to the industry maybe there is some smaller companies which say oh great this is an opportunity for us so let's jump on this but i think the old dinosaurs so far i don't see any willingness to change their approach",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3350.596,
    "end": 3356.669,
    "text": " Okay, Scott, if you'd like to give any initial remarks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3357.391,
    "end": 3365.348,
    "text": "I know you wrote a novel in the chat, but if you'd like to give any remarks and maybe a question somehow concisely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3365.868,
    "end": 3370.774,
    "text": " Daniel knows that when I write a lot in the chat, it's an excitement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3370.794,
    "end": 3375.74,
    "text": "So Stefan, first of all, thank you for fantastic presentation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3376.361,
    "end": 3388.495,
    "text": "And it's a feeling for saying where have you been all my life, because you've given voice to a lot of the things that felt ever since I've heard about active inference felt like they needed to be thought about in risk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3389.757,
    "end": 3394.002,
    "text": "And so I was a corporate and tax attorney for 30 years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3394.471,
    "end": 3395.993,
    "text": " And so I see these things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3396.114,
    "end": 3407.732,
    "text": "So I think my main question is, and what is one of my latter questions in the chat, I'm always looking for ways to introduce new things where you don't have to rip and replace.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3408.253,
    "end": 3417.508,
    "text": "Because people who remember talking to the head of security of AT&T one time, and he said, why would we do anything different next Tuesday than we did last Tuesday when we made a billion dollars?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3418.079,
    "end": 3421.643,
    "text": " So how do we get people to want to do something?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3422.184,
    "end": 3447.512,
    "text": "And what I wonder is as a immediate matter, could the generative model, the application in your slide right here under the Beijing approach of projected generative model to the past, could that be included as a calibration in effect, but on the existing projection of claims history to the future, that analysis?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3447.492,
    "end": 3464.533,
    "text": " Is there a way to make the thing that we're aspiring to migrate towards a part of an existing part of the analysis so that it's seen as being additional but not requiring migration to the new analysis entirely?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3464.673,
    "end": 3473.344,
    "text": "Is there a way to bolt this on so that people can start getting used to it, seeing its value in the context of the analysis that's already being done?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3473.544,
    "end": 3475.727,
    "text": "Or are they so fundamentally",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3475.707,
    "end": 3484.078,
    "text": " different that the new approach doesn't lend itself to being offered as an add on an existing approaches?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3484.138,
    "end": 3485.099,
    "text": "What are your thoughts on that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3486.38,
    "end": 3487.922,
    "text": "Yeah, very good question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3487.962,
    "end": 3497.474,
    "text": "But if you look at these two slides, just over here, and over here, both approaches use more or less the same information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3498.376,
    "end": 3504.263,
    "text": "Of course, you might say, okay, here, maybe have a different model than over here, but it could also be the same model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3504.85,
    "end": 3514.723,
    "text": " So you can, I think it's necessary that in the transition phase you apply this new concept in parallel to the existing methodology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3515.284,
    "end": 3526.779,
    "text": "So the people can also get the feeling what is the difference and then it will take some time, I don't know how many years, until you see the results because you will not see the results immediately.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3527.38,
    "end": 3531.786,
    "text": "It will take some time until you see that yes, down the road we have",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3531.766,
    "end": 3555.85,
    "text": " really much less adverse development in the claims and this you meet maybe you need about five years of experience until you see the results really materialize and this is probably also the time it takes for the people to familiarize with the methodology I think we want to implement something like this you need to do it step by step maybe you don't",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3555.83,
    "end": 3581.787,
    "text": " do it at the beginning for all lines of business you maybe confine it to a few lines of business and then over time you can expand to some other and of course people need to get used to it and once so you run the old framework in parallel and then you can compare and it's time you get the sense for it and once you feel comfortable then you can basically turn off the old part well",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3582.475,
    "end": 3586.679,
    "text": " Thanks again for all just give a short note.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3587.24,
    "end": 3605.658,
    "text": "This slide really captures the difference here, going from extrapolating descriptive statistics on observables into making a generative world model that's based upon or conditioned or updated from observables, but also has latent states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3605.678,
    "end": 3611.183,
    "text": "It's like, we don't remember the time series of visual input and then extrapolate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3611.264,
    "end": 3619.045,
    "text": " we update based upon the observations and then use that to do the now casting and the forecasting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3619.607,
    "end": 3622.434,
    "text": "So that has all kinds of beneficial properties.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3622.474,
    "end": 3627.147,
    "text": "The reduced representation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3627.127,
    "end": 3654.501,
    "text": " uh and the ability to explore direct counterfactuals generate synthetic data there's just a lot of things that a purely time series correlation based approach doesn't really get at the question i wanted to throw out to all of you was as a non-reinsurer coming from a biology perspective what are biological analogies to the reinsurers or the underwriters role",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3654.835,
    "end": 3676.405,
    "text": " like could it be considered to an epistemic foraging portfolio like research projects or could it relate to like individuals and they're waiting in a group like risk profiles of different foraging strategies within a group or how how does it happen because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3678.781,
    "end": 3701.548,
    "text": " that idea of being too or too little cautious in a changing context with the hard and the soft market and there's a possibility of being over or under risk averse in either setting but you don't know the true risk setting",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3704.11,
    "end": 3709.177,
    "text": " Maybe let me try to first provide just a short thought.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3709.838,
    "end": 3713.484,
    "text": "If I look at biology, then I think biology, you find it over here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3713.524,
    "end": 3721.836,
    "text": "And I don't have difficulties to come up with an analogy in biology which correspond to this approach here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3722.357,
    "end": 3725.041,
    "text": "But maybe someone else has a better idea.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3725.482,
    "end": 3729.848,
    "text": "But maybe just one analogy, something I did here, it's kind of intentional, I put here",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3730.351,
    "end": 3746.503,
    "text": " you see one part of the information into red one into green and one into blue so you could say this corresponds to the uh cones you have in your eyes so basically you also have three receptors for different information",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3747.04,
    "end": 3769.032,
    "text": " which of course it's just now it's not really one-to-one comparison but this is maybe what i try to do so you have the receptor you combine this this thing you come up with the internal view of the external world and then you act on it so this is the analogy as far as i can see it but maybe someone else has a better example in mind",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3773.753,
    "end": 3778.926,
    "text": " I mean, at the broadest level... Sorry, Roland, did you have something?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3778.946,
    "end": 3780.069,
    "text": "No, just go ahead, David.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3780.631,
    "end": 3783.578,
    "text": "I was going to say, at the broadest level, I put it in the chat,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3785.38,
    "end": 3788.204,
    "text": " I mean, it feels like, so I used to work in securitizations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3788.925,
    "end": 3798.079,
    "text": "So you take credit card portfolios or car finance portfolios and put them into packages and sell them off.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3798.84,
    "end": 3803.467,
    "text": "And that used to occur to me that what you're doing is trying to find a bigger sucker for the risk, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3803.487,
    "end": 3804.829,
    "text": "You package it up, you make it look good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3804.929,
    "end": 3812.84,
    "text": "And that was the 2008 financial break was packages of mortgages that were crappy mortgages because the banks were enthusiastic about selling off the mortgages.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3812.86,
    "end": 3813.261,
    "text": "So they",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3813.241,
    "end": 3819.47,
    "text": " made the mortgages so they were appropriate for sale in these packages, but they weren't necessarily good risks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3819.49,
    "end": 3821.633,
    "text": "So the risk just got iterated up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3821.653,
    "end": 3829.204,
    "text": "And what I'm wondering, you know, you think about a biology, what do you what are the name of the organisms that eat dead decaying matter, like leaf litter and stuff like that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3831.046,
    "end": 3832.228,
    "text": "Whatever, they",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3832.445,
    "end": 3837.731,
    "text": " I mean, death, it's everything's recycled and risk is recycled continuously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3837.751,
    "end": 3838.812,
    "text": "That's what biology is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3839.293,
    "end": 3853.97,
    "text": "So you have this big negentropic urge that negentropic beings have, whether they're physical or not, and they're all dealing and everyone loses ultimately their own individual battle on negentropy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3854.871,
    "end": 3856.613,
    "text": "All organisms die.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3856.694,
    "end": 3859.08,
    "text": " but then they're recycled by other organisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3859.221,
    "end": 3862.77,
    "text": "And so there are copper fights that eat poop, things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3862.79,
    "end": 3865.236,
    "text": "I mean, there's all sorts of recycling that happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3865.597,
    "end": 3870.67,
    "text": "And so it feels like from a reinsurance perspective, you have abstractions of risk,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3871.274,
    "end": 3886.264,
    "text": " With all insurance, you're creating instruments to create an organism, a sim-infogenesis organism that can cause you to de-risk in ways you can't do alone, period.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3886.324,
    "end": 3887.967,
    "text": "So it's like a eukaryote.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3888.115,
    "end": 3897.343,
    "text": " Right, you're adding, people could just not do reinsurance and not do insurance and self-insure, and then have to pay the full price of their house burning down or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3897.864,
    "end": 3903.269,
    "text": "But we have these abstractions where we kind of develop these eukaryotic things and say, hey, let's do this together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3903.289,
    "end": 3909.595,
    "text": "It's a good idea, because then I just pay a premium, I get a house back, and then the reinsurers say, hey, let's do this together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3909.635,
    "end": 3915.54,
    "text": "We got all this different flood kind of risk or whatever, and we can do an evaluation at a metadata level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3915.52,
    "end": 3921.613,
    "text": " It feels a lot like exactly what happens in biology without memos and voting and all that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3922.214,
    "end": 3930.492,
    "text": "And so the power of what you're talking about and revealing Stefan feels like this is how stuff works if we don't get in our own way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3931.298,
    "end": 3936.304,
    "text": " politically and with false models from a history of economics, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3936.845,
    "end": 3947.537,
    "text": "And if we really allow for the information to flow among the entities at risk, doesn't mean that every organism survives forever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3947.557,
    "end": 3956.428,
    "text": "It's not about perpetual motion or perpetual life, but rather there's a balance that happens naturally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3956.982,
    "end": 3970.764,
    "text": " feels like as an immediate matter, there's an ability to sell this to the quants on Wall Street and say, hey, your model is slightly out of whack with the biophysical physics reality, the mathematical physical reality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3971.184,
    "end": 3972.987,
    "text": "And so, hey, you're an arbitrageur.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3973.428,
    "end": 3977.214,
    "text": "If you want to make money on the difference between reality and your model, here it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3977.594,
    "end": 3978.436,
    "text": "You don't have to do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3978.756,
    "end": 3979.758,
    "text": "Do what you're doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3980.399,
    "end": 3983.243,
    "text": "So it feels like it could be pretty attractive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3983.223,
    "end": 3998.278,
    "text": " in the right kind of audience for people who have to deal with risk professionally that they can't turn away once you say something to them if it has value and shows value they won't be able to say oh no we're just going to do it our old way and their clients won't tolerate that anyway",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3998.258,
    "end": 4000.923,
    "text": " Sorry, I got a little excited there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4000.943,
    "end": 4001.825,
    "text": "It's great stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4001.925,
    "end": 4006.334,
    "text": "Yeah, but you go in the absolutely correct direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4006.915,
    "end": 4013.027,
    "text": "I've had to calibrate a lot of risk models in my life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4013.147,
    "end": 4019.119,
    "text": "And when you look at the definition of risk, it's what happens above the expected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4019.369,
    "end": 4028.449,
    "text": " So normally you subtract the expected and normally you have to answer questions like what is the worst that can happen within 100 years?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4028.57,
    "end": 4033.661,
    "text": "And hardly any one of us has ever lived 100 years to actually tell, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4034.563,
    "end": 4039.133,
    "text": "And so actually what you learn very quickly when you're a risk professional",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4039.113,
    "end": 4046.864,
    "text": " is that you have to break down the question to something that fits the experience horizon of a living being.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4047.084,
    "end": 4056.117,
    "text": "And so typically when I was calibrating risk models, I saw, okay, this guy has been in his profession for 10 years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4056.758,
    "end": 4062.186,
    "text": "So I was asking questions around what was the worst thing that happened in 10 years?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4062.767,
    "end": 4068.715,
    "text": "And then given a model you try to extrapolate, so what's the worst that can happen in 100 years, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4068.695,
    "end": 4074.285,
    "text": " And in my opinion, this approach here is just doing it much more systematically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4074.646,
    "end": 4081.339,
    "text": "So we always had a bit of a tendency to do this, but it was more heuristics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4081.359,
    "end": 4088.492,
    "text": "And this kind of gives it a more scientific way of looking at the problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4090.413,
    "end": 4092.055,
    "text": " That's awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4092.376,
    "end": 4095.58,
    "text": "I'll just make one quick... Oh, go ahead, Stefan.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4096.261,
    "end": 4101.048,
    "text": "I mean, you mentioned, or Scott mentioned the financial market.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4101.228,
    "end": 4110.141,
    "text": "You know, when I joined the reinsurance industry, this was many years ago, the first thing which happened was the collapse of the so-called LMX market.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4110.882,
    "end": 4114.547,
    "text": "This was the London excessive loss market.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4115.769,
    "end": 4120.015,
    "text": "And what they did there is they just handed the risks",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4120.248,
    "end": 4142.627,
    "text": " from one to the next and it went around the circle many many times and then there were claims and the claims were also circled around so the same claim you had already suddenly you get it by the back door again and you put it on top of it and this happened until someone run out of cover and then it was there were some big losses then happening some natural events some other things",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4143.046,
    "end": 4161.358,
    "text": " uh i think there was a piper alpha it was a windstorms in europe there were hurricanes on and suddenly this whole thing collapsed so it was working before because the the circling these things around took very long as long as it was this paper but then they started to introduce uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4161.659,
    "end": 4169.032,
    "text": " So the whole thing went much faster and the whole thing collapsed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4169.052,
    "end": 4172.939,
    "text": "And so the industry had to learn already in the past.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4172.959,
    "end": 4182.857,
    "text": "And I don't know what has to happen for the industry to maybe go through a new leap and to start to implement new technologies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4182.837,
    "end": 4194.231,
    "text": " approaches because as long as there is nothing massive impacting as you also have mentioned before then maybe people are just saying okay why should I change anything everything is okay",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4196.692,
    "end": 4207.421,
    "text": " And if I can, so I put in the chat, that's a direct relationship of what you're talking about there to climate change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4207.621,
    "end": 4210.004,
    "text": "And let me tell you what I think is going on here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4210.584,
    "end": 4212.946,
    "text": "I think it's pretty wild.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4213.487,
    "end": 4215.328,
    "text": "So we talk about abstractions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4215.688,
    "end": 4217.49,
    "text": "We have abstractions upon abstractions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4217.51,
    "end": 4223.415,
    "text": "You've got futures markets and derivatives, and they're trading upon trading upon trading, and there's all intangible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4223.515,
    "end": 4226.698,
    "text": "Now, there's a connection ultimately to some physicality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4226.678,
    "end": 4232.404,
    "text": " some commodity or some phenomenon, but there are abstractions that are layered on abstractions and that's fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4233.165,
    "end": 4237.75,
    "text": "But the challenge is we're trying to de-risk and create negentropy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4239.592,
    "end": 4245.979,
    "text": "We're dissipating information differentials in those abstract areas and that requires energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4247.301,
    "end": 4249.463,
    "text": "AI requires coal burning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4250.337,
    "end": 4279.804,
    "text": " And so the energy generation in physical space, coal, oil, et cetera, and the agriculture required to feed the people who did all that stuff that's required in physical space to keep taking these exponentially increasing levels of abstraction in intangible risk space, because the financial markets are one set of instantiations, but reinsurance is an abstraction on top of an abstraction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4279.784,
    "end": 4284.333,
    "text": " The insurance didn't exist in all forms forever, and it keeps getting more abstracted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4284.413,
    "end": 4286.297,
    "text": "Forward contracts are a form of insurance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4286.317,
    "end": 4288.021,
    "text": "When you're hedging, you're doing it for insurance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4288.702,
    "end": 4299.143,
    "text": "Speculation in markets like that create liquidity, but also make it noisy in terms of what the risk profile is, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4299.41,
    "end": 4313.091,
    "text": " It feels like as we're de-risking in abstract space, information space, it requires energy that we have to burn coal for in physical space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4314.753,
    "end": 4319.701,
    "text": "And so it's an insidious problem that we continue to try to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4320.122,
    "end": 4325.67,
    "text": "I have to go get something at the door, but I wanted to make that point about that relationship between climate change and the information space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4327.591,
    "end": 4327.912,
    "text": " Thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4329.295,
    "end": 4335.388,
    "text": "One key point, Roland, that you mentioned was fitting the experience horizon to the living beings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4336.51,
    "end": 4346.933,
    "text": "In some ways, that's the cognitive approach, which is fit it to the cognitive slice, like the sense making and decision selection in the moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4346.913,
    "end": 4352.721,
    "text": " And then there's the consequences for the kinds of AI or synthetic intelligence models that are made.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4353.242,
    "end": 4370.647,
    "text": "For example, downloading all of the Internet's plain text data, that's more experience than one human life learning, and then using correlative aspects of that large data set to then carry forth those correlations forward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4371.048,
    "end": 4373.832,
    "text": "That's like the LLM framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4373.812,
    "end": 4398.435,
    "text": " and then the question is how and where alongside or differently does a small generative model or some other kind of nested or structured generative model come into play that is able to do better or differently than just recapitulating correlations plus plus plus",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4399.816,
    "end": 4401.861,
    "text": " And how that actually plays out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4401.881,
    "end": 4407.917,
    "text": "And then I think there was a great comments about how does it really get adopted or how does it be shown to make a difference?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4407.938,
    "end": 4415.698,
    "text": "And it can be used in retrospective meta analysis, possibly with the kinds of data that you've shown today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4416.607,
    "end": 4430.742,
    "text": " So having open source and clear methods for doing the retrospective and saying, not saying that doing anything differently would have been better, but here's how this pattern of outcomes and decision-making differed from this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4431.884,
    "end": 4439.712,
    "text": "So give a meta-analytic framework for longer past time series, do backcasting kind of like in stock trading.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4440.232,
    "end": 4446.677,
    "text": " And then open up that space of, well, people are familiar with stock trading and investing based upon the mean value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4446.717,
    "end": 4451.355,
    "text": "And this moves it into also thinking about the variance profiles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4453.748,
    "end": 4457.152,
    "text": " I find this extremely interesting as an observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4457.872,
    "end": 4467.142,
    "text": "I used to work also at Swiss Re together with Stefan and I used to head an initiative in casualty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4467.463,
    "end": 4483.62,
    "text": "And you see in property, things are somewhat objective because you have earthquakes and you have wind storms and they have kind of a physical nature and you can study how the earth works and you understand it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4484.225,
    "end": 4487.69,
    "text": " something like liability is much more manmade.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4487.95,
    "end": 4493.919,
    "text": "And so essentially it's all about things that are not supposed to happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4493.939,
    "end": 4498.967,
    "text": "So you always have like an infinite configuration space and you cannot model it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4500.229,
    "end": 4512.747,
    "text": "And already at the time, it was like 20 years ago, but I said, we need to have like monitors to systematically scan the media, what's being published, what's the awareness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4512.878,
    "end": 4523.277,
    "text": " Because with a certain likelihood, the lawyers are going to pick up what's in the media and they are going to do lawsuits about it, which then result in liability claims.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4523.818,
    "end": 4528.407,
    "text": "And there I see exactly the applicability of LLMs and all this stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4528.387,
    "end": 4535.736,
    "text": " Because what they can do extremely well is put things in a correlation with each other, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4536.456,
    "end": 4543.945,
    "text": "And so I think especially for modeling casualty business, I see a huge potential in what you are saying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4544.025,
    "end": 4555.018,
    "text": "So just putting LLMs on top and finding out any form of dependence between what's being published and lawsuits, etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4558.458,
    "end": 4561.943,
    "text": " So Stefan, where are you gonna go with this work?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4561.963,
    "end": 4563.685,
    "text": "Or what are your directions?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4564.847,
    "end": 4567.11,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4567.17,
    "end": 4567.751,
    "text": "Good question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4568.212,
    "end": 4580.028,
    "text": "But you know, as I think I briefly mentioned, this, see, maybe just make a short comment about my career.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4580.729,
    "end": 4582.572,
    "text": "So I have a degree in physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4583.834,
    "end": 4587.839,
    "text": "But then after my PhD, I then went into reinsurance industry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4587.859,
    "end": 4588.38,
    "text": "And",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4588.748,
    "end": 4617.152,
    "text": " left the reinsurance industry about 10 years ago and then i was doing completely different things but this topic here was kind of something which was brewing in the back of my mind so by exploring other fields and the maybe i have to say this is also thanks to my wife which she exposes me to all kind of topics suddenly i got familiar with different approaches how to solve problems",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4617.622,
    "end": 4641.3,
    "text": " and then suddenly this uh um i saw a way how to solve this issue here and my intention was simply to bring it to paper to write it down to publish it and get it out so basically say okay then for me the this is done but now roland came into the picture and he is now coming up with some ideas that maybe we can",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4641.517,
    "end": 4642.519,
    "text": " do something with it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4642.539,
    "end": 4644.702,
    "text": "So I don't know exactly what's going to happen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4645.303,
    "end": 4651.193,
    "text": "I, as I also mentioned, I approached some colleagues from former colleagues, but there was no big interest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4651.995,
    "end": 4661.531,
    "text": "And I've also seen in, when I published the paper, the peer reviewers, they say, yes, it's interesting, but for them, it was not something they say, yes, we need to move in this direction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4661.611,
    "end": 4665.718,
    "text": "It was simply asking what is then the benefit compared to the old approaches.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4666.39,
    "end": 4673.299,
    "text": " So so far, I don't see really the I haven't encountered anyone which is open to it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4673.819,
    "end": 4679.606,
    "text": "And I didn't have any plans, because I have other ideas, which I want to presume and retired and I have other projects.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4680.187,
    "end": 4689.278,
    "text": "But depending what is happening, if people approach me and say, Yes, how can we somehow implement this framework, then I'm open to be involved there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4689.298,
    "end": 4692.162,
    "text": "But I have no specific plans to do anything with it anymore.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4694.116,
    "end": 4697.006,
    "text": " maybe some reinsurance listened to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4697.126,
    "end": 4705.915,
    "text": "So I think obviously it's not very nice to do a dry exercise with fake data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4706.384,
    "end": 4712.333,
    "text": " So we should have real data and we should have a real interest behind it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4713.375,
    "end": 4725.555,
    "text": "But maybe if some reinsurers are listening to this podcast, please contact us and let's see that we can collaborate in this, that we can do something in this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4730.362,
    "end": 4734.028,
    "text": "Yeah, there's a lot of things to say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4735.392,
    "end": 4762.935,
    "text": " laid out calculation and the kinds of bayesian analyses that are described with this kind of baseline structure and then as you alluded to that's even before getting into multi-agent cognitive economics thinking more about the decision making the sense making of different entities this is just taking in a very specific approach to structuring the data and the input",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4764.502,
    "end": 4773.092,
    "text": " And it's an interesting direction to see what tools and how general does the toolkit have to be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4773.172,
    "end": 4781.362,
    "text": "Like when you say external data comes in, that could range from nothing to all the stock data in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4781.482,
    "end": 4792.635,
    "text": "So how do you even exactly go about that to make it useful without just saying, well, it could be tiny or it could be all the data analysis in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4792.767,
    "end": 4802.523,
    "text": " And then again, how does that connect to doing similarly or better or different than the kinds of models already in play, and then the decisions coming out of those?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4805.407,
    "end": 4808.052,
    "text": "I mean, it's funny because... Oh, go ahead, Stepan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4808.693,
    "end": 4809.033,
    "text": "Oh, sorry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4809.314,
    "end": 4820.091,
    "text": "I think you bring an interesting thought into the picture, because what I see, you can see I focus on a very tiny part of the whole decision process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4820.408,
    "end": 4848.171,
    "text": " but of course you can expand now this market blanket approach and make say okay at the end we have within a reinsurer company there is many different buckets which we could try to understand from this from the perspective of this new framework and see how is the the corporate decision processes what are they happening how do different places part of parts of the company interact",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4848.708,
    "end": 4870.041,
    "text": " how can the company interact with, I mean, there's other information coming from the outside, I mean, you have other stakeholders, I mean, I just looked here just as the insurance clients, but there, of course, there is the, you have the financial part, you have the, maybe some, you know, the exchanging risk, maybe you have the stock,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4871.135,
    "end": 4884.992,
    "text": " shareholders and so on so there is many different facets and you can also see them yourself as part of a bigger economic framework and see what is your place in there so at the end of the day i think if you want to have kind of digital earth",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4885.36,
    "end": 4893.336,
    "text": " you could try to expand this kind of thinking into some much bigger framework and try to understand.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4893.516,
    "end": 4901.833,
    "text": "I don't know if anyone has the capability to do it because it sounds pretty complex, but maybe with the help of artificial intelligence we might get there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4906.083,
    "end": 4916.152,
    "text": " This is another thought, because every time we have these tech revolutions, like now with the AI revolution, it also shifts industry players, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4916.172,
    "end": 4928.963,
    "text": "So if we look at the invention of the smartphone before phone companies were called like Ericsson or Nokia, and afterwards they were called Apple and Google.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4928.983,
    "end": 4934.368,
    "text": "And so I think there are always these shifts when tech revolutions come.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4934.348,
    "end": 4945.856,
    "text": " And I think this AI revolution together with such modeling, it could actually then suddenly become attractive for big tech to start doing reinsurance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4946.357,
    "end": 4950.788,
    "text": "Because what you need is you need capital, they have capital.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4950.768,
    "end": 4953.371,
    "text": " and you need skills.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4954.112,
    "end": 4960.219,
    "text": "And they are actually quite good at acquiring data and analyzing data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4960.239,
    "end": 4966.767,
    "text": "So maybe it's exactly this type of model that makes it accessible for big tech now to enter the domain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4971.633,
    "end": 4974.717,
    "text": "Reinsurance on digital information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4978.645,
    "end": 5001.733,
    "text": " interesting area i mean if you look at this insurance it's very very simple it's basically saying we need someone who absorbs is the last resort for risk yes you need to be able to assess this risk and in the case if something happens you need to be able to pay and i mean this is the traditional approach but this could be easily replaced as roland said by other",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5001.95,
    "end": 5029.881,
    "text": " players which step into the market and since it's not largely regulated this entry point should be relatively easy if you have the technology and if you have also the financial strengths behind and of course the skills this is the important part then you can basically replace all the reinsurance industry and it's not complete fiction if you look at alibaba this big chinese um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5030.215,
    "end": 5048.207,
    "text": " amazon so alibaba started selling insurance so it's it's not completely off because they they have a platform so i could picture uh you know amazon or or facebook to start selling insurance it's it's not completely science fiction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5052.068,
    "end": 5066.314,
    "text": " okay very interesting uh roland and scott if you have any last comments then stefan you can have the last word okay all good scott okay what is your what's your last word stefan",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5068.15,
    "end": 5086.868,
    "text": " okay well i didn't think about having a last word but i mean for me it was very interesting also having this discussion it was for me as a new experience to be in a podcast and to present in this way i mean of course i was presenting many uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5086.848,
    "end": 5111.607,
    "text": " traditionally and it's now I'm entering it my later days into a new uh platform which was quite uh an interesting experience so I enjoyed it having this conversation and then let's see what's happening out of it great all right thanks again all until next time okay thank you",
    "speaker": "SPEAKER_03"
  }
]