[
  {
    "start": 6.65,
    "end": 23.157,
    "text": " hello welcome everybody it's november 1st 2023 and we are in the closing discussion section for this first instance of active inference for the social sciences it's been a journey",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 24.185,
    "end": 38.321,
    "text": " sure we'll have many fun things to talk about and explore today so avil please take it from here and maybe give a overview of what we're gonna do and talk about today",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 41.371,
    "end": 48.134,
    "text": " Okay, so this is the conclusion session of our course on active inference and for the social science.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 48.554,
    "end": 55.238,
    "text": "We have talked extensively about active inference, maybe less extensively about for the social science parts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 56.278,
    "end": 65.583,
    "text": "So the goal of the session would be basically to assess what we talked about and how it is relevant or not to the practice of social sciences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 68.21,
    "end": 88.008,
    "text": " Basically, this is a discussion session, so there is no clear plan, but I'd like to address how formally active inference accounts for agency and normativity and identity as a kind of integrated phenomenon, how it can compare or add to or ground or",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 89.025,
    "end": 98.408,
    "text": " clash with, I don't know, sociological and political model of agency and of social evolution and of etc., etc., all the topics that we addressed, which are numerous.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 99.748,
    "end": 111.771,
    "text": "And discuss about the plausible future for active inference, what it can be used to, maybe what it will be used to, certainly, how it may change and how it's relevant to the discussion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 113.592,
    "end": 116.352,
    "text": "So, yes, that is the...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 121.388,
    "end": 131.436,
    "text": " We have brought in Alexey, who is a philosopher interested in social ontology, specifically the study of social kinds, which is from Kairos Research.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 132.497,
    "end": 135.899,
    "text": "And I do not know who Colin is, but he's with us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 136.28,
    "end": 136.8,
    "text": "Hi, Colin.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 139.222,
    "end": 141.764,
    "text": "So how should we proceed, Daniel?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 142.444,
    "end": 142.945,
    "text": "What do we do?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 144.806,
    "end": 149.25,
    "text": "If you'd like, maybe pose a specific question or prompt.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 150.558,
    "end": 155.641,
    "text": " which could be preceded by a statement, and then we can all hear everyone's voice on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 157.883,
    "end": 168.83,
    "text": "OK, so a good question would be, Active Inference describes agency and normativity and identity as a kind of integrated phenomenon.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 169.33,
    "end": 172.713,
    "text": "I think we should go over how precisely it works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 178.519,
    "end": 179.5,
    "text": " So yes, let's do that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 179.58,
    "end": 185.964,
    "text": "I will find some, you say, illustration that will make it easier.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 185.984,
    "end": 189.147,
    "text": "But let's hear people's thoughts on that, please.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 193.37,
    "end": 196.152,
    "text": "Can you pose your question just a tad more clearly?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 196.932,
    "end": 203.457,
    "text": "How are agency normativity and identity addressed separately and together in active inference?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 209.181,
    "end": 210.002,
    "text": " Mao, go for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 212.964,
    "end": 218.388,
    "text": "So I think we like to look at things in terms of interrelations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 218.669,
    "end": 221.07,
    "text": "In active inference, nothing is defined by itself.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 221.171,
    "end": 223.352,
    "text": "It's defined in relation to other things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 224.013,
    "end": 232.62,
    "text": "And this definition in relation to other things also defines the types of constraints that will be pushed on the thing which is separate from other things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 234.181,
    "end": 244.529,
    "text": " Once you have this, you necessitate these interrelationships to be formative, ontological and fundamentally contextual.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 244.649,
    "end": 252.015,
    "text": "So nothing, no relationship is perfectly reproducible across a different context.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 252.075,
    "end": 258.841,
    "text": "It will take on a hermeneutics of semantics, given the exact context of the spatial temporality of the entities.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 260.542,
    "end": 262.323,
    "text": " Those are some first thoughts.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 262.383,
    "end": 266.366,
    "text": "Does anybody have like big objections to what I just said?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 266.386,
    "end": 274.952,
    "text": "Okay, so let's start.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 276.353,
    "end": 277.254,
    "text": "Oh, yeah, please continue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 277.274,
    "end": 277.454,
    "text": "Sorry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 278.12,
    "end": 280.403,
    "text": " Let's start with the concept of agency, for instance.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 281.905,
    "end": 284.048,
    "text": "Agency is just action selection, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 284.068,
    "end": 292.639,
    "text": "So agents are modeled, they have a generative model, and they use it to predict sensory inputs based on possible actions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 294.597,
    "end": 299.599,
    "text": " They try to select those to minimize the difference between predicted and sensory inputs.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 300.9,
    "end": 303.021,
    "text": "So they're just trying to minimize free energy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 303.061,
    "end": 308.883,
    "text": "And this minimization is fundamentally due to the relationship of constraints in their environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 308.923,
    "end": 319.288,
    "text": "So let's imagine that I am an individual who... Sorry, I saw a comment and I didn't...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 321.808,
    "end": 327.592,
    "text": " So you have an individual that tries to exert control over the environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 327.933,
    "end": 347.106,
    "text": "Now, if you scale this in nested structures, you can try to think of power structures and how agency within those power structures is modulated by the different kinds of constraints that are both embedded within the environment itself, within the materiality of the environment, and also within the normative aspects",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 347.666,
    "end": 357.268,
    "text": " of the nested structures which pull and push an individual within certain paths through some kinds of deontic cues.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 357.308,
    "end": 373.011,
    "text": "So that's how you get to the notions of encoding agents' beliefs and preferences about the world within the generative model through a form of normativity, which is just a higher precision over a specific type of outcome or mapping.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 373.991,
    "end": 385.656,
    "text": " So your prior beliefs here come from different layers in the hierarchy, and these act as what we call culture or normativity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 386.517,
    "end": 388.537,
    "text": "I could stop here if you want to say something, Avel.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 389.578,
    "end": 402.644,
    "text": "So I agree with what you said at a high-level conceptual scale, but I think it's important to be clear about what formally warrants the statement, because what we have formally is much more limited",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 403.939,
    "end": 406.688,
    "text": " what we agree the interpretation could be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 407.35,
    "end": 411.063,
    "text": "So can you see the screen I'm sharing?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 413.069,
    "end": 416.07,
    "text": " Can you see the mouse doing aids?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 416.591,
    "end": 416.771,
    "text": "Yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 417.491,
    "end": 417.871,
    "text": "OK.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 418.471,
    "end": 425.495,
    "text": "So at core, ActiveInference is a framework that provides geometry for chemical systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 425.695,
    "end": 430.057,
    "text": "That is not a very straightforward way to put it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 430.637,
    "end": 433.098,
    "text": "But what we have is a system with a space of states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 433.618,
    "end": 435.639,
    "text": "And we have a flow over the system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 435.699,
    "end": 436.8,
    "text": "A flow is a function that's",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 437.7,
    "end": 442.842,
    "text": " basically tells you where a specific point goes with time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 443.642,
    "end": 458.686,
    "text": "And what Active Inference says is that given specific patterns of demical coupling and of statistical dependencies, we have agent-like behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 459.347,
    "end": 460.687,
    "text": "So the simplest kind of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 462.051,
    "end": 479.436,
    "text": " the basic requirement of active inference of sorry the infringing principle which is a core motivation for active inference is that you have an ecosystem so something with states and a flow and some noise because we need noise to get information and it has a boundary in the middle of it that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 481.577,
    "end": 509.203,
    "text": " statistically separates the external internal states by statistically separate i mean that every information about what's going on on there that is in there it disappears when condition on there so information i have about this that i could read here i can also read there and that's certainly different from a chemical coupling but this is formalism let's not get too much into this",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 510.103,
    "end": 538.711,
    "text": " and then you have more complex behavior when you can partition sensory and active states and your particle it can do things in this specific context we can write basically we can write a geometry for the fluctuation of the system and this geometry it entails belief of various states so these internal states it knows thing in a sense about what's going on out there through its coupling through sensory and active states",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 539.779,
    "end": 549.923,
    "text": " and the flow it has internally, the way its internal states move, they entail a displacement of their belief.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 550.363,
    "end": 555.525,
    "text": "And this displacement happens to be near optimal given Bayes' constraints, blah, blah, blah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 556.827,
    "end": 571.455,
    "text": " And the real interesting stuff happens in the case of strange particles, which are particles where, as you can see, there is no direct effect from actions, active states, to internal states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 572.096,
    "end": 575.698,
    "text": "The only action you have is mediated by sensory and external states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 576.338,
    "end": 584.843,
    "text": "In this case, the active states themselves, so the policy of an agent, it becomes the subject of beliefs of the agent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 585.883,
    "end": 614.963,
    "text": " and if it becomes the subject of beliefs you can have statistical inference this is the crux of the framework and if you can have sql inference you can have like quite complex multi-level sql inference over your actions and those are basically what we call decision taking or what you call planning so um what we have here is a formal architecture that can derive the kind of complicated",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 615.623,
    "end": 615.657,
    "text": " Thank you."
  },
  {
    "start": 617.091,
    "end": 632.036,
    "text": " agency, semantic, not only agency, but agency that is embedded in a specific conceptual framework that is relative to the specific structure of an agent and their environment and the coupling in between.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 632.376,
    "end": 635.277,
    "text": "All that is a trace back basically to dynamics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 635.797,
    "end": 638.878,
    "text": "So we have a proof of existence that involves that everything is dynamics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 639.458,
    "end": 646.54,
    "text": "We can have agency, we can have complex decision making under the form of inference over one's own actions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 648.104,
    "end": 656.831,
    "text": " And then you have complications to apply it directly, of course, because the world is likely not in its barest form a limical system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 656.871,
    "end": 661.815,
    "text": "It does not have a list of states that are... Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 662.595,
    "end": 665.638,
    "text": "There is not a list of states that are possible, and that's it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 665.758,
    "end": 670.261,
    "text": "And there is one coupling that takes those states to themselves, and nothing can change ever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 670.322,
    "end": 671.963,
    "text": "This is not likely to be the case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 673.324,
    "end": 673.464,
    "text": "But",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 674.264,
    "end": 682.453,
    "text": " We have a minimal model of agency that is purely physicalist, that is purely based on the causal relationship in the most minimal way we can possibly represent it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 682.513,
    "end": 683.614,
    "text": "And this is quite huge.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 684.864,
    "end": 702.376,
    "text": " And this gives us a very, very strong prior over what we can, what is the stuff that agency is made of, and the stuff that agency is made of, at least higher order agency that we think about here in the social context, is belief over oneself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 703.177,
    "end": 705.878,
    "text": "And so to control actions is to control belief over oneself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 705.938,
    "end": 707.98,
    "text": "And this is this duality, this...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 711.132,
    "end": 717.895,
    "text": " like dual aspect of statistical organization as a complex cognitive agent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 718.615,
    "end": 735.663,
    "text": "That is, in my opinion, at the moment, given the capabilities of modeling and formalism we have, the core contribution of active inference to social sciences, written biology, psychology, neuroscience, like science of social stuff, because it gives you a",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 737.239,
    "end": 748.428,
    "text": " very strong prior over what agency is made of and the kind of stuff that can exist out there in the social world and the kind of dynamics that bring about its stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 750.509,
    "end": 761.778,
    "text": "So, but there is a quite big bridge to be made between the pure demical system formalism of active inference and the kind of open-ended evolution that happens out there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 762.198,
    "end": 764.239,
    "text": "And I do think there is...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 765.481,
    "end": 768.164,
    "text": " high level of precaution to be taken when we talk about this kind of stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 769.847,
    "end": 781.802,
    "text": "And yes, does anyone want to react or agree or disagree violently because I just attacked the common creeds",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 787.145,
    "end": 789.046,
    "text": " I'm not sure I perceived an attack, perhaps.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 790.207,
    "end": 794.77,
    "text": "From what I understood of what you said, basically, you have information geometry.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 795.491,
    "end": 799.533,
    "text": "It formalizes a relief space in a sort of geometric manifold.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 802.115,
    "end": 805.317,
    "text": "The points represent possible belief systems that an agent can have.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 806.658,
    "end": 812.522,
    "text": "And the distance between the points in the space can be interpreted as a measure of how different two belief systems are.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 813.123,
    "end": 816.265,
    "text": "And this is necessarily tugged",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 816.745,
    "end": 830.817,
    "text": " by the priors given by the environment which also push the agent to act in a certain way given the type of thing that it is in order to maintain itself given the actions that it knows it has available.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 833.206,
    "end": 844.29,
    "text": " And this becomes normative because of the strength of the attractors within the belief space, which become the geometric landscape basically.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 845.791,
    "end": 854.334,
    "text": "So we can sort of model the attraction through the curvature of the space around the attractor.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 855.074,
    "end": 866.859,
    "text": " And so a high curvature means a strong normative force, which pulls the agent to adopt a certain, I like to say social scripts because that's what I've worked on, but you know, any sort of policy and or phenomenology norm.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 867.74,
    "end": 869.841,
    "text": "And so in this context,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 870.581,
    "end": 887.388,
    "text": " the agents agency is kind of complicated because it's both um the ability to sort of navigate the landscape to move closer or further away from the attractors uh and so the degree to which an agent has agency is a degree to which it doesn't go necessarily um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 888.889,
    "end": 900.811,
    "text": " directly towards the attractor, but has some degree of reflexivity over its own action space in order to navigate the different kinds of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 903.043,
    "end": 904.704,
    "text": " factors that may be available to it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 905.804,
    "end": 920.03,
    "text": "So we could see that the momentum would be affected by personal experiences, education, innate tendencies, or even the tendency to resist or yield to social pressures.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 920.33,
    "end": 924.032,
    "text": "I could go on, but I know that A, you have your hand up, so why don't you go?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 927.509,
    "end": 932.853,
    "text": " Okay, I guess Avel could answer before I talk a bit.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 933.233,
    "end": 939.998,
    "text": "So I was just trying to have my hand raised before talking.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 940.119,
    "end": 943.361,
    "text": "So if Avel wants to answer you and afterwards I can talk.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 945.683,
    "end": 945.903,
    "text": "I'm okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 945.923,
    "end": 948.425,
    "text": "I don't have anything specific to answer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 948.445,
    "end": 949.766,
    "text": "Okay, okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 951.281,
    "end": 980.343,
    "text": " uh so you talked about the dual aspect of statistical organization of complex agents and you said that it was a core contribution of active influence to social sciences can you dig a bit on that and yeah just articulate it a bit more so we could grasp it better and then i could ask questions",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 981.909,
    "end": 983.49,
    "text": " So do I still share my screen?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 983.51,
    "end": 983.57,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 985.192,
    "end": 998.222,
    "text": "So basically what we have in here is a formalism that builds from very basic dynamics in the, like, just web space, and there is stuff that depends on space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 999.223,
    "end": 1003.046,
    "text": "Zero-level physical representation of literally anything can go there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1004.127,
    "end": 1009.512,
    "text": "And from there, we build a model of first self-organization",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1011.155,
    "end": 1011.695,
    "text": " Not quite that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1012.296,
    "end": 1020.14,
    "text": "Agentive self-organization, let us say, something that can build a specific stable ecology and maintain itself in this ecology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1020.18,
    "end": 1021.461,
    "text": "That is what we have here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1022.361,
    "end": 1037.309,
    "text": "And then, given the lack of coupling between active and total states, we can build something more complex stuff that can implement higher-order beliefs about themselves and what they do and like.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1038.529,
    "end": 1057.461,
    "text": " do decision-making that is conditioned on information they have of themselves and like politicization under the form of beliefs over their own action and as such this is like this is just math this says nothing about the world in and of itself",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1058.177,
    "end": 1060.359,
    "text": " until we claim it corresponds to things in the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1060.759,
    "end": 1077.39,
    "text": "And we can claim that this is a basic conceptual model that maps well into enculturation, basically socialization, engagement with the social-cultural world, because then we can account of the human ability for very, very, very...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1079.386,
    "end": 1090.19,
    "text": " why it's open-ended learning as something that comes from there, as something that allows us to infer things about ourselves and then develop complex policies and make them blah, blah, blah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1090.91,
    "end": 1097.172,
    "text": "And because, to my knowledge, there is no competing model that accounts for anything near that, like the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1099.742,
    "end": 1125.549,
    "text": " the only competition like the competition i should not talk of competition but the um the of models of um cognitive organization and culturation that exists that are trying to run themselves in physics like an chemical system they are just talking about dynamics they are specifically avoiding talking about anything like content or semantics so the fact of this piece of math as a monopoly on building semantics from the ground",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1126.718,
    "end": 1131.306,
    "text": " And what it tells you is that agency and identity and relativity, it's all the same phenomenon.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1131.366,
    "end": 1135.833,
    "text": "It's conditioned by self-belief, basically, that is constructed in this specific way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1136.793,
    "end": 1164.82,
    "text": " and we can how to say because this is the only way that we can account for higher order agency then we have which at least i would argue we have we should have a strong priors for theories of agency either mechanical or conceptual that vibe well with that picture so this is the claim i'm making i guess i went into too much detail so i hope this is enough",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1166.837,
    "end": 1173.201,
    "text": " Okay, so I have some, maybe not questions, but some points to make now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1174.142,
    "end": 1174.442,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1176.303,
    "end": 1191.872,
    "text": "So from what I see here, we could put the active inference paradigm into the individualistic, methodological individualism framework in sociology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1192.093,
    "end": 1195.695,
    "text": "So the idea is that you try to model an individual and then",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1196.835,
    "end": 1202.158,
    "text": " when you have the good way to model the individual, you can generalize to what everyone is doing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1202.838,
    "end": 1204.559,
    "text": "So, for instance, if I'm",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1206.693,
    "end": 1228.456,
    "text": " working on something in a certain way then i could generalize about that and say okay sociologically i have this constraint to work on this stuff and then not like everyone is doing that but it could go like that but what is interesting here",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1229.456,
    "end": 1245.289,
    "text": " is that it's not only about one individual but also that uh for instance let's let's take the external state you could say that external states here or other agents and also that um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1247.388,
    "end": 1250.811,
    "text": " Okay, so you have the active state and the internal state.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1250.971,
    "end": 1256.335,
    "text": "So we could say that your internal states are totally influenced by another agent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1256.495,
    "end": 1261.259,
    "text": "So we could do something like that with two individuals, I guess.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1262.279,
    "end": 1273.608,
    "text": "So one is one of the agents here and the other drives the internal states of the model because they are really influential on yourself.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1275.071,
    "end": 1298.03,
    "text": " but so there are some limitations on about this kind of way of thinking because in general um in sociology or in sociological sciences what you would like to say is that there are some agents at a higher level than only individuals such as you and i so",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1299.033,
    "end": 1309.321,
    "text": " The trick could be to say that some states, for instance, or some firms are agents for and by themselves.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1309.901,
    "end": 1317.947,
    "text": "So you have agents which are not individuals or persons.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1318.688,
    "end": 1322.571,
    "text": "I don't understand what you tried to say.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1323.812,
    "end": 1327.595,
    "text": "I was just trying to react to your slide.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1331.192,
    "end": 1336.576,
    "text": " Because I don't see how it connects with my own work here yet.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1336.856,
    "end": 1337.816,
    "text": "Oh, I'm talking to Mauro.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1337.936,
    "end": 1339.137,
    "text": "Okay, nice.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1341.719,
    "end": 1352.686,
    "text": "So yeah, if now you have something to say about what I just said about how we could have, let's say, two active agents trying to talk together or",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1355.945,
    "end": 1364.151,
    "text": " Yeah, so we have such simulations that already exist over various kinds of scales.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1364.191,
    "end": 1373.637,
    "text": "We have two agents coordinating that are animals like birds singing and over time coordinating over the song they're going to sing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1374.338,
    "end": 1377.22,
    "text": "We have several models of leader-follower.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1377.74,
    "end": 1389.106,
    "text": " where you have two agents starting from relatively the same point, but one agent developing more confidence and therefore developing a dynamic of leader-follower with the other agent.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1389.146,
    "end": 1403.014,
    "text": "This is work that's possibly going to be followed by Francesco Balzan, who is working on models of education and how maybe the teacher and student dynamic may be cast under these terms.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1403.794,
    "end": 1411.438,
    "text": " I've done work with Axel Constant and Maxwell Ramstad in terms of active inference in social scripts.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1411.518,
    "end": 1413.399,
    "text": "That's what Ava was mentioning.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1413.78,
    "end": 1426.306,
    "text": "And this notion that through the cues of the environment, your own model is shaped both by the environment, which includes other people, and the way in which you self-evidence within this environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1426.366,
    "end": 1427.167,
    "text": "So for instance,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1429.301,
    "end": 1431.682,
    "text": " There's two ways we can understand your question first.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1431.742,
    "end": 1442.965,
    "text": "We can say that minimizing free energy is basically an agent that has a form of autonomy and it's constantly updating its model to align with the environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1442.985,
    "end": 1452.448,
    "text": "So by virtue of doing this, it's not fundamentally individual, but each agent has its own model of the world.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1452.528,
    "end": 1457.21,
    "text": "Each agent reflects a perspective, a very unique perspective.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1457.39,
    "end": 1464.035,
    "text": " moment in space-time that will incur some errors relative to others.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1464.315,
    "end": 1476.665,
    "text": "So it's not that they necessarily interpreted things wrong, although they might have, but because their perspective is slightly off from somebody else, there's necessarily a degree of incommunicability in this sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1477.425,
    "end": 1504.738,
    "text": " um so here self-evidencing really entails that uh um identity you create a sort of identity here through the fact that you uh you may have different preferred states from somebody else based on your values belief your social conditioning but again these beliefs and values and social conditioning have been shaped and and um again what we're talking about these trouble of attractors by other people um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1505.718,
    "end": 1522.964,
    "text": " And so we try more and more to challenge this notion of individualism by emphasizing the relational aspect of identity, which means that identity is not pre-established, but continuously formed through the interaction with other agents,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1523.864,
    "end": 1543.29,
    "text": " And again, if we go back to information geometry, the geometry of the information space influences how agents perceive their paths towards minimizing free energy and affect their choices, which again give you the possibility to understand how agents might be very strongly pushed by other agents.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1543.79,
    "end": 1548.872,
    "text": "Let's imagine an agent that has more power than you and is trying to influence you to do something.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1549.212,
    "end": 1560.843,
    "text": " someone that has very high charisma, or someone who has the power to, say, destroy your life, you are more likely to shape your beliefs to align with them.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1561.403,
    "end": 1565.768,
    "text": "And therefore, we can understand individualism under a very, very different light here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1566.989,
    "end": 1568.19,
    "text": "Aval, did you want to add something?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1569.931,
    "end": 1573.575,
    "text": "Colleen is waiting to speak since a moment, so let's hear Colleen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1578.755,
    "end": 1580.517,
    "text": " Hi.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1581.017,
    "end": 1583.299,
    "text": "Can you hear OK?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1583.479,
    "end": 1590.105,
    "text": "I just wanted to pick on a couple of the things that Maha was talking about just now and in her talk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1590.885,
    "end": 1598.072,
    "text": "It seems that you seem to be saying that for social conditioning and the way in which we are socialised,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1599.132,
    "end": 1607.9,
    "text": " the importance of social scripts appears to be greater than the influence of individual upon individual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1608.36,
    "end": 1614.725,
    "text": "And that's interesting because it's not something that we would tend to think as individuals that we are integrating with scripts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1615.626,
    "end": 1627.554,
    "text": " In fact, the whole idea of seeing a script as something which is social was something that I find that probably most people would find a rather strange idea off the top of our heads.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1628.195,
    "end": 1633.118,
    "text": "So yeah, is that a fair assessment of what you're trying to say?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1633.338,
    "end": 1636.9,
    "text": "And the other thing I wanted to ask about was a few times in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1638.061,
    "end": 1647.547,
    "text": " in talks recently and here today, I've heard people talking about identity and the active inference view of identity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1648.008,
    "end": 1657.394,
    "text": "I'm not sure that I really understand what identity means within an active inference framework as distinct from just our internal model of who we are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1658.114,
    "end": 1661.837,
    "text": "Is there an other idea that we're thinking of here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1665.639,
    "end": 1671.684,
    "text": " And more particularly, the word identity has a lot of baggage and usage in current contemporary society.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1672.444,
    "end": 1673.845,
    "text": "Are we using it in a different way?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1674.486,
    "end": 1677.028,
    "text": "And if so, how is it different?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1677.588,
    "end": 1685.614,
    "text": "And potentially, how does that give us insight and the ability to engage with the ongoing discussions in society in a potentially fruitful way?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1690.959,
    "end": 1703.829,
    "text": " So I think I lost you for the last part of your question, which seemed to be about the difference between our conception of identity and the conception generally used, if that's correct.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1709.954,
    "end": 1710.835,
    "text": "You're muted, Colleen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1714.977,
    "end": 1720.142,
    "text": " So, yeah, I was referring to the concept of identity as used in society.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1723.368,
    "end": 1723.628,
    "text": " Right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1723.708,
    "end": 1735.694,
    "text": "So, I mean, I'm not going to speak to every use of the term identity because it's a very, very useful term that's used in law, that's used in physics, it's used in sociology and psychology.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1735.734,
    "end": 1736.515,
    "text": "So it's used a lot.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1737.975,
    "end": 1742.618,
    "text": "All I can do is explain roughly how we consider identity formation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1742.678,
    "end": 1748.041,
    "text": "And then if you have a specific definition in mind for a specific field, we can maybe tackle that one.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1748.061,
    "end": 1749.942,
    "text": "Does that sound okay?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1750.342,
    "end": 1750.482,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1752.616,
    "end": 1757.599,
    "text": " To be clear, I was thinking specifically about identity as determined by group membership in sociology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1757.619,
    "end": 1764.524,
    "text": "Okay, so I'm going to tackle social scripts first.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1765.103,
    "end": 1767.885,
    "text": " Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1768.506,
    "end": 1773.23,
    "text": "I'm going to tackle social scripts first, and then I'm going to come back to identity because I think it fits.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1773.25,
    "end": 1774.271,
    "text": "I've worked on that as well.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1774.651,
    "end": 1777.974,
    "text": "I know that Daniel and I will have some work that relates to this as well.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1778.014,
    "end": 1786.561,
    "text": "But so your first question was on the importance of social scripts and what it means for cognition, if I understood correctly.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1787.362,
    "end": 1789.063,
    "text": "So from an internalist perspective,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1792.166,
    "end": 1794.688,
    "text": " Social scripts are cognitive structures.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1795.209,
    "end": 1796.99,
    "text": "They guide behaviors.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1797.331,
    "end": 1800.333,
    "text": "They're acting like brackets.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1800.373,
    "end": 1802.215,
    "text": "We use the word constraints a lot.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1802.775,
    "end": 1804.397,
    "text": "It's not a perfect...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1806.278,
    "end": 1810.28,
    "text": " It's not a perfect guide because no semantic marker is a perfect guide.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1810.62,
    "end": 1813.241,
    "text": "Everything is up for some degree of interpretation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1813.641,
    "end": 1824.065,
    "text": "It's just that there are some interpretations that are so strongly linked to some degree of embodiment that they sort of anchor the rest of our semantics.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1824.445,
    "end": 1826.366,
    "text": "So for instance, I can't stop breathing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1826.586,
    "end": 1828.467,
    "text": "If I wanted to, I can't.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1828.547,
    "end": 1830.988,
    "text": "I will stop, but eventually my body will restart on its own.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1832.008,
    "end": 1849.501,
    "text": " And so there's such kinds of natural laws here that create these bottom layer guidelines that can then be sort of derived to infer other things and social scripts are just representational",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1852.859,
    "end": 1858.064,
    "text": " social extensions of these constraints given a historical context.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1858.705,
    "end": 1871.6,
    "text": "So they model and... Did Mal drop or did I drop?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1874.162,
    "end": 1892.171,
    "text": " i guess it's they're given to you like okay somebody will actually tell you what to do and show it to you um and sometimes they won't be sometimes they're just things you observe sometimes there's things you infer because you made a connection between a weak script and another weak script so if you see something that resembles a chair",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1892.671,
    "end": 1896.053,
    "text": " in a room, you infer that you have the affordance to sit on it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1896.133,
    "end": 1897.534,
    "text": "So that's a form of script.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1897.754,
    "end": 1900.715,
    "text": "And then you see other people doing the same and the script sort of cements.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1901.176,
    "end": 1918.185,
    "text": "And so now you associate this to another part of a sequence and this becomes something that allows you to temporalize and basically leverage your B matrix in order to exist in the world in a way that doesn't cause friction with other people.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1919.005,
    "end": 1920.646,
    "text": " This also gives you action triggers.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1920.986,
    "end": 1925.409,
    "text": "There are things you see in the world that now tell you this is the thing you should do now.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1925.709,
    "end": 1931.993,
    "text": "So there's this sort of recursive loop that's very inactive, that pulls you in a direction.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1932.053,
    "end": 1935.436,
    "text": "So the attractor isn't just a state, it's a path.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1935.796,
    "end": 1937.297,
    "text": "You're going to go down a path.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1938.838,
    "end": 1940.979,
    "text": "So for now, does that answer the first question?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1943.621,
    "end": 1944.021,
    "text": "Yes, thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1944.041,
    "end": 1944.561,
    "text": "That's helpful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1946.223,
    "end": 1946.363,
    "text": "Okay.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1946.383,
    "end": 1947.323,
    "text": "Go ahead.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1949.707,
    "end": 1950.107,
    "text": " Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1950.768,
    "end": 1965.154,
    "text": "To get back on the, like you talked about an active loop, and I think that's a critical thing to underline, which is that the engagement with the world is a cyclic process, it's a circular process, it constructs its own conditions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1967.575,
    "end": 1970.997,
    "text": "And so there is no measure of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1971.837,
    "end": 1981.084,
    "text": " power of structure versus power of agents, because the structure is embedded in the agents, and the agents are embedded in the structure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1981.865,
    "end": 1988.87,
    "text": "So I'd like to share my screen again to give some detail over what this entails.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1989.61,
    "end": 1990.451,
    "text": "Do I, can I?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1991.352,
    "end": 1992.272,
    "text": "Yes, good window.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1992.773,
    "end": 1999.518,
    "text": "You should see a PDF with a tiny man, a person, a mountain, and loops.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2001.356,
    "end": 2002.978,
    "text": " Is it okay?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2004.879,
    "end": 2006.12,
    "text": "Yes, I see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2006.16,
    "end": 2006.34,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2007.321,
    "end": 2019.211,
    "text": "So this is a presentation I did recently about the Unification Church, which is like, when you want to be published, you say new religious movement, but you can say cult, it works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2020.448,
    "end": 2025.729,
    "text": " which originated, I think, in Japan and is now spread between Korea, Japan and the United States mostly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2025.969,
    "end": 2030.95,
    "text": "We don't have numbers, but it seems to be the places where it's most implanted.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2032.05,
    "end": 2047.193,
    "text": "And it was very, very, very remarked because of the personality cult around the Reverend Moon, the founder, and the very overt, extractive practices of the cult, like asking you for the equivalent of 10 years of salary at the time",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2050.294,
    "end": 2072.875,
    "text": " and to take your ancestors from hell and put them in paradise by giving money to reverend moon specifically and they had um they were the topic of a very um i'd say aggressive and excessive anti-cults movement in the 70s 80s and now they are becoming a bit noticed again by vice uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2074.23,
    "end": 2095.949,
    "text": " not only vice but notably vice because you have very strange strange things like mass maga weddings with people waving rifle and that is a very very strange organization and at the time you had a very um moral panic we say now around the cult",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2096.969,
    "end": 2118.986,
    "text": " You had basically a model of influence that was that evil people would brainwash you, and then you were commanded by the cult and or Soviet secret agents from afar, and they could say to you, a horse and its triggered, a homicidal mania in which you blah blah blah, so things that are unnaturalistic, I will say.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2119.978,
    "end": 2127.565,
    "text": " And notably in reaction to the moral panic, you had a movement by sociologists of religion that would try to understand how exactly the cult worked.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2128.626,
    "end": 2132.509,
    "text": "And the most famous sociologist to do that was Aileen Barker.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2132.629,
    "end": 2139.194,
    "text": "If I remember well, she warned the Moonies she was coming, so you can question her methodology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2140.429,
    "end": 2148.312,
    "text": " But she seems to have done the most thorough and well-received analysis of them, so it's quite an important thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2148.692,
    "end": 2151.793,
    "text": "And she questions that there is such a thing as brainwashing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2152.273,
    "end": 2159.315,
    "text": "There is a construction of a specific social context that you have to comply to if you want to come, but they can force you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2159.335,
    "end": 2167.397,
    "text": "They do not have the capability to torture you and make you into an earthy, radiocommanding thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2167.517,
    "end": 2168.518,
    "text": "That does not work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2169.677,
    "end": 2180.741,
    "text": " And so I forgot the name of the... So David Frank Taylor explains the influence of the church in terms of choreography of total participation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2180.921,
    "end": 2191.084,
    "text": "So basically you have a very huge, very emotionally investing ritual that you just have to take part in to be a member of the community.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2191.924,
    "end": 2195.786,
    "text": "And if you are a member of the community, you will be helped, you will be loved, you will be supported,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2197.267,
    "end": 2203.629,
    "text": " constantly encouraged in a slightly coercive way to invest more of your time and money in whatever organization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2204.589,
    "end": 2217.393,
    "text": "And if you don't, then all this sport just leaves because you know, you're a traitor, you have, you have done treason of the true parents.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2218.723,
    "end": 2227.405,
    "text": " who was kindly out of his own arse trying to save you like Jesus did, but better because Jesus failed by not having children.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2228.346,
    "end": 2232.267,
    "text": "That is a very dramatic thing to say and that is what they said.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2232.467,
    "end": 2239.009,
    "text": "Because of the way the organization is set up, you cannot possibly question that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2239.449,
    "end": 2241.409,
    "text": "Your questioning is not accepted.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2242.229,
    "end": 2245.67,
    "text": "There is no private time in which you can privately question yourself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2245.73,
    "end": 2247.991,
    "text": "You are always engaged with people who are",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2248.726,
    "end": 2274.288,
    "text": " either uh formally or informally depending on your seniority watching you and so you have basically a context that makes it very very very easy to align with the uh cult values and it just happens as those values they uh they entail self-sacrifice for the organization but also for new members and uh total deference to the cult and its leadership and anything they tell you to do so you",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2275.924,
    "end": 2282.092,
    "text": " It's not kidnapping, but it's also not exactly free consent to a specific context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2282.953,
    "end": 2292.966,
    "text": "And from a purely, I don't know what to say, mechanical perspective, they can make you agree when you are there, but they cannot make you go there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2293.74,
    "end": 2303.328,
    "text": " So a question is how precisely they can elicit compliance away from the direct context of the choreography of the participation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2304.008,
    "end": 2311.635,
    "text": "And there is a simple answer in my sense, which is that we have a coherent sense of identity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2311.695,
    "end": 2313.716,
    "text": "We can't wholly think of ourselves",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2314.537,
    "end": 2321.919,
    "text": " as a good money one minute and then step out of the meeting and not think of ourselves as a good money.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2322.099,
    "end": 2323.52,
    "text": "That doesn't make sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2323.54,
    "end": 2324.86,
    "text": "Either we are or we are not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2324.96,
    "end": 2334.803,
    "text": "At least most people tend to have one integrated sense of themselves as someone who is embedded in a specific social context and has specific norms and behaves in such a way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2336.573,
    "end": 2351.241,
    "text": " And so the coherence of self-identity, it provides a key coupling between your public and your private beliefs, what you are expected to do in social context and what you will effectively do and perceive the world as privately.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2352.161,
    "end": 2372.77,
    "text": " And this, I would say, in the example of the Moonies, but in other rhetorical examples, like the emergence of nationalism, it is a very straightforward confirmation that indeed coherence of self-identity, like the coherence between what you do and what you think of yourself as doing,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2373.75,
    "end": 2381.853,
    "text": " is a very important process in the structure of societies, generally speaking, at least contemporary societies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2382.433,
    "end": 2390.176,
    "text": "Maybe it was not the same before, and so I do not think the context in which it's mobilized, of course it changes, but the mechanism, I don't think it's new.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2391.496,
    "end": 2398.279,
    "text": "And I'd like to get back on Alex's point, sorry, A's point, that the approach we have is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2400.399,
    "end": 2404.163,
    "text": " individualistic, I do not think it is the case, because if we are correct,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2405.429,
    "end": 2413.591,
    "text": " There is a landscape of sociocultural affordances, constraints, things, world out there, and we engage with it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2413.711,
    "end": 2420.412,
    "text": "And there are mechanisms that make this landscape not necessarily identical, but very coherent between individuals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2421.253,
    "end": 2431.755,
    "text": "And those mechanisms are language and the material symbolism developed in ritual, which is also symbolism, also meaningful, but maybe less than language, I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2433.296,
    "end": 2456.217,
    "text": " I just mean that the mechanism is the same and the inter-culturally robust practice of role-taking and shared essentialities are trying to do stuff together given a specific model of the attribution of tasks within the shared goal and so these are human invariants and all",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2457.435,
    "end": 2463.646,
    "text": " would be a pretty good candidate to force the integration of a common model of material and cultural niche.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2464.708,
    "end": 2465.088,
    "text": "And so,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2466.641,
    "end": 2491.393,
    "text": " I think that there is a pretty coherent social material niche and I think that we all engage with it and we all modify it and we maybe do not perceive it as the same but there is still a strong enough constraints on the coherence of this landscape between individuals for it to make sense as a specific entity and then the proper respiratory scale of what we do is not",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2492.193,
    "end": 2497.635,
    "text": " the individual minds, it is landscape that we happen to experience because of our individual minds.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2498.435,
    "end": 2511.679,
    "text": "So by the Plato Academia of Stanford on holism, basically holism is a theory where you agree that there are explanations that are not mediated by individual states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2512.299,
    "end": 2516.161,
    "text": "And I say there are explanations that are not mediated by individual states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2516.841,
    "end": 2519.962,
    "text": "And not only that, but I can point to organizations that control people",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2521.024,
    "end": 2526.608,
    "text": " while being absolutely not worried about individual states, only creating a certain context and then allowing them to engage with it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2527.769,
    "end": 2540.297,
    "text": "And that would be compelling, in my opinion, to say that the model we have is maybe not holist, maybe a secret third thing that is multi-scale, but certainly not individualist, at least in the sense that you are mobilizing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2540.317,
    "end": 2542.219,
    "text": "So thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2543.219,
    "end": 2545.0,
    "text": "I've talked more than I wanted.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2545.06,
    "end": 2548.603,
    "text": "So Mao, you were raising your hands.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2549.699,
    "end": 2551.42,
    "text": " I am, but I think Lorena wants to go.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2551.5,
    "end": 2552.621,
    "text": "I will go after Lorena.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2555.943,
    "end": 2557.103,
    "text": "Hey, guys.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2557.464,
    "end": 2567.029,
    "text": "Yeah, I think that goes directly into the idea that coming back a little bit to the point that identity that we were talking before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2567.71,
    "end": 2573.853,
    "text": "And if you think about the model that we have, we have the external states and different agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2573.873,
    "end": 2577.375,
    "text": "They are always actually very local and situated in the same",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2580.031,
    "end": 2582.913,
    "text": " in the same local constraint in the local environment, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2582.993,
    "end": 2591.759,
    "text": "So your external agent is going to be part, other agents are gonna be part of your external states and you are part of theirs, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2592.239,
    "end": 2607.75,
    "text": "So the idea of like laying down a path and creating a specific type of dynamic that react to the same type of input that you're receiving and driving these dynamics,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2609.008,
    "end": 2615.099,
    "text": " will generate this sort of embeddedness right because you do create you do have the same",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2616.916,
    "end": 2644.582,
    "text": " um or no it's not necessarily the same but they're very very close to each other they're very approximate right so the idea of a dynamic here if you think about uh describing that in terms of um a la place and like in terms of the dynamics you do have very different like um laurens butterflies for instance each one goes through the same type of route however they are not identical but they are very similar they are doing something very similar",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2645.462,
    "end": 2668.161,
    "text": " and that similarity sort of constrains again the construction of that environment so if you think about symbols and roles and types of environment that you find they're going to be as concrete as something else that you find in your environment constraining and pushing you towards the same direction or at least a very similar",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2669.282,
    "end": 2682.385,
    "text": " You can describe dynamically in a very similar type of geometry, if you like, or a very similar, or this attractor will drive the very similar type of path, will describe this similar type of path.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2683.446,
    "end": 2696.749,
    "text": "So which goes exactly to the, Avel, can you go back to that other, yeah, the other figure that you have, the one with the environment as well?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2699.031,
    "end": 2700.272,
    "text": " Made by, yeah, that one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2701.292,
    "end": 2718.381,
    "text": "So exactly that creates like a dynamic that they can be then forgotten, like in a way that will be described through a specific mark of blank that will develop agents together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2719.101,
    "end": 2726.424,
    "text": "We'll push them, constraining, they're going to be constrained together and they're going to have a constructive kind of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2729.705,
    "end": 2756.359,
    "text": " role in this embedded uh in this very embedded normativity but yeah you go ahead thanks um yeah so i think there's a nice way to tie all this as well to the internal nature that we seem to be um dispelling but we're not we like we have to talk about specifically in what ways internality is cast here and um i like to think of that the",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2757.339,
    "end": 2758.76,
    "text": " the effect of self-esteem here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2759.22,
    "end": 2777.733,
    "text": "Self-esteem to me is the degree of fitness relative to your perception of how well you're managing to exist within these constraints and interpret them in a way that gets other people to validate and minimize the friction you're getting from other people.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2777.753,
    "end": 2777.793,
    "text": "So",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2780.286,
    "end": 2785.029,
    "text": " It aligns with the concept of sociometer theory, it taps into this notion of cultness.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2786.611,
    "end": 2801.622,
    "text": "So if you consider that there's affective states that enable an individual to track and respond to discrepancies between self-perception and social expectation through these affective states such as anxiety or positive affect,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2802.802,
    "end": 2812.249,
    "text": " We can see that there's a dynamic nature and self-organization of self-esteem, which is continually shaped and reshaped by experiences and interactions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2813.871,
    "end": 2830.503,
    "text": "And so under active inference, we can formalize this by saying that a model that is more precise effectively captures the hierarchical structure of the moment-to-moment variation of more stable traits, such as what we consider to be self-esteem.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2832.427,
    "end": 2846.436,
    "text": " And so basically, we can see that identity and group membership here are fundamentally related to the effective experience of being fit for the group membership.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2846.816,
    "end": 2854.581,
    "text": "And so once you're there, you can grow in social cohesion, and this will lead you to potentially try to maintain",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2855.141,
    "end": 2855.622,
    "text": " the group.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2855.742,
    "end": 2874.88,
    "text": "It will lead you to try to justify the beliefs of the group such that you have a form of confirmation bias, but also you maintain the epistemic reality of this group, the symbolic reality of this group, which would be more costly to destroy than to actually support.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2874.96,
    "end": 2875.56,
    "text": "It's also",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2876.381,
    "end": 2886.448,
    "text": " integrated into your self-esteem, therefore destroying the group would mean admitting that you are potentially not fit for the environment, that you are potentially some degree of wrong.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2888.069,
    "end": 2894.653,
    "text": "And so this leads us to the possibility that if someone has low self-esteem, what do they do?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2895.194,
    "end": 2899.597,
    "text": "They can either stay in this group and accept that they are unfit for the group,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2900.726,
    "end": 2918.306,
    "text": " And they would try to remove themselves to some extent from the group to avoid all that friction, or they can try to join a different group, one which will support your beliefs about the world if your beliefs are too far from where the group you're supposed to belong to currently is.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2918.506,
    "end": 2920.088,
    "text": "And this is where we get to these problems.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2920.448,
    "end": 2929.476,
    "text": " sub-clusters forming these little subgroups that potentially can even become sometimes violent and sometimes really not.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2929.536,
    "end": 2931.918,
    "text": "Sometimes it's just, you know, some Tumblr group.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2931.978,
    "end": 2942.086,
    "text": "But it has power because it gives the individual this feeling, this valence of now being fit to a group that supports their model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2955.723,
    "end": 2981.76,
    "text": " so i wanted to give a space to talk yes thank you um so i would like to go back a bit uh on what i said about individualism so yeah i agree that uh i was wrong about associating uh active influence with individualism because",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2982.776,
    "end": 3001.825,
    "text": " What is interesting here is that there is an individuality through active inference which emerge from the collective and you can justify or describe individual actions or else through the landscape as you did.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3002.635,
    "end": 3028.948,
    "text": " just now and then go the other way around so we here we seem we seem to grasp the interaction between the individual and the group and vice versa uh which is what i found interesting here um and okay more moreover there is the what the individual adds to a group uh",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3030.422,
    "end": 3040.808,
    "text": " I see that here it seems to be captured as we take the individual as a unique perspective.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3041.288,
    "end": 3050.213,
    "text": "This is what you said before now, that each person is a perspective, a unique one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3053.355,
    "end": 3077.632,
    "text": " uh it's not all what i wanted to say also uh yeah lorena you talked about the the beliefs that exist and i think this this is one interesting thing also in active influence it's that we take belief as a material thing that influences us and that we can also influence or create in a way um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3078.757,
    "end": 3107.663,
    "text": " even yeah independently of if it's right wrong or whatever we judge it is like uh what we talked about with the moon sect uh and the the unification church yeah so there are people with crowns and we say that they are the big boss and we have to deal with it or to go away from the landscape and from the landscape and yeah it works like that in in the social world indifferently of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3108.564,
    "end": 3137.621,
    "text": " if the person is really the like the the chief of the cults or not because they said the worst and people were just following them so in the end it happened to create a landscape in which the in which one person is the uh the the person who has power so yeah i don't know what to say more about all of this i guess i agree with",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3138.277,
    "end": 3163.92,
    "text": " with what you said just before so yeah that's it so maybe we should move to like challenges and opportunities of active inference uh so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3167.222,
    "end": 3167.722,
    "text": " Two points.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3168.283,
    "end": 3171.944,
    "text": "I think, I just put them out there, you can react.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3173.885,
    "end": 3190.793,
    "text": "I think that one, active inference may give us computational models or even thorough-grounded conceptual models of social organisation, specifically the semantic dimension to social life.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3192.214,
    "end": 3211.479,
    "text": " And I also think that in its current formulation within the mycosystem theory, it is inapt to represent planned evolution because mycosystems entail the formulation of a set of states that do not change through time, and a chemical flow that does not either change through time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3212.639,
    "end": 3220.921,
    "text": "So there are opportunities to apply the model to the framework to grounded",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3222.308,
    "end": 3226.052,
    "text": " meaningful, semantically complete models of social evolution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3226.672,
    "end": 3237.082,
    "text": "But this model, if they are conformed to evolution, they will not really vibe well with the math that we invoke to say our computational model are meaningful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3237.342,
    "end": 3240.005,
    "text": "And that's like rise in the array of questions, I guess.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3241.226,
    "end": 3244.95,
    "text": "So does anyone want to react to these two statements?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3276.314,
    "end": 3277.355,
    "text": " Could I make a comment?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3280.918,
    "end": 3291.089,
    "text": "More specifically, I'm interested in the ways in which the ideas of active inference impact on the way we think about society and the way society works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3292.711,
    "end": 3295.374,
    "text": "I can see from my reading and from listening to the discussion",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3295.934,
    "end": 3304.057,
    "text": " that there's a very rich new lexicon and vocabulary set of concepts for the thinking within active inference thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3304.197,
    "end": 3307.798,
    "text": "And as we just commented, it's quite heavily mathematical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3307.898,
    "end": 3313.58,
    "text": "So the barrier to entry for the full active inference worldview is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3316.397,
    "end": 3324.804,
    "text": " Over time, these ideas will permeate out into the mainstream and they will change the way people think and talk about society.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3325.525,
    "end": 3343.0,
    "text": "I'm interested in the ways people who've studied a bit more than I have see potentially how this will change the way society works or the way that we have discussions or envisage society more widely than just an academic discussion, obviously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3354.58,
    "end": 3355.781,
    "text": " Maybe the question's a bit too big.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3357.902,
    "end": 3359.143,
    "text": "I mean, I think there were two questions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3359.183,
    "end": 3361.384,
    "text": "I think everyone is just waiting for the other to talk first.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3361.504,
    "end": 3362.965,
    "text": "Mao talked first, so.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3365.847,
    "end": 3383.118,
    "text": "So I think I want to tackle a little bit what you said about the open-ended nature, the open-ended evolution of state spaces, basically.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3385.425,
    "end": 3392.869,
    "text": " I think under the path formulation, this open-endedness is actually just a perceived open-endedness.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3393.709,
    "end": 3402.014,
    "text": "It's just a function of the timescale being considered and the motion along that timescale.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3405.354,
    "end": 3408.977,
    "text": " I think we can go a little bit more into depth about this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3411.278,
    "end": 3412.899,
    "text": "I think it's a very large topic.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3413.74,
    "end": 3420.564,
    "text": "Effectively, if we go into quantum formulations, there's some degree of irreducibility.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3420.604,
    "end": 3423.426,
    "text": "And anything above that is historically contingent.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3423.526,
    "end": 3430.11,
    "text": "So obviously, some marker blankets will dissolve and reform and dissolve and reform.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3430.13,
    "end": 3431.932,
    "text": "And through this dissolution and reformation,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3432.832,
    "end": 3437.375,
    "text": " you get a new potential for mapping of observation to states.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3437.635,
    "end": 3439.416,
    "text": "So there's always that possibility.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3441.577,
    "end": 3454.025,
    "text": "But I think some challenges for active inference that are coming is, for instance, the complexity of social behavior.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3456.366,
    "end": 3456.766,
    "text": "You know, we...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3458.342,
    "end": 3463.023,
    "text": " We can extend active inference to capture the nuances of social interactions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3464.143,
    "end": 3468.425,
    "text": "But effectively, active inference is about abduction.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3468.505,
    "end": 3470.865,
    "text": "So it's the best guess for now.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3472.566,
    "end": 3483.348,
    "text": "And it requires for us to put into the models what we think are useful variables, what we think are the right variables.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3484.108,
    "end": 3485.169,
    "text": "And it's possible.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3486.409,
    "end": 3513.727,
    "text": " that we're always going to fall just a little bit short like we're always we can either throw a bunch of data at a problem and be like well okay well just just remove the noise only pick up the signal and figure out what's happening but that's no better than than big data and deep learning so um we have to figure out a way to move forward and understand the the variables of interest and do this",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3514.708,
    "end": 3538.909,
    "text": " across scales so identify the priors that take over at a given moment but they won't take over even if they're higher in the hierarchy at another moment because in this hierarchy you've actually switched states like you've moved and this is only predictable once you've understood the effect of those priors and you can't just consider that you have the priors to begin with",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3541.733,
    "end": 3549.598,
    "text": " So yeah, as far as integration with this existing theories, I think we have a nice opportunity ahead of us.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3549.678,
    "end": 3553.121,
    "text": "It's basically what you said, Colin.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3553.561,
    "end": 3571.313,
    "text": "I think we're going to be able to more and more through the alignment of certain kinds of language and the formalism under that language, we're going to be able to pull more and more theories and find what's at the core of the connection between these theories,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3571.833,
    "end": 3586.731,
    "text": " Active inference is supposed to be scale-free, so it describes or it is possible to help us describe the phenomena basically from sociology and literature to biology.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3587.648,
    "end": 3610.34,
    "text": " So if we understand this, we understand that there's a possible touch point, a convergence of all these fields that are tapping into the same ideas or into some connecting points that allow us to understand how we maybe do away with these different fields, remove the silos and come back together with something that feels more integrative.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3612.332,
    "end": 3615.074,
    "text": " But then again, we're back to the computational limits, obviously.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3615.114,
    "end": 3624.821,
    "text": "Like if I want to compute the prediction for an entire country, what is the granularity level at which I should compute the right variables?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3624.921,
    "end": 3632.207,
    "text": "And if we understand that individuals are formed by the group, et cetera, do I just do a mean field over the entire group?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3632.287,
    "end": 3636.85,
    "text": "In which case, am I losing out on some of the variables that may actually impact the outcomes?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3636.87,
    "end": 3641.674,
    "text": "I think these are the key questions that remain to be answered to some extent.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3647.702,
    "end": 3650.643,
    "text": " So I agree with what you said, Mao.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3653.245,
    "end": 3661.549,
    "text": "I agree that we can't represent things and somehow not cut anything relevant to the thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3661.569,
    "end": 3668.512,
    "text": "When we model or we represent, the point of it is to have a more compressed way to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3669.375,
    "end": 3691.485,
    "text": " engage with the thing with our other thing than the actual thing so we will just cut information that is the point of modeling or presenting and maybe in a very simple system such like um let's just say perfect gas model in physics there is information we can cut and lose nothing we can",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3692.505,
    "end": 3703.452,
    "text": " uh card information about which particle is where because the different particles of the same atom has at this scale the same properties so we don't really care where atom",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3704.124,
    "end": 3705.325,
    "text": " What item does what?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3705.886,
    "end": 3714.734,
    "text": "But in the case of human societies, we have patterns of engagement and the specific information that's accessed by a specific agent is important.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3715.574,
    "end": 3719.898,
    "text": "And whatever we choose to cut for a model, it will be relevant at some point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3720.839,
    "end": 3722.1,
    "text": "At least it will probably be if...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3723.157,
    "end": 3731.369,
    "text": " like the information we cut is not specific to a bunch of agent that will die of car accident or something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3732.691,
    "end": 3738.038,
    "text": "If any kind of information, any type of information we may want to abstract out will be relevant somewhere at some point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3738.539,
    "end": 3741.601,
    "text": " So, yeah, we are dealing with complex systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3741.641,
    "end": 3743.242,
    "text": "We are not going to model everything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3743.923,
    "end": 3767.819,
    "text": "But it is a huge deal that ActiveInference is capable to fill in the semantic content from dynamics, either from the dynamics of a component of a system, say neural dynamics and biological dynamics, or dynamics of a social context with the modeling of ActiveInference agent",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3768.659,
    "end": 3771.444,
    "text": " like things that navigate the world and make inference and stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3772.306,
    "end": 3779.479,
    "text": "And to my knowledge, we do not have any other theory that makes the bridge between just dynamics and semantics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3780.47,
    "end": 3803.9,
    "text": " and we have other neurological like cognitive neuroscience people who talk about dynamics a lot and how we can bring back the activity of cognitive systems to dynamics but usually it is it is in a way that insists that we should just look at the dynamics we don't really need to worry about the semantics or if we need to worry about the semantics they somehow",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3804.56,
    "end": 3806.568,
    "text": " like reduce to the dynamics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3806.969,
    "end": 3810.462,
    "text": "The dynamics is what exists and is important and what we should worry about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3811.958,
    "end": 3823.388,
    "text": " And so another framework that is relevant to geostudy evolution of norms or presentation or mental content in a social context, I cannot think of one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3824.289,
    "end": 3832.777,
    "text": "One that is thoroughly grounded in, at least that attempts to thoroughly ground itself in mathematics, mathematical physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3833.277,
    "end": 3834.559,
    "text": "Yeah, there is another one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3836.38,
    "end": 3837.841,
    "text": " And so that is a huge deal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3838.381,
    "end": 3852.947,
    "text": "But there is a very important problem, which is what I said and you said and we're grown, which is that the parallelness in the path integral formulation in earlier formulation in the FEP, it is illusory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3853.007,
    "end": 3855.768,
    "text": "It is about like it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3856.728,
    "end": 3863.771,
    "text": "So maybe to give a bit of context, the path integral formulation of the FEP is just when you do the FEP.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3863.791,
    "end": 3865.252,
    "text": "So the bit of math we",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3866.164,
    "end": 3880.399,
    "text": " make a huge deal about and we uh apply it not to uh like the dynamics of a particle per c like how it affects the particle at point t but how it affects pathways of a particle for",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3881.64,
    "end": 3886.903,
    "text": " For mathematical reasons, reframing a problem in path integral formulation is a huge deal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3887.484,
    "end": 3897.589,
    "text": "It is what makes the difference between a Newtonian, you push something and it moves, and full-fledged quantum gauge theories that underwrite all of contemporary physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3900.351,
    "end": 3908.674,
    "text": " Path integral formulation is a huge deal, but to write it, you still need to write an emetic space, to make the list of all things that are possible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3909.734,
    "end": 3919.438,
    "text": "And if you think that this is a correct model of the world, and a complete model of the world, and this is everything there is,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3920.256,
    "end": 3930.342,
    "text": " You have to agree either that calls do not exist or that there is a place in the Primaldo web function that existed before time did.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3930.863,
    "end": 3932.724,
    "text": "There is a place where callness lies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3934.75,
    "end": 3938.791,
    "text": " I think cause exists, and I do not think cause are basic properties of quantum mechanics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3939.411,
    "end": 3944.633,
    "text": "So cause must have happened along the way somehow, and to represent that means to represent open-endedness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3945.693,
    "end": 3948.454,
    "text": "And so we need open-endedness in math.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3948.734,
    "end": 3954.115,
    "text": "And the FEP is not open-ended, and structurally it's very hard to account for open-ended evolution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3955.32,
    "end": 3968.444,
    "text": " At a more prosaic level, when we look at engagement with social dynamics, with a social world, we look at loneliness because there is always an integration of norms, there is always a loss of information, but also that is constructive of new norms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3968.964,
    "end": 3973.966,
    "text": "There is no like writing happen at some point and then we did things differently, change the structure of societies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3974.488,
    "end": 3983.073,
    "text": " It's enabled administration to exist as a non-trivial, causally-powerful society that's actually mattered in its organization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3983.953,
    "end": 3986.034,
    "text": "And yeah, so new things happen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3986.435,
    "end": 3991.837,
    "text": "And if we want to look at social engagement, it is critical to look at how new things happen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3992.198,
    "end": 3994.459,
    "text": "And currently, the FEP doesn't do that at Active Inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3995.72,
    "end": 3996.661,
    "text": " I don't think it does that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3996.701,
    "end": 4002.567,
    "text": "Maybe it can at a computational level without grand formal pretension, maybe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4002.787,
    "end": 4004.189,
    "text": "But I did not see it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4004.589,
    "end": 4007.813,
    "text": "And that's a big challenge that we have ahead of us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4008.393,
    "end": 4010.856,
    "text": "And by we, I mean everyone, not just acting inference people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4010.956,
    "end": 4012.758,
    "text": "Everyone should tackle that at some point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4020.543,
    "end": 4022.063,
    "text": " Daniel, you were raising your hand.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4022.443,
    "end": 4025.784,
    "text": "I'll add just a few notes to Colin's question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4026.665,
    "end": 4035.247,
    "text": "Certainly it's something that we all ask ourselves and many viewers and participants in the ecosystem ask, like, so what then?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4035.927,
    "end": 4044.089,
    "text": "What does it really mean for active inference to be applied to or by or in the social sciences?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4044.129,
    "end": 4047.03,
    "text": "So I think that's a big open question, certainly one that's not",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4048.138,
    "end": 4051.059,
    "text": " only addressable by one perspective or even with words alone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4051.639,
    "end": 4062.021,
    "text": "But I think there's a few key pieces, especially that differentiate it from just the broader or adjacent project of quantitative social science or formal social science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4062.582,
    "end": 4066.843,
    "text": "The question we should seek after is what does active inference bring in?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4067.823,
    "end": 4076.145,
    "text": "And again, probably many ways to say it, but we know for an active inference agent, as a scale-free statement,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4077.947,
    "end": 4080.408,
    "text": " Free energy can be bounded by changing the world or changing the mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4080.708,
    "end": 4098.652,
    "text": "So having continuity of social systems with all other systems, spatial, temporal, arbitrary, material, and so on, gives a continuity and an interoperability that without a scale-free first principles approach is essentially not even on the radar.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4098.672,
    "end": 4100.152,
    "text": "So that's one massive piece.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4100.673,
    "end": 4105.174,
    "text": "And then I think where that begins to bear or modify fruit is...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4106.974,
    "end": 4119.837,
    "text": " essentially the scientific and professional development of cognitive engineering understanding that the cognitive constraints and scaffolds scripts all of these tasks implicitly",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4120.564,
    "end": 4143.478,
    "text": " then more recently explicitly and most recently quantitatively and formally are examples of cognitive engineering so whether it's a stop sign and what that comes to mean in different social locations or language as a complex phenomena these are examples of cognitive engineering in the same way that building a stack of rocks",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4144.278,
    "end": 4171.001,
    "text": " is both an example of material engineering and cognitive engineering through semiotics and now when the scientific process the professional process enters into this reflexive and relational posture through active inference that is kind of a saddle point into a different dynamic i believe lorena",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4180.088,
    "end": 4181.47,
    "text": " Lorena, unmute and then go for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4183.914,
    "end": 4187.119,
    "text": "Yeah, I'll just make one comment upon what you said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4187.72,
    "end": 4193.869,
    "text": "Keep in mind that active inference can understand beliefs and signs and these kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4196.344,
    "end": 4205.357,
    "text": " semiotics as material and concrete because constraints, they constrain the evolution of the system, like how the system complexifies, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4205.778,
    "end": 4211.365,
    "text": "And the constraints has this material effect on the dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4211.906,
    "end": 4234.413,
    "text": " right you cannot really um believe that of course belief is materialized as a table of course not but for the system in terms of constraining and understanding how things scale up and how they complexify they have that kind of role and that helps to understand a little bit what vel was bringing about how",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4235.113,
    "end": 4249.518,
    "text": " you can bring new values and parameters for the dynamics that are being described by the mathematics of external and internal free energy principle updating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4250.658,
    "end": 4259.041,
    "text": "And that is a way of tackling this novelty for this kind of thinking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4260.174,
    "end": 4284.487,
    "text": " over time but we don't have a proper account on how to how to predict what is going to constrain the the system next right yeah Mal go for it and then we'll all kind of give a closing round slash thoughts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4287.185,
    "end": 4296.207,
    "text": " Okay, well, there was a question in the chat at one point, so I just wanted to potentially address the question if that's okay.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4298.707,
    "end": 4311.07,
    "text": "So the question was, so would the generative process of modeling the social system enclose multiple agents on one markup blanket, or I assume inside or under one markup blanket?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4311.992,
    "end": 4316.721,
    "text": " So we like to think of active inference as nested in hierarchical.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4317.162,
    "end": 4320.107,
    "text": "That's one thing that Maxwell Ramstad definitely pioneered.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4321.995,
    "end": 4331.824,
    "text": " where each agent has its own mark of blankets, but there is a higher level mark of blanket that encloses the social system in play.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4332.645,
    "end": 4342.733,
    "text": "So individual agents can interact with each other and the environment, but the social system as a whole also interacts with the broader environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4343.074,
    "end": 4348.418,
    "text": "And this is where semantics and semiotics come into play in them.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4349.159,
    "end": 4357.504,
    "text": " the narratives around certain groups start shaping how they can interact with the other groups which have a perception of these narratives.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4357.544,
    "end": 4359.965,
    "text": "So there's in-group and out-group dynamics.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4361.226,
    "end": 4371.212,
    "text": "So it's a little bit akin to how cells within an organism have their own boundaries but are also part of a larger organism.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4373.003,
    "end": 4401.663,
    "text": " um so yeah i think that that does that answer the question from the person who asked that question i think it does nice so perhaps a and colin feel free to give in your marks and then we'll pass around the instructors it can be as long or as short as you like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4402.714,
    "end": 4404.595,
    "text": " Okay, may I go first?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4405.675,
    "end": 4429.466,
    "text": "So I would like to say that the key issue we are trying to grasp is that if active inference has social and political implications due to its scale-free structure and how we can apply it to the social world,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4430.183,
    "end": 4458.778,
    "text": " then there is the self-referential question that happens which is what is the the what is the the structure of active influence as a social construction itself and the political construction itself and what are our own um like our own what is our own political power and social power in this",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4459.79,
    "end": 4488.199,
    "text": " social and political world and this is the like the fact like thing that is going on like because afterwards what is my own social and political implication in this thing and the more you you get your own agency and the agency of active influence the more it becomes like a lot to to process and uh the more you you you grasp your own agentivity and um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4489.56,
    "end": 4494.824,
    "text": " and the power you have and the responsibility you have.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4496.326,
    "end": 4500.769,
    "text": "I guess this is one of the key points we're trying to get here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4504.312,
    "end": 4507.595,
    "text": "I guess that's the point I wanted to make.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4508.636,
    "end": 4510.237,
    "text": "And to finish with that,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4513.864,
    "end": 4520.226,
    "text": " the game we are trying to play is to try to find our own blind spots in this game.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4520.686,
    "end": 4523.327,
    "text": "Like, what is the limit of the model?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4523.707,
    "end": 4528.569,
    "text": "And does it have a self-referential limit or not?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4528.929,
    "end": 4529.629,
    "text": "So, yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4532.45,
    "end": 4532.67,
    "text": "That's it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4536.448,
    "end": 4539.689,
    "text": " Yeah, I would endorse that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4539.769,
    "end": 4542.489,
    "text": "And I feel the same way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4542.67,
    "end": 4550.712,
    "text": "I found that my reading of just in the last year or so of active inference ideas, I found it very empowering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4551.872,
    "end": 4559.634,
    "text": "The ideas of active inference in relation to the individual mind are quite well developed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4559.874,
    "end": 4564.095,
    "text": "And it's very empowering to be able to look at yourself",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4565.066,
    "end": 4570.91,
    "text": " through the active inference paradigm and understand the thought processes that is you, it's a very empowering thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4571.47,
    "end": 4591.704,
    "text": "And as I was saying, just recently starting to look at the idea that we can incorporate an active inference concept of the way the social world around us is structured, which is part of that paradigm too, I think is potentially more empowering, but it's early days yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4592.524,
    "end": 4594.225,
    "text": "But I look forward very much to,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4596.267,
    "end": 4606.374,
    "text": " a more developed world where people have discussions with each other, not just about what I'm thinking and how I think, but how I think about society and how we think about society together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4607.134,
    "end": 4610.176,
    "text": "And it's embedded within that paradigm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4610.557,
    "end": 4615.06,
    "text": "I feel that's potentially something which is very empowering and I look forward to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4615.76,
    "end": 4619.943,
    "text": "And I thank the speakers all for their contributions to this series of talks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4624.605,
    "end": 4648.119,
    "text": " thank you colin so with the exception of ben whose lecture and contribution kicked off this course and we're excellent also we have the others of the instructors here so how do each of you want to uh kind of conclude this chapter",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4654.673,
    "end": 4657.763,
    "text": " Yeah, Mal, then Lorena Rathel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4659.027,
    "end": 4659.69,
    "text": "Yes, I think...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4679.174,
    "end": 4701.31,
    "text": " of entities which have the capability of interacting to maximize the information they gather from the environment such that as a whole they can self-evidence to maintain the phenotypes they believe to be similar to their own and therefore themselves and how this leads to over time the sedimentation",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4701.99,
    "end": 4715.142,
    "text": " of norms and activities and eventually the reference to these norms and activities through the semantics and the scripts and effectively how this leads us to all the",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4717.138,
    "end": 4725.484,
    "text": " complexities of language and how we may now be at the point where we have a simulacra that represents nothing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4725.884,
    "end": 4735.13,
    "text": "It's just, we just have these shells of representations and these shells of semantics, which potentially have lost their anchoring in reality.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4735.531,
    "end": 4738.072,
    "text": "So I think that was the through line of the course.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4738.172,
    "end": 4746.398,
    "text": "I hope we made a good case for it and how active inference allows us to model this entire path, not only across scale, but across time as well.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4747.278,
    "end": 4749.399,
    "text": " So yeah, that's how I think I'm going to close.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4754.521,
    "end": 4755.701,
    "text": "Yeah, I think this is me now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4755.902,
    "end": 4771.848,
    "text": "Yeah, I really liked the story as well that we are building throughout the whole course, starting with a very general idea of what is Active Inference with Ben and then trying to build up this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4772.948,
    "end": 4779.29,
    "text": " collective notion, how we contain information in a certain way that it's always synchronized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4779.49,
    "end": 4786.111,
    "text": "So this is always sort of meaningful that can be described in certain ways by the mathematics of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4786.671,
    "end": 4797.514,
    "text": "And then understanding these questions, the hard questions that we're asking now, like how we can bring new variables, how we can bring novelty into the system, which is something that we don't have an answer yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4798.194,
    "end": 4811.72,
    "text": " But I find that it's really cool that we don't hold back in asking that, because I think that's the next step for ATEMP, understanding how complexification comes about, how can we describe that process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4812.64,
    "end": 4813.021,
    "text": "And yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4813.341,
    "end": 4816.562,
    "text": "And thanks, Abel and Daniel, for putting this together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4816.582,
    "end": 4817.242,
    "text": "It was pretty cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4818.003,
    "end": 4820.124,
    "text": "And I hope you guys also have enjoyed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4820.144,
    "end": 4824.205,
    "text": "Thank you, Lorena.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4825.306,
    "end": 4825.506,
    "text": "Afel?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4828.772,
    "end": 4830.433,
    "text": " So, thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4830.933,
    "end": 4833.194,
    "text": "You're welcome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4833.414,
    "end": 4841.839,
    "text": "I think I put his finger on something quite deep, as usual.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4842.714,
    "end": 4868.771,
    "text": " Which is that if we want to have a coherent theory of nature that is not based on just here are the things that can be, and we will draw dynamics from that, that is compatible with open-ended evolution, we need to address self-referentiality, we need to address recursion, and the possibility for recursive individuation of physical beings.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4869.904,
    "end": 4870.745,
    "text": " And that's tough.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4871.225,
    "end": 4879.153,
    "text": "And that's very tough, because the basis of representation is just, I list an array of things I want to represent, and I represent that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4879.994,
    "end": 4889.844,
    "text": "But if things can just happen that are new and that are, by definition, not in the field of possibilities that preexisted then, we are fucked.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4890.064,
    "end": 4891.565,
    "text": "There is no way we can represent that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4892.945,
    "end": 4908.941,
    "text": " and there is there is a family of approach in quantum information theory that tries to tackle that how to draw physics without being rolling in a specific state space",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4910.103,
    "end": 4927.16,
    "text": " and just i'd like to to to explain the history of that so the math it draws from algebraic topology so we study surfaces but not by selling surfaces by selling transformation within those surfaces but then we remove the surfaces and we keep only",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4927.642,
    "end": 4936.504,
    "text": " the transformation over what I don't know, but somehow we can, I guess, reconstruct coherent mathematical entity from that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4937.584,
    "end": 4942.645,
    "text": "And I'd like us to take a look at how this look, what the math look like.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4943.565,
    "end": 4946.405,
    "text": "So can you, can we see the screen?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4947.106,
    "end": 4947.546,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4948.106,
    "end": 4952.867,
    "text": "So this is the structure of the quantum information formulation of the FEP.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4953.807,
    "end": 4954.607,
    "text": "These are",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4956.07,
    "end": 4965.952,
    "text": " dimension of interaction between system A and system B. What defines the scope and the mode of this interaction, I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4966.912,
    "end": 4974.273,
    "text": "And this is a cone-cocoon diagram that represents an agent together with the representation that it develops.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4975.294,
    "end": 4982.595,
    "text": "And I could tell you the words that correspond to the thing within this diagram, but I do not know what they mean, so it would be a hard thing to do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4983.73,
    "end": 5011.501,
    "text": " And the math that is capable to tackle the self-versatility, like maybe, because I do not see any proof that it actually does, in fact, it's not tractable for humans, and I exclude mathematical physicists from humans there, because of the sheer abstractness of what is going on, and because of the lack of any abuse reference from anything we intuitively understand in this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5014.071,
    "end": 5040.219,
    "text": " the work that we have to do if we want this to move forward and to have a self-coherent theory of social evolution is to somehow untangle from that concrete meaning things that apply to the world and conversely use the way that we can think of it as concrete interaction in the world to further specify the mathematics and prove that it is actually self-coherent and applies to stuff and this is a big",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5041.419,
    "end": 5044.201,
    "text": " Big work, in fact.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5045.162,
    "end": 5047.103,
    "text": "And this is kind of exciting, I guess.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5051.846,
    "end": 5054.548,
    "text": "What I wanted to say is Active Inference is dead.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5054.748,
    "end": 5055.729,
    "text": "Long live Active Inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5055.749,
    "end": 5060.432,
    "text": "Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5062.683,
    "end": 5089.369,
    "text": " was a fun course and this closing section and slide kind of brought this unity between chris fields's quantum work and this social science which in the disciplinary paradigm are seen as distant or with different systems of interest and you can't get there from here but in a scale-free first principles paradigm",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5090.109,
    "end": 5092.195,
    "text": " It's not even just that we can hold them side by side.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5092.435,
    "end": 5093.318,
    "text": "It's that they are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5094.677,
    "end": 5122.837,
    "text": " more than juxtaposed so it's been awesome and its own great experience to work with all of the instructors who shared their amazing and youthful and energetic perspectives and we explored new format in a new way we're going to process the proceedings of the lectures and the discussions",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5124.417,
    "end": 5137.103,
    "text": " plus any final submitted question and answers through the syllabus website, bring that together into a open access publication of some kind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5137.783,
    "end": 5144.806,
    "text": "So for people who are interested in that kind of editorial or curatorial work, the Active Inference Journal is for them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5145.866,
    "end": 5153.17,
    "text": "And then in 2024 and beyond, let's see where Active Inference is, see where social sciences are,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5154.45,
    "end": 5174.894,
    "text": " and hopefully as people are interested in take it from there we threw a many fun ideas but i guess we'll leave it till then to find out all right thank you everybody bye",
    "speaker": "SPEAKER_02"
  }
]