[
  {
    "start": 0.089,
    "end": 3.415,
    "text": " to organization and today should be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5.322,
    "end": 12.885,
    "text": " a good one because we are here with Eugene, who's going to be talking to us about decentralization and smart contracts and all kinds of other things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 13.525,
    "end": 18.607,
    "text": "We also have this interactive whiteboard slash slide deck here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 18.967,
    "end": 21.888,
    "text": "So please write any comments in the chat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 22.608,
    "end": 29.01,
    "text": "And as soon as Eugene is back, I'm sure he'll begin his initial presentation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 29.39,
    "end": 30.511,
    "text": "But welcome, everybody.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 30.911,
    "end": 34.232,
    "text": "Looking forward to seeing your comments in the chat and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 35.39,
    "end": 35.931,
    "text": " Welcome back.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 36.912,
    "end": 37.613,
    "text": "Your re-entry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 38.594,
    "end": 43.239,
    "text": "Please provide a introduction and some context and really looking forward to this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 43.94,
    "end": 47.384,
    "text": "Of course, I got so excited to begin with that I closed out the wrong tab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 47.424,
    "end": 49.206,
    "text": "So that's always a good beginning, but.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 49.554,
    "end": 51.135,
    "text": " Thank you for hosting me, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 51.195,
    "end": 59.2,
    "text": "Excited to be here with the Act-Inf Lab and to get to talk a little bit about decentralization and yeah, kind of see where the conversation goes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 59.28,
    "end": 62.762,
    "text": "So definitely really excited to hear what folks are thinking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 63.062,
    "end": 74.929,
    "text": "And so please, at any point, if this isn't going kind of deep enough on any specific term, you want more clarity on anything, please, please feel free to mention it in the chat and we will definitely be happy to bring it up in conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 76.22,
    "end": 78.36,
    "text": " So just to begin, I'm Eugene Leventhal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 78.74,
    "end": 82.981,
    "text": "I'm currently the head of operations at the Smart Contract Research Forum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 83.541,
    "end": 88.842,
    "text": "We're a grant funded organization in the smart contract space or in the Web3 space overall, excuse me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 89.503,
    "end": 93.623,
    "text": "And our focus is very much on helping to advance research around Web3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 93.683,
    "end": 97.604,
    "text": "The starting point for that is just connecting folks from industry and academia.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 98.344,
    "end": 102.465,
    "text": "And we're exploring a lot of various questions around what is public good infrastructure,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 102.932,
    "end": 106.375,
    "text": " for research in Web3, but also for science more broadly look like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 106.575,
    "end": 113.24,
    "text": "So very happy to talk about Smart Contract Research Forum or SCIRF as we colloquially call it ad nauseum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 113.261,
    "end": 116.083,
    "text": "But yeah, for today, the focus is on decentralization itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 116.123,
    "end": 116.964,
    "text": "So I want to take it there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 118.165,
    "end": 123.189,
    "text": "But the thing I wanted to kind of start off with and mention as the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 124.659,
    "end": 129.202,
    "text": " Genesis of this conversation is the fact that the space of web three, even the term web three, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 129.222,
    "end": 139.649,
    "text": "It's one, uh, I came across this, uh, uh, GitHub repo of just all these articles that where it's very well-known technologists, uh, explaining why web three is all a bunch of baloney.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 139.669,
    "end": 140.629,
    "text": "And none of this makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 140.709,
    "end": 152.417,
    "text": "And, uh, in all fairness, there is a lot of enthusiasm in this space that leads to there probably being more focused on areas that, um, you know, uh, might have a rockier grounds than others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 152.912,
    "end": 162.858,
    "text": " But the goal of this session is really to delve into a term that if you've been part of anything, blockchain, crypto, Web3, in any kind of way, you've definitely heard the term decentralization thrown around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 163.519,
    "end": 175.507,
    "text": "Because the whole dichotomy, and I don't know if it's even fair to call it a dichotomy because that oversimplifies the idea, but at least this idea of a spectrum between there's centralized and somewhere along the line there's decentralized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 176.687,
    "end": 179.169,
    "text": "What does that actually mean to be decentralized?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 179.891,
    "end": 202.118,
    "text": " And for me, another thing, which I always love thinking, not in binaries, but sort of in spectra, is decentralization an endpoint or is it itself only a certain checkmark on a much wider spectra where maybe centralization to full peer-to-peer distribution is the actual ends of it, where everything goes through one party or goes through everyone in the system and there's sort of a, you know, gradients in between.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 202.674,
    "end": 209.919,
    "text": " But I think we can delve right into more of the technical definition of the architecture, the history of the term of decentralization or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 210.339,
    "end": 216.264,
    "text": "But to zoom out, I kind of like thinking about decentralization from at least two high-level buckets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 216.704,
    "end": 218.445,
    "text": "One is, who are we talking about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 218.465,
    "end": 220.126,
    "text": "And the other is, what are we talking about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 220.487,
    "end": 225.55,
    "text": "The who pertains to, are we talking about owners of a system or users of a system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 225.911,
    "end": 227.171,
    "text": "And that was users of a system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 228.268,
    "end": 229.73,
    "text": " Those vary greatly, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 229.75,
    "end": 237.457,
    "text": "Because if we're talking about ownership, that's where things like co-ops, the whole cooperative ownership movement, I mean, that has had millennia behind it, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 237.497,
    "end": 238.878,
    "text": "That's where that pertains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 239.299,
    "end": 249.569,
    "text": "But there's also, there could be a scenario where users use a system that on an architecture perspective is decentralized in terms of there not being a single point of centralization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 249.609,
    "end": 250.87,
    "text": "I know I still haven't defined it yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 250.91,
    "end": 251.631,
    "text": "That's intentional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 252.632,
    "end": 252.772,
    "text": "But",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 253.411,
    "end": 278.938,
    "text": " the for the user right they could have no ownership in the state so it's not as though we mean to centralize decentralization itself does not mean cooperatively owned per se right so let's suss apart who is actually using it and who is owning the thing that we're talking about and then when it comes to actually thinking about the what gets decentralized right i think that's where it's important to think on the one hand there is the infrastructure layer and more the application layer",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 279.694,
    "end": 284.279,
    "text": " And alongside that, it's sort of what is the actual domain of whatever we're talking about, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 284.319,
    "end": 292.208,
    "text": "Because infrastructure or application is more of the dimension of kind of architecture, so to say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 292.668,
    "end": 295.731,
    "text": "And the actual domain can be in terms of knowledge, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 295.811,
    "end": 298.594,
    "text": "Are databases, are they with known knowledge?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 298.694,
    "end": 300.016,
    "text": "Is that easily accessible?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 300.916,
    "end": 307.701,
    "text": " One can argue that libraries, right, the whole goal of libraries was to make information more accessible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 307.761,
    "end": 313.384,
    "text": "It's taking it away from a single place and opening it up to have more people being able to interact with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 314.485,
    "end": 320.468,
    "text": "And that can relate to knowledge, to decision making or communications, to actual resources.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 321.98,
    "end": 322.1,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 322.12,
    "end": 325.243,
    "text": "I'm kind of dancing around a few of these concepts around decentralization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 325.323,
    "end": 327.726,
    "text": "But again, what am I actually talking about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 327.766,
    "end": 327.946,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 328.206,
    "end": 333.131,
    "text": "So for me, it always comes down to if we're talking about decentralization, it needs to be in the context of a system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 333.391,
    "end": 333.532,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 333.572,
    "end": 336.354,
    "text": "Decentralization is not just something that appears or disappears.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 336.394,
    "end": 336.575,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 336.595,
    "end": 338.637,
    "text": "It's only in the context of systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 339.137,
    "end": 343.902,
    "text": "And when we think of those systems again, are we we can be thinking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 344.704,
    "end": 347.585,
    "text": " And let's just think of this from, say, the what perspective, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 347.605,
    "end": 350.826,
    "text": "Infrastructure apps, what are the actual domain of those infrastructure apps?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 351.246,
    "end": 360.869,
    "text": "When we talk about those things, centralization or decentralization can relate to power dynamics or who actually gets to make the decision of how all of these things are run at the end of the day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 361.29,
    "end": 371.313,
    "text": "I know in the Web3 space, there's been a lot of exit to DAO, just exiting to community is a more broad term that I believe came from Nathan Schneider and some",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 371.653,
    "end": 382.328,
    "text": " other folks working on now the project exit to community, but the whole idea of how can we actually let some of the decision-making and knowledge creation in our community",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 382.799,
    "end": 388.684,
    "text": " be both owned by and used by the same set of folks and, and kind of keep expanding that set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 389.144,
    "end": 402.575,
    "text": "And I think that's a lovely concept, but a lot of the time decentralization, at least from some of the conversations around web three that I hear, they start conflating a lot of things and which is why I like breaking it down to, well, are we actually talking about the owners and users?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 402.976,
    "end": 408.52,
    "text": "And are we talking to the infrastructure app layer or, and what is the actual domain of those things?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 408.58,
    "end": 409.601,
    "text": "And once you map that out,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 409.901,
    "end": 438.327,
    "text": " then you can start being a little more nuanced in trying to break out what exactly it is we want to explore the idea of decentralizing because the decentralization and power go hand in hand but again you need to be more specific in your terms and thinking about which part of a system you actually want to expand that scope of power around otherwise it can be very tough to build the necessary requirements of culture and community around this because again",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 438.809,
    "end": 448.037,
    "text": " If you are trying to truly decentralize something, that means you're going off to let more people have power in the system and more people just equals more messiness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 448.097,
    "end": 448.317,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 448.377,
    "end": 450.118,
    "text": "And that's not a judgment call.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 450.238,
    "end": 456.303,
    "text": "I think that can at least for anyone who's genuinely try to make a decision with one other people or with 100 other people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 456.343,
    "end": 459.606,
    "text": "And let me know the scenario where it's easier with 100 than with the one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 460.226,
    "end": 461.888,
    "text": "And I'm sure you can always find an exception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 461.928,
    "end": 462.048,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 462.068,
    "end": 464.77,
    "text": "But as a rule of thumb, that does seem to hold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 465.05,
    "end": 465.351,
    "text": "And so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 466.792,
    "end": 472.52,
    "text": " That's kind of one thing I wanted to start with in terms of decentralization overall and this kind of diffusion of power.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 472.64,
    "end": 478.769,
    "text": "And again, being particular with the terms of where in the system are we thinking of power and for whom does that power apply or apply to?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 480.532,
    "end": 489.378,
    "text": " And now that we've gotten at least some kind of a baseline of decentralization, now let's jump into what do I actually mean when I say something like decentralizing science?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 489.758,
    "end": 502.747,
    "text": "Because if you've been following certain niches of crypto Twitter, which I recognize crypto Twitter is already a niche, so niche among niches, but you might have seen the terms DeSci coming up, I think,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 503.858,
    "end": 507.602,
    "text": " October was the first time I believe I could find some kind of record of it on Twitter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 507.902,
    "end": 512.987,
    "text": "But this is a relatively new term, de-sci, decentralizing science or decentralized science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 513.347,
    "end": 518.092,
    "text": "So we're diffusing the power around the creation or the propagation around what of science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 518.132,
    "end": 522.756,
    "text": "Science is itself a very high-level term that can mean a lot of different things to a lot of people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 523.317,
    "end": 523.457,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 525.287,
    "end": 532.291,
    "text": " I like to think of, right, if we're breaking it down into the highest level, but separate parts, there's the actual research side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 532.431,
    "end": 545.537,
    "text": "So there is someone who has an existing base of knowledge, who has a theory about something that is not captured in that base of knowledge and wants to run some kind of tests to somehow amend or append the existing base of knowledge with new information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 546.058,
    "end": 548.759,
    "text": "So that's what I see as the actual research function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 549.179,
    "end": 550.44,
    "text": "Then there's the review function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 551.255,
    "end": 554.776,
    "text": " Some people looked into a thing and want to claim that it is true or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 555.376,
    "end": 556.696,
    "text": "How do we double check that, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 556.736,
    "end": 559.577,
    "text": "So the quality assurance layer over research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 560.017,
    "end": 575.86,
    "text": "And then there's the publication of research, which should not be conflated with media or publications overall, because research publication as it stands today, and I can't speak this confidently globally, but at least in the States, research publication and usable information",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 576.826,
    "end": 579.887,
    "text": " kind of interactable publication are two very different things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 580.227,
    "end": 586.69,
    "text": "Sort of, you know, the Springers, the ACMs, the IEEEs, their goal is not to get 10 million hits in academic paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 587.25,
    "end": 595.714,
    "text": "You know, they're working within a very specific system of producing academic research that is connected to the existing structures of research and review.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 596.36,
    "end": 620.613,
    "text": " When it comes to just pure media, there it becomes a lot of the time how do you get it to as many people as possible, which means how do you sometimes lose the depth of the point to make it easier to digest in a short amount of time, which is inherently contradictory to research, which is let's go as deep as possible on as narrow a set of things as we can to actually learn something or add to some kind of base of knowledge around that more narrow, deep set of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 621.153,
    "end": 628.302,
    "text": " So in my sort of pipeline of high level pipeline of science, it's there's research which gets reviewed and then it gets published.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 628.905,
    "end": 640.354,
    "text": " But that inherently does not capture everything coming out of academia or inherently coming out of any brilliant minds around the planet who have good ideas that should be explored.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 640.955,
    "end": 645.598,
    "text": "And there's the question of who has access to be doing research in the first place, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 645.618,
    "end": 658.068,
    "text": "In the States today, if you're not at a top 10, top 50 at least research institution, you're not in a top corporation that actually has an R&D department that's meaningfully funded, which is not the case at all corporations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 659.039,
    "end": 668.25,
    "text": " and you're not at a government agency dedicated to research, you're probably going to have a hard time having a seat at the table unless you find a way to break into one of those areas, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 668.511,
    "end": 674.598,
    "text": "So we can start thinking of, well, do we mean decentralizing research means everyone should get to do research?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 675.157,
    "end": 681.22,
    "text": " Maybe I'm not here to sort of give a yay or an A, but it's starting to think of, well, what do we mean about the power there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 681.26,
    "end": 683.822,
    "text": "Is it who actually gets access to be a researcher?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 684.122,
    "end": 688.204,
    "text": "Is it who gets to have a call and be part of the decision of what gets funded?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 688.624,
    "end": 692.667,
    "text": "Is it something about the actual interaction with the research information?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 692.947,
    "end": 693.087,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 693.107,
    "end": 700.631,
    "text": "Those are all different aspects of what could we be talking about when we're talking about or changing around the power dynamics around research itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 701.428,
    "end": 704.292,
    "text": " But again, that's just the first step, because then we've got to jump to review.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 704.432,
    "end": 708.177,
    "text": "Even if we've ironed all that out, we have a clear sense of what it means to decentralize research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 708.637,
    "end": 711.26,
    "text": "Well, who is actually going to be responsible for quality assurance?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 711.801,
    "end": 717.849,
    "text": "And I think that there's no shortage of information on some of the current challenges in peer review.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 718.417,
    "end": 722.86,
    "text": " I don't want to distract myself now, but I can put together a link later when I have a moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 723.1,
    "end": 733.846,
    "text": "A professor from Carnegie Mellon, Nihar Shah, he and another professor from CMU, Zach Lipton, did a great joint presentation that I know that their slides are publicly available that I'll add the link to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 734.307,
    "end": 741.051,
    "text": "They did a great outline of all of the known research studies delving into the current problems with peer review.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 741.721,
    "end": 749.666,
    "text": " I don't want to be misquoting, but I think it's somewhere in the 70 to 100 range of academic studies just exploring very particular problems in peer review.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 749.726,
    "end": 749.886,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 749.906,
    "end": 754.849,
    "text": "So this is not as though I'm someone from outside academia raising a red flag that doesn't exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 755.149,
    "end": 755.329,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 755.369,
    "end": 760.652,
    "text": "Talk to a tenured faculty member and they will probably be the first one to tell you all the problems with the peer review structure of today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 761.873,
    "end": 766.896,
    "text": "So one of the challenges is if you ask the people who are doing the research to be their own reviewers,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 767.728,
    "end": 769.311,
    "text": " There's a clear conflict of interest there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 769.351,
    "end": 777.406,
    "text": "If you tell me to produce something and review it, there's reason to believe that I will have the incentive to be light on the review and just push whatever I want to produce.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 777.787,
    "end": 780.332,
    "text": "So the separation of those two functions is very important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 780.805,
    "end": 784.107,
    "text": " But the question of should reviewers be anonymous or not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 784.467,
    "end": 786.248,
    "text": "Should reviewers be compensated or not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 786.909,
    "end": 789.39,
    "text": "Again, should everyone be able to be a reviewer?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 789.67,
    "end": 791.971,
    "text": "Should everyone have a seat at the table of being to review?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 792.112,
    "end": 799.876,
    "text": "Or do you need a bare minimum set of qualifications to even be allowed to be a reviewer in whatever a future system of review might be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 800.977,
    "end": 809.362,
    "text": "And then finally, there's the aspect of the actual publication of you've done the research, you've gotten it reviewed, now it has to go somewhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 810.498,
    "end": 820.503,
    "text": " at least the current norm a lot of the time in the top research institution is via a journal or conference or some kind of very high level or very esteemed publication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 821.043,
    "end": 832.289,
    "text": "You might have heard the motto, so to say, publish or perish, which I think is a good encapsulation of the incentive problems around academia for research faculty, where a lot of the time, if you're in the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 834.618,
    "end": 851.052,
    "text": " top kind of 1% of institutions, you might be focused on more headline catching research because you might actually be the pipeline where you have the relationships with the largest media organizations and they come to you for some kind of fancy, you know, new breaking research on people and the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 851.112,
    "end": 861.04,
    "text": "And this is what this means for how all of us, you know, the kind of stuff mainstream media likes to oversimplify when it comes to talking about research publicly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 862.101,
    "end": 863.062,
    "text": "On the other side of it,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 863.911,
    "end": 868.694,
    "text": " there's also, or sort of, excuse me, with the aspect of publish or perish, that's just in the top 1%.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 869.294,
    "end": 886.043,
    "text": "If you go into more of the kind of the global majority of research institutions, the game that's being played is different where it's a volume play, where your ability to progress as a tenured faculty member has pressures on it to see how many things you've actually published that hits some kind of reputable journal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 886.884,
    "end": 889.285,
    "text": "And, right, those are all incentives that make it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 889.665,
    "end": 893.247,
    "text": " tough for people to just focus on the purity of the act of review.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 893.767,
    "end": 895.128,
    "text": "And there's a whole separate question, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 895.168,
    "end": 903.231,
    "text": "Does the purity of the act matter as long as we can figure out a system and function so that we minimize the amount of questionable science that gets put out, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 903.271,
    "end": 904.992,
    "text": "What is the bad side of review?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 906.093,
    "end": 908.374,
    "text": "Research happens that comes to faulty conclusions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 908.474,
    "end": 910.755,
    "text": "No one captures it and someone tries building on it, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 911.055,
    "end": 914.997,
    "text": "And that could actually lead to some kind of problems if we think of the hard sciences and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 915.237,
    "end": 933.403,
    "text": " you know imagine a medical device going out uh built on a fundamental research premise that is false right like people's lives could actually be at risk in those kind of scenarios so this isn't just some like people playing with defy money online kinds of questions right this is science more broadly so but again that whole cycle of research",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 934.221,
    "end": 943.063,
    "text": " review and publish still doesn't actually get to how do we get this research out of the ivory walls of universities into the hands of people who need to build it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 943.343,
    "end": 960.725,
    "text": "How do we actually make this relevant to your average person anywhere on the planet who might wonder what is the cutting edge of, I don't know, quantum computing have to do with me if I don't even know how to type a line of code or explain how an email gets from my phone to my computer or to anything else, nor do I care, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 960.765,
    "end": 963.566,
    "text": "I'm busy with my own life and I have my own priorities and problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 963.993,
    "end": 966.036,
    "text": " Why should I care about any of this in the first place?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 966.437,
    "end": 966.577,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 966.597,
    "end": 976.453,
    "text": "So there's already there's the full research apparatus that we talked about and a lot of the institutions that do science reporting or any kind of let's actually get this contextualized in larger narratives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 977.602,
    "end": 982.606,
    "text": " What are the actual incentives aligning them with the researchers or them with the public?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 983.087,
    "end": 1004.124,
    "text": "So there's a number of things in all of these separate nodes of the large system that is science that themselves have a multitude of different areas where we can explore what decentralization might mean and how that might impact the people in the system or how that might impact people who don't care about the system at all, but just want to have less suffering, more prosperity in their life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1004.504,
    "end": 1009.107,
    "text": " And how does it actually go from theoretical science to genuinely improving people's lives?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1009.807,
    "end": 1017.911,
    "text": "And the last bit I'll kind of touch on before bringing this to be the actual conversation it's intended to be is more on the behavioral side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1018.312,
    "end": 1033.54,
    "text": "Because I know when I first got interested in blockchain and DAOs in the 2016 timeline, it felt very much that there was just so much excitement that, oh, we could be at the precipice of making the thing that solves all of humanity's problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1034.045,
    "end": 1034.145,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1034.185,
    "end": 1039.55,
    "text": "And if you've studied the history of technology or of any kind of advances, that's a sentiment that is not new.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1039.57,
    "end": 1048.217,
    "text": "A lot of people at a lot of cutting edge advances at their point in time thought that, oh, this could be the thing that actually, you know, ends world hunger, poverty or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1048.257,
    "end": 1048.397,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1048.417,
    "end": 1051.62,
    "text": "That it could actually have these mass global scale positive effects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1053.359,
    "end": 1062.702,
    "text": " But especially when it comes to something like decentralization, I feel as though one of the questions that I'm hoping we'll get into this through conversation, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1062.722,
    "end": 1064.803,
    "text": "But a decentralized world, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1064.843,
    "end": 1075.007,
    "text": "If we have this kind of world where power gets distributed from a very limited set of players to a much wider base of individuals, there's just more uncertainty there, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1075.047,
    "end": 1077.668,
    "text": "Because like it or not, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1077.688,
    "end": 1080.409,
    "text": "And again, look at political governance in the full history there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1081.098,
    "end": 1087.442,
    "text": " democracies are messier in the sense of decision-making because more people have to come together, but there's a lot of benefits of that messiness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1087.582,
    "end": 1094.346,
    "text": "I am personally a huge fan of that messiness because I think us working through messiness is that it's the most human thing we can be doing, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1094.386,
    "end": 1108.154,
    "text": "We are a social species and us working through the messiness of coordination is part of the exciting things that we get to build higher order ideas as a species, like these laptops we're talking on or any of the other great advances that we now have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1109.175,
    "end": 1109.735,
    "text": "And so I think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1110.618,
    "end": 1116.84,
    "text": " At the core of decentralization for me is an increase in uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1117.26,
    "end": 1127.322,
    "text": "And I think that that is something that we don't like talking about a lot in the space, or at least I have not heard many open discussions about it, because it runs counter to human nature and desire.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1127.842,
    "end": 1130.023,
    "text": "And let's look at that at a few different dimensions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1130.263,
    "end": 1132.483,
    "text": "Let's just think of us as a pure biological creature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1132.503,
    "end": 1137.004,
    "text": "Let's take away all of our sociocultural constructs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1137.284,
    "end": 1138.845,
    "text": "We are just a biological mass.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1140.177,
    "end": 1142.12,
    "text": " I am personally of the camp.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1142.16,
    "end": 1153.254,
    "text": "I am not a neuroscientist, but in my limited knowledge and in following some neuroscientists, I am fully in the camp of the Lisa Feldman Barrett's and the many others who are now part of this growing school.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1153.274,
    "end": 1155.016,
    "text": "Yeah, our brains are prediction machines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1155.036,
    "end": 1159.221,
    "text": "That's literally what they evolved to do is to be much better at predicting what's about to happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1159.761,
    "end": 1160.801,
    "text": " And so, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1160.901,
    "end": 1162.022,
    "text": "What does prediction mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1162.162,
    "end": 1164.783,
    "text": "It means that we, we like to model things out, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1164.803,
    "end": 1171.425,
    "text": "And there's a Lex Friedman has a great series of interviews with Lisa Feldman Barrett and Yosha Bach and a few others that I'd be happy to link to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1171.445,
    "end": 1176.447,
    "text": "I just love those three to four hour discussions, jumping around neuroscience and consciousness and everything else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1176.823,
    "end": 1181.927,
    "text": " that, you know, that makes sense to me that there's these sort of, there's cortical columns that are focused on certain activities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1182.428,
    "end": 1188.993,
    "text": "There are sort of columns of neurons being bunched together, or really of neural nets being bunched together to sort of execute certain functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1189.473,
    "end": 1193.517,
    "text": "As you kind of get more and more of these together, you need consolidation functions, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1193.617,
    "end": 1203.285,
    "text": "And we have models at all different kinds of levels ranging from very narrowly focused ones to like, hey, what do I want to do with my life tomorrow or a year from now, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1203.325,
    "end": 1205.807,
    "text": "Like those are very complicated modeling exercises.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1206.127,
    "end": 1216.237,
    "text": " But our brains are constantly trying to model and modeling means you're trying to map on, you're trying to limit uncertainty and create an actual projection into the future of what might happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1216.798,
    "end": 1221.923,
    "text": "And why does centralization show up in a lot of sociocultural environments?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1222.323,
    "end": 1224.445,
    "text": "Because there is efficiency to centralization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1224.892,
    "end": 1225.072,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1225.172,
    "end": 1233.215,
    "text": "If one person gets to make all the calls, assuming they are good at making calls and they are a good person with or that they are shooting towards a beneficial end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1233.536,
    "end": 1233.716,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1233.836,
    "end": 1238.598,
    "text": "We will all be able to move more quickly with that one as opposed to 10,000 trying to make that decision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1239.118,
    "end": 1245.26,
    "text": "So a lot of this natural evolution has pushed us to want to minimize uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1245.781,
    "end": 1254.004,
    "text": "And yet we are inherently trying to introduce a cultural element that actually increases uncertainty, which for me, again, is very just counter our biology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1254.505,
    "end": 1260.31,
    "text": " And I think that we don't just have to think on that level of our brain as prediction machines and along those lines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1260.71,
    "end": 1265.194,
    "text": "How easy is it at the start of my day?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1265.434,
    "end": 1268.157,
    "text": "And I'll just use a personal example as an abstraction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1268.697,
    "end": 1274.622,
    "text": "At the start of my day, especially as someone with chronic sleep issues and whatever, I start every day at the center of my universe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1275.103,
    "end": 1281.208,
    "text": "And I have to be intentional about reminding myself that that voice inside my head that's yapping as soon as my eyes open up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1281.636,
    "end": 1283.038,
    "text": " That is not the entirety of me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1283.078,
    "end": 1287.483,
    "text": "That's actually one of the nodes that constitute the entire being and system that is Eugene.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1287.803,
    "end": 1291.728,
    "text": "But at the end of the day, that's the thing that I hear first and foremost.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1291.788,
    "end": 1301.399,
    "text": "And it's very easy for me to just get caught up in the emotionality of whatever that voice is yammering on about and to pretend that I need to be going with it wherever it's taking me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1302.017,
    "end": 1311.023,
    "text": " where I have the ability through meditation, mindfulness, through all different kinds of practices to be like, timeout, let's go ahead and quiet that voice and let's listen to other modes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1311.083,
    "end": 1313.204,
    "text": "Let's listen to other nodes in the system of Eugene.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1313.724,
    "end": 1318.787,
    "text": "And for me, decentralization is a psychological concept too if we think of ourselves as a system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1319.047,
    "end": 1322.99,
    "text": "Do I just give credence to the centralized view of the voice of consciousness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1323.35,
    "end": 1329.894,
    "text": "Or do I actually try to have a more decentralized view of my being where I'm listening to every single node that is part of my constitution?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1330.219,
    "end": 1330.359,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1330.399,
    "end": 1336.921,
    "text": "Before I started meditating, I never actually thought about how does my back feel against the chair that I'm sitting in as I'm right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1336.941,
    "end": 1341.602,
    "text": "Like these little elements of focusing attention and being intentional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1341.843,
    "end": 1348.605,
    "text": "I think those two words of intention and attention are so important for where behavioral level change begins.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1349.125,
    "end": 1356.527,
    "text": "And what I don't see enough of in this space or in a lot of spaces is the bridge between behavioral level change and high level philosophy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1357.011,
    "end": 1367.059,
    "text": " So that's really why I wanted to have this discussion today is because I'm happy to espouse on blue in the face of my views on why certain decentralization is great and good for humanity and all this other stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1367.399,
    "end": 1370.802,
    "text": "But at the end of the day, you can have the best philosophical theory in the history of humanity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1371.022,
    "end": 1375.185,
    "text": "And if you don't actually know how to get a single person to start taking a step towards it, is it really useful?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1375.598,
    "end": 1399.855,
    "text": " So for me, I love jumping between the two, between what can I do to be a better collective citizen of the groups and systems that I'm in, and jump to what does that mean to inform my philosophy of life, and what is the link between those two, and how do I get a feedback loop going, and not just punting off to philosophizing and abstracting, which is much easier than the lower level of understanding myself, emotions, and all of the internal world side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1400.215,
    "end": 1404.798,
    "text": "So that might have gone on a little longer than I intended, but that's where I'd like to kind of kick us off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1411.289,
    "end": 1434.399,
    "text": " okay great thank you for the introduction and opening set of ideas a lot of places to jump in there did you ever get to what decentralization is let's return to maybe that and then yeah sure so yeah pop into a few other places absolutely yeah so uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1436.024,
    "end": 1438.487,
    "text": " I like to think of decentralization, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1438.527,
    "end": 1442.553,
    "text": "The overly simple view of it is it's a diffusion of power in a system, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1442.573,
    "end": 1449.182,
    "text": "And that's where I came back to power for whom, over whom, and of what, and the whom and the what are very important there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1449.462,
    "end": 1453.788,
    "text": "But effectively, it's taking power from a single source and sharing it out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1454.238,
    "end": 1458.841,
    "text": " Most simple version, think of a kingdom when there is literally a single king or queen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1459.501,
    "end": 1460.862,
    "text": "They get power over everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1460.882,
    "end": 1467.605,
    "text": "A democracy such as the, let's say, American democracy, we have three different branches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1467.625,
    "end": 1469.246,
    "text": "We have a bunch of people in each of the branches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1469.386,
    "end": 1474.929,
    "text": "That's trying to take a step towards decentralizing power away from a single person to a larger set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1475.249,
    "end": 1480.232,
    "text": "And then you can argue that truly communal living or certain versions of anarchic living",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1480.552,
    "end": 1498.597,
    "text": " where there is no, it's kind of a leaderless true organization where everyone has equal power, that might be on sort of the other end of the spectrum of sort of true everyone is on, I don't know if everyone is on the same level, but like this peer-to-peer system on the one end and more of a truly centralized everything comes out of one node on the other end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1500.788,
    "end": 1503.109,
    "text": " So I wrote down, does that change the nature of the system?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1503.509,
    "end": 1523.059,
    "text": "If we have one set of rules or one state that we're in, or an area of state space for some system features, and one person has all of the tokens, and then the system changes so that the distribution, the non-equilibrium steady state, like we might say in active inference, is at a new normal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1523.679,
    "end": 1526.761,
    "text": "It's at a new stationarity or meta stationarity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1527.501,
    "end": 1529.803,
    "text": " it's kind of like, isn't that a different system?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1530.564,
    "end": 1541.073,
    "text": "So even implying that power can be spread out, it's a non-fungible asset and it's an irreversible asset, time-dependent one too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1541.853,
    "end": 1554.764,
    "text": "These are just like some of the, as we open the conversation, I think today, but also on a broader timescale, there are the known unknowns and then there's the unknown unknowns.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1555.164,
    "end": 1555.305,
    "text": "And",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1556.534,
    "end": 1580.028,
    "text": " going to bump up against all of them yeah and i really like the the i i've never used this term exactly but i really like that you put it together the the non-fungibility of power uh because i i think that's an interesting and important one to recognize because right being aware of that especially for people who are actively designing a system and who are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1580.58,
    "end": 1585.485,
    "text": " the first ones building it, you inherently are going to have way too much power in that system, whether or not you want that power.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1585.926,
    "end": 1590.05,
    "text": "I think, let's say Vitalik Buterin and Ethereum is a great example, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1590.09,
    "end": 1590.711,
    "text": "He doesn't want",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1592.13,
    "end": 1592.87,
    "text": " I don't know him personally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1592.89,
    "end": 1598.353,
    "text": "I don't want to speak on his behalf, but I have a lot of reason to believe that he is not looking to be the authoritarian over Ethereum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1598.513,
    "end": 1602.455,
    "text": "That is my genuine view of that based on all of the reading and following of the space that I've done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1602.795,
    "end": 1607.297,
    "text": "But Vitalik says something and everyone in the space listens, and that might have impact on Ethereum price.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1607.337,
    "end": 1610.119,
    "text": "So there are these relationships whether or not you like it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1610.479,
    "end": 1612.68,
    "text": "But at the same time, there's also",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1613.752,
    "end": 1628.339,
    "text": " As a person designing these systems, you have to be willing to recognize that in order to gain efficiency at a certain point, I actually might need to centralize the power under me, but design the system in a way so that I cannot maintain it over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1628.939,
    "end": 1640.264,
    "text": "And how to give away power and make sure that you don't have the ability to usurp it again is very interesting from a system design perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1640.729,
    "end": 1644.973,
    "text": " And even if you came into this discussion thinking like blockchain is a joke, Web3 is a joke.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1645.193,
    "end": 1650.618,
    "text": "Sure, like it's an open question how much usefulness is going to come out of this on a hundred to thousand year timeline.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1650.718,
    "end": 1654.941,
    "text": "I'm open and understanding of the lack of clarity of the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1655.282,
    "end": 1658.725,
    "text": "But I just think the space at least DAOs are worth paying attention to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1659.198,
    "end": 1671.652,
    "text": " Because I don't see anywhere else where there's so much open experimentation in that direction of supposedly saying we're here to diffuse power and then watching the actual social dynamics play and system structuring around it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1671.712,
    "end": 1673.754,
    "text": "So that's one of the reasons of Calls of Light.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1673.774,
    "end": 1674.975,
    "text": "Just go check out some DAOs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1675.056,
    "end": 1677.138,
    "text": "It's fascinating social experiments, if nothing else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1679.708,
    "end": 1680.729,
    "text": " A few thoughts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1680.849,
    "end": 1691.737,
    "text": "One thing is I lived in cooperatives for many years and so it's just so interesting to see some of those traditions and failure modes and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1692.892,
    "end": 1694.893,
    "text": " patterns translated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1695.453,
    "end": 1700.875,
    "text": "And then I know it's a big theme in web three, where the first steps involve translating like what has already been done.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1700.995,
    "end": 1701.255,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1701.336,
    "end": 1702.516,
    "text": "Oh, you've worked in an office before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1702.596,
    "end": 1704.197,
    "text": "Well, now you're in a virtual office.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1704.837,
    "end": 1713.3,
    "text": "And then the future steps can be elaborations that take it into a different direction or use something that couldn't have been engineered in the physical world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1713.721,
    "end": 1718.943,
    "text": "So we're beginning to form the motifs and the grammar for describing the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1719.543,
    "end": 1737.989,
    "text": " organizational patterns design patterns and atlases of risk for organizations and before there was uh money attached to numbers it was probably hard to do counterfactuals and long-term tracking of money quantitatively and if your decision making is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1739.469,
    "end": 1755.671,
    "text": " um based upon a secret handshake well then it might be so esoteric that it has never been investigated doesn't mean it doesn't work it's just that now we're implementing computational governance hashtag metagov and implementing programmable money and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1756.912,
    "end": 1779.362,
    "text": " involved in totally surveillable communications oh just vote on this poll well now you have the time and did someone vote and unvote and get into so many other pieces that weren't there in the paper ballot and that wasn't there until that was there so it's a whole new set of observations that are coming in about systems that we had already been engaged in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1780.222,
    "end": 1790.048,
    "text": " But then where you get that second level cybernetics and complexity is when we're modifying the system with new affordances, new ways we can modify.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1790.548,
    "end": 1797.272,
    "text": "And then that's feeding back into like very rapid change, but by no means even maximal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1799.025,
    "end": 1808.048,
    "text": " Yeah, and to what you mentioned earlier on with the first question, or with the whole idea of, well, once you start decentralizing, is that even the same system at that point, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1808.128,
    "end": 1814.469,
    "text": "Once you change sort of the power dynamics, can it be argued that we're looking at something fundamentally different there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1814.87,
    "end": 1826.933,
    "text": "And I think that part of the exciter, right, there's another area that we need to explore and define more terminology around in terms of that feedback loop of system",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1828.53,
    "end": 1832.733,
    "text": " system architecting, system running and management, and culture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1833.194,
    "end": 1840.999,
    "text": "Because even if nothing else, I mean, I don't know how nothing would change in the system going from a centralized to decentralized, decision-making has to open up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1841.019,
    "end": 1849.806,
    "text": "There are literal operational things that need to go into account to be able to manage more people being involved in certain decision-making capacities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1850.726,
    "end": 1853.128,
    "text": "But at the same time, it inherently requires culture shift.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1853.843,
    "end": 1856.104,
    "text": " And that's where it comes down to that behavioral level change for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1856.144,
    "end": 1869.892,
    "text": "Because if it goes from, hey, Daniel is our benevolent dictator in this community and no one questions it, to all of a sudden, both of us are making choices and so are 50 other people, I now need to be willing and ready to be called out for the appropriate level of responsibility that I hold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1869.932,
    "end": 1871.253,
    "text": "And like, hey, why'd you do that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1871.293,
    "end": 1875.516,
    "text": "That was actually not in line with everything else you've said before and your views on the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1875.536,
    "end": 1876.496,
    "text": "Like, why are you going in?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1876.516,
    "end": 1878.217,
    "text": "And like, now I'm accountable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1878.277,
    "end": 1879.738,
    "text": "Now I'm responsible to my peers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1879.818,
    "end": 1881.319,
    "text": "And I just think that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1882.27,
    "end": 1885.952,
    "text": " I get worried about not enough of that behavioral and human level coverage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1886.152,
    "end": 1897.817,
    "text": "And again, one of the things I'm excited about with the current experimentation in DAOs, when I first got in in 2016, the amount of people, myself included, who were like, oh, DAOs, brand new, shiny, cool thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1897.837,
    "end": 1901.138,
    "text": "And this is back in 2016 when there was zero tooling or anything for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1901.518,
    "end": 1904.84,
    "text": "And there were people who were there much well before then even.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1905.14,
    "end": 1907.001,
    "text": "But there was this view of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1908.152,
    "end": 1909.172,
    "text": " It's a brand new thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1909.292,
    "end": 1916.915,
    "text": "And then all of a sudden folks, and I know like my colleague, Richard Brown at Scurf, when he joined MakerDAO, he was in one of these positions where it's like, y'all have heard of co-ops before, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1916.955,
    "end": 1921.476,
    "text": "This isn't like the tech might be new, but the concept is, and you've heard of a co-op, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1921.856,
    "end": 1923.556,
    "text": "And people would be like, oh, a co-op?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1923.596,
    "end": 1927.317,
    "text": "And like, they had never really looked into that background and full history.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1927.658,
    "end": 1932.439,
    "text": "And so, right, first there's this just catch up of, right, different domains have relative knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1932.819,
    "end": 1940.366,
    "text": " But then once it's these different disparate domains are aligned, and this is where I really, you called out the Medigov community that we're both in, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1940.406,
    "end": 1945.05,
    "text": "I really love the Medigov community because it's not just a Web3 governance community.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1945.13,
    "end": 1956.361,
    "text": "It's a governance community, which means people from inherently different backgrounds with inherently different views and different desires of the kind of applications they want to bring this back to are coming together to talk about a topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1956.701,
    "end": 1974.899,
    "text": " And I think once you have those layers of true interdisciplinary, coordinated, supported action towards trying to change a system, at least that's where I get really excited about people coming together, because I do just love that those kind of different backgrounds kind of being able to chime in on some kind of thinking there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1977.87,
    "end": 2006.529,
    "text": " a lot of places we could go as always but these org streams at the active lab it's a it's a multi uh street juncture there's people who might be familiar with or curious about active inference but then some of these questions and approaches they're hearing about for the first time and then there might be somebody who's interested in the governance approaches who might be hearing about active inference for the first time so that's kind of the fun but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2008.29,
    "end": 2018.073,
    "text": " It's the microcosm of how we make decisions and how the differences in what our experiences and perspectives are contribute to something that's bigger than us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2018.593,
    "end": 2028.295,
    "text": "And I think that is related to your point about uncertainty and about changes in certainty of different types, which I think we can take some time and think about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2029.876,
    "end": 2034.637,
    "text": "Like if the plan is big enough for one person to feel like they understand it,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2035.95,
    "end": 2038.752,
    "text": " there's a limit to the complexity of that plan.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2039.873,
    "end": 2048.921,
    "text": "If you allow for stigmergy, for the ability of the plan to be understood by one person plus their environments, like blueprints or the computer system,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2050.723,
    "end": 2053.925,
    "text": " it's bigger than that person's one onboard cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2053.965,
    "end": 2063.549,
    "text": "So that's what a lot of cognitive scientists call like extended or inactive cognitive processes that can involve physical parts or modification of the niche.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2063.949,
    "end": 2072.373,
    "text": "So that's been one trend in neuroscience since the sort of like brain region A connected to brain region B, still very cool and interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2072.854,
    "end": 2074.855,
    "text": "But one of the important recent trends",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2075.655,
    "end": 2078.676,
    "text": " is people looking into this embodied and extended element.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2078.997,
    "end": 2080.157,
    "text": "Little aside.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2082.118,
    "end": 2084.939,
    "text": "So you have the project that that one person can operate by themself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2085.539,
    "end": 2088.401,
    "text": "But we're talking about projects that are either",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2089.451,
    "end": 2112.569,
    "text": " requiring multiple expertises, like almost any scientific project, or the case where we not just could use multiple people, we might benefit from, but we're talking about governance, which is like decision-making where it is explicitly about creating a layer where multiple people are harmonising their view.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2113.39,
    "end": 2114.25,
    "text": "So I think",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2115.231,
    "end": 2135.296,
    "text": " where does uncertainty fit into that is a fascinating area i'd love to hear more on because uncertainty is such a core component to active inference and the management of uncertainty so maybe you could give some thoughts on that and then we can bring it back to active yeah so i think there's a couple of dimensions there that i don't want to conflate either so one thing is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2136.112,
    "end": 2136.292,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2136.613,
    "end": 2139.355,
    "text": "I know, uh, personality psychology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2139.375,
    "end": 2141.937,
    "text": "I feel like let's just go with the big five to avoid it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2142.478,
    "end": 2144.46,
    "text": "Let's go with the one with the most research behind it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2144.88,
    "end": 2145.501,
    "text": "Um, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2145.641,
    "end": 2149.264,
    "text": "Research, uh, personality psych, its own big school, a lot of differing opinions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2149.585,
    "end": 2152.988,
    "text": "Uh, that's not necessarily the focus of the current, the reason why I'm bringing it up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2153.028,
    "end": 2153.168,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2153.448,
    "end": 2157.331,
    "text": " But there is reason to believe there is some biological difference between people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2157.771,
    "end": 2170.379,
    "text": "And again, not trying to dive into all of the nuance of that at the moment, but one element is the ease of the ability to deal with something like uncertainty, I do not think is biologically uniform, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2170.399,
    "end": 2174.862,
    "text": "I think there's going to be people who have easier time dealing with uncertainty and people who have harder time dealing with uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2175.122,
    "end": 2176.903,
    "text": "And that's just the natural disposition, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2176.923,
    "end": 2180.886,
    "text": "Then there's the actual lived environment that they are raised in, grow up in, the culture they're in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2181.383,
    "end": 2183.452,
    "text": " all of that, which also heavily affects that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2183.813,
    "end": 2183.954,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2186.204,
    "end": 2195.008,
    "text": " A question that I remember Seth Frey, Professor Seth Frey, who's also in the MediGov community, asked during a conference panel we had organized last summer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2195.629,
    "end": 2201.732,
    "text": "He brought up this idea that he likes to ask people of, hey, you, when you envision your version of utopia, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2201.812,
    "end": 2210.176,
    "text": "Imagine, and I'm butchering his exact example, but it was sort of, oh yeah, for Dow, sort of the perfect Dow, and envision it as a building, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2210.376,
    "end": 2212.597,
    "text": "Do you see that building full of people or lacking people?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2213.303,
    "end": 2218.106,
    "text": " And I think the answer to that starts with a big dichotomy of viewpoints around the question of uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2218.806,
    "end": 2225.49,
    "text": "Do you view uncertainty as an inherent human flaw that we have to get rid of the people and create systems that can live in spite of humans?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2226.17,
    "end": 2232.153,
    "text": "Or do you embrace the fact that uncertainty is just part of who we are and we will never, ever, ever get rid of it fully?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2232.173,
    "end": 2238.617,
    "text": "And we just kind of have to be okay with letting the current wash over us and take us where it takes us, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2239.097,
    "end": 2239.197,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2239.787,
    "end": 2242.708,
    "text": " I am fundamentally of the camp of like, this is all quarterly human.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2242.808,
    "end": 2245.609,
    "text": "I don't think we can automate away human problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2245.649,
    "end": 2248.45,
    "text": "So I just, I'm giving my own bias here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2248.73,
    "end": 2255.992,
    "text": "I'm very much taking this in the camp of like, let's just dig into the assumption that these are core human issues and we will have to deal with the human, the human side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2256.353,
    "end": 2258.433,
    "text": "So that, that is an important distinction I want to make.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2258.453,
    "end": 2260.614,
    "text": "Cause I do think some people are naturally predisposed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2261.044,
    "end": 2267.591,
    "text": " or now are predisposed due to culture and environment to be like, oh, humans are the bane of existence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2267.711,
    "end": 2271.595,
    "text": "And what was the Jean Paul Sartre quote, hell is other people, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2271.615,
    "end": 2278.923,
    "text": "Like there's people who genuinely just have a harder time for a variety of reasons being with humans, which adds complexity to uncertainty, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2278.943,
    "end": 2282.747,
    "text": "So I don't want to pretend that everything else I'm going to say is a blanket statement for others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2283.627,
    "end": 2285.128,
    "text": " I myself am a bit of an ambivert.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2285.188,
    "end": 2296.113,
    "text": "I have extroversion, I have introversion, but I am fundamentally human in the sense of I need other humans around me and I will always prefer a messier conversation than no conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2296.433,
    "end": 2300.375,
    "text": "So that is my bias and predisposition into answering your question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2301.436,
    "end": 2307.519,
    "text": "So on the actual side of uncertainty, so existence is inherently uncertain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2309.38,
    "end": 2312.241,
    "text": "Parts of us want to create certainty for a variety of reasons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2313.086,
    "end": 2319.592,
    "text": " Biologically, we want certainty so that our brain can be less freaking out about whether or not we're going to die soon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2319.973,
    "end": 2325.018,
    "text": "On an evolutionary scale, that's oversimplifying where fear responses and whatnot came from naturally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2325.458,
    "end": 2327.741,
    "text": "But if you think of it on a sociocultural perspective,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2328.368,
    "end": 2357.166,
    "text": " those did not naturally evolve over millennia or over millions of years right those were instituted and provided for a variety of very different perspectives right uh why we may have been trained that a good worker is someone who shows up to work at 9 00 a.m and leaves at 5 p.m or whatever the norms are around whatever you were raised in right there are very different uh pulls and incentives around why that was kind of indoctrinated into your brain aside from oh this is just how the natural world works right so that's also an important gap to recognize because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2358.567,
    "end": 2370.119,
    "text": " Why I love the lens of existential psychology and psychotherapy is that there's more and more research pointing in the direction that once something is a core enough assumption for someone,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2370.771,
    "end": 2374.573,
    "text": " attacking that core assumption feels like you're attacking them as a human being.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2375.054,
    "end": 2379.537,
    "text": "And it feels like it's a fundamental survival environment for them, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2379.637,
    "end": 2384.78,
    "text": "You might have been in a conversation with someone where you ask an opinion where you just really disagree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2385.06,
    "end": 2387.241,
    "text": "And all of a sudden, they get into like hyper defensive mode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2387.281,
    "end": 2389.403,
    "text": "And it's like, whoa, I was just exploring an idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2389.463,
    "end": 2391.964,
    "text": "Why are you like, I'm not trying to cut your head off, like what's happening here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2392.465,
    "end": 2398.529,
    "text": "And but that's how we respond when people can question certain aspects that are that are so based to us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2399.029,
    "end": 2399.149,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2400.219,
    "end": 2411.405,
    "text": " I think that again, and I realize I'm just kind of dancing around the exact question, but just uncertainty is such a hyper complicated topic because on the one hand it's everywhere and it's fundamentally part of existence, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2411.645,
    "end": 2421.77,
    "text": "This is one thing where it's interesting how psychedelics and Buddhism and meditation and all these other dimensions come back to the same thing of, oh yeah, life is super complicated and I'm just never going to get all of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2421.79,
    "end": 2422.49,
    "text": "And like, that's cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2422.851,
    "end": 2424.351,
    "text": "And you got to learn how to be okay with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2424.431,
    "end": 2424.551,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2424.791,
    "end": 2427.633,
    "text": "And like, that's on the very behavioral personal level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2428.32,
    "end": 2431.042,
    "text": " learning how to deal with uncertainty is not easy for people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2431.182,
    "end": 2437.827,
    "text": "I know I have some folks who I absolutely adore in my life, why I tell them all the time, stop being a control freak, you're making your life harder, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2437.867,
    "end": 2440.389,
    "text": "But that's not easy feedback to give someone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2440.449,
    "end": 2445.213,
    "text": "And it's kind of useless feedback, unless you actually sit down and walk them through step by step how to do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2445.513,
    "end": 2447.495,
    "text": "And what are the things and when are you going to be uncomfortable?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2447.535,
    "end": 2448.596,
    "text": "And when are you going to be comfortable?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2449.156,
    "end": 2453.499,
    "text": "So part of the tricky part of uncertainty is that it is inherently uncomfortable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2454.14,
    "end": 2456.382,
    "text": "And most of us don't want to be more uncomfortable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2456.702,
    "end": 2458.143,
    "text": "So how do you learn how to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2460.211,
    "end": 2461.953,
    "text": " of knowledge of where things are going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2462.274,
    "end": 2463.715,
    "text": "Like, how do you give up control?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2463.735,
    "end": 2467.02,
    "text": "How are you okay with knowing I have no clue where my next step is going?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2467.42,
    "end": 2469.342,
    "text": "And yet you're like, Oh, no, but this is awesome and amazing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2469.703,
    "end": 2475.971,
    "text": "And like, that's actually that is a series of contradictions internally, that is hard to consolidate, unless you have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2477.265,
    "end": 2482.028,
    "text": " the disposition, the privilege, and a few other factors in your life to allow you to explore it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2482.649,
    "end": 2495.377,
    "text": "And I recognize that I've spent the amount of time digging into these things in the last 10 to 15 years because of the specific dynamics that I was born into and other factors that I don't want to turn this into a personal outward facing therapy session.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2495.637,
    "end": 2501.22,
    "text": "But I'm happy to disclose those because I think that that's the dimensions of connection, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2501.3,
    "end": 2502.241,
    "text": "It does run that deep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2506.098,
    "end": 2507.739,
    "text": " Okay, a lot to say there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2507.759,
    "end": 2522.831,
    "text": "I think I'll just sort of retouch on a few points because they're great and bear reflecting upon and also because they're some of the core nodes in the active inference",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2524.895,
    "end": 2527.116,
    "text": " contextualizing and implications.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2527.736,
    "end": 2529.377,
    "text": "So existence is uncertain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2530.037,
    "end": 2535.399,
    "text": "You said biologically we want certainty relative to our generative model to maintain persistence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2535.979,
    "end": 2538.08,
    "text": "So this ties together like a few key things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2538.12,
    "end": 2542.442,
    "text": "First, the desire for certainty, arising of that desire.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2543.482,
    "end": 2563.236,
    "text": " I added relative degenerative model which is an active inference term like a generative model just like in statistics it's a reduced representation of a complex process that spits out numbers so it's like a generative model of the weather and then you have one model that takes the data and updates the generative model and then you have a generative model that can create",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2564.056,
    "end": 2586.719,
    "text": " expected data and then compare incoming results so that's a key part of the predictive brain the bayesian brain active inference and then to maintain persistence is where it ties in with um identity and with thermodynamic survival so that's kind of on also on that more technical side that's what ties us to like non-equilibrium thermodynamics",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2587.639,
    "end": 2596.525,
    "text": " Now for cultural entities, oh, if we were only a thermobacterium, that uncertainty is tied up with other people.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2597.606,
    "end": 2623.866,
    "text": " so yes we also are dealing with uncertainty about other things too and different people in different situations different phenomena they deal with but across the board it's pretty much other people and so that brings up some active themes like having a shared generative model reflected by a shared narrative so like we don't all have to agree what role in the movie we are but if it's different genre",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2624.841,
    "end": 2626.102,
    "text": " That doesn't even mean it's bad.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2626.543,
    "end": 2629.626,
    "text": "It just means that some people might get surprised if that's what they expect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2630.327,
    "end": 2638.435,
    "text": "And then some other active things we talk about are like ostensive cues, which are used to signal attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2639.035,
    "end": 2643.139,
    "text": "And then the way that we talk about how and where attention is directed",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2644.318,
    "end": 2661.315,
    "text": " that's the regime of attention and so when the music stops after the middle of the orchestra but everybody knows that's not the time to clap what does that say about the culture and about what everyone's attention is and that's how they signal that they're all part of the same listening community for example",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2662.296,
    "end": 2680.464,
    "text": " when they do or don't take the action of clapping so social entities again whether it's just social projects like exchanging value for shoes or whether we're talking about the social meta which is the governance and decision making implicitly and explicitly that's where",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2681.184,
    "end": 2689.49,
    "text": " It's such a great topic, Eugene, that you've brought because it is about that individual micro level decision making and regime of attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2690.05,
    "end": 2700.218,
    "text": "I'm scanning a proposal in my Web3 dashboard, but my literal pupil gazing and my blood sugar is going to be mattering.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2701.621,
    "end": 2712.285,
    "text": " And so how can we really think holistically about the regime of attention and the cues and the affordances and all of that for humans who we're designing for?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2712.305,
    "end": 2714.525,
    "text": "We don't want to be in the matrix pods.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2716.386,
    "end": 2719.287,
    "text": "We want them to have a thriving life, which is going to be different for different people.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2719.707,
    "end": 2722.288,
    "text": "And so it's just such a great nexus that you've brought together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2722.548,
    "end": 2723.088,
    "text": "So any thoughts?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2723.128,
    "end": 2724.669,
    "text": "And then a few more active points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2725.646,
    "end": 2726.246,
    "text": " Oh, yeah, I know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2726.266,
    "end": 2730.268,
    "text": "I love that because that directly also ties into and I love the way you articulated that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2730.288,
    "end": 2731.749,
    "text": "So thank you for running through that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2731.769,
    "end": 2738.892,
    "text": "And I also an element that I that I've been thinking about in the last couple of days that feeds nicely into that in terms of right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2738.932,
    "end": 2744.055,
    "text": "How do our how do our models get updated in terms of some of these social dynamics and the importance of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2744.48,
    "end": 2747.144,
    "text": " exposure as a step to better managing uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2747.164,
    "end": 2752.692,
    "text": "I know as someone who, like I'm not a coder, that was not what my parents showed me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2753.333,
    "end": 2756.939,
    "text": "The process that I went down as a kid, I was not the kind to just figure it out on my own.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2757.338,
    "end": 2760.619,
    "text": " So I still have this weird fear of technology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2760.859,
    "end": 2764.301,
    "text": "Like the first time I need to go do something deeply technical, I'm like, I'm just going to break everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2764.481,
    "end": 2765.461,
    "text": "It's like, it's illogical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2765.501,
    "end": 2766.362,
    "text": "I know it's illogical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2766.642,
    "end": 2768.723,
    "text": "I've done enough to know that it does not make sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2769.063,
    "end": 2771.364,
    "text": "And each time I do it, it feels a little better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2771.424,
    "end": 2779.727,
    "text": "And sort of my internal models get updated by all the, you know, by deciding to direct my attention to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2780.282,
    "end": 2788.44,
    "text": " and understanding the fact that because this is something my existing models don't know how to accurately predict, I'm going to experience a certain amount of discomfort there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2789.963,
    "end": 2797.926,
    "text": " taking the meta-level attention to realize that that's happening is already a great step to being able to work through more and more of that kind of uncertainty and discomfort.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2798.326,
    "end": 2804.548,
    "text": "Because for me, it's whatever the tools are for individuals that are important to have like, hey, are you noticing you're uncomfortable now?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2804.848,
    "end": 2808.29,
    "text": "Great, next time try to like catch it a little earlier and a little earlier and a little earlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2808.33,
    "end": 2816.933,
    "text": "And eventually you'll hopefully start gaining enough of a sense of what series of actions or thoughts leads to an unpleasant state and then being able to modulate certain elements of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2817.353,
    "end": 2839.743,
    "text": " right so again there's also the the other dimension of this of privilege right i've kind of alluded to it a few times but i also never want to be critical about these things because we're all coming from vastly different areas of our lives and i know in times in my life where i was you know living paycheck to paycheck and barely making ends meet it's not possible to focus on these higher order things it's just like i was i was very much struggling with that at those points in time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2840.12,
    "end": 2856.81,
    "text": " Now that I have a little more luxury and comfort, I'm able to spend my free time pondering in a different way, which I think is also very important to recognize when some of us think about financial distribution and paying it forward and sharing in abundance and all those kind of or effective altruism or all these other things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2857.594,
    "end": 2863.417,
    "text": " At the end of the day, we all have so many options to just inject a little bit of positivity for someone else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2863.777,
    "end": 2873.782,
    "text": "And the more that we choose to do that, the more we can potentially free them up to have a little more room in their cycle in a day-to-day to put their attention somewhere where it might not have been going before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2874.382,
    "end": 2875.403,
    "text": "And of course it's,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2876.092,
    "end": 2878.454,
    "text": " it's utopic to think of like, Oh, I see someone struggling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2878.494,
    "end": 2879.475,
    "text": "I do a nice thing for them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2879.535,
    "end": 2879.755,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2879.795,
    "end": 2881.957,
    "text": "They ponder the philosophy of life as right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2881.998,
    "end": 2886.201,
    "text": "Like that's a lovely ideal that probably happens almost never, but like more realistically, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2886.221,
    "end": 2892.007,
    "text": "If we, as a, because we are inherently social because coordination is so at the core of what we do,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2893.345,
    "end": 2899.146,
    "text": " And because there's a lot of systems and other pressures around us telling us who we supposedly are, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2899.226,
    "end": 2904.428,
    "text": "And us trying that, having to navigate of, well, supposedly I'm selfish or I'm collective, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2904.468,
    "end": 2909.209,
    "text": "Depending on which part of the world you're coming from, that could be a core narrative you hear or all these other dimensions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2909.289,
    "end": 2917.551,
    "text": "And all of this just comes back to, in my mind, like uncertainty equals complexity and control in different areas, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2917.591,
    "end": 2917.931,
    "text": "Because.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2919.324,
    "end": 2920.567,
    "text": " life is wild.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2920.707,
    "end": 2926.739,
    "text": "Like I don't even pretend to be able for my brain to be able to grasp the level of complexity and to be able to put it into words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2926.779,
    "end": 2929.305,
    "text": "Cause it's just beyond what I am capable of comprehending.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2929.745,
    "end": 2930.026,
    "text": "But yeah,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2930.925,
    "end": 2931.965,
    "text": " I'm okay with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2932.346,
    "end": 2938.528,
    "text": "And the being okay with that and the desire of control of complexity is a much more dangerous thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2938.568,
    "end": 2943.889,
    "text": "And directly related to that, it might seem like a tangent, but is the idea of like FOMO or fear of missing out, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2943.93,
    "end": 2952.272,
    "text": "It's this control desire of wanting to have like, oh, I know these things and I have to be able to control my schedule so that I can get all these supposed desires out of it, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2952.512,
    "end": 2957.254,
    "text": "And the whole idea of knowing yourself and how to really know yourself is a whole separate thread I'm not going to go down in a moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2957.654,
    "end": 2959.675,
    "text": "But I recently heard the term JOMO,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2960.424,
    "end": 2964.03,
    "text": " And not just to give more whatever terms, but like the whole idea of joy of missing out, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2964.09,
    "end": 2973.726,
    "text": "To know that, hey, if I'm choosing to be here with you right now doing this, sure, in the back of my mind, I can cycle through all of the things I chose not to do as a result of this and I'm missing out on in this window.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2974.409,
    "end": 2977.892,
    "text": " Or I could just be like, no, I'm super freaking lucky that you asked me to be here with you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2978.213,
    "end": 2981.215,
    "text": "And we now get to share this experience and whoever hears it gets to hear it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2981.596,
    "end": 2983.217,
    "text": "And boom, I've focused all of my attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2983.237,
    "end": 3000.853,
    "text": "I don't have to worry about adding all of those other things, which in turn, right, the whole idea of fear of missing out and being always worried and wanting to like control these other factors where it just leads to this place where you are stealing your own attention from yourself away from the things that on your deathbed you might be realized were the most important to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3001.189,
    "end": 3010.053,
    "text": " And this is also to take another side step, why, in my opinion, meditating on death is very important, because that's one of the few things that can help you realize of like, oh, this was literally the last second.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3010.093,
    "end": 3011.774,
    "text": "How do I feel about everything that got here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3012.034,
    "end": 3017.917,
    "text": "Like, that's one of the only ways, in my opinion, you can like deeply understand how truly satisfied are you with the suite of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3018.517,
    "end": 3020.298,
    "text": " activities you choose to fill your time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3020.418,
    "end": 3023.32,
    "text": "Because a lot of us have, we are shackled by things we have to deal with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3023.4,
    "end": 3027.202,
    "text": "And that is a different set of thinking and emotional judgment that should go to that direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3027.502,
    "end": 3037.068,
    "text": "If you are hyper privileged and not happy with how you're spending your time, you deserve a very different conversation than someone who, you know, is barely making ends meet, putting food on the table for a family of three or whatever, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3037.308,
    "end": 3042.571,
    "text": "Like, we also have to be realistic with ourselves and know how harsh we should or should not be with ourselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3042.831,
    "end": 3048.054,
    "text": "So I'm happy to go into more like some of my own personal psychological tools on that side, but I don't want to just keep rambling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3050.182,
    "end": 3054.748,
    "text": " Well, this is already quite a unique and different discussion on ACT-INF.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3054.808,
    "end": 3055.749,
    "text": "It's really interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3056.009,
    "end": 3057.19,
    "text": "So a few thoughts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3059.093,
    "end": 3061.175,
    "text": "Uncertainty is the core of decentralization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3061.335,
    "end": 3062.677,
    "text": "That's what you had brought up earlier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3062.837,
    "end": 3065.741,
    "text": "And then you connected that to treating each other nicely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3066.502,
    "end": 3069.806,
    "text": "So it's up to us on the edge to act, infer and serve.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3071.294,
    "end": 3072.596,
    "text": " the way that we expect and prefer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3072.716,
    "end": 3076.381,
    "text": "It signals to ourselves, not the least of all, what kind of person we are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3076.501,
    "end": 3081.868,
    "text": "Like, are you the kind of person where when the NFT is worth 100, you give five away?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3082.769,
    "end": 3085.953,
    "text": "Or are you stressed about 130?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3086.434,
    "end": 3088.376,
    "text": "Because it could be higher, because it's a number.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3089.017,
    "end": 3089.317,
    "text": "So it's like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3090.18,
    "end": 3102.47,
    "text": " if we are gonna have that different system with decentralization, it will be not just like part of the picture that people are nice to each other on the edges, that will be the system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3103.071,
    "end": 3105.192,
    "text": "So either we're not in that world or we are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3105.212,
    "end": 3115.26,
    "text": "And so expecting that somebody else is going to redistribute our centralized taxes to do that is at the very least emboldening that system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3116.041,
    "end": 3119.164,
    "text": "And then also it signals to others what kind of people they are",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3120.427,
    "end": 3148.793,
    "text": " expecting to see if you pull 10 red and one blue out of an urn bayesian statistics works a certain way to update priors it could be very tight precision or very loose precision but at some point you're going to be like are there more of this one kind than the other kind and so that's related to statistics but also the way that our brain bayesian brain predictive brain uses things like statistics and that includes our cognitive",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3150.486,
    "end": 3155.129,
    "text": " biases as they say, but of course to bias is to take signal out of the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3155.63,
    "end": 3156.971,
    "text": "So what will those signals be?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3157.391,
    "end": 3169.079,
    "text": "And then also when we provide people with material support, you're bringing it back to like, again, it's not just a solipsistic single trajectory optimizing strategy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3169.84,
    "end": 3175.864,
    "text": "There's like a level of strategy where it's not like the individual must lose because the group has benefited.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3176.444,
    "end": 3178.106,
    "text": "It's like, it's an ensemble.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3178.951,
    "end": 3200.912,
    "text": " and one's agency and their perception and action their peripersonal space has a certain spatial and temporal scale and if one doesn't care about leaving the future a wasteland then we can talk about that in this model with their expectations and preferences maybe they have other reasons to think that way but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3202.162,
    "end": 3203.023,
    "text": " there's a lot there too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3203.583,
    "end": 3203.723,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3203.743,
    "end": 3203.943,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3204.044,
    "end": 3214.252,
    "text": "No, I mean, just to start at the end there, I mean, the thing that, that I think about a lot in that sense is I wish that, and I'm just taking Forbes because I believe Forbes or Bloomberg, whoever does the billionaires list, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3214.993,
    "end": 3221.758,
    "text": "I wish instead of doing the list of here's the people with the most wealth in their bank account or that they can just claim their name as directly affiliated with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3221.798,
    "end": 3222.319,
    "text": "We tracked,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3223.069,
    "end": 3224.791,
    "text": " who's created the most jobs in the last year?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3225.131,
    "end": 3227.754,
    "text": "Who's actually distributed the most wealth on the planet?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3227.834,
    "end": 3239.766,
    "text": "Like how many people get to put food on the table that they didn't afford if it wasn't for someone else or some kind of other metrics that can be deemed socially impressive that actually reside on the,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3240.185,
    "end": 3243.669,
    "text": " the social dimension and not just thinking of us as individuals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3243.749,
    "end": 3252.558,
    "text": "I don't want to take us more off the pathway with just like the history and wealth and whatnot in the States and any questions around that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3252.838,
    "end": 3253.659,
    "text": "But for me, it does",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3255.25,
    "end": 3274.67,
    "text": " I know one piece of research that I really appreciate in this direction is the, oh, I'm forgetting all of their names, but the group in Siberia, far out in Russia, that starting in the 70s, if not the 80s, did the training of the Arctic foxes to see how quickly, right, and Arctic foxes are notoriously not friendly or pleasant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3275.471,
    "end": 3277.673,
    "text": "How quickly can they get them to be fully domesticated?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3278.363,
    "end": 3282.085,
    "text": " And I believe it was within 10 generations, if I'm remembering correctly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3282.125,
    "end": 3291.969,
    "text": "But roughly at the time, this is still when, I mean, especially in the Soviet Union, where science was complicated for a variety of reasons, especially anything that had social implications to it and not just pure math or physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3293.469,
    "end": 3305.854,
    "text": "But there were not many people at the time who truly thought, yes, you can domesticate a wild animal shortly because there was still much more of the, you know, on the human level of we're just rigid creatures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3305.894,
    "end": 3306.715,
    "text": "We are the way we are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3306.755,
    "end": 3307.395,
    "text": "We don't change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3307.961,
    "end": 3315.165,
    "text": " So all of a sudden that we saw that, hey, no, you can actually very select, very clearly select for certain features that get us there, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3315.185,
    "end": 3318.827,
    "text": "The interesting question for me becomes what were the features, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3318.987,
    "end": 3326.591,
    "text": "What's the thing that you pick generation to generation for selective mating that actually led to a much more domesticated version of the fox?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3326.671,
    "end": 3332.134,
    "text": "Not that domestication is an end goal, but it is one of a few strands of research that is trying to explore",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3332.754,
    "end": 3343.343,
    "text": " on our evolutionary scale, what were the actual features that led to us being such good coordinating creatures up until society and modern civilization kicked in, because then things got much more complicated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3344.673,
    "end": 3348.354,
    "text": " But there's very good reason to believe that it's niceness, it's kindness, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3348.414,
    "end": 3350.095,
    "text": "And like, think about a social dynamic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3350.435,
    "end": 3355.756,
    "text": "Sure, there might be the super strong, macho, whatever, you know, not even trying to gender it, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3355.776,
    "end": 3360.438,
    "text": "There could be the pure, like traditional, like there's the person that can squash everyone else in the system, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3360.698,
    "end": 3362.838,
    "text": "And to think of like, oh, we all have to defer to that person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3363.439,
    "end": 3365.759,
    "text": "But that seems itself to be a social construct, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3365.779,
    "end": 3372.841,
    "text": "If you actually look at what decent amounts of scientific literature are starting to point to, that it is niceness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3373.362,
    "end": 3374.322,
    "text": "And that the more,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3375.359,
    "end": 3379.644,
    "text": " We can try to create a system where that is what is rewarded and encouraged.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3380.024,
    "end": 3382.127,
    "text": "Am I pretending that everyone is going to become nice?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3382.187,
    "end": 3383.528,
    "text": "No, there's always going to be assholes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3383.548,
    "end": 3385.611,
    "text": "Like there's always going to be people who don't want to play well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3386.525,
    "end": 3389.706,
    "text": " I'm just not going to let that stop me from being nice to other people, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3389.726,
    "end": 3394.727,
    "text": "You can either have someone be mean to you and be like, well, why should I bother being nice if they're not going to be nice to me?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3395.187,
    "end": 3396.728,
    "text": "Or I can be like, yeah, people are people, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3396.748,
    "end": 3397.568,
    "text": "Some are just going to suck.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3397.608,
    "end": 3398.508,
    "text": "And that's just how it goes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3398.528,
    "end": 3404.23,
    "text": "Because when you have this much uncertainty, there's no way you can like all of what's in that uncertainty, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3404.27,
    "end": 3411.692,
    "text": "If you can find certain strands of it and just be okay with the complexity of it and find comfort in knowing that I will never solve this riddle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3412.335,
    "end": 3415.198,
    "text": " but I get to be part of just playing around and tinkering with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3415.458,
    "end": 3418.121,
    "text": "Like that alone can be really empowering and exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3418.201,
    "end": 3423.167,
    "text": "So I don't know, for me, I keep trying to reframe niceness as not just like a,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3424.987,
    "end": 3430.011,
    "text": " a either a, you know, a thing that your parents taught you to do, because that's just the thing that they want you to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3430.291,
    "end": 3432.753,
    "text": "Whereas this, you know, it's thing, it's actually socially weak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3432.793,
    "end": 3435.175,
    "text": "And I don't know, I don't buy in any of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3435.215,
    "end": 3442.101,
    "text": "And I as someone who enjoys it, I now enjoys genuinely just being nice to people or when people are nice to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3442.501,
    "end": 3457.582,
    "text": " It's nice to see that there is research coming out to say, hey, hey, there's reasons on a on a neural level why that feels good, but also be on a longer evolutionary scale, why that is the feature set that we should focus on in system design to actually get us collaborating better together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3458.68,
    "end": 3463.402,
    "text": " But that doesn't solve the fact that there's a lot of incentives around not pushing us towards niceness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3463.782,
    "end": 3477.288,
    "text": "And for me, that means if we're trying to create systems where that is a thing we want to optimize towards, but that is in a larger structure where that is not a key priority, that just means we're going to have a tremendous amount of dissonance between those two systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3477.888,
    "end": 3482.59,
    "text": "And if you're trying to fight that good fight, good just in the sense of being kind to each other,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3484.099,
    "end": 3485.06,
    "text": " it's going to suck, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3485.08,
    "end": 3489.263,
    "text": "There's no way it cannot unless all of these systems break down and we build a new.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3489.543,
    "end": 3491.304,
    "text": "And to me, that's a much scarier option.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3491.324,
    "end": 3502.473,
    "text": "Because anything that involves like truly bringing down mass global systems, I don't see how that happens without very intense international affairs that I would personally be okay without seeing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3502.733,
    "end": 3513.421,
    "text": "So I think that you just have to be, unless you truly want World War III and near extinction, and then we rebuild from there, I think the only alternative is we just got to suffer through the fact that it's going to take us a while",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3513.721,
    "end": 3514.923,
    "text": " But we'll get there eventually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3514.963,
    "end": 3516.344,
    "text": "But just be good to people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3516.464,
    "end": 3518.567,
    "text": "And a lot of amazing things can happen from that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3520.489,
    "end": 3521.03,
    "text": "WGMI.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3521.45,
    "end": 3524.794,
    "text": "Well, thanks for bringing that important perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3524.854,
    "end": 3533.023,
    "text": "Sometimes it's easy to get caught up in how many papers are written on active inference and just the rhythm and the micro.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3535.731,
    "end": 3539.093,
    "text": " that's exactly what you're really calling towards.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3539.233,
    "end": 3548.719,
    "text": "So let me bring it back towards some active core terms and like ideas, and let's see where maybe the niceness and some of those ideas come back into play.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3548.779,
    "end": 3553.021,
    "text": "So we already talked about uncertainty being one of the key",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3554.002,
    "end": 3579.752,
    "text": " factors and that not being like a hot take or contrary an opinion it's like a de facto understanding that what is happening from a sensory perspective is not mere signal processing and filtering and the way that a one directional neural network processes sense but actually like an active generative process that's compared to incoming scarce data that's why we like don't have a blind spot in our eyes and things like that so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3580.552,
    "end": 3596.327,
    "text": " that is not contentious it is a core piece of active inference however now in active inference there's action amidst uncertainty and so that's a lot like the action perception loop or the OODA loop for those who are familiar with it and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3597.62,
    "end": 3604.283,
    "text": " Every single cycle, every crank that's run, inference and action are co-occurring.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3605.223,
    "end": 3607.884,
    "text": "And so there's a few angles to that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3608.164,
    "end": 3615.567,
    "text": "First is that we never make a system where we're expecting to do something that it's not enabled to do or vice versa.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3615.927,
    "end": 3622.27,
    "text": "So even just qualitatively before the computers come out, this helps think about how subunits are connected.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3622.53,
    "end": 3626.692,
    "text": "Like if the forager ant is waiting for the interaction from the nurse ant,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3627.412,
    "end": 3631.374,
    "text": " but the nurse aunt doesn't have that affordance, there's a missing piece in the system's design.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3631.954,
    "end": 3646.742,
    "text": "And so, yes, it is going to be a whole other level of emergence with fine-tuning that interaction, but just at the level of thinking about what the entities and their connections are and how they influence the niche, Active reminds us that action and perception are integrated at that level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3647.503,
    "end": 3654.607,
    "text": "Also not unique to Active Inference, very similar to any kind of cybernetic or agent-based modeling framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3655.475,
    "end": 3666.597,
    "text": " But what is different is the way that we can talk about different types of uncertainty and even things like multi-scale uncertainty, or for example, uncertainty about events.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3667.177,
    "end": 3669.298,
    "text": "And there's other talks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3669.338,
    "end": 3677.879,
    "text": "I hope people go down the rabbit hole 101 ways because we've talked a lot about different uncertainty formalisms on ActifLab.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3678.079,
    "end": 3680.26,
    "text": "And I hope there's a lot more developed on those areas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3680.7,
    "end": 3681.74,
    "text": "But just to say that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3682.717,
    "end": 3700.792,
    "text": " Again, one could imagine like using that earlier example of being in a movie in a genre, you could have high precision on the genre, but then maximum uncertainty about what is going to occur next in that, like a thriller with a stereotypical in culture set of music and lights and all of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3701.553,
    "end": 3703.995,
    "text": "Or you could know exactly what was happening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3704.055,
    "end": 3710.541,
    "text": "Oh, it's just counting down the numbers one after another with high precision, but not understand the narrative component.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3711.241,
    "end": 3721.508,
    "text": " So I think to connect it to web, whatever, and systems design, what is it that we want to reduce our uncertainty on?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3722.368,
    "end": 3736.497,
    "text": "And how can we really bring our attention to the types of uncertainty that matter for humans' affect, for how we feel in our phenomenology, and the system uncertainty nodes?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3737.158,
    "end": 3739.799,
    "text": "Like if the block arrival time starts getting too wild,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3740.76,
    "end": 3759.13,
    "text": " we don't want that to go off the rail that's like a technical use of uncertainty minimization and control but then this embodied perspective on humans as active agents brings the human level of uncertainty in and not everybody wants to be on a live stream not everybody even wants to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3760.251,
    "end": 3789.837,
    "text": " have a say on a decision-making proposal but how could we reduce their uncertainty about what they do expect and prefer and customize that and i think that's where cognitive frameworks like active could come into play yeah i mean that's one where i guess it's also important to note that i don't know if the quote-unquote average person in web 3 and i have no clue what that even means but if if if you pulled you know there's going to be eat denver next month i would actually",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3790.407,
    "end": 3793.07,
    "text": " This would be a fun study to run if I had the time and energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3793.411,
    "end": 3798.036,
    "text": "But you ask 10,000-ish people or whatever absurd amount of people are flocking to Denver for this conference,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3799.712,
    "end": 3801.312,
    "text": " what term is at the core of Web3?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3801.332,
    "end": 3808.334,
    "text": "And I actually wonder how many of them would put uncertainty and how many people would tell me I'm a madman for thinking that that's a core of decentralization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3808.734,
    "end": 3814.195,
    "text": "Because I think that a lot of what I hear at least is the idea of, oh, we're adding an automated trust layer, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3814.235,
    "end": 3816.075,
    "text": "So that's actually minimizing uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3816.135,
    "end": 3816.855,
    "text": "What are you talking about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3816.875,
    "end": 3817.695,
    "text": "We're adding uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3817.715,
    "end": 3820.356,
    "text": "We're trying to, you don't have to trust in people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3820.396,
    "end": 3821.436,
    "text": "You can trust in systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3821.456,
    "end": 3823.776,
    "text": "You know, you don't have to trust in a banker at someone at J.P.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3823.796,
    "end": 3824.156,
    "text": "Morgan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3824.416,
    "end": 3825.857,
    "text": "You can trust the protocol instead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3825.897,
    "end": 3826.757,
    "text": "And then, you know, it's all great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3828.288,
    "end": 3840.781,
    "text": " But I mean, I think that goes back to some of the other aspects we were talking about on what level and what part of the system, because if you're actually talking on technical architecture, yes, you could just have less humans needing to interact at a certain point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3841.022,
    "end": 3845.727,
    "text": "But if then you're talking the complete set of full human interactions using that protocol,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3847.288,
    "end": 3853.175,
    "text": " A few years ago, there was the debate on what's more relevant for blockchains, off-chain governance or on-chain governance?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3853.315,
    "end": 3859.542,
    "text": "Can you automate things that it's a quick yay or nay and it's all automatable and it's all interacted purely through code?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3859.782,
    "end": 3861.444,
    "text": "Or do you need humans talking to each other?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3862.427,
    "end": 3866.068,
    "text": " And I feel like there are some, you know, like an interest rate going up or down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3866.109,
    "end": 3866.429,
    "text": "Yeah, sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3866.449,
    "end": 3868.509,
    "text": "Those things might be on-chain governance oriented.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3868.87,
    "end": 3873.691,
    "text": "Anything that actually involves more complex questions or even more complicated, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3873.731,
    "end": 3879.274,
    "text": "With the distinction being that complicated is still modelable, complex has emergent behavior, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3879.354,
    "end": 3886.877,
    "text": "Even with complicated things that could already kind of get challenging in terms of just getting humans to agree on things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3886.937,
    "end": 3887.597,
    "text": "So, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3888.622,
    "end": 3895.784,
    "text": " I am not a big proponent of the goal of all of this being humans have to decide less.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3895.844,
    "end": 3900.705,
    "text": "I think that, yes, it's always great to, you know, do we, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3900.725,
    "end": 3904.306,
    "text": "There's a few aspects here of which I am myself uncertain about, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3904.346,
    "end": 3909.448,
    "text": "There's almost an unstoppable force that is more technology, advancements of technology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3909.828,
    "end": 3913.529,
    "text": "Automation, to a certain degree, is happening to the world, to us, whether or not we like it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3914.073,
    "end": 3916.035,
    "text": " Um, the question is, what are we trying to automate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3916.075,
    "end": 3918.056,
    "text": "And I feel like that's still very much an open question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3918.777,
    "end": 3921.259,
    "text": "And I, I am, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3923.281,
    "end": 3925.763,
    "text": "The, let me see the best way to move this forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3925.783,
    "end": 3931.147,
    "text": "I think at its core, I've heard one thing, the idea of it's coordination all the way down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3931.628,
    "end": 3931.848,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3932.088,
    "end": 3940.535,
    "text": "In the crypto space or web three space, whatever that at the end of the day, what is the most base thing that human, that as a species we are doing, we are coordinating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3940.851,
    "end": 3940.991,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3941.011,
    "end": 3950.776,
    "text": "Because if we're already taking for given that we exist, there's many of us here and we have desires, then we have to ask of like, oh, well, how did we get here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3951.036,
    "end": 3957.34,
    "text": "But it seems that coordination was a very key part of differentiating us from some of our other ancestors down the line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3957.76,
    "end": 3958.2,
    "text": "And so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3960.281,
    "end": 3962.883,
    "text": "For me, coordinating is inherently uncertain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3964.212,
    "end": 3972.797,
    "text": " People being people together is an inherently uncertain task because unless you heavily constrain and force people to be less themselves, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3972.817,
    "end": 3977.28,
    "text": "If you're telling someone, don't be yourself, be this thing I want you to be, then you're minimizing uncertainty, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3977.3,
    "end": 3978.6,
    "text": "You're telling like, I don't want Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3978.66,
    "end": 3981.082,
    "text": "I want a version of Daniel that I would like to see, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3981.102,
    "end": 3982.403,
    "text": "That is minimizing uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3983.832,
    "end": 3988.375,
    "text": " The whole idea of seeing people for who they are and where they're at, that's adding complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3988.415,
    "end": 3989.836,
    "text": "That's adding uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3989.876,
    "end": 3991.958,
    "text": "That's saying, I don't need to know where you're at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3992.278,
    "end": 3995.98,
    "text": "I just need to recognize the fact that I will never know where you're at because I'm a different human.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3996.02,
    "end": 3997.441,
    "text": "I have a different lived experience than you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3997.782,
    "end": 4004.686,
    "text": "All I can do is, with my limited abilities, try to project and understand what's going on with you and use a mix of empathy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4005.067,
    "end": 4006.308,
    "text": "Can I just feel those emotions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4006.408,
    "end": 4009.67,
    "text": "And compassion, can I rationalize that feeling and do something about it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4010.07,
    "end": 4012.832,
    "text": "And for me, compassion is much more important than empathy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4013.208,
    "end": 4021.01,
    "text": " Because empathy is deep and psychologically taxing and very limiting in terms of the amount of people we can direct it towards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4021.431,
    "end": 4032.634,
    "text": "Compassion, and I just finished Rutger Bregman's Human Kind book, right, where he, and it's not as though it's his idea, but the whole idea of rational compassion being much more of a scalable concept than pure empathy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4033.137,
    "end": 4037.238,
    "text": " Because if you try to empathize with all people on the planet, that's just not going to work in any way possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4037.738,
    "end": 4054.622,
    "text": "Rational empathy can be something that we utilize as a more focused, rational compassion, excuse me, can be more of a tool in our tool belt to not just fall into tribal camps, but to try to actually think of how can I see your pain as a person who is totally different than me in every way, shape or form as our pain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4055.002,
    "end": 4057.863,
    "text": "And that kind of reframing is a very, very powerful thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4058.888,
    "end": 4066.131,
    "text": " But I also want to jump back to what you started with, because I know it's a given in certain circles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4066.171,
    "end": 4074.674,
    "text": "But for me, that's actually part of the problem, where you were talking about the whole idea that we don't know our realities, our brains are prediction machines, all these.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4076.175,
    "end": 4077.235,
    "text": "You mentioned the blind spot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4077.295,
    "end": 4078.055,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4078.096,
    "end": 4085.919,
    "text": "Do most people realize that we literally have a blind spot in our vision, and the only reason we still think we always see things is because our brains predict over it effectively?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4087.395,
    "end": 4090.516,
    "text": " I wonder if you came up to a person on the street and you're like, hey, look around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4091.077,
    "end": 4092.357,
    "text": "That's not objective reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4092.858,
    "end": 4095.099,
    "text": "Would they tell you that you're on drugs and crazy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4095.259,
    "end": 4097.76,
    "text": "Or would they be like, yes, yes, let's have a scientific dialogue, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4097.94,
    "end": 4102.482,
    "text": "And I, excuse me for the previous statement, but like, it's the point being there, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4102.862,
    "end": 4103.903,
    "text": "People don't react kindly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4103.923,
    "end": 4107.804,
    "text": "At least I've had that reaction a lot of the time, even with well-educated people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4108.084,
    "end": 4110.245,
    "text": "So it's not a pure education perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4110.686,
    "end": 4115.788,
    "text": "And for me, getting people, like that comes back to people embracing uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4116.5,
    "end": 4121.384,
    "text": " How do we encourage people to recognize that I fundamentally don't know anything about anything?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4122.225,
    "end": 4128.57,
    "text": "Hopefully, through education and a lot of intention about my attention, I will try to learn a few things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4128.97,
    "end": 4132.073,
    "text": "But in the grand scheme of collective knowledge, I will never know anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4132.694,
    "end": 4134.515,
    "text": " And like, that's a weird thing to admit to myself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4134.735,
    "end": 4141.34,
    "text": "Like as much as I really try hard, I can hopefully learn some concepts and frameworks that broadly apply to whatever environments I find myself in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4141.94,
    "end": 4148.524,
    "text": "But in the grand scheme of information, even if you have photographic memory, you practically know nothing just because there's so, so much of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4149.205,
    "end": 4149.345,
    "text": "And.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4149.844,
    "end": 4152.185,
    "text": " I don't know, for me, that's also been more of a liberating thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4152.205,
    "end": 4156.167,
    "text": "Whereas when I was younger, it was always a very fear based like, oh, no, that just means work harder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4156.467,
    "end": 4158.648,
    "text": "Whereas now it's like, no, just embrace the uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4159.209,
    "end": 4162.81,
    "text": "Embrace the washing over of I will never do everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4162.87,
    "end": 4167.633,
    "text": "So just be intentional about your attention and what you do want to do and make the most out of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4168.093,
    "end": 4170.814,
    "text": "So I feel like I went on a hard tangent on that one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4170.854,
    "end": 4172.175,
    "text": "That just felt important to call out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4172.857,
    "end": 4175.12,
    "text": " I have some points directly to this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4175.2,
    "end": 4177.302,
    "text": "So thanks for sharing it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4177.342,
    "end": 4192.378,
    "text": "So yes, there are niches on the internet or in real life where it is a beginning point that the brain is a predictive entity or at least could be modeled like that, which we...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4193.499,
    "end": 4200.868,
    "text": " discusses the difference between instrumentalism, are we just applying statistical models and we're just making no claims to the territory?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4201.249,
    "end": 4202.45,
    "text": "We're just talking about maps.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4202.53,
    "end": 4203.511,
    "text": "We're like cartographers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4204.713,
    "end": 4209.219,
    "text": "Or are we making ontological statements like the brain does active inference?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4210.219,
    "end": 4215.921,
    "text": " Realism, instrumentalism is like, I find it useful to study the brain using this model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4216.281,
    "end": 4220.403,
    "text": "So if someone used a linear regression, they wouldn't say the brain was a linear regressor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4221.003,
    "end": 4223.604,
    "text": "We're doing that with instrumentalism for actinth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4224.324,
    "end": 4225.224,
    "text": "Also there's realism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4225.404,
    "end": 4238.449,
    "text": "So that's like one point to make, but you pointed like how some people resist that sense of realigning their generative model to this idea that we are,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4239.309,
    "end": 4240.49,
    "text": " experiencing our generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4241.09,
    "end": 4242.37,
    "text": "So I think there's a few pieces.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4243.611,
    "end": 4246.292,
    "text": "The meta is we've all been wrong before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4247.193,
    "end": 4248.953,
    "text": "We've been convinced on something and been wrong.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4249.014,
    "end": 4260.219,
    "text": "So your emotional conscious experience, which is only the tiniest fraction of the iceberg, just simply can be incorrect by virtue of the way you've had interactions in the past.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4262.051,
    "end": 4264.452,
    "text": " So it doesn't need to be framed as right or wrong.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4265.032,
    "end": 4271.175,
    "text": "There's some useful components to thinking about the brain as a predictive machine, and it gives us unique predictions and explanations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4271.595,
    "end": 4274.936,
    "text": "So for people who enjoy those features, this is a useful way to think about the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4275.656,
    "end": 4279.398,
    "text": "So one example is like vision, where the anatomy of the eye",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4281.229,
    "end": 4284.551,
    "text": " is clear that there's a blind spot that's off on the side.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4284.611,
    "end": 4287.313,
    "text": "And also there's different resolution and color perception across the eye.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4287.893,
    "end": 4290.635,
    "text": "So we're perceiving with our mind, not our eye.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4291.135,
    "end": 4294.658,
    "text": "But of course, input to the retina and light activation matters.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4295.318,
    "end": 4299.801,
    "text": "It just turns out that there's a lot more of an actively updating process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4300.421,
    "end": 4306.365,
    "text": "And it turns out that's the one that we're perceiving without the blind spot rather than the incoming sensory data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4307.086,
    "end": 4309.727,
    "text": "And that also applies to our other sensory features.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4310.808,
    "end": 4337.196,
    "text": " what's cool and closes the loop between individual decision making and behavior and like science as a human endeavor is that it turns out that in order to get good information about that generative model one has to do informed sampling like our eyes are circadian around we don't perceive that so that's another example of why we're perceiving the stable version of vision which is not being received by any sensor and it",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4337.916,
    "end": 4357.277,
    "text": " secades around the vision to reduce uncertainty goes where there is visual uncertainty and so that generative model isn't just like a sort of one frame per second of what is predicted to be there it also carries like extra information like where are you uncertain in your visual field um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4359.181,
    "end": 4365.282,
    "text": " So that is like the process of being a scientist where you're getting experimental observations, but then there's a system you didn't observe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4365.822,
    "end": 4374.344,
    "text": "Sometimes you destroy the cell to measure it, or you have to kill the animal or whatever it is, but there's observations and then there's the hidden system state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4374.704,
    "end": 4386.086,
    "text": "And it turns out that that maps onto a lot of statistical models like the partially observable Markov decision processes, which integrate that separation between observation and hidden state inference",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4387.153,
    "end": 4389.614,
    "text": " in the context of action selection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4390.134,
    "end": 4392.275,
    "text": "So that's kind of the family that active inference is in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4392.796,
    "end": 4400.339,
    "text": "And then just the second point was about the empathy and complex online systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4401.099,
    "end": 4404.161,
    "text": "And another active inference term is this thinking through other minds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4404.741,
    "end": 4407.983,
    "text": "So it's related to theory of mind, just like it sounds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4409.003,
    "end": 4436.871,
    "text": " and it's referring to when one's uh counterfactuals or their cognition is based upon how they expect something will be evaluated by others like i will do x with my clothing or speech this could be implicit or an explicit uh self-talk because others will see me this way because my partner will see me this way or because my dao will see me this way so that helps us",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4437.851,
    "end": 4465.331,
    "text": " get a handle on complex social cognition if we can have models of cognitive entities that can engage in reflection and have anxiety and then um that's where roles in complex systems might come into play so you said that roles reduce uncertainty um i agree sometimes they reduce uncertainty about one node but then they expand it like you're gonna be the saxophone soloist",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4466.229,
    "end": 4469.011,
    "text": " and I'm looking forward to how you improvise then.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4469.852,
    "end": 4473.755,
    "text": "So it's like, we reduce the group's uncertainty, who's gonna be the soloist?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4473.815,
    "end": 4478.82,
    "text": "But then that's what opens up the certainty distribution in another way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4479.28,
    "end": 4480.521,
    "text": "Or like, we're playing chess.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4480.981,
    "end": 4483.323,
    "text": "Well, you can have brilliant games of chess,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4484.344,
    "end": 4502.531,
    "text": " because there's constraint and there's like roles and but if if people were always mutating the games of chess there wouldn't be as many classic games because like the structure would just be a lot more superficial and so roles might be able to help us reduce uncertainty about certain features",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4503.447,
    "end": 4506.108,
    "text": " And then humanize because, oh, they're a learner in this meeting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4506.888,
    "end": 4507.268,
    "text": "Amazing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4507.988,
    "end": 4509.288,
    "text": "Citizen science is so great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4509.308,
    "end": 4512.469,
    "text": "I love working with people who are just learning about research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4513.169,
    "end": 4515.069,
    "text": "And then everyone can feel included in that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4515.149,
    "end": 4522.791,
    "text": "Even if it takes them 15 years to learn linear algebra in that one meeting, it could be very okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4522.891,
    "end": 4525.132,
    "text": "And nobody would be getting graded, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4526.932,
    "end": 4527.052,
    "text": "Yeah."
  },
  {
    "start": 4527.912,
    "end": 4531.913,
    "text": "And I think that especially the last element that you were talking about there,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4532.335,
    "end": 4547.73,
    "text": " I think it's important to stress the difference between embracing uncertainty and maximizing for uncertainty, because I feel as though people might unintentionally hear the idea of embracing uncertainty as that is an implication that more uncertainty is always a good thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4549.012,
    "end": 4555.478,
    "text": "Where I actually think when you're designing a system, if you want people to flourish, giving them too much uncertainty is a debilitating factor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4555.871,
    "end": 4563.736,
    "text": " So there's the system design component from the actual function of the system, and then there's the cultural psychological component around it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4564.216,
    "end": 4573.562,
    "text": "And on the cultural psychological component, that's where, as a designer of a system or community or company or whatever, you think of how you set that cultural tone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4573.742,
    "end": 4579.686,
    "text": "And you, by interacting with people in various ways that you do in your organization,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4580.669,
    "end": 4589.737,
    "text": " you set a certain tone of, are you embracing uncertainty or do you always want to, especially if you're the leader in your organization, do you need to show this facade of like, no, I'm always certain on everything, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4589.757,
    "end": 4594.301,
    "text": "Because that actually sets a cultural tone of it's okay to be fakely certain, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4594.321,
    "end": 4595.922,
    "text": "Like there's no way you're certain about everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4595.962,
    "end": 4603.969,
    "text": "I think every leader is inherently uncertain about things because just of how many options there are, but you also need to know when to be okay with that uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4604.009,
    "end": 4607.952,
    "text": "And in spite of it to still be like, no, we're doing this one thing and that's the direction we're headed in, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4607.972,
    "end": 4608.773,
    "text": "And like, that's its own,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4609.606,
    "end": 4610.928,
    "text": " its own interesting aspect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4611.308,
    "end": 4627.344,
    "text": "But I think that when it comes to designing any system, whether it's web three, crypto, whatever you're, you know, you're carving out an internship for someone like whatever it is, but creating constraints, and a sandbox is very important for people's comfort level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4627.724,
    "end": 4632.089,
    "text": "So I think the way I like to think of it is the amount of constraints need to be greater",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4633.044,
    "end": 4638.429,
    "text": " while people are newer to things, and the more they're exposed to it, potentially, the more you can open up for them, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4638.51,
    "end": 4642.073,
    "text": "Again, not everyone is going to be, not everyone thrives in having uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4642.413,
    "end": 4645.396,
    "text": "Some people need their hand held through it, and then they can start thriving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4645.837,
    "end": 4657.068,
    "text": "Some people, at least I, right, I don't have enough evidence over a long enough time period to know, but there are some people for whom adding uncertainty, just everything collapses and crumbles around them, and like their role in the system just cannot proceed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4657.643,
    "end": 4664.648,
    "text": " And like, if you're building, right, you can think of DAOs as these fantastic new futuristic, these are employment opportunities for people, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4664.668,
    "end": 4669.471,
    "text": "Like people need to buy food and they get it now from decentralized ecosystems in some capacity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4669.831,
    "end": 4675.415,
    "text": "So, right, you can't, this is where I actually, I still am unclear on how I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4675.435,
    "end": 4678.296,
    "text": "Because if you go to a lot of these communities and you're like, oh, how do I get started?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4678.697,
    "end": 4679.237,
    "text": "Just do stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4679.717,
    "end": 4681.739,
    "text": "And that's great for the privilege, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4681.799,
    "end": 4683.92,
    "text": "What happens when someone's like, well, I hate my job.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4683.94,
    "end": 4685.141,
    "text": "I think I can help you here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4686.297,
    "end": 4691.639,
    "text": " I want to help out, but I need you to like help me help you out because how else am I going to pay for my kids' food tomorrow?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4692.279,
    "end": 4701.643,
    "text": "And I can't make a change in my ecosystem and I can't just spend, I don't know how many hours your listeners have spent trying to get onboarded into various DAOs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4702.043,
    "end": 4703.624,
    "text": "It can be a painful experience, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4703.884,
    "end": 4708.626,
    "text": "A lot of these groups were started by a bunch of brilliant people who come together and it's other brilliant people who get pulled in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4709.006,
    "end": 4713.028,
    "text": "And then all of a sudden when it's, well, what's the ramp way for someone who has no clue what the heck is going on here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4713.508,
    "end": 4714.55,
    "text": " That was an afterthought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4714.59,
    "end": 4718.535,
    "text": "And that was kind of produced after the fact when someone complained about it or once we had enough time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4719.015,
    "end": 4729.769,
    "text": "And so, yeah, uncertainty is this fascinating concept because you have to know when adding more of it is a good thing versus when adding it is a bad thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4730.544,
    "end": 4738.328,
    "text": " And you have to know from a system design perspective, where do you culturally embrace it versus where do you actively try to get rid of it at all costs?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4738.388,
    "end": 4743.971,
    "text": "Because that's, what's going to help your team thrive and you can still embrace it and want to get rid of it in certain areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4744.011,
    "end": 4745.992,
    "text": "Like those are not inherently contradictory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4746.452,
    "end": 4756.015,
    "text": " You could be like, I don't know what the next year holds from the market, but in this specific function of operations, I'm going to hyper control this in every possible way so that I know the outcome of high probability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4756.235,
    "end": 4757.576,
    "text": "Think of anyone in a supply chain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4757.776,
    "end": 4761.097,
    "text": "If they tell you where they know what's happening with the resources three years from now,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4761.397,
    "end": 4761.778,
    "text": " They're lying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4761.858,
    "end": 4763.56,
    "text": "No one knows what's happening three years from now, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4763.8,
    "end": 4765.842,
    "text": "But they could model it better than someone else, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4765.862,
    "end": 4772.109,
    "text": "But in their actual supply chain, they could control that fabricated room so that they literally know every speck of dust in the air, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4772.209,
    "end": 4777.215,
    "text": "And that might be worth mitigating uncertainty there while still embracing it in the longer term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4778.746,
    "end": 4802.211,
    "text": " okay few points first inactive inference where we put action on an important grounding with other kinds of inference processes it's not just uncertainty about the outside world which of course it's easy to spiral on it's actually also uncertainty about our action so huddle i have high precision on my action policy with respect to btc no matter what",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4803.359,
    "end": 4826.19,
    "text": " color on that site that day so that helps uncouple and put space between or it's staked it's locked or it's a multi-sig so that can offload individual level uncertainty and anxiety onto programmatic systems so then the certainty in systems design so i don't remember who initially told me this anecdote but like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4827.625,
    "end": 4833.91,
    "text": " The people who we today call politicians will say things like, we're not going to sleep until this happens and it will happen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4834.711,
    "end": 4839.054,
    "text": "But no one says, it's so important the bridge be designed properly that we're not going to sleep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4840.43,
    "end": 4841.912,
    "text": " It's a serious issue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4842.272,
    "end": 4843.393,
    "text": "Yes, lives are on the line.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4843.413,
    "end": 4844.154,
    "text": "We're building a bridge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4844.874,
    "end": 4845.915,
    "text": "So how do we do it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4846.696,
    "end": 4853.042,
    "text": "We have bridge management and design and processes around making sure that it actually works.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4853.483,
    "end": 4863.653,
    "text": "So as governance becomes less about the virtue signal of we're not going to sleep until we figure this out and more about we're actually doing systems engineering,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4864.98,
    "end": 4868.722,
    "text": " we can treat it more like the bridge and say, yeah, oh yeah, we're all here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4868.862,
    "end": 4873.965,
    "text": "We direct the regime because we care about the people on the bridge and that's why we're doing it this way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4874.665,
    "end": 4879.167,
    "text": "And so that will be a huge difference than just who can signal loudest.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4879.707,
    "end": 4880.468,
    "text": "And then just one other,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4881.647,
    "end": 4899.405,
    "text": " point was like research to bring this back to decentralized science and research is a multi-year task like i've been doing entomology insect biology and insect genetics for 10 years and i'm only beginning in this area",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4900.35,
    "end": 4903.212,
    "text": " So it's cool to be excited about many areas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4903.252,
    "end": 4908.175,
    "text": "That's why there's always been like complexity and it's awesome to be open-ended and love exploring those areas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4908.615,
    "end": 4917.841,
    "text": "But for research and application, like the cutting edge, it is a multi-year upskilling, reskilling process if you're not on the cutting edge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4918.462,
    "end": 4922.424,
    "text": "And on the cutting edge, it's just continually that, plus sometimes even more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4923.085,
    "end": 4925.907,
    "text": "So being okay with all of that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4926.627,
    "end": 4940.584,
    "text": " And then just recognizing that it's a multi-year process and whatever mechanisms for whomever and when and however, we need something that's going to not just rapid assemble the bounty team and then do the multi-sig and then leave.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4941.781,
    "end": 4944.823,
    "text": " some people might find those opportunities appealing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4945.624,
    "end": 4956.891,
    "text": "But we need to recognize that a huge amount of this is going to be like multi-year communities and the kinds of relationships and small teams that will only scale if we're all engaged in it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4958.272,
    "end": 4958.432,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4958.792,
    "end": 4965.717,
    "text": "Yeah, that makes me particularly think about two aspects, kind of community size and temporality of change or the time dimensions of change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4966.037,
    "end": 4967.758,
    "text": "And on the community size front,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4969.881,
    "end": 4974.022,
    "text": " And again, this is not an area where I think anyone has the answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4974.142,
    "end": 4978.483,
    "text": "This is just me kind of giving my own views and personal biases here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4978.543,
    "end": 4999.587,
    "text": "But I strongly believe, and especially just exploring what I've been exploring in this world and generally trying to learn in the direction that I've been trying to learn, what I get excited about DAOs is actually providing the digital infrastructure for a super nuanced global landscape of communities of communities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5000.131,
    "end": 5016.182,
    "text": " Where at the end, when it's humans actually organizing and making decisions together actively, or at least most on kind of the consumer end, so to say that those are going to be in tiny pockets and above those pockets will be bigger and bigger communities and points of connection that are more global and bring them all together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5016.583,
    "end": 5016.763,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5016.823,
    "end": 5022.927,
    "text": "The whole idea of say for something like a supply chain, how can you have a system that you have the global benefits, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5023.828,
    "end": 5025.189,
    "text": "For consumers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5026.209,
    "end": 5029.793,
    "text": " It would be great if Amazon covered all of the global distribution, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5030.133,
    "end": 5034.257,
    "text": "For the people working in those factories, it would not be great for that and possibly for our planet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5034.317,
    "end": 5035.819,
    "text": "I don't know on their global footprint well enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5036.119,
    "end": 5044.067,
    "text": "But right there is this idea of how can we get to a point where we have global efficiency around a variety of topics while still having very localized interaction and nuance?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5044.648,
    "end": 5049.613,
    "text": "And this for me on a very abstract level is why decentralization is important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5050.168,
    "end": 5054.953,
    "text": " because we are currently barreling towards a world of more and more centralization, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5055.073,
    "end": 5061.559,
    "text": "It's the monopolies because, or whatever, I don't want to have pointed terms, but you know, companies tend to have more market share.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5061.599,
    "end": 5067.424,
    "text": "They try to like, their only goal is how do we not just grow the pie, but how do we make the biggest share of the pie hours, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5067.444,
    "end": 5070.127,
    "text": "There's a lot of fundamental incentives that, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5071.65,
    "end": 5073.451,
    "text": " that are not the healthiest, so to say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5073.531,
    "end": 5081.315,
    "text": "But at the same time, having global efficiency around certain functions, such as a supply chain, such as global money, such as global identity, would be great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5081.695,
    "end": 5088.779,
    "text": "But having those certain infrastructures available on the global scale is very different than what you would actually, the environments you would organize in as an individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5089.198,
    "end": 5094.744,
    "text": " And I don't want to be part of 50 million person communities because then I'm going to be overwhelmed and I'm going to have no clue how to navigate it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5094.764,
    "end": 5096.185,
    "text": "And I have no clue what the heck to do in that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5096.526,
    "end": 5101.912,
    "text": "I'm just going to find my core group of people of a few, a handful to a few hundred and somewhere in there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5102.172,
    "end": 5105.455,
    "text": "And that's probably going to be more of those size communities that I play in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5105.816,
    "end": 5109.76,
    "text": "So bringing it back to more DAOs and especially research DAOs right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5110.468,
    "end": 5111.789,
    "text": " So I can also share with you the link.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5111.829,
    "end": 5121.653,
    "text": "I don't remember if I did ahead of time, but I'm just putting together a different organizations that are in one way or another playing around with the intersection of DAOs and science in some kind of capacity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5122.153,
    "end": 5129.376,
    "text": "And some of these groups have nothing to do with Web3, except that they're using it as a DAO as a mechanism of coordinating and funding, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5129.396,
    "end": 5131.357,
    "text": "The actual science is all non-related to Web3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5132.193,
    "end": 5133.734,
    "text": " Um, and that gets me super excited.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5133.774,
    "end": 5141.679,
    "text": "And I think, uh, thinking from the course tiniest aspects of like us as a group of scientists, where do we want our research or whatever we're doing to have an impact?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5142.08,
    "end": 5142.34,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5142.874,
    "end": 5154.376,
    "text": " And then for people like me who, for whatever weird reason, love building infrastructure or just open source and just operational layers, how do I work with those separate pockets to be like, hey, y'all shouldn't be worried about the operations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5154.677,
    "end": 5160.458,
    "text": "There should be a DAO of operations wrapped around all of the science DAOs that help you do the operations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5160.478,
    "end": 5166.319,
    "text": "And there should be a fundraising DAO wrapped around all the science DAOs that can connect all the main science funders across the planet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5166.359,
    "end": 5170.76,
    "text": "And there are these mechanisms that just incentives have never existed there before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5171.46,
    "end": 5195.531,
    "text": " and i honestly don't think they're there yet these are still from my vantage point these are still public goods that in any other context but web 3 would comfortably say yeah we need tax or charity to make this run but web 3 being web 3 those are both bad words right so we have to pretend that it's oh we'll just keep having money trickle in because right now money grows on trees and no one's working about worried about sustainable funding 50 years from now right but at some point",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5196.367,
    "end": 5203.409,
    "text": " this fun part of our dance comes to an end and we have, you know, we're not just growing on the HODL beliefs at some point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5203.429,
    "end": 5206.69,
    "text": "At some point we recognize like, no, we've reached probably the zenith, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5206.75,
    "end": 5210.531,
    "text": "And at that point, how are we actually going to fund anything that's an infrastructure layer?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5211.051,
    "end": 5213.612,
    "text": "And right now there's some really interesting experimentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5213.672,
    "end": 5216.953,
    "text": "I know we've met a Gov, the community we've mentioned, they have a DAO to fund research",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5217.373,
    "end": 5244.806,
    "text": " uh in the direction of governance like i love these kind of experiments but again peer review and that's one that we want to take a serious focus at at smart contract research forum because we don't see who's playing in that direction we see some people playing on the publishing side we see people wanting to do the research side right but the core infrastructure is just it's less sexy it's not as fun to build and you don't get to have your name out on things right so like that that's where it's like i that's where we want to take a focus on what we want to add but i want to be respectful at times i know we're getting dangerously close to the end here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5246.479,
    "end": 5249.941,
    "text": " Let's have some last thoughts and then we can do a dot too, we can do more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5250.021,
    "end": 5257.585,
    "text": "So yes, BOLTS, business, operational, legal, technical, social, that's one acronym that we use.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5257.625,
    "end": 5259.886,
    "text": "Those are all important for research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5260.647,
    "end": 5264.189,
    "text": "And if the person who has the most knowledge of equations is doing the accounting,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5265.049,
    "end": 5290.123,
    "text": " it is not efficient allocation and then font like formal documents ontology narrative and tools so those are some of the frameworks first thinking about systems design and then review um well here on the live stream where we've done like 36 paper discussions over the last two years or so um we often wonder about where that could go so um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5291.479,
    "end": 5295.845,
    "text": " having 10 people look through it and different people do different thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5295.945,
    "end": 5298.788,
    "text": "One person runs the code, one really digs in the citations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5300.319,
    "end": 5301.3,
    "text": " It's a live stream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5302.02,
    "end": 5305.343,
    "text": "People are rewarded by participating in the lab.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5306.043,
    "end": 5307.184,
    "text": "We're learning by doing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5308.185,
    "end": 5312.047,
    "text": "I'm spending more time reading active inference papers than writing them by far.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5312.368,
    "end": 5314.289,
    "text": "And most researchers probably are too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5314.849,
    "end": 5317.431,
    "text": "Otherwise one starts getting disconnected from the pack.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5317.471,
    "end": 5323.055,
    "text": "So how can we make that contribution, those notes that people make in review",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5324.096,
    "end": 5352.891,
    "text": " not like accept or reject but yes and and then we have other people's perspective on something it doesn't mean that it's right so there's so many things that can be done with knowledge annotation and that sounds like a great area to look into i totally agree that there's been a lot of focus on financialization tokenization um conceptualization in research and the parts that i would like to hear more from",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5353.991,
    "end": 5380.147,
    "text": " is that recognition of the multi-year challenge and about what kind of research people want to specifically do and spearhead and hold on tight through because even when you're getting paid as a grad student in a really lucky situation it can still be challenging so when those features like healthcare and weekly check-ins with a mentor aren't in place that's the situation where",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5381.363,
    "end": 5382.184,
    "text": " research will be happening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5382.904,
    "end": 5386.567,
    "text": "So what are your last thoughts?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5386.627,
    "end": 5388.048,
    "text": "Or where do you think we should go from here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5389.83,
    "end": 5394.954,
    "text": "I mean, I think right careful experimentation, I think is very important right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5395.294,
    "end": 5403.52,
    "text": "And I also think it's important for the folks who are experimenting to be aware of the potentiality of their experiments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5404.201,
    "end": 5406.503,
    "text": "And I think we've all seen the how",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5407.688,
    "end": 5436.719,
    "text": " move fast and break things without any concern for potentialities of outcomes can lead to very bad outcomes so you know for folks who are experimenting with something that realistically is almost has a you know a sub one percent probability of ever having a meaningful negative impact on a person yeah go crazy have as much fun as you can experimenting in that direction right the more it's actually closer to where people are making their livelihood and are spending their lives and that it can negatively affect a lot of people the more that review focus and the more",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5437.279,
    "end": 5440.542,
    "text": " questioning their needs to be about how do we make sure that we're doing this right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5440.942,
    "end": 5443.504,
    "text": "So honestly, I'm just really excited.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5443.785,
    "end": 5444.505,
    "text": "We're still early in 22.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5444.685,
    "end": 5449.609,
    "text": "It's been a whirlwind these last few years in so many different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5450.01,
    "end": 5457.576,
    "text": "I'm just hoping that there's more chances for coordination, for collaboration, and especially for folks in the Web3 space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5458.236,
    "end": 5460.077,
    "text": " I don't mean to make whatever predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5460.177,
    "end": 5461.997,
    "text": "At some point, the market is going to turn, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5462.037,
    "end": 5463.538,
    "text": "I'm hoping we haven't started yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5463.578,
    "end": 5465.519,
    "text": "Maybe we're already at the beginning of the bear market.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5465.559,
    "end": 5465.939,
    "text": "Who knows?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5466.259,
    "end": 5472.901,
    "text": "I'm not going to pretend to... Not financial advice, not scientific advice, not legal... No, no, no.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5472.981,
    "end": 5473.962,
    "text": "No formal advice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5474.682,
    "end": 5476.402,
    "text": "Human to human personal advice, maybe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5476.422,
    "end": 5477.123,
    "text": "Nothing beyond that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5477.443,
    "end": 5477.743,
    "text": "Right, but...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5478.383,
    "end": 5482.265,
    "text": " I'm very interested to see once we hit the bear market, what does the collaboration look like?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5482.325,
    "end": 5490.31,
    "text": "Because I think that's actually going to be where a lot of gold comes and a lot of just intellectual brilliance comes out because then a lot of the noise is going to run away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5490.65,
    "end": 5498.554,
    "text": "So I know a lot of people because of their bank accounts are horrified of when the market turns and I get it, but I actually think it's going to be very good and healthy for the industry over the next three to five years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5499.715,
    "end": 5500.816,
    "text": "And the way you...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5501.943,
    "end": 5504.666,
    "text": " raised so many important issues, big thanks for that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5504.846,
    "end": 5515.636,
    "text": "And with the review, it's almost like we are focusing on the publication and the research and the funding sides, but that piece of review, it's almost like the first one we need.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5516.684,
    "end": 5527.356,
    "text": " That is a strange loop of science and we need review on the plans for DeSci and review on the frameworks for building the plans for DeSci and on all of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5527.476,
    "end": 5535.805,
    "text": "And so that's like Review Guild is really a strong place for people who want to learn by doing and be a big leverage point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5536.345,
    "end": 5538.528,
    "text": "It's like the coefficient of the grants.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5539.248,
    "end": 5549.833,
    "text": " And the way that knowledge by people who are off doing field work gets incorporated is through review, especially in these new structures, which we probably haven't even seen yet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5550.154,
    "end": 5554.436,
    "text": "But they're not going to look like proceedings of the UK 1600 alchemists.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5554.916,
    "end": 5555.937,
    "text": "It's going to be quite different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5556.837,
    "end": 5557.497,
    "text": "That is for sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5557.517,
    "end": 5557.597,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5557.617,
    "end": 5564.601,
    "text": "And for anyone, if you are interested in peer review or these kind of decentralized science, decentralized peer review, decentralized publication of research,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5565.046,
    "end": 5565.766,
    "text": " please let me know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5565.786,
    "end": 5566.726,
    "text": "Always feel free to reach out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5566.766,
    "end": 5575.388,
    "text": "I love connecting with folks and talking to a lot of folks who are trying to solve this problem from different perspectives and trying to figure out how we all come together to at least share our learnings, if nothing else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5575.468,
    "end": 5579.009,
    "text": "And I'll definitely make sure to coordinate with you and the active community on that side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5579.489,
    "end": 5583.809,
    "text": "Let's do a dot two with a panel in one or a few months.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5583.949,
    "end": 5592.531,
    "text": "Let's check back in on some of these themes, revisit the slides, hear from some new perspectives, update on the projects that we talked about today, and just see where we're at.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5593.8,
    "end": 5594.502,
    "text": " Sounds like a plan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5594.682,
    "end": 5595.765,
    "text": "Thanks for having me again, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5596.528,
    "end": 5597.189,
    "text": "Thank you, Eugene.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5597.29,
    "end": 5598.172,
    "text": "Awesome conversation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5598.272,
    "end": 5598.914,
    "text": "Much appreciated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5599.115,
    "end": 5599.275,
    "text": "Bye.",
    "speaker": "SPEAKER_02"
  }
]