[
  {
    "start": 3.052,
    "end": 29.481,
    "text": " okay we're back in cohort six for chapter eight first meeting so andrew however you wanna do it nice sounds good um yes so welcome today we're talking about chapter eight in the 2022 active inference textbook by kristen parr and kazuo and uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 30.288,
    "end": 48.668,
    "text": " chapter eight is following chapter seven where we discuss discrete state space models um as we know the second half of the textbook is largely centered around actually designing your own active inference models as opposed to primarily verbal descriptions of the theory in the first half",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 49.272,
    "end": 66.264,
    "text": " So in Chapter 8, which complements Chapter 7, we turn to continuous state-space models, which the authors state are well-suited for modeling physical fluctuations impinging on sensory receptors and for the continuous motion of the effectors, e.g.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 66.304,
    "end": 69.61,
    "text": "muscles, we use to change the world around us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 69.995,
    "end": 78.104,
    "text": " We're presented with model examples for the dynamical systems involved in motor control, as well as the concept of generalized synchrony.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 78.665,
    "end": 84.232,
    "text": "And finally, constructing hybrid models for combining discrete and continuous variables at differing levels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 85.633,
    "end": 88.717,
    "text": "Section 8.2 moves on to movement control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 89.678,
    "end": 94.984,
    "text": "We're introduced to some notation for the stochastic equations involved in continuous time models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 95.365,
    "end": 98.348,
    "text": "You'll notice they're a little bit different from those in Chapter 7.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 98.986,
    "end": 116.995,
    "text": " And then we also differentiate the symbols between those of the generative model and those of the generative process, which is also a reminder that oftentimes we produce models whose construction is actually rather similar equation-wise to those of the generative process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 117.43,
    "end": 131.302,
    "text": " An example for motor control and reflex arcs viewed as descending proprioceptive signals is given, which describes how state predictions can be pulled towards these signals like point detractors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 132.023,
    "end": 141.291,
    "text": "We also see how action is involved in true state changes in the generative process to bring outcomes closer to what the model expects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 141.871,
    "end": 146.475,
    "text": "And further, how more complex forms of these equations are used in more typical use cases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 147.08,
    "end": 155.451,
    "text": " As with discrete time models, continuous time generative models are used to draw inferences about the causes of sensations in the Bayesian brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 156.372,
    "end": 160.998,
    "text": "And then some simple nomenclature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 161.058,
    "end": 167.607,
    "text": "So in continuous state space models, usually it's X is the new stand-in to refer to states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 168.809,
    "end": 173.695,
    "text": "Y is now for observations or incoming sensory data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 174.198,
    "end": 174.879,
    "text": " William Newburry, Ph.D.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 174.839,
    "end": 180.644,
    "text": ": There are different ways of doing it, but we also have like, for example, you can use an Omega to to represent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 181.045,
    "end": 181.986,
    "text": "William Newburry, Ph.D.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 181.965,
    "end": 193.256,
    "text": ": Another aspect like different kinds of fluctuations it actually starts so one of the equations starts to look like a like a linear equation model so like a y equals G of X plus Omega.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 193.276,
    "end": 194.838,
    "text": "William Newburry, Ph.D.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 194.818,
    "end": 199.082,
    "text": ": So kind of like a y equals X plus B or or an error term for Omega.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 200.403,
    "end": 201.004,
    "text": "William Newburry, Ph.D.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 200.984,
    "end": 201.184,
    "text": ": and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 202.092,
    "end": 206.559,
    "text": " There's quite a bit in this chapter, so I'll just give a bit of a summation of the rest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 206.579,
    "end": 216.796,
    "text": "8.3, we're introduced to different kinds of dynamical systems, which better kind of illustrate the idea of how attractors come to play in continuous models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 216.976,
    "end": 222.345,
    "text": "We're showing the Lotka-Volterra dynamics, which follow from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 222.933,
    "end": 241.92,
    "text": " predator-prey dynamics researched in, say, ecology or zoology with an example of three different populations, plants, herbivores, and carnivores, showing a kind of oscillatory pattern between their populations, the idea being that carnivores eat the herbivores who eat the plants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 242.44,
    "end": 252.577,
    "text": " And so they're all kind of dependent upon one another, and they start to show these kind of non-equilibrium, like steady state kind of dynamics that arise over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 252.617,
    "end": 258.667,
    "text": "And it's as if it's kind of attracting points that they arrive around but never actually land and settle there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 260.991,
    "end": 262.634,
    "text": "We also have Lorenz systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 263.756,
    "end": 267.402,
    "text": "We're talking about things like criticality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 267.803,
    "end": 279.086,
    "text": " Then we'll skip ahead a little bit section 8.4 very significant concepts in active inferences generalized synchrony they use a bird song example for modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 280.629,
    "end": 287.483,
    "text": "To illustrate generalized synchrony so the bird song example for modeling communication and multi agent inference problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 287.851,
    "end": 310.973,
    "text": " uh they're uh the songbirds uh take turns singing so it's a kind of turn taking problem and it's as if they're singing from the same hymn sheet two birds with similar models learn each other's model parameters over time they start to synchronize with one another over time so their internal states and state predictions come to resemble one another reflecting a primitive kind of theory of mind",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 311.425,
    "end": 327.92,
    "text": " The dynamics are modeled by a higher level whose state predictions evolve according to a slow Lorenz system, impact the parameters of a faster Lorenz system at the lower level, again with action, here the birds are singing, to minimize prediction errors arising when no song is heard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 328.761,
    "end": 338.85,
    "text": "As the Lorenz systems evolve, modeling chaos, the birds' synchronization brings about what the authors call an identical synchronization of chaos.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 339.202,
    "end": 343.308,
    "text": " This also involves sensory attenuation, another very significant concept.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 343.328,
    "end": 351.659,
    "text": "The birds alternate between attention to sensory data and sensory attenuation to carry out actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 351.819,
    "end": 362.273,
    "text": "This back and forth with two agents becomes a kind of conversation between them with a generally linear dynamic in their predictions arising in a lower dimensional space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 362.658,
    "end": 383.249,
    "text": " Generalized synchrony can be applied to a range of diverse phenomena, from the synchronization between internal and external states, such as the agent and its environment, to communication, social behavior, and multi-agent settings, like the songbird example, where agents' internal states start to sort of mirror those of each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 383.99,
    "end": 390.42,
    "text": "And then Section 8.5 kind of concludes with discussing hybrid models",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 390.822,
    "end": 393.745,
    "text": " which very well could have deserved its own chapter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 394.726,
    "end": 405.737,
    "text": "But, you know, the idea is you could have models that say are hierarchical for one layer, perhaps a lower level as in figure 8.6 as Daniel has brought up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 406.938,
    "end": 419.31,
    "text": "The lower layer could, for example, take in continuous data and try and model that and send up whatever kinds of predictions it makes in a different kind of form to a higher level, which then makes some kind of, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 420.117,
    "end": 434.315,
    "text": " Chris Wanner, discrete state space inference about that continuous data and it makes some kind of inference about it, which then is set back down to the lower level to affect its its its decision making and actions so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 434.335,
    "end": 438.921,
    "text": "Chris Wanner, I think that's a good enough summary to stop there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 439.822,
    "end": 445.669,
    "text": "Chris Wanner, Now I will open the floor for questions or points of conversation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 450.779,
    "end": 462.736,
    "text": " Whenever it was introducing having a smooth space instead of a discrete space, like the last chapter said, it kind of introduced it just like, oh, yeah, this is what you use whenever the other one's impractical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 463.237,
    "end": 470.888,
    "text": "This is a little bit empirical, but have you guys found that you want to use discrete more than anything, as it kind of implies in this chapter?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 471.328,
    "end": 477.277,
    "text": "Or do you guys find that you just pick the one that seems to be right for the data, and then you run with it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 477.457,
    "end": 480.381,
    "text": "Is there a preference, or is there a norm that we use?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 484.462,
    "end": 485.083,
    "text": " Good question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 486.624,
    "end": 497.317,
    "text": "I mean, if it's in the form of like a personal question, like personal experience, I've largely just worked with discrete state spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 498.158,
    "end": 512.494,
    "text": "I'm coming from kind of a particular like social sciences agent-based modeling sort of background where things are presumed to occur in discrete time steps where, you know, ideally your data effectively is just like, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 512.93,
    "end": 516.235,
    "text": " discrete logs in a spreadsheet or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 517.016,
    "end": 523.865,
    "text": "And so, like, most of the time, I sort of default to thinking about discrete state spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 524.446,
    "end": 540.388,
    "text": "That said, though, I mean, I've worked with neuroimaging data, I'd love to make some kind of synthetic, like hybrid model that actually pulls in neuroimaging data, and I would absolutely switch to a continuous state space setting for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 540.858,
    "end": 542.783,
    "text": " For that right basically just.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 544.166,
    "end": 556.358,
    "text": "I would probably focus on what kind of data is that that your agent is receiving in the format and then take that approach, as opposed to getting too creative from the start.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 557.18,
    "end": 557.28,
    "text": "yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 559.623,
    "end": 566.738,
    "text": " Yeah, another practical aspect is that PyMDP only has discrete time setting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 567.54,
    "end": 571.088,
    "text": "So to use that at this point, you're kind of bound there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 571.108,
    "end": 579.927,
    "text": "And also separate out the state spaces from the time handling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 579.907,
    "end": 588.761,
    "text": " So here in this chapter, they kind of bring both the continuous time handling and the continuous date space like they go really well together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 589.423,
    "end": 597.696,
    "text": "But you also could have like a continuous variable, like just between zero and one, any number in the discrete time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 598.013,
    "end": 605.521,
    "text": " However, then it's like, if you think about that, it's like the matrix math that we looked at in chapter seven doesn't apply.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 605.541,
    "end": 611.128,
    "text": "So if we just had four locations, but location could have been a continuous variable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 612.95,
    "end": 622.3,
    "text": "So I think the fullest slash most technologically enabled would be to go with the data type",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 622.28,
    "end": 631.033,
    "text": " If you're collecting from an analog sensor, then like EEG or a continuous reading or the continuous location of something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 631.053,
    "end": 638.684,
    "text": "However, even continuous measurements at some point on digital hardware are getting sliced up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 639.425,
    "end": 642.169,
    "text": "And so then it's like, okay, how much do you want a coarse grain?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 645.193,
    "end": 647.937,
    "text": "That influences a lot of the handling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 648.018,
    "end": 651.763,
    "text": "It's just simpler with discrete state space and discrete time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 654.173,
    "end": 654.774,
    "text": " Okay, cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 654.834,
    "end": 655.174,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 656.076,
    "end": 665.529,
    "text": "That kind of reminds me back in college, we would talk about scraping electrons off of CCDs and actually extracting that information and how it all is digital at that level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 665.969,
    "end": 666.73,
    "text": "It gives me nightmares.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 668.313,
    "end": 674.942,
    "text": "I also wanted to ask, could you talk a little bit more about the Lorentz part after the Volterra thing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 675.122,
    "end": 680.89,
    "text": "I didn't quite understand that as well as I understood the Volterra explanation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 686.067,
    "end": 707.974,
    "text": " And that is rather, I almost feel like, despite how central the bird song example is used in this chapter, I actually think it's the Lorenz system that shows so much more complexity, the kind of complexity involved in some of these kinds of models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 716.577,
    "end": 719.461,
    "text": " I'll go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 719.481,
    "end": 721.264,
    "text": "Go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 721.624,
    "end": 724.068,
    "text": "If you had something, sorry, I'm just like getting back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 724.088,
    "end": 724.188,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 724.208,
    "end": 724.769,
    "text": "So, okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 724.789,
    "end": 728.775,
    "text": "So the Lorenz is kind of a classic chaotic system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 728.815,
    "end": 732.621,
    "text": "It's kind of the grandparents chaotic system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 732.641,
    "end": 738.489,
    "text": "And that was Lorenz studying the weather and saying, wait, even closely related trajectories diverge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 738.529,
    "end": 741.133,
    "text": "That's the Lyapunov exponent, all of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 741.535,
    "end": 746.831,
    "text": " How it's being used in the chapter is to give a buy stability to turn taking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 747.713,
    "end": 755.697,
    "text": "So it's like here, if all you knew was the X value, you'd find, okay, I'm staying negative,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 756.115,
    "end": 762.022,
    "text": " And then it's like, whoop, now there was a phase change into being positive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 762.042,
    "end": 776.74,
    "text": "So that like sort of by stable nature of the Lorenz attractor system is being used to be a chaotic switch on turn taking in birds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 776.838,
    "end": 803.571,
    "text": " um it's also kind of relevant like the birds are not sharing new information with each other so it's not exactly like turn taking in say a normal person conversation it's more like they're just wanting and preferring that the song remains the same that the song is played out and then it's like as soon as it's being listened to and then when the listening",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 803.787,
    "end": 805.71,
    "text": " It's like, wait, there's a missing note.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 805.87,
    "end": 807.854,
    "text": "Then the other bird steps in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 809.016,
    "end": 813.623,
    "text": "That's, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 813.643,
    "end": 813.944,
    "text": "Go for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 813.964,
    "end": 814.264,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 814.785,
    "end": 815.406,
    "text": "No, I'm sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 815.426,
    "end": 821.396,
    "text": "I was just going to say that that's what they, now it makes sense that they were talking about the synchronization of chaos.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 821.977,
    "end": 823.179,
    "text": "That really clicks for me now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 824.341,
    "end": 825.222,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 825.792,
    "end": 855.58,
    "text": " this is all the since like 2015 when i think the frith and friston bird song comes out it's been used a lot um this 32.3 or 32 series one of the rare ones with a dot three um this paper goes into more detail let's just look at a few of the key pieces here so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 858.513,
    "end": 862.998,
    "text": " Here's sampling from a Lorenz attractor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 863.479,
    "end": 873.792,
    "text": "So you can have a continuous, smooth, differentiable, chaotic system, meaning sensitivity to small inputs, highly operative exponents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 873.812,
    "end": 877.636,
    "text": "And then you could sample probabilistically from that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 877.917,
    "end": 883.103,
    "text": "So you're getting sampling that's like kind of speckling, approximating that smooth curve.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 883.673,
    "end": 886.878,
    "text": " What is done with the smooth curve?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 886.898,
    "end": 895.692,
    "text": "So is separate out on this landscape of attraction, where's the gradients from higher to lower density?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 896.613,
    "end": 902.442,
    "text": "And then what is the solenoidal flow that goes on an iso contour?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 903.097,
    "end": 907.062,
    "text": " So then this is another key aspect of the continuous time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 907.102,
    "end": 922.32,
    "text": "In discrete time, to look any time steps into the future, you need to do these explicit model-based rollouts, like actually considering future time steps and all the combinatoric explosions that accompany that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 923.882,
    "end": 925.003,
    "text": "Huh?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 924.983,
    "end": 926.886,
    "text": " Could you please remind me what an isocontour is?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 927.306,
    "end": 933.935,
    "text": "Okay, isocontour is like when you're hiking a line around the hill at the same elevation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 934.576,
    "end": 934.856,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 935.637,
    "end": 952.019,
    "text": "So it's just orthogonal to the gradient of steepest elevation is like putting a ruler on the steepest possible, you're on a place on the hill, steepest possible gradient, and then you have orthogonal to that you have around the map.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 952.699,
    "end": 953.1,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 954.211,
    "end": 961.903,
    "text": " The Taylor series expansion is when you can take, the first order of approximation is just the value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 963.085,
    "end": 966.11,
    "text": "Second is the slope, the red line.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 966.471,
    "end": 971.759,
    "text": "Third, so as you take these higher and higher approximations, you can approximate arbitrary functions going out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 975.124,
    "end": 979.932,
    "text": "Here, they couple two chaotic systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 980.063,
    "end": 995.423,
    "text": " They have them and then they like in that state space that's described by the movements of them, they show that you can apply that Helmholtz decomposition and say like, what are the circulatory flows",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 996.297,
    "end": 998.502,
    "text": " And then what are the gradient flows?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1000.225,
    "end": 1004.715,
    "text": "This is what the system looks like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1004.735,
    "end": 1007.321,
    "text": "So this is the two birds, so to speak.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1007.882,
    "end": 1009.465,
    "text": "Here's their interface.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1010.969,
    "end": 1012.973,
    "text": "So system A and system B.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1013.138,
    "end": 1028.312,
    "text": " And then these kinds of plots are verifying like, yeah, some states like the third and the sixth, their correlation drops to zero, whereas other states remain correlated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1032.578,
    "end": 1040.79,
    "text": " So the whole reason why they have Lorenz is just show you can put any smooth curve in the continuous.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1041.431,
    "end": 1045.737,
    "text": "It doesn't have to be just like a sinusoid or anything like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1046.177,
    "end": 1052.446,
    "text": "You can have any kind of smooth differentiable curve and sample probabilistically from it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1052.687,
    "end": 1057.033,
    "text": "So you could generate point data from an underlying curve.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1057.013,
    "end": 1066.023,
    "text": " And you could take sampled point data and then regress essentially against and get to a smooth differentiable setting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1067.585,
    "end": 1072.33,
    "text": "Which one of those directions is useful just depends on what kind of data input you have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1073.551,
    "end": 1074.192,
    "text": "Okay, cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1074.372,
    "end": 1077.095,
    "text": "That reminds me a lot of very classical machine learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1077.215,
    "end": 1082.601,
    "text": "Whenever you consider your data points to be, you know, just points on a manifold and you're trying to learn the shape of that manifold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1082.621,
    "end": 1083.302,
    "text": "That's okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1083.562,
    "end": 1084.523,
    "text": "That's kind of familiar to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1087.152,
    "end": 1087.573,
    "text": " Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1088.093,
    "end": 1097.548,
    "text": "And so then sampling-based approaches are trying to make a smooth, differentiable landscape from the speckles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1098.289,
    "end": 1102.435,
    "text": "Because with a smooth landscape, you can do gradient descent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1103.076,
    "end": 1106.401,
    "text": "But you couldn't do gradient descent on just a cloud of points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1107.603,
    "end": 1108.684,
    "text": "Yes, absolutely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1109.866,
    "end": 1111.929,
    "text": "Well, not well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1111.969,
    "end": 1115.775,
    "text": "Yeah, you can jump from point to point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1116.38,
    "end": 1129.275,
    "text": " so that's what is getting played with i mean on a bigger scale in the second half of the book but then explicitly in the last part of chapter eight when they come together in the hybrid models is like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1129.475,
    "end": 1142.975,
    "text": " And then as Andrew highlighted, like temperature in the world may be a continuous variable, but you could model it with integers or you can model it with a 0.1, like one significant figure of decimal precision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1143.455,
    "end": 1145.378,
    "text": "So then those are all modeling choices.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1146.3,
    "end": 1150.446,
    "text": "And that's the kind of infinite branching paths of how you model something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1152.409,
    "end": 1155.052,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1155.072,
    "end": 1155.173,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1155.193,
    "end": 1156.174,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1161.723,
    "end": 1166.169,
    "text": " It's also in the communication style models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1166.189,
    "end": 1175.281,
    "text": "So kind of birdsong, epistemic communities, like the kind of Twitter hashtag version, Andrew's social science simulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1176.163,
    "end": 1186.036,
    "text": "What becomes really interesting is like what rails are put in and then what is actually the semantics of what is communicated?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1186.076,
    "end": 1189.661,
    "text": "I'm not going to lie.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1189.681,
    "end": 1190.202,
    "text": "Oh, I'm sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1190.562,
    "end": 1191.223,
    "text": "Yeah, go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1191.76,
    "end": 1201.996,
    "text": " That's exactly what I was thinking about whenever you said like how you divide up temperature, like specifically how you divide it up seems like it would directly go into how you are going to interpret the results.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1202.476,
    "end": 1215.456,
    "text": "So for the bird songs and stuff like that, like just jumping into what frequencies you're naturally attuned to focusing on, what axioms are naturally put into the system, they are going to represent what you are going to more easily represent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1215.942,
    "end": 1241.899,
    "text": " was a poorly worded sentence but it's going to lead you to learn certain things easier which seems like it would help with the uh synchronization of chaos specifically yeah what will be like forever beyond that model's horizon like if you're only doing temperature by the tens that perceiving it by the tens like one significant figure",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1242.166,
    "end": 1257.492,
    "text": " then there won't be it won't be able to capture at the one's place whereas if you had a model that was at the decimal point maybe it could kind of do something at a or like what what kind of communication amongst agents",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1257.472,
    "end": 1285.96,
    "text": " is being set up like if you just say if you have put everything in place so it's like zero means go left and one means go right well then they're just going to be sending ones and zeros and using that to coordinate their movements but then how would you actually make a kind of packet that conveys move left but without putting the rabbit in the hat so it's unfair so that they're just kind of hinting each other what they already know",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1286.092,
    "end": 1294.44,
    "text": " versus are you trying to explain the sort of heuristic signaling amongst agents that already have a shared semantics?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1295.061,
    "end": 1315.221,
    "text": "Or on the other extreme end, are you trying to model the emergence of shared communication semantics from some kind of a simpler substrate?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1317.192,
    "end": 1327.067,
    "text": " or like the birds like they already have the hymn sheet so they're keeping up the duty of the song being played",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1327.672,
    "end": 1335.082,
    "text": " And then you can show really interesting phenomena like in the papers where they'll show, okay, bird one will transfer its parameters to two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1335.603,
    "end": 1337.245,
    "text": "Then you remove one, you add three.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1337.586,
    "end": 1339.368,
    "text": "And then two can transfer to three.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1340.11,
    "end": 1347.019,
    "text": "So you can say there's a propagation of the fine tuning in this kind of genetic context where it knows the song.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1348.001,
    "end": 1353.448,
    "text": "But then that model couldn't be used to address how does the song change within or between generations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1355.992,
    "end": 1356.092,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1361.135,
    "end": 1376.279,
    "text": " This is a little... We might have discussed it the last time we discussed this chapter in a previous cohort.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1377.721,
    "end": 1381.928,
    "text": "So on page 164,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1382.296,
    "end": 1391.145,
    "text": " Still with the example, there's a figure 8.5 that represent like the synchronization and communication process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1391.185,
    "end": 1395.61,
    "text": "And on the left, we have the generative model and the attractor system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1395.63,
    "end": 1395.931,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1396.291,
    "end": 1398.834,
    "text": "Then on the right, synchronization manifold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1399.074,
    "end": 1403.098,
    "text": "So so the upper graph is supposed to represent like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1403.118,
    "end": 1404.68,
    "text": "It's a little bit more chaotic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1404.7,
    "end": 1409.485,
    "text": "I don't want to use the word chaotic, but it's a little less coordinated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1409.819,
    "end": 1415.749,
    "text": " But then after learning, there is organization where it's as if, you know, the Y axis, that's the second bird.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1417.873,
    "end": 1419.296,
    "text": "X axis is the first bird.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1419.316,
    "end": 1427.149,
    "text": "And so there's this kind of secretion such that, you know, it looks like a linear, it's positive correlation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1427.79,
    "end": 1433.38,
    "text": "But what's interesting to me is simply that the values",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1433.815,
    "end": 1440.743,
    "text": " the value range of the X and Y axis are much larger in the second graph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1440.763,
    "end": 1445.348,
    "text": "And, you know, I would need to know much more about parameter settings, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1445.868,
    "end": 1457.341,
    "text": "But I was trying to figure out, like, if the birds are like further expanding their exploration of the state space as they continue to learn.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1457.441,
    "end": 1457.641,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1457.661,
    "end": 1462.827,
    "text": "Because if I don't know why that would expand outward,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1463.482,
    "end": 1474.82,
    "text": " And I might just be missing something very simply, but it's just kind of interesting that it's such a smaller state space that they're awkwardly exploring before learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1474.86,
    "end": 1476.923,
    "text": "And then after learning, it's broader.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1478.385,
    "end": 1484.595,
    "text": "Yeah, also in both cases, it goes further to the right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1486.178,
    "end": 1488.923,
    "text": " like here it never you know it never goes below 50.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1488.943,
    "end": 1507.579,
    "text": "I mean it never goes below negative 20 but then it way overshoots um there might be something like a conservation of like inertia so it's like if you had no synchronization you'd have a circle I mean the path would be traced within a circle",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1508.268,
    "end": 1516.935,
    "text": " And then if you have total synchronization, it's almost like that's kind of like making this ellipse that might project out further.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1517.516,
    "end": 1518.897,
    "text": "But what are these really about?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1519.277,
    "end": 1522.42,
    "text": "Well, they're second level expectations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1523.221,
    "end": 1524.602,
    "text": "Why is the sensory data?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1525.242,
    "end": 1528.565,
    "text": "That's the actual note that's played into the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1529.466,
    "end": 1533.73,
    "text": "Level one, I believe, is the vocal cord of the bird.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1534.29,
    "end": 1537.853,
    "text": "That's like the warbling of the vocal cord control.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1539.571,
    "end": 1541.594,
    "text": " I don't know if it's a two note song.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1542.295,
    "end": 1545.6,
    "text": "I don't know if there's any auditory representation of these songs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1545.66,
    "end": 1546.601,
    "text": "That would be pretty fun too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1547.883,
    "end": 1556.796,
    "text": "Level two then would probably represent like who's supposed to be singing and maybe the zero point is the switch over.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1558.299,
    "end": 1567.452,
    "text": "So then this represents an extreme belief like that it's plus 60.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1567.702,
    "end": 1583.972,
    "text": " like 60 to one odds or e to the 60th or something that the second bird is singing but yeah these these big blocks kind of get thrown out and it's like what are they",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1598.043,
    "end": 1601.467,
    "text": " Duet for one, kind of the classic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1601.487,
    "end": 1607.093,
    "text": "This gets to the predictive coding question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1609.235,
    "end": 1614.581,
    "text": "So I guess the first layer is the neural control of warbling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1616.023,
    "end": 1621.509,
    "text": "And then the second layer is higher vocal center.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1625.333,
    "end": 1626.835,
    "text": "And then it's kind of interesting like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1627.962,
    "end": 1652.316,
    "text": " you know is the audio um is there like a mirror neuron thing where you're responding to your own generation of speech I mean there has to be because you kind of confirm that you're speaking as you expect but then this was going to be my question for you Andrew was why do you think there's sensory attenuation during action",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1656.329,
    "end": 1661.398,
    "text": " Why not just keep my attention on the sensory inputs while you're acting?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1663.281,
    "end": 1664.022,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1664.403,
    "end": 1681.932,
    "text": "My sense of that from what I've understood, because that's one of the most seemingly counterintuitive concepts that I've found in active inference, at least kind of like in the ways presented in the textbook.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1682.637,
    "end": 1711.142,
    "text": " the way i kind of imagine the logic of it in a more colloquial sense is like if i if i am absolutely certain that my arm is exactly in the position that it's in and i maintain that sort of belief uh perpetually it's going to be very hard to change my mind that it is or could be anywhere else right there's a kind of like like by sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1712.101,
    "end": 1730.819,
    "text": " by attenuating that incoming sensory evidence that it's exactly where it is right now, that allows me to kind of like put on pause, so to speak, the feeding of that sensory information into reconfirming a belief I have that is there, such that now I can actually move it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1730.999,
    "end": 1741.99,
    "text": "What I need to happen is to believe that it's actually where I want it to be, rather than where it currently is, such that I can actually realize that sort of expectation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1742.56,
    "end": 1765.615,
    "text": " um i don't know if any of that tracks but that's kind of you know in a simple sense like kind of how i've been understanding sensory attenuation yeah i mean i remember we had many fun conversations about getting out of the chair and about disorders of initiating and terminating movement",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1766.27,
    "end": 1791.265,
    "text": " it's kind of like discrepancy is resolved by changing your mind or changing the world so updating belief states or updating action states if we had complete total rigid confidence that and this also relates to a like a key multiple role for the expectations about sensory input they're both",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1792.645,
    "end": 1805.71,
    "text": " trying to be veridical like representing sensory inputs otherwise it's just it's just off kilter and and deceptive so on one hand the expectations have to be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1807.073,
    "end": 1835.41,
    "text": " um at least tracking real world changes like we're experiencing the visual generated expectations hence the color and the sharpness and the periphery all that so from a first pass like sense making perspective you want that visual expectation to be accurate but then if you had total precision on what that were you wouldn't have the openness or the flexibility to take in new or different information but that's just on the sense making now we get into the action",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1836.352,
    "end": 1846.303,
    "text": " So then if you had, because there's also this role for expectations in pragmatic value, because they're also the preferences about sensory inputs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1846.964,
    "end": 1861.06,
    "text": "So if we're getting confirmatory proprioceptive input that the arm's in position one, then there's no discrepancy to even resolve.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1861.799,
    "end": 1863.642,
    "text": " We expect it where it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1863.802,
    "end": 1864.804,
    "text": "We prefer it where it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1864.904,
    "end": 1870.233,
    "text": "So the best, the most vertical and the highest pragmatic policy is to do nothing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1871.615,
    "end": 1881.512,
    "text": "So then there has to be this like transient alleviation of the precision to even enable the possibility that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1882.505,
    "end": 1910.807,
    "text": " counterfactual about where the arm could be and the proprioception that accompanies that like for that to even be plausible the precision has to be widened to include it so making things significantly less precise on on reading your incoming sensory data um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1911.209,
    "end": 1936.718,
    "text": " that said, not completely gone, I almost imagined like a sort of intermittent, like, almost like a blinking light is like, you know, as opposed to a completely continuous intake of the proprioceptive signal of where your arm is, it's like, kind of almost have to like, loosely check and make sure it's going in the direction you want it to not to imply that any of this is necessarily like a conscious process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1936.778,
    "end": 1937.098,
    "text": "But",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1937.517,
    "end": 1945.565,
    "text": " But it's as if you need to kind of intermittently check that it's going the way you want it to and is in the position you want it to be in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1947.967,
    "end": 1955.695,
    "text": "I could imagine that getting a little haywire if the entire process were paused for the entire duration of the movement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1955.715,
    "end": 1959.919,
    "text": "But I might be off base here with how you're describing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1959.939,
    "end": 1966.005,
    "text": "But I do see this as the mislead end of talking about decision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1971.183,
    "end": 1980.675,
    "text": " Yeah, I mean, it's so well integrated with fixed eye gaze, which is what the example that comes up again at the end of the chapter, just briefly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1980.695,
    "end": 1987.223,
    "text": "Fixed eye gaze, high precision, and then it's like you're driving on a windy road.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1987.243,
    "end": 1994.492,
    "text": "It's like pull off the precision, make the move, but you don't see a blurry set of, you don't see the blur.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1995.413,
    "end": 1999.418,
    "text": "It's like you're just not paying attention while the cicade is happening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1999.634,
    "end": 2003.519,
    "text": " And then as soon as it's fixed again, then the precision is re-engaged and it looks clear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2004.521,
    "end": 2007.946,
    "text": "And then shorts from memory kind of like just irons out the gap.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2011.811,
    "end": 2013.654,
    "text": "With your expectations, I suppose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2013.854,
    "end": 2014.134,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2014.835,
    "end": 2015.236,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2017.239,
    "end": 2019.101,
    "text": "It's such a, I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2019.702,
    "end": 2024.829,
    "text": "It's such a, almost like a fun concept to like wrap your head around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2025.27,
    "end": 2025.49,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2026.702,
    "end": 2035.251,
    "text": " But it does make, I mean, it makes sense to me as far as the other aspects of like the theoretical aspects of the active inference go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2035.331,
    "end": 2048.145,
    "text": "It's like if you just, yeah, if you're fully fixed on a particular belief that you have about, say, the position of your arm or where your eyes are, et cetera, the idea is, I mean, you would be self-evidencing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2048.165,
    "end": 2054.532,
    "text": "You would not act to change like the location that you're looking at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2054.765,
    "end": 2062.496,
    "text": " So it's coherent despite the kind of seeming like, you know, what is that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2062.556,
    "end": 2065.02,
    "text": "How does it work when first presented with it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2066.001,
    "end": 2068.285,
    "text": "And it does track to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2074.534,
    "end": 2082.966,
    "text": "The way that I understand it, and please let me know if you guys like agree or disagree because I might be misunderstanding, is whenever I read that, I kind of got the impression that like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2083.942,
    "end": 2087.268,
    "text": " Inside of us, there are multiple systems, or at least this is the way I imagine it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2087.328,
    "end": 2088.31,
    "text": "There's multiple systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2088.33,
    "end": 2089.953,
    "text": "There's like the proprioceptive system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2090.053,
    "end": 2093.098,
    "text": "There's like my eyes telling my head where my arm is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2093.118,
    "end": 2094.901,
    "text": "And there's a whole bunch of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2095.402,
    "end": 2098.948,
    "text": "So every time I take an action, there's going to be all of these systems which are engaged.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2099.489,
    "end": 2101.613,
    "text": "And these systems want to have a lot of harmony with each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2102.032,
    "end": 2103.614,
    "text": " So there's going to be constant checks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2103.854,
    "end": 2110.201,
    "text": "Every time there's going to be an action, we want to use this attenuation to make sure, okay, are all the gears shifting as they should?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2110.221,
    "end": 2111.843,
    "text": "Is this transmission moving in step?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2112.544,
    "end": 2116.008,
    "text": "So all of these systems are going to align themselves with every action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2116.348,
    "end": 2129.022,
    "text": "So there's going to be some model in my head of the world that I see that is going to be built up by the things that I touch and feel, especially through proprioception, through sensory stuff, throughout my eyes, like my retinas actually take in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2129.322,
    "end": 2131.785,
    "text": "I think we went two chapters ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2132.069,
    "end": 2142.139,
    "text": " about how the eyes get like such small amounts of information and we actually build up the world around that and a few other things which are going to be a system of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2142.219,
    "end": 2146.203,
    "text": "And then the connection of the systems are going to build up this world model that I have in my head.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2146.743,
    "end": 2151.107,
    "text": "And that world model that I have in my head is the thing that we're using the free energy principle with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2151.127,
    "end": 2153.61,
    "text": "That's the thing that we're minimizing a surprise with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2154.43,
    "end": 2161.317,
    "text": "So does that kind of read that like you want to constantly have this attenuation to have these checks, these systems are in stability, in harmony?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2163.102,
    "end": 2166.567,
    "text": " Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2166.587,
    "end": 2175.92,
    "text": "I mean, the free energy minimization process applies within a modality and in the composition of modalities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2175.96,
    "end": 2191.962,
    "text": "So you're right that for a real organism, there's also these cross calibration checks that might do a lot of the work where in a single modality,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2193.157,
    "end": 2199.904,
    "text": " it doesn't need to be as resilient within a single modality because you can like double check.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2199.924,
    "end": 2208.093,
    "text": "You could look at something and then you could like move it to double, or you could see what it appears to be and then touch it to get confirmatory evidence from a different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2208.954,
    "end": 2220.526,
    "text": "And then if something is showing up coherently across modalities, it's like multiple confirmatory lines of evidence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2221.887,
    "end": 2222.708,
    "text": "Absolutely, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2224.595,
    "end": 2232.187,
    "text": " And this actually leads into another question I had, which is not so related to chapter eight, but it's in chapter eight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2232.388,
    "end": 2234.11,
    "text": "So I'm going to bring it up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2234.13,
    "end": 2250.737,
    "text": "It's the question of what do you guys think about like having multiple ideas on the same thing, kind of the superposition of ideas and just kind of picking out, just whispering out the one that makes the most sense in this chapter, it talks about the accurate belief that I am not moving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2251.308,
    "end": 2255.454,
    "text": " in order to predict the sensory consequences of movement, blah, blah, blah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2256.115,
    "end": 2261.043,
    "text": "But I find that really interesting because it just says the accurate belief that I am not moving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2261.744,
    "end": 2263.466,
    "text": "And that could mean a few things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2263.526,
    "end": 2265.89,
    "text": "That depends on the frame of reference which I'm putting it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2265.95,
    "end": 2269.976,
    "text": "That depends on the context for the actual place that I want to apply that free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2270.336,
    "end": 2273.802,
    "text": "Because I'm not using it right now, but I'm standing on a treadmill.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2274.122,
    "end": 2274.983,
    "text": "So I could be moving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2275.444,
    "end": 2278.108,
    "text": "But at the same time, relative to my desk, I'm not moving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2278.493,
    "end": 2281.436,
    "text": " But then again, relative to the sun, I'm absolutely moving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2281.837,
    "end": 2288.444,
    "text": "But then whenever you think about all these other things, there's going to be this kind of like, which place do I want to put my sensory input in?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2288.964,
    "end": 2291.547,
    "text": "My sensory input is not just my sensory input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2291.647,
    "end": 2301.778,
    "text": "It's the sensory input with the context of the environment I'm building it around, where the environment I'm building around right now is this funny little idea of I am not moving with respect to what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2302.559,
    "end": 2303.76,
    "text": "Do you guys have any thoughts on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2304.24,
    "end": 2305.141,
    "text": "Is that as deep as it goes?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2305.161,
    "end": 2307.724,
    "text": "Is that just like I read a sentence too hard or...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2309.662,
    "end": 2321.114,
    "text": " This is precisely the kind of, you know, the kind of conundrum that I was trying to express when I first started speaking about sensory attenuation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2321.134,
    "end": 2329.963,
    "text": "You know, it's so, I keep saying seemingly counterintuitive because at this point, there's something intuitive in my brain that's telling me, I think I get it now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2331.145,
    "end": 2339.213,
    "text": "But really, I mean, it's tough with, I mean, to be on a treadmill, the difficulty with that example is that, like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2339.648,
    "end": 2344.299,
    "text": " If you're just standing on a treadmill, let's maybe go with an escalator.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2345.461,
    "end": 2348.388,
    "text": "If you're just standing there, you're not moving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2349.31,
    "end": 2350.974,
    "text": "You're moving, and that's accurate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2351.134,
    "end": 2354.923,
    "text": "In a kind of external, you're moving in the world's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2354.903,
    "end": 2381.687,
    "text": " you know xyz coordinate 3d world sense but you're not taking action you know so if your mark-off blanket is you and you're not taking the actions to move your body and at least in the way that we're saying that and so it's i mean it's not going to be i don't know if this necessarily plays into that however if you're you know standing in place and you want to move right then like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2382.055,
    "end": 2387.661,
    "text": " the idea of sensory attenuation is that you would have to sort of down tune or widen the precision",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2388.012,
    "end": 2416.281,
    "text": " uh or or otherwise uh regarding your sensory observations of standing in place at least to some you know degree or intermittently or however you know how it's your choice how you want to actually model that uh and try to get at that but however it is the idea is you have to kind of put on pause this idea that you're just standing in place lest you just kind of reconfirm the belief that you're just standing in place you'll",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2416.767,
    "end": 2444.31,
    "text": " even if you like want to move uh that's not gonna sit well with like the rest of your like so-called beliefs as as an agent right the rest of your beliefs are telling you well both of my legs are neither of them are moving and like in terms of all my senses i appear to not be moving um self-evidencing like you're gonna stay there um you know even if you consciously have some beliefs that you want to move",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2444.932,
    "end": 2462.316,
    "text": " mean i i think it'd be i think it's interesting to look at that from a kind of you know psychiatric standpoint as well or looking at you know kind of phantom pain or or things like that um but uh so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2463.022,
    "end": 2469.899,
    "text": " So you kind of, I mean, I think the way that Daniel put it earlier too with the saccades, I think that was really good actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2469.979,
    "end": 2475.372,
    "text": "Like you're not actually noticing the blur necessarily whenever you move your eyes, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2475.453,
    "end": 2477.638,
    "text": "It's kind of like, like, you know, we'd,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2478.547,
    "end": 2503.322,
    "text": " Predictive coding that was sort of think of it as like the higher the higher order is just kind of like Descending and put like expectations like kind of fills in the gap whenever you move your eyes around, but you're not Focusing on that player you're really down to any kind of that sensory information You'd otherwise be taken in because you're not focused on all my eyes are exactly and you know position two point two one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2503.707,
    "end": 2526.289,
    "text": " uh or 2.1 by 3.1 now they're in 2.0 by 3.0 like you're not necessarily trapping every incremental bit that you move right you're just i'm looking here i want to look here um everything in between is just like a kind of skip and your your mind fills in the blanks so that's not too terribly jarring in that everyday experience right",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2526.792,
    "end": 2537.129,
    "text": " Also, the treadmill separates, not necessarily an evolutionarily prevalent stimulus, separates out two senses of I am.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2537.149,
    "end": 2541.496,
    "text": "There's I am making movement, which could be proprioceptive change.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2541.836,
    "end": 2544.841,
    "text": "So rate of proprioceptive change is I am making movement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2544.881,
    "end": 2551.652,
    "text": "Then there's I am moving distance, which would relate, like you said, a lot to the reference frame.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2552.054,
    "end": 2566.999,
    "text": " And then those two might have, it's like if you were in a dream and you felt like you were running, but you felt like you were moving slow, that could be like a gear differential between the proprioceptive that you felt like you were like working harder than the visual that you weren't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2567.7,
    "end": 2570.504,
    "text": "And then that would be interpreted as like a salient differential.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2573.85,
    "end": 2575.092,
    "text": "Yes, absolutely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2576.742,
    "end": 2581.831,
    "text": " And also I think dreams are just deeply fascinating in the realm of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2581.931,
    "end": 2583.053,
    "text": "That's just amazing to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2584.816,
    "end": 2590.967,
    "text": "The dreams will be super fun to explore and like on the lucid dreaming.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2592.029,
    "end": 2593.772,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2594.36,
    "end": 2600.767,
    "text": " can they control and reduce their agency level?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2601.288,
    "end": 2605.733,
    "text": "Like, can they submerge or can they can they control their attention?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2605.753,
    "end": 2614.482,
    "text": "Or could they, you know, what aspects of the generative model are being are being modified?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2614.542,
    "end": 2619.608,
    "text": "And what are the bounds of the lucid agency?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2621.393,
    "end": 2624.558,
    "text": " What are they reducing or increasing their precision on?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2624.778,
    "end": 2634.454,
    "text": "And then what, then are there different like subtypes where, where somebody might be able to remember more, but they can't have agency over wanting to remember more or something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2634.474,
    "end": 2635.075,
    "text": "I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2636.277,
    "end": 2638.841,
    "text": "Oh, that's, that's a really, really cool idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2642.947,
    "end": 2646.493,
    "text": "How much of the, cause you are the environment in that case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2646.513,
    "end": 2647.114,
    "text": "There's no,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2647.398,
    "end": 2651.004,
    "text": " the separation between, you know, the self and the environment, you're in a dream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2651.185,
    "end": 2652.166,
    "text": "It's just, it's all you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2653.328,
    "end": 2656.153,
    "text": "So that is such a fascinating angle to go down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2658.057,
    "end": 2658.257,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2659.018,
    "end": 2666.311,
    "text": "But at the same time, the way you're processing that, it's as if you're a Marcon blanket instead of a Marco blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2667.112,
    "end": 2670.418,
    "text": "You're, you know, you're, you're still distinct from,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2671.107,
    "end": 2697.604,
    "text": " you uh the world that your mind's creating i always wonder if there's a if a dream is just some kind of like residue of offline structure learning right it's just there's some kind of mashing around of different you know model parameters or however you want to say it and suddenly you have this visual scene where you get to like move around and there are affordances and at some point you might just notice that you have more control than what you think you do",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2698.124,
    "end": 2701.969,
    "text": " I don't know, fun conversation we had around dreams always.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2705.933,
    "end": 2720.25,
    "text": "The hybrid model at the end, that was kind of most recently unpacked in the Active Inference Does Not Contradict Folk Psychology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2721.597,
    "end": 2731.35,
    "text": " a nice, careful title, not that it's that it supports or verifies any kind of, but just that it that it isn't wrong.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2731.41,
    "end": 2732.351,
    "text": "I'll fix that later.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2732.752,
    "end": 2736.737,
    "text": "But just that it's that it doesn't contradict.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2737.739,
    "end": 2741.544,
    "text": "And then the belief, desire, intention, folk, psychological model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2742.305,
    "end": 2745.85,
    "text": "And so just like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2747.111,
    "end": 2747.652,
    "text": "Can.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2748.994,
    "end": 2751.317,
    "text": "If all things can be modeled",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2751.702,
    "end": 2772.765,
    "text": " inactive inference then that would include these other kinds of experiential situations and other things so then like then again that kind of reflects what what is it that allows us to describe anything are there things outside of our modeling scope",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2774.467,
    "end": 2779.335,
    "text": " Or are there just situations that are just empirically very challenging to assess?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2779.996,
    "end": 2784.903,
    "text": "Like you couldn't get a verbal self-report from somebody in a lucid dream or just something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2784.923,
    "end": 2791.734,
    "text": "Like there's situations where you couldn't get a data point, but you could model where you could get a data point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2796.341,
    "end": 2796.441,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2800.117,
    "end": 2807.727,
    "text": " I'm personally of the mindset that our tools can lead us to places way outside of how creative we can be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2808.367,
    "end": 2812.773,
    "text": "Because whenever we're like building these things, you know, we have a very serious, like we have our math hats on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2813.313,
    "end": 2817.959,
    "text": "And I think of physics whenever they found like black holes and stuff like that and the big bang.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2818.16,
    "end": 2821.243,
    "text": "And whenever they looked at it, they said, that's completely ridiculous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2821.263,
    "end": 2822.285,
    "text": "There's no way that's true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2822.325,
    "end": 2828.132,
    "text": "And I think that with a lot of tools, we see very similar things where we didn't realize",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2830.103,
    "end": 2854.761,
    "text": " will it led to very unintuitive results yeah yeah i uh i'm gonna you know i think it'd be new to apply active inference in certain areas that i'd like to you know apply it to but uh like a follow-up point on that is that you know uh so like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2855.078,
    "end": 2876.133,
    "text": " like for centuries, models that really simplify the idea of what is human behavior or something like utility or profit maximizers, you know, and the kind of outcomes model that using computational tools, usually what happens is being very identical to one another.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2877.154,
    "end": 2881.221,
    "text": "It's kind of a zero-sum game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2881.792,
    "end": 2901.589,
    "text": " because people are so identical they don't have their own preferences they don't really trade things with one another it's just a very flat simple environment and uh suddenly once you once you include things like like uh you know allow for more complexity suddenly you you end up",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2901.839,
    "end": 2912.44,
    "text": " having agents who trade with one another in ways that leads to market volatility and crashes and bubbles and all of these other kinds of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2912.825,
    "end": 2916.411,
    "text": " So what's interesting to me is like, on the one hand, I do agree with you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2916.431,
    "end": 2929.573,
    "text": "I think that these kinds of tools lead to all kinds of like crazy new discoveries that I mean, that's one of the greatest as the combination of like epistemic and pragmatic value there is doing research to make new discoveries.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2929.994,
    "end": 2935.423,
    "text": "At the same time, it's like sometimes I think these tools will actually help us understand",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2936.011,
    "end": 2943.961,
    "text": " already existing phenomena, but now we actually know how to recreate them and now better understand what their initial causes are too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2945.443,
    "end": 2948.447,
    "text": "So just coming at it from kind of the other angle as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2949.429,
    "end": 2950.57,
    "text": "No, I completely agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2950.73,
    "end": 2957.479,
    "text": "Feeling like you get to see something from a new angle using a new tool is actually one of the most satisfying things I think you can experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2960.26,
    "end": 2963.045,
    "text": " And now cognitive science is moving that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2963.145,
    "end": 2968.133,
    "text": "It's not just, we're taking a picture of like our elbow that we couldn't have seen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2968.193,
    "end": 2970.577,
    "text": "It's like, oh, that's what my elbow looks like from that angle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2970.597,
    "end": 2982.456,
    "text": "If it's like, that's what my mind looks like from that angle, or if that's a view of a mind that hasn't existed, then that is just so strange, loopy and trippy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2982.476,
    "end": 2984.76,
    "text": "Absolutely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2984.8,
    "end": 2986.723,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2987.058,
    "end": 2998.635,
    "text": " I'm trying to remember, there's some famous quote from, I don't know if it was Richard Feynman or who, but some quote, like, if I can't create it, then I don't understand it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2998.675,
    "end": 3003.321,
    "text": "It was like a kind of words by a modeler.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3003.361,
    "end": 3005.464,
    "text": "If I cannot create it, I don't understand it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3007.207,
    "end": 3009.851,
    "text": "So trying to understand things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3009.871,
    "end": 3010.872,
    "text": "Dr. Sutton.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3015.188,
    "end": 3017.051,
    "text": " That's where we're at.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3017.071,
    "end": 3020.456,
    "text": "I wonder where I got that from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3020.476,
    "end": 3023.46,
    "text": "We understand creating the discrete time models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3024.341,
    "end": 3028.827,
    "text": "I think it's fair to say at this time we understand creating the discrete time models more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3029.569,
    "end": 3036.138,
    "text": "Not like some fundamental aspect of them, just that we've had a lot more experience with PyMDP and the discrete time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3036.438,
    "end": 3039.002,
    "text": "Maths are a little clearer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3038.982,
    "end": 3055.758,
    "text": " But then the continuous time, especially with RX and fur, it'll be very cool to kind of flip in and out and make both and nest them and just really start to see like how and where they can be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3056.499,
    "end": 3068.55,
    "text": "We could just do a continuous and a discrete time or state space for like every single situation and just kind of have like two models in parallel and then just recombine them as needed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3069.256,
    "end": 3071.979,
    "text": " Yeah, yeah, absolutely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3072.28,
    "end": 3086.537,
    "text": "I imagine like, you know, I was thinking about how to model like, for example, agents who do have access to some kind of, you know, some kind of continuously measured resource.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3086.997,
    "end": 3099.212,
    "text": "And like, what's important is to be actually actually be able to measure if something is like higher or lower, like actually having that kind of like order, ordinal scale or otherwise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3099.8,
    "end": 3117.538,
    "text": " Because that isn't that kind of an issue with trying to take some continuous value and then bending it such that becomes discrete choices that you also have to have to somehow include the logic that the range of zero to 10 is necessarily less than the range of 11 to 20.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3117.873,
    "end": 3129.266,
    "text": " If you have a model that doesn't quite get that, then it might make very odd-looking associations between what it needs to be in 0 to 10 versus 11 to 20.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3129.286,
    "end": 3135.392,
    "text": "Anyway, maybe a conversation for another time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3137.355,
    "end": 3145.804,
    "text": "Well, next time we explore more 8, maybe we'll look at and possibly add some questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3146.459,
    "end": 3148.544,
    "text": " Eight's getting, you know, eighth inning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3148.564,
    "end": 3150.95,
    "text": "It's after the seventh inning stretch.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3152.714,
    "end": 3154.257,
    "text": "Some have left the stadium.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3156.462,
    "end": 3162.797,
    "text": "But then we head back into the data-oriented nine and the closing 10.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3163.399,
    "end": 3164.642,
    "text": "So, cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3165.183,
    "end": 3165.885,
    "text": "Thank you, fellows.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3166.887,
    "end": 3167.669,
    "text": "See you next time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3168.571,
    "end": 3170.155,
    "text": "Wonderful talking to you guys.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3170.555,
    "end": 3171.257,
    "text": "Thanks, folks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3171.277,
    "end": 3171.738,
    "text": "Peace, bye.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3171.758,
    "end": 3172.5,
    "text": "Take care.",
    "speaker": "SPEAKER_00"
  }
]