[
  {
    "start": 27.861,
    "end": 52.89,
    "text": " all right hello and welcome everyone it is act inf live stream number 47.1 on august 10th 2022 and we're continuing our explorations into the paper dyad inactive dynamic social cognition and active inference of hippolyta and vaness and active inference and abduction by pia tarnan and benny",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 54.488,
    "end": 77.146,
    "text": " welcome to the act inf institute we're a participatory lab and institute that is communicating learning and practicing applied active inference links are on the slide this is recorded in an archive live stream so please provide us with feedback so we can improve our work all backgrounds and perspectives are welcome and we'll be following video etiquette for live streams",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 78.8,
    "end": 87.304,
    "text": " Head over to ActiveInference.org to learn more about other projects at the Institute and how to participate and join learning groups.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 89.665,
    "end": 100.031,
    "text": "Today in stream 47.1, we're continuing to learn and discuss this pair of papers mentioned earlier and on the previous video.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 101.708,
    "end": 113.295,
    "text": " And we're going to open with some introductions and then probably just jump in wherever anyone has a new question they'd like to ask.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 113.375,
    "end": 121.039,
    "text": "Maybe ending the introductions with Blue so that you can bring a new vector into the conversation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 121.86,
    "end": 123.3,
    "text": "So I'm Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 123.62,
    "end": 127.523,
    "text": "I'm a researcher in California and I'm looking forward to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 129.229,
    "end": 148.187,
    "text": " taking a dot one lens a little bit to the paper which had an extended dot zero as there isn't so much to learn on a few of these angles and so much to kind of think about that um what is the difference between",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 149.582,
    "end": 159.97,
    "text": " being in the bathtub and then in the middle of the paper pair versus, for example, coming into it to contextualize it or tried to leave it to apply it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 160.31,
    "end": 161.491,
    "text": "Something in between even there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 161.511,
    "end": 163.733,
    "text": "I'll pass it to Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 163.753,
    "end": 166.395,
    "text": "Thanks, I'm Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 166.415,
    "end": 167.136,
    "text": "I'm here in Calgary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 169.161,
    "end": 177.969,
    "text": " I don't know if I don't know what the dot one means because we've never done a dot one where we've tried to pull two things, put them proximal and see what happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 178.489,
    "end": 183.514,
    "text": "Because sometimes that's fire and water and just get a lot of steam.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 183.554,
    "end": 187.618,
    "text": "And sometimes it's nitro and glycerin and the whole thing blows up on you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 187.638,
    "end": 189.679,
    "text": "So I'm kind of looking forward to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 189.72,
    "end": 193.383,
    "text": "That's kind of the risky part that I think is kind of exciting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 193.403,
    "end": 194.644,
    "text": "I'll pass it over to Stephen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 197.342,
    "end": 198.023,
    "text": " Oh, thanks, Dean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 198.223,
    "end": 199.064,
    "text": "Yeah, Stephen here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 199.084,
    "end": 199.984,
    "text": "I'm in Toronto.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 201.666,
    "end": 211.254,
    "text": "I'm really curious around what this infusion of two different approaches to active influence can yield.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 211.534,
    "end": 215.038,
    "text": "So what's behind it all?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 215.078,
    "end": 220.642,
    "text": "What's behind an approach of an activism that brings in instrumentalism",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 221.786,
    "end": 225.49,
    "text": " or an approach that's more mathematically focused, bringing in realism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 225.55,
    "end": 229.373,
    "text": "So I'm curious, and hopefully it's going to be useful and practical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 229.673,
    "end": 230.935,
    "text": "I'm going to pass it over to Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 231.515,
    "end": 235.239,
    "text": "Hi, I'm Blue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 235.379,
    "end": 236.92,
    "text": "I'm in New Mexico.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 236.94,
    "end": 240.744,
    "text": "I really enjoyed reading.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 240.764,
    "end": 247.07,
    "text": "So I've read the, I think we did the Hippolyto paper before on another live stream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 248.283,
    "end": 254.009,
    "text": " And so I've read that one before, but I really enjoyed reading this abduction and active inference paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 254.489,
    "end": 258.934,
    "text": "I do not have like a strong philosophy background.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 259.455,
    "end": 262.298,
    "text": "So I kind of come at this like with a, what is this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 262.378,
    "end": 262.798,
    "text": "What is that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 262.838,
    "end": 268.745,
    "text": "Like I have to go search Wikipedia a hundred million times to kind of get more information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 269.649,
    "end": 272.651,
    "text": " about from a philosophical aspect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 272.931,
    "end": 289.8,
    "text": "And so one of the key things like where I was having a hard time like locking in on this abduction paper, active inference and abduction is why do Friston blankets, like, like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 290.779,
    "end": 297.641,
    "text": " they presented, the authors presented it as if the frist and blankets like necessitate a realist perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 298.341,
    "end": 299.302,
    "text": "So is that true?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 299.482,
    "end": 301.862,
    "text": "And if so, why is that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 305.163,
    "end": 305.463,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 306.684,
    "end": 307.284,
    "text": "Thanks, everyone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 308.124,
    "end": 311.945,
    "text": "So two threads blew in what I heard.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 312.245,
    "end": 314.006,
    "text": "And I think two areas for us to kind of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 315.865,
    "end": 342.245,
    "text": " get on the slide and and see at the same time so one was like different approaches that can be taken both by an individual like different backgrounds in different fields or disciplines and then kind of going beyond one person's just learning trajectory and thinking what are the conceptual approaches that we can take to in this case active inference but this might be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 343.519,
    "end": 367.763,
    "text": " studying active inference and applying active inference kind of both ways might come into play and then the question of the first and blankets something like what aspects of what enable a situational realist or a instrumentalist why are people taking the stances they're taking",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 369.896,
    "end": 391.331,
    "text": " on a given situation sometimes even like mixed across different contexts for the same system they might use one or another or something like that stephen and this brings action back into the equation i sense that action is is quite important because the idea of instrumentalism is in a way is there's a use of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 392.509,
    "end": 398.872,
    "text": " sort of an instrument, and that's the best way to think of what's happening with the blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 398.932,
    "end": 406.876,
    "text": "Actually, Lou, I think it's really cool that you brought the blankets up because that question comes in an active way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 406.956,
    "end": 414.22,
    "text": "It's like the temptation is to make everything realist, and then it's like, okay, we've got a blanket, so it's kind of like, well,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 414.795,
    "end": 421.438,
    "text": " maybe we should make sure we keep the blanket question in an instrumental way to avoid all those traps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 421.478,
    "end": 432.663,
    "text": "And then on the other side, it's like, on the math side, it's like, well, these potentially fundamental dynamics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 434.181,
    "end": 441.443,
    "text": " Well, as they're being acted in some way, they must have some relation to reality in some way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 442.263,
    "end": 443.983,
    "text": "So it's sort of almost the mirror.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 444.704,
    "end": 449.205,
    "text": "It's not the mirror, but it's something that's sitting on the other side in an interesting way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 449.225,
    "end": 452.866,
    "text": "I don't know what Dean thinks on that point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 457.607,
    "end": 462.968,
    "text": "I was going to mention that I think if we are taking two papers and actually",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 463.922,
    "end": 467.524,
    "text": " doing a bit of a what happens when they get entangled thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 467.804,
    "end": 476.389,
    "text": "We're looking at what happens when something is actively inferred as a process, as opposed to active inference as a subject matter or topic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 477.301,
    "end": 491.708,
    "text": " And so when we do that, we're essentially asking the big questions on one of the next slides here is, so is active inference both as process, as actively inferring, and of process?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 491.928,
    "end": 493.709,
    "text": "Something falls out of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 493.749,
    "end": 501.013,
    "text": "And we asked it using the metaphor of being both a gripper, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 501.353,
    "end": 505.515,
    "text": "Something as processing and of process, being gripped.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 506.519,
    "end": 532.241,
    "text": " And so, yeah, I think if we actually look at it as what's going on, not just from the doing sense, but from the observing sense or participatory sense, I think it leaves us with no choice but to say that there's gotta be some going back and forth between both, but that's just my take.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 537.082,
    "end": 546.549,
    "text": " So let me read this quote from the paper, specifically going back to the blanket, the one that set off my question bell that's unanswered.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 548.17,
    "end": 548.891,
    "text": "It says, OK.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 552.065,
    "end": 569.19,
    "text": " According to recent interpretations of the FEP, the dynamical interaction of living systems and the external world under active inference can be interpreted semantically, this is a Ramstad 2020 citation, by assuming that sensory states are meaningful representations of the reality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 569.21,
    "end": 574.772,
    "text": "This is especially the case if we assume that the development of Markov blankets by Friston",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 575.862,
    "end": 586.653,
    "text": " unlike their original characterization in works of Judea Pearl on probabilistic causal networks, admit a realist interpretation of the relationship between the organism and the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 589.015,
    "end": 598.825,
    "text": "So it says, while the role of the concepts of Markov blankets and Pearl blankets in many treatments of the free energy principle is an instrumentalist one, or as in Pierce's even stronger terms,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 599.278,
    "end": 602.32,
    "text": " concede to a nominalist interpretation of their meaning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 602.7,
    "end": 610.485,
    "text": "Frist and Blankets are realist, not only in the non-instrumentalist sense, but also in the sense of being non-nominalist entities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 610.985,
    "end": 624.653,
    "text": "The modal terms of references to real possibilities, such as what is conceivable or produced by imagination or anticipatorily related to the future states of affairs, are used in making sense of the key aspects of the theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 627.116,
    "end": 635.639,
    "text": " And so in my recollection, the Friston blanket, like I didn't have that linked to realism necessarily per se.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 636.52,
    "end": 641.001,
    "text": "So Daniel, like maybe can, do you have any more clarification?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 641.041,
    "end": 648.944,
    "text": "Like, is that like a realist, a Friston blanket is a realist interpretation of the pearl blanket or, or am I just forgetting that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 651.225,
    "end": 655.767,
    "text": "When I read that part, I didn't know what nominalism was.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 656.929,
    "end": 684.084,
    "text": " so according to the summary the view that universals and abstract objects do not actually exist other than being merely names or labels one version denies the existence of universals the other the abstract so it's an anti-generalist position so let's see where that was used with the frist and blanket",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 687.708,
    "end": 715.515,
    "text": " because this is the um crux of the discussion like one of the frontiers of contact other than just saying well inactivism and dynamical systems theory work like this coarsely or this broad area math and chemistry work together like this this is starting to get into the real contact points of turf semantically that are being",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 716.681,
    "end": 742.225,
    "text": " vied over people have different perspectives on how to interpret base graphs in different contexts and so then the markov blanket is like it still might even be too coarse grained to for that whole turf to be controlled by one view or another so then let's look at how",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 744.113,
    "end": 761.501,
    "text": " the abduction paper and anything else that you see where would it be more justified just in your sense um what and then we'll unpack this because i think this was just copied in to discuss today",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 762.492,
    "end": 779.587,
    "text": " since it's obviously a clear area where both papers are talking about their view on the Markov blanket which might make it clearer to see how multiple views on blankets and graphs come into play but let's unpack both of their perspectives",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 781.509,
    "end": 784.093,
    "text": " the nominalist interpretation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 784.133,
    "end": 792.723,
    "text": "And as you're unpacking that, like it's something I didn't have to look up because it's a very prominent theme in Buddhism, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 792.743,
    "end": 794.225,
    "text": "Like that, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 796.042,
    "end": 801.647,
    "text": " it's like the absence of any kind of inherent existence, like that existence is nominal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 802.867,
    "end": 822.763,
    "text": "And so it's interesting that in this abduction paper that they take this, this, you know, construction by Pierce of nominalism, but, but also like more than once in that paper, they point to an objective reality, which is like, if, if,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 823.383,
    "end": 837.17,
    "text": " if things are interpreted, if all stuff is nominally interpreted, then what is the subjective reality other than like linguistics or semantics or perhaps semiotics?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 838.371,
    "end": 839.271,
    "text": "Yeah, so.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 843.894,
    "end": 844.154,
    "text": "Stephen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 845.771,
    "end": 864.762,
    "text": " that's a very good point um because it also ties back you mentioned about um when we're talking there about the relationship almost being the reality i sense that they were kind of saying if there's a relationship those relational dynamics or they didn't use the word dynamics therefore",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 866.127,
    "end": 875.876,
    "text": " have some can be called real, you know, which I think is a fair assertion in some senses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 876.036,
    "end": 887.166,
    "text": "Although, you know, again, there could be an overextension because there's a question about how much you go up into transcendental and how much you go down",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 888.467,
    "end": 914.162,
    "text": " into the kind of more morphology and the whole morphogenesis and there's actually a really good there's a there's a um hector lazaba he's actually it does a lot of work with theater the oppressed and work with you know people have been tortured and stuff like that and he talks about um the medicine is in the wounds the medicine is in the wounds when people get you know",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 915.643,
    "end": 916.544,
    "text": " former etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 916.584,
    "end": 934.535,
    "text": "And one of the things that's interesting there is that we may be in a culture, there's times when we might try to explain things or do transcendental work to transcend a situation or avoid us and we may actually avoid a situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 934.555,
    "end": 941.12,
    "text": "But sometimes, when you go into the wound, what you might find is is literally a bloody mess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 943.101,
    "end": 946.862,
    "text": " So that may not be real in the normal sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 950.042,
    "end": 950.142,
    "text": "Dean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 950.162,
    "end": 952.063,
    "text": "I'll just add to that a little bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 952.403,
    "end": 966.085,
    "text": "I think it's interesting that most representations of Markov blankets show the Markov blanket in between two distinct sets of properties.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 966.285,
    "end": 969.306,
    "text": "And that's always represented on the horizontals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 970.188,
    "end": 997.548,
    "text": " And I think what's interesting here is that if you find yourself in a debate situation of two top-down perspectives, one that says it must be from the top-down inactive, or it must be from the top-down some series or set of different logics applied depending upon",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 998.117,
    "end": 1008.841,
    "text": " your familiarity with what it is that you're observing, that can lead to that whole question of hierarchy and then what entails the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1009.141,
    "end": 1027.727,
    "text": "So for me, it's pretty easy to understand why people who take the exclusive position of instrumentalism as entailing something like logic,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1028.63,
    "end": 1041.379,
    "text": " or the other hierarchical relationship of the logic being the real thing, and then the actions to follow, or that's the thing that's being entailed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1042.139,
    "end": 1049.585,
    "text": "I think what the diagrams, what a lot of the pictures tell us, is that there's a lateral aspect to this as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1051.326,
    "end": 1055.769,
    "text": "And so if we're going to look at that lateral, less",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1056.801,
    "end": 1071.165,
    "text": " which is enveloping the other top-down view, because both of the views in both of these papers, the bias or the position that the authors take is one of top-down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1071.365,
    "end": 1074.986,
    "text": "What rules under this set of conditions or circumstances?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1075.606,
    "end": 1081.988,
    "text": "Placing those two things side by each strips away some of the questions around relativity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1083.092,
    "end": 1099.238,
    "text": " And now introduces the idea around relationship, not relationship in terms of power over, but relationship in terms of what needs to be present in order for somebody to be able to actually make fewer prediction errors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1100.338,
    "end": 1105.52,
    "text": "So the Markov blanket, I think, can be turned.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1105.66,
    "end": 1112.323,
    "text": "I mean, right now, most of it is perceived as being some sort of a vertical partition between",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1112.919,
    "end": 1115.16,
    "text": " lateral elements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1115.721,
    "end": 1124.645,
    "text": "I mean, it can be flipped and we've talked often in lots of papers about what's the hierarchical structure, what's the bottom up, what's the top down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1125.866,
    "end": 1138.093,
    "text": "But I think both of these papers admittedly say we are taking a top down view of this and therefore they are constraining themselves to more",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1140.347,
    "end": 1154.559,
    "text": " emphasis on the relativity aspect of what is going on in an actively inferring way than they are looking at it as a relationship between the sensing and the acting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1162.426,
    "end": 1162.706,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1162.746,
    "end": 1162.986,
    "text": "Wow.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1163.006,
    "end": 1163.787,
    "text": "A lot of stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1166.021,
    "end": 1182.337,
    "text": " let's go through the abduction markov blanket discussion the first part is the statement of context potentially for a philosophical background but it's important that they're placing this along the lines of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1183.624,
    "end": 1206.13,
    "text": " autopoiesis in biology so these are systems that are self-perpetuating in a diffusive multi-scale self way perhaps but they're self-creating we're not just taking them as existing in a certain contrived arrangement five minutes ago we're thinking about systems that have maintained a non-equilibrium steady state with their environments",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1207.391,
    "end": 1213.428,
    "text": " And if someone denies the realism or anything of the environment,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1215.194,
    "end": 1237.463,
    "text": " then that can be verbalized and even cognized but it is not enacted by persistent systems either from the view from the inside or like if one just stops breathing or something like that or the view from the outside because again systems with persistent measurements have to be at least doing well enough to persist",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1238.343,
    "end": 1258.008,
    "text": " amidst the regularities of the environment so this is kind of like grounding it in an evolutionary and developmental framework but connecting it to the non-equilibrium steady state maintenance which is grounding this realism discussion in a relationship with the environment not as like an a priori then there's a definition of markov blanket",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1260.922,
    "end": 1283.758,
    "text": " the blankets state conditional independence between nodes in a base graph which doesn't mean that influence doesn't travel or that those states aren't semantically about each other but it means that they're conditionally independent in a statistical way external states in Ceboscu not sure this author but the endosemiotic view",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1285.086,
    "end": 1288.67,
    "text": " would be like potentially meaning on the inside.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1288.911,
    "end": 1292.155,
    "text": "Like photons on the retina really are light.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1292.875,
    "end": 1297.961,
    "text": "It really is the case that that's the real thing within that facet of biological function.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1299.384,
    "end": 1323.137,
    "text": " and internal states described from exosemiotic perspective so perhaps like the interpretive view so view from the inside the true influence of a of a feature and the kind of studying of it view from the outside where those agree you have semiosis like with a stop sign and it means stop in the situation with different entities this speaks directly to active inference",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1324.144,
    "end": 1336.188,
    "text": " given that the regulation of the entropy of internal states, so all these functions that we're describing as being like bounded or constrained or minimized, are having to do with that interface's surprise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1336.668,
    "end": 1351.893,
    "text": "Control on action, outgoing, and then bounded surprise on perception, which is also very forsaged by like the perceptual control theory and various motor theories, which we've talked about, but like the reflex arc,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1353.041,
    "end": 1368.355,
    "text": " challenging the way that people modeled decision-making, for example, then in many treatments, they're agreeing that people take an instrumentalist usage or stance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1371.017,
    "end": 1379.225,
    "text": "Christian blankets are realist not only in the non-instrumentalist sense, opens up a whole discussion with non and anti,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1380.609,
    "end": 1384.491,
    "text": " but also in the sense of being non-nominalist entities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1386.192,
    "end": 1398.96,
    "text": "And then in this last quote, it'd be great to hear more from the authors about what the modal terms of reference are, but the part that stands out here is the real possibilities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1401.002,
    "end": 1406.145,
    "text": "Because for these systems with these features engaging in this way,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1409.056,
    "end": 1435.162,
    "text": " their cognition can be considered real to the extent it has all of these features and is tied to the environment over time and so on hope that is one view on it because many paragraphs in the abductive paper and in the inactive paper if you really engage with their structured arguments there's so much to like read in between and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1437.833,
    "end": 1444.715,
    "text": " to respect the way that they've laid out the argument while also, hopefully now, all seeing interesting ways to connect it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1444.875,
    "end": 1446.215,
    "text": "So, Stephen, and then anyone else.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1447.756,
    "end": 1462.88,
    "text": "Yeah, this is a little bit sort of feeding back to you, Daniel, so in case you've got a thought on this, because there's the biological aspect here that you're bringing up, and I agree with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1463.892,
    "end": 1492.431,
    "text": " and you know in the work on the brain kristen's been talking about moving from say a causal correlation to a functional correlation and there can be many ways of getting somewhere when it's functional so then but of course in this case there's a certain element of what's real in terms of what we scientifically because it's scientific realism as a scientist what is real in what's been scientifically deducted",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1493.382,
    "end": 1497.064,
    "text": " So if it's being deductive, it is a perspective that's being taken.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1497.244,
    "end": 1518.775,
    "text": "So within the perspective that's being taken on certain states, non-equilibrium steady states, where is that regime of attention, the scientific regime of attention, purely an instrument to be considered, or is it for the things it's analysing, that could be real?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1519.878,
    "end": 1536.028,
    "text": " So there could be sort of a get-out clause, yet there could still be phenomenon rather than perspectives and logic sitting underneath that, which have many dynamics to get to the same outcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1536.188,
    "end": 1537.769,
    "text": "So what's your thoughts on that, Daniel?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1541.072,
    "end": 1543.833,
    "text": "My thought is I want to hear what Blue and Dean would say on it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1544.093,
    "end": 1544.514,
    "text": "OK, go on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1546.759,
    "end": 1547.579,
    "text": " Yes, Dean first.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1548.58,
    "end": 1549.04,
    "text": "Go ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1549.5,
    "end": 1550.0,
    "text": "Go ahead, Luke.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1553.421,
    "end": 1554.081,
    "text": "No, go for it, Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1554.141,
    "end": 1555.141,
    "text": "I want to hear what you have to say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1555.501,
    "end": 1565.204,
    "text": "Okay, well, here's an interesting thing about both papers, and maybe the authors of the papers will push back hard on this, but great, that's what I'm used to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1566.284,
    "end": 1573.426,
    "text": "Both papers take a scientific perspective on this, very much a scientific perspective, which in my books is easily...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1575.689,
    "end": 1579.211,
    "text": " as an idiom is when I see it, I'll believe it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1579.431,
    "end": 1580.671,
    "text": "They want the evidence, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1580.691,
    "end": 1581.171,
    "text": "They want it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1581.552,
    "end": 1585.573,
    "text": "They want that sort of inductive deductive piece to sort of sit front and center.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1586.293,
    "end": 1588.254,
    "text": "They want proof, which is great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1588.314,
    "end": 1588.795,
    "text": "I get that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1589.355,
    "end": 1601.68,
    "text": "But what I think is really fascinating about this is while they are holding up that, that epistemic priority, they're also talking a lot about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1602.961,
    "end": 1607.804,
    "text": " I'll invert that and they say, I'll believe it when I see it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1608.885,
    "end": 1610.766,
    "text": "So there's a lot of faith in this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1611.187,
    "end": 1619.973,
    "text": "It hasn't materialized yet, but if I continue to exist in a social setting or as an agent, guess what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1620.233,
    "end": 1632.101,
    "text": "I got to have faith that all this time that keeps rolling out, I'm going to continue for whatever purposes, goals, or directives I'm taking to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1632.793,
    "end": 1645.299,
    "text": " to work through the not seeing it until I actually arrive at that moment where something materializes and I can say, oh, now I have the evidence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1645.539,
    "end": 1661.427,
    "text": "So both papers have a real, they play with themselves, they dance with themselves in the sense that they are both papers from an explicit standpoint saying we are looking at this scientifically and mathematically,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1661.963,
    "end": 1677.143,
    "text": " And yet, in order for us to be able to hold on to this thought or idea of the FEP being, you know, I'm whatever called steady state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1677.183,
    "end": 1678.825,
    "text": "I've just lost the expression.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1679.326,
    "end": 1679.906,
    "text": "Non-equilibrium.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1680.766,
    "end": 1681.086,
    "text": " Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1681.146,
    "end": 1682.426,
    "text": "Non-equilibrium state-state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1682.927,
    "end": 1706.212,
    "text": "I do have to believe in something in order for whatever materialization goal or outcome I'm moving towards, if that's homeostasis or allostasis or I want a sandwich five minutes from now, I have to believe in that thing or my agency or my ability to achieve or attain before I can actually have the thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1706.932,
    "end": 1710.033,
    "text": "So from that view alone,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1710.635,
    "end": 1716.219,
    "text": " I find it really interesting that there's a certain amount of naivete in both papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1716.42,
    "end": 1730.651,
    "text": "There's a kind of a, we have to tip our hat to this rookie view that every time we realize something, there has to be a little bit of faith or a little bit of belief in what's going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1730.791,
    "end": 1739.678,
    "text": "Those priors actually exist and I'm going to use them because I want to carry out whatever my priorities are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1740.495,
    "end": 1747.779,
    "text": " And it doesn't matter whether it's the top downiness of abduction and logic or the top downiness of an activism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1748.4,
    "end": 1768.592,
    "text": "They both tip their hat to the bottom upiness of I got to kind of have a confidence that even if it's not here now, at some point, it will either continue the way I want it to or whatever change I want to impose on it, I have that capacity to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1769.11,
    "end": 1772.672,
    "text": " to wait it out and have that thing happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1773.532,
    "end": 1778.175,
    "text": "So yeah, that's what I would add to what Stephen was saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1780.696,
    "end": 1781.076,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1781.797,
    "end": 1782.337,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1782.857,
    "end": 1784.959,
    "text": "So I'll say a couple of things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1786.964,
    "end": 1793.947,
    "text": " I was looking at just now the difference between a Fristin, like what is a Fristin blanket?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1794.007,
    "end": 1796.207,
    "text": "And I came across a paper that we're going to have to discuss.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1796.608,
    "end": 1801.469,
    "text": "It's called Scientific Realism About Fristin Blankets Without Literalism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1802.089,
    "end": 1805.111,
    "text": "And it's by Kiverstein and Kirchhoff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1806.391,
    "end": 1807.872,
    "text": "So someday we're going to have to have that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1807.932,
    "end": 1810.833,
    "text": "It's a preprint up on Philosophical Archive now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1811.333,
    "end": 1814.154,
    "text": "So apparently like having a real...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1815.194,
    "end": 1820.837,
    "text": " boundary can be like literal, like there's like a literal interpretation or a realist interpretation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1821.317,
    "end": 1827.94,
    "text": "And so just like, I'm still trying to narrow down, like, what is this realist interpretation of a Friston blanket?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1829.161,
    "end": 1830.122,
    "text": "And yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1830.982,
    "end": 1836.725,
    "text": "So in also a very real sense, like what is the real boundary of a living thing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1838.385,
    "end": 1841.787,
    "text": " I can't find my real boundary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1842.108,
    "end": 1844.289,
    "text": "Where do I stop and something else begins?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1845.089,
    "end": 1852.093,
    "text": "There are hundreds and trillions, I don't even know, more non-human cells in my body than there are human cells.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1852.493,
    "end": 1853.694,
    "text": "So I always have to come back to this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1854.114,
    "end": 1856.856,
    "text": "So what would I be without all of those non-human things?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1856.936,
    "end": 1859.337,
    "text": "Are those non-human things also me?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1859.858,
    "end": 1861.739,
    "text": "But then I'm constantly like...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1862.359,
    "end": 1864.6,
    "text": " ingesting new ones and excreting old ones.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1864.62,
    "end": 1868.262,
    "text": "And so like, and they're coming into my skin and leaving my skin.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1868.602,
    "end": 1870.483,
    "text": "So where is my boundary?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1870.523,
    "end": 1877.667,
    "text": "Like, do I have to have this boundary in order for active inference and like the Markov blanket interpretation to apply?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1878.508,
    "end": 1883.214,
    "text": " I don't know that that's necessarily true.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1884.035,
    "end": 1886.699,
    "text": "So like, I can just get off of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1886.899,
    "end": 1895.249,
    "text": "I love this paper and I love like the semiotic interpretation in like the abductive sense, like, but does it even really matter?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1895.309,
    "end": 1895.75,
    "text": "Like, like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1897.233,
    "end": 1903.655,
    "text": " So the realist interpretation, like to someone who doesn't believe in like a shared objective reality is never going to work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1904.915,
    "end": 1906.796,
    "text": "Or like, can you find the boundary?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1906.836,
    "end": 1912.798,
    "text": "Like, what is this line between self and other or like between like, like I can't find the boundary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1913.398,
    "end": 1924.021,
    "text": "So like for me, it's all a modeling perspective that doesn't lessen the impact of this abduction is active inference paper for me at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1924.421,
    "end": 1926.322,
    "text": "Like, like I really thought it was a great paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1926.684,
    "end": 1930.927,
    "text": " and has a lot of really cool things to say about cognition and perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1931.447,
    "end": 1934.37,
    "text": "So, like, why are we hung up on this still?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1934.55,
    "end": 1934.91,
    "text": "I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1934.93,
    "end": 1940.294,
    "text": "Okay, both of you go for it, and then I'll add some notes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1942.215,
    "end": 1944.177,
    "text": "Could I just add one more, Daniel?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1944.957,
    "end": 1949.821,
    "text": "I mean, I think, well, I agree totally with Dean on this bottom-up thing,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1950.891,
    "end": 1968.793,
    "text": " phenomenon you know that's that's going to be there in the background right maybe it's always going to be unknowable apart from some of these simulations giving us insight but i think also what blue is saying there is for me this whole boundary question is where there's the problem with the systems",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1969.946,
    "end": 1973.608,
    "text": " discussion, in terms of that being kind of naturalised.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1974.409,
    "end": 1980.933,
    "text": "And I think that it because you end up with because systems are defined that way, what's inside what's outside.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1981.673,
    "end": 1989.818,
    "text": "And for me, the big revelation, and I think for a lot of people, maybe in the biological sciences, it's not so unusual to think this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1989.878,
    "end": 1997.083,
    "text": "But to think about agent based modelling, to think about where where's the agent, where's the agency, the teleology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1998.003,
    "end": 1999.004,
    "text": "And that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2000.817,
    "end": 2007.136,
    "text": " Agency doesn't necessarily sit on a boundary in the same way that systems tend to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2008.306,
    "end": 2032.671,
    "text": " mean someone can argue that it doesn't have to and i'm sure it doesn't but it ends it nearly always ends up there right in reality in terms of discourse so um you know we want that discourse to be clear we're doing this work with systems engineering to have it where we want these clear divisions for the purpose of ontological discourse so we know what we're talking about and why however which is where maybe there's a challenge this agent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2033.681,
    "end": 2041.867,
    "text": " agency, teleology, morphological dynamics are something else than that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2042.667,
    "end": 2045.81,
    "text": "I'll pass that to Daniel, and maybe his answer will come in somewhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2045.83,
    "end": 2046.39,
    "text": "I'm not sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2047.01,
    "end": 2048.171,
    "text": "Dean first, then I'll go for it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2048.892,
    "end": 2049.712,
    "text": "I'll be real quick here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2049.872,
    "end": 2053.895,
    "text": "So in some of the diagrams, and Daniel, you're really good at this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2054.336,
    "end": 2060.42,
    "text": "Some of the diagrams, the Markov blanket is literally an oval with the word discrepancy in it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2061.505,
    "end": 2074.556,
    "text": " And so all I would add on to what Blue was saying is that if you want a hard physical boundary and you want to discover what that is, I think you're looking at it again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2074.896,
    "end": 2081.982,
    "text": "Where does one thing end and another thing start as a relativity question?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2082.463,
    "end": 2083.684,
    "text": "What I'm suggesting is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2084.767,
    "end": 2094.409,
    "text": " if you're looking at the bottom up and the top down as relationship, not as a, which is, which is more powerful or holds more influence over the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2094.429,
    "end": 2101.45,
    "text": "If you're looking at it as a relationship, then it's that relationship holds as a discrepancy zone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2102.03,
    "end": 2107.171,
    "text": "It's not necessarily something that has a physical beginning and end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2107.631,
    "end": 2112.932,
    "text": "It's kind of, it's kind of fluid and it, and it's, it's not,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2113.362,
    "end": 2116.403,
    "text": " to say we shouldn't look at the relativity piece at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2116.924,
    "end": 2124.767,
    "text": "It is to say, let's have one eye on the relativity piece and the other eye on the relationship piece, the discrepancy between.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2125.068,
    "end": 2129.95,
    "text": "It doesn't lend itself to hard stops.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2131.891,
    "end": 2132.931,
    "text": "It's discrepancy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2133.131,
    "end": 2133.912,
    "text": "That's all that is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2133.952,
    "end": 2135.673,
    "text": "That's just what it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2135.713,
    "end": 2140.015,
    "text": "It means we're not sure about anything other than they're different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2140.815,
    "end": 2142.396,
    "text": "We don't know where...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2143.072,
    "end": 2156.218,
    "text": " where the separation boundary is, but that's kind of where this whole, let's bring these two papers together thing came from, because if we're actively inferring, we can bound around that discrepancy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2156.558,
    "end": 2158.379,
    "text": "It doesn't always have to be a partition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2158.999,
    "end": 2169.124,
    "text": "That's what the affordance is here, potentially, if we can have two things being held simultaneously or co-occurring.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2172.534,
    "end": 2195.367,
    "text": " all right wow well a lot there well first for the discrepancies textbook figure two three discrepancy not a blanket or discrepancy as blanket of blanket etc and uh that can be a continuous or discrete value but in non-idealized like non-singular path of least action settings",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2196.73,
    "end": 2218.998,
    "text": " aka real settings there's always a non-zero value so that's one way to leave the door always a little open in a way that just having two feet on zero or one or any rapid switching strategies of zeros and ones doesn't really capture that in the same way then blue great question like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2220.56,
    "end": 2239.269,
    "text": " We asked a little bit about, at the beginning, what is leading someone to consider something like a blanket in a realist or an instrumentalist light, and pointed to factors like the persistence of the organism and the reality of the action in flow with its environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2239.729,
    "end": 2241.55,
    "text": "So it kind of forces somebody to say, well,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2242.39,
    "end": 2253.102,
    "text": " if the environment is real then the entity and the actions and the semiosis of their actions are real if stop signs are real and stopping at a stop sign is real and they're all part of a non-equilibrium steady state",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2254.656,
    "end": 2258.999,
    "text": " What further realism does one want to know than that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2259.039,
    "end": 2260.24,
    "text": "Like, there is a territory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2260.96,
    "end": 2262.701,
    "text": "And then this is the maps of the territory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2263.281,
    "end": 2266.764,
    "text": "So is someone going to go all the way into territory skepticism?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2267.664,
    "end": 2269.906,
    "text": "Or how will they then reframe their stance?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2272.027,
    "end": 2282.514,
    "text": "Then on just a few other random pieces, this was in Livestream 3 when we read about communication in Active Inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2283.618,
    "end": 2311.081,
    "text": " and they are which is a lot of in the social inaction setting that we're bringing this abductive light to the social inactive setting that's really like expounded upon in the hippolyto and vaness paper that that goes into a lot of the scientific and philosophical aspects of social um so here they're borrowing from the framework of tinbergen's four questions",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2312.586,
    "end": 2339.996,
    "text": " and providing multiple scales of analysis that are all like the four y's and these four y's are kind of like a two by two quadrant and so then that allows in biology parallel research agendas and integration because like the fact that brain regions are connected to each other up here on the mechanism side",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2341.189,
    "end": 2367.026,
    "text": " is part of the picture but it's a yes and with the pattern of dna divergence times like you could imagine situations where they're correlated or not and they could be causated or not and it could be either way of causation or a confounding factor or any other number of things and then neither of those have a direct closed door on like what the bird song sounds like so without even going into what the bird song is like interpreted as",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2368.129,
    "end": 2392.618,
    "text": " there still is space within that interpretive or semiotic scientific approach that is hopefully as we can explore considering the research and the application in a different way than it's been partitioned in certain specific analyses in the past",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2397.912,
    "end": 2398.132,
    "text": " Dean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2401.714,
    "end": 2408.238,
    "text": "So I'll throw something out there, knowing that I have not really thought about it more than while I was listening to you talking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2408.899,
    "end": 2413.081,
    "text": "So if it's completely wrong, somebody can correct me really quickly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2413.281,
    "end": 2425.369,
    "text": "I think it's really interesting that both of these papers provide what I would consider to be a stable or a stabilizing effect on what",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2426.525,
    "end": 2432.33,
    "text": " we might describe as something resembling strategy for the potential for strategy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2433.23,
    "end": 2436.413,
    "text": "What I'm always thinking about is that strategy is not behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2436.433,
    "end": 2440.276,
    "text": "Behavior is usually given the label tactics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2441.237,
    "end": 2446.901,
    "text": "But strategy does include the anticipation and the logic that is applied.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2447.221,
    "end": 2454.607,
    "text": "And I think that's where we're not in conflict when we say there's a triadic,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2455.174,
    "end": 2458.515,
    "text": " and there's a co-construction of the social scene.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2459.296,
    "end": 2469.139,
    "text": "Because I think both of those things provide the stability or the platform then to strategize and minimize those prediction errors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2470.419,
    "end": 2483.344,
    "text": "So again, we can still build off of strategy and do, and we can still build off of strategy and eliminate bad consequential decisions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2484.637,
    "end": 2498.948,
    "text": " So again, that's the relationship as opposed to which one of these two approaches, these two top-down approaches is the thing that holds the most sway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2499.008,
    "end": 2514.4,
    "text": "Because at any given time, one or the other or both, as long as you don't get trapped in one, would actually be the most, I would think, would be the most option-generating",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2514.918,
    "end": 2521.703,
    "text": " not option selecting, because they talk in the abduction paper about the different types of abduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2522.584,
    "end": 2534.252,
    "text": "But they do heavily emphasize also that in the end, both of those types, the generating and the selecting, are essentially, you can't have one without the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2534.913,
    "end": 2538.135,
    "text": "So that's an interesting thing to incorporate here as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2539.556,
    "end": 2542.338,
    "text": "Or at least consider, I'm not saying you have to take it up,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2543.646,
    "end": 2547.949,
    "text": " But if you did, what would that look like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2548.009,
    "end": 2551.851,
    "text": "I'll just directly respond to a few pieces there, then Stephen, and then anyone else.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2552.031,
    "end": 2566.12,
    "text": "So very interesting connection with multi-scale prediction error or free energy minimization, uncertainty reduction, surprisal bounding in multi-scale systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2566.92,
    "end": 2572.944,
    "text": "And then in this social and active setting that Hippolyta and Van Ness brought to the forefront,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2574.073,
    "end": 2589.878,
    "text": " that is our gripper and gripped in a way that a little experiment on a fixed mirror active inference system or a system described by any of the conventional mechanics",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2590.731,
    "end": 2594.714,
    "text": " classical physics mechanics, statistical thermodynamics, quantum.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2595.674,
    "end": 2600.958,
    "text": "Kind of just going off on a prelude to upcoming discussions with Dalton.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2601.599,
    "end": 2613.087,
    "text": "But I think that we'll pull out an aspect, which is that the Bayesian mechanics broadens that discussion into the cognitive dynamics of active particles.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2614.027,
    "end": 2618.951,
    "text": "And so in that way, a ball falling becomes like a special case of active particles falling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2619.83,
    "end": 2647.328,
    "text": " could take various paths based upon their embodied affordances even if just described as if like the baseball is not following the parabola equation but that's how the real environment and active particle interact which is to say semiotically which is why they both papers mention abduction in the social context um and then you mentioned like these two top-down perspectives",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2648.846,
    "end": 2667.706,
    "text": " and how when we have the divergence between among like multi three body problem we have multiple ideas minimum of two hopefully more and then there are strange attractors there's there's live stream 32 there's live stream 26 everything happens in that space from the top down",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2668.487,
    "end": 2692.632,
    "text": " because there's always going to be a plurality from the bottom up so the one error that wouldn't just be the right core screening for sure is a singular eye of Mordor laser and that leads to basically the unexpected unexpected with the reality of the bottom up",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2694.028,
    "end": 2722.719,
    "text": " and then when there's divergences and continuous state spaces and paths in between top down then there's a bi-directional relationship with the top down and the bottom up or the inside out and the outside in because you could even move amongst those without feeling like we were like violating a system to sometimes use a left to right for time and then we could use right to left for time and so seeing those kinds of cognitive moves as accessible",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2723.795,
    "end": 2749.938,
    "text": " in a social setting and then cut tying that course lastly to you said that the two-stroke engine of abduction with the generating and selecting because the laser is not a generator and that's the anal the analogy of attention in a top-down system like we've seen models and and mental action several times steven yeah thanks daniel um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2751.527,
    "end": 2757.651,
    "text": " Would you be able to go back to that four by four that you had there with the ultimate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2757.931,
    "end": 2758.312,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2758.412,
    "end": 2772.922,
    "text": "And I think that this is really important because there's also this implicit enlightenment assumption that was always sitting in the background where up is good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2773.922,
    "end": 2776.304,
    "text": "And I think it's really interesting there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2776.424,
    "end": 2777.425,
    "text": "And I think you're absolutely right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2777.465,
    "end": 2778.085,
    "text": "It talks about ultimate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2780.017,
    "end": 2798.079,
    "text": " i think it's really curious and it talks about you know we talk about these interactions so this kind of interaction this is the ultimate set of interactions the robin and that is what the truth is seen as what's the rational truth when we go up and we get enlightened so then we can project down",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2798.94,
    "end": 2826.674,
    "text": " what's there and the idea of that what's coming up is interactions that's the general way it's thought and there was this magic box called emergence to sort of get around the fact that really we didn't know but i would i would challenge that not not to say that's that's not true in terms of how it's perceived but there's another way that bottom up can be explored and that is another way that truth can be explored there's there's rational truth",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2827.901,
    "end": 2840.39,
    "text": " And there's, which I thought ultimate is quite high, I get the sense that that is very much looking out as this is in built into those words, right, this assumption of enlightenment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2840.73,
    "end": 2847.815,
    "text": "But there's also intimate truth, intimate truth is different to rational truth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2848.456,
    "end": 2852.279,
    "text": "And intimate truth is not about interactions, it's about knowing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2852.299,
    "end": 2854.2,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2854.901,
    "end": 2876.921,
    "text": " it's about a deeper kind of knowing so when i go down it's not what's coming up in a bottom up it's what am i going well my only way to engage it is to go down into it does that make sense and that going down into it is also valuable it is not more primitive than enlightenment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2877.984,
    "end": 2887.812,
    "text": " And I think that goes to sort of a very foundational assumption, which we don't even notice it's there about science, that everything's trying to be enlightened.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2887.992,
    "end": 2890.254,
    "text": "But that is only partially true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2890.454,
    "end": 2894.478,
    "text": "And I think biology sort of knows that, but maybe can't speak to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2894.878,
    "end": 2896.619,
    "text": "Anyway, that's my little piece there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2900.462,
    "end": 2900.603,
    "text": "Two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2901.946,
    "end": 2930.746,
    "text": " try to connect that one layer closer to i think some academic traditions but by no mean uh normed ones but thanks everybody for sharing those it um reminds me of the direction taken in the uh one of the biographies i'll paste in the title here this is um evelyn fox keller's biography of barbara mcclintock and the title is a feeling for the organism and uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2932.552,
    "end": 2956.866,
    "text": " that takes a history and philosophy of science informed view like what is the feeling for the organism how does one have a feeling for the chromosomes like this belief that there were jumping genes from certain cytological observations and then how does that really play out when somebody is in a context",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2958.49,
    "end": 2963.153,
    "text": " of professionalism and like expectations around different people who look different and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2964.233,
    "end": 2966.454,
    "text": "So that takes a holistic look.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2966.494,
    "end": 2974.459,
    "text": "And I think there is that on this every or many cases, that kind of story to tell.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2975.639,
    "end": 2978.441,
    "text": "And so that is one bridge of connection.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2979.081,
    "end": 2979.341,
    "text": "Blue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2982.263,
    "end": 2984.964,
    "text": "From like the evolution standpoint.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2985.104,
    "end": 2986.165,
    "text": "And I think, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2986.887,
    "end": 2998.876,
    "text": " like part of the question that Steven asked earlier, like, can we take multiple trajectories, be it like top down, bottom up to arrive at the same conclusion or the same like end point?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3001.802,
    "end": 3026.578,
    "text": " And this is something like in evolution, there's like convergent evolution where, you know, completely different genetically unrelated species will arrive at the same trait or develop a very similar appearance that makes people think like, you know, before we had DNA relationships, like we had species lumped together because of their similar appearance that were actually completely like unrelated, like are very distant on the phylogenetic scale.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3028.632,
    "end": 3039.238,
    "text": " So it's an adaptation that we converge on the same feature, or we converge to the same argument, or the same place in some kind of space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3040.439,
    "end": 3042.36,
    "text": "And this is something that I think about a lot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3043.841,
    "end": 3052.026,
    "text": "And just going to the quantum perspective, can we all go from point A to point Z?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3054.04,
    "end": 3060.962,
    "text": " like traversing a different trajectory, but like if everything is time reversible, then that's not really possible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3061.062,
    "end": 3063.383,
    "text": "Like we can't converge to the same point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3063.403,
    "end": 3066.324,
    "text": "Like we have to follow a specific path.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3067.464,
    "end": 3069.785,
    "text": "If time reversibility holds true.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3072.465,
    "end": 3074.006,
    "text": "Sorry, had to just like throw that in there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3075.766,
    "end": 3076.607,
    "text": "Interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3077.187,
    "end": 3081.248,
    "text": "No, let's kind of return to some of our earlier frameworks, but",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3083.618,
    "end": 3084.639,
    "text": " fun stuff, I guess.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3086.261,
    "end": 3087.963,
    "text": "We knew we wanted to cover the Markov blanket.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3088.503,
    "end": 3094.51,
    "text": "We have explored some of the threads that justify",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3097.432,
    "end": 3121.045,
    "text": " the realist or even further stance though we still have a lot of questions from the last 20 minutes or whatever about like what leads somebody and what the implications are for being different stances causes and consequences of different stances why does that matter in general studying crystallography why does that matter for the social setting like decision making and governance or organization",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3122.455,
    "end": 3128.635,
    "text": " That was a justification broadly for abductions capacity",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3129.83,
    "end": 3155.372,
    "text": " to be compatible with active inference and form a type of probably valuable relationship both directions because active inference gains these cognitive features that were described before Bayes graphs were invented analogous to kind of Blue's suggestion that there was classifications that were some were really insightful, others were false clumpings or lumpings or whatever before there was a way to look at it differently.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3157.401,
    "end": 3183.46,
    "text": " that is some of what grounds a realist interpretation though again we're still not fully closed on what it means to be realist or why it matters but now let's go to the Markov blanket in action concept and similarly break down their angle on the blanket and understand maybe what leads them and what their suggested implications are for that stance",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3185.051,
    "end": 3213.346,
    "text": " what kind of a person do they think they're being by taking this cognitive social position which could be asked of both papers and all uh speech action and then um where's the beef then what is the what is the between there so anyone can go for it what is um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3215.413,
    "end": 3227.744,
    "text": " something to bring in about inaction, blankets, and or how everything is brought together in Hippolyta and Van Ness 21.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3232.328,
    "end": 3233.609,
    "text": "Yes, Dean, yeah, go take your time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3235.651,
    "end": 3242.377,
    "text": "So one of the things that I really like about this paper is again, it's the time it takes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3243.342,
    "end": 3259.067,
    "text": " and that they heavily emphasize that as part of this co-construction that enables people to gain some sense of what it means to be in a now social situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3259.268,
    "end": 3272.112,
    "text": "In fact, they talk about, and I'm not sure where it is in the paper, but they talk about the fact that people that are new to a cultural setting, it requires of them",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3273.055,
    "end": 3300.821,
    "text": " some time in order for them to be able to pick up on the non-linguistic non-verbal non-expressed information that's being passed within that social realm and that they're not picking up on so so what what enables that and that's when they spend a little bit of time sort of talking out why that could only be then considered a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3301.68,
    "end": 3307.804,
    "text": " The more you do within that condition, the more you pick up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3308.344,
    "end": 3311.526,
    "text": "You can't simply be watching.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3311.906,
    "end": 3317.229,
    "text": "In fact, the transition is going from spectator to actual doer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3317.749,
    "end": 3327.635,
    "text": "And so that's a heavy burden to put on the statistical landscape.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3328.439,
    "end": 3338.125,
    "text": " Because you don't sort of sit there and go, okay, so what's the probability that this person, who I can't really understand because I don't even know what they're saying because they're speaking a different language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3338.965,
    "end": 3340.046,
    "text": "What's the probability?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3340.106,
    "end": 3343.608,
    "text": "You don't sit there and kind of do those kind of calculations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3343.768,
    "end": 3347.57,
    "text": "Or maybe you do, but you're just not aware of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3348.19,
    "end": 3357.816,
    "text": "And you're not spending a whole lot of time with your calculator out trying to figure out what the distribution is while you are trying to,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3358.57,
    "end": 3370.256,
    "text": " co-construct or co-coordinate your active involvement in this new thing that you're now trying to be a part of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3371.196,
    "end": 3375.878,
    "text": "So that's one of the arguments that I really like about their paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3375.938,
    "end": 3387.804,
    "text": "They basically say, in order for this to work, first thing we have to appreciate is that there is a temporal commitment to making anything happen",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3388.499,
    "end": 3389.139,
    "text": " going forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3389.68,
    "end": 3397.523,
    "text": "If you don't have that temporal commitment, if you check out before you've even checked in, nothing changes, nothing happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3398.403,
    "end": 3404.846,
    "text": "So from a markup blanket standpoint, that essentially goes back to the discrepancy question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3405.446,
    "end": 3407.807,
    "text": "Is it a hard boundary?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3407.847,
    "end": 3409.208,
    "text": "Well, you can perceive it that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3409.488,
    "end": 3414.15,
    "text": "There's this limitation now because I don't speak their language or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3415.071,
    "end": 3421.215,
    "text": " You can look at it as now, what is this evolving discrepancy and how does it change?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3421.255,
    "end": 3422.135,
    "text": "How does it shift?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3422.555,
    "end": 3428.979,
    "text": "How does it deviate and then reconform, eventually oscillating down to some sort of agreement?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3429.96,
    "end": 3431.781,
    "text": "That is the instrumental piece.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3432.661,
    "end": 3438.745,
    "text": "I'm just saying most people aren't sitting there calculating that out as it's happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3438.865,
    "end": 3442.067,
    "text": "They're basically just trying to figure out what does Olay mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3448.154,
    "end": 3452.501,
    "text": " Lou, want to bring in anything on inaction, blankets, instrumentalism?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3452.841,
    "end": 3457.849,
    "text": "And then we can, after that, look at what the inactive writers say.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3464.312,
    "end": 3472.742,
    "text": " I think it's been said like in the in the inactivist and instrumentalist blanket perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3472.762,
    "end": 3473.022,
    "text": "I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3473.062,
    "end": 3477.086,
    "text": "That's always tends to be like the classic way that I think about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3477.126,
    "end": 3478.708,
    "text": "But let's let's see what the authors say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3478.728,
    "end": 3480.11,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3482.0,
    "end": 3507.681,
    "text": " let's see in the first half how they set up this question and then we'll end with a fork in the road that we can discuss all right so they start with similarly defining blanket we we could look at the word overlap in the future but it's a scale free tool don't know if scale free was said in the other situation it's introduced as a statistical tool that allows us to interpret",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3509.634,
    "end": 3529.174,
    "text": " and then again we see allow for interpreting so the language has already conveyed certain flexibilities if one is to take a charitable though narrow reading so this isn't the only way to read but just in terms of how",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3530.848,
    "end": 3553.455,
    "text": " below the surface an argument is framed as an as in addition to the direct rhetoric um immediately moving to the relationship with the physical boundary in the abductive case we saw highlighting of the reality of the closure of the action and influence Loop",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3554.704,
    "end": 3574.555,
    "text": " but there wasn't a justification of a physical boundary and so I do think it is interesting the earlier discussion with like how does the multi-agent or like agent-based model perspective as a scientific tool help us model blurry systems as like swarms that are a certain resolution or density away um then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3576.243,
    "end": 3593.405,
    "text": " going straight to the fristen variant of the markov blanket where there are already active and sensory states rather than introducing it first in the general case like that it's about statistical insulating sets that can then under",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3594.466,
    "end": 3609.538,
    "text": " perhaps some situations be partitioned to like an incoming representing sense and then an outgoing representing action aspect and so those are the blanket states sense and action s and a here and then b in their figure one is the box around s and a",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3610.481,
    "end": 3633.998,
    "text": " and then uh the eta and the mu they're like kind of like flips of each other I don't think that's the only reason why they're those letters and they don't have to be those letters none of them actually have to be those letters but this is the connectedness structure or sparsity of what both the authors are describing all right then here's the fork it is possible to understand active inference in two ways",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3636.067,
    "end": 3665.445,
    "text": " think we each had a few ways just today um a realist view that the properties of the model should be expected to exist as an ontological property in dot dot ontological being like not in the use of using the active inference ontology importantly differently enough but rather describing the philosophical ontological or real basis that's why it's associated with realism",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3667.771,
    "end": 3672.475,
    "text": " Then the second way is the non-realist view that the model is simply an instrumental tool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3673.415,
    "end": 3679.94,
    "text": "So we're at the fork of these two directions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3681.381,
    "end": 3682.282,
    "text": "What is the move, Dean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3685.064,
    "end": 3691.109,
    "text": "My sense of the move is that so does that not make up a whole?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3691.129,
    "end": 3694.691,
    "text": "And I'm not saying that in the tautological sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3694.751,
    "end": 3696.953,
    "text": "I'm saying if we're actively inferring",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3697.679,
    "end": 3723.022,
    "text": " as opposed to looking at a topic that's titled active inference, don't we want to incorporate the entirety, the complexity, or for the sake of, for the sake of being able to, to understand an action is, is active inference kind of, is it,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3724.062,
    "end": 3728.925,
    "text": " My question would be, how is active inference actually being used in each of these papers?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3730.406,
    "end": 3740.874,
    "text": "Is it founding the argument that we don't want to get complacent around theories through other minds?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3741.574,
    "end": 3747.078,
    "text": "Or is it sitting on top of that kind of the icing, kind of the way it can",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3747.523,
    "end": 3750.566,
    "text": " make sure that we don't go too far off the rails.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3750.926,
    "end": 3754.33,
    "text": "My argument is that it's both if we're actively inferring.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3760.476,
    "end": 3761.757,
    "text": "Blue, any thoughts?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3771.57,
    "end": 3771.89,
    "text": " I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3772.13,
    "end": 3774.031,
    "text": "How is active inference being used in each paper?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3774.111,
    "end": 3779.474,
    "text": "I just went to go like, look, like, like what, what is the, the drive home message?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3779.554,
    "end": 3783.216,
    "text": "I mean, maybe that's something that we can leave for the dot too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3785.257,
    "end": 3786.858,
    "text": "Where's the graphical abstract.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3787.879,
    "end": 3788.119,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3788.479,
    "end": 3790.04,
    "text": "For all of these strings.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3790.86,
    "end": 3795.483,
    "text": "Well, it is hard to fish stuff out of the abduction paper due to like the lack of figures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3795.883,
    "end": 3799.365,
    "text": "I had to like go find my own figures for, for the pretty picture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3803.177,
    "end": 3813.782,
    "text": " Okay, let's look one layer deeper at the three ways that they suggest that one can be a non-realist about Markov blankets.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3815.43,
    "end": 3836.003,
    "text": " be a whole nother intersection map with where's non-realist anti-realist pro-instrumentalist just we could do political compasses all over the map um and there would be even second level questions about how things are defined and what periods of times and just it's all good and so we try to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3837.489,
    "end": 3865.194,
    "text": " follow these again i i like dean the way that you've brought it back to like navigating in this continuous space between two ferns between two poles um at minimum and then that stays in a kind of dynamic navigational setting it's and then if you're the moth that's uh if you can't go too close to the lantern either lantern",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3866.454,
    "end": 3877.117,
    "text": " you hit one then you die so your flight stops there so that i think puts a very",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3878.709,
    "end": 3901.631,
    "text": " meaningful uh interpretive layer because just like mentioned the figures help with interpretation and shorter lists help like there's three reasons why I'm against this here they are one two and three those are important structures yet also there's a reason that people don't communicate through outlines",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3904.133,
    "end": 3931.899,
    "text": " outside of certain situations okay slight tangent but what are the three ways that they're suggesting one can be a non-realist about markup blankets one meaning less semantic tools this is going to be i think very interesting they do not hold semantic value interpretive value linguistic or otherwise other than that constructed by using them to understand or predict behavior",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3936.084,
    "end": 3960.329,
    "text": " in the situation where the scientist is studying the stop sign they could say yeah the statistical edge for me at mine is being used instrumentally and there would be a valid stance but especially when we take this semiotic view which is very similar to semantic and they have similar seed but the semiosis",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3961.345,
    "end": 3987.562,
    "text": " with a stop sign and the actual stopping and the social inaction of stopping and the development of the agent that led to them having that belief in that context that isn't just setting it up in terms of merely propositional logic which we hinted towards in the dot zero and many many of the peers in the commons.org articles lay it out much deeper but abduction is not",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3988.562,
    "end": 4003.884,
    "text": " a static set of rules alone, the generating selection cycle includes at the very least structured novelty arising from internal, external, and everything in between.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4004.865,
    "end": 4030.943,
    "text": " and a continuous type attention distribution and strategy on attention and so on so it's a much richer setting than potentially semantic which can mean in certain settings symbolic which is to say the kind of symbolic logic carried out by like a turing machine which can still be extensive so even a generous interpretation is still very um plausible",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4031.744,
    "end": 4059.384,
    "text": " but there's something different about semiosis and the biosemiotic that was mentioned in the other paper that is not one in the same as the researchers modeling of and that was also explored well by yellow burnberg in the 2016 paper the anticipating brain is not a scientist which contrasted a scientific analysis modality with",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4060.507,
    "end": 4079.993,
    "text": " the cognitive system as cognizer and distinguishing cognitive science in a way from that through ecological psychology dean yeah i was just going to tag on to that i think it in order for this to happen i think in theory it's easy to say um we don't place a waiting on our priors",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4081.846,
    "end": 4082.406,
    "text": " I simply don't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4082.446,
    "end": 4084.407,
    "text": "I remain objective throughout all of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4084.867,
    "end": 4099.032,
    "text": "But I don't think that most of us, even when we take that really strict scientific stance, are aware of the priorities and the weights that we have even subconsciously applied.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4099.793,
    "end": 4103.834,
    "text": "So, again, I think you can say...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4107.469,
    "end": 4109.309,
    "text": " There's no, there's no value add to this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4109.349,
    "end": 4123.252,
    "text": "I'm just, I'm just, I've removed myself from it and I'm just a passive observer of it, but I'm not sure how, how long we remain passive before we start applying weights and values to what it is that we're.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4124.412,
    "end": 4133.054,
    "text": "We're analyzing, especially in a situation, especially in situational analysis that are personal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4133.615,
    "end": 4135.596,
    "text": " and the consequences fall back on us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4135.716,
    "end": 4143.381,
    "text": "And now if you're simply watching something and there is no consequence upon you as the observer, maybe that's easier to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4143.501,
    "end": 4154.488,
    "text": "But if you get to a place where the scientist is part of the experiment, wow, show me how that switch gets turned off and you don't place a waiting on something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4157.389,
    "end": 4157.81,
    "text": "Very interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4158.78,
    "end": 4185.234,
    "text": " powerful and true and in many ways implicitly and explicitly the kind of messaging sometimes that i see in the information environment is about getting people to update their priors to believe that they're included in a larger problem which is an absolutely valid communication and perspective and the how of the path",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4186.355,
    "end": 4201.915,
    "text": " the homeostasis in the multi-level system and the critical path it has to follow including reflexivity and narrative and anticipation and this bottom-up top-down aspect it's that is social inaction",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4202.847,
    "end": 4208.509,
    "text": " Like people can argue that there's different social structures in different settings and it doesn't have to be a top bottom.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4208.529,
    "end": 4214.651,
    "text": "It doesn't have to be any specific metaphor or psychoanalytic like lens, basically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4216.191,
    "end": 4229.075,
    "text": "But the one shortcut to collapsing all of that complexity into a data point, this one trick is to approach it like an experiment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4229.997,
    "end": 4248.59,
    "text": " because that is what the experiment is in a way it is about finding a manifold where it's like this tube has this strand of dna and this set of things and then that allows the the paint on the wall and all these other factors of the true context to be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4249.972,
    "end": 4270.945,
    "text": " isolated from that's kind of like the partial information encapsulation or just any other type of system and then potentially we see like with quantum yes some persistent anomalies that suggested things were not always as they seemed however the real case study",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4272.156,
    "end": 4297.652,
    "text": " is not the quantum mechanics but is the bayesian mechanics with the psychological study and the neuroimaging study and the behavioral study by all kinds of uh people in all social and action settings and um that really does point towards some of the deeper implications of interactionism",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4299.431,
    "end": 4328.13,
    "text": " formal modeling of social and cognitive systems one could step out of that real life and enter into another and and situate themselves from like a third person perspective and look back onto this single path plane and see that as an experimenter and that is in many ways associated with metacognition",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4330.56,
    "end": 4336.781,
    "text": " However, can that observer claim realism versus instrumentalism?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4337.641,
    "end": 4340.282,
    "text": "Where are people speaking from in terms of that view?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4340.302,
    "end": 4342.062,
    "text": "I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4342.422,
    "end": 4347.243,
    "text": "I'm just bringing up that sort of like, are you, where are you?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4347.503,
    "end": 4354.625,
    "text": "And that really relates to the self-concept that Blue brought up and like the kind of situatedness with the self-concept and then realist instrumentalist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4354.725,
    "end": 4356.245,
    "text": "But let's move on through these points.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4356.965,
    "end": 4359.786,
    "text": "Second reason why one could be a non-realist about Markov Blankets.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4362.006,
    "end": 4391.19,
    "text": " one could merely view them as valuable fictions yes okay that allow abstracting certain features of a phenomena but a valuable fiction one could ask are all of the generated interpretations fictions valuable or not or so does saying it's a fiction and saying everything is a fiction is that um in what ways is that instrumental or in what ways is that realist",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4392.489,
    "end": 4403.393,
    "text": " making a real claim that that is the stuff which all things are, though it's not of the stuff that potentially somebody was taught about atoms in a certain classroom.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4404.353,
    "end": 4419.739,
    "text": "So the persistent divergence can lead some to think that one of those is scientifically grounded and another is metaphysically grounded and or open to preference, faith, or other preferences and concerns entering that discussion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4421.258,
    "end": 4448.72,
    "text": " then um okay the third one is you could be a non-realist about markov blankets because just because it's the success of the use of the markov blanket justifies the acceptance of the epistemic value of the model without necessarily making ontological claims in other words just because the epicycle model is fitting well",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4449.793,
    "end": 4451.574,
    "text": " doesn't mean it's really an epicycle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4451.754,
    "end": 4455.116,
    "text": "Just because the circular orbit model is fitting well, how well?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4455.997,
    "end": 4461.8,
    "text": "99%, until somebody comes along and goes 99.9 with a totally different model structure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4462.521,
    "end": 4476.33,
    "text": "So it's kind of like saying, how sure could you be about a realist interpretation of the structure of the model when as part of one's commitment to the scientific process, they might leave the door open",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4477.423,
    "end": 4482.724,
    "text": " to some future model with higher explanatory, predictive power, design and control, et cetera.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4483.144,
    "end": 4483.324,
    "text": "Dean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4484.045,
    "end": 4497.368,
    "text": "Yeah, that's, and I don't know where it is in the, we actually had it because I was looking at the slides from the 47.0 this morning, and there's a part that's highlighted in the other paper, the talks where Pierce says, leave the door open.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4497.848,
    "end": 4499.228,
    "text": "That's what abduction is about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4499.628,
    "end": 4501.329,
    "text": "It's simply the door is ajar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4501.829,
    "end": 4504.609,
    "text": "You don't have the certainty, but you have enough information",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4507.728,
    "end": 4523.304,
    "text": " to make a hypothesis, not an explanation to best, or not something rather to best explanation, but you can now, you now have something to move off of, to leverage off of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4524.145,
    "end": 4526.026,
    "text": "And that's because the door was left open.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4526.547,
    "end": 4528.449,
    "text": "So again, you can come at it from,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4529.229,
    "end": 4537.919,
    "text": " You can come at this conclusion, the third one, the success of the Markov blanket, through the instrumentalist lens, but there's people on the realist side that are saying the same thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4538.56,
    "end": 4545.028,
    "text": "The more open, the more likely it is that you'll actually get to the specifics sooner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4549.346,
    "end": 4555.932,
    "text": " Here's a fun ant example analogy to kind of bring it back to Steven's earlier request.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4557.174,
    "end": 4560.437,
    "text": "There's a faster is slower or slower is faster.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4561.838,
    "end": 4562.919,
    "text": "One can just imagine both ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4562.999,
    "end": 4573.449,
    "text": "But the empirical finding in ants is that during certain escape evacuation situations, like leaving a room where alarm pheromone has been spread,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4574.477,
    "end": 4597.06,
    "text": " that when there's like a constriction in the exits so the morphology of the nest that they've constructed when there's a constriction that situation in car traffic jams and in people crowd situations can be very deadly and that it can be associated with like a crush situation or a liquid to solid",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4597.941,
    "end": 4626.674,
    "text": " like jammed in and then a fracture which can have all kinds of issues on the center of where it happens whereas in the ants they slowed down their individual movement so it wasn't like some orderly cue everybody get in line and now we're going to wait for number so and so to be called this was like their response in the situation to the biosemiotics and the niche construction of escape",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4628.64,
    "end": 4639.825,
    "text": " was a slower is faster response such that, yes, their morphology as nest mates helps them, like by having legs that are wide out, they're physically insulating.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4640.046,
    "end": 4646.609,
    "text": "So it's not to say that that is the single thing for a human to semantically keep in mind in a physical escape setting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4648.29,
    "end": 4653.673,
    "text": "But active inference lets us pull back to those different settings.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4655.154,
    "end": 4673.047,
    "text": " and look at the ants and their view from the inside, the endosemiosis, like the pheromone perception, the neurobiology of the nestmate, and then there's the exosemiosis with the scientist, and then there are instruments in play.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4675.589,
    "end": 4675.829,
    "text": "Dean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4677.27,
    "end": 4680.293,
    "text": "So you're not thinking through ant minds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4680.793,
    "end": 4683.015,
    "text": "That would be T-T-A-M instead of T-T-O-M.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4684.508,
    "end": 4697.392,
    "text": " However, there is a sense that there is a hive mind at work, even though you cannot necessarily share that hive mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4697.792,
    "end": 4699.412,
    "text": "There is no blending.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4699.973,
    "end": 4701.213,
    "text": "There is an autonomy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4701.233,
    "end": 4711.296,
    "text": "And there is a sense that if I am a believer in the top-down version, which is enabled by an activism,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4712.611,
    "end": 4724.239,
    "text": " If I'm a believer in that, I can also understand without thinking through the mind of a realist, what that realist perspective is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4725.459,
    "end": 4742.05,
    "text": "So you're not, I would say that what Thomas and Inez wrote from a logical standpoint makes a lot of sense, but that doesn't disqualify my thinking of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4742.691,
    "end": 4753.115,
    "text": " And this other way of thinking from coexisting and having, I don't think, I don't know if the ants are watching Daniel or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4753.155,
    "end": 4753.735,
    "text": "Maybe they are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4753.975,
    "end": 4759.917,
    "text": "I mean, maybe there's another narrative that Daniel will share with us about when the ants became aware of him.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4759.957,
    "end": 4761.478,
    "text": "But I'll just tell you a quick story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4762.018,
    "end": 4763.959,
    "text": "I feed magpies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4764.239,
    "end": 4765.099,
    "text": "I feed corvids.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4766.24,
    "end": 4771.662,
    "text": "And what the corvids realized is it's me because they're very quick to recognize faces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4772.521,
    "end": 4775.704,
    "text": " And what they do is they return the favor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4775.864,
    "end": 4785.571,
    "text": "I get bones from dead things that they've eaten.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4785.991,
    "end": 4794.858,
    "text": "I get the bones set on the same rock that I placed the dog food on because they love this fish flavored dog food.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4795.338,
    "end": 4800.022,
    "text": "They actually return things and contribute back because they want me to continue",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4801.63,
    "end": 4816.86,
    "text": " So I don't know if ants do that, but I do know that other species, whether they would describe it as knowing my mind, certainly want to influence my behavior from a strategy standpoint.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4819.662,
    "end": 4819.902,
    "text": " Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4819.922,
    "end": 4821.763,
    "text": "A lot of points there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4822.404,
    "end": 4829.228,
    "text": "So that's in contrast with a framework like panpsychism or like the absence of psychism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4829.589,
    "end": 4849.462,
    "text": "So just totally putting aside many of those questions, you described like a pan-intentional stance-ism, a pan-strategism that allows for complex holobionts, blues microbiome, as well as the human, dog, supply chain, crow setting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4851.556,
    "end": 4858.339,
    "text": " allowing for those to exist and be modeled by decision-making, control theory, game theory, etc.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4859.519,
    "end": 4875.846,
    "text": "Because of the pragmatism of the game, it is like a doorway into considering all these situations as something to play, some games to signal through, some games to win in this way or to have this outcome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4876.406,
    "end": 4878.247,
    "text": "So that's pretty interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4879.108,
    "end": 4879.248,
    "text": "Then...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4881.141,
    "end": 4901.843,
    "text": " there's thinking through other species that's a very interesting idea and it'd be cool to design experiences like through games or art that could allow for different kinds of communication and then on the point in the abductive paper about the economy of science which we can return to that discussion of Pearson's concept",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4903.365,
    "end": 4905.689,
    "text": " it's like thinking through reviewers' minds.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4906.451,
    "end": 4913.824,
    "text": "And so just seeing also facets or thinking through my chess opponent's mind, it's not a total emulation of,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4915.72,
    "end": 4928.464,
    "text": " But being able to generate interfaces, affordances, policies, there's so much in a partial information situation that the entity has to generate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4929.204,
    "end": 4933.446,
    "text": "And the generation scope means that there has to be a strong selection mechanism too.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4934.066,
    "end": 4943.469,
    "text": "And those are the cycles of temporal abductive logic, which breaks us out of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4944.605,
    "end": 4951.233,
    "text": " the inductive, deductive, static, conceptual, dialectic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4952.529,
    "end": 4976.471,
    "text": " and this brings pragmatism action ecological psychology and so on so it's really fascinating to see what is flowing within that space of formal models of perception cognition and action which are thousands of years old and it will be important to understand so many of these different threads because they're not all quantitative",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4977.711,
    "end": 4984.233,
    "text": " And the abductive paper and the social and active paper are demonstrating two of the most important areas where that's the case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4984.753,
    "end": 4984.953,
    "text": "Dean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4985.794,
    "end": 4987.274,
    "text": "Yeah, just real quick on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4987.954,
    "end": 5001.639,
    "text": "So it wouldn't matter if I decided that I wanted to do a situational analysis and base that on the very real gifting exercise that's going on, or at least I'm interpreting it as a gifting exercise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5001.959,
    "end": 5003.539,
    "text": "That would be one approach that I could take.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5003.839,
    "end": 5006.28,
    "text": "The other approach I could take would be a very instrumentalist one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5006.707,
    "end": 5008.068,
    "text": " in terms of token exchange.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5009.308,
    "end": 5011.709,
    "text": "Either one of those things would work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5012.009,
    "end": 5018.512,
    "text": "Putting them together might be even more additive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5018.532,
    "end": 5019.253,
    "text": "I'm not sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5019.633,
    "end": 5021.054,
    "text": "I don't think it would be confusing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5021.614,
    "end": 5028.857,
    "text": "I think it would just provide two lenses on the same process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5028.917,
    "end": 5029.718,
    "text": "Looking at it,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5035.686,
    "end": 5037.488,
    "text": " Hippolyta and Vanessa's figure two and three.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5038.469,
    "end": 5050.501,
    "text": "So here is a perspective on social construction that they're pulling from non-inactivist or non-active inference perspectives.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5052.082,
    "end": 5059.089,
    "text": "The difference with figure three is the social action in figure two under the active inference framework is the coupling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5061.155,
    "end": 5070.561,
    "text": " And so there doesn't seem like there'd be even one kind of thing that would be captured by this gray box in the middle of figure three.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5071.482,
    "end": 5073.823,
    "text": "So play it safe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5076.405,
    "end": 5079.226,
    "text": "Take an instrumentalist perspective on this gray box.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5079.246,
    "end": 5080.087,
    "text": "Mm-hmm.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5081.923,
    "end": 5105.058,
    "text": " it's one very important node and interpretation and then pass that you know through the tubes to the abductive reviewer who looks at it and says yes and the social actors are engaging in abductive logic my background in pierce suggests that abduction",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5106.323,
    "end": 5111.745,
    "text": " primacy of the generation selection and the time dynamics and the flow of action with the environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5113.266,
    "end": 5118.188,
    "text": "From Peirce's work, abduction can be interpreted in a realist framework.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5120.589,
    "end": 5127.052,
    "text": "So this can be held instrumentally with this view, with this eye.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5128.313,
    "end": 5135.236,
    "text": "And one can then ask whether the abduction that you're modeling it doing abductive logic",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5136.167,
    "end": 5138.809,
    "text": " may even be able to hold an instrumental stance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5139.529,
    "end": 5146.794,
    "text": "But is it instrumental for the social actor, for the endosemiosis instead of from the exosemiosis?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5147.214,
    "end": 5147.434,
    "text": "Blue?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5150.476,
    "end": 5152.338,
    "text": "So you kind of took the words right out of my mouth there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5152.378,
    "end": 5152.758,
    "text": "Good job.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5154.279,
    "end": 5164.446,
    "text": "So is this gray box, this sociocultural meanings and model-based reasoning, can those be subsumed under...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5166.447,
    "end": 5183.375,
    "text": " are you asking if can it be a filter like is exosemiosis like the imputation of sociocultural meanings and model-based reasoning is that exosemiosis",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5188.51,
    "end": 5196.599,
    "text": " From the definitions that I've seen in the usages I've seen it, exo means from the outside, endo means inside, in general, in scientific words.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5197.08,
    "end": 5199.943,
    "text": "Semiosis is the meaning construction process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5200.704,
    "end": 5204.908,
    "text": "So exosemiosis is a view from the outside,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5205.669,
    "end": 5229.562,
    "text": " For example, looking at that stop sign situation unfold, looking at that ant pheromone situation unfold, whereas the endosemiosis is the interpretive semiotic process by which something comes to have an internal meaning, which then could be asked whether it's in a symbolic or a cognitive or an attentioned way and all these different aspects.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5229.663,
    "end": 5232.044,
    "text": "But I hope that that's an accurate distinction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5234.645,
    "end": 5254.846,
    "text": " are you actually are you are you at i'm trying to make this simple for my little brain are you asking whether or not person can take a third person perspective so i'm just like trying to understand like endosemiosis is very clear to me um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5257.393,
    "end": 5263.119,
    "text": " but, but like this exosemiosis, like when, when I like look it up, right, right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5263.199,
    "end": 5269.766,
    "text": "Like, so, um, endosemiosis is like the signal transmission into the interior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5269.866,
    "end": 5274.831,
    "text": "That's like endosemiosis, like the, um, right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5274.871,
    "end": 5280.837,
    "text": "Like the, the interpretation of signs into the inside, but like this exosemiosis is like between, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5282.108,
    "end": 5308.071,
    "text": " organisms like the sign interpretation and signal transmission between organisms of the same species or of different species like for example the ant pheromone like that's what i read as exosemiosis so when you look at that figure three like is that not exosemiosis i mean it looks like model representation and what was the other thing in there sorry i'm looking for the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5311.341,
    "end": 5312.842,
    "text": " here's a fun view, I think, on the exo.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5312.862,
    "end": 5314.824,
    "text": "So yes, I think we're in agreement here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5314.984,
    "end": 5325.012,
    "text": "Endosemiosis is like the signaling within the organism or the view from the inside, but that right there is the heart of also the boundary as a physical versus boundary as a functional.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5325.292,
    "end": 5335.42,
    "text": "So there's a whole complexity with biosemiotics, which is usually, I think, why people talk about the biosemiotics and just recognize the complexity rather than",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5336.314,
    "end": 5356.088,
    "text": " take a stance too early on that partitioning but then this one is the exosematic perspective constructing messages to alleged extraterrestrials so if we're looking who are the authors of that paper they're listed here douglas a coach but yeah let's um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5359.625,
    "end": 5379.338,
    "text": " Well, so, so just this like sociocultural meaning imputation and, and like in the meme paper that, um, Daniel and I just put out and in, um, with RJ and Marijula, um, the semiotic representation is culturally like relative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5379.379,
    "end": 5388.685,
    "text": "I mean, like there's no, a stop sign isn't going to be a stop sign to like someone in like the Aboriginal, like very like native primitive, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5389.465,
    "end": 5390.412,
    "text": " Like, lifestyle, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5390.432,
    "end": 5390.473,
    "text": "So...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5393.619,
    "end": 5420.576,
    "text": " this exo exosemiotic is like a transmission between organisms of the same species but like also like the same culture i would say because like how do you you can't like and even i don't know if that's true in pheromones like if pheromones and different ant species mean different things like the same pheromone can have more than one meaning is that also true or the same like kind of molecular compound i mean i think we probably don't know enough",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5423.955,
    "end": 5425.816,
    "text": " I think I understand what you're asking now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5425.916,
    "end": 5438.464,
    "text": "Is there an assumed sense that some type or form of entanglement has to be present for any of that to make sense?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5439.085,
    "end": 5449.591,
    "text": "To make sense implies that something has existed that didn't maybe exist in the distant past.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5451.266,
    "end": 5453.988,
    "text": " It wouldn't exist in a different context also.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5454.288,
    "end": 5460.112,
    "text": "So that's why the sociocultural meanings, like I think of that as like exosemiosis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5460.672,
    "end": 5461.593,
    "text": "Okay, I got you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5461.833,
    "end": 5462.173,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5466.536,
    "end": 5479.765,
    "text": "I mean, it kind of goes without saying that there's just different closenesses along different axes, like people who are speaking the same language, but different vocabularies or, you know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5480.991,
    "end": 5506.338,
    "text": " situation matters so much body language then the more uh distal or different the cognitive structure is relative to what it becomes harder to quote put yourself in their shoes and so on um and i feel like that's a big question with the multi-scale system phenomenas whether they're dissipative or persistent",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5507.97,
    "end": 5513.953,
    "text": " diverse intelligences, understanding what the water we swim in is cognitively and linguistically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5515.114,
    "end": 5522.618,
    "text": "Because the water we swim in, some of it is going to be the signal for something else.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5523.894,
    "end": 5532.979,
    "text": " It could be the influence signal, like the B matrix in ACT-INF, influencing causal relationships in the world as part of the water you swim in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5533.9,
    "end": 5547.607,
    "text": "It also could be modifications through StigmaG, niche modification, like your physical influences, which might be the water you swim in in the sense that you don't notice them, like many things that come of and through us we don't have direct awareness of.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5548.288,
    "end": 5551.97,
    "text": "So they're like the paint on the walls in that PCR.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5553.075,
    "end": 5567.493,
    "text": " experiment with amplifying the dna because it's the parts that whether we like it or not they get condensed down to a dot or a path and then that becomes our like sense making from local partial information",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5568.8,
    "end": 5574.342,
    "text": " as if a lot of the invisible part, we could just disregard and we do cognitively.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5574.602,
    "end": 5584.966,
    "text": "Like we talked about like the exhaust heat with Chris Fields and Quantum, like you have to burn information to pay attention and you have to pay attention to deal with a real complex niche.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5585.925,
    "end": 5615.095,
    "text": " so there's a lot of tensions in that path and uh especially with this dyad and i'm sure so much other related work but with this dyad and i think with the lens that dean you helped approach it to with um it is putting some of those threads into a different light and especially for those who",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5618.135,
    "end": 5627.31,
    "text": " in this semiotic way had some Bayesian surprise, some cognitive state updating from any number of different things",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5629.665,
    "end": 5652.584,
    "text": " that's like proof of concept social inaction but not in a corroded or in a performance art although who could say it's not performance art but still way that brings the realism into the social through the formal and other doors uh Dean and then blue",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5654.418,
    "end": 5657.0,
    "text": " I think I see both of these papers as pillars.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5657.1,
    "end": 5660.123,
    "text": "I see them as really stabilizing for different reasons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5660.843,
    "end": 5670.051,
    "text": "And I would rather stand on both of my feet and have something stable under both of them than try to stand on one or have both feet standing on one cylinder.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5670.071,
    "end": 5674.395,
    "text": "Because I find that just based on my form more difficult.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5675.616,
    "end": 5683.182,
    "text": "But as we tried to take up this new season of live streams and bringing two papers together, that felt like a frontier moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5684.059,
    "end": 5697.308,
    "text": " And I think that one of the things that I hope we have conveyed is that looking at two things at once is by nature more complicated, not necessarily complex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5697.328,
    "end": 5710.537,
    "text": "The complexity exists in each of the papers, but to look at two things at once is more complicated and therefore is more fraught with the error of the trial and error relationship.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5710.937,
    "end": 5713.779,
    "text": "I'm not saying that we made a bunch of mistakes, but I think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5717.074,
    "end": 5723.4,
    "text": " the first rule of generation is you won't get it right, right away.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5724.22,
    "end": 5730.966,
    "text": "You will have to, again, have that temporal commitment in order to be able to get wherever the heck you think you're going.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5730.986,
    "end": 5740.775,
    "text": "And I didn't really know where this was going to go other than I wonder what happens if we don't narrow our regime of attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5741.61,
    "end": 5756.356,
    "text": " and necessarily know that we were widening it, but I did know that at some point we might get the authors coming on and asking us, asking us why pick these two?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5756.416,
    "end": 5758.997,
    "text": "I don't think it has to necessarily be these two papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5759.077,
    "end": 5766.16,
    "text": "It's just that both of these papers create a nice symphony, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5766.72,
    "end": 5768.901,
    "text": "So it could be any set of papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5771.277,
    "end": 5777.082,
    "text": " takes a chocolatier or a wine connoisseur to really make the pairing special.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5778.303,
    "end": 5783.527,
    "text": "Yet there's other situations where any pairing can be potentially fruitful and insightful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5783.887,
    "end": 5789.751,
    "text": "Like sometimes I think about that in a community context, like you're always going to share between zero and one context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5790.632,
    "end": 5803.833,
    "text": " and wherever you are in that continuum the parts where you're sharing is awesome and the parts where you're different we can also respect as great or the overlap between two papers wow the word use was opposite or it was like contrary in some other way",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5804.952,
    "end": 5805.172,
    "text": " Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5805.853,
    "end": 5818.647,
    "text": "And then with the stance, so then I thought of the kind of like games where people have to stand on a single pole in a tropical, beautiful location and try not to fall.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5818.667,
    "end": 5821.891,
    "text": "So I thought when you have both feet, like you said, on one position...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5823.272,
    "end": 5850.166,
    "text": " narrow then buffets of wind are assaults on your non-equilibrium steady state especially when it's like which one of these one person is going to be a professor just as an example so why not resist and return to a fixed mode because that's like sort of the mode seeking that we heard about in some of Dalton and Maxwell's recent work",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5851.292,
    "end": 5878.002,
    "text": " the fixed mode is the center of gravity and then another way that you describe with like kind of having like a non-zero divergence and the space between is like in basketball the triple threat stance because you could dribble or pass or shoot by like going for the basket and uh yeah that's a different stance and it's also in a field of affordances",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5879.369,
    "end": 5881.551,
    "text": " So it's not just that they're in a different position.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5882.091,
    "end": 5884.834,
    "text": "The feet here are not much wider than the feet here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5886.215,
    "end": 5904.811,
    "text": "But this is the investigand mood, as Pierce would have maybe alluded to it, that in a context with an action, ecological psychology, all of that, in a context with an instrument and a game,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5906.426,
    "end": 5934.438,
    "text": " and something outside the game that supported the game all those levels are in the triple threat but the how did i get here why am i on the green one is a limited context and um yes it's still highly skilled nobody's questioning how how much energy is being poured into doing that thing that's that's hard work",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5936.297,
    "end": 5938.398,
    "text": " And there's a huge reward for doing it well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5939.158,
    "end": 5939.858,
    "text": "And there's many.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5940.158,
    "end": 5946.54,
    "text": "And so I totally agree and didn't even intend that people could have trained a lot for this one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5946.96,
    "end": 5948.581,
    "text": "This could be someone who doesn't play basketball.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5949.361,
    "end": 5965.306,
    "text": "And so that's why it has to be a little dynamic and situational, but just seeing them as kind of like extreme modes of paper interpretation in an extended paper interpretive metaphor, one could see different modes of receiving",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5966.624,
    "end": 5987.921,
    "text": " semiosis from literature or discourse and then what is the role of participation and feedback and then that multi-agent setting that we mentioned hope that's not too random um in our last oh yeah blue go for it",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5990.046,
    "end": 6000.435,
    "text": " So one like pairing of papers that I would have liked to have done is this abductive reasoning paper with the Crisfields quantum theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6000.666,
    "end": 6002.607,
    "text": " paper, the one from the 40.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6002.647,
    "end": 6007.008,
    "text": "Because I was just reminded of it so much as I was reading through the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6007.028,
    "end": 6016.21,
    "text": "And just learning about abductive reasoning and what does that look like, and how in abductive reasoning, you don't have complete information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6016.29,
    "end": 6017.831,
    "text": "It's partially observable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6017.951,
    "end": 6022.012,
    "text": "And so you just make your best prediction from a partial observation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6022.072,
    "end": 6025.533,
    "text": "And it made me think of the overlapping quantum reference frames.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6026.462,
    "end": 6034.324,
    "text": " where you can't get full overlap with someone else's quantum reference frame.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6035.344,
    "end": 6047.767,
    "text": "Even with perfect learning, there's still going to be some noise or some overlap between the quantum reference or some incongruence between the quantum reference frames, some area that's not overlapping.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6048.487,
    "end": 6049.107,
    "text": "So I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6050.127,
    "end": 6053.368,
    "text": "Those two things, that's one pairing that I would have liked to see.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6056.94,
    "end": 6058.623,
    "text": " That's really interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6059.824,
    "end": 6069.339,
    "text": "As alluded to earlier, the quantum broke the glass on the reflexivity question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6070.743,
    "end": 6099.601,
    "text": " in philosophy of science i hope that's not too overstated to say and it wasn't the only piece in the building or the weakening of the glass but the earlier mentioned persistent anomaly regarding experimental context expanded the scope of certain questions in science beyond discourse in certain cultural circles during the last like 500 years that stephen alluded to parts of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6101.092,
    "end": 6110.196,
    "text": " So quantum is where this abductive temporal relationality, it's there when you see it, now it's not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6111.237,
    "end": 6116.819,
    "text": "Protoactive particle, oh, if the electron were just a pebble, this wouldn't be happening.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6117.72,
    "end": 6117.76,
    "text": "Or...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6118.88,
    "end": 6122.002,
    "text": " If the electron were a pebble that were bigger, this wouldn't be happening.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6122.042,
    "end": 6123.243,
    "text": "But would it not be happening?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6123.363,
    "end": 6126.385,
    "text": "Or would it not be happening because we could measure it better?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6127.386,
    "end": 6147.299,
    "text": "All of those questions about points and particles and waves, under Bayesian mechanics, as a mechanics for cognitive particles, the reflexivity now can flow in not just from electron scale,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6148.763,
    "end": 6176.859,
    "text": " but i feel like there are multiple contact services with reflexivity at the semiotic narrative ecological the real scales outside of the experiment and i think that is what partially speaks to the way that we entered this dot one discussion too so um in our last five or ten minutes",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6178.038,
    "end": 6199.959,
    "text": " what would we like to have or note for dot two just to the authors if they listen to this in the time between or not we're looking forward to talking to anybody who wants to whether it's for the dot two or any point in the future there's always a dot three affordance so we hope to continue this discussion with those who have authored",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6200.905,
    "end": 6213.219,
    "text": " those who haven't not yet authored because there's so much to build on on on this vector so both of you though feel free to as long as you would like just mention any points that you want to discuss for next week",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6219.107,
    "end": 6242.587,
    "text": " dean um had brought up earlier like where where is active inference is it is it the basis is it like resting on top of is there some kind of duality there i think like that's something that i would like to kind of look back at each paper and and figure out like where i where i want to put um active inference in that pillar or on that pillar or is it the pillar i don't know",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6244.164,
    "end": 6270.887,
    "text": " yeah are we going to be able to go with our active inference colored highlighter and say okay these two words yep or you know this clause yep this paragraph with this paper or this interaction of the paper this tool developed by the paper where would one be looking to highlight how I saw the paper Dean",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6272.176,
    "end": 6275.618,
    "text": " Because I know Stephen would completely agree with Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6275.638,
    "end": 6280.122,
    "text": "Can I just get you to put behind where in brackets when is active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6281.222,
    "end": 6287.307,
    "text": "Because again, I think that matters so much if we're talking about adaptive logic and retroduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6288.067,
    "end": 6296.533,
    "text": "The other thing is that I hope that Blue's thinking about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6297.281,
    "end": 6301.164,
    "text": " Well, what if we pulled other papers and entangled them?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6301.184,
    "end": 6302.345,
    "text": "What might that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6302.746,
    "end": 6303.827,
    "text": "I hope that's an opening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6305.048,
    "end": 6305.788,
    "text": "I will say this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6305.808,
    "end": 6321.161,
    "text": "It takes an incredible amount of preparation to pull two papers together and not do the proper respect for the amount of work that the authors, the originators of that work have done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6321.722,
    "end": 6324.624,
    "text": "So whatever the preparation is in terms of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6325.1,
    "end": 6328.623,
    "text": " quantifying it for a single paper to do it justice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6329.483,
    "end": 6348.638,
    "text": "It's many multiples of that to quote two papers, but I think if we are going to be active inferrers, not just subject matter experts on active inference, that exercise, as difficult and as time consuming as it is, it literally changes the game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6348.718,
    "end": 6350.059,
    "text": "As we talked about the game here,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6350.711,
    "end": 6358.953,
    "text": " quite a bit today, which again, I didn't think that was going to come up, but thank goodness it did, because it's not all additional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6359.233,
    "end": 6365.555,
    "text": "The game can be everybody gets in the canoe and works together to arrive at the Hawaiian Islands.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6365.915,
    "end": 6369.355,
    "text": "That can literally be the game, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6369.455,
    "end": 6371.116,
    "text": "It doesn't have to be a competition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6371.936,
    "end": 6372.736,
    "text": "It's not a race.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6373.116,
    "end": 6380.118,
    "text": "It's do we survive given the limited amount of information that we need to glean here",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6381.148,
    "end": 6386.95,
    "text": " as important to our ability to continue on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6387.01,
    "end": 6389.691,
    "text": "I think that's what being an active inferrer is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6390.251,
    "end": 6395.934,
    "text": "That's where the shift from a subject matter expert to a prediction matter expert actually transitions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6396.614,
    "end": 6406.117,
    "text": "So I want to thank people again for what feels like hanging yourself out there in a real risky way, because it is risky.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6406.377,
    "end": 6407.718,
    "text": "That's what it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6411.206,
    "end": 6433.256,
    "text": " thanks again there's so much to say i hope that it's an honor and a privilege to be in epistemic spaces and have one's homeostatic variables secured so that opens up an amazing space and approach the temporal aspect of abduction",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6434.216,
    "end": 6448.323,
    "text": " sounds so great to return to because i think another one of those points of contact communication is the dynamic what were the only formalisms in either paper in terms of like equations and mathematical symbols",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6449.645,
    "end": 6465.89,
    "text": " It was three representations of dynamical systems of Hippolyto and Van Ness to connect and ground a contact point from where they were taking a stance and a skilled performance into the mathematical symbolic",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6466.65,
    "end": 6491.912,
    "text": " scientific someone says this paper is a philosophy paper yes but it has equations so that is going to come to be something different and then you thought reading a paper would change the game but reading multiple papers changes the game and it is in a way true it is more Reds to keep in mind because",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6493.537,
    "end": 6517.888,
    "text": " at least under some norms and preferences for paper discussions like personally i prefer and find myself at home when people don't extensively speak from what a person thought and take the endosemiotic perspective from them or from like a whole culture which seems implausible to me but situates the exosemiosis of themself",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6519.364,
    "end": 6524.009,
    "text": " in relationship with a non-trivial endosemiosis?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6524.971,
    "end": 6527.834,
    "text": "And where do those two threads meet?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6528.034,
    "end": 6537.285,
    "text": "In the blanket, which is in potentially its most elegant coarse graining represented by the gray box here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6538.76,
    "end": 6561.294,
    "text": " and why would we want to delimit or even grip maybe the grippers that we have at this point are like car pliers and this is something very different and or something active so at this or any point in time it seems absolutely valid",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6562.099,
    "end": 6586.362,
    "text": " to look at the structure of figure two and three and hold so many stances at once or in rapid navigation so wow what a fun discussion thanks steven for joining and blue and dean and we will look forward to some interesting times in the dot 2 and beyond so peace out",
    "speaker": "SPEAKER_03"
  }
]