[
  {
    "start": 22.005,
    "end": 51.706,
    "text": " hello everyone welcome to actin live stream number 47.2 it is August 17th 2022 and I'll just quickly update the video now it's really August 17th we're having our third discussion of the set of papers in active dynamic social cognition and active inference and active inference and abduction",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 54.4,
    "end": 78.07,
    "text": " welcome to the active inference institute we're a participatory online institute that is communicating learning and practicing applied to active inference you can find us at links here this is a recorded in an archived live stream so please provide feedback so we can improve our work all backgrounds and perspectives are welcome and we'll be following video etiquette for live streams",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 79.608,
    "end": 81.171,
    "text": " at ActiveInference.org.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 81.472,
    "end": 89.587,
    "text": "You can find out more about participating in projects like the live stream and also a lot of other learning groups and projects ongoing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 91.172,
    "end": 103.377,
    "text": " We're here today in our third discussion around this dyad of papers, both from 2021, Active Inference and Abduction and Inactive Dynamic Social Cognition and Active Inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 104.098,
    "end": 109.26,
    "text": "So check out 47.0 and 47.1 for more background and to kind of get up to where we are now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 116.778,
    "end": 121.359,
    "text": " let's go to the introductions and then we're going to take it where it goes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 122.38,
    "end": 129.542,
    "text": "So I'm Daniel, I'm a researcher in California and I'll pass it to Dean and then to Steven.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 131.662,
    "end": 132.342,
    "text": "Hi, I'm Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 132.402,
    "end": 133.363,
    "text": "I'm here in Calgary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 133.783,
    "end": 138.404,
    "text": "I guess I'm still a researcher, although I'm a retired one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 140.485,
    "end": 141.125,
    "text": "Basically,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 141.82,
    "end": 163.098,
    "text": " This is an opportunity to have one of the authors with us, which I think is fantastic, and essentially sort of take this from all the things that we've set up to now and get an opportunity to sort of get through the lens of the authors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 163.379,
    "end": 165.2,
    "text": "And so I'm really excited about that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 165.22,
    "end": 166.081,
    "text": "I'll pass it over to Stephen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 167.847,
    "end": 168.367,
    "text": " Thanks, Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 168.508,
    "end": 169.288,
    "text": "So yeah, I'm Stephen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 169.328,
    "end": 170.509,
    "text": "I'm based in Toronto.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 170.529,
    "end": 177.914,
    "text": "I work a lot with spatial meaning making, participatory theatre and dialogue approaches.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 178.115,
    "end": 184.819,
    "text": "And yeah, I'm really pleased to have the author here today, one of the authors, and also to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 185.86,
    "end": 207.536,
    "text": " for me i'm really interested in in what we're doing here because of um the ability to get beyond what's often just called emergence um emergence through the mind body or emergence through some sort of loop that's being explained in an action or emergence that people just talk about when things interact and something happens well i i see",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 208.297,
    "end": 227.959,
    "text": " this work with abduction or the work with abduction as being a way to make a much more tractable way for living things that start to make things happen be thought of and not just call everything emergence so I see both these two as being",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 229.076,
    "end": 240.209,
    "text": " big kind of black boxes that we can maybe shine some light on and that will help a lot of people so yeah i pass it back should i pass it to you daniel first",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 241.209,
    "end": 246.652,
    "text": " Well, Majid, go for it and just say anything you'd like to, any context on the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 247.712,
    "end": 249.113,
    "text": "I'm Majid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 249.453,
    "end": 254.156,
    "text": "I'm a philosopher of science based in Ankara, Middle East Technical University.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 254.216,
    "end": 264.141,
    "text": "And I thank the organizer for this wonderful event and for the good and graceful discussion of the ideas and themes of the papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 264.241,
    "end": 268.844,
    "text": "I do not know if I can add anything that has not been discussed already in the past couple of sessions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 270.186,
    "end": 271.974,
    "text": " So I think that this is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 273.772,
    "end": 276.494,
    "text": " Well, there has been for the past few years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 277.154,
    "end": 282.298,
    "text": "So I'm the second author of one of the papers, Abduction and Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 282.378,
    "end": 288.522,
    "text": "And the other author, Asti, is a renowned Charles Sanders Paris school.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 288.582,
    "end": 294.726,
    "text": "So I mainly can take credit only for the parts that are about active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 294.786,
    "end": 303.312,
    "text": "I'm not an expert in Paris ideas or in semiotics for that matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 304.112,
    "end": 319.45,
    "text": " I also have been doubling from time to time in biosemiotics and I was searching for a way to be able to ground semantics in nature, to be able to ground semantics in natural world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 321.572,
    "end": 337.499,
    "text": " which is very tricky because it seems that to the extent that we are engaging in natural processes, we can see mechanisms, we can see processes, but meaning is something that emerges at some point, something that has not been there before in the nature itself, which",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 339.92,
    "end": 349.882,
    "text": " doesn't completely sound right because, well, it seems that everything has to be come from nature at some stage, but it is not like a continuum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 350.583,
    "end": 368.187,
    "text": "So I was thinking of finding a way for, an action-oriented way for being able to speak about meaning and representation and, well, the inactivist embodied approaches in cognitive science and philosophy of science are very well established, you know, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 369.207,
    "end": 385.759,
    "text": " To be able to grow semantics, semiotics in action, we came to the conclusion that active inference may provide a nice way, a nice way that is well supported by what we know in the sense of computational neuroscience and theoretical biology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 386.319,
    "end": 397.668,
    "text": "To be able to explain how some linguistic concepts, some semiotic concepts can be explicated in natural terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 398.408,
    "end": 407.132,
    "text": " I don't know if any of that makes any sense to you, but it was what we were trying to do in this paper and a couple of other papers that we were composing together, altering together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 409.493,
    "end": 409.833,
    "text": "Excellent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 410.153,
    "end": 411.474,
    "text": "Thanks for that context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 411.594,
    "end": 411.814,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 412.934,
    "end": 415.155,
    "text": "So, Masheed, I got to ask you a question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 415.175,
    "end": 424.54,
    "text": "So lots of times when we're talking about semantics, we tend to see them written down on pieces of paper as an example, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 425.16,
    "end": 427.781,
    "text": "But when you say semantics in nature,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 429.43,
    "end": 439.376,
    "text": " One of the questions that we've danced around but not sort of spoken to directly is sort of semantics as nature, maybe semantics surrounding us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 439.796,
    "end": 457.188,
    "text": "And the abduction paper really helped us understand maybe the perspective that instead of us moving towards and seeing semantics or generating semantics, us being available to that information around us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 457.348,
    "end": 458.409,
    "text": "What's your sense?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 459.068,
    "end": 475.321,
    "text": " after sort of, I don't know if you've embraced Peirce's philosophy, but after at least engaging with it, what is your sense of what semantics are as nature as opposed to sort of embedded in nature?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 479.264,
    "end": 486.089,
    "text": "Well, that's a very good question and also a difficult one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 488.82,
    "end": 498.204,
    "text": " What I was trying to speak about was grounding semantics in nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 498.304,
    "end": 507.808,
    "text": "Sometimes I also think of our informational trade-off with environment in semantical terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 509.696,
    "end": 515.86,
    "text": " Some other times, I think that perhaps we are reading what we think about the world into the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 515.88,
    "end": 517.642,
    "text": "Perhaps there are no meanings in the world itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 517.682,
    "end": 520.824,
    "text": "I think that if we want to be erotically naturalist about the world,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 524.737,
    "end": 532.241,
    "text": " the natural world doesn't contain semiotic in the sense that, for example, artificial languages, human-made languages contain semiotics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 532.281,
    "end": 535.262,
    "text": "That much is, I think, more or less obvious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 535.803,
    "end": 543.166,
    "text": "I think that we can treat semiotic into the nature, the same kind of semiotic that we can find in human-made languages into the nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 543.186,
    "end": 543.907,
    "text": "I think that that's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 544.847,
    "end": 545.548,
    "text": " obvious too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 546.088,
    "end": 561.002,
    "text": "On the other hand, the things that are made by human beings are in a sense natural because human beings are natural entities and they have this kind of natural capacities to be able to communicate with one another and with their environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 561.022,
    "end": 564.505,
    "text": "So there should be some sort of natural, it couldn't just come from nothing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 565.306,
    "end": 568.289,
    "text": "It should be some sort of natural basis for that, which is basically",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 570.78,
    "end": 578.692,
    "text": " I like to think of that in terms of human beings or the community of human beings, action-oriented interaction with one another and with nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 578.772,
    "end": 583.6,
    "text": "So if you think of semantic in this sense, thinking of being",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 584.975,
    "end": 590.782,
    "text": " in semantics, or being surging in semantics, or enveloped in semantics in this sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 590.862,
    "end": 602.536,
    "text": "I completely agree with you, because I think that even though it is not precisely as well-stated semantics that we can find in an artificial language,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 603.877,
    "end": 619.257,
    "text": " some sort of trade-off of information between human beings, between organisms, self-organizing complex systems with one another, biotic self-organizing complex systems with one another, and with their environment, either individually or collectively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 620.317,
    "end": 640.082,
    "text": " And I think that this provides a good natural basis for also understanding semiotics in the sense of the signs that we interpret, the interpreted signs that we use in writing books or, I don't know, different source of communication, the more advanced ways of communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 643.423,
    "end": 643.763,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 643.884,
    "end": 644.184,
    "text": "Stephen?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 646.184,
    "end": 647.184,
    "text": "Yeah, thanks, Majid.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 647.204,
    "end": 649.065,
    "text": "I was wondering, when you're talking about these",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 650.433,
    "end": 677.199,
    "text": " more advanced forms of communication or biological ways of um having semantics whether that's far more entropic far more um dispersive than what would happen when we think of it in our traditional literature of uh words and uh ways that we would have ontologies and computers so is there kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 678.459,
    "end": 687.172,
    "text": " some other is it an a a completely different process or is it like another flavor of what's your thoughts on that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 688.675,
    "end": 691.937,
    "text": " I'm sorry, I was not quite clear about what I was trying to say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 691.977,
    "end": 693.537,
    "text": "What I was trying to say is this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 695.118,
    "end": 703.961,
    "text": "By speaking of the advanced forms of communication, I intend to refer to advanced form in comparison with the rudimentary natural form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 704.021,
    "end": 713.385,
    "text": "So, for example, the way that we are speaking together, or the way that Danny is just writing down the ideas on the screen and that sort of stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 713.445,
    "end": 715.786,
    "text": "I think that these are advanced ways of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 720.65,
    "end": 724.113,
    "text": " conducting some sort of semantic enterprise because we can communicate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 724.153,
    "end": 729.459,
    "text": "And by speaking of that in terms of advanced, I just wanted to say that it is more advanced that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 730.905,
    "end": 737.867,
    "text": " I don't know, the very basic cases, for example, very basic cases that we can see in the natural world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 737.887,
    "end": 748.431,
    "text": "So for example, how the signaling processes in terms of biological, terrestrial biology, cellular biology, that sort of stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 748.671,
    "end": 756.974,
    "text": "So I think that I'm seeing that in terms of some sort of theory of evolution, how creatures or how self-organizing systems",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 757.874,
    "end": 767.859,
    "text": " start to communicate with one another and with their environment, even at the cellular level or at the level of population of cells or neurons or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 767.879,
    "end": 786.368,
    "text": "So there are the rudimentary ways, but at the same time, there are more advanced ways of communication, meaningful communication, such as what we do in human societies, whether in terms of individual or what we do in libraries, institutes, and recently in terms of human artifact interact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 786.408,
    "end": 787.209,
    "text": "So it was what I've",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 787.589,
    "end": 799.833,
    "text": " And I think that the story, the main story, what persuaded us, what motivated us to look into active inference was that we wanted to find some sort of natural basis for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 799.993,
    "end": 801.773,
    "text": "And you are completely right again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 801.813,
    "end": 810.676,
    "text": "We were thinking of that in terms of the entropy of system, keeping the entropy of this information, entropy of the system within the bone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 810.776,
    "end": 814.837,
    "text": "So like everything else that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 816.246,
    "end": 820.069,
    "text": " has been constructed around the notion of active inference and free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 820.149,
    "end": 835.86,
    "text": "The core of the story is that in order to be able to maximize the chance of their survival, the biotech self-organizing systems have to be able to keep their entropy or their surprise within the bones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 835.92,
    "end": 838.442,
    "text": "And in order to be able to do that, they have to be able",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 839.443,
    "end": 842.725,
    "text": " to find ways to optimize their moods of communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 842.745,
    "end": 850.969,
    "text": "And I think that this provides a basis for the generation of semantics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 851.189,
    "end": 856.231,
    "text": "So in order to be able to maximize the chance of survival, we need to be able to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 857.492,
    "end": 863.738,
    "text": " gets to some level of competence, and reaching that level of competence seems to be impossible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 864.058,
    "end": 879.972,
    "text": "So I think that to the extent that this story is action-oriented, to the extent that it tries to ground semantics in nature or semiotics in nature, I think that this is completely faithful to the pragmatists, to the Persian origins.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 880.012,
    "end": 882.434,
    "text": "But then again, I'm not an expert in that field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 884.588,
    "end": 885.309,
    "text": " Yep, thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 885.349,
    "end": 906.463,
    "text": "Like what I heard there is that active inference helps us find patterns across systems by framing them within a common lens of keeping their entropy or their surprisal bounded in engagement with their environment, which can include other entities like themselves or just a niche more generally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 907.264,
    "end": 910.766,
    "text": "And maintaining that survivable bound",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 911.627,
    "end": 920.515,
    "text": " homeostasis and all of the variants that we've discussed in other times, it's going to have different features in cells, bodies, computer programs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 920.595,
    "end": 929.743,
    "text": "Like a computer program is a specifically constructed entity where one extra parenthesis or period is going to lead to a halt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 930.403,
    "end": 938.63,
    "text": "But this continuous embodied and inactive nature of the biological engagement, the biosemiosis,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 939.531,
    "end": 944.634,
    "text": " which is what is pointed to in the formalisms that we saw in Hippolyto and Van Ness paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 944.754,
    "end": 952.86,
    "text": "Again, the only formalisms they brought in the paper rather than citing out to were about things changing through time continuously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 953.78,
    "end": 968.35,
    "text": "And so, yes, for sure, maintaining the bounds of computer programs in a digital and in a fragile setting is different than maintaining the bounds of survivability for like a cell or for a linguistic entity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 969.557,
    "end": 976.066,
    "text": " And they are different, but they can't even be said to be different unless we have some ways of juxtaposing and contrasting them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 977.508,
    "end": 980.112,
    "text": "So, Stephen, and then anyone else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 981.471,
    "end": 999.079,
    "text": " yeah thanks thanks for that clarity there majid is one thing that i think also this ties to and i think um having this move from semiotics into like this broader kind of unifying theory of active influence is really interesting and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1000.8,
    "end": 1028.967,
    "text": " it speaks to some extent as well to the when you say advanced communication it speaks to what we often think of in complexity work around complex and complicated so it's like organisms and life has this complex adaptive non-linear processing and then there's these kind of simple to more and more complicated ways of engaging the niche to do things to have",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1029.927,
    "end": 1058.164,
    "text": " sort of systems of performative action using objects using in in the case of words that can also be seen as objects so is this kind of parallel evolution between complicated things being manipulated and simple processes of things being manipulated and the complex sort of non-linear abducted processes of the uh that's all going on underneath all of that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1062.321,
    "end": 1062.802,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1064.604,
    "end": 1065.025,
    "text": "Very well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1065.846,
    "end": 1071.515,
    "text": "Look, there are a bunch of technical notions such as complexity and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1074.642,
    "end": 1084.507,
    "text": " I try to speak of this in terms of the basic ideas that I have in terms of philosophy of science, because I'm basically a philosopher, philosopher of science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1084.527,
    "end": 1099.835,
    "text": "So when I speak of more advanced form, when I and what I have in mind in terms of sophistication of ideas, I don't know whether it could be translated into the technical notion of complexity, but I'm seeing that like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1099.895,
    "end": 1102.476,
    "text": "Look, so there is interaction between",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1103.897,
    "end": 1130.168,
    "text": " organisms so take the individual fish in the in a school of fish or take the monkeys in a horde of monkeys or uh or bears and flock or anything that of that sort and they have to be able to communicate they have to be able to try to make sense take two bears that are trying to sing to to perform a duet to sing from the same human",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1131.228,
    "end": 1148.441,
    "text": " It seems that they are engaging in some sort of harmonious activity, and in order to be able to do that, they have to be able to communicate in a successful way that altogether minimizes the overall information entropy of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1148.801,
    "end": 1157.768,
    "text": "By speaking of more advanced form, I'm not only thinking of these simple forms of communication between birds and other kinds of organisms,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1159.638,
    "end": 1179.329,
    "text": " But in terms of the sophisticated cultural forms of communication that we use, poetry, sonnets, I don't know, scientific theories, which usually come, especially in case of science, come with very sophisticated, theoretical and mathematical, sometimes formulation, notation, and you're completely right again, they demand...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1183.092,
    "end": 1191.225,
    "text": " the right amount of manipulation because you need to always test the theories and confirm them or falsify them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1191.265,
    "end": 1194.33,
    "text": "So this kind of engagement between human beings also",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1196.374,
    "end": 1219.067,
    "text": " mandates a great amount of manipulation because it is not just on the basis of transfer of pure information that it takes place but most of the time through manipulation of the environment which is also engages artifacts other than other agents and this is how i think of the sophistication or complexity of the situation by thinking of that in terms of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1219.967,
    "end": 1230.517,
    "text": " the advanced forms of cultural practices, such as what we observe in mathematics, literature and science, which are still meaningful, which are still",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1232.859,
    "end": 1256.012,
    "text": " involving a great amount of semiotic enterprise semantic enterprise but we need to be able to explicate them in simple natural forms of communication like what we observe in the natural form and what like what we hope to be able to be explicated in terms of minimization of free energy and minimization and keeping the information entropy of the system within bonds",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1261.795,
    "end": 1271.683,
    "text": " It's a different thing to maintain the, not better or worse, but merely different to maintain the survivability of a biofilm than a data center.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1272.985,
    "end": 1283.033,
    "text": "Yet we want to approach them in a first principles, grounded, compatible, interoperable, scientific lens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1284.154,
    "end": 1285.996,
    "text": "And so that is what perhaps",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1287.349,
    "end": 1288.63,
    "text": " brings in active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1288.931,
    "end": 1291.513,
    "text": "So, Dean, and then we'll continue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1292.374,
    "end": 1293.255,
    "text": "Or Majid, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1293.555,
    "end": 1293.775,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1294.436,
    "end": 1300.261,
    "text": "Just with regard to the last thing that Dan said, there is another collaboration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1300.282,
    "end": 1306.528,
    "text": "I mean, there is another co-authored paper that is by me and Afti published in...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1309.321,
    "end": 1322.959,
    "text": " I think that the European Journal for Philosophy of Science, and it is about the explicating methodology of science, which also includes abduction and inference to the best explanation and other sorts of stuff on the basis of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1324.321,
    "end": 1325.361,
    "text": " active inferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1325.441,
    "end": 1328.002,
    "text": "So you are completely right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1328.582,
    "end": 1349.547,
    "text": "And in many ways, this project, to be able to explicate methodology of science at the individual and social level on the basis of these first principles, given all of the skepticism that there exists about trying to engage in first principles in life sciences, it sounds to be a very ambitious project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1349.587,
    "end": 1352.408,
    "text": "But it seems that where we are now, and I think that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1356.209,
    "end": 1365.996,
    "text": " I think that this is a project worth pursuing, but if there is time, I will come back to that later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1368.557,
    "end": 1368.918,
    "text": "Excellent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1370.259,
    "end": 1370.499,
    "text": "Dean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1372.88,
    "end": 1374.321,
    "text": "This is awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1374.401,
    "end": 1379.645,
    "text": "I got a question for you, because I think you could probably answer this better than I could.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1380.925,
    "end": 1409.735,
    "text": " wrestling with this one so if i'm if i'm a person who's trying to perform some kind of a situational analysis trying to determine what the functions and the purposes are in the setting in which i exist i can look at that in terms of a semantic space but what abduction i think um introduces is the idea idea of semantic time and and i'm so glad that you",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1410.396,
    "end": 1413.679,
    "text": " sort of pointed to the fact that Daniel's typing stuff out right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1413.719,
    "end": 1415.76,
    "text": "This is semantics time for him.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1415.8,
    "end": 1419.303,
    "text": "He's actually generating some semantics even as we're talking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1419.383,
    "end": 1436.757,
    "text": "So I guess what I'm wondering is if we're going to look through the lens of active inference as the situational analysis lens, do we separate out what Daniel's doing when he's typing from the nature",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1437.668,
    "end": 1444.252,
    "text": " of what we're doing right now, or do we see them as sort of co-compatibilities?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1445.593,
    "end": 1446.894,
    "text": "I don't know the answer to that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1447.674,
    "end": 1452.417,
    "text": "I'm leaning in the direction that they're kind of inseparable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1452.757,
    "end": 1457.24,
    "text": "They orchestrate something that doesn't happen if we only have one or the other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1457.54,
    "end": 1458.261,
    "text": "What are your thoughts?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1459.861,
    "end": 1469.449,
    "text": " Well, to tell the truth, I'm not well... Sorry, my phone was ringing and I lost focus for a moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1471.971,
    "end": 1473.132,
    "text": "And I do apologize for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1473.192,
    "end": 1478.297,
    "text": "It was one of the reasons that I was hesitating to join.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1478.357,
    "end": 1480.579,
    "text": "But, well...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1483.067,
    "end": 1488.09,
    "text": " could you, I do, again, apologize to Esther, but could you elaborate a bit on the last part?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1488.17,
    "end": 1492.192,
    "text": "I hear that right, but I want to get more familiar with the last part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1492.573,
    "end": 1497.495,
    "text": "Sure, well, the semantic spaces stuff, I think, is really material.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1497.535,
    "end": 1502.338,
    "text": "Like, you can see Daniel typing things out across that slide.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1502.478,
    "end": 1511.563,
    "text": "But what I think Kearse asks us to contemplate is the actual semantics time, the actual change or shift of what's",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1512.131,
    "end": 1514.113,
    "text": " actually happening in that moment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1514.713,
    "end": 1539.353,
    "text": "And so I was wondering, if we are not just looking at active inference as the object of our attention, or we're actually inferring what is going to happen next, do we have to include the idea of what's happening, not just semantically as a product of what's typed out on the page, but as a process",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1540.226,
    "end": 1558.591,
    "text": " And what does that then imply in terms of what we might be able to pick up quicker in terms of our embedding in these different contexts that we otherwise wouldn't be able to pick up if we only had one or the other?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1558.771,
    "end": 1569.134,
    "text": "It kind of starts moving us towards this realism, anti-realism debate, which I'm still not sure it should even be a debate, but that's me and my relativity piece.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1571.337,
    "end": 1590.302,
    "text": " shortly what i heard there unmute is semantic spaces have been extremely characterized not completely but before active inference long before people have done embeddings of sentences and meaning concepts in semantic spaces without a temporal aspect",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1591.368,
    "end": 1605.728,
    "text": " And so I heard a question about abduction as providing a framework for semantic or semiotic time, whether with the two stroke engine of generating and selecting hypotheses or the action perception loop or a few other ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1606.576,
    "end": 1607.177,
    "text": " All right, very well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1607.557,
    "end": 1608.558,
    "text": "Look, very well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1609.399,
    "end": 1610.6,
    "text": "I think that that's a very good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1610.88,
    "end": 1617.966,
    "text": "I put, only in order to blow one's own trumpet, I put the paper that we wrote in the chat box.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1618.047,
    "end": 1626.674,
    "text": "And I think that this is precisely about this point, because it is about selecting hypotheses, the process of selecting hypotheses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1627.475,
    "end": 1643.942,
    "text": " And I do not know how to relate that directly to induction or abduction, but what I try to do is to say this, that at least in the so-called advanced forms of communication or abduction that I talked about,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1644.542,
    "end": 1652.608,
    "text": " What's important is not only what we are doing in the moment, but what's important is our estimation of what's going to happen later, next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1652.829,
    "end": 1661.576,
    "text": "And I think that it is very important in terms of Charles Sanders Peirce logic, not only logic of science, but also economics of science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1662.276,
    "end": 1672.702,
    "text": " when he says that we have to try to find a way to invest in theories, in hypotheses that have a chance to being a winner in a long time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1672.822,
    "end": 1691.033,
    "text": "So in a way, time enters the process because we have to be able to have a long time view on how the abductions that we are going to construct lead to fruitful results, not only at the moment, but in future, possibly long future, especially if we are engaging in some sort of sophisticated research",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1691.733,
    "end": 1708.39,
    "text": " sophisticated process such as scientific uh practice or such as theory hypothesis construction or hypothesis testing time plays an important factor and what's important about active inferences especially the forms of active inferences that could be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1709.617,
    "end": 1710.198,
    "text": " appeal to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1710.258,
    "end": 1718.825,
    "text": "So when we speak of active inference, perhaps we didn't elaborate that much on the abduction and active inference paper, although we referred to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1718.865,
    "end": 1722.929,
    "text": "But in the other paper, I think that we have been referring to that quite a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1723.29,
    "end": 1725.612,
    "text": "The thing is that the kind of active inferences that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1727.02,
    "end": 1745.185,
    "text": " are useful in this context are active inferences that are taking place on the basis of temporally rich models, what Christo and others mentioned as models that have some sorts of temporal depths or temporal richness, which basically allow the organism to have a perspective, have some insight, not only on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1746.385,
    "end": 1759.259,
    "text": " prediction of free energy or, sorry, minimization of free energy or minimization of information entropy, but also have some insight into the efficiency of its",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1761.041,
    "end": 1767.147,
    "text": " processes, its practices for minimizing free energy in the long term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1767.207,
    "end": 1778.479,
    "text": "So I think that it comes back to the issue of temporal depths and temporal richness, which also is related in a very interesting way to the issues of consciousness and selfhood, another topic that I'm interested in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1778.539,
    "end": 1778.679,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1779.56,
    "end": 1780.22,
    "text": " This is the thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1780.621,
    "end": 1796.648,
    "text": "There are some biotic self-organizing systems that can engage in some sort of social activity, and these self-organizing systems happen to also have this wonderful capacity to form abductions that take the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1801.519,
    "end": 1822.565,
    "text": " temporal aspect into account at the same time the same group of biotic self-organizing systems that are capable of making this kind of abductions inferences are also capable of having self-hood and consciousness and self-consciousness and that sort of stuff so in a way it comes together the ability to be able to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1823.345,
    "end": 1831.971,
    "text": " form this kind of abduction that allows to choose the hypothesis that have a better chance to being good hypothesis in the long run.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1832.752,
    "end": 1843.9,
    "text": "And the ability to have self or self-consciousness and at the same time, the ability to form generative models that have some temporal depths or temporal richness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1843.94,
    "end": 1852.166,
    "text": "So I think that temporal depth is at the root of that all because it allows us to make policies and it allows us to have some",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1854.836,
    "end": 1864.256,
    "text": " some strategies that basically enable what we can think of in terms of scientific methodology, in terms of philosophy of science that I'm interested in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1866.044,
    "end": 1873.729,
    "text": " I could add a note there, then pass back to Dean and thinking about the similarities and the contrast with different biosemiotic systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1874.37,
    "end": 1890.601,
    "text": "So a signaling protein or signaling molecule might have a tremendously rich and contextual biosemiosis, like a hormone in a certain way might do various different things relationship with the cellular context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1891.101,
    "end": 1891.201,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1892.142,
    "end": 1906.708,
    "text": " What I'm hearing with the more rudimentary forms or the non-abductive forms of communication and the relationship with their temporal depth is that while there is a conditionality to the way that hormone is received,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1908.208,
    "end": 1916.914,
    "text": " and there's an instantaneous complexity or complicatedness, it doesn't necessarily have a temporal depth in the semiosis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1917.294,
    "end": 1928.121,
    "text": "It might play a role in a temporal depth, like the hormone could play a role in development, but the interpretation of that hormone is instantaneous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1930.162,
    "end": 1933.084,
    "text": "In contrast with linguistic communication,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1935.726,
    "end": 1964.665,
    "text": " even before we get to this level of like speaking to the distant future or invoking the distant past or different timelines and metacognitive awarenesses, there's a space of interpretation between the heard sound or the seen symbol itself and the way that it triggers internal cascades, which must involve temporal depth, like a word alone",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1965.737,
    "end": 1974.544,
    "text": " a phoneme alone is not conveying that same impact of meaning as the hormone binding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1975.364,
    "end": 1985.732,
    "text": "And so the increased cognitive complexity of like a linguistic entity opens up a space of interpretation for the words",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1987.025,
    "end": 1997.835,
    "text": " that brings in the temporal depth and differences in acculturation and differences in what people have learned, whether they even know that word at all, whether they know about how it's being used by that person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1997.855,
    "end": 2009.386,
    "text": "And so in the linguistic semiosis, we can see how it has analogy to other forms yet also",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2010.697,
    "end": 2017.86,
    "text": " contains a space where also active inference can be used to start to disambiguate and to build models of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2020.201,
    "end": 2020.422,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2022.262,
    "end": 2023.083,
    "text": "Thanks, Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2024.463,
    "end": 2029.466,
    "text": "First of all, you almost grabbed what I was about to say, but I'm going to say it in different words.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2029.946,
    "end": 2034.368,
    "text": "Here's a question again around that abduction paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2035.168,
    "end": 2038.37,
    "text": "I don't have the exact quote up here, but so paraphrasing,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2038.993,
    "end": 2060.75,
    "text": " One of the things in the paper that you point out is that Pierce understands that if you don't see the triadic, if you don't see the three kinds of logic as taken together, the deductive, the inductive, and the abductive, you're kind of missing what he was trying to alert us to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2061.591,
    "end": 2066.455,
    "text": "My question is, so when we break it down further from that, if we reduce it to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2067.133,
    "end": 2068.794,
    "text": " deductive, inductive, and abductive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2068.834,
    "end": 2076.857,
    "text": "We don't leave it as a whole, as the way of looking at all of the logics sort of working in concert.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2077.738,
    "end": 2081.739,
    "text": "Is that looking then at logic as a tool?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2082.54,
    "end": 2088.983,
    "text": "Is it looking at it as instrumentalism if we take it down to that reductionist place?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2089.043,
    "end": 2094.425,
    "text": "I know that if we leave it up at all three together working in concert,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2095.017,
    "end": 2095.958,
    "text": " That's realist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2096.198,
    "end": 2099.26,
    "text": "And that's the part that I very much agree with in your paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2099.7,
    "end": 2102.361,
    "text": "But then my question was, you guys never really talked about this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2102.922,
    "end": 2113.968,
    "text": "If it's taken down to those more simple relative logics over time, are each one of those logics, then could we see them as actually being instrumental?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2119.151,
    "end": 2121.853,
    "text": "Well, I'm not sure that I can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2123.835,
    "end": 2143.801,
    "text": " answer that question because i'm as i say i'm not an expert on pairs but i can see my own perspective so what i was genuinely interested in was in engaging with purse ideas was the part that was about abduction so perhaps i was",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2145.615,
    "end": 2147.437,
    "text": " I don't know that I think of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2147.497,
    "end": 2152.081,
    "text": "I do not know why I was so interested in abduction, but not in deduction or induction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2152.561,
    "end": 2160.909,
    "text": "But perhaps because inference is the best explanation, abductions do seem to play an important role in philosophy of science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2160.969,
    "end": 2168.936,
    "text": "But, well, it seems that philosophers of science just take deduction and induction for granted, and perhaps it is because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2171.78,
    "end": 2173.762,
    "text": " I can't defend that decision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2173.782,
    "end": 2179.328,
    "text": "I don't know whether we have to, I had to at least spend more time to say deduction and induction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2179.368,
    "end": 2184.414,
    "text": "But about these logics, or at least this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2185.976,
    "end": 2188.438,
    "text": " kinds of inferences being insteruments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2188.999,
    "end": 2190.96,
    "text": "I don't see why they couldn't be insteruments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2191.141,
    "end": 2201.269,
    "text": "In a way, if I want to stick to the jargon of distributed cognition and embodiment and inactivism, the things that I'm pursuing, no.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2201.77,
    "end": 2213.12,
    "text": "I think that we can think of them in terms of cultural tools, like many other kinds of cultural tools that we can use in order to pursue our intellectual quest, whatever that intellectual quest is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2213.88,
    "end": 2229.868,
    "text": " ill are there to be pursued so i think that we can think of them as instruments so the main question i think that because you also mentioned realism and anti-realism the question is that if we think of these things as instruments",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2231.656,
    "end": 2236.68,
    "text": " would there be any room for being realist about this kind of approach?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2236.781,
    "end": 2238.762,
    "text": "Is that related to the question of realism?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2238.782,
    "end": 2241.745,
    "text": "Did you want to say, what do you want to say?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2241.765,
    "end": 2244.267,
    "text": "Do you want to relate that to the question of realism?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2244.287,
    "end": 2247.009,
    "text": "Yeah, I actually do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2247.049,
    "end": 2255.437,
    "text": "I think, as I said, when I read the paper, I think the argument that says that if we look at Peirce's work",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2256.05,
    "end": 2270.773,
    "text": " as anti-nominalism, non-nominalism, I believe when it's in its complexity state and the relationship between those logics, it's the relationship between those logics that it's examined.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2271.254,
    "end": 2272.414,
    "text": "Yes, I very much agree.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2272.834,
    "end": 2275.394,
    "text": "You can't describe that as anything other than realist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2276.395,
    "end": 2281.996,
    "text": "My question is, is that if we reduce below that, is that when the instrumentalism",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2284.178,
    "end": 2284.798,
    "text": " percolates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2285.098,
    "end": 2286.159,
    "text": "That's my question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2286.359,
    "end": 2286.979,
    "text": "Alright, very well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2287.359,
    "end": 2293.302,
    "text": "Look, so my perspective on realism in this context is this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2294.202,
    "end": 2304.286,
    "text": "Look, so we are speaking about semiotics and we are speaking about the semantic aspects of language and interpretation and that sort of stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2304.786,
    "end": 2312.97,
    "text": "The question is that where this kind of interpretation, where this kind of semantical interaction with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2313.59,
    "end": 2314.891,
    "text": " the word is coming from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2315.972,
    "end": 2331.682,
    "text": "I think that if we concede that it is not something arbitrary, that this is something that is not developed or chosen on the basis of convention, not only conventions, but conventions that are feeding on, I don't know, wanton and whimsical element.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2332.082,
    "end": 2337.686,
    "text": "If there is some objective element in that, it is not in-serving mentalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2337.846,
    "end": 2339.767,
    "text": "It will provide some basis for realism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2341.128,
    "end": 2351.092,
    "text": " And there are semiotic and semantic aspects in, for example, constructing scientific hypotheses or theories or scientific practice and that sort of stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2351.593,
    "end": 2361.117,
    "text": "I think that to the extent that we are able to grow on these semantic and semiotic aspects in nature, to the extent that we can provide some sort of dome to Earth,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2363.038,
    "end": 2373.329,
    "text": " natural explanation for the emergence of this semantic and semiotic element, we could defend some sort of realism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2373.669,
    "end": 2377.633,
    "text": "So, then again, you may ask what sort of realism is that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2377.833,
    "end": 2379.835,
    "text": "And I can say that this is the sort of realism that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2382.327,
    "end": 2384.91,
    "text": " is informed by our best scientific theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2384.95,
    "end": 2396.062,
    "text": "So it is some sort of radically naturalist take on realism that I think would be kind of compatible with pragmatist and Persian ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2396.783,
    "end": 2398.966,
    "text": "So I think that the realist",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2399.466,
    "end": 2426.949,
    "text": " take comes from the fact that we try to grown semiotic and semantic the logic of abduction induction deduction all of that we try to find natural processes that enable those kind of inferences and to the extent that we can find natural processes that are explicated in terms of some or best scientific theories there remains some room for defending a version of realism that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2427.569,
    "end": 2430.49,
    "text": " Willard Van Orman Coyne used to call robust realism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2430.53,
    "end": 2443.055,
    "text": "It is robust in the sense that instead of trying to latch onto mind-independent, science-independent realities into the objective world, this kind of realism",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2443.815,
    "end": 2447.258,
    "text": " draws its force from our best scientific theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2448.039,
    "end": 2468.316,
    "text": "And I think that it is realistic in the sense that we can provide a naturalist story, we can threshold some naturalist story, some scientific story of the psychological ground mechanisms that enable this kind of inferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2470.52,
    "end": 2470.94,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2471.24,
    "end": 2471.56,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2471.741,
    "end": 2472.101,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2472.941,
    "end": 2474.402,
    "text": "Stephen, and then I'll add a note.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2476.523,
    "end": 2476.903,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2477.103,
    "end": 2490.85,
    "text": "So you mentioned the scientific process and almost the deductions, the inductions that can occur with a model, a scientific model that's being created.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2491.57,
    "end": 2499.574,
    "text": "So it's just slightly different to say what's real for me at the scale at which I can perceive",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2501.094,
    "end": 2503.575,
    "text": " as a human and see things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2503.675,
    "end": 2513.099,
    "text": "My model might be able to see things slightly beyond what my sensorum can perceive in my experiential ecosystem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2513.139,
    "end": 2517.301,
    "text": "I like to use the term experiential ecosystem of being alive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2518.101,
    "end": 2528.346,
    "text": "So when that's the case, is it almost that these models are given some sort of agency, some sort of sentience, that what's real for the model in a way?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2531.647,
    "end": 2532.087,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2533.928,
    "end": 2534.468,
    "text": "Very well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2535.369,
    "end": 2538.17,
    "text": "Well, that's a very good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2538.39,
    "end": 2553.957,
    "text": "In order to try my best to provide an answer to that, I may need to drift away a bit from the scientific context and engage in some sort of philosophical discussions that might be a bit boring for the audience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2554.018,
    "end": 2556.659,
    "text": "I'm not sure about that, but I will ask you to try.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2556.679,
    "end": 2556.839,
    "text": "For us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2557.619,
    "end": 2557.899,
    "text": "Try.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2557.939,
    "end": 2559.2,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2562.5,
    "end": 2569.182,
    "text": " Well, giving some sort of agency to models is an interesting question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2569.202,
    "end": 2573.344,
    "text": "A question that, as it happens, I think is worth taking seriously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2575.245,
    "end": 2595.212,
    "text": " but it might not be directly related to so look in order to be able to defend some sort of mode in order to to to advocate some sort of model-based version of realism you do not necessarily need to give agency to models and because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2596.269,
    "end": 2611.304,
    "text": " In order to be realist, the thing is this, the nature and the structure of scientific theory is so complicated that we cannot defend realism on the basis of some sort of perceptual or sense perception evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2611.344,
    "end": 2615.689,
    "text": "So the evidence for scientific theories, if you think of it in terms of model-based science,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2616.229,
    "end": 2622.974,
    "text": " doesn't come in terms of sense perception, because the construction of scientific theories is much more complicated than that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2623.114,
    "end": 2635.344,
    "text": "There are different kinds of experimentation, manipulation, theoretical distortion, idealization, you name it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2635.384,
    "end": 2639.667,
    "text": "So when we speak of models, there are different kinds of things that make it very hard to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2640.828,
    "end": 2645.593,
    "text": " to think of the model-based representation as some sort of direct relation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2645.713,
    "end": 2655.584,
    "text": "So we cannot defend realism about models in terms of relating sense perception or sense data or something directly to the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2658.026,
    "end": 2666.288,
    "text": " There are other kinds of virtues that we may want to depend on, and most of the time philosophers of science do not agree on a specific set of virtues that could be used.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2666.348,
    "end": 2678.29,
    "text": "They usually speak of considerations of simplicity, fruitfulness, parsimony, that sort of stuff, efficiency, but usually they do not agree on a specific set of virtues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2678.35,
    "end": 2680.751,
    "text": "But one thing that they agree about is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2682.012,
    "end": 2700.371,
    "text": " models do not receive confirmation on the basis of their fit with sense experiences, because it seems that our modern science, think of that in terms of quantum mechanics, not only that, but different sorts of sciences, is becoming so tortically complicated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2701.883,
    "end": 2718.228,
    "text": " Or scientific models are becoming so idealized and theoretical entities that feature in these models are sometimes so sophisticated that it would be futile to try to find some sort of perceptual or sensory evidence for that, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2719.368,
    "end": 2722.809,
    "text": "So, well,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2726.658,
    "end": 2742.068,
    "text": " And again, when we speak of abduction and when we speak of inference to the best explanation, I still think that inference, I still think that active inference could eventually or could at some point lead to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2744.238,
    "end": 2762.207,
    "text": " at least grown some methodology of model selection that allow us to, on the same basis, more or less on the same basis that Charles Sanders Peirce speaks of logic of science or economics of science, can lead to some sort of methodology of science that could allow us to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2764.848,
    "end": 2781.683,
    "text": " select scientifically fruitful models, models that deserve to be given a chance by realists as things that are providing a more or less reliable image of the universe without depending directly on sense experiences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2785.407,
    "end": 2786.007,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2786.107,
    "end": 2787.789,
    "text": "There's a lot there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2789.37,
    "end": 2789.771,
    "text": "One of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2791.92,
    "end": 2806.369,
    "text": " most key pieces of i think the juxtaposition of these papers and how we're seeing the discussion around science and realism and enculturation progress in 2022",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2808.71,
    "end": 2828.7,
    "text": " is that and to connect this also to this area of the semantic spaces and semantic time which abduction requires it's at least two phasic so it has to it can't both be happening in the same instant in the same um unit so the question of realism and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2829.662,
    "end": 2839.928,
    "text": " especially on specific constructs within the broader apparatus of free energy principle, like focusing on the blanket construct, Markov blanket, Friston blanket, etc.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2841.548,
    "end": 2845.691,
    "text": "It's often been approached in terms of a question of compositionality of space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2847.131,
    "end": 2849.112,
    "text": "As you put it, like mind independent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2849.293,
    "end": 2850.413,
    "text": "Does this exist physically?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2850.453,
    "end": 2852.374,
    "text": "Well, what do you mean by the table exists physically?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2852.654,
    "end": 2857.137,
    "text": "I mean, it's there when I'm not looking, or if I don't believe it's there, it could still hit me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2858.624,
    "end": 2874.068,
    "text": " In the mind-independent situation, first off, there's a massive challenge in re-minding that system, the whole hard problem of consciousness or even just simply hard problem of biocognition or semiosis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2874.728,
    "end": 2883.611,
    "text": "And so in that setting, it's very defensible to take a instrumental perspective on the meaning of semantic spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2885.117,
    "end": 2907.587,
    "text": " when we turn from a compositionality of mind independent physical space into a compositionality of meaning as enacted in the pragmatic sense what's real is action then the commitment to mind independence being lifted",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2909.039,
    "end": 2923.153,
    "text": " we have actually a multi-perspective cognitive scenario that naturally embodies questions of semiosis because meaning as enacted is model dependent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2924.349,
    "end": 2952.056,
    "text": " And so I'm sure there's a lot of like loose threads or other ways to go, but again, it's a large turn for me to see the discussion evolve from being about mind independent physical interpretations as being the crux of realism and the pragmatic shift as opposed to like the materialist or the reductionist stance",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2953.098,
    "end": 2976.025,
    "text": " the pragmatic shift reintroduces mind or really just removes the kind of filter or the dam and just lets mind rush back in so there's really a lot there and then you connect that all the way to active inference grounding methodologies of model selection and i think in that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2977.242,
    "end": 2997.59,
    "text": " domain, it inherits greatly on a huge amount of statistics and machine learning work on policy selection, for example, like using a free energy functional and minimizing it to scan and evaluate and make a decision upon a space of affordances and policies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2998.65,
    "end": 3017.053,
    "text": " is what has been happening in control theory, cybernetics, and so on, even down to the evidence lower bound and the forms of the free energy functionals that are used are broadly related to exactly model selection processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3017.95,
    "end": 3022.912,
    "text": " So just like if we were doing a linear regression, we might want to fit the least squares error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3023.552,
    "end": 3030.134,
    "text": "And if we were doing a Bayesian model selection, we might want to use like a Bayes factor or a BIC or AIC criterion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3031.514,
    "end": 3037.936,
    "text": "Here we're in the space of mind based cognitive entities, active particles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3039.557,
    "end": 3046.299,
    "text": "And so active inference provides a process theory that is able to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3047.526,
    "end": 3050.768,
    "text": " make all of that come together and make sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3052.309,
    "end": 3073.702,
    "text": "And then this paper connected it to the qualitative, though rigorous and structured framework of abduction and kind of fit like abduction into the ignition instead of the inductive deductive, which can be limiting in certain contexts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3075.103,
    "end": 3075.343,
    "text": "Steven?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3078.126,
    "end": 3102.359,
    "text": " just just wanted to pick up back on when you mentioned about model selection um so that's interesting in the sense that there's there's policy selection in active inference okay what policy i'm going to take on my action i suppose you can look at what regime of attention will i used and will capitulate my internal model",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3103.923,
    "end": 3132.148,
    "text": " think a lot of times and i don't think this is often thought about um in active inference but really the model selection may well be the the external artifact or the like um like like uh majima's talking about this scientific model is um is different to say the model selection that's happening in terms of maybe types of generative models that we might think of in the brain",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3133.223,
    "end": 3159.656,
    "text": " and can have its own you know it can exist someone could write a paper like uh pierce and you know it wasn't published and people pick it up 50 years later and it's recapitulated into a system of of meaning making um so i think this there's um the the the ways that models get selected and then how they can be used and maybe",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3161.331,
    "end": 3188.554,
    "text": " couched in a system i think it's really interesting and maybe that system is also we've talked about this before is when that system doesn't need to be alive anymore to function like can there be a dead system i.e a computer system that can then or how much of it becomes not dependent on the living so that's just just one point that i think you know comes back to that question of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3189.815,
    "end": 3193.178,
    "text": " You know, where is it ultimately grounded?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3193.198,
    "end": 3195.74,
    "text": "Thank you, Stephen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3195.8,
    "end": 3196.4,
    "text": "Yes, Majid.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3201.624,
    "end": 3204.866,
    "text": "I think that, unfortunately, I have to start to leave.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3205.286,
    "end": 3208.308,
    "text": "And I do not want to open another can of worms before doing that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3208.328,
    "end": 3214.453,
    "text": "But I want to briefly speak about what Stephen mentioned, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3214.953,
    "end": 3217.014,
    "text": "For example, and I want to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3220.393,
    "end": 3227.397,
    "text": " say with the example that you provided, for example, the person being dead, Charles Sanders being dead, but the ideas of being picked up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3227.858,
    "end": 3242.767,
    "text": "When I was starting to think of scientific practice in terms of active influence, in a book that I wrote in 2019, people started to make very significant criticism and meaningful that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3244.128,
    "end": 3249.612,
    "text": " Active inference is a theory of individual brains, but scientific practice is not an individual activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3251.333,
    "end": 3255.637,
    "text": "Science is not taking place in the brain of individual people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3255.717,
    "end": 3257.418,
    "text": "It is some sort of social activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3257.999,
    "end": 3263.523,
    "text": "It is distributed in scientific groups and scientific communities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3267.617,
    "end": 3280.948,
    "text": " I get more deeply engaged with this literature on distributed scientific cognition in terms of works of Ronald Gere and some other people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3281.149,
    "end": 3282.41,
    "text": "And I found it very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3282.45,
    "end": 3291.617,
    "text": "So look, the model selection, scientific model selection as some sort of advanced form of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3292.915,
    "end": 3297.097,
    "text": " cognition, finis form of cognition is grounded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3297.237,
    "end": 3303.42,
    "text": "I still think that it's grounded in active inference, but it doesn't need to take place at the level of individual scientists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3303.48,
    "end": 3306.882,
    "text": "It could be distributed to the community of scientists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3307.002,
    "end": 3317.368,
    "text": "And then the issue of minimization of entropy could be understood in terms of minimization of collective entropy of scientists, or even minimization of the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3318.408,
    "end": 3323.551,
    "text": " collective entropy of the coupled community of scientists and their environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3324.071,
    "end": 3337.299,
    "text": "I think that it leads to some sort of revolutionary understanding of the nature of scientific theories, because we usually think of scientific theories as a class of propositions or set of model theoretic or set theoretic models in terms of mathematics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3337.759,
    "end": 3357.894,
    "text": " But if we broaden the scope a bit to think of theories as pieces of information, pieces of knowledge that are dispersed and distributed in scientific community or things that emerge through the interaction between scientific community or scientific group and their environment, I think that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3358.735,
    "end": 3365.881,
    "text": " it may lead to a very interesting perspective on the nature of scientific theories as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3366.702,
    "end": 3382.254,
    "text": "In a way, I was hijacking this discussion of active inference because being trained and bred as a philosopher of science, I'm mainly interested in some internal issues in philosophy of science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3382.754,
    "end": 3386.257,
    "text": "And when I speak of scientific realism, I think of that in classical",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3387.858,
    "end": 3393.663,
    "text": " classical terms in philosophy of science, being realist about the target system of theories and scientific models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3394.264,
    "end": 3406.334,
    "text": "But I think that it still leaves ample room for also being realist about active inference itself, but for different reasons, and for reasons that are much more sophisticated and complicated than",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3407.134,
    "end": 3425.96,
    "text": " uh could be could be unpacked directly with relation to mind independence reality of active inferences or or whether there are such things as first principles in mind independent war so i think that of course there are no such things as first principle mathematical first principles in if you open up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3426.96,
    "end": 3450.857,
    "text": " brain and nervous system you can't find first principle mathematical first principle you will find different kinds of tissues and mechanisms and other kinds of things but i think that these two concern about realism about active inference and free energy principle and my own concern about scientific realism about targets of scientific theories that could be selected on the basis of active inference could be related together at some point",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3451.717,
    "end": 3453.458,
    "text": " But I have to apologize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3454.158,
    "end": 3456.538,
    "text": "This is a joy to participate in this discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3456.558,
    "end": 3463.16,
    "text": "And I have to apologize for being pushed to leave abruptly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3464.521,
    "end": 3465.621,
    "text": "It's excellent, Majid.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3465.641,
    "end": 3466.401,
    "text": "We appreciate it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3466.521,
    "end": 3468.642,
    "text": "And the dot three is yours when the time is right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3469.542,
    "end": 3470.322,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3470.822,
    "end": 3472.323,
    "text": "It was very nice to meet all of you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3472.783,
    "end": 3473.463,
    "text": "I'm going to leave.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3474.003,
    "end": 3474.623,
    "text": "Yeah, take care.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3476.864,
    "end": 3477.044,
    "text": "Wow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3478.98,
    "end": 3479.26,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3479.681,
    "end": 3483.262,
    "text": "We'll take a deep breath and then we'll continue, or maybe you don't even need to breathe, Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3483.642,
    "end": 3484.103,
    "text": "Go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3485.043,
    "end": 3496.589,
    "text": "Well, I just love the fact that the term hijacking was introduced, not by me, because one of my biggest fears around this thought too was hijacking something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3496.629,
    "end": 3502.012,
    "text": "And I think I understand what he means by that, because it actually feels that way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3502.032,
    "end": 3502.372,
    "text": "If you",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3504.218,
    "end": 3510.08,
    "text": " If you look at what we were just talking about, which is active inference could ground a methodology of model selection.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3511.04,
    "end": 3514.641,
    "text": "Let's just assume for a second, abductively, that it does.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3514.901,
    "end": 3516.162,
    "text": "It can and it does.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3517.102,
    "end": 3518.122,
    "text": "Well, what would that mean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3519.083,
    "end": 3526.185,
    "text": "Well, what that would mean is literally changing the directionality of what we typically perceive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3526.645,
    "end": 3529.646,
    "text": "And as Michi pointed out, we can't let our perceptions",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3530.902,
    "end": 3535.005,
    "text": " conflate what we are perceiving with whatever reality is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3535.025,
    "end": 3540.129,
    "text": "And I think we've all agreed that that's a dangerous thing to do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3540.229,
    "end": 3554.74,
    "text": "However, in the spirit of what could active inference ground in terms of methodology and then in terms of model selection, my question is,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3558.168,
    "end": 3572.953,
    "text": " Typically, in the outside world, as we're using scientific principles, we start with an idea, a hypothesis, a process, and we turn that into a product, some kind of a materialization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3573.013,
    "end": 3577.515,
    "text": "Stephen and I were actually chatting about this before we came on the live stream today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3577.735,
    "end": 3578.995,
    "text": "That's what we see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3579.515,
    "end": 3582.856,
    "text": "That's what we sometimes label the reality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3584.237,
    "end": 3587.778,
    "text": "What active inference, as active inferring,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3588.698,
    "end": 3596.361,
    "text": " suggests is the Markov blanket stays in the middle between the generative model and the generative process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3596.721,
    "end": 3607.485,
    "text": "However, if we were to actually contemplate that active inference could ground a methodology and does, we would actually say that the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3608.396,
    "end": 3612.857,
    "text": " Generative model is the product or is the materialization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3613.477,
    "end": 3626.68,
    "text": "And as we pass through the Markov blanket, we actually move to two different versions of process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3626.9,
    "end": 3628.021,
    "text": "One is relativity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3628.721,
    "end": 3630.041,
    "text": "The other is relationship.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3630.141,
    "end": 3633.222,
    "text": "And together, that forms a new absolutism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3633.789,
    "end": 3636.19,
    "text": " So that is literally the emergence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3636.971,
    "end": 3640.093,
    "text": "And that's kind of where I started in this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3640.133,
    "end": 3647.257,
    "text": "I haven't sort of been that explicit in on my, my backside out there to have a whole bunch of people take a bite out of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3647.477,
    "end": 3659.464,
    "text": "But if, if we, I think are courageous enough and take the risk and we look at that differently than how we traditionally looked at it, that process",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3660.359,
    "end": 3661.4,
    "text": " leads to product.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3661.6,
    "end": 3664.362,
    "text": "Another way of describing that is product and process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3664.743,
    "end": 3673.89,
    "text": "But we actually look at it as process in product, meaning we start with whatever our hard evidence is as a generative model as product.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3674.591,
    "end": 3687.341,
    "text": "And then from that, we gain insights and intangibles and things that we call structure because we understand now relationship and the relativity and those new absolutisms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3688.042,
    "end": 3688.863,
    "text": "That would be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3689.571,
    "end": 3695.234,
    "text": " The condition under which active inference actually does ground model selection.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3695.654,
    "end": 3696.774,
    "text": "What do you guys think about that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3700.576,
    "end": 3701.996,
    "text": "It's a nice angle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3703.237,
    "end": 3709.84,
    "text": "I'd like to move to the images that you've prepared and see where that comes back from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3712.065,
    "end": 3720.047,
    "text": " So let's return to the initial juxtaposition slide that we looked at in the dot zero with the iceberg.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3721.027,
    "end": 3725.329,
    "text": "Okay, so again, I'll put our video chat as the tip of the iceberg.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3728.089,
    "end": 3736.772,
    "text": "We raised many points of contact between these two papers, and then,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3738.021,
    "end": 3744.426,
    "text": " you've provided a graphical abstract, we could say, that we're gonna go through now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3746.327,
    "end": 3761.079,
    "text": "And then from that graphical abstract, we're going to enter into one or more of these comparisons and see how they are structured in relationship with the general abstract, which we'll see now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3761.699,
    "end": 3763.04,
    "text": "So here we are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3763.941,
    "end": 3766.163,
    "text": "What is happening on this slide?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3768.024,
    "end": 3781.511,
    "text": " Okay, so Inez recently had, there was a YouTube clip where she was talking, I think the topic of the conversation was the free energy principle and the edge of chaos.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3781.611,
    "end": 3797.5,
    "text": "And one of the quotes that I pulled was she made the statement, making this bridge logically sound, because what she was looking at was some of the debate that's been going on between realism and anti-realism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3798.792,
    "end": 3809.216,
    "text": " And of course, in order to be able to talk about those things, she spent a lot of time looking at free energy principle and how that works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3809.296,
    "end": 3822.38,
    "text": "And then she did a really brilliant job of sort of trying to make a case for why the debate was taking place, why she and some of the authors that she works with have taken the position that they've taken.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3824.921,
    "end": 3826.701,
    "text": "What I think that us bringing to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3828.706,
    "end": 3857.34,
    "text": " topics like that that's been focused on inaction and social cognition and abduction if we bring those things together approximately which is what we've done in this live stream series we could actually show how potentially you can move from a place that says well if i'm all about the realism um then i can't be anti-realist and vice versa",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3858.944,
    "end": 3881.74,
    "text": " I think if you're in a position where you're trying to help people understand not what they see outside of themselves as a product going through an assembly line, like somebody who's learning, and then they come out the other end and they're now all assembled because they've gone through a process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3882.08,
    "end": 3887.844,
    "text": "If you actually start out as seeing this human living system as a product,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3888.308,
    "end": 3915.847,
    "text": " that is made up of things that are already present, priors and posteriors, and all of these actions that it can take as an agent, and you actually move from the left of that bottom left corner diagram to the right, you can actually use the inaction and the abduction and the anti-realism and the realism as placeholders within a Markov blanket setting,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3916.707,
    "end": 3944.209,
    "text": " And as you move through time, and as I quote, passing through time, as in depth of field, some of those memory traces that you are pushing through your working memory and pulling out from your long-term memory, as well as literally the river of time flowing, you could move from an idea of this is sort of the platform product or stability, the grounding from which I start,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3944.727,
    "end": 3966.414,
    "text": " And as I become more and more familiar with what I'm analyzing situationally, I can actually pick up the relationships, the entailments, and the relationships as relativity and the relationships as entanglements.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3967.394,
    "end": 3974.076,
    "text": "And so that is acting as an act of infer as opposed to looking at",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3974.833,
    "end": 3977.254,
    "text": " and through active inference lens.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3978.014,
    "end": 4004.26,
    "text": "So that's what I was trying to pull together here, because as it says in the middle of this slide, as active infers, as predictionary reducers across all processes, not just subject matter, one of them could be active inference as a tool or as a non-tool, when is active, and then this was, we've already talked about the when-ness of semiotics,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4004.784,
    "end": 4009.646,
    "text": " When is active inference both a partitioner and a framer?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4010.006,
    "end": 4012.367,
    "text": "And when is it also a filter?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4012.487,
    "end": 4024.571,
    "text": "So looking back through time and then pulling from the memorial and projecting out into the future, how do we keep the complexity?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4024.611,
    "end": 4026.192,
    "text": "How do we keep the triadics?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4026.772,
    "end": 4033.955,
    "text": "How do we avoid the trap of reducing down but then not being able to build back up",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4034.642,
    "end": 4037.683,
    "text": " to the complexity scale where the reality actually exists.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4037.703,
    "end": 4046.905,
    "text": "Because I think if you cross a certain threshold and you get to the operations level, of course, it's got to be tools.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4046.945,
    "end": 4048.705,
    "text": "Of course, it's got to be instrumentalism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4049.245,
    "end": 4058.467,
    "text": "But then it's got to come back to, and I think Daniel, you mentioned this earlier, it's got to come back to, so what about that table that I bump into?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4059.647,
    "end": 4060.587,
    "text": "Is that not real?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4061.268,
    "end": 4063.108,
    "text": "And so I think it's the ability to sort of,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4063.476,
    "end": 4076.541,
    "text": " go below the threshold and then resurface back above, it's being able to understand what the actual outer boundaries are and what the rows and columns and their ability to differentiate are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4076.981,
    "end": 4090.507,
    "text": "And I think if we wanted to, as I said, I don't want to hijack, but if we wanted to, we could show how both the inaction and the logic application requires us, or at a minimum,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4091.371,
    "end": 4106.897,
    "text": " at least gives us the complexity state from which active inference, which was, it's kind of the one thread that holds all of this together, retains that sense of, okay, it's both anti-real and real at the same time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4109.658,
    "end": 4110.178,
    "text": "Thank you, Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4110.238,
    "end": 4110.798,
    "text": "Stephen first.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4114.426,
    "end": 4115.387,
    "text": " Yeah, deep breath.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4116.608,
    "end": 4119.531,
    "text": "So yeah, no, this is really this is there's a lot here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4119.551,
    "end": 4120.412,
    "text": "This is really powerful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4120.432,
    "end": 4123.775,
    "text": "And I think, I think the idea of moving room,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4126.914,
    "end": 4154.774,
    "text": " these ways of interpreting anti-real realists so that moving through or moving through inaction abduction i think that's helpful um and the idea of you know how that passing through happens what we're trying to do is pass through almost the trough a bit between the two um and there's this idea that there's maybe a couple of roads we traditionally have this high road low road but um it can be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4155.954,
    "end": 4179.311,
    "text": " i i see is also um the way that we structure that understanding of abduction of inaction of realism is shown up in our idioms it shows up in the way we structure our language so i mean to what extent if we're passing through the middle here right through the middle",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4180.692,
    "end": 4209.707,
    "text": " and i was saying is and if i was to go and on my left there's a road under my right there's a road and the road that's left to be explored or the road that's forever giving and revealing the left field is the inaction the abduction and what's right is my anti-real real i mean it's either anti-real or it's real right that's right as as they say in north america a lot so i think there's um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4211.124,
    "end": 4217.312,
    "text": " there's this way that we're sort of trying to engage with",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4218.53,
    "end": 4235.117,
    "text": " these ideas as practitioners and researchers and kind of interdisciplinary sort of connectors, which starts to become itself structured.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4235.818,
    "end": 4245.222,
    "text": "So I think this diagram is quite helpful to start to tease out some of that in, again, maybe a kind of an inactive way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4247.483,
    "end": 4247.703,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4249.284,
    "end": 4273.94,
    "text": " make a few comments and then let's jump into the comparisons and see how this image is applied so the epistemic foraging the journey learning journey all of these have a temporality and so just wanted to quickly note that that connects very much to our discussion on semantic space and semantic time okay if there's a space to be semantically exploring",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4274.929,
    "end": 4284.432,
    "text": " but we're taking a path in it, then first off, Dalton and Maxwell et al's path formulation of active inference is a natural fit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4286.352,
    "end": 4288.413,
    "text": "And we need to consider the when-ness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4289.113,
    "end": 4294.855,
    "text": "And as we've talked about when, there's clock time with Kronos, and then there's the timeliness with Kairos.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4295.295,
    "end": 4302.737,
    "text": "And so that epistemic journey, we don't need to deny or even take a realism or not stance on the chronology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4303.72,
    "end": 4311.084,
    "text": " we do need to take a reality of that journey in the abductive semiotic space with time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4312.165,
    "end": 4317.068,
    "text": "Then Steven, you brought in this road and path metaphor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4317.948,
    "end": 4328.294,
    "text": "And so one thought there was these are like signposts, like they're labeling the quadrant, but we kind of have a cultural norm that actually that quadrant is all labeled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4328.354,
    "end": 4331.956,
    "text": "It's not only labeled underneath the word and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4333.49,
    "end": 4360.013,
    "text": " so when we have a signpost and we say we're going along this road that doesn't mean you just gravitate and collide with the signpost in fact we're always like moving between and among signposts and then i just thought of someone saying like i'm in the city i'm as close as you can be to the one pin on google maps or something like that but actually even these labelings have a diffusive aspect to them",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4361.912,
    "end": 4391.111,
    "text": " So outside of important and clarifying scholarly debates where we are like with both feet on one label and trying to knock others off their perch with both feet on their label, which we looked at in the sort of survivor context previously, the people in the audience and in the crowd and the co-creators that the Hippolyto and Van Ness paper really artfully focuses attention on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4392.568,
    "end": 4398.551,
    "text": " It's like, what about the fact that social cognition is distributed and inactive and in culture?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4398.651,
    "end": 4399.351,
    "text": "What about that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4400.612,
    "end": 4403.754,
    "text": "They're in that trough between the signposts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4404.914,
    "end": 4406.315,
    "text": "So those are a few aspects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4406.655,
    "end": 4412.158,
    "text": "And then one last one was like, Dean, you mentioned relation as relativity and relation as entanglement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4412.618,
    "end": 4419.582,
    "text": "And it makes me think about, as this legend helps us see aspects of, edges can mean different things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4420.524,
    "end": 4445.109,
    "text": " look at a lot of base graph representations where edges have a certain interpretation in a statistical framework but even then with effective functional and anatomic connectivity we've also talked about different kinds of edges and now here we're in the space-time of semiosis and there are edges and some of those edges reflect relationships",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4446.576,
    "end": 4449.699,
    "text": " amongst nodes and others are entanglements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4450.399,
    "end": 4457.625,
    "text": "So the ankle bone and the knee bone might be like entangled in the physical real world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4458.326,
    "end": 4464.451,
    "text": "Whether we know about that link or not, there's something to it that's real in the sense that Majeed is using realism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4465.272,
    "end": 4470.697,
    "text": "And then there's also a relationship with a creative enough forger amongst everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4471.337,
    "end": 4490.367,
    "text": " because you can say the relationship between the ankle and the field of astronomy is they both start with letter a or you could do any other number or this is just not that that's the simplest relationship is they're not the same thing or they both are related to the same thing it's general it's not always a useful statement to make well forks are not spoons",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4491.149,
    "end": 4501.215,
    "text": " Okay, but utility is just one of the virtues or the criteria by which we might evaluate a certain epistemic path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4502.176,
    "end": 4510.981,
    "text": "And our harshness on grading or evaluating epistemic paths doesn't always have to be extreme and there doesn't have to be one rubric either.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4511.521,
    "end": 4513.862,
    "text": "So there's so many connections in that space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4515.051,
    "end": 4531.705,
    "text": " pragmatism and the productivity and the social setting where all productivity is ultimately embodied brings pieces in that are hopefully of epistemic and pragmatic value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4532.886,
    "end": 4535.308,
    "text": "Let's go to the comparisons or do you want to stay here, Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4536.168,
    "end": 4541.953,
    "text": "No, I just want to point something because in order for the comparisons to make sense, I have to kind of keep up my context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4541.993,
    "end": 4542.574,
    "text": "Okay, yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4543.747,
    "end": 4551.531,
    "text": " So these arrows, I want to just say quickly, the unidirectionality results from limits or constraints, things we've used expressions up and lower bounds.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4553.812,
    "end": 4565.257,
    "text": "And bidirectionalities result from parallel processing, things like arbitrary parameterization, which Blue and I and you talked about a lot last week, the arbitrariness of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4566.377,
    "end": 4572.3,
    "text": "Then the question becomes, does a bridge, right, as an idea, remain a bridge",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4572.941,
    "end": 4575.023,
    "text": " as a materialization, as entailments.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4575.883,
    "end": 4579.826,
    "text": "Things like the relatives part that Carl talks about, the parents and the children.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4580.827,
    "end": 4587.032,
    "text": "And, and we've been talking about this a lot, and entanglements, meaning the relationship of same and different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4587.952,
    "end": 4589.814,
    "text": "So how does that play out?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4590.334,
    "end": 4597.52,
    "text": "Typically from an academic way of producing that is to start with, well, we've got to come up with a process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4597.96,
    "end": 4601.703,
    "text": "We've got to come up with a methodology to derive a product.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4602.475,
    "end": 4606.599,
    "text": " What I'm suggesting active inference does is it starts with a whole bunch of products.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4606.659,
    "end": 4610.422,
    "text": "It's like what Inez and Thomas talked about in their paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4611.383,
    "end": 4615.326,
    "text": "You co-construct that social space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4615.786,
    "end": 4621.891,
    "text": "You start with a product and then you learn how to translate and interpret.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4621.992,
    "end": 4622.892,
    "text": "One other quick thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4624.734,
    "end": 4630.138,
    "text": "On the other side of this paper, it says a Markov blanket is a scale-free statistical tool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4630.399,
    "end": 4630.619,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4631.277,
    "end": 4632.498,
    "text": " Yes, yes, it is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4633.419,
    "end": 4646.51,
    "text": "And in Majid and Addie's paper, in order to stay in a non-equilibrium city, stay with its environment, an organism must regulate its internal entropy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4647.05,
    "end": 4651.874,
    "text": "The Markov blanket of a node consists of its parents, children, and co-parents.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4652.255,
    "end": 4653.796,
    "text": "That's all true.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4654.528,
    "end": 4663.334,
    "text": " So it depends on whether you start with a product and move to the process or whether you start with the process and move to the product.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4663.814,
    "end": 4675.242,
    "text": "And that's where things really open up and optionality really becomes a thing with active inference, or at least that's what I'm trying to argue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4677.478,
    "end": 4685.122,
    "text": " Also in that I saw a bridge, not as just the thing that you drive on, but a bridge is a stance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4685.302,
    "end": 4688.223,
    "text": "It's a position like a back bend and it's a game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4689.424,
    "end": 4698.809,
    "text": "And in that interpretive space is the difference between the signaling molecule at the cellular level and human linguistic communication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4699.249,
    "end": 4704.852,
    "text": "So not to return only to that, but in that space, we can respect",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4705.962,
    "end": 4711.526,
    "text": " whatever led that generative model of NS to say that and mean that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4712.326,
    "end": 4715.028,
    "text": "And it's always going to be a yes and with our interpretation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4716.048,
    "end": 4734.62,
    "text": "And to the extent that there are anti-virtues of model comparison, speaking for another cognitive entity could be something like that because you're never going to escape the fact that it's your framing still of their intentionality and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4735.939,
    "end": 4744.787,
    "text": " So how are we going to take that as a starting point rather than shut the door on discussion because of that being a real feature of social discourse, Stephen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4747.81,
    "end": 4753.175,
    "text": "Yeah, and this sort of further to that product process",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4754.355,
    "end": 4757.957,
    "text": " and how that fits and the potential bridges that gives.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4758.578,
    "end": 4766.783,
    "text": "Dean, can I just ask you, are you saying as well, this links to the idea of the modeling, again, we're coming back to the idea of modeling rather than the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4769.244,
    "end": 4778.51,
    "text": "So with active inference, you're not wheeling in the Trojan horse with a model that you're going to take out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4778.97,
    "end": 4782.933,
    "text": "We're bringing in a modeling process where the product can be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4786.478,
    "end": 4793.801,
    "text": " retro interpreted almost or reverse engineered or somehow maybe there's something in that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4793.841,
    "end": 4799.004,
    "text": "Would that make sense to what you're talking about?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4799.124,
    "end": 4805.467,
    "text": "Again, it's easier to put down a critical path because people are familiar with that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4805.647,
    "end": 4807.128,
    "text": "These are the steps.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4807.728,
    "end": 4810.629,
    "text": "Check these boxes and this will be your result.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4811.229,
    "end": 4814.331,
    "text": "All this is doing is showing the inversion of that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4814.966,
    "end": 4816.506,
    "text": " and what the possibility is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4817.326,
    "end": 4818.647,
    "text": "So I'm agreeing with you, Stephen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4818.967,
    "end": 4824.568,
    "text": "How do we bring both into people's front of mind attentional space?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4825.448,
    "end": 4833.069,
    "text": "Because I think it's both that are dancing with one another as we are figuring something out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4833.149,
    "end": 4838.25,
    "text": "If we want to follow, that doesn't require both.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4838.45,
    "end": 4843.731,
    "text": "But if we want to forage or stigmatically arrive,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4844.597,
    "end": 4866.141,
    "text": " at a place we don't know other than as an abstraction, even the, I don't want, Daniel, you're the expert at this, but I don't know what the abstraction is for an ant that has faith that whatever they are doing in terms of following that trail is what they were put on this good earth to do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4870.181,
    "end": 4873.702,
    "text": "The puns will come, but I might even say that that's how ants are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4875.796,
    "end": 4877.017,
    "text": " Let's go to the first comparison.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4877.037,
    "end": 4877.798,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4879.399,
    "end": 4879.679,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4879.999,
    "end": 4881.741,
    "text": "We're talking about, yeah, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4881.761,
    "end": 4882.802,
    "text": "Just describe this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4882.822,
    "end": 4886.044,
    "text": "He does is remove the limits.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4886.104,
    "end": 4894.811,
    "text": "If you notice all four of the red lines on the outside of the previous diagram have been removed because this was the inactive social cognition paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4894.991,
    "end": 4899.555,
    "text": "And essentially what this does is divide up that space and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4900.262,
    "end": 4906.186,
    "text": " It takes the generative model and allows it to now be categorized if that's what you want to do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4906.827,
    "end": 4919.657,
    "text": "If you want to move from the triadic of abductive, deductive, and inductive, this is how you actually create those different subcategories within the larger picture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4920.117,
    "end": 4926.862,
    "text": "So there's a quote from their paper, from Menez and Thomas' paper, it's possible to understand active inference in two ways, a realist view,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4927.418,
    "end": 4938.288,
    "text": " that the properties of the model constructed by applying active evidence tools should also be expected to exist as an ontological property in the scientific phenomenon we're trying to explain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4938.308,
    "end": 4942.753,
    "text": "A non-realist view that the model used is simply an instrumental tool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4943.453,
    "end": 4947.837,
    "text": "Once applied to some activity, it allows the scientists to draw interpretations and explanations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4948.498,
    "end": 4951.621,
    "text": "And then they go on to talk about why they use dynamical systems theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4952.165,
    "end": 4955.387,
    "text": " So we already talked today about, so what happens when you cross a threshold?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4955.887,
    "end": 4963.911,
    "text": "Is that when complexity arises versus when you're below the threshold and that's when something different than complexity exists?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4964.291,
    "end": 4974.336,
    "text": "And so my argument would be, yes, you can have something that's complexity and then you can have something that's complicated and tools and instruments are still complicated, don't get me wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4974.637,
    "end": 4979.279,
    "text": "There's a huge technical investment that you have to make in terms of being able to make them function.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4979.319,
    "end": 4981.12,
    "text": "But the note that I wanted to put down here was,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4982.944,
    "end": 5003.641,
    "text": " Is causal order being explicated, not as some generality, as in I'm being imaginal now on some abstracted level, but rather as a specific place in time, the relational causality patterns from which context and longevity, and I love Majid without any prompting, talking about temporal depth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5004.241,
    "end": 5007.264,
    "text": "We started down that path two lifetimes ago.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5008.685,
    "end": 5011.407,
    "text": "That can be gapped, can actually be addressed as placed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5012.176,
    "end": 5013.977,
    "text": " in that distribution, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5014.738,
    "end": 5021.842,
    "text": "Because we respect both difference and distance within the collective as a new scale, as relationally causal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5022.522,
    "end": 5037.431,
    "text": "Now actively inferring, which includes selection from with and in a distribution, the counterfactual, which if, this goes right back to what Majeed said about, we could use it as a grounding for the model selection.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5038.467,
    "end": 5047.369,
    "text": " is not only able to function as a tool, but of selection by the selector processing, the action taker with the real realm by the free energy principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5047.409,
    "end": 5059.151,
    "text": "So we must first deconstruct, meaning if there's anything within this that needs categorization and separation, we can do that in order to co-construct or choose.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5059.991,
    "end": 5066.692,
    "text": "Choose how to move from a product to this is entailing that, or this is entangled with that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5069.264,
    "end": 5073.045,
    "text": " All we have to do is see it without the bounds or the horizons.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5074.546,
    "end": 5076.347,
    "text": "Same image, one last thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5078.847,
    "end": 5082.289,
    "text": "Let me contrast that with two slightly more technical notes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5083.169,
    "end": 5089.371,
    "text": "The first is figure 9.1 in the March 2022 Active Inference textbook.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5090.432,
    "end": 5093.553,
    "text": "This is what's described as the meta-Bayesian perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5094.213,
    "end": 5096.054,
    "text": "And so here, the outer shell",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5097.387,
    "end": 5119.198,
    "text": " is the experimenter and the experimental context that they're providing in terms of stimuli and then the behavior that they're observing of the entity in system and they are making a cognitive model of an entity so this is cognitive modeling as a process that's one aspect and it can be an active inference process from the experimenter",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5120.08,
    "end": 5141.005,
    "text": " without falling into the all minds are scientists fallacy that Jelle Brunberg has adequately sketched for us even in 2016, but we can still see an active inference framing of the outer experimental loop and use compatible frameworks for modeling the inner cognitive loop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5141.645,
    "end": 5143.886,
    "text": "And then one other note there",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5145.305,
    "end": 5161.796,
    "text": " with this last section of what you wrote is when we're using the active blockference package, which is implementing active inference in CAD-CAD, a complex systems modeling framework, CAD-CAD enables parameter sweeps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5162.716,
    "end": 5170.821,
    "text": "So you can have a parameter inside your simulation, 0.1, and then you could test and run a bunch of simulations concurrently or in series, like what if it were 0.1, 0.2, 0.3, 0.4.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5173.752,
    "end": 5183.537,
    "text": " We've also thought towards using active inference exactly in this meta Bayesian way, because the parameter sweep space can become vast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5183.877,
    "end": 5189.62,
    "text": "If you have hundreds of parameters, the sweeping across hundred dimensional spaces is massive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5189.64,
    "end": 5195.543,
    "text": "The space is large, which actually motivates an imperative for searches.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5195.923,
    "end": 5202.847,
    "text": "And that brings timeliness back into the picture through the scientific modeling process in finite lives, finite resources, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5203.868,
    "end": 5213.532,
    "text": " where we're using active inference and finding optimally informative experiments of parameters to test about the inner system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5214.513,
    "end": 5226.858,
    "text": "And so this is like a case where in the visual, graphical, analytical framing shown here in figure nine one, or in the computational implementation with active block inference,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5228.228,
    "end": 5242.72,
    "text": " In both of those technical settings, mathematical and computational, and then this setting, whatever it is that's on this slide, all of those are showing it's not even just like left eye open, right eye open.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5243.501,
    "end": 5244.341,
    "text": "This is binoculars.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5245.082,
    "end": 5248.465,
    "text": "We're not just switching the monocle from one eye to another.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5249.305,
    "end": 5255.49,
    "text": "It's actually able to be like wrapping and gripping itself in this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5255.991,
    "end": 5256.211,
    "text": "Stephen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5258.86,
    "end": 5280.294,
    "text": " thanks if you go back to that previous slide that ties to this from the textbook um i don't know if you still got it there the text image yeah um the there's where it says subjective model i would imagine",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5282.014,
    "end": 5290.357,
    "text": " that itself could be called, you know, might be thought of as an instrument of sorts, or a modelling process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5291.557,
    "end": 5308.123,
    "text": "There's a question about how this can be interpreted, and it's useful, maybe this is a sort of a bridge, because even within this, it's like, well, subjective is an interesting term, where it's actually now being modelled out, where is it objective, where is it...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5311.593,
    "end": 5327.963,
    "text": " where would that then be in terms of, is it a case of really getting a feel for these parameters as they sweep, you find the sweet spots, you find that scale friendliness that starts to emerge",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5328.763,
    "end": 5344.348,
    "text": " could be enough i mean that could be what a lot of organisms are doing as well although it's refined obviously through evolution but you know as you sweep it is what pragmatically gets you where you need to be as opposed to being real values that have been aimed for",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5345.488,
    "end": 5373.808,
    "text": " um so you get into this interesting loop i think that dean was showing there between the realism anti-realism i mean there might even be times to break realism to get out of that hard lock and say this is really what's going on no it's a sweep to find a scale friendliness it's uh you know dean was going to say something i'm going to pass it over no no no i just love love this because without any sort of prompting that that diagram that i put up",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5374.87,
    "end": 5379.173,
    "text": " I don't know when Carl built that diagram.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5379.954,
    "end": 5385.277,
    "text": "I know when I built mine and ported it over to this set of slides.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5385.297,
    "end": 5386.538,
    "text": "It was many, many years ago.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5387.138,
    "end": 5395.344,
    "text": "And the thing that I always said to people who I shared it with and I tried to unpack it and explain it was I want you to manipulate it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5395.504,
    "end": 5400.908,
    "text": "Well, the fantastic thing is many, many times Daniel in his capacity as a",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5401.667,
    "end": 5411.57,
    "text": " host and moderator of these live streams, he takes information and he manipulates it, which is exactly what I had participants in the programming that I was doing actually do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5411.85,
    "end": 5429.595,
    "text": "Because if it's left as the representation and the person isn't allowed to move things around and actually play with it, then they have to take, I'm imposing on them, where the person reading Carl's books and Carl's representation, that process",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5430.97,
    "end": 5435.472,
    "text": " to product, like there's a product now in front of you, that's already been established.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5435.732,
    "end": 5437.132,
    "text": "And now you're interpreting that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5437.452,
    "end": 5448.917,
    "text": "But every time you manipulate it, you actually start by creating your own product first, and then through the manipulation, discover the relationship and the relativity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5449.637,
    "end": 5458.08,
    "text": "So one of the things, whether it's Carl's representation or my much cruder one, it's still when the person picks it up,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5458.553,
    "end": 5465.498,
    "text": " and literally sweeps through it, Steven, as you were describing it, that's when the inversion actually takes place.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5465.718,
    "end": 5481.888,
    "text": "If you leave it static, if you leave it as a bridge, and then you don't get a chance to move it around and manipulate it and re-represent it through your own inaction, that's when we tend to get, I mean, some of us are super bright.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5482.008,
    "end": 5483.149,
    "text": "I'm not one of those people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5483.55,
    "end": 5485.471,
    "text": "That's why I had to give people like me",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5486.909,
    "end": 5496.496,
    "text": " the opportunity to say, don't just leave it on the page, play with it, do something with it, enact it into your own set of comprehensions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5499.238,
    "end": 5499.899,
    "text": "So here's a little,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5501.451,
    "end": 5524.037,
    "text": " evocative image meme but let's to complete the comparison we discussed how we had the open edge quadrant model here and some quotes from the inactive dynamic paper now we're going to go to the next slide where the bounding of the red is on the outside of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5525.233,
    "end": 5528.954,
    "text": " visual, and we're taking quotes from the abductive paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5528.994,
    "end": 5533.895,
    "text": "So what quotes did you highlight from the paper, and what does the change in the visualization represent?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5534.815,
    "end": 5542.457,
    "text": "Okay, so first thing they see is that the rows and the columns have disappeared, and all we've done is made sure that there's those edges on the outside.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5542.477,
    "end": 5545.117,
    "text": "So just to confirm that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5546.458,
    "end": 5549.418,
    "text": "So remember, this is just comparison one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5549.518,
    "end": 5552.579,
    "text": "There were six comparisons between these two papers that I pulled.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5553.281,
    "end": 5555.142,
    "text": " So I want to make that clear too.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5555.963,
    "end": 5567.849,
    "text": "But on this first comparison, just to show what the difference is between an edgeless and an edge-constrained, this is especially the case, this is a quote now from Adi and Majid's paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5568.209,
    "end": 5574.813,
    "text": "This is especially the case if we assume that the development of markup blankets by Friston now eclat Friston blankets",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5575.658,
    "end": 5585.381,
    "text": " unlike their original characterization works by Judea Pearl on probabilistic causal networks, admit of a realist interpretation of the relationship between the organism and the environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5585.721,
    "end": 5600.625,
    "text": "While the role, so it's variability retained, the role of the concepts of the Markov blanket and Pearl blankets and many treatments of the free energy principle is an instrumentalist one, whereas in Pierce's even stronger terms,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5601.055,
    "end": 5611.041,
    "text": " concede to a nominalist interpretation of meaning, Frist and Blankets are realist, not only in the non-instrumentalist sense, but also in the sense of being non-nominalist entities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5611.762,
    "end": 5624.529,
    "text": "The modal terms of references are two real possibilities, such as what's conceivable or produced by imagination, anticipatorially related to the future states of affairs, are used in making sense of the key aspects of the theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5625.03,
    "end": 5628.592,
    "text": "We will argue in this paper that free energy principle has been put at the center",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5629.113,
    "end": 5640.02,
    "text": " of a viable picture of an organism's insight into the consequences of its action and its ability to choose the best or most efficient strategies that contribute to the fulfillment of best possible consequences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5640.421,
    "end": 5644.643,
    "text": "So not just consequences now, but over a temporal field.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5645.304,
    "end": 5652.389,
    "text": "And all I noted was realism is the philosophical position that posits that universals are just as real as physical,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5653.18,
    "end": 5654.221,
    "text": " measurable material.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5654.341,
    "end": 5659.764,
    "text": "Nominalism is the philosophical position that promotes that universal or abstract concepts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5662.346,
    "end": 5663.606,
    "text": "I just lost my place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5664.067,
    "end": 5664.367,
    "text": "Sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5665.167,
    "end": 5666.388,
    "text": "I just made a new line.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5666.568,
    "end": 5670.231,
    "text": "Abstract concepts do not exist in the same way as physical, tangible material.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5670.771,
    "end": 5680.577,
    "text": "From instrumentalism to insight and insight or minimum to, we talk about that all the time because we're talking about relational and not just relative, to rules.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5681.943,
    "end": 5688.366,
    "text": " We build categories, we generate hierarchies, and eventually we see patterns to model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5688.787,
    "end": 5689.707,
    "text": "We gain an insight.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5690.147,
    "end": 5691.848,
    "text": "Then the pattern is tested.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5692.368,
    "end": 5696.23,
    "text": "There's another paper that I read about it that's fantastic called The New Light on Peirce.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5696.811,
    "end": 5697.791,
    "text": "And I quote it from that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5698.371,
    "end": 5701.493,
    "text": "This is what Peirce had in mind when he wrote Lady Welby.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5701.953,
    "end": 5704.735,
    "text": "That's reasonable to adopt a given hypothesis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5705.355,
    "end": 5706.996,
    "text": "Reasonable, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5709.276,
    "end": 5717.547,
    "text": " if it will be wise to go to some expense to put the hypothesis to test, dependent upon the advantage that that would accrue from knowing the truth of the hypothesis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5718.048,
    "end": 5720.591,
    "text": "From that testing the result of consistency, i.e.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5720.671,
    "end": 5724.556,
    "text": "repeatability, comes universal things like laws, rules, actions, etc.,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5725.714,
    "end": 5728.816,
    "text": " That's the stuff that in my diagram is on the right-hand side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5729.537,
    "end": 5731.058,
    "text": "This is the entirety of the pro.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5731.198,
    "end": 5733.139,
    "text": "It is the entirety of the process real.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5733.42,
    "end": 5735.121,
    "text": "Yes, because it's complex.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5735.942,
    "end": 5740.125,
    "text": "A reality made up of processes, some of which have no basis in reality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5740.585,
    "end": 5743.307,
    "text": "Again, from the new light on Pierce again, Addie's paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5743.885,
    "end": 5759.236,
    "text": " The fourth memoir entitled Analysis of the Methods of Mathematical Demonstration opened with the affirmation that his first real discovery about mathematical procedure was that there are two kinds of necessary reasoning, the collateral and the theoretic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5760.317,
    "end": 5761.718,
    "text": "These he explained as follows.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5762.138,
    "end": 5767.082,
    "text": "Collateral deduction is where it is only necessary to imagine",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5767.674,
    "end": 5773.937,
    "text": " any case in which the premises are true in order to perceive immediately that the conclusion holds in that case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5774.058,
    "end": 5793.128,
    "text": "The aromatic deduction is a deduction in which it's necessary to experiment in the imagination upon the image of the premise, then in order from the result of which experiment to make, sorry, collateral deductions to the truth of the conclusion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5793.208,
    "end": 5796.57,
    "text": "So again, this kind of hints that if we",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5797.887,
    "end": 5804.77,
    "text": " remove too many things and reduce too far, we are left with nothing but instrumentalism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5806.37,
    "end": 5816.494,
    "text": "So within those bounded contexts that we've now arbitrarily parameterized, there's a whole bunch of things that we can pack into that silo.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5817.834,
    "end": 5820.435,
    "text": "And those things can move around and float around in there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5820.755,
    "end": 5822.616,
    "text": "They're not constrained",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5823.021,
    "end": 5825.563,
    "text": " to the upper right and the lower left corner.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5825.603,
    "end": 5838.796,
    "text": "Now all of a sudden, those bidirectionalities are indicators of just how much fluidity is going on as we pass from product and sweep across to insight.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5841.684,
    "end": 5842.084,
    "text": " Thanks, Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5842.524,
    "end": 5844.125,
    "text": "Let me add a thought here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5844.245,
    "end": 5848.568,
    "text": "So just for reminder and reference, other resources you'll find so much more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5848.648,
    "end": 5855.491,
    "text": "But deduction is the inference of or about particular instances by referencing generalities, laws, and principles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5855.992,
    "end": 5863.516,
    "text": "Induction, in contrast, is where we go from what we've observed with the instances up towards forming generalities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5863.876,
    "end": 5867.598,
    "text": "So deduction, going down in that kind of a top-down framing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5869.577,
    "end": 5875.199,
    "text": " It's very interesting that the deduction is split into two components here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5876.299,
    "end": 5886.181,
    "text": "You said collateral, I believe, and I think that may be totally valid, but I at least would read this as corollarial, as in of or related to a corollary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5886.201,
    "end": 5887.922,
    "text": "Well, what have we heard?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5888.642,
    "end": 5890.723,
    "text": "Nowhere else but here and elsewhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5891.543,
    "end": 5895.764,
    "text": "Active inference is a corollary process theory of the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5897.205,
    "end": 5916.344,
    "text": " So from a more general principle in the definition, the corollarial deduction is a situation where a case is only needed to be imagined, really imagined, where the premises are true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5918.22,
    "end": 5939.493,
    "text": " Propose a blanket where there's a particular entity and the blanket is separating them from the generative process in such and such a way, such that the entity is a generative model and the internal states are doing some kind of mode tracking or path tracking of external states in a cybernetic good regulator framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5941.474,
    "end": 5943.355,
    "text": "The premise is merely a premise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5944.016,
    "end": 5945.577,
    "text": "It's not the culmination.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5946.86,
    "end": 5950.062,
    "text": " So that's what we see in the corollarial deduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5950.902,
    "end": 5956.104,
    "text": "All you have to do is consider the premise to perceive immediately that the conclusion holds in that case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5956.685,
    "end": 5970.191,
    "text": "Well, yes, if you propose setting up the Bayes graph to be truly just that way as a corollary of the free energy principle, then that is already like a story arc that's been completed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5971.195,
    "end": 5981.145,
    "text": " No one's saying that you wrote the paper or that you had the startup that's profitable, but also no one can say that it's incorrect that you made a premise that kind of completed its arc.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5982.046,
    "end": 5985.189,
    "text": "And then in the second case, we're still within deduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5986.15,
    "end": 5989.274,
    "text": "However, it's necessary to experiment in the imagination.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5989.814,
    "end": 5990.915,
    "text": "So a thought experiments",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5991.752,
    "end": 6003.563,
    "text": " which we can place into a setting of mental action and attention and counterfactuals, counterfactual generation requires the generation of counterfactuals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6004.344,
    "end": 6005.705,
    "text": "Ergo, it is abductive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6005.985,
    "end": 6008.648,
    "text": "It requires a generative phase and a selective phase.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6009.308,
    "end": 6012.031,
    "text": "So we're going to generate and select.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6012.531,
    "end": 6017.055,
    "text": "That's the abductive loop that's happening with a when in a semantic space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6018.186,
    "end": 6021.028,
    "text": " as part of this theorematic deduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6021.808,
    "end": 6029.533,
    "text": "And then the results of that experiment can be used to make corollarial deductions to the truth of the conclusion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6030.794,
    "end": 6036.537,
    "text": "So that's kind of counterfactuals on imagined premises.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6037.718,
    "end": 6038.158,
    "text": "And guess what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6038.339,
    "end": 6038.719,
    "text": "It's real.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6040.2,
    "end": 6040.48,
    "text": "Steven?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6044.875,
    "end": 6046.816,
    "text": " Can I add one question in there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6050.138,
    "end": 6062.624,
    "text": "We make our deduction from a particular instance and we abduct the kind of best policy selection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6064.725,
    "end": 6071.189,
    "text": "When we induce generally this induction, I see that as kind of a narrowing the gap often.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6072.211,
    "end": 6080.58,
    "text": " There's a generality and then a bit like reinforcement learning, like trying to, you're inducing between.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6081.741,
    "end": 6086.526,
    "text": "And that's often what we see is most visible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6086.606,
    "end": 6094.273,
    "text": "Someone's trying to reduce the gap in the physical world with the product that we've got that we're manipulating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6095.254,
    "end": 6118.949,
    "text": " um because that's kind of what we can see i was speaking i think earlier to dean about this you know someone's making a pot and that you know they have the piece of clay that goes wobbly and they're sort of making it into a pot you know so there's kind of like they're inducing inductively trying to make it closer and closer to something that's more like the general idea of a pot but that's what we see",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6120.168,
    "end": 6122.948,
    "text": " And at some point, we might not know what they're even doing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6123.009,
    "end": 6124.869,
    "text": "Then suddenly we deduce it's a pot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6124.889,
    "end": 6127.509,
    "text": "Because like you say, there's a particular instance of being evoked.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6128.329,
    "end": 6133.67,
    "text": "But behind all of that, there's abductive processes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6134.851,
    "end": 6137.311,
    "text": "I don't know whether the word biosemiotics is the term.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6137.351,
    "end": 6140.812,
    "text": "Actually, I'm still not quite sure how to put that in there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6140.832,
    "end": 6144.412,
    "text": "But I think that fits in with what you're saying.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6144.992,
    "end": 6148.193,
    "text": "I wonder what your thoughts are on that sort of inductive take.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6150.819,
    "end": 6158.766,
    "text": " If I can just highlight how this comparison one relates to the realism instrumentalism and the clay pot creation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6161.488,
    "end": 6169.214,
    "text": "So here we have the quadrant separated again, totally speculating, working with Dean's graphical artistry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6172.417,
    "end": 6178.783,
    "text": "In one totally defensible and absolutely scientific framing,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6179.841,
    "end": 6192.049,
    "text": " The viewer of the pot construction could see their entire logical apparatus and inference about what is happening as an instrumental process happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6192.229,
    "end": 6194.15,
    "text": "I'm not saying that they're really making a pot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6194.19,
    "end": 6200.535,
    "text": "I'm just saying that's a socially constructed term, and it's totally contingent on my enculturation, what I believe is a pot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6200.595,
    "end": 6201.896,
    "text": "Maybe they're making a piece of art.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6202.136,
    "end": 6204.637,
    "text": "Who am I to say that it's not something else?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6205.098,
    "end": 6206.038,
    "text": "Maybe it could be used as a hammer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6206.739,
    "end": 6206.859,
    "text": "So...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6208.519,
    "end": 6234.94,
    "text": " that places the inference about the system at the forefront and provides clarity as well as openness the edges of the drawing are open because it does leave a lot of structuredness surrounding the origin point again but also room to go off in many many directions what majid returned our attention to was the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6237.398,
    "end": 6250.004,
    "text": " nature of observations coming from the generative process, coming from the niche, if it's whimsical, as I think he said, well then yes, instrumentalism is fine in its totality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6250.804,
    "end": 6262.169,
    "text": "However, if it's not whimsical, if there really is a table that you're going to get hit by, if that is really something that you're buying, if that is something with limited resources we're doing, are we making a pot or are we making a pan?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6263.73,
    "end": 6265.851,
    "text": "Then the boundedness",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6267.688,
    "end": 6275.454,
    "text": " is now moving to that scenario, which includes the mindedness of all of the entities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6276.135,
    "end": 6294.29,
    "text": "One entity is not speaking for the other, but that entity is seeing the situation as real in that it is truly providing pragmatic implications for survival, and it's real meaning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6294.59,
    "end": 6296.332,
    "text": "It's really biosemiotic meaning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6297.216,
    "end": 6302.619,
    "text": " And so here, the boundedness is more around the situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6304.58,
    "end": 6313.865,
    "text": "And in that space, in that room, there are paths amongst the theory where if you go into a different situation, you cross the line.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6313.925,
    "end": 6321.67,
    "text": "Now, crossing a line is not like always a bad thing, but all of a sudden, if someone's daydreaming about a totally different topic, they've exited the situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6322.73,
    "end": 6325.712,
    "text": "But within the situation, there are a diversity of approaches.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6327.045,
    "end": 6343.732,
    "text": " Here, the situation is actually being used just as an experimental context for a theoretician or a researcher in their removal to be able to consider different ways of modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6345.652,
    "end": 6354.156,
    "text": "So I'm not sure if this is consistent or Dean orthodoxy or heterodoxy, but I see the boundedness as",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6355.535,
    "end": 6367.058,
    "text": " allowing for that center of action to be approached in a pragmatic, not a theoretical, but not academic approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6367.779,
    "end": 6376.161,
    "text": "Whereas by making the divisions, cutting nature at the joints and like, oh, wow, those joints correspond to longstanding philosophical debates in academia.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6376.781,
    "end": 6377.181,
    "text": "Who knew?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6377.842,
    "end": 6380.462,
    "text": "And maybe they don't always correspond to those joints.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6382.043,
    "end": 6382.363,
    "text": "Yes, Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6384.488,
    "end": 6387.09,
    "text": " I know we're getting close to the end here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6387.19,
    "end": 6390.012,
    "text": "So thank you for explaining that in your words.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6390.093,
    "end": 6399.36,
    "text": "That helps me because I'm always curious to whether or not the things that I'm trying to share actually are making sense to other people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6399.62,
    "end": 6402.743,
    "text": "And it sounds like it maybe is gaining some traction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6402.883,
    "end": 6406.646,
    "text": "I want to say this one thing before we have to sign off here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6408.769,
    "end": 6422.458,
    "text": " Traditionally, in most academic settings, and I'm as guilty of this as anybody because I was a curriculum designer for a part of my life, we start out trying to figure out how to construct a plan.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6423.219,
    "end": 6432.225,
    "text": "And I think what activism affords is this idea that instead of we construct a plan and then others follow it, called a curriculum,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6433.28,
    "end": 6440.883,
    "text": " What this potentiates, in addition to that, this is not dismissing that or saying that that doesn't have its time and its place.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6441.503,
    "end": 6445.685,
    "text": "What this does is asks us whether or not we could forage a plan.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6446.445,
    "end": 6451.127,
    "text": "Could we figure out how to fly, how to build the plane on the fly?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6452.027,
    "end": 6454.668,
    "text": "That's all this is entertaining.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6455.488,
    "end": 6456.949,
    "text": "So that you actually have both.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6457.569,
    "end": 6463.071,
    "text": "So when you're a Sully and Hudson River has never traditionally been a landing strip",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6464.099,
    "end": 6466.001,
    "text": " it becomes one, but you need both.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6466.741,
    "end": 6470.784,
    "text": "You need to think and to do, you need the action and the abduction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6471.965,
    "end": 6481.893,
    "text": "And so if you limit yourself to one or the other for the sake of not being cognitively overloaded, I get that, that's the deconstruction piece.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6482.354,
    "end": 6489.74,
    "text": "But if you are foraging for a plan, the plan falls out of a product.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6489.88,
    "end": 6493.583,
    "text": "Your priors meld with your priorities",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6494.011,
    "end": 6503.076,
    "text": " And then it becomes self-evident what the plan is, as opposed to somebody handing you a list and then you simply following.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6504.236,
    "end": 6508.918,
    "text": "So I wanted to get that in before we have to call it a day.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6509.499,
    "end": 6521.825,
    "text": "But I think that's important to sort of put that context both in gripped and as gripper, because it's no more complicated or simple than that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6525.199,
    "end": 6553.299,
    "text": " thanks we are on our last slide now we got through one of the six comparisons and the six were the tip of the iceberg of the tip so we know that we can never linearize or vocalize everything that needs to occur but we also carry on so we can pause here reflect on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6554.585,
    "end": 6558.387,
    "text": " the last three videos in this series, 47, 0, 1, and 2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6561.169,
    "end": 6563.23,
    "text": "Where to now?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6564.391,
    "end": 6570.214,
    "text": "How are we different after 47.2 than before 47.00?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6570.254,
    "end": 6572.016,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6575.117,
    "end": 6579.26,
    "text": "My suggestion is that when we reflect, we are literally abducing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6579.78,
    "end": 6582.562,
    "text": "We are literally looking back at the entire",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6583.126,
    "end": 6589.493,
    "text": " narrative or continuum or whatever you want to call it, and trying to figure out what just happened.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6590.474,
    "end": 6599.523,
    "text": "So yeah, and I think that's when a lot of the stuff that's, that's not instrumentalist turns real.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6600.043,
    "end": 6603.347,
    "text": "I don't think people actually get a real sense of real until they do the reflection.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6605.99,
    "end": 6625.094,
    "text": " the classical scientific communication, public speaking advice, which I look forward to seeing how what Majeed shared about economy of research also re-imagines the doing and the communication of science, of course, but some of the classic advice is tell them what you're going to tell them, tell them, and then tell them what you've told them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6626.115,
    "end": 6631.456,
    "text": "We can turn that into a bit more of a inactive or a planning based",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6632.614,
    "end": 6659.795,
    "text": " framing like consider what is about to happen abduction during the live stream think about what is happening attention and then after the live stream consider what happens reflection all of those processes are happening in the dot zero one and two of each sentence of each person speaking turn",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6660.825,
    "end": 6688.774,
    "text": " in the videos and at all these different scales that's as real as anything so it's really a nice hopefully sequence that we've engaged on and there may be more decimals to come on 47 certainly 48 and beyond will also carry forward in this historical way",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6690.157,
    "end": 6699.666,
    "text": " in which when we talk about concepts beyond 47, we'll have this shared basis of bringing abduction in and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6700.007,
    "end": 6704.011,
    "text": "So, Stephen, any last thoughts?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6705.752,
    "end": 6707.754,
    "text": "Yeah, I'd like to... Thanks for going here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6707.834,
    "end": 6708.054,
    "text": "I think...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6709.454,
    "end": 6715.315,
    "text": " we've had enough traction to show that there's a lot of value in trying to wrestle between.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6716.475,
    "end": 6728.358,
    "text": "And there is, as well as that idea of the scientific, you know, like Daniel, you mentioned the scientific communication where you have something that's quite clear to communicate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6728.378,
    "end": 6735.819,
    "text": "There's also when it's opening up a space for something that could go down multiple",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6736.806,
    "end": 6739.428,
    "text": " different routes once it's contextualized.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6739.448,
    "end": 6745.073,
    "text": "So I think this speaks to contextuality, situatedness, and may require some",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6749.276,
    "end": 6761.982,
    "text": " I'm interested in how this may require some nonverbal kind of more experiential processing to like of certain places to explore.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6762.062,
    "end": 6771.586,
    "text": "So I think that might be open up the potential to sit in between and just take something from here and say, Okay, what would that be like experientially, and just groove in that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6771.666,
    "end": 6776.788,
    "text": "So that's something I'm going to explore what that might be like, Dean penultimate words.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6778.191,
    "end": 6784.596,
    "text": " I want to thank the two of you again for creating a kind of, in Stephen's point, a kind of a safe space to take these kind of risks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6785.336,
    "end": 6788.879,
    "text": "Because again, we're not just sticking to the script.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6789.319,
    "end": 6792.061,
    "text": "We're kind of maybe triangulating off two scripts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6792.761,
    "end": 6796.264,
    "text": "And that doesn't mean that you're always going to be right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6796.304,
    "end": 6800.327,
    "text": "I mean, if people come back and say, wow, were you ever wrong about this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6800.767,
    "end": 6801.488,
    "text": "I get to learn.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6801.948,
    "end": 6806.191,
    "text": "But I think before that opportunity even arose, prior to that,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6807.065,
    "end": 6816.247,
    "text": " There were two people that are now sitting on my desktop here who shared in that risk analysis effort.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6816.307,
    "end": 6826.45,
    "text": "And I want to thank both of you for being so supportive around taking this kind of, let's hang it out there and see who salutes and who takes it down.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6826.51,
    "end": 6830.01,
    "text": "Because if it's taken down, I'm okay with that too.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6830.03,
    "end": 6836.512,
    "text": "But just being able to have the opportunity has been spectacular in terms of developing how I think.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6838.897,
    "end": 6841.783,
    "text": " Ask not what you can do for your corollary process theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6844.007,
    "end": 6844.808,
    "text": "See you fellows later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6845.109,
    "end": 6845.409,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6845.91,
    "end": 6846.211,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  }
]