[
  {
    "start": 28.291,
    "end": 33.941,
    "text": " all right hello and welcome everyone this is actin live stream number 47.0 it is august 3rd 2022.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 39.451,
    "end": 41.733,
    "text": " Welcome to the Active Inference Institute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 42.473,
    "end": 48.998,
    "text": "We are a participatory online lab and institute that is communicating, learning and practicing applied active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 49.478,
    "end": 51.58,
    "text": "You can find us at some of the links on the slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 52.521,
    "end": 57.444,
    "text": "This is a recorded and an archived and transcribed and published live stream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 58.085,
    "end": 61.227,
    "text": "So please provide us with feedback so we can improve our work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 62.368,
    "end": 67.712,
    "text": "All backgrounds and perspectives are welcome and we'll be following video etiquette for live streams.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 70.453,
    "end": 77.66,
    "text": " All Active Inference Institute activities are participatory, so do let us know if you want to contribute or get involved.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 78.041,
    "end": 83.166,
    "text": "Head over to ActiveInference.org and click the links to participate directly and to learn more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 84.908,
    "end": 92.396,
    "text": "Well, we are about to set off on an odd-numbered and unique adventure in 47.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 94.295,
    "end": 105.984,
    "text": " We're going to be discussing and juxtaposing not one paper as per usual, but have a multiple eyes open approach towards two papers in this situation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 107.125,
    "end": 119.494,
    "text": "We're going to be learning and discussing in a juxtaposed fashion two papers, Active Inference and Abduction in 2021 by Ati Vaiko, Pia Terenin, and Majid Beni.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 120.666,
    "end": 128.071,
    "text": " Also, we'll be discussing An Active Dynamic Social Cognition and Active Inference by Ines Hippolito and Thomas Van Es, also from 2021.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 128.191,
    "end": 139.359,
    "text": "All videos, .zeros and otherwise, are introductions to these ideas and additional context, not a review or evaluation or a final word.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 140.584,
    "end": 159.022,
    "text": " And we are going to consistently, we hope, use this coloration of a light red for the abductive paper and a light blue for the inactive, leaving the space open for new colors and combinations to arise that demonstrate some areas of synthesis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 159.762,
    "end": 162.945,
    "text": "And we're going to talk in this dot zero,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 163.686,
    "end": 171.051,
    "text": " with some big questions and go over our aims as well as reading in between those aims, which is a little bit different than many live streams.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 171.772,
    "end": 179.637,
    "text": "We're then going to provide overview information on each paper in terms of the aims, the claims, the roadmap, and the abstract.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 180.458,
    "end": 189.884,
    "text": "We'll then move to a background and context section that will include a lot of information on inaction, semiotics, abductive logic, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 190.805,
    "end": 207.018,
    "text": " we'll then move into a juxtaposition of the two papers and we're going to have a lot of time to discuss with hopefully multiple authors in the upcoming discussions dot one dot two and maybe beyond so today we wanted to bring a big picture context",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 208.496,
    "end": 228.351,
    "text": " talk about some very interesting threads, provide a little bit of background that helps one enter into this space, and then provide an initial juxtaposition and run through these papers that, again, will just get somebody excited to read the papers, dive in more deeply, and bring their own perspective to bear on these very interesting topics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 229.052,
    "end": 231.974,
    "text": "So we'll move to the introductions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 233.275,
    "end": 233.735,
    "text": "I'm Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 234.035,
    "end": 235.697,
    "text": "I'm a researcher in California.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 236.85,
    "end": 240.532,
    "text": " and I'll talk more about what's exciting in the coming slides.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 241.032,
    "end": 242.053,
    "text": "I'll pass it to Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 242.073,
    "end": 244.094,
    "text": "Good morning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 244.114,
    "end": 244.814,
    "text": "My name is Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 244.954,
    "end": 262.743,
    "text": "I'm in Calgary, and I guess I was maybe the warped mind that tried to put this idea together and maybe change a little bit the way that we look at active inference by trying to pull two different papers of seemingly different focuses",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 264.332,
    "end": 273.205,
    "text": " And then both of those also incorporating the use of active inferences as a methodology to situationally analyze.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 273.245,
    "end": 275.489,
    "text": "And so what are the implications for that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 276.41,
    "end": 277.972,
    "text": "So I find that really kind of exciting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 278.693,
    "end": 279.675,
    "text": "And I'll pass it over to Stephen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 283.891,
    "end": 305.716,
    "text": " so thank you dean yes stephen here i'm in um toronto canada um and i'm really interested in about both of these papers because they both speak a lot to kind of participatory approaches in general and the idea of how people are engaging in the world um so the the questions around",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 306.836,
    "end": 324.746,
    "text": " um inaction is is really relevant as is the abduction piece so um while they're both quite different papers they're both speaking uh to me quite strongly so that's really interesting so i'm looking forward to being able to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 325.606,
    "end": 326.927,
    "text": " sort of explore that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 327.427,
    "end": 352.727,
    "text": "I work with participatory theatre, community psychology, community development and multi-scale development processes and I'm really excited to just see how this scientific take can meet a more, what might be called a practice-based participatory question that I've been looking at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 352.987,
    "end": 354.088,
    "text": "So I'll pass it back to Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 355.157,
    "end": 355.497,
    "text": " Excellent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 355.757,
    "end": 356.357,
    "text": "Thank you both.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 356.577,
    "end": 375.802,
    "text": "And Dean, thanks again for the many month journey, the many email and month and message journey that we've walked, because I do hope this will unfold and include in a way that is taking live streams and the kind of materials that we're working through beyond where we have gone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 377.082,
    "end": 383.964,
    "text": "And in spirit of that, I will pass the Dean to introduce some of the big questions here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 385.595,
    "end": 401.567,
    "text": " Well, if you're going to pull two papers that don't seem to have a heck of a lot in common in terms of their subject matter, you're going to have to come at it from a little bit of a different angle in terms of not just ferreting out what's within a paper, but how those papers might be compared.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 401.647,
    "end": 415.218,
    "text": "So we pulled together some questions around the idea of what role as a situational analysis, either tool or reality method, active inference might play in",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 416.377,
    "end": 421.2,
    "text": " pulling things that seem to be a long ways away and apart and entangle them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 421.38,
    "end": 432.127,
    "text": "And so questions were basically, can active inference be both something that holds or contains or bounds something and also be the thing bounded or being gripped?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 432.667,
    "end": 433.848,
    "text": "What is active inference?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 434.468,
    "end": 445.475,
    "text": "Or what if active inference is both the thing being contained, say a partitioner line in a table and the cell,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 446.505,
    "end": 456.047,
    "text": " So the actual gap that we can actually put more information into what that look like, what it would look like both as a constraint and a separator simultaneously.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 456.067,
    "end": 468.871,
    "text": "And I think it's that mutuality piece that we're going to try to tease out in the next few live streams and what is similar or different in getting a grip on models and a different process, which is modeling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 471.511,
    "end": 471.852,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 471.992,
    "end": 473.552,
    "text": "Stephen, do you want to add anything here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 476.021,
    "end": 478.502,
    "text": " Now, I think that covers a lot of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 478.522,
    "end": 487.366,
    "text": "The only thing that X that's there is sort of denoting, you know, can active inference models, modeling, frameworks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 487.766,
    "end": 494.269,
    "text": "So this contextualization of the term sort of comes into play, but we're going to talk about that a bit later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 494.349,
    "end": 495.33,
    "text": "So, yeah, thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 496.323,
    "end": 496.624,
    "text": " Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 497.144,
    "end": 508.038,
    "text": "And this is one of potentially the first Our Aims slides because it is hopefully going to help to come back to this level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 509.758,
    "end": 518.626,
    "text": " The meme here represents this live stream bringing together the two papers in a way where we've had one hand clapping.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 519.327,
    "end": 522.169,
    "text": "Now we're going to bring that together into two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 522.189,
    "end": 525.932,
    "text": "You can hear the sound coming out of the live stream already, especially if you're listening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 527.389,
    "end": 532.67,
    "text": " Dean, what would you describe about our aims or how would you summarize?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 532.77,
    "end": 540.831,
    "text": "Oh, and one other note I'll add about our aims is we want it to be comprehensive, but also to have videos that are listenable and of reasonable temporal duration.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 541.331,
    "end": 545.552,
    "text": "So there will be many slides that will have a lot of text copied out of the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 546.092,
    "end": 552.293,
    "text": "And we'll merely note, pause the video if you'd like to read, but we're just going to move on from many of the text slides.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 552.333,
    "end": 555.154,
    "text": "We just really wanted to make sure that all the text was there and visible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 555.854,
    "end": 557.234,
    "text": " but we're not going to read everything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 557.694,
    "end": 563.176,
    "text": "So please, Dean, summarize what of these aims you'd like to talk about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 563.556,
    "end": 571.997,
    "text": "I'm just going to talk about the root of each one of these bullets, which is take a closer look at the realism-instrumentalism debate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 572.358,
    "end": 574.038,
    "text": "I don't have to go into what that is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 574.458,
    "end": 577.579,
    "text": "If you've been a participant in it, you know what we're describing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 578.539,
    "end": 583.44,
    "text": "Reinforce a two-eyes-open approach where one eye takes in the pair of active inferences",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 583.854,
    "end": 598.225,
    "text": " papers, the inactive dynamic social condition and abduction, while the other eye manifests active inference as an integrator of both, because we think that it actually can do that without blending.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 598.245,
    "end": 600.807,
    "text": "It can actually cause a weave or a braid.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 601.708,
    "end": 612.837,
    "text": "And then the third bullet is make explicit the absolute necessity, if we're going to do those first two things of understanding the temporal depth of models that would actually incorporate",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 613.567,
    "end": 621.373,
    "text": " two papers of seeming distant topics as we make active inference into two different subjects.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 622.153,
    "end": 627.717,
    "text": "And then just what we did is pulled out different things that the authors noted about their papers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 629.399,
    "end": 629.759,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 629.999,
    "end": 635.903,
    "text": "And Stephen, if you could carry forth with reading in between those aims or adding anything you'd like from this slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 637.224,
    "end": 638.025,
    "text": "Yeah, thanks, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 639.955,
    "end": 668.595,
    "text": " know one set of authors says you know is really looking at instrumentalism um and you know you know it's a valid scientific perspective but you know there is there that then describes you know this question about the road towards um realism and normalism so you know where the idea is that in one paper that instrumentalism is is the way to sort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 669.56,
    "end": 692.781,
    "text": " capture or to to sort of hold ourselves in this scientific work well that can be challenged um and we would we would see ways that we might need to to loosen that when we get into participatory approaches so something in between which loosens that scientific space and is a practice space so the same with the second point",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 693.862,
    "end": 713.218,
    "text": " um where okay is is instrumentalism um you know the way forward so what what constitutes behaviors when living in a niche what constitutes living beings um and how do we resolve which way forward so if there's if there are contradictions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 714.696,
    "end": 737.268,
    "text": " should we reconcile them if we're in a team trying to use this um should we just live with them and just move forward um or where should we actually highlight them so this is in a way trying to think in a um outside of maybe this sort of laser focus on the scientific philosophical point and saying okay when we're trying to bring these into a team context",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 738.795,
    "end": 767.678,
    "text": " should we would we loosen some of that so and so just it just mentions here to give an application should we then also think about active influence being prefaced or suffixed you know adaptive active inference effective active inference or active inference modeling you know is how important is that clarification to to then also think about how the instrumentalism realism piece might be utilized in in these other ways",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 768.652,
    "end": 774.358,
    "text": " Do we need to position fully in one, fully on another?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 774.699,
    "end": 780.846,
    "text": "And if we're in between, can there be greater or lesser access to knowing based on the context?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 781.086,
    "end": 782.568,
    "text": "So often in participatory work,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 783.829,
    "end": 809.328,
    "text": " different types of practices you know the context is key and then this sort of speaks a little bit to my own idea of the co-creative work and i know that um you know daniel's very much with teams and and dean's very much with transformation you know often there there's a co-creation piece there's a bit where you you want to support the butterfly without crushing it there's something quite delicate there so how can we at times",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 810.285,
    "end": 816.706,
    "text": " bring this into spaces where it's a co-creative space, where there's modeling happening in a more subtle contextual way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 817.687,
    "end": 829.049,
    "text": "And while we have these scientific definitions and strategic designs and hard analysis, and they're useful, we don't want them to crush what's happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 829.509,
    "end": 832.59,
    "text": "And there's a couple of pictures there that sort of speak to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 832.61,
    "end": 838.731,
    "text": "And I'll pass it over to Dean maybe, and you can speak to the sampling, the waters in between and the mind the gap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 840.686,
    "end": 845.231,
    "text": " Well, I think that was a beautiful explanation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 845.311,
    "end": 852.859,
    "text": "And I think if and when the authors are able to come on, that'll be something that we'll now be able to put some color to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 852.879,
    "end": 858.766,
    "text": "I think we put some anchors in the ground, but we haven't said how much flow",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 860.236,
    "end": 862.177,
    "text": " can go between those different nodes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 862.337,
    "end": 866.038,
    "text": "And that's what I think we wanted to establish right here is the betweenness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 866.558,
    "end": 869.299,
    "text": "Lots of times, like it says, mind the gap.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 869.599,
    "end": 872.6,
    "text": "That's the only thing that can kill you at the subway, all right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 872.84,
    "end": 875.26,
    "text": "Because you're not paying attention to the gap.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 875.32,
    "end": 883.423,
    "text": "And I think the sampling of the waters in between does the same thing, except it provides a little subtle difference in terms of the fluidity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 884.159,
    "end": 885.259,
    "text": " of those kinds of gaps.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 885.9,
    "end": 899.125,
    "text": "So I think it would be really interesting if we use that as our portal into how we might bring things together and make them dance when they otherwise would be sitting on chairs on the opposite side of the room.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 899.465,
    "end": 904.027,
    "text": "That might be an interesting conversation to start in the dot one and two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 906.288,
    "end": 907.008,
    "text": "Thank you both.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 907.228,
    "end": 910.97,
    "text": "And the only comment I'll add here is this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 912.148,
    "end": 919.732,
    "text": " discussion we've been having on the adjectives that preface the adaptive, affective, et cetera, active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 920.573,
    "end": 929.258,
    "text": "And then also, Stephen, the focus you've brought to the suffix, that X in brackets, active inference model as one instance or case or realization,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 929.998,
    "end": 933.299,
    "text": " active inference framework, active inference process theory, what follows.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 933.759,
    "end": 942.302,
    "text": "And this really reminds me of left branching and right branching clauses in grammar and syntax, and that there's a base clause.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 943.342,
    "end": 944.503,
    "text": "What is our base clause?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 945.103,
    "end": 948.644,
    "text": "And then what branches before, during and after?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 948.704,
    "end": 957.367,
    "text": "I think there's a very rich space and I really like these embodied and flux based metaphors that help us understand",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 959.778,
    "end": 987.28,
    "text": " so much so into the paper overviews this will just be some metadata and descriptions on the papers before we pull back to the background and context and then move forward into the papers running through their main points so we're not going to read the abstracts they're both of course available for these papers here is the abstract for active inference and abduction",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 991.087,
    "end": 995.652,
    "text": " Here's the abstract for inactive dynamic social cognition and active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1000.216,
    "end": 1003.119,
    "text": "Here are the keywords for both of these papers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1003.499,
    "end": 1013.67,
    "text": "The inactive paper has the keywords social cognition, niche construction, active inference, theory of mind, inactivism, and dynamical systems theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1014.787,
    "end": 1024.67,
    "text": " The abduction paper has the keywords abduction, active inference, free energy principle, frist and blanket, triadic relations, and Pierce.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1027.011,
    "end": 1032.833,
    "text": "Let's go to the aims of and the claims of the abduction paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1033.713,
    "end": 1038.515,
    "text": "So Dean, would you like to cover any of the aims of the abduction paper?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1039.855,
    "end": 1042.636,
    "text": "What I would like to do is just sort of foretell what,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1043.325,
    "end": 1065.736,
    "text": " both of both papers want to aim at and that is you'll see a key word in the second bullet of this one which is alliance and then there are words that you're going to see in the other paper where they're again saying we want things to come together but we want to be careful in how we describe that coming together we don't want it to be perceived metaphorically as a blending",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1066.556,
    "end": 1075.487,
    "text": " as an undoing of two or more things that we believe have an associative relationship.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1075.867,
    "end": 1083.556,
    "text": "And so I think when you're going through the aims of the two papers, if you kind of step back a little bit, you'll see that the authors of both papers",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1085.765,
    "end": 1092.269,
    "text": " doing a hard explanation on what relationship they want us to pay attention to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1092.649,
    "end": 1095.071,
    "text": "And so that's something that they, both papers share.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1095.551,
    "end": 1097.392,
    "text": "It's a heavy emphasis on relationships.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1099.158,
    "end": 1100.018,
    "text": " Great point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1100.579,
    "end": 1104.2,
    "text": "And they both are very richly and powerfully written.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1105.181,
    "end": 1107.722,
    "text": "And here we see alliance and allegiance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1108.582,
    "end": 1121.569,
    "text": "And certainly there's going to be a lot of discussion in both the papers about integrating disparate or partially related ontologies and vocabulary sets and different thinkers, different threads of intellectual development.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1122.889,
    "end": 1151.709,
    "text": " uh these quotes from the paper can be read and of course are expanded upon in the paper but as dean said this paper's focus is on the intellectual alliance between active inference and free energy principle fep and primarily the work of cs pierce in terms of semiotics pragmatics parmaxism abductive logic that is the aim synthesis is bringing those two together in a way that's synergistic and and is providing meaning stephen",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1153.669,
    "end": 1166.438,
    "text": " Yeah, and just following on from what you're saying, both these papers, and particularly the abductive one, it gives a way to look at areas that are really hard to simulate for computers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1167.418,
    "end": 1173.763,
    "text": "And the way that abduction happens, particularly with humans, is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1174.841,
    "end": 1196.857,
    "text": " very sophisticated and i think it's really helpful to then see semiotics which is actually used a lot in theater sonography and set design um pragmatism so brought into this with it with it with a really um a theory that's you know transcends science often right is often used in other fields like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1197.637,
    "end": 1220.269,
    "text": " the the natural sciences has some use for it but it's often used in the humanities so i think this is speaking to that piece about what is it that is revealed that kind of secret source that kind of hidden soul which is normally missing and in action is also something that's like that awesome claims of the paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1221.44,
    "end": 1245.579,
    "text": " are throughout the paper but just to highlight some of the key claims they're claiming that that aim that they set out to make between the work of active inference and the abduction and semiotic perspective appears they're claiming that that is feasible and that they're providing an initial sketch for it in this theoretical theoretical integration of the new and the old",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1246.638,
    "end": 1249.48,
    "text": " something red, something blue, something new, something old.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1250.38,
    "end": 1260.707,
    "text": "And the two frameworks, the new and the old respectively are the modern instantiations of neuroscience and cognitive science represented by a free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1261.367,
    "end": 1272.334,
    "text": "And on the old, a historically accurate and precise interpretation of abductive inference, including the importance of the economy of research, all things that we're gonna come back to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1272.934,
    "end": 1274.255,
    "text": "Just wanted to clarify the claims there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1274.929,
    "end": 1277.25,
    "text": " Can I just add one thing real quick?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1277.65,
    "end": 1286.775,
    "text": "So theoretical integration there, I mean, from what, if you can think back to when we were talking about our aims, now the question is, this is what the authors are saying.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1287.435,
    "end": 1294.819,
    "text": "What we're wondering is, does that make active inference both the integration product and the integrator, the process?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1295.98,
    "end": 1302.163,
    "text": "And again, I want to kind of tease back that one step because I think that's going to happen again when we look at the other paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1303.052,
    "end": 1306.737,
    "text": " They'll use different nomenclature, but they're going to say the same thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1306.777,
    "end": 1312.664,
    "text": "And again, it's hard to see the commonalities unless you, and you don't have to make them up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1313.485,
    "end": 1318.872,
    "text": "You just have to notice them in the two different types of forests.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1320.353,
    "end": 1321.495,
    "text": "And a point on that there,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1322.725,
    "end": 1326.786,
    "text": " both in a way using active inference as an integrator, as well as as a differentiator.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1327.226,
    "end": 1333.728,
    "text": "We're making an integrated model of internal and external and blanket states by differentiating them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1333.888,
    "end": 1343.031,
    "text": "And then of course, integration and differentiation also have a joint usage in mathematics with integral and the derivative notation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1343.171,
    "end": 1345.212,
    "text": "So there's going to be a lot of things coming together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1347.153,
    "end": 1347.853,
    "text": " Steven, is your hand still up?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1348.053,
    "end": 1348.474,
    "text": "Yes, please.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1348.714,
    "end": 1350.514,
    "text": "Yeah, just one thing as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1350.534,
    "end": 1371.943,
    "text": "I think this is really helpful to talk about neuroscience in this computational neuroscience and to highlight that because I think something that is the reality in the world out there, the culture out there where these ideas are circulating is that neuroscience is turned on its head basically by active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1372.623,
    "end": 1375.925,
    "text": "Neuroscience is a field as people understand it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1377.014,
    "end": 1389.595,
    "text": " is some sort of deductive process of stuff coming in and then being evaluated and concretized as opposed to this predictive journey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1389.635,
    "end": 1391.117,
    "text": "So I think it's really, really useful",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1392.233,
    "end": 1394.455,
    "text": " because this is something that we all face.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1394.475,
    "end": 1414.148,
    "text": "And I think what I also have noted when I've spoken to some neuroscientists is they've actually had an existential crisis and shifted, partly often by coming up with inactive claims and seeing that really if inactive claims are there, how can their work with neuroscience be held together?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1415.629,
    "end": 1440.252,
    "text": " there's this there's there's a piece here that relates to the general and and that that general piece is is more important when we start to bring um active influence out from the specialist areas where it's kind of enclaved and its rules of the game are known and you're into the areas where people say neuroscience well i know what that means and off you go so thanks great thank you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1441.803,
    "end": 1444.124,
    "text": " The paper has relatively few sections.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1444.904,
    "end": 1445.924,
    "text": "It has an introduction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1446.644,
    "end": 1462.309,
    "text": "It then presents a pairing of active inference in the light of abduction, abduction in the light of active inference, slightly oblique reference to nothing in biology makes sense except in the light of evolution or except in the light of something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1463.01,
    "end": 1464.05,
    "text": "And these are two lights.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1465.19,
    "end": 1466.271,
    "text": "Back to that islands.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1466.911,
    "end": 1467.891,
    "text": "What is the space between?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1468.951,
    "end": 1470.352,
    "text": "And then there's a discussion",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1471.983,
    "end": 1478.746,
    "text": " on the economy of research and its free energy naturalization and the conclusion and the Pierce rabbit holes run deep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1478.866,
    "end": 1480.427,
    "text": "We're gonna go into a few soon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1481.748,
    "end": 1483.489,
    "text": "On to the inactive paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1484.449,
    "end": 1491.793,
    "text": "So here we're gonna be describing the aims, claims and roadmap of the inactive dynamic social cognition and active inference paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1493.514,
    "end": 1497.676,
    "text": "The paper presents a twofold aim to dissect new accounts",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1498.598,
    "end": 1505.823,
    "text": " that blend inactivism with inferential accounts and explain why doing so involves contradiction is the first aim.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1506.564,
    "end": 1515.71,
    "text": "And the second aim is to offer the only reasonable account linking inactivism and inferential accounts, especially on this case of social cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1516.551,
    "end": 1516.891,
    "text": "Daniel?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1517.432,
    "end": 1517.872,
    "text": "Yes, please.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1518.452,
    "end": 1519.673,
    "text": "Oh, guess what I was hoping.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1520.033,
    "end": 1523.096,
    "text": "Could you now turn the word linking purple for us?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1526.218,
    "end": 1526.478,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1527.299,
    "end": 1527.639,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1529.778,
    "end": 1530.018,
    "text": " Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1530.839,
    "end": 1541.488,
    "text": "Now all of a sudden we have different ways of describing the between that Stephen did a lovely job of emphasizing before we actually started looking at the papers themselves.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1543.31,
    "end": 1543.69,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1543.77,
    "end": 1544.511,
    "text": "It's the between.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1544.611,
    "end": 1544.811,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1545.332,
    "end": 1545.492,
    "text": "Go ahead.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1545.512,
    "end": 1545.992,
    "text": "It's awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1546.473,
    "end": 1554.72,
    "text": "And it is actually through your request and the Slides platform, it becomes inactive, dynamic, social, stigmatic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1556.001,
    "end": 1556.341,
    "text": "And so...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1557.455,
    "end": 1558.618,
    "text": " That's a proof of concept for what?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1559.359,
    "end": 1560.662,
    "text": "But this is the aims of this paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1562.326,
    "end": 1567.256,
    "text": "They also have many claims articulated throughout the discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1568.334,
    "end": 1579.938,
    "text": " And they actually use some very clear notation to describe the specific claims from other work and from their own work and about which claims and hypotheses have which logical relationship.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1581.698,
    "end": 1586.7,
    "text": "They're going to make claims about the nature of cognition and its embodied basis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1587.6,
    "end": 1592.822,
    "text": "They're going to be discussing some of the claims related to the human social cognitive niche.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1593.894,
    "end": 1615.293,
    "text": " and talking about the importance of relationship, enculturation, niche construction, and then they're going to be talking about theory of mind and about the compatibility or contradictions associated with linking inactive claims with theory of mind or inferential accounts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1617.014,
    "end": 1617.495,
    "text": "The papers",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1618.735,
    "end": 1622.519,
    "text": " Roadmap lays out many of these aims and claims quite clearly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1623.219,
    "end": 1633.549,
    "text": "They begin with an introduction and introduce a recent, though influential, work in the active inference field, which is the Thinking Through Other Minds framework, TTOM.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1634.47,
    "end": 1643.958,
    "text": "And they, as they say, dissect this account to try to tease apart the way that, in their view, the inactive and the inferential accounts were brought together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1644.679,
    "end": 1650.461,
    "text": " They also have a figure describing a Markov blanket, which is going to be a concept that plays Keeley in both of their papers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1651.482,
    "end": 1652.842,
    "text": "Section two, something's got to give.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1653.483,
    "end": 1656.004,
    "text": "Rejecting inactive inference through other minds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1656.971,
    "end": 1670.737,
    "text": " They're going to utilize two assumptions, namely that social cognition reduces to mental representation, and two, that social cognition is hardwired from birth, and they're going to disagree with both of these assumptions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1670.998,
    "end": 1679.001,
    "text": "And in their opposition to these assumptions, supported by subclaims and evidence, that is going to lead them to their broader conclusions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1680.042,
    "end": 1682.083,
    "text": "They're going to use dynamical systems theory",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1683.314,
    "end": 1693.781,
    "text": " and talk about how DST can be linked with inactivism in terms of its compatibility and what these two frameworks offer each other within an instrumentalist reading.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1694.641,
    "end": 1702.867,
    "text": "And then they're going to discuss active inference specifically in the context of dynamical systems theory on one hand and inactive",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1703.868,
    "end": 1708.811,
    "text": " cognition, social cognition, on the other hand, that's the inactive dynamic hyphenation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1709.791,
    "end": 1718.315,
    "text": "They'll describe with a few figures about similarities and differences between social and action generally as conceptualized outside of active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1718.415,
    "end": 1722.718,
    "text": "And then they're going to introduce visually how active inference enriches that picture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1723.438,
    "end": 1731.202,
    "text": "And then they have a very interesting table distinguishing between or amongst phenomena observed in the natural world and observed behavior in the natural world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1732.6,
    "end": 1758.35,
    "text": " okay awesome to run through the papers that way now let us move to the background and context section so in this section of the dot zero we're going to use some quotes from the paper for sure but we're also going to pull a step back and demonstrate just the tip of the iceberg of the scholarship and the research that we carried out leading up to this point hopefully to excite",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1759.17,
    "end": 1768.272,
    "text": " the listener or reader, and to provide some context into these very deep threads that are going to be approached and approximated in the papers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1770.273,
    "end": 1772.634,
    "text": "I'll provide a first note here, or Dean, please go for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1773.494,
    "end": 1779.736,
    "text": "Just because I think this is a spectacular moment to say, okay, so background and context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1779.756,
    "end": 1784.217,
    "text": "So we're talking maybe the temporal and physical setting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1785.017,
    "end": 1788.338,
    "text": "So that's now something that we can situationally analyze.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1788.973,
    "end": 1797.198,
    "text": " And again, it doesn't matter whether you use active inference or whether you use a CAS model or whether you use professional initiatives programming.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1797.498,
    "end": 1805.403,
    "text": "Bottom line is everybody is trying to figure out what the situation is through an analysis method.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1805.423,
    "end": 1818.531,
    "text": "And I would imagine that every one of those methods has a greater or lesser viability depending upon what the situation both temporally and physically is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1819.13,
    "end": 1826.174,
    "text": " So I think that's the critical thing, is we're not saying that each of these papers are good or bad.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1826.714,
    "end": 1835.099,
    "text": "We're saying that each of these papers has a focus on a different background context combination, minimum of two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1835.599,
    "end": 1846.945,
    "text": "So now if we pull the two things together, we can't say that it's going to be the same thing that we're going to come up with, that our aims as people who have now looked at the two papers",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1847.412,
    "end": 1869.455,
    "text": " side by each that's going to create a whole new entity thank you to lead off this background and contextualizing section i wanted to invoke one of my favorite artists and poets william blake and blake wrote contraries are positives a negation is not a contrary",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1870.603,
    "end": 1872.224,
    "text": " Negations are not contraries.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1872.664,
    "end": 1874.484,
    "text": "Contraries mutually exist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1875.304,
    "end": 1876.685,
    "text": "But negations exist not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1877.445,
    "end": 1880.186,
    "text": "Exceptions and objections and unbeliefs exist not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1880.506,
    "end": 1883.007,
    "text": "Nor shall they ever be organized forever and ever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1883.027,
    "end": 1885.528,
    "text": "End quote.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1887.828,
    "end": 1892.15,
    "text": "Contraries in this Blake-ian fourfold logical framework...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1893.112,
    "end": 1904.358,
    "text": " in fact, are part of a dialectic and they exist as a function of each other, like convex and concave, or like gravity and radiation, as Buckminster Fuller might take it towards.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1905.658,
    "end": 1911.922,
    "text": "And so negations in this poetical framework are those which exist not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1912.915,
    "end": 1918.876,
    "text": " whereas A and B can be on the contrary, whereas A and not A have a different logical relationship.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1919.376,
    "end": 1934.879,
    "text": "And this kind of fourfold logical approach to recognizing the state space and the truth claims that multiple juxtaposed assertions can have amongst each other is also foresaged in a lot of world knowledge traditions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1936.36,
    "end": 1937.62,
    "text": "For example, the Kataskoti,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1938.755,
    "end": 1947.74,
    "text": " And this is a logical tool and method that's been applied for a very long time in the dharmic traditions of the Indian context.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1949.841,
    "end": 1963.728,
    "text": "Wanted to provide that and also with these images, which either of you are welcome to explore, what does one hand clapping or a person doing the splits have to do with contradiction and negation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1966.826,
    "end": 1967.306,
    "text": " Yes, steam.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1967.767,
    "end": 1968.227,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1969.929,
    "end": 1971.61,
    "text": "Regarding contradiction as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1971.65,
    "end": 1977.134,
    "text": "And I think this points to the kind of the contextual piece.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1978.956,
    "end": 1987.422,
    "text": "The situational analysis piece is there's there's the situation inside which",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1990.313,
    "end": 1992.934,
    "text": " the contradictions are constructed, if that makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1993.915,
    "end": 1997.217,
    "text": "And that's also embodied and enacted through our life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1997.557,
    "end": 2016.308,
    "text": "So it might well be, as a baby, the morphology of the child at different stages, in different contexts, gives the ways to establish situational awareness and the contradictions within that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2017.373,
    "end": 2032.35,
    "text": " as things become codified so you've got these these these situational um processes are kind of um are what we're doing in this ongoing modeling flow the kind of the fields of practice",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2033.266,
    "end": 2040.771,
    "text": " in these different papers that underpin them, the inactivist fields of practice or the more computational fields of practice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2040.792,
    "end": 2044.654,
    "text": "They're what we kind of embody and we get into and we learn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2045.195,
    "end": 2048.257,
    "text": "And that's what we're kind of intuitively modeling in a way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2048.297,
    "end": 2053.04,
    "text": "We get a feel for how we should model being in these situations, the contradictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2053.581,
    "end": 2061.667,
    "text": "But that modeling often, and this is the danger, where it gets overpowered by someone with their model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2063.046,
    "end": 2082.106,
    "text": " i.e someone's in their world modeling what it's like to be themselves or trying to process it they go and see a counselor with their model and that model is being used to fit them to the model and then that counselor will tell us what their problem is how it's framed so i think this model model in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2083.218,
    "end": 2109.618,
    "text": " um is um quite relevant here because you know once these contradictions are established it might well be that there's a model created within that domain and then someone who's not necessarily in that domain can be ascribed to the model they don't know what the game is they're not in the process and the model takes over so that sort of switches over to the splits because then okay we've got two things there together",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2110.455,
    "end": 2134.06,
    "text": " we were talking about this yesterday you open up and you've got a stance okay so i'm slightly and at some point it's like that's not a stance brother that's that's a split you've gone into there you're going to have to be careful right so you you've gone into this idea that you're opening things up now were they one thing to start with were they a stance that they were held in some ways have they split in a in in a way where they're now",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2135.2,
    "end": 2163.461,
    "text": " isolated from each other you know and i suppose we're trying to hopefully find a way to neither push them to one neither have them split maybe have a stance in between that is um somehow agile and uh relates in this case to realism instrumentalism but kind of echoes some broader broader themes thank you dean just real quick um a lot of people have heard the yogi yogi vera ism of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2164.056,
    "end": 2166.317,
    "text": " when you see a fork in the road, take it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2166.797,
    "end": 2174.559,
    "text": "And I know that with the term joint has come up a lot, joint probability, for example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2174.619,
    "end": 2190.443,
    "text": "And so the idea of split here is a really good one, metaphorically speaking, because if you are looking at something with active inference and you are assuming that in a T maze experiment, you have to go left or right, well, human beings,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2191.072,
    "end": 2193.172,
    "text": " can see a fork in the road and take it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2193.433,
    "end": 2195.213,
    "text": "That's kind of the standing joke.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2196.193,
    "end": 2198.534,
    "text": "If you see a fork in my legs, take them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2199.254,
    "end": 2205.075,
    "text": "Don't necessarily, you have to choose A or B. You can take the whole thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2205.495,
    "end": 2209.876,
    "text": "And I think that's what Blake is trying to point at with this exercise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2209.936,
    "end": 2211.756,
    "text": "And so is that a contradiction?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2211.816,
    "end": 2212.036,
    "text": "No.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2212.457,
    "end": 2214.517,
    "text": "If I see utensil on the road, I can take it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2214.577,
    "end": 2219.138,
    "text": "But if I'm not open to the idea that fork doesn't only mean",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2219.952,
    "end": 2243.494,
    "text": " left or right then i'm already self-limited in terms of what i am testing what i'm situationally analyzing thank you both all right into the more direct keyword pieces so in action from this definitions.net site an action is one of the possible ways of organizing knowledge and the forms of interaction with the world",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2244.488,
    "end": 2252.931,
    "text": " Inactive knowledge is knowledge that comes through action and is constructed on motor skills, such as manipulating objects, riding a bicycle, or playing a sport.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2253.431,
    "end": 2256.352,
    "text": "That's just one of many definitions that have been provided.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2257.013,
    "end": 2262.655,
    "text": "We've also had several live streams and paper discussions on inaction in active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2263.971,
    "end": 2273.277,
    "text": " For example, in Act-Inf Livestream number six, way back when in 2020, we discussed Ramsted et al., A Tale of Two Densities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2273.818,
    "end": 2276.059,
    "text": "Active inference is an active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2278.201,
    "end": 2285.946,
    "text": "In 2021, we discussed a paper also of Hippolyto et al., Embodied Skillful Performance, Where the Action Is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2286.807,
    "end": 2292.771,
    "text": "And interestingly, for saging in some ways, this very discussion, here's a slide from...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2295.481,
    "end": 2322.436,
    "text": " that live stream um with uh of the hippolyto paper and here we had the piercean uh triad and we had the symbolism and this the semiotics and the references to frege so we actually were talking about the very related concept of representation and indeed those who support and or reject and or find contradiction and linkage all of the above",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2323.527,
    "end": 2336.882,
    "text": " The discussion around inactivism and the inferential account is going to hinge very much on the question of representation and cognitive representations, what those are, where or if they exist, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2338.564,
    "end": 2339.185,
    "text": "That was Livestream 23.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2340.666,
    "end": 2354.181,
    "text": " Also from this paper of Sangati et al, they lay out just visually, we're going to see more representations soon, in their view, some of the distinctions between traditional social cognition and inactive social cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2354.861,
    "end": 2359.066,
    "text": "And so rather than just a visual interpretation of the image meme, Dean, would you like to provide it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2360.737,
    "end": 2363.799,
    "text": " No, I'll wait till you're done.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2363.939,
    "end": 2370.784,
    "text": "Here what I see is that in the traditional social cognitive inferential accounts, the gears are turning inside the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2372.025,
    "end": 2378.43,
    "text": "And then there's perception action loops and linkages that connect social entities that are in their body.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2378.47,
    "end": 2382.413,
    "text": "But the body is seen as like an interface for that kind of information transfer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2383.721,
    "end": 2406.377,
    "text": " one extreme stance or simple visual representation and then here in contrast we see like the gears are everywhere including in the environment in the niche in the space between and that yes the brain is doing things but also it's part of an enacted system that is implementing this encultured social cognitive process a little bit more in a holistic framing so dean yes",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2407.318,
    "end": 2411.901,
    "text": " Yeah, I was just going to say, in a minute, we're going to look at what the abduction thing talks about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2411.921,
    "end": 2422.787,
    "text": "But for now, I would like people just to sort of hold in their mind the idea that this is speaking to a type of temporal depth, but that temporal depth is vertical.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2423.888,
    "end": 2429.291,
    "text": "I think abduction looking at longer timelines or for hundreds of years is more horizontal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2429.371,
    "end": 2435.054,
    "text": "So just keep in mind that we're talking temporal depth, but the focus is on a vertical or a deep",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2435.595,
    "end": 2439.717,
    "text": " temporal depth instead of a wide lateral temporal depth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2440.677,
    "end": 2443.538,
    "text": "They both matter, but they're orthogonal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2444.559,
    "end": 2447.46,
    "text": "Doesn't mean that they're in conflict with one another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2447.86,
    "end": 2450.461,
    "text": "It just means they're going in different directions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2451.062,
    "end": 2452.022,
    "text": "That's all I want to say about that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2453.348,
    "end": 2459.915,
    "text": " It's funny, left and right or west and east, those are contrary directions, but they're not negatory directions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2459.995,
    "end": 2473.048,
    "text": "And so right there is where we start to see like how orthogonality or sparsity or conditional independence granted by a Markov blanket, for example, how those can be seen in the framework of contraries, though not negations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2473.349,
    "end": 2473.589,
    "text": "Stephen?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2475.413,
    "end": 2502.844,
    "text": " and that gear in the in the right hand diagram there the gear in between you know that can have temple depth that can have this mind body environment piece is definitely there like you're saying and obviously makes as a unit of analysis that's really challenging and i would also put in there as a gear words words are twitch twitching of our voice box is giving us words in space around us",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2503.775,
    "end": 2506.898,
    "text": " So, you know, they're being used as tools as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2507.038,
    "end": 2511.703,
    "text": "So suddenly we're much more enmeshed, even if it's just speech.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2513.604,
    "end": 2513.785,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2514.325,
    "end": 2518.229,
    "text": "And it takes time for the speech to travel through the internet and through space and time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2519.65,
    "end": 2522.052,
    "text": "A little bit more depth on social inaction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2523.061,
    "end": 2532.887,
    "text": " This inaction research resource describes several meanings and senses of inaction in the performative, in the bringing forth senses, so please read.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2533.827,
    "end": 2539.411,
    "text": "And also a really nice 2009 paper in cognitive semiotics by de Bruyn and de Haan.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2540.211,
    "end": 2544.574,
    "text": " discuss some of the relationships of inactivism and social cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2545.355,
    "end": 2556.103,
    "text": "And they did an excellent job of summarizing what the inferential and the inactivist accounts can bring together and sort of discuss that linkage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2556.123,
    "end": 2556.763,
    "text": "Yes, please, Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2557.564,
    "end": 2560.546,
    "text": "Yeah, I read that paper because I found it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2560.686,
    "end": 2562.087,
    "text": "And here's an interesting thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2562.547,
    "end": 2567.051,
    "text": "If they're going to use a bridge metaphor, I think inactivism does have a bridge.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2567.151,
    "end": 2568.492,
    "text": "It's just a vertical bridge.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2569.318,
    "end": 2571.139,
    "text": " It's the side of the building going up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2572.0,
    "end": 2581.447,
    "text": "And so not to criticize what they've written here, but I think there is a gap and there is an ability to span.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2581.768,
    "end": 2584.109,
    "text": "It's just that it's going vertical.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2584.45,
    "end": 2587.192,
    "text": "It's not going traditionally side to side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2588.953,
    "end": 2589.253,
    "text": "Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2589.874,
    "end": 2594.337,
    "text": "So on to a little bit of depth into abduction and semiotics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2595.658,
    "end": 2595.798,
    "text": "Well,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2596.69,
    "end": 2612.175,
    "text": " We had quite the learning journey together and the abduction paper with one or one and a half or even two of the authors being true Pearson experts provided many details.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2612.835,
    "end": 2615.936,
    "text": "Pierce was a prolific writer and thinker and collaborator.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2616.577,
    "end": 2623.139,
    "text": "And also much of the work was unpublished, which means that there's some arcane reference systems and not all of it is hyper accessible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2624.119,
    "end": 2631.822,
    "text": " We found the commons.org site to be immensely useful in providing many definitions as well as links to resources.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2632.323,
    "end": 2634.644,
    "text": "Dean, would you like to summarize anything on this page?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2636.004,
    "end": 2649.43,
    "text": "Nothing other than if you are interested in pragmatism and you want to get past William James, actually William James and Charles Saunders Pierce had a bit of a, they were maybe 150 years ago the first",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2652.028,
    "end": 2655.131,
    "text": " conflictors around how things work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2656.352,
    "end": 2665.199,
    "text": "It's actually really, it's an amazing takeoff point in terms of how people who appear to be in competition with one another actually make one another smarter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2665.7,
    "end": 2672.906,
    "text": "But in fact, a lot of the things, a lot of the ideas that we 150 years later are now looking back on, we would have to say,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2673.373,
    "end": 2686.166,
    "text": " They may have felt they were in competition with one another, but I think what they were doing was relaying or somehow building a better model because they weren't always looking at things as through the same eyes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2686.186,
    "end": 2687.427,
    "text": "They had both eyes open.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2687.828,
    "end": 2689.369,
    "text": "So that's all I'll just say.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2689.409,
    "end": 2690.41,
    "text": "Go to the common site.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2690.45,
    "end": 2691.331,
    "text": "It's really good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2691.932,
    "end": 2692.773,
    "text": "Yeah, it's great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2693.153,
    "end": 2694.415,
    "text": "This representation...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2696.337,
    "end": 2710.606,
    "text": " ironically slash appropriately, is of the well-known Pearson triad semiotic framework where a stop sign is called the representamen, the represented instance, the physical stop sign, the real stop sign.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2711.507,
    "end": 2714.829,
    "text": "The object is the message cars must stop here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2715.169,
    "end": 2717.931,
    "text": "And the interpretant is I should stop here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2718.031,
    "end": 2720.113,
    "text": "And that's where we get that entity agency.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2720.813,
    "end": 2723.395,
    "text": "I found an interesting paper recently",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2723.875,
    "end": 2752.269,
    "text": " about the user interface which brings some of these truly timeless discussions on semiotics and logic into a digital context they're applying that semiosis to the user interface metaphor one could imagine if that were a stop sign in the real world or if it were a button on a website in a user interface context and anyone may pause and read some of these very excellent selections from quotes and uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2753.149,
    "end": 2776.915,
    "text": " lectures given on how copies signs and symbols are linked through logic and semiosis lot here but we'll carry on to abduction specifically so this was a little bit on pierce and the definition of semiotics as opposed to the science of things the more positive sciences and the science of forms which are the more formal sciences",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2778.703,
    "end": 2780.604,
    "text": " What is abductive reasoning?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2781.404,
    "end": 2783.185,
    "text": "This was very fascinating to explore.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2783.645,
    "end": 2785.326,
    "text": "This is a quote from the abduction paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2785.906,
    "end": 2789.108,
    "text": "They wrote, it is common in the secondary literature, e.g.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2789.208,
    "end": 2798.832,
    "text": "that building on Pierce, to conceive abduction as occurring in two parts or two kinds, generative abduction and selective abduction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2800.043,
    "end": 2809.589,
    "text": " Here's another perspective on the two types or the two varietals or two components, two-stroke engine of abduction from the Stanford Encyclopedia of Philosophy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2810.509,
    "end": 2815.953,
    "text": "They wrote, in the philosophical literature, the term abduction is used in two related but different senses.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2816.853,
    "end": 2819.495,
    "text": "In both senses, the term refers to explanatory reasoning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2820.603,
    "end": 2829.691,
    "text": " In the historically first sense, it refers to the place of explanatory reasoning in generating hypotheses, that's generative abduction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2830.452,
    "end": 2842.904,
    "text": "While in the second sense, which is the sense which it is used most frequently in the modern literature, it refers to the place of explanatory reasoning in justifying or evaluating an enumerated set of hypotheses.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2843.644,
    "end": 2845.226,
    "text": "And in a sense, it makes sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2847.233,
    "end": 2850.075,
    "text": " The content has to be generated to be curated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2850.555,
    "end": 2856.939,
    "text": "The ideas have to be specified, enumerated in order to be justified or evaluated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2859.401,
    "end": 2860.901,
    "text": "Dean, please continue on this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2861.902,
    "end": 2863.643,
    "text": "Well, just real quickly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2863.923,
    "end": 2869.547,
    "text": "So we now have red and blue, which was really, really important to highlight that you need both.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2870.007,
    "end": 2874.41,
    "text": "You need a minimum of two for the explanation to appear.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2875.613,
    "end": 2885.962,
    "text": " Next, abductive reasoning in the probabilistic sense is also known as inference to the best explanation, is a form of logical reasoning that looks to the most likely hypothesis to explain something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2886.062,
    "end": 2891.806,
    "text": "An example, did the white beans in the left hand come from the bag of objects held in the right hand?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2892.207,
    "end": 2898.592,
    "text": "Here we can see how the hypothesis put forward depends on an incomplete observation or an inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2899.252,
    "end": 2900.733,
    "text": "Are there beans also in the bag?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2900.773,
    "end": 2903.996,
    "text": "And even if so, is that the source for what has been",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2904.403,
    "end": 2905.884,
    "text": " transferred to the left hand.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2906.385,
    "end": 2929.322,
    "text": "So again, temporal depth, when you arrive into a situation, what kind of background and what kind of context do you possess is going to go to this fourth form of logic that Purse literally spent a lifetime trying to disentangle and then reform into some sort of coherence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2931.152,
    "end": 2953.434,
    "text": " And those listening along may start to see inklings of priors, sensory observations, posterior updating of beliefs about the world, even action selection coming into play, especially translation of the affordances, instantaneous action availabilities into policies, which can be evaluated by their expected free energy, but we're going to get there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2954.411,
    "end": 2956.433,
    "text": " Let's turn to abduction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2956.733,
    "end": 2962.478,
    "text": "And here are some of the very fascinating papers available on Commons related to abduction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2962.859,
    "end": 2963.519,
    "text": "Lot there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2964.22,
    "end": 2973.068,
    "text": "And to kind of continue on with one of the resources from Commons on Abduction as Practical Inference by Thomas Capitan.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2975.31,
    "end": 2996.641,
    "text": " This work, which we're not going to read everything about, goes into a lot of interesting points about that dual nature of abduction with hypothesis generating and hypothesis selection and distinguishes that hypothesis selection can make deductively valid evaluations",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2997.594,
    "end": 3000.677,
    "text": " However, the creativity phase is non-inferential.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3000.777,
    "end": 3012.446,
    "text": "That has a lot of resonance with like not pre-censoring ideas and having like an inclusive discussion when brainstorming and recognizing that there has to be a winnowing in a finite period of space and time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3015.009,
    "end": 3017.19,
    "text": "Additionally, there's some discussion here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3018.411,
    "end": 3023.756,
    "text": "This was relating as we move back towards or interweave with free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3025.529,
    "end": 3037.799,
    "text": " Initial awareness of the hypothesis comes with the observation of a colligated whole by means of an uncontrolled insight into the world of ideas, into what he called thirdness as given in perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3040.541,
    "end": 3052.55,
    "text": "The novel conceiving of any instance of premise two, citing a previous part of the paper, is caused by prior cognitions, hashtag priors, its content is suggested by the facts,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3053.613,
    "end": 3067.296,
    "text": " observations sensory observations but not everything suggested is inferred from the cognition of the facts and so pierce goes on to describe there are operations of the mind which are logically exactly analogous to inferences",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3068.874,
    "end": 3091.18,
    "text": " accepting only that they are unconscious and therefore uncontrollable and therefore not subject to criticism so leaving aside questions like whether unconscious processes can be considered controllable here we very much see hints of perception as unconscious inference and we see also continuity between processes of attention and awareness conscious inferences",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3092.02,
    "end": 3120.212,
    "text": " and other subconscious inferences and so in a way this is also providing an integrated framework of perception learning belief updating temporal depth conscious and unconscious awareness all these features are explored in the persian work and the abduction paper is going to very specifically highlight that fact okay carrying on a little bit more uh abduction and retroduction",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3121.254,
    "end": 3122.714,
    "text": " Would you like to add anything on this one, Dean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3125.255,
    "end": 3140.799,
    "text": "Well, I mean, people that study and analyze this wonder at times whether or not this was a morphology or whether or not we can use the two terms simultaneously or interchangeably.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3142.344,
    "end": 3157.032,
    "text": " Again, it's probably one of those things where if you want to find out what the details are, you should probably go and have a look because it's interesting, but it doesn't... At this point, all we basically want to do is... Here, I'll just read this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3158.052,
    "end": 3165.836,
    "text": "Retroduction of the process whereby from a surprising array of facts we are led to a conjectural... We've used conjectural theory to account for them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3166.276,
    "end": 3169.418,
    "text": "Many logicians refuse to call this last inference...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3170.182,
    "end": 3176.023,
    "text": " because its conclusion is so extremely problematical as to amount to little more than an interrogation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3176.763,
    "end": 3178.084,
    "text": "I'm sure they are wrong, however.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3178.144,
    "end": 3183.065,
    "text": "They have not possessed themselves of the true scientific definition of inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3183.085,
    "end": 3190.286,
    "text": "So what he's basically saying here is, let's not call abductive reasoning inductive reasoning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3193.476,
    "end": 3205.625,
    "text": " The logical justification of a retroduction of which the proper conclusion is that the conjectured state of things is likely in the vague sense of tending to resemble the real state of things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3205.806,
    "end": 3209.348,
    "text": "And I, this is the part where, so what replaces that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3209.628,
    "end": 3210.489,
    "text": "Instrumentalism?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3211.49,
    "end": 3214.352,
    "text": "Whatever we define as instrumentalism?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3215.253,
    "end": 3218.635,
    "text": "This is again, this is one of those conundrums.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3219.056,
    "end": 3223.139,
    "text": "If it's not, if it's not real",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3223.783,
    "end": 3238.489,
    "text": " state is it what isn't then what is an unreal or a non-real state because it's there we've labeled it what what fills that what fills that eventually to make the whole that's the question here",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3240.151,
    "end": 3246.272,
    "text": " And also, again, worthwhile reading some of the prior work of one of the authors of the abduction paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3246.492,
    "end": 3253.214,
    "text": "And one can see in their research a strong line of developing and extending and modernizing a lot of the work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3255.874,
    "end": 3259.855,
    "text": "So I put down those bear signs because I want to tell a really, really, really quick story.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3260.855,
    "end": 3265.796,
    "text": "So if you live somewhere where there are bears, if the bear sign stays up,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3266.769,
    "end": 3273.492,
    "text": " people begin to ignore the actual sign, object, and they no longer become interpreters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3273.852,
    "end": 3277.574,
    "text": "They willfully lose that triadic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3278.074,
    "end": 3294.882,
    "text": "So if you're in the business of animal welfare and you don't want the bears to become too used to human contact, you have to be very selective of when you put the sign up and most importantly, when you remove the sign.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3295.931,
    "end": 3300.875,
    "text": " So I wanted to put that up there because that's a big part of the abductive and retroduction piece.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3301.956,
    "end": 3306.439,
    "text": "You have to sometimes take things away for abduction to work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3306.5,
    "end": 3311.604,
    "text": "It's the removal of possibilities that actually creates an emphasis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3313.765,
    "end": 3319.67,
    "text": "I think we'll just carry on to realism and instrumentalism because we're going to come back to abduction in the subsequent discussions more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3319.97,
    "end": 3322.612,
    "text": "So here's some quotes from a Farabend paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3323.945,
    "end": 3338.42,
    "text": " according to realism such knowledge factual knowledge is descriptive of general or particular features of the universe so that doesn't mean that the model of gravity is gravity doesn't mean that the model of gravity is what the objects of gravity are",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3339.246,
    "end": 3357.163,
    "text": " But a realist would remark that, for example, formal models of gravity teach us of the existence of objects acted upon by the force, gravity, and license the description of a force which cannot be directly seen, heard, or felt, but still has noticeable influence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3357.743,
    "end": 3358.864,
    "text": "Forces are real.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3359.305,
    "end": 3360.086,
    "text": "Things are real.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3361.963,
    "end": 3371.45,
    "text": " According to instrumentalism, even a theory that is wholly correct does not describe anything, but serves as an instrument for the prediction of the facts that constitute its empirical content.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3372.458,
    "end": 3391.134,
    "text": " And so again, on this Newton's gravitation example, the instrumentalist could take the position there are no entities, gravitation force and gravitational fields are merely instrumental applications of statistical arguments or potentially even social or power dynamical arguments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3392.015,
    "end": 3394.757,
    "text": "And an instrumentalist may deny the existence of objects",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3395.72,
    "end": 3409.954,
    "text": " entities and forces, in this case, and even take things to the level of having skepticism around words as instruments and the relationships around communication and how it orders and predicts sense data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3410.634,
    "end": 3419.162,
    "text": "We've explored realism and instrumentalism quite a lot over the streams, and we highlighted it a lot in Mel Andrews' work in livestream number 14.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3421.303,
    "end": 3445.124,
    "text": " one more slide on realism and instrumentalism and then either of you please feel free um I'll describe some of the bottom ones again the map territory distinction is very key to the realism and instrumentalism conversation there's also been variety of excellent philosophical work for example a successor to the realism anti-realism question",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3446.567,
    "end": 3453.934,
    "text": " Those two, by the way, I would say are negations, whereas realism and instrumentalism, we are suggesting might be seen as contraries.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3454.815,
    "end": 3464.323,
    "text": "And also Helen Longano's work on scientific pluralism has a lot to say about this by taking a multidisciplinary lens on realism and instrumentalism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3465.164,
    "end": 3469.168,
    "text": "And then Dean, would you like to describe anything about this top paper you found?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3473.676,
    "end": 3476.438,
    "text": " I don't remember this in the grand scheme of things, to be honest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3476.999,
    "end": 3478.08,
    "text": "It's here for people to read.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3478.26,
    "end": 3486.226,
    "text": "There were many papers, and again, we're just putting a lot of text up for those who want to pause and follow the trails, and it all kind of gets enmeshed in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3487.106,
    "end": 3489.248,
    "text": "Stephen, any comments on realism instrumentalism?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3492.871,
    "end": 3499.176,
    "text": "I suppose the piece that comes to mind for me a lot is all of this is then underpinned",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3500.413,
    "end": 3521.377,
    "text": " within action at some level so the the the idea of looking for different contradictions or different retro approaches could be a case of you imagine when someone thinks about taking a path through the woods",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3522.532,
    "end": 3525.755,
    "text": " Or you could re-embody a lot of these things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3526.676,
    "end": 3531.06,
    "text": "And maybe everything at some level goes through some embodiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3532.021,
    "end": 3537.046,
    "text": "And when it's conceptual, that embodiment is just happening in a more conceptual space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3538.147,
    "end": 3546.554,
    "text": " that doesn't rely on as many other kind of stories or feeling your way through things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3547.174,
    "end": 3559.663,
    "text": "So the difference that happens when you're in a field of practice is that you're so used to being in that field of practice that that embodiment becomes the water that you swim in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3560.344,
    "end": 3563.386,
    "text": "So that could be something that sort of relates to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3564.947,
    "end": 3565.127,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3565.368,
    "end": 3565.748,
    "text": "Justine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3566.374,
    "end": 3566.974,
    "text": " Just real quick.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3567.315,
    "end": 3579.441,
    "text": "So again, we'll ask at this point, yes to realism, yes to instrumentalism, yes to the and, not or.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3579.461,
    "end": 3581.623,
    "text": "I'm done.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3582.723,
    "end": 3586.225,
    "text": "We had a little ampersand here and we emphasized the and here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3588.086,
    "end": 3590.268,
    "text": "One brief note on 4E cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3591.343,
    "end": 3607.35,
    "text": " We won't go into depth here, but 4E can refer to, as per the Schiavio and von der Schiff 2018 paper, which was in the context of music pedagogy, which is a very fascinating area, 4E is embodied, embedded, extended, enacted,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3609.051,
    "end": 3614.476,
    "text": " encultured, et cetera, et cetera, et cetera, 7E, 11E, 22E, all of them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3615.096,
    "end": 3621.942,
    "text": "And then a fun quote from Carl Friston from our Applied Active Inference Symposium in 2021.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3622.763,
    "end": 3625.024,
    "text": "He said, one key thing about active inference",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3625.865,
    "end": 3650.345,
    "text": " is it's it's beyond predictive processing it's beyond sentience and it emphasizes or reflects the pragmatic turn at the beginning of this century really epitomized by the four e's to make it clear that sentience is active and that you are talking about the circular causality of engagement with any particle personal or plant with whatever's out there purple circular causality and all of that entails",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3651.206,
    "end": 3663.764,
    "text": " Then quite briefly, we're not going to go into any of these details, but here's a bunch of work that's relevant for the inactive paper, just some of the other background citations and other work that one might want to look into.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3664.785,
    "end": 3666.287,
    "text": "And for the abductive paper,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3667.208,
    "end": 3690.457,
    "text": " um and also a little bit of leaning even into something hopefully the authors can unpack for us on the the role and relationship of nominalism with all of this but many previous papers by the authors here listed and a lot of great work again so thanks you fellows for this journey now we can enter into the two papers or the space between",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3694.028,
    "end": 3696.909,
    "text": " Let's have an initial juxtaposition of the two papers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3697.389,
    "end": 3700.071,
    "text": "I'll put our video will be the tip of the iceberg here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3700.271,
    "end": 3701.731,
    "text": "So Dean, you're the tip of the iceberg.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3702.272,
    "end": 3706.193,
    "text": "What would you like to say about these two papers in an initial juxtaposition?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3709.175,
    "end": 3719.419,
    "text": "Well, as I said, I think if you actually step back and realize that what people are doing by, by pairing to active inference, you are saying,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3720.476,
    "end": 3726.421,
    "text": " I have a particular kind of situational analysis that I would like to perform.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3726.922,
    "end": 3733.827,
    "text": "And in doing so, I would like to try to remove contradictions or I would like to formulate integrations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3734.788,
    "end": 3741.334,
    "text": "And if you step back to that place, your example of... So you're hyper...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3746.006,
    "end": 3768.511,
    "text": " your subject is situational analysis, your example fitting under that, you're not now making the mistake of saying, my way of looking at things automatically negates or turns other ways of looking at everything that's under that title of situational analysis to dust.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3768.831,
    "end": 3768.971,
    "text": "Now,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3769.887,
    "end": 3773.509,
    "text": " There are comparisons and they're not written here and they're so ready long.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3773.569,
    "end": 3797.659,
    "text": "I just basically chose examples within each of the papers where papers are talking about two different focal points, but they're still within this larger marginal boundary of active inference and how active inference is behaving around the behavior within a regime of attention and opening that up",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3798.208,
    "end": 3807.596,
    "text": " to something more available than the specifics or the scale-friendly thing of, does theory of mind necessarily blend with active inference?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3807.776,
    "end": 3820.606,
    "text": "Or does the idea that abduction, the moment when I arrive, actually negate any possibility of using instruments to extend my sensory window?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3821.807,
    "end": 3823.829,
    "text": "So again, we're not going to spend a whole lot of time",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3824.761,
    "end": 3826.122,
    "text": " pulling those other things out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3826.142,
    "end": 3834.267,
    "text": "But if people want to actually see how, when you set approximately two papers beside one another, you can find a ton of similarities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3835.828,
    "end": 3837.269,
    "text": "It's kind of an interesting exercise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3837.329,
    "end": 3843.653,
    "text": "It takes a while, but when you actually see them side by each and entangled, there's a lot of braiding going on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3845.534,
    "end": 3846.335,
    "text": "Thank you, Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3846.355,
    "end": 3846.635,
    "text": "Stephen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3848.666,
    "end": 3849.586,
    "text": " Yeah, I like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3851.187,
    "end": 3853.988,
    "text": "Like what Dean was talking about there, you've got these two papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3854.048,
    "end": 3862.052,
    "text": "It could almost be seen as two icebergs where their philosophies have kind of frozen and given shape and form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3862.092,
    "end": 3864.032,
    "text": "And there is stuff underneath and stuff above.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3864.713,
    "end": 3872.256,
    "text": "But there's also the water around and between, which may have lots of shrimp and all sorts of things swimming around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3872.876,
    "end": 3877.522,
    "text": " So I think in this list here, you've kind of got realism, instrumentalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3877.542,
    "end": 3879.044,
    "text": "Well, they're your two icebergs, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3879.785,
    "end": 3885.892,
    "text": "We want them to be nice and sharp, and maybe you get knocked a bit if you bang off them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3886.393,
    "end": 3889.156,
    "text": "And then your case, statistics and model comparison.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3890.336,
    "end": 3917.503,
    "text": " you know they they they they're still out there but they they might jive a little bit multi-agent belief communication oh hold on we've got something flowing here things as assembled ensembles so it models as ensembles perspective or tight perspective or where are those perspectives coming from ways of knowing stochasticity complex systems and so forth um we're now maybe",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3918.837,
    "end": 3934.232,
    "text": " I don't know if we're not dissolving the iceberg, if that's not about that, the iceberg's there, but there are different types of ways of starting to maybe be more flexible and less stable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3936.694,
    "end": 3936.995,
    "text": "Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3937.355,
    "end": 3939.797,
    "text": "So into the inactive paper we go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3940.942,
    "end": 3952.627,
    "text": " So to keep things reasonable and also have a lot to discuss in the one and two, again, we've put a lot of content onto the slides for your pausing and enjoying.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3953.267,
    "end": 3956.609,
    "text": "Most of the content is copied and quoted from the papers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3956.709,
    "end": 3959.09,
    "text": "So that is the point of reference to learn more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3959.71,
    "end": 3966.433,
    "text": "We'll just walk through in the order of the roadmap, some of the key pieces that the papers go through.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3967.094,
    "end": 3969.995,
    "text": "So in section one of the inactive paper,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3971.189,
    "end": 3992.325,
    "text": " going to begin with a summarization of vesier et al's 2020 argument for understanding others in the world and that's presented in this thinking through other minds ttom paper and then tom is theory of mind they summarize or capture the argument of thinking through other minds as one",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3993.797,
    "end": 3996.659,
    "text": " Premise one, social cognition is inactive and embodied.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3996.92,
    "end": 4003.045,
    "text": "Two, inactive and embodied, the social actor cannot directly grasp social cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4004.466,
    "end": 4007.548,
    "text": "Three, anything that cannot be directly grasped must be inferred.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4008.509,
    "end": 4014.794,
    "text": "Ergo, QED conclusion, inactive and embodied social cognition must be inferred.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4015.235,
    "end": 4018.477,
    "text": "There must be inference about social cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4019.833,
    "end": 4028.043,
    "text": " And the authors of the inactive paper state that by premise two and three, TTOM joins the TOM orthodoxy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4029.124,
    "end": 4035.972,
    "text": "Understanding the world and others to them comes down to the ability to infer and attribute mental states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4037.062,
    "end": 4041.349,
    "text": " That is the summarization of thinking through other minds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4042.17,
    "end": 4052.126,
    "text": "And they are going to call into question on this critical dissection that such a T2M account is indeed making this happy marriage with inactivism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4054.441,
    "end": 4079.976,
    "text": " going to pull on yes any anyone or continue okay they're gonna they're gonna they're gonna pull out on a few different of these premises and what hidden assumptions might be underlying those premises like what axioms lead one to generate such premises the contradiction between p1 and p2 results from two hidden assumptions in that ttom argument so here we see p123 above",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4081.457,
    "end": 4089.765,
    "text": " And then hidden assumption one, social cognition reduces to information in explicit propositional form, mental representation and description.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4090.866,
    "end": 4095.67,
    "text": "They are going to say this, they are feeling this way as a mental representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4096.591,
    "end": 4104.538,
    "text": "And hidden assumption two, social cognition is hardwired with the concepts and logical tools for inference, for example, at birth",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4105.78,
    "end": 4124.547,
    "text": " And in the subsequent sections, they're going to analyze and clarify the contradiction between premises one and two, this tension of if social cognition is inactive and embodied, is it really the case or is it a contradictory claim that social cognition cannot be directly grasped by such a social actor?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4126.369,
    "end": 4154.165,
    "text": " then going to critically assess from the inactive perspective what problems might underlie these assumptions the hidden assumptions and why an activist reject these hidden assumptions and hence reject the premises listed above and then they're going to be exploring what are these non-representational methods and mechanisms of co-construction in social action they have a markov blanket",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4155.168,
    "end": 4168.295,
    "text": " a representation visually that we've seen here before with the internal states, external states, and the mediation of internal and external states by blanket states, which as per the Pearl 1988 definition,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4170.356,
    "end": 4192.299,
    "text": " are the blanket states making the internal and external states conditionally independent sometimes people go further and describe a friston blanket where the blanket states b are partitioned into two kinds of states sense and active and those two kinds of states are defined by their incoming from the perspective of internal states",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4193.28,
    "end": 4210.749,
    "text": " statistical dependencies sensory states and outgoing statistical dependencies which can be interpreted as actions or interfaces from the entity or thing towards the niche but we'll come back to markov blankets and more later yes steven go for it",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4211.536,
    "end": 4221.663,
    "text": " Just coming back to that, actually the page, the slide before this, but relating to this is when it says things cannot be directly, there's a couple of things that directly be grasped.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4222.163,
    "end": 4226.226,
    "text": "Well, I would argue that with that, that's a useful distinction because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4227.046,
    "end": 4255.979,
    "text": " when we think about um well we're talking about the grip and the gripper or a pair of pliers and i can't directly grip a hot pipe i need the pliers i can't directly um do a number of things without maybe more than one tool but there's a sense that when we talk about grasping things or when people are thinking about if something is you know to grasp something that is explicitly propositional",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4257.327,
    "end": 4279.697,
    "text": " know we have other kinds of tools that might be coming to play even when we think about words and the act of ascribing all of these things can be performances with tools at every level so there's a there's an interesting blending going on here depending on how the iceberg gets melted",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4281.323,
    "end": 4281.523,
    "text": " Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4282.624,
    "end": 4293.849,
    "text": "In section 2.1, which you can read in the paper or pause here and capture many aspects of it, they're going to question the assumption that social cognition reduces to mental representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4294.83,
    "end": 4304.535,
    "text": "And their point can be distilled as understanding others is a matter of being skilled at shared non-explicit meanings and potentially some abductive",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4305.674,
    "end": 4311.719,
    "text": " ding, ding, ding, and model-based reasoning, all of which are context-specific, modifiable, and dynamic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4312.56,
    "end": 4325.311,
    "text": "And they are going to unpack in the further paragraphs that in there lies an evident contradiction between those first two premises, which is really like the Achilles heel or the soft spot where they're going to be targeting their logic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4326.452,
    "end": 4333.038,
    "text": "In section 2.2, they're going to question that second of the assumptions, which is that social cognition is hardwired from birth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4333.993,
    "end": 4351.014,
    "text": " And so while they do qualify the TTOM position and they say, Vessier do not hold a nativist position, for example, like a pure inborn perspective, because they do have a focus on the developmental and ecological dynamics of how culture is acquired.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4351.815,
    "end": 4368.68,
    "text": " they do call into question the acquisition of the starter pack and they are also exploring more in this section some inactivist critiques of for example hardwired perspectives on social cognition in section three",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4369.537,
    "end": 4391.596,
    "text": " having critiqued assumptions that in their mind highlight the contradiction inherent within thinking through other minds they're going to suggest another relationship oh you don't like that dish let's try this one and this is going to be a approach from dynamical systems theory or dst they write dst",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4392.857,
    "end": 4420.047,
    "text": " as we shall argue in this section is an approach that serves to learn about and generate predictive power about the socio-culturally situated practices of agents constructing their niche because dst has at its core useful tools such as emergence non-linearity and spontaneity etc it allows us to move away from prefabricated notions of tom theory of mind like theories of social cognition",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4422.043,
    "end": 4435.635,
    "text": " One should therefore refrain from making ontological assumptions, ontological here being about how things are in the world, so more of the philosopher's ontology rather than the computer science knowledge management sense of ontology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4436.656,
    "end": 4440.94,
    "text": "One should refrain from making these kinds of ontological assumptions licensed by realism,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4442.546,
    "end": 4445.55,
    "text": " about the complex system based upon a tractable model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4446.371,
    "end": 4453.319,
    "text": "So just because the model is so tractable doesn't mean that we have the license to make ontological assumptions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4454.68,
    "end": 4460.787,
    "text": "Since the tractable model is an opportunity for learning about the complex behavior, only epistemic claims are allowed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4461.508,
    "end": 4485.627,
    "text": " let us take a closer look at the claim to make it tractable we can represent a dynamical system by a static relationship as follows and here are their equations one two and three with the captions below and they're using these very simple kind of like the kernel of the dynamical systems theory is understanding how things are a function of how they change",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4486.53,
    "end": 4494.216,
    "text": " broadly, and it's represented in a few different ways in terms of a successor model and more of a rate of change model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4495.277,
    "end": 4495.517,
    "text": "Steven.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4497.305,
    "end": 4522.334,
    "text": " i think this is a very useful point point number three there the bullet point because it also speaks to that sense of this is a modeling approach let's see what the modeling is telling us rather than a model fitting approach which is often you know what ends up happening if you have the defined ontology you know you effectively",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4524.087,
    "end": 4525.908,
    "text": " pre-assume so many things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4525.928,
    "end": 4536.956,
    "text": "So that's maybe a key piece that links a lot of how things can be bridged in terms of active inference and how it could be held between.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4537.496,
    "end": 4541.459,
    "text": "That is a stance in a way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4542.46,
    "end": 4547.924,
    "text": "It's holding the legs apart and saying, okay, am I doing the splits or have I got my legs together?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4548.749,
    "end": 4577.945,
    "text": " right so let's find out rather than you someone expert tell me um and yeah thanks thank you dean yes yeah i just want to add to what stephen was just saying i up to this point i really and i love the paper the it's the constructivist piece though that i think has me pausing for a minute because i believe that in order for",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4579.19,
    "end": 4582.072,
    "text": " us to be able to make that decision.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4582.672,
    "end": 4583.593,
    "text": "Is it the splits?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4584.173,
    "end": 4585.093,
    "text": "Or is it a fork?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4585.313,
    "end": 4589.016,
    "text": "Is it literally a fork and split instead of having go left to right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4589.436,
    "end": 4595.879,
    "text": "That requires a deconstruction that I think is oftentimes left out prior to a reconstruction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4596.92,
    "end": 4600.582,
    "text": "So again, I'm not arguing with the author, because I think they're respecting the autonomy",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4601.681,
    "end": 4612.445,
    "text": " And I think they've done a brilliant job of saying, okay, this logic, this deductive path that other authors have taken may not necessarily apply here because it causes too much blending.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4612.905,
    "end": 4614.266,
    "text": "So good, good, good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4615.186,
    "end": 4619.888,
    "text": "You're holding up what actually is left and right, but you're leaving out the and.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4620.548,
    "end": 4623.969,
    "text": "The and part is it could be a fork that I could literally pick up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4624.329,
    "end": 4629.111,
    "text": "And the only way you can see that is if you can deconstruct before you reconstruct.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4629.151,
    "end": 4630.972,
    "text": "And deconstruct doesn't mean differentiate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4631.294,
    "end": 4632.395,
    "text": " That's already present.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4632.795,
    "end": 4636.657,
    "text": "Deconstruct literally means the when-ness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4637.157,
    "end": 4639.799,
    "text": "When did I arrive in this moment?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4639.999,
    "end": 4649.424,
    "text": "What parts of the puzzle am I still missing because I'm in a hurry to figure out if I'm supposed to go left or right next?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4651.345,
    "end": 4654.007,
    "text": "Especially in the social context, especially there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4655.868,
    "end": 4658.189,
    "text": "Yes, Stephen, if you would like to give a quick point here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4658.229,
    "end": 4658.609,
    "text": "Thanks, Jim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4658.629,
    "end": 4659.47,
    "text": "Just adding to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4661.667,
    "end": 4687.096,
    "text": " that piece of the situationalness um i'm believe that's where you come into the awareness of what's going on so science is very much telling us what's going on what is a thing what is this what is that but that fork in the road or being you know a team teammates junction or something else ultimately there's awareness piece",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4688.027,
    "end": 4708.721,
    "text": " where is that situated and in active inference that's often more complex nebulous with the scientific being about the accuracy of the method well other times the awareness and the complexity comes in active inference can have both of those yeah great continuing on through the latter parts of the paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4709.793,
    "end": 4714.616,
    "text": " they talk a lot about complexity, which many of us love.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4715.297,
    "end": 4724.623,
    "text": "So complexity, complexity science, complexity theory bring so many great terms, concepts, people, methods, tools, ideas, everything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4725.384,
    "end": 4729.006,
    "text": "And they talk a lot about autopoiesis and this recursiveness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4729.166,
    "end": 4736.251,
    "text": "There's a lot of really creative linkages made in the inactive paper and complexity is used in a really valuable way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4737.552,
    "end": 4738.253,
    "text": "In section four,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4738.993,
    "end": 4764.018,
    "text": " they're going to move into active inference in an inactive dynamic setting and that is where active inference is going to be deployed as an insightful instrument to learn about and understand the dynamics underlying cultural co-constructions considering it does not necessarily take agents as passive agents together are the authors of the states of one another and so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4765.305,
    "end": 4774.023,
    "text": " kind of analogous to the inactive figures shown earlier, where we had the gears in the head, and then that went to like the gears being more distributed in the body and in the mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4774.963,
    "end": 4789.787,
    "text": " Here in figure two, there's more of a classical meaning and model-based reasoning where different social actors are kind of having this inferential account that is very like one directional as shown here with the arrow pointing just to the middle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4790.467,
    "end": 4801.47,
    "text": "And in figure three, they're depicting the social action in figure two under active inference in terms of labeling here the internal states of the social actor two",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4802.734,
    "end": 4804.916,
    "text": " and the external states being social actor one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4804.976,
    "end": 4819.888,
    "text": "So this is from the perspective of social actor two, where the blanket states are being framed as sociocultural meaning and that model-based reasoning, which opens up for inferential accounts that are distributed and enacted.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4820.988,
    "end": 4821.209,
    "text": "And...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4823.001,
    "end": 4833.869,
    "text": " Hopefully we'll go into more detail because this is where they are supporting their positive instrumentalist application of active inference into the social and active space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4835.211,
    "end": 4841.696,
    "text": "And then they write, characterizing a social scene as analogous to scientific practice is thereby a mischaracterization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4842.296,
    "end": 4850.883,
    "text": "It's almost like taking what happens in the laboratory in a certain context and even a certain view on what happens in the laboratory in a certain context.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4851.806,
    "end": 4863.514,
    "text": " comma, in a certain context, and then critiquing that and thinking a bit more expansively about what happens in the hallways of the laboratory and in the basement and in the world around the building.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4864.274,
    "end": 4880.905,
    "text": "And that is also really nicely connected to some of Jelle Brunberg et al's work on the anticipating brain is not a scientist, which also focuses on the inactive perspective from an ecological perspective, not only necessarily the social, but the social is an important case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4883.22,
    "end": 4896.64,
    "text": " in table one they're going to discuss a little bit more about some of the dividers and contents of cells related to the natural world and scientific tools and constructs",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4897.95,
    "end": 4901.073,
    "text": " For sure, we're gonna return here in subsequent discussions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4901.173,
    "end": 4904.536,
    "text": "So just check out table one, see what you think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4905.156,
    "end": 4906.457,
    "text": "What other lines would you draw?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4906.517,
    "end": 4909.28,
    "text": "Would they be kind of like curved lines, like look like letters?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4909.76,
    "end": 4910.901,
    "text": "Would you circle anything?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4910.961,
    "end": 4912.282,
    "text": "Would you draw some triangles?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4912.302,
    "end": 4913.603,
    "text": "Would you add another row?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4913.684,
    "end": 4914.704,
    "text": "Would you make it a tensor?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4915.285,
    "end": 4922.791,
    "text": "What else would you draw on table one, even if only another double bounding line to emphasize that it's perfect as is?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4923.132,
    "end": 4923.272,
    "text": "Dean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4924.099,
    "end": 4932.544,
    "text": " All I would say is if you do go and have a look at this, ask yourself why these hyperparameters and why these laterals?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4933.705,
    "end": 4940.529,
    "text": "Because I think that will lead to all kinds of, well, for me, it just got me so twisted around.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4940.549,
    "end": 4942.009,
    "text": "Fun.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4942.69,
    "end": 4942.93,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4943.11,
    "end": 4945.772,
    "text": "And then conclusion before we move to the second paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4947.593,
    "end": 4953.076,
    "text": "We have shown that holding both in activism and theory of mind entails contradiction and confusion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4955.302,
    "end": 4963.79,
    "text": " This is evident when we critically dissect the two hidden assumptions held by TOM-like theories such as TTOM, which are rejected by inactivism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4964.05,
    "end": 4969.135,
    "text": "Those two covert assumptions that they believe disrepute the linkage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4970.456,
    "end": 4977.823,
    "text": "And then they reiterate the co-constructive nature and the embedded and ecological components of social inaction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4978.857,
    "end": 4984.119,
    "text": " and the recursion and the unfolding through time, the rolling out of social inaction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4984.96,
    "end": 5004.629,
    "text": "And they suggest that dynamical systems theory and active inference instrumentally applied as a type of dynamical systems modeling has promise and is a suitable and complimentary tool to consider social understanding as generalized synchronization held in a certain way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5006.141,
    "end": 5019.96,
    "text": " that was that paper and it will now be paired with the abductive paper so one breath before we move into abduction yes stephen",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5021.741,
    "end": 5036.708,
    "text": " Taking that breath, that last sentence there about how it can be almost a bridge there, the complementary use of dynamical systems theory sort of fills a gap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5036.888,
    "end": 5037.888,
    "text": "They're sort of filling the gap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5038.348,
    "end": 5043.731,
    "text": "And in a way, I think as we talk about the abduction paper, some of the gaps that doesn't fill",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5044.531,
    "end": 5050.776,
    "text": " I know we're not trying to talk about filling gaps here, but let's say we're filling gaps, abduction might also fill.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5051.316,
    "end": 5068.909,
    "text": "So, you know, the beauty of active influence and the Bayesian approach is that lots of different scales and modalities can be weighted and blended to give you potentially a feel of what to do, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5068.949,
    "end": 5072.851,
    "text": "So it doesn't mean one excludes the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5073.934,
    "end": 5074.234,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5074.975,
    "end": 5077.296,
    "text": "Okay, into abduction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5079.537,
    "end": 5080.337,
    "text": "We abduce away.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5083.719,
    "end": 5092.364,
    "text": "The paper begins with a relatively short and very concise introduction to some of the key points of the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5093.407,
    "end": 5100.29,
    "text": " We described earlier in their aims that they're interested in this naturalistic rendering of some of C.S.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5100.37,
    "end": 5102.491,
    "text": "Peirce's later, e.g.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5102.591,
    "end": 5115.376,
    "text": "post-1903 or post-1905, mostly unpublished work, unpacking the semiotic and logical notions of abductive reasoning, which we covered in the context section.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5116.717,
    "end": 5121.639,
    "text": "They're aiming for this biological model of abduction, which is going to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5123.08,
    "end": 5137.085,
    "text": " thread the needle, weave the fabric, whatever it is that maintains the functional integrity of the organism, the evolutionary imperative for that living being's existence, and to be compatible with modern neuroscience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5139.471,
    "end": 5142.834,
    "text": " They focus on the allegiance and the alliance, which we talked about earlier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5143.575,
    "end": 5153.785,
    "text": "And they'll introduce also in the introduction, the Markov blanket concept, which will be a great point of juxtaposition to add a little bit more detail.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5154.205,
    "end": 5159.41,
    "text": "Like if it is a front, a contact front with active inference, with social inaction and abduction,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5160.271,
    "end": 5167.094,
    "text": " then these are like hot points or points of contact within the interface front to really zoom in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5167.274,
    "end": 5170.935,
    "text": "Okay, how is internal state being used in these two models?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5171.335,
    "end": 5183.66,
    "text": "And that's where the active inference ontology is of immense value because even when people are speaking in different languages or we have a computer program, an equation, a poem, and then a scientific paper,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5184.64,
    "end": 5210.788,
    "text": " when we can link and proactively use or proactively annotate with the active inference ontology we gain the ability to not just say well we're both pointing at the moon is your finger my finger or are we pointing at the same finger because it's so far away and so maybe it's a little bit off and your your ray is missing the moon from my point of view and so on instead we can actually get down and not",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5211.903,
    "end": 5225.512,
    "text": " bleed out on the operating table, but rather pin down transiently and find a tractor that helps us really go into that intersection rather than merely hitting and running with just points of resonance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5225.592,
    "end": 5225.832,
    "text": "Dean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5227.613,
    "end": 5239.101,
    "text": "Again, I'll just summarize that by saying we can situationally analyze better because we now actually have a way of being able to hold some calm and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5241.175,
    "end": 5264.835,
    "text": " thing together so that's all i want to add to what you just said and just adding one on to that as well is yeah sorry but um and where there may be a difference so you know like there could be this understanding of a lot of the terms the ontological understanding say what often is a problem is if there's something that's not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5266.051,
    "end": 5293.38,
    "text": " aligned but is just not noticed or is brushed over say okay this is different okay there's an ontological change here there's a way there's there's there's a way for that to be attractively like we have with active influence it's a tractable way to do it because otherwise there's so many ontological things floating around in this space which is its beauty but it's it's not cognitively possible to find what you need to look at",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5295.404,
    "end": 5295.744,
    "text": " Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5296.685,
    "end": 5304.99,
    "text": "The next section, again, with these two lights co-illuminating, co-constructing, no two lights can physically overlap.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5305.03,
    "end": 5310.493,
    "text": "So there must be parallax induced by these two lights and shadows and all kinds of effects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5310.573,
    "end": 5316.437,
    "text": "And maybe it's not the same wavelength and maybe you're walking around and different sides have different illuminations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5317.878,
    "end": 5321.6,
    "text": "The section is on active inference in the light of abduction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5323.069,
    "end": 5344.166,
    "text": " this is very fascinating section because they're going to take that almost quasi-algorithmic but certainly pre-computational framework being developed in the latter 1800s and early 1900s and start to interface",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5350.365,
    "end": 5353.466,
    "text": " and see how it relates to active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5354.207,
    "end": 5358.528,
    "text": "So we can highlight more and we'll look forward to discussing in further sections.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5358.608,
    "end": 5361.67,
    "text": "So do pause it if you want to read all of this or read the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5363.29,
    "end": 5364.751,
    "text": "But they're focusing on the late schema.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5364.831,
    "end": 5365.411,
    "text": "Yes, please, Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5366.071,
    "end": 5367.732,
    "text": "All I was going to say is it's mood lighting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5367.772,
    "end": 5373.915,
    "text": "If you actually look down at the bottom bullet, the lighting is actually trying... Purse talked about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5373.935,
    "end": 5379.817,
    "text": "Maybe, I don't know if he actually did have the formalisms to back that up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5380.458,
    "end": 5400.369,
    "text": " But active inference actually does now talk about the kind of level of energy that we can now maybe see within the two constraints, that idea of parameterizing, back to the vice grip sort of thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5401.738,
    "end": 5402.058,
    "text": " Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5402.399,
    "end": 5405.261,
    "text": "So just a few quotes that are really fascinating here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5406.081,
    "end": 5411.406,
    "text": "So in science, abduction can be likened to the logic of discovery of hypotheses",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5412.878,
    "end": 5421.721,
    "text": " which as we discussed earlier, has a generative creative element and then a secondary selective component like Bayesian model selection, Bayesian model reduction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5422.602,
    "end": 5429.724,
    "text": "And they even add with a cautionary remark that no full assimilation of Pearson abduction can occur to IVE.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5429.884,
    "end": 5435.626,
    "text": "That's inference to the best explanation, which is one half of the two stroke engine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5436.167,
    "end": 5442.189,
    "text": "And commonly people will use abduction to refer to probabilistic reasoning from a given set.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5444.324,
    "end": 5466.065,
    "text": " like abduction elsewhere in the writings this later schema those ones that are after 1903 that according to experts have been the least researched ones there's beginning with an observation of surprising factor events observation surprise and through a conditional major premise",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5467.082,
    "end": 5494.644,
    "text": " includes in a co-hortative mood again a mood which peers termed the invest against it's like it has and right in it and that is that something of imperative importance ought to be done pragmatism inaction policy selection initially aroused by curiosity uncertainty reduction entropy that leads to the formulation of a question which is semantic",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5495.629,
    "end": 5499.351,
    "text": " And there's more discussion of the investigand mood and other moods.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5501.332,
    "end": 5501.712,
    "text": "Yes, Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5502.292,
    "end": 5503.133,
    "text": "One other quick thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5503.593,
    "end": 5518.219,
    "text": "Cohortive or co-constructed from the other paper, again, share a common prefix that we, again, I think we'll maybe be able to tease some more of that, the importance of that in the next few lectures.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5519.0,
    "end": 5519.28,
    "text": "Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5521.397,
    "end": 5546.526,
    "text": " they're going to continue with this question of the economy of research so they formed three argumentative cores really specified areas of contact with active inference and abduction that they're suggesting form an initial trio or triad that will start to form the allegiance between active and abductive inference",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5548.322,
    "end": 5563.206,
    "text": " First, the presence of non-degeneratively triadic relations, then the utilization of the leading principles of abductive reasoning, B, and third, the subjunctive conditional formulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5564.067,
    "end": 5568.788,
    "text": "There are some logical technicalities thrown around, but that's what the streams are for.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5570.509,
    "end": 5574.45,
    "text": "In point A, which you can pause and read the text of,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5575.336,
    "end": 5596.495,
    "text": " they're going to highlight the Markov blanket concept or rather their realist interpretation as frist and blankets and argue that the Markov blankets again implemented in a realist first and blanket sense have a markedly piercing irreducibly triadic form",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5597.881,
    "end": 5605.763,
    "text": " focusing on the boundary as mediator between external and internal states, and therefore the thirdness arising in semiosis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5606.683,
    "end": 5624.048,
    "text": "There's a lot more to say, but if either of you want to give one more point on A. Okay, in B, they're going to continue on by talking about some of the guiding principles of inference, and specifically discuss abduction's role in guiding inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5625.25,
    "end": 5628.332,
    "text": " What is the leading principle of active inferences then?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5629.953,
    "end": 5638.378,
    "text": "Here, they're going to describe some technical details of active inference in terms of free energy, variational or expected, as bounding surprise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5639.398,
    "end": 5652.566,
    "text": "And then they'll connect that to some of the primary sources of Peirce and discussions of biosemiotics, which have also been connected in a lot of discussions that we've had on representation and meaning and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5655.515,
    "end": 5677.9,
    "text": " it goes even further or deeper afield with discussions of synechism as well as this question of universal mind which is for staging in some ways the universal cognition pan-cognitive dynamics distributed cognitive systems matter is effect mind by von schiller",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5679.08,
    "end": 5691.969,
    "text": " And then they're going to argue about Frist and Blankets and their construction in terms of triadic relationships, Pearson triad, sign, object, interpret, ant, leads to unexplored semantic possibilities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5693.31,
    "end": 5707.94,
    "text": "Bringing together some of these broader qualitative threads in semiotic analysis with potentially dynamical systems theory, quantitative Bayesian methods, and everything else that active inference brings along with the toolkits to implement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5710.154,
    "end": 5725.935,
    "text": " And C, they're also in C going to unpack some extremely interesting, though nuanced, logical, constructive elements of the semiotic proposition, if I could call it that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5727.97,
    "end": 5755.16,
    "text": " We'll go into it more in further discussions, but they're going to explore how different framings of logical relationships amongst clauses or assertions and warrants and all this rhetoric relate to realism, abduction, and Pierce's version of realism as the possible is what can become actual.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5756.294,
    "end": 5766.025,
    "text": " yes there are things that are possible but cannot become actual and then what do we use for that adjacent or realizable possible and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5767.363,
    "end": 5768.504,
    "text": " Where might we want to use it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5768.864,
    "end": 5770.385,
    "text": "And what's going to break that symmetry?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5770.465,
    "end": 5771.446,
    "text": "Where's pragmatism?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5772.006,
    "end": 5783.053,
    "text": "Well, what would be useful to consider would be the space of all possibles that could happen and none other, and not be surprised by adjacent possibles that we didn't consider, but did happen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5783.974,
    "end": 5793.46,
    "text": "And then maybe it's not so bad to spend a little bit of extra thought or a few extra computer resources on considering possibilities that couldn't happen",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5795.046,
    "end": 5810.122,
    "text": " but we wouldn't want to get lost in the potentially exponential space of possibilities that can't happen and end up losing our focus and attention on possibilities that can happen, which are what Peirce describes as real possibilities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5812.244,
    "end": 5814.447,
    "text": "And the pragmatist stance",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5815.973,
    "end": 5832.025,
    "text": " and mood, also closes the loop with policy selection and pragmatism in active inference, where they say that the pragmatist meaning of beliefs in the Bain-Peirce formulation is that upon which one is capable of acting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5833.766,
    "end": 5835.027,
    "text": "And there's a lot of resonances there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5835.287,
    "end": 5835.567,
    "text": "Stephen?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5837.489,
    "end": 5841.132,
    "text": "Yeah, I think this also speaks then to the need to have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5842.322,
    "end": 5864.782,
    "text": " talk about scale friendly or levels or you know some sort of structure that enables this to be present because you know active influence can sort of go all the way down in the down to the cellular level there's ways of looking at it here there's a sense that okay we're looking at these um ideas of um a signifier",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5866.164,
    "end": 5892.354,
    "text": " we know with active inference it's not that it believes that we have signals coming in which get processed and aggregated so there's there's a sort of a scale at which you have the structures that you have the the morphogenesis maybe to get to and the scale to make the stop sign make sense to be interpreted um as a as its own",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5893.624,
    "end": 5916.216,
    "text": " signifier so i think that may be where there's this um tension going to happen between the inactivists here and and where that can happen but the argument could well i would say is that certain scales certain structures and maybe certain realist ways of things happening something like that is feasible",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5918.336,
    "end": 5918.536,
    "text": " Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5918.576,
    "end": 5920.798,
    "text": "Just Dean, and then we'll quickly move through the rest.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5921.478,
    "end": 5922.399,
    "text": "I'll just be real quick here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5922.799,
    "end": 5938.57,
    "text": "I think especially in B and to a lesser extent in C, the business of how we take piercing thinking into the active inference realm is built on an assumption.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5938.61,
    "end": 5945.275,
    "text": "And that is that our continuing existence, our continuing reality, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5945.856,
    "end": 5954.482,
    "text": " means that we're accumulating more experiences with the tools in the world, the rules in the world, and the pools.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5954.562,
    "end": 5959.105,
    "text": "And by pools, I mean those aggregations that Stephen was just pointing to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5959.345,
    "end": 5961.947,
    "text": "Thank you for bringing that up, Stephen, because that made me want to write this down.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5962.447,
    "end": 5968.051,
    "text": "Aggregations as densities, tail of two densities, materializing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5969.272,
    "end": 5972.294,
    "text": "So again, I don't know that you...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5973.18,
    "end": 5993.204,
    "text": " exclusively say everything is real and then all the examples underneath it are also real because even Pierce himself said that there is an aspect of this reality which we will never be able to describe as anything other than non-reality, even though we're fundamentally using it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5993.944,
    "end": 5999.445,
    "text": "So how does that enable these densities to form?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5999.485,
    "end": 6002.106,
    "text": "And I know that sounds way the heck and gone out there,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6002.887,
    "end": 6005.77,
    "text": " I'm sorry, but it's actually something we have to contemplate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6007.412,
    "end": 6007.693,
    "text": "Thanks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6009.354,
    "end": 6017.003,
    "text": "They're then going to flip the script, or at least the syntax, and talk about abduction in the light of active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6018.007,
    "end": 6025.595,
    "text": " Here is where they kick off with that acknowledgement of the two-stroke engine with generative abduction and selective abduction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6026.416,
    "end": 6040.811,
    "text": "And then they're going to connect that to some of the ontology of active inference in terms of like seeing selective abduction as a sampling process and understanding where generative abduction fits in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6042.031,
    "end": 6054.901,
    "text": " So continuing on with seeing abduction from the light of active inference, which we might even operationalize as saying like framing or viewing abduction from the perspective of the active inference ontology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6055.602,
    "end": 6067.231,
    "text": "So rather than us self-electing as interpretants of active inference as some concept, which we cannot necessarily speak for a concept,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6068.567,
    "end": 6094.262,
    "text": " can't speak for english but we can use english words and so analogously we don't need to necessarily speak for active inference though i'm the last to say what those should or shouldn't do it's possible to use the active inference ontology and then it's kind of like a two-step checklist was the term in the active inference ontology in the core supplement or entailed sections",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6095.953,
    "end": 6102.737,
    "text": " Was it used in a way that was pragmatic, that made sense in that situation, in that multi-scale context?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6104.057,
    "end": 6116.644,
    "text": "And that is actually a two-step process to ask if we're speaking using active inference rather than if we're speaking for like an advocate or like a salesperson for active inference per se.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6117.725,
    "end": 6125.109,
    "text": "And they're going to restate the case in terms of the FVP framework in the sense of and using the terms of.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6126.414,
    "end": 6132.496,
    "text": " and they're going to highlight the relationship of internal states to external states mediated through the blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6133.116,
    "end": 6143.06,
    "text": "And they then go through this syllogism and they restructure and restate their qualitative schema of abductive active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6144.7,
    "end": 6155.044,
    "text": "And they describe this action cognition perception loop where a surprisal, any incoming sensory information is experienced",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6156.092,
    "end": 6172.537,
    "text": " And then they take that not just into the passive or even active interpretation of it in the context of a Bayesian generative model, but rather something that is unfolding in that mood of the investigant.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6176.479,
    "end": 6183.221,
    "text": "They do continue on and bring in important Pearson idea of the economy of research",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6184.557,
    "end": 6187.318,
    "text": " So we'll go over this again, hopefully with authors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6190.398,
    "end": 6193.279,
    "text": "It relates to Pierce's theory of science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6195.0,
    "end": 6204.862,
    "text": "Pierce's original paper in 1876 on the economy of research wrote, the doctrine of economy in general treats the relationships between utility and cost.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6206.403,
    "end": 6227.845,
    "text": " specifically that is going to be related to research in this socially enacted pragmatic sense by asking how given expenditure of money time and energy what is going to obtain the most valuable addition to knowledge what experiment that my eyes could secade to will have the most information gain",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6228.857,
    "end": 6252.169,
    "text": " what experiments could the researcher carry out to reduce their uncertainty the most about the natural system not merely to verify something they know not merely to falsify something that they know will be falsified but rather to exist in this optimal experimentation space and then pierce and later the authors are going to naturalize contextualize",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6253.243,
    "end": 6258.807,
    "text": " bring to the social cognitive area by asking, well, how does money, time, and energy happen?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6259.167,
    "end": 6264.791,
    "text": "Because that optimal experiment is encultured and it uses energy, it uses reagents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6265.272,
    "end": 6273.478,
    "text": "So perhaps in this way, we could say that Pierce was one of the first modern program managers for a major funding agency, but no, he wasn't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6274.398,
    "end": 6277.681,
    "text": "And they discussed this economy of research a bit more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6281.377,
    "end": 6296.129,
    "text": " They describe in this section how Peirce promotes several values or virtues or qualities that characterize the economy of scientific hypothesis making.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6298.331,
    "end": 6301.013,
    "text": "Incomplexity, which is like a de-risking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6302.695,
    "end": 6305.417,
    "text": "Breadth, which speaks to unification.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6307.031,
    "end": 6320.074,
    "text": " and caution as the economic quality of avoiding diminishing marginal returns by skillfully breaking down questions into a series of small questions that can be answered with reasonable limits of investment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6320.895,
    "end": 6323.435,
    "text": "How many interesting threads are being brought together?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6324.455,
    "end": 6334.578,
    "text": "For example, questions that are broken down to binary yes, no questions can be connected to information theory and quantum as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6337.335,
    "end": 6341.716,
    "text": " Here, Dean, I will let you speak to fairness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6345.197,
    "end": 6345.717,
    "text": "I'll just read it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6345.737,
    "end": 6353.059,
    "text": "To be fair, and as briefly noted at the beginning of this paper, there are no instrumentalist interpretations of FEP and its ingredients, such as Markov blankets.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6354.539,
    "end": 6366.362,
    "text": "But, and this is a footnote in this paper, but our faith, for want of a better word, in realist credentials of FEP has its roots in the pragmatist optimism, or rather, its active meliorism,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6367.048,
    "end": 6373.333,
    "text": " about the gains from the alliance between evolutionarily useful processes that contribute to maximizing survival.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6374.074,
    "end": 6383.082,
    "text": "If this pragmatist approach to realism displeases the elevated taste of one who looks for some staunch metaphysical criteria, let a thousand flowers bloom.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6383.162,
    "end": 6394.732,
    "text": "I think what's fascinating about this is that to hold the idea that there is a realism is a very easily defendable position to take.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6395.322,
    "end": 6415.454,
    "text": " But even in the previous slide, one of the things that first talked about without saying them directly, or at least not in those quotes, was that that optimal position is some element of exploitation or economy or simplicity or somebody's done this before me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6416.655,
    "end": 6417.756,
    "text": "Is that a shortcut?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6418.636,
    "end": 6424.9,
    "text": "And exploration, which tends to take longer, has more trial and error.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6425.595,
    "end": 6432.1,
    "text": " but also doesn't have you constantly overfitting to a particular outcome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6432.62,
    "end": 6435.643,
    "text": "So that's the reality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6436.643,
    "end": 6447.452,
    "text": "And again, I wouldn't push back on the claim that there is a very real piece to this playing play, a minimum of two going back and forthness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6449.573,
    "end": 6454.257,
    "text": "So I'm not, in fact, I fully agree with these authors, like I fully agree",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6454.687,
    "end": 6458.689,
    "text": " with the other authors about the idea of a co-construction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6458.809,
    "end": 6470.954,
    "text": "So I don't know that you are necessarily confused if you can say yes and yes and yes again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6471.555,
    "end": 6473.976,
    "text": "Stephen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6474.796,
    "end": 6482.98,
    "text": "Yeah, sort of adding to what Dean's saying there, and the idea of implementation or...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6484.214,
    "end": 6486.958,
    "text": " Exploitation definitely is being alluded to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6486.978,
    "end": 6493.485,
    "text": "And in science, experimentation is sort of the way of gaining knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6494.266,
    "end": 6498.33,
    "text": "But there's the exploration piece, and I would argue that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6499.562,
    "end": 6514.631,
    "text": " you can't get exploration per se within the kind of objective domain there has to be this journey into the into the into the performative subjective intersubjective liminal",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6515.979,
    "end": 6536.959,
    "text": " as Einstein did with his mind games or these and you create these sort of mental constructs in a way what some of what's happening today is a mixture of that and then that's brought back and modeled experimented with or whatever um so I think there's a I mean modeling is interesting because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6538.317,
    "end": 6542.658,
    "text": " it kind of can come on that journey a little bit as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6543.198,
    "end": 6546.979,
    "text": "So that could be something which experiments can't do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6548.519,
    "end": 6549.8,
    "text": "Here's a summary of an old joke.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6550.38,
    "end": 6554.881,
    "text": "Person A says A, and the referee says you're right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6555.081,
    "end": 6558.042,
    "text": "Person B says B, the referee says you're right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6558.442,
    "end": 6560.802,
    "text": "And person C says, well, A and B can't be right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6561.362,
    "end": 6563.463,
    "text": "And the referee says, you know, you're right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6565.509,
    "end": 6589.273,
    "text": " little rapid humor for those who like that genre um they then have a conclusion section and we have many questions and points to make and a lot of connections to bring back to a lot of the naturalization here like the fields and leaven work and they even take it to the regenerative capacities of flatworms so from flatworms to flatmates",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6590.697,
    "end": 6591.779,
    "text": " That's where we're going today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6592.54,
    "end": 6600.875,
    "text": "And then we also saved up for the dot one, some of the juxtaposition of the Markov blanket concept specifically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6601.917,
    "end": 6614.701,
    "text": " The social and active components of science, which are super important and Majeed has brought on to these discussions previously, is a great point of contact with the abductive paper and the social and active paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6615.361,
    "end": 6623.824,
    "text": "Markov blankets represent like a very constrained, even technical, contact front that will provide a lot of discussion in the dot one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6626.041,
    "end": 6647.32,
    "text": " and that is where we close the dot zero with uh again so much excellent groundwork and backpack packing by dean and steven so is there anything else you'd like to add at this point or anything arising that you want to discuss in the dot one yes dean then steven if you'd like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6647.844,
    "end": 6649.085,
    "text": " Daniel, fantastic job.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6649.125,
    "end": 6657.189,
    "text": "We just did an order of magnitude three from what was typically a single paper live stream, and we still got it in under two hours.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6657.209,
    "end": 6658.83,
    "text": "So you're to be applauded for that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6659.471,
    "end": 6676.08,
    "text": "And secondly, I just want to, maybe as a bit of a tip off for the dot one, there's a research by the name of Iskra Nunez, who talks about if you want to be able to look at how things are deconstructed and constructed, you have to look at both product in process and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6676.57,
    "end": 6680.913,
    "text": " An example being, how do I build a car and process in product?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6681.813,
    "end": 6689.698,
    "text": "What is the thing that's either a branching point or an actual utensil?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6690.659,
    "end": 6705.128,
    "text": "And so if you open your mind up to both that inversion along that continuum, it opens up all kinds of possibilities in terms of bringing things into a place where they don't necessarily come into conflict.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6705.734,
    "end": 6707.375,
    "text": " Yes, they can integrate and braid.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6707.995,
    "end": 6720.4,
    "text": "And so maybe that will be, after today, something that people who are using active inference, which in my opinion is both product and process and process and product at the same time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6720.48,
    "end": 6722.941,
    "text": "It's the gripper and the gripped.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6723.201,
    "end": 6725.362,
    "text": "Maybe they will give some thought over to that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6727.522,
    "end": 6731.284,
    "text": "It's almost like the pragmatist sees the fork in the road and uses it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6732.56,
    "end": 6736.521,
    "text": " And maybe you use the fork by going one way and maybe you do pick it up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6736.942,
    "end": 6741.083,
    "text": "Maybe you use it by completing the table setting for someone else who will dine there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6741.123,
    "end": 6748.325,
    "text": "And so there's so many ways to use because use is socially enacted, abductive, contextualized, et cetera.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6748.966,
    "end": 6753.887,
    "text": "And again, at the fork is where that conversation is happening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6754.388,
    "end": 6761.41,
    "text": "And at our field site or at base camp is where we can imagine the forks and the roads that will come across Steven.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6763.191,
    "end": 6781.516,
    "text": " yeah and next in the in the dot one sort of finding a way to to bring the authors if whoever's there you know on a bit of a journey maybe down one of the forks maybe it goes to the edge of the lake and we need to get in and get a bit wet um so how can scientific",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6782.671,
    "end": 6810.796,
    "text": " abduction or some of the sort of more scientifically bounded models rules substantiated by experimentation and instrumentation okay when when does that get moved away maybe because of participation maybe because of transdisciplinarity maybe because of transformational processes maybe because of deep exploration outside of the field um i wonder this is something you might want to think about how can we",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6812.23,
    "end": 6827.675,
    "text": " give some sort of clear journey options, right, so that they can come a little bit off without getting stuck in a, you know, in quicksand or drowning in the deep water, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6827.715,
    "end": 6840.48,
    "text": "So we want to sort of navigate by thing this, this is given some of those pointers, I think of where there is sort of ways off ramps as well as on ramps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6840.86,
    "end": 6841.58,
    "text": "So thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6843.479,
    "end": 6844.14,
    "text": " Thank you, fellows.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6844.861,
    "end": 6845.141,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6845.302,
    "end": 6848.146,
    "text": "This was huge.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6848.246,
    "end": 6850.429,
    "text": "I really, really appreciate all your help.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6851.911,
    "end": 6852.412,
    "text": "Great times.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6852.652,
    "end": 6853.293,
    "text": "See you in the dot one.",
    "speaker": "SPEAKER_02"
  }
]