[
  {
    "start": 6.974,
    "end": 32.803,
    "text": " hello and welcome everyone it is november 2nd 2023 and blue and i are here in active livestream 56.0 kicking off the 56 series on a set of four papers welcome to the active inference institute we are a participatory online institute that is communicating learning and practicing applied active inference you can find us at links here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 33.763,
    "end": 38.59,
    "text": " This is a recorded and an archived livestream, so please provide feedback so we can improve our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 39.17,
    "end": 43.196,
    "text": "All backgrounds and perspectives are welcome and will follow video etiquette for livestreams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 44.117,
    "end": 51.066,
    "text": "Head over to ActiveInference.org if you want to learn more about the Institute, get involved in any activities or learning groups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 52.495,
    "end": 65.137,
    "text": " Let's begin with a little bit of an introduction and warmup, say hello, and then maybe just one thing that we found interesting about these papers or that made us want to jump in for the 56 series.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 65.177,
    "end": 79.4,
    "text": "So I'm Daniel, I'm a researcher in California, and I was very interested to learn about what the relationship is between different neural inspired approaches to machine learning and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 80.42,
    "end": 80.56,
    "text": "Bloop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 82.321,
    "end": 90.164,
    "text": " I mean, same, this kind of always like the neurobiologically inspired machine learning is always kind of something that piques my interest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 90.464,
    "end": 94.066,
    "text": "And I'm still here, still excited about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 94.266,
    "end": 112.033,
    "text": "And in this like set of papers, I was actually like particularly interested in like sparsity and how that is maybe something that's particularly biological or not, or just kind of learning and diving deeper into sparsity as like a topic of consideration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 113.697,
    "end": 126.465,
    "text": " cool all right well in this series and in this video we're going to discuss four papers we'll get to why we have four soon four papers are the neural coding framework for learning generative models 2022",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 128.345,
    "end": 133.427,
    "text": " Convolutional Neural Generative Coding, Scaling Predictive Coding to Natural Images, 2022.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 134.307,
    "end": 138.608,
    "text": "Spiking Neural Predictive Coding for Continually Learning from Data Streams, 2023.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 139.128,
    "end": 145.61,
    "text": "And COG and GEN, Building the Kernel for Hyperdimensional Predictive Processing Cognitive Architecture, 2022.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 146.431,
    "end": 153.293,
    "text": "And as there are four papers, we're gonna use acronyms for each paper and also go through them in this order.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 154.093,
    "end": 175.203,
    "text": " again we'll return to why there's four and why this order the four acronyms are ncf22 cgnc22 snpc23 ppca22 so the video is going to be an introduction we're going to cover the big questions and then basically jump immediately into the four papers and this is just an introduction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 176.303,
    "end": 186.549,
    "text": " feel free to write comments or if you're around in time to join for these upcoming discussions that we're going to have with author so blue what big questions are you excited about here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 188.508,
    "end": 199.338,
    "text": " So I think I already talked about sparsity, but I would like to know, like, what other types of tasks that are perhaps maybe non-visual could neural generative coding be suited to?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 200.139,
    "end": 207.686,
    "text": "And then, like, the concept of, in the last paper, we'll get to it, of, like, a memory echo as a prediction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 207.806,
    "end": 210.509,
    "text": "I think, like, is prediction just a memory echo?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 210.629,
    "end": 212.291,
    "text": "And then, like, that kind of leads into...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 213.502,
    "end": 224.294,
    "text": " um how like what is the difference between i predict or i expect or i hope right like i predict that the eagles might win the super bowl with like maybe",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 225.562,
    "end": 231.444,
    "text": " 50 to 60%, you know, I predict, that's like the, where I, that's the probability, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 231.724,
    "end": 237.766,
    "text": "50 to 60% probability that the Eagles win the Super Bowl, but like, I totally hope that the Eagles win the Super Bowl 100%.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 238.146,
    "end": 253.031,
    "text": "So like, where's the difference between hoping, and like, I can actually, like, I thought about it, and it's like action, the role, like, you know, you hope something happens, you hope you get into a good college, you predict that you'll go to college, you hope you get into a good college, you, you know, get good grades, do all the things, and then you can act,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 253.131,
    "end": 257.234,
    "text": " based on that hope, but like, I actually can take no action to affect whether or not the Eagles win the Super Bowl.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 257.274,
    "end": 263.279,
    "text": "So action is not necessarily a key role there, but like, how is hope different from prediction and expectation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 263.299,
    "end": 265.361,
    "text": "And how would you approach modeling something like that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 265.601,
    "end": 267.903,
    "text": "It's just something that derailed me anyway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 269.534,
    "end": 292.881,
    "text": " that's interesting yep so my big questions first just on the scope how is it different now that we're in our first quadruple dot zero we've done one paper at once we've done two at once side by side four is double side by side and we love the four about the topics though we are going to get very",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 294.272,
    "end": 313.964,
    "text": " micro and zoomed in and we're gonna have some of the formalisms brought in but there's a lot more in the paper so how do these really mechanistic and or abstract micro level discussions of like neuron spiking",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 314.915,
    "end": 336.517,
    "text": " help us get closer to real cognitive architectures and modeling and then i think to kind of for um war of the fourth paper here's where we're gonna see something like the cognitive architecture that includes not just perception and memory and all these things but also the action component so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 337.358,
    "end": 355.695,
    "text": " how does this connect to active inference like is this driving down the low road coming from the high road is it another road so where is the work that we're going to be looking at in this sequence of research related to Bayesian mechanics free energy principle some of these more first principles",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 357.529,
    "end": 359.73,
    "text": " intelligence conversations that we have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 360.51,
    "end": 362.491,
    "text": "So let's talk about why there are four papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 363.091,
    "end": 368.793,
    "text": "So I hope this is okay that from Aurobio, I share something that he wrote.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 369.833,
    "end": 382.537,
    "text": "He suggested the four papers and said, almost in that sort of order from the more base neural generative model coding, predictive coding framework and CF22,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 384.246,
    "end": 405.399,
    "text": " going to be the first paper we discuss to its convolutional generalization cngc22 down to its spike level generalization snpc23 and back to its part in generalizing active inference to a robotic setting ppca22 in a sort of progression slash series",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 406.425,
    "end": 416.752,
    "text": " So hopefully this lays out our approach to these four papers, which we were happy to accept this curriculum and challenge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 417.412,
    "end": 430.801,
    "text": "The first paper that we're going to look at is going to set the kind of base canvas or overarching umbrella model, the NGC.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 432.102,
    "end": 450.709,
    "text": " then there's going to be a convolutional and a spike level generalization or kind of additional motif and then we'll get to this question of more integrated cognitive modeling in the fourth bit any overall thoughts just on the four papers blue before we go to the first one",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 451.607,
    "end": 458.428,
    "text": " I mean, I'm curious to ask, what was the order that these started in?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 458.848,
    "end": 462.529,
    "text": "Sometimes you just finish everything at once, or sometimes you start something and it takes forever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 462.889,
    "end": 475.692,
    "text": "So I'd like to know, what were the order that the projects were started in, as opposed to, I mean, we'd have the publication dates and whatever, but I would like to know, did they start and go in this order, just as a narrative from the author?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 477.182,
    "end": 477.883,
    "text": " That's a great question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 478.564,
    "end": 478.784,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 479.004,
    "end": 483.509,
    "text": "First paper, Neural Coding Framework for Learning Generative Models, Aurobia and Kiffer 2022.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 483.609,
    "end": 483.649,
    "text": "So.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 486.488,
    "end": 489.109,
    "text": " Just let me know when to switch slides for this section, Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 489.229,
    "end": 489.569,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 489.949,
    "end": 490.169,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 490.41,
    "end": 492.01,
    "text": "OK, so we'll read the abstract.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 493.491,
    "end": 496.132,
    "text": "Maybe I'll take a couple of sentences and then pass it to you, Daniel, if you don't mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 497.192,
    "end": 505.575,
    "text": "Neural generative models can be used to learn complex probability distributions from data, to sample from them, and to produce probability density estimates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 506.015,
    "end": 512.298,
    "text": "We propose a computational framework for developing neural generative models inspired by the theory of predictive processing in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 513.158,
    "end": 522.146,
    "text": " According to predictive processing theory, the neurons in the brain form a hierarchy in which neurons in one level form expectations about sensory inputs from another level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 522.546,
    "end": 523.948,
    "text": "Do you want to read the rest?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 523.968,
    "end": 530.133,
    "text": "These neurons update their local models based on differences between their expectations and the observed signals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 530.694,
    "end": 539.701,
    "text": "In a similar way, artificial neurons in our generative models predict what neighboring neurons will do and adjust their parameters based on how well the predictions match reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 540.342,
    "end": 557.821,
    "text": " In this work, we show that the neural generative models learned within our framework perform well in practice across several benchmark datasets and metrics, and either remain competitive with or significantly outperform other generative models with similar functionality, such as variational autoencoder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 559.397,
    "end": 559.557,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 559.637,
    "end": 559.877,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 560.597,
    "end": 564.138,
    "text": "So the roadmap, this is a nature paper and it's dense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 564.959,
    "end": 571.92,
    "text": "So there are like 18 different formalisms in this paper and like many, many different models and sets of experiments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 572.401,
    "end": 580.783,
    "text": "So the roadmap is here and we are not going to go that deep into this because we're doing four papers and, you know, hopefully under 90 minutes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 581.976,
    "end": 588.558,
    "text": " And so we're going to go deep into the maths here, but hopefully we can get more heavy into it in the dot one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 589.138,
    "end": 592.499,
    "text": "So pretty much introduction results, discussion and methods.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 592.779,
    "end": 606.863,
    "text": "But really what happens here is the results section kind of gives a lot more introductory information about like the back propagation and what learning looks like in the brain and the neurocoding framework and how this kind of forms a bridge here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 608.423,
    "end": 611.025,
    "text": " Then training the model and how the model updates everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 611.065,
    "end": 613.406,
    "text": "And then what can the model actually do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 614.006,
    "end": 619.489,
    "text": "So we're going to kind of get into a little bit about the model and what the model can actually do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 619.709,
    "end": 629.654,
    "text": "And then Daniel, I think, will delve deeper into the next couple of papers into the model and then finally tie it back into active inference in the final paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 629.754,
    "end": 632.936,
    "text": "So just that's an overall roadmap and then the roadmap for this paper, too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 633.216,
    "end": 634.377,
    "text": "So go ahead and flip it to the next one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 636.101,
    "end": 653.486,
    "text": " All right, so in this paper, the author states that in neurobiological systems, neurons make use of the information immediately available to them in both time and space and do not wait on distant regions in order to adjust their synapses, with global information provided through neurotransmitters such as dopamine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 654.989,
    "end": 676.559,
    "text": " Also later in the paper, he says, while the question as to how credit assignment is exactly implemented in the brain is an open one, it would prove useful to machine learning, computational neuroscience, and cognitive science to have a framework that demonstrates how a neural system can learn something as complex as a generative model without backpropagation using mechanisms and rules that are brain inspired.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 676.659,
    "end": 679.94,
    "text": "So that's kind of what they set out to do in this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 680.021,
    "end": 680.981,
    "text": "So let's go ahead and flip it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 683.698,
    "end": 708.52,
    "text": " so here this is figure one and this is like figure one a uh looking at a back propagation model and so this is i from the legend in the figure he says credit assignment in back propagation or in back prop i won't keep uh elongating that credit assignment in back prop requires a strict global feedback pathway which requires the completion of the forward pass that carries information upstream right to left",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 709.201,
    "end": 720.008,
    "text": " This feedback pathway carries the error message E0 at the output layer back along left to right, the same synapses used in the forward pass to update downstream neurons Z1 and Z2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 721.209,
    "end": 726.612,
    "text": " Backprop differs from brain-like learning because, so this is within the paper, not the legend.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 727.973,
    "end": 738.639,
    "text": "The synapses that make up the forward information pathway need to be directly used in reverse to communicate teaching signals, which is, this is known as the weight transport problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 738.779,
    "end": 740.24,
    "text": "And so you can see that here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 741.0,
    "end": 747.763,
    "text": " So here it's going from left to right, like the output layer is here at E0, or the error message is here at E0.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 748.123,
    "end": 752.344,
    "text": "And then the back propagation happens here at this red arrow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 752.484,
    "end": 753.045,
    "text": "Thank you, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 753.705,
    "end": 756.186,
    "text": "As I'm pointing to the screen, you're following my finger along.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 757.346,
    "end": 763.492,
    "text": " Okay, neurons need to know about and communicate their own activation function's first derivative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 764.272,
    "end": 766.775,
    "text": "And that is shown here in the little deltas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 767.455,
    "end": 775.342,
    "text": "So neurons must wait for the neurons ahead of them to percolate their own error signals backwards before they know when or how to adjust their own synapses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 775.842,
    "end": 778.084,
    "text": "And this is known as the update locking problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 779.284,
    "end": 802.983,
    "text": " then also there is a distinct form of information propagation for error feedback one that starts from the system's output and works its way back to the input layer so that's shown here in figure one which does not influence neural activity so in other words the global feedback pathway problem backprop creates signals that only affect weights but do not at least directly affect or improve the network the network's representation of the environment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 803.832,
    "end": 806.134,
    "text": " So it seems like a lot of extra steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 807.195,
    "end": 811.378,
    "text": "And then the error signals have a one to one correspondence with neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 811.899,
    "end": 813.46,
    "text": "So we can flip to the next slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 814.101,
    "end": 820.226,
    "text": "So in this paper, the first four of those points are addressed by neural generative coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 820.286,
    "end": 825.15,
    "text": "So everything except the final point, the one to one correspondence between the error signal and the neuron.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 825.655,
    "end": 828.556,
    "text": " So this is the neural generative coding model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 828.656,
    "end": 843.921,
    "text": "So it says the proposed NGC model sidesteps this neurobiologically implausible requirement by learning with short local error transmission pathways that are made possible through recurrent error synapses and stateful neural activities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 844.858,
    "end": 855.742,
    "text": " Credit assignment under neural generative coding operates with local mismatch signals, E1 and E2, that readily communicate this information to their respective layers, Z1 and Z2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 856.502,
    "end": 861.304,
    "text": "So here the black arrows are forward propagation, while the red arrows are backwards transmission.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 861.964,
    "end": 868.487,
    "text": "Solid lines indicate that a signal is transformed along a synapse, while dashed lines indicate direct copying of information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 868.507,
    "end": 871.768,
    "text": "So it's like the identity function, no transformation of the signal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 872.721,
    "end": 876.523,
    "text": " And then the delta shows the communication of the neuron's first derivative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 876.983,
    "end": 883.705,
    "text": "The triangle represents the computed change to the synapse of the forward pass that will use the nearby error signal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 883.805,
    "end": 892.469,
    "text": "And then the dot is the multiplication of incoming signals, which you see those all like we don't see the dot here, but it's in the backprop model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 893.049,
    "end": 893.949,
    "text": "So in the previous one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 894.81,
    "end": 896.61,
    "text": "OK, so that's the model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 896.891,
    "end": 897.871,
    "text": "That's all we're going to talk about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 898.869,
    "end": 920.587,
    "text": " for this so far so far so we're going to see now like what are the different models that they compared against so i'm just going to list them right here um so they used backprop models the regular regularized autoencoder and these are the abbreviations that are used here the gaussian variational autoencoder the constant various constant variance gaussian variational autoencoder",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 922.129,
    "end": 926.872,
    "text": " the adversarial autoencoder, and then the deep sparse rectifier network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 927.012,
    "end": 929.834,
    "text": "And that's purely discriminatively trained.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 930.135,
    "end": 933.077,
    "text": "So I just want to point that out and it will be important as we get later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 933.157,
    "end": 933.837,
    "text": "Just the last one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 934.758,
    "end": 936.539,
    "text": "And then the neural generative coding models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 936.779,
    "end": 943.565,
    "text": "So this is actually the first one is from the like super seminal Rao and Ballard 1999 paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 943.585,
    "end": 946.967,
    "text": "And then also a super seminal paper by Friston in 2008.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 948.388,
    "end": 956.21,
    "text": " And then the later two models, which we'll talk about more in the dot one, are models that are developed by the authors of this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 956.29,
    "end": 961.211,
    "text": "So these G and C and models are both developed by the author.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 961.591,
    "end": 970.654,
    "text": "And then the Gaussian mixture model is like just another classic benchmark model that's not back propagation or the generative code.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 971.254,
    "end": 974.094,
    "text": "It's just a mixture of a Gaussian distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 974.335,
    "end": 975.735,
    "text": "So OK, next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 976.778,
    "end": 978.499,
    "text": " So what can these models do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 978.8,
    "end": 984.244,
    "text": "So generative neural coding can learn viable auto-associative generative models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 984.364,
    "end": 986.285,
    "text": "And let's check out some of the results that they got.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 986.305,
    "end": 988.948,
    "text": "All right, so here we are, table one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 989.148,
    "end": 992.21,
    "text": "So I gave you all the models so that you can kind of see what's over here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 992.67,
    "end": 998.395,
    "text": "So the only ones that are neural generative coding are the GN-CN ones, so the last four.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 998.935,
    "end": 1004.58,
    "text": "And then the first two, the first one's from the Rao paper that says Rao, and then the second one with the sigma is the Fristen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1005.3,
    "end": 1021.49,
    "text": " So we see here the regularized autoencoder autoassociative network least equipped to serve as a data synthesizer has a lower error, lower reconstruction error in terms of binary cross entropy compared to the other backpropagation generative models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1022.29,
    "end": 1041.785,
    "text": " so the other gvae ones and then while the variational autoencoder models yield worse reconstruction than the regularized autoencoder they obtain much better log likelihoods especially compared to the gaussian mixed model baseline indicating that they are strong data samplers",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1042.957,
    "end": 1055.533,
    "text": " And then the neural generative coding models, the ones developed by the authors here, obtain competitive log likelihood with the variational autoencoder models and with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1056.482,
    "end": 1062.785,
    "text": " The GN-CN-PDH yields the best log likelihood of all of them for all four datasets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1063.245,
    "end": 1071.59,
    "text": "And so the datasets that they're talking about here, we're going to see some pictures of them in a little bit, but they're like the number datasets, the MNIST.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1071.61,
    "end": 1072.69,
    "text": "So not all of them are numbers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1072.75,
    "end": 1075.592,
    "text": "So MNIST is like the classic number dataset.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1076.372,
    "end": 1079.514,
    "text": "And then the FMNIST is like pieces of clothes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1080.094,
    "end": 1081.735,
    "text": "And then the Caltech one is like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1082.395,
    "end": 1083.736,
    "text": " I don't know, some strange shapes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1083.796,
    "end": 1085.537,
    "text": "So let's flip to the next one, and maybe it'll show us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1085.597,
    "end": 1086.438,
    "text": "I think it does, actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1086.718,
    "end": 1086.918,
    "text": "Oh, no.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1087.198,
    "end": 1091.201,
    "text": "Let's flip back to figure four so we can look at the data sets, or to figure the next one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1091.301,
    "end": 1092.041,
    "text": "Yeah, and then we'll flip back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1092.261,
    "end": 1093.502,
    "text": "Yeah, let's see the data sets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1093.702,
    "end": 1094.042,
    "text": "There you go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1094.062,
    "end": 1094.382,
    "text": "Perfect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1094.923,
    "end": 1096.104,
    "text": "So sorry, I should have reordered these.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1096.164,
    "end": 1098.085,
    "text": "But you can see, I'm trying to describe these samples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1098.145,
    "end": 1101.147,
    "text": "So this one is like some handwriting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1101.227,
    "end": 1101.667,
    "text": "I'm not sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1101.727,
    "end": 1104.028,
    "text": "Is that a language, Daniel, the K-M-N-I-S-T?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1104.048,
    "end": 1104.349,
    "text": "Do you know?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1104.369,
    "end": 1104.409,
    "text": "No.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1107.959,
    "end": 1108.74,
    "text": " It's not any language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1108.78,
    "end": 1112.101,
    "text": "I was like, is it like, I don't know, is it Chinese, Arabic?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1112.121,
    "end": 1113.882,
    "text": "I can't read it, so I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1114.842,
    "end": 1121.165,
    "text": "But you can see here the MNIST is numbers, the FMNIST is closed, and like the rest are just like symbolic representations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1121.205,
    "end": 1123.486,
    "text": "So just so you guys know, this is what they're looking at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1123.526,
    "end": 1124.827,
    "text": "This is what they're trying to generate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1125.347,
    "end": 1126.968,
    "text": "So then let's go back to figure four.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1130.754,
    "end": 1132.075,
    "text": " Oh, there we go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1133.135,
    "end": 1133.376,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1133.416,
    "end": 1137.358,
    "text": "So figure four, this is the error, the BCE loss measurements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1137.438,
    "end": 1141.4,
    "text": "So lower is better for pattern reconstruction on data subsets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1141.961,
    "end": 1146.684,
    "text": "So this is measured in terms of the percentage of the original database sampled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1146.744,
    "end": 1153.408,
    "text": "So here you can see that the BCE loss, which is like, we want less, less is better for all of the different, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1154.944,
    "end": 1156.325,
    "text": " models here shown.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1156.425,
    "end": 1166.928,
    "text": "So the RAE is blue, the variational is light green, the G-A-N-A-E, that's like another autoencoder, that is dark green.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1167.448,
    "end": 1176.592,
    "text": "And then the three, the pink, purple, and orange are neural generative coding models from Friston and then the two shown here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1176.652,
    "end": 1180.713,
    "text": "So like they're not always, they don't always show every model in every figure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1181.431,
    "end": 1190.256,
    "text": " But you can see here that the error for the three, like the pink, pink, orange, pink, pink, orange is pretty low all the way across the board here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1190.897,
    "end": 1193.939,
    "text": "So I think that that's the important result.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1194.259,
    "end": 1195.76,
    "text": "And then we can flip on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1196.56,
    "end": 1202.003,
    "text": "So neural generative coding also yields strong downstream pattern classifiers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1202.584,
    "end": 1204.505,
    "text": "So let's see how the authors found that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1207.397,
    "end": 1211.401,
    "text": " In table two, in terms of test error, we can see them all here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1211.481,
    "end": 1212.542,
    "text": "So here's the different models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1212.602,
    "end": 1215.624,
    "text": "The DSRN is the discriminatively trained model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1216.204,
    "end": 1218.166,
    "text": "And then that's the autoencoder.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1218.246,
    "end": 1220.688,
    "text": "These are all the back propagation ones, the first four.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1220.808,
    "end": 1229.775,
    "text": "And then the last four are the neural generative coding models, with the final two being the ones used here, developed here by the authors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1230.016,
    "end": 1231.777,
    "text": "So we can see the data sets here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1232.017,
    "end": 1253.802,
    "text": " so the top two of each the top two um pictures in each row are the data sets like from the original data and then the bottom two are generated by um the model so we can see that this is how they are like how they're generating the samples so um here the the bottom two um even the very bottom one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1255.011,
    "end": 1263.139,
    "text": " Oh wait, yeah, the bottom three are competitive with the purely discriminatively trained model, the top one, which has the best output.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1263.86,
    "end": 1268.544,
    "text": "And they outperform all of the generative models, even the DSRN in one case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1268.804,
    "end": 1274.109,
    "text": "So the bottom two models do really well in generating data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1274.45,
    "end": 1274.95,
    "text": "So good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1276.151,
    "end": 1302.561,
    "text": " uh and then figure six i think shows kind of the same thing so in figure 6a this is a t's knee plot of the data and the data clustering so we provide qualitative evidence that the latent representations of neural generative coding this is from the ncn pdh they appear to yield a stronger natural separation of the test data into class respective clusters compared with the back propagation based model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1302.921,
    "end": 1308.385,
    "text": " which was this was the best performing back prop model with respect to log likelihood and reconstruction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1308.986,
    "end": 1312.508,
    "text": "So we can see that there's like a more distinct clustering here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1312.528,
    "end": 1317.132,
    "text": "And I think that that's that's what the authors are saying is the qualitative evidence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1317.832,
    "end": 1324.457,
    "text": "Again, we emphasize that the neuro generative coding model acquired representations without labeled information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1325.017,
    "end": 1329.801,
    "text": "So the class based relationships have emerged as a result of very sparse neural activities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1329.901,
    "end": 1332.203,
    "text": "This is why I like I'm so interested in the sparsity here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1332.903,
    "end": 1346.651,
    "text": " This offers some promising evidence that the neural generative coding models representations offer benefits beyond the original density estimation task, allowing reuse of the same system for downstream tasks like categorization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1348.252,
    "end": 1348.912,
    "text": "Pretty neat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1351.093,
    "end": 1354.335,
    "text": "Then neural generative coding can conduct pattern completion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1354.355,
    "end": 1357.577,
    "text": "We'll click on the next one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1357.877,
    "end": 1361.579,
    "text": "They didn't show the data here, they showed a little bit in the methods.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1362.455,
    "end": 1373.021,
    "text": " But they said that another interesting ability attributed to auto-associative memory models is their ability to complete partially corrupted or incomplete patterns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1373.821,
    "end": 1384.127,
    "text": "And they hypothesized that a neural generative coding model's ability to conduct pattern completion better than the autoencoder models is due to its iterative inference processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1384.507,
    "end": 1388.549,
    "text": "So I'd like to see future work that kind of probes at this a little bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1392.025,
    "end": 1392.705,
    "text": " Thank you, Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1393.546,
    "end": 1394.887,
    "text": "That's super helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1394.947,
    "end": 1395.467,
    "text": "Very nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1395.688,
    "end": 1397.429,
    "text": "Any other comments on the paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1399.19,
    "end": 1399.45,
    "text": "No.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1400.791,
    "end": 1401.091,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1401.932,
    "end": 1420.225,
    "text": "They replaced this time lock, weight transport bound, global feedback constraint setting with a biologically inspired, locally computable, et cetera, et cetera, architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1421.67,
    "end": 1447.903,
    "text": " that is kind of the base case that we're now going to dive into two specifications or elaborations of convolutional first then spike level and then in the fourth paper it's going to come back to mainly blue with the overview of the cognitive architecture okay can you read the abstract for this one sorry",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1449.32,
    "end": 1459.467,
    "text": " In this work, we develop convolutional neural generative coding, ConvNGC, a generalization of predictive coding to the case of convolution-deconvolution-based computation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1460.288,
    "end": 1475.278,
    "text": " Specifically, we correctly implement a flexible neurobiologically motivated algorithm that progressively refines latent state feature maps in order to dynamically form a more accurate internal representation slash reconstruction model of natural images.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1476.059,
    "end": 1486.506,
    "text": "The performance of the resulting sensory processing system is evaluated on complex data sets, such as the color minced, CIFAR-10, and street house view numbers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1487.307,
    "end": 1507.72,
    "text": " We study the effectiveness of our brain-inspired model on the tasks of reconstruction and image denoising and find that it is competitive with convolutional autoencoding systems trained by backpropagation of errors and outperforms them with respect to out-of-distribution reconstruction, including the full 90K CINIC-10 test set.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1510.646,
    "end": 1524.271,
    "text": " thank you so this paper is somewhat similar and related to the previous paper except as promised it's going to generalize it into the convolutional setting so there's also a lot of nice",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1525.672,
    "end": 1544.048,
    "text": " exposition in this paper so it will be good to get some background too introduction then the convolutional neural generative coding model details on the theory and the practice of the experiments about what was tested and done",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1545.089,
    "end": 1568.935,
    "text": " and they summarize contributions as follows one we propose a new neural perception model conv ngc which acquires robust representations of natural images in an unsupervised fashion two to the best of our knowledge this is the first work in the literature where visual inputs are processed using deep deconvolutional layers directly and naturally within a framework of predictive coding",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1569.635,
    "end": 1572.917,
    "text": " significantly enhancing its representation power for vision-based tasks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1573.137,
    "end": 1592.008,
    "text": "And three, we demonstrate on several natural image datasets that the proposed ConvNGC is competitive with existing backprop-based models of similar architectural designs on the tasks of image reconstruction and image denoising and outperforms them with respect to out-of-distribution prediction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1593.129,
    "end": 1598.852,
    "text": "So some of the first sentences of this paper that set the stage really well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1600.111,
    "end": 1618.775,
    "text": " The first sentence begins with backpropagation and highlighting that while it's done well, riding on the tide of increasing power of hardware and software, there are still some limitations associated with backprop-based AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1619.316,
    "end": 1623.316,
    "text": "The field still has a long way to go towards developing artificial general intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1623.777,
    "end": 1625.177,
    "text": "I think it'll be an interesting question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1625.297,
    "end": 1629.158,
    "text": "Is that what this field or who in this field means what by that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1631.033,
    "end": 1660.473,
    "text": " order to increase task level performance the size of deep networks has increased greatly over the years up to hundreds of billions of synaptic parameters as seen in modern day transformer networks this scaling is all you need paradigm increases the number of parameters and the deployment of multiple motifs like transformer architectures attention motifs and so on as well as changing and curing data sets and we are now getting up to models in the 2020s that have billions of parameters",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1662.055,
    "end": 1669.124,
    "text": " However, this trend has started to raise concerns related to energy consumption and more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1670.894,
    "end": 1696.269,
    "text": " energy consumption limited flexibility and generalization limited biological plausibility and this results in some computational constraints and limitations especially around parallelization federation learning all these kinds of settings that we want to have effective algorithms for so people are looking into different methods biologically based and otherwise that speak to different aspects of this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1697.91,
    "end": 1716.602,
    "text": " They write, some of the most promising pathways in addressing all those problems listed previously come from the emerging domain of research known as brain inspired computation, which seeks to develop neural architectures and their respective credit assignment algorithms that leverage only local information motivated strongly by how learning is conducted in the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1717.663,
    "end": 1731.537,
    "text": " the promise of brain-inspired computing brings with it synaptic adjustment mechanisms that are neurobiologically grounded as well as neural computation and inference that is flexible capable of providing a wide variety of operations at biologically more faithful levels",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1732.605,
    "end": 1738.726,
    "text": " facilitating massive algorithmic parallelization at scale and adaption on analog and neuromorphic hardware.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1739.507,
    "end": 1741.687,
    "text": "So it's an interesting discussion topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1742.247,
    "end": 1749.989,
    "text": "What aspects or properties or processes or features or perspectives are we trying to copy about the brain?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1750.829,
    "end": 1759.211,
    "text": "And while we were preparing for this in some open sessions, someone told me about this spy kid's third brain and this kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1760.592,
    "end": 1779.072,
    "text": " designing a brain and what does it mean to really design cognitive architectures what does it mean to consider diverse intelligences how is this related to the kinds of large-scale scientific research projects that are going on in the human brain any thoughts on that blue",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1785.097,
    "end": 1805.608,
    "text": " the end of the introduction they again summarize their contributions that we looked at previously and before we jump in this is from the appendix of the paper here's some key symbol operator abbreviation definitions in table three a little bit of exposure to the symbols we're going to see",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1808.519,
    "end": 1810.66,
    "text": " Section 2, Convolutional Neural Generative Coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1810.94,
    "end": 1822.122,
    "text": "We start by describing our model instantiation of a Convolutional Neural Generative Coding , which is tasked with learning from streams of natural images in an unsupervised fashion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1823.183,
    "end": 1831.805,
    "text": "Typically in a visual recognition task, input patterns belonging to different object classes arranged into batches are presented to a processing system at different time points for training.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1833.311,
    "end": 1839.059,
    "text": " Here, they formalize the problem and give a bit more information on the notation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1841.142,
    "end": 1846.188,
    "text": "CONF NGC is a generalization of the NGC computational framework from 41.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1847.25,
    "end": 1850.514,
    "text": "That was the NCF 22 paper that we just heard about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1851.718,
    "end": 1854.64,
    "text": " generalizing it to the case of natural image data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1855.16,
    "end": 1871.669,
    "text": "So in those other data sets like MNIST and others, every pixel is just passed in of a relatively small image so that the whole image can be taken in as a matrix, like a binary matrix with black and white squares or a grayscale matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1872.549,
    "end": 1879.782,
    "text": " However, real visual data coming in, for example, off of a camera sensor is apt to have a much higher resolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1880.443,
    "end": 1883.228,
    "text": "And so a biologically inspired design pattern",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1884.005,
    "end": 1898.173,
    "text": " that we find in the retina and other kinds of biological visual sensors is this idea of convolution, where a convolving function is used to blur and essentially get a core screening across a high resolution visual input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1899.274,
    "end": 1902.656,
    "text": "The underlying process of conv NGC can be divided into three components.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1903.436,
    "end": 1928.696,
    "text": " local prediction and error unit map calculation latent state map correction and local synaptic adjustment so this is drawing on the architecture and the motifs that were introduced previously bringing in convolution so that natural images can be addressed here's the conv ngc model it consists of a set of l predictive layers",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1930.131,
    "end": 1951.765,
    "text": " typically arranged hierarchically though this is not a strict architectural requirement eg figure one depicts a non-hierarchical NGC circuit so that was figure one here's figure two which is I guess a more hierarchically structured conf NGC with three layers",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1957.819,
    "end": 1960.941,
    "text": " Section three goes into more detail on this model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1961.481,
    "end": 1975.17,
    "text": "In this section, we provide concrete implementation details of the neural coding process described earlier, depicting how layer-wise state prediction, state correction, and synaptic parameter updating occurs specifically in the context of visual object reconstruction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1976.391,
    "end": 1984.956,
    "text": "The first two steps of the algorithm, iteratively predicting correct representations of the CONT-NGC model for observed input values, natural images of the current dataset.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1986.696,
    "end": 1992.799,
    "text": " After T iterations, the final step entails adjusting model synaptic efficacies using simple Hebbian-like updates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1993.279,
    "end": 1995.04,
    "text": "So these are the three main steps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1995.14,
    "end": 2001.243,
    "text": "There's a two-stroke engine with prediction and correction, kind of like an expectation maximization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2001.703,
    "end": 2008.746,
    "text": "And then after a certain number of iterations T, there's the adjustment of synaptic efficacies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2009.106,
    "end": 2011.808,
    "text": "So here is from the appendix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2012.568,
    "end": 2014.809,
    "text": "This is the pseudocode of the algorithm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2020.126,
    "end": 2023.008,
    "text": " Section 3.1, inference, predicting and correcting neural states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2023.568,
    "end": 2028.932,
    "text": "Going through those steps, layer-wise state map prediction and state map correction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2028.972,
    "end": 2031.434,
    "text": "Then 3.2, training, updating the model's parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2033.315,
    "end": 2037.178,
    "text": "Having described the model, essentially, they go to section four, the experiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2038.51,
    "end": 2057.68,
    "text": " We compare ConvNGC to powerful back-prop based models such as the convolutional autoencoder, denoising convolutional autoencoder, as well as the fully connected form of neural generative coding, which under certain conditions recovers the unsupervised form of the model in 55, which is Salvatore et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2057.84,
    "end": 2061.582,
    "text": "hierarchical predictive coding network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2063.823,
    "end": 2067.485,
    "text": "Details are provided about the data sets used.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2068.78,
    "end": 2079.996,
    "text": " And tables 1 and 2 provide some performance measures evaluated in terms of mean squared error, structural similarity index measures, and peak signal-to-noise ratios.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2082.399,
    "end": 2085.884,
    "text": "One can look to the tables to see where the different models do well or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2088.54,
    "end": 2090.841,
    "text": " Here are figures four and three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2091.801,
    "end": 2095.642,
    "text": "Figure three shows an image randomly sampled from a dataset.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2096.002,
    "end": 2097.982,
    "text": "Left, the same image corrupted with noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2098.602,
    "end": 2110.625,
    "text": "So here's the original image, a five and some kind of object, and then a digitally corrupted version with a normally distributed noise term added.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2111.205,
    "end": 2115.326,
    "text": "And then after processing, this is the denoised image.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2117.639,
    "end": 2118.299,
    "text": " That's figure three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2118.719,
    "end": 2123.3,
    "text": "Figure four, feature maps for the bottom three layers of a trained ConvNGC model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2124.481,
    "end": 2128.282,
    "text": "So this just shows a little bit of kind of the inner workings of the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2130.502,
    "end": 2137.544,
    "text": "And surprisingly, with respect to the out of distribution experiments, OOD, ConvNGC outperforms all the baseline models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2139.417,
    "end": 2148.545,
    "text": " This desirable improvement is indicated by the higher trial averaged out-of-distribution peak signal-to-noise ratio, as well as the structural similarity scores.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2150.026,
    "end": 2165.84,
    "text": "What is most impressive is that the CONV-NGC model was trained on natural images in the housing numbers dataset that did not contain any of the objects found within either CIFAR-10 and CINIC-10 and was still able to reconstruct with top performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2166.801,
    "end": 2181.791,
    "text": " This result offers a promising future direction worth exploring for conv NGC and NGC predictive coding systems in general, their ability to generalize to unseen patterns that violate the assumption that they were generated by a distribution similar to that of a training data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2182.291,
    "end": 2184.213,
    "text": "So this is, I think, going to be an interesting discussion point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2184.593,
    "end": 2193.219,
    "text": "It's kind of like if you classified a visual detector based upon only a data set with a certain kind of edge or surface,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2194.019,
    "end": 2221.971,
    "text": " then it's possible that the model wouldn't learn more general features of edges and surfaces it might be able to use a back propagation type updating credit assignment paradigm so that something really really high level and abstract like whether it's a cat or a dog could be tagged with something very micro which is overfit to cats versus dogs or even more locally like that cat versus that dog data set",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2222.771,
    "end": 2250.234,
    "text": " And so potentially constraining to these local connections only making a kind of enforced sparsity means that the messages that get passed are not just more biologically plausible and fewer of them, but potentially they extract features more like the visual system does in terms of extracting generalized edges and features through lower level",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2251.55,
    "end": 2258.717,
    "text": " features that kind of percolate up into higher level features in a really methodical way, which is why we can recognize a shape that we've never seen before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2259.71,
    "end": 2261.971,
    "text": " So in conclusion, here's the whole conclusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2262.671,
    "end": 2270.996,
    "text": "Our results mark an important step towards crafting more robust general brain inspired neural architectures and learning processes capable of handling complex machine learning tasks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2271.696,
    "end": 2274.617,
    "text": "So some questions for discussion are written here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2275.438,
    "end": 2280.78,
    "text": "And there are three very informative appendices in this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2281.401,
    "end": 2286.023,
    "text": "So for more detail, if you think this is cool, definitely read the paper, check out the appendices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2288.422,
    "end": 2290.223,
    "text": " Onto the third paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2291.504,
    "end": 2292.445,
    "text": "This is SNPC23.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2292.485,
    "end": 2293.846,
    "text": "Want to add anything on that, Blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2295.827,
    "end": 2299.03,
    "text": "Spiking neural predictive coding for continually learning from data streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2301.872,
    "end": 2302.913,
    "text": "Do you want to read the abstract?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2304.994,
    "end": 2305.214,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2306.135,
    "end": 2317.183,
    "text": "For energy-efficient computation in specialized neuromorphic hardware, we present spiking neural coding, an instantiation of a family of artificial neural models grounded in the theory of predictive coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2317.984,
    "end": 2329.896,
    "text": " This model, the first of its kind, works by operating in a never-ending process of guess and check, where neurons predict the activity values of one another and then adjust their own activities to make better future predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2330.603,
    "end": 2347.956,
    "text": " The iterative, interactive nature of our system fits well into the continuous time formulation of sensory stream prediction and, as we show, the model structure yields a local synaptic update rule, which can be used to complement or as an alternative to online spike timing dependent plasticity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2348.736,
    "end": 2354.861,
    "text": "In this article, we experiment with an instantiation of our model consisting of leaky integrate and fire units.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2357.13,
    "end": 2364.678,
    "text": " However, the framework within which our system is situated can naturally incorporate more complex neurons, such as the Hodgkin-Huxley model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2365.759,
    "end": 2374.067,
    "text": "Our experimental results in pattern recognition demonstrate the potential of the model when binary spike trains are the primary paradigm for interneuron communication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2374.668,
    "end": 2379.553,
    "text": "Notably, spiking neural coding is competitive in terms of classification performance",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2380.02,
    "end": 2390.224,
    "text": " and experiences less forgetting when learning from a task sequence, offering a more computationally economical, biologically motivated alternative to popular artificial neural networks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2391.485,
    "end": 2391.805,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2392.325,
    "end": 2392.705,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2394.486,
    "end": 2397.487,
    "text": "Okay, here's the roadmap and a key piece of this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2397.527,
    "end": 2406.091,
    "text": "So they start with the introduction, then go to the methodology, define the problem really well, and introduce the spiking neural coding framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2406.963,
    "end": 2410.404,
    "text": " in order to implement this kind of continual error correction from the spike trains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2411.204,
    "end": 2415.286,
    "text": "Section 3 covers the experimental results, simulations, and limitations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2415.426,
    "end": 2417.687,
    "text": "Then there's a conclusion and an appendix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2418.747,
    "end": 2430.031,
    "text": "They write, in this paper, we propose spiking neural coding as well as a concrete model instantiation that is composed of leaky integrate and fire neurons and its learning process for adjusting synaptic weight strengths incrementally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2430.951,
    "end": 2438.017,
    "text": " Although we only examined one kind of spiking neuron, our general framework can accommodate simulated neural models of varying complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2438.897,
    "end": 2447.264,
    "text": "So it's going to be a simple version of spiking with a binary spike train and a leaky integrate and fire neuron.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2447.984,
    "end": 2448.345,
    "text": "However,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2449.488,
    "end": 2453.213,
    "text": " There's even sub-generalizations within this spiking paradigm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2453.954,
    "end": 2460.323,
    "text": "So just as a kind of reminder, we introduced the general local compute only predictive coding architecture in the first paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2461.144,
    "end": 2464.369,
    "text": "Second paper looked into the convolutional generalization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2465.33,
    "end": 2479.566,
    "text": " both the first and the second paper though were trained in essentially batch mode training data sets were loaded in and they were trained in a sort of batch based approach here through this spiking mechanism",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2480.492,
    "end": 2493.359,
    "text": " think about a trace through time and spikes happening along that timeline, the data are coming in, not in a batch that the computer gets to process at the kind of pace or way it wants, but rather the data are coming in real time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2494.059,
    "end": 2505.186,
    "text": "So this generalization is much more fit to both the real time, like internet of things, semantic spatial web setting, but also the biological perception setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2507.267,
    "end": 2509.088,
    "text": "Here, there's a similar introduction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2510.427,
    "end": 2522.075,
    "text": " Instead of just harping on backprop though, artificial neural networks, ANNs, are the models which are described in terms of being very large and powerful, but with challenges.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2522.876,
    "end": 2534.604,
    "text": "And surprise, surprise, people are using brain-inspired computing to formalize and implement various kinds of neural computation and learning mechanisms currently known in cognitive neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2535.245,
    "end": 2535.325,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2536.025,
    "end": 2554.778,
    "text": " only bring a few of these onto the slides but i have been taking many sections of text and passing it through different image generators so it's always fun to like see visual semantics of what sometimes these otherwise really wordy sections are about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2555.703,
    "end": 2577.879,
    "text": " so section two 2.1 problem definition continually predicting sensory stream inputs so this is the key difference spiking is a motif or an architecture that is going to enable us to move from the batch based setting to the real time or the online setting the neural agents that we are ultimately concerned with process sensory stimuli",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2579.093,
    "end": 2581.934,
    "text": " which are sampled from an environment or a stochastic process over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2582.254,
    "end": 2589.677,
    "text": "So here we see a really nice connection to epistemic foraging, information foraging in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2590.558,
    "end": 2598.801,
    "text": "And here are some specifications of what is meant by that, and also more about the data stream formulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2599.581,
    "end": 2602.122,
    "text": "It still treats each data point as a discrete element.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2602.642,
    "end": 2608.105,
    "text": "The spiking neural networks are intended to process input stimuli that arrive with a continuous flow of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2609.205,
    "end": 2618.089,
    "text": " In order to truly adapt the above stream to the spiking neural net, we further generalize the settings so that each tuple is presented to the learner for a fixed period of simulated time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2619.329,
    "end": 2624.611,
    "text": "And the length of the stimulus and inter-stimulus times will vary depending on the data problem and application.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2625.451,
    "end": 2629.093,
    "text": "So it's not the case that it's just an infinitely short flash.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2630.399,
    "end": 2654.726,
    "text": " it's the case that it's there for a defined amount of time kind of like a video frame so if a video is 25 or 30 frames per second then that is in this sort of 30 to 50 milliseconds range of presentation of a given stimuli so that allows the connection between the frequency of the regularities in the pattern in the environment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2655.339,
    "end": 2664.503,
    "text": " to be connected to the rate of updating and of like the real biophysics of neuronal membranes or of some neuromorphic computer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2664.523,
    "end": 2670.125,
    "text": "2.2 gives a mechanistic description of the spiking neural coding network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2671.486,
    "end": 2673.327,
    "text": "So this is the spiking-based generalization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2674.027,
    "end": 2675.748,
    "text": "More formalisms and information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2676.688,
    "end": 2678.609,
    "text": "Here's what it looks like in figure one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2679.714,
    "end": 2698.903,
    "text": " two layer spiking neural coding network architecture we see a lot of motifs from the previous papers this kind of local loop and the ease and disease green diamonds indicate the error units e which in this simplified model depiction compute the amount of mismatch between the current predictions which are the z's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2701.179,
    "end": 2721.572,
    "text": " of sub mu and the target signal traces z's of t variables s represent the binary spike outputs of a particular vector grouping of neural units at time t so more formalisms are provided and just like the last paper there is an algorithm in the appendix here's what the sp and cn algorithm looks like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2724.704,
    "end": 2727.345,
    "text": " Figure two, I'm just overlaying figure one just on top.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2727.405,
    "end": 2736.329,
    "text": "It's not meant to overlay it directly, but just to remember that this is the kind of architecture that spike trains are being passed through or are occurring within.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2736.669,
    "end": 2743.312,
    "text": "So figure two is showing these kind of biologically reasonable, despite the simple integrate and fire model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2744.898,
    "end": 2749.503,
    "text": " traces, kind of like a single neuron recording from inside of this little in silico brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2750.744,
    "end": 2754.428,
    "text": "Section three, in silico results with the model simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2755.329,
    "end": 2760.274,
    "text": "First, they looked at the MNIST, the digit classification data set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2761.155,
    "end": 2771.918,
    "text": " They presented two sets of experiments that tested the SP-NCN's ability to generate and classify patterns, as well as its ability to retain knowledge over task sequence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2771.978,
    "end": 2773.379,
    "text": "And the appendix has more experiments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2773.939,
    "end": 2779.22,
    "text": "So table one, two, and three have different evaluations and scores.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2779.681,
    "end": 2790.344,
    "text": "And then also just like the t-SNE that Blue mentioned in the first paper, here's a t-SNE now of the SP-NCN with access to MNIST training upfront.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2791.365,
    "end": 2819.265,
    "text": " in the middle the continual SP-NCN and a continual SP-NCN with a buff versus the lat so we'll go into more detail with these sub-variants but here we can see that this real-time learning is actually recapitulating similar structure and near enough similar learning performance as batch learners which is a big theme of the paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2820.669,
    "end": 2849.65,
    "text": " so here is a figure five showing task accuracy normalized to zero one over proportion of a current task data and so on the x-axis is the portion of the task completed on the y-axis is the accuracy range so here it's shown for the three spncn variants but that was done for not just one data set but that was actually done for a whole set of data sets in figure five",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2850.566,
    "end": 2861.035,
    "text": " And so the big takeaway from this whole figure is that SP-NCN obtains competitive cross-task performance even though it is trained online.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2861.975,
    "end": 2868.781,
    "text": "It only processes data patterns once, whereas to obtain top performance, rate-coded baselines were trained on each task for multiple epoch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2870.022,
    "end": 2870.382,
    "text": "Pretty cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2871.123,
    "end": 2875.667,
    "text": "And then figure four, again, is a t-SNE layout of these different model variants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2878.147,
    "end": 2880.109,
    "text": " 3.2 describes some limitations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2880.63,
    "end": 2881.851,
    "text": "And then the conclusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2882.612,
    "end": 2892.284,
    "text": "In this paper, we propose spiking neural coding, as well as a concrete model instantiation composed of leaky integrate and fire neurons and its learning process for adjusting synaptic weight strengths incrementally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2893.271,
    "end": 2900.456,
    "text": " Pattern classification and continual learning experiments demonstrate the generalization ability of our model in the realm of online continuous time-based learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2901.517,
    "end": 2910.723,
    "text": "And the model is competitive with many spiking neural networks learned with spike time dependent plasticity, STDP, or other mechanisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2911.143,
    "end": 2918.708,
    "text": "Further, our model exhibits better computational economy and is more biologically plausible than modern day non-spiking artificial neural networks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2919.228,
    "end": 2921.59,
    "text": "And then it'll be cool to discuss future work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2923.531,
    "end": 2941.917,
    "text": " to kind of close this paper and head into our fourth one we started with a big picture with predictive coding things we've talked about in many live streams we just heard in the last two papers the convolutional extension which enables higher resolution naturalistic images",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2942.757,
    "end": 2970.082,
    "text": " and then this spiking variant which brings it into the setting of real-time online learning through spiking which also has lower energy requirements than non-spiking neural networks and now back to blue for the fourth paper cog and gen building the kernel for a hyperdimensional predictive processing cognitive architecture cool thanks daniel that was neat",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2970.808,
    "end": 2972.449,
    "text": " Do you want to read this abstract?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2972.829,
    "end": 2973.009,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2974.409,
    "end": 2980.111,
    "text": "We present a new cognitive architecture that combines two neurobiologically plausible computational elements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2980.451,
    "end": 2989.074,
    "text": "One, a variant of predictive processing known as neural generative coding, NGC, and two hyperdimensional slash vector symbolic models of human memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2990.194,
    "end": 2998.398,
    "text": " We draw inspiration from well-known cognitive architectures such as ACT-R, SOR, LIABRA, and SPOUNENGO.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2999.598,
    "end": 3017.127,
    "text": "Our cognitive architecture, the Cognitive Neural Generative System is in broad agreement with these architectures but provides a level of detail between ACT-R's high-level symbolic description of human cognition and SPOUN's low-level",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3018.007,
    "end": 3019.528,
    "text": " neurobiological description.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3020.148,
    "end": 3031.754,
    "text": "Cogngen creates the groundwork for developing agents that learn continually from diverse tasks and model human performance at larger scales than what is possible with existent cognitive architectures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3032.954,
    "end": 3041.419,
    "text": "We aim to develop a cognitive architecture that has the power of modern machine learning techniques while retaining long-term memory, single trial planning, transfer learning, planning,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3042.119,
    "end": 3044.4,
    "text": " and other capacities associated with high-level cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3044.9,
    "end": 3057.923,
    "text": "We test COG and GEN on a set of maze learning tasks, including mazes that test short-term memory and planning and find that the synergy between its predictive processing and vector symbolic components allow it to master the maze tasks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3058.624,
    "end": 3066.646,
    "text": "Future work includes testing COG and GEN on more tasks and exploring methods for efficiently scaling hyperdimensional memory models to lifetime learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3069.721,
    "end": 3069.921,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3070.101,
    "end": 3070.622,
    "text": "Thanks so much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3071.643,
    "end": 3082.133,
    "text": "So unlike the first paper where we talked very little about the model and a lot about the tests and results, we're going to talk a lot about the model and very little about the tests and results in this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3082.614,
    "end": 3085.337,
    "text": "So kind of dive a little bit deeper in here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3085.357,
    "end": 3086.778,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3086.798,
    "end": 3088.5,
    "text": "Do you want to flip through to the next one?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3089.48,
    "end": 3111.27,
    "text": " All right, so the authors claim they propose a cognitive architecture that is built on two neurobiologically and cognitively plausible models, namely a variant of predictive processing known as neural generative coding from this 2020 paper, which we did not go into here today, and vector symbolic, also known as hyperdimensional models of memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3111.29,
    "end": 3116.972,
    "text": "And we're going to talk a lot about this Hintzman 1986 model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3117.012,
    "end": 3118.033,
    "text": "It's called Minerva 2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3118.96,
    "end": 3137.655,
    "text": " and then a few other references here okay so this is the common model of cognition and this is like a conglomeration of all these different references that are here in the legend um and it just shows like there's some commonalities that go like across different",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3138.536,
    "end": 3161.224,
    "text": " um cognition system models okay so you have declarative long-term memory um also that's associated with the hippocampus and the temporal lobe and here that's achieved with minerva ii there is working memory which is the frontoparietal network they did this with minerva ii or the self-recurrent slot buffer",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3162.112,
    "end": 3164.373,
    "text": " which we'll talk about later, later, later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3165.393,
    "end": 3173.557,
    "text": "And then there's procedural memory that's associated with the basal ganglia done with neural generative coding here, perception and action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3173.657,
    "end": 3179.339,
    "text": "So finally we get to perception and action after, you know, are we an hour deep so far or an hour in?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3179.759,
    "end": 3181.88,
    "text": "So finally we're here at perception and action, we've arrived.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3182.86,
    "end": 3187.502,
    "text": "So the perception is the sensory cortices and action is the motor cortex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3187.642,
    "end": 3190.984,
    "text": "And both of these are achieved with the neural generative coding model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3192.681,
    "end": 3193.341,
    "text": " Next slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3197.283,
    "end": 3197.523,
    "text": "Cool."
  },
  {
    "start": 3197.943,
    "end": 3198.183,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3198.423,
    "end": 3201.565,
    "text": "So we talk about a lot of neural building blocks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3202.085,
    "end": 3207.347,
    "text": "I mean, I think that we just went through kind of all of the cognitive architecture building blocks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3208.467,
    "end": 3212.629,
    "text": "And here, just to kind of get into the model a little bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3212.689,
    "end": 3215.31,
    "text": "So this first equation one is at the top right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3215.85,
    "end": 3216.13,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3216.21,
    "end": 3220.772,
    "text": "So given an input output pair of sensory vectors, XI and XO,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3221.252,
    "end": 3240.547,
    "text": " where x is the x i is the input and x o is the output the circuit clamps the last layer z l so you see that up here in equation one to the input and clamps the first layer z zero to the output once clamped",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3241.485,
    "end": 3249.212,
    "text": " The neural generative coding circuit will undergo a settling cycle where it processes the input and output vectors for k steps in time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3249.772,
    "end": 3254.397,
    "text": "So it processes sensory signals over a stimulus window of k discrete time steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3254.577,
    "end": 3256.879,
    "text": "So that's just kind of like a broad overview of how",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3257.594,
    "end": 3258.575,
    "text": " The system is working.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3258.595,
    "end": 3270.044,
    "text": "E is a matrix with error synapses that passes mismatched signals across the layers from L minus one to L. And then let's look.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3270.364,
    "end": 3280.092,
    "text": "So beta is the neural state update coefficient that's set according to one over tau, where tau is the integration time constant in the order of milliseconds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3280.752,
    "end": 3308.083,
    "text": " so here you can see that this update equation indicates that a vector of neural activity changes at each step within a settling cycle according to from left to right in equation one a leak term modulated by gamma the bottom pressure from mismatched signals in lower level regions and a top-down pressure from the neural region above so that's kind of how this algorithm is working in a in a short summary kind of way okay do you want to flip to the next one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3310.41,
    "end": 3313.931,
    "text": " Okay, so neural building blocks, adding to memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3314.091,
    "end": 3317.492,
    "text": "So this is this reference that I told you we were going to talk a lot about, 1984.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3317.532,
    "end": 3321.313,
    "text": "I think it said 1986 somewhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3321.333,
    "end": 3323.073,
    "text": "Maybe there's like an updated model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3324.013,
    "end": 3329.575,
    "text": "But Minerva 2 stores memory traces, observations, or sequences of observations of the state of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3330.235,
    "end": 3333.856,
    "text": "Each memory trace is represented as an array of real numbers, a vector.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3334.596,
    "end": 3339.957,
    "text": "Minerva 2 stores all memory traces separately as rows in a continuously growing table.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3340.526,
    "end": 3354.394,
    "text": " we use Minerva 2's forgetting mechanism, oh, that's the 1986 reference, to randomly delete values from memory each time memory is updated at sufficiently high probability to impose a computationally tractable limit on the size of the memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3354.434,
    "end": 3361.718,
    "text": "So if there was no forgetting, there would be, like, this would be an impossible problem, just an impossible method by which to store the memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3361.738,
    "end": 3363.339,
    "text": "Okay, next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3367.262,
    "end": 3370.364,
    "text": " So this is how you get things out of memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3371.485,
    "end": 3375.267,
    "text": "So in Minerva 2, memory retrieval is not a lookup process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3375.367,
    "end": 3377.068,
    "text": "It's a reconstruction process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3377.329,
    "end": 3388.696,
    "text": "So when a retrieval cue or a probe is presented, like the smell of chocolate chip cookies, each vector in the memory table is activated in proportion to its similarity to the cue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3389.389,
    "end": 3394.316,
    "text": " So similarity is computed as a normalized dot product of the Q's vector with the stored vector.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3394.716,
    "end": 3405.371,
    "text": "So every stored vector is activated by its similarity to the probe raised to a power, and by raising the similarity to some power, the contribution of the most similar vectors is emphasized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3406.538,
    "end": 3410.081,
    "text": " And then this is what I was talking about at the very beginning, about an echo.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3411.001,
    "end": 3415.565,
    "text": "So it says here, an echo is retrieved from memory as a weighted sum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3416.105,
    "end": 3417.666,
    "text": "So that's this equation in the top right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3417.986,
    "end": 3430.976,
    "text": "So where ME is the echo or the output from memory, MI is the ith trace in memory, MP is the probe or input to memory, and M is the number of traces in the memory table.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3432.737,
    "end": 3441.181,
    "text": " And so we're gonna look in the next slide about, so is prediction just an echo from memory?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3441.781,
    "end": 3443.942,
    "text": "So we're gonna look at that maybe here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3444.222,
    "end": 3445.023,
    "text": "Oh yeah, it's here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3445.603,
    "end": 3450.625,
    "text": "So it says, in CoggenGen, we combine insights from several versions of Minerva 2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3450.906,
    "end": 3454.627,
    "text": "We make an architecture-wide commitment to predict then correct learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3455.188,
    "end": 3459.47,
    "text": "Predict then correct can be implemented in Minerva 2 as discrepancy in coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3460.109,
    "end": 3466.051,
    "text": " Given a sequence of observations, Minerva 2 can predict the next observation based on past experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3466.792,
    "end": 3468.972,
    "text": "After the prediction, a new observation is made.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3469.413,
    "end": 3474.855,
    "text": "We update memory with the difference between observation Mx and prediction Me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3475.355,
    "end": 3476.615,
    "text": "So wasn't that just an echo?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3477.076,
    "end": 3479.076,
    "text": "Is prediction an echo from memory?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3479.096,
    "end": 3481.397,
    "text": "I think that that's what they're saying here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3484.245,
    "end": 3496.577,
    "text": " Mx minus Me, so observation minus prediction, such that if the prediction is correct, no change is made to memory, whereas if the prediction is wrong, that prediction is inhibited in similar future contexts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3497.964,
    "end": 3499.265,
    "text": " This is awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3500.266,
    "end": 3507.674,
    "text": "I love that you're pulling on this kind of echo and prediction and memory because it's also related to how we learn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3508.235,
    "end": 3520.567,
    "text": "Like, we predict then correct, and that's kind of like the prepare, measure, learn, quantum information, quantum FEP connection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3521.781,
    "end": 3545.434,
    "text": " then how how rich could a learning experience be if we predicted what do you think the next slide's gonna be like and then i learn about you i learn about the paper and then no skin in the game it comes up i was off because i didn't know you learn that's the update and then you learn on the learning so there's no end to how many layers you could learn with just like one data point",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3547.133,
    "end": 3548.694,
    "text": " Right, like what's my prediction of the next slide?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3548.714,
    "end": 3552.676,
    "text": "I theoretically have that in my memory as an echo somewhere, but it's not coming to mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3552.736,
    "end": 3553.957,
    "text": "So we'll find out when we get there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3553.977,
    "end": 3557.479,
    "text": "All right, here we go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3558.7,
    "end": 3560.801,
    "text": "So short-term versus long-term memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3561.921,
    "end": 3569.546,
    "text": "So for CoggenGen, we adopt Collins et al's 2020 approach and model both working and declarative memory using Minerva2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3570.524,
    "end": 3573.886,
    "text": " Our working Minerva 2 is cleared after a task is completed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3574.366,
    "end": 3575.827,
    "text": "For example, a maze is solved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3576.247,
    "end": 3586.213,
    "text": "Whereas the contents of the declarative Minerva 2, which serves as the episodic memory in this paper's instantiation of CoggenGen, persist across tasks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3586.593,
    "end": 3590.115,
    "text": "So there's some memory clear when the task is over.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3591.189,
    "end": 3613.4,
    "text": " yeah short-term memory that gets cleared after like each example like each question on a test each maze but then the declarative way of knowing is being kept episodically so like a memory of solving that maze is stored declaratively but each maze is each only being addressed with the working memory so it's cool",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3615.529,
    "end": 3619.358,
    "text": " So there's not a lot here in the perception place, so...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3621.809,
    "end": 3627.27,
    "text": " They say that the environment that they investigate, which is gym mini grid, which is an open AI environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3627.29,
    "end": 3630.831,
    "text": "So if you guys are interested, you can go check out open AI gym mini grid.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3631.771,
    "end": 3636.592,
    "text": "But it provides a fixed problem specific encoder FE and decoder FG.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3637.192,
    "end": 3648.054,
    "text": "So they use a fixed encoding and decoding scheme to simplify the simulation and future work is going to investigate learning the perception modules as neural generative coding circuits instead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3648.514,
    "end": 3650.214,
    "text": "So they didn't do that for this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3650.794,
    "end": 3676.512,
    "text": " paper next paper that's coming okay so neural generative procedural memory action selection is driven by changes in the neural activity of basal ganglia which estimate the value of the expected reward and these authors were motivated by the finding of expected value estimation in the brain so they made the cog and jen's procedural module implement a neural circuit neural circuit",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3677.092,
    "end": 3679.615,
    "text": " that produces intrinsic reward signals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3679.875,
    "end": 3690.847,
    "text": "At a high level, this neural machinery facilitates some of the functionality offered by the basal ganglia and procedural memory, simulating an internal reward creation process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3691.937,
    "end": 3720.232,
    "text": " so they say we implement a neural generative coding dynamics model from which a reward signal is calculated as a function of its own error neurons we couple the dynamics model with a short-term memory module based on minerva 2 which adjusts the reward value produced by the dynamic circuit by determining if an observed state is familiar or not yeah and then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3721.386,
    "end": 3746.233,
    "text": " just you're lagging you're gonna see that in a figure in the next figure okay i'm gonna let your internet just return okay i shut off my video okay okay yeah the only comment on this is um this idea of the intrinsic reward signal happening from a procedural module yeah i'm good can you hear me yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3747.426,
    "end": 3773.284,
    "text": " so it's like epistemic foraging you have a procedure for foraging and then there's an intrinsic reward even arising just by carrying out the procedure which might be the predict and learn and reflect dot zero dot one dot two with an intrinsic smooth reward signal rather than kind of a needle in the haystack more like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3775.799,
    "end": 3777.421,
    "text": " being just in a continuous flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3779.442,
    "end": 3780.083,
    "text": "Is your internet back?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3783.686,
    "end": 3784.107,
    "text": "I think so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3784.127,
    "end": 3784.467,
    "text": "Can you hear me?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3784.908,
    "end": 3785.508,
    "text": "Okay, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3785.588,
    "end": 3786.529,
    "text": "Figure three, then continue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3786.829,
    "end": 3787.93,
    "text": "Okay, now you can hear me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3788.211,
    "end": 3788.371,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3788.511,
    "end": 3789.292,
    "text": "Okay, perfect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3789.772,
    "end": 3790.833,
    "text": "I just I turned off my video.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3790.873,
    "end": 3793.656,
    "text": "So if I get the flash again, I'll turn it off because sometimes it's easier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3793.676,
    "end": 3795.017,
    "text": "Okay, figure three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3796.786,
    "end": 3797.146,
    "text": " Perfect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3797.847,
    "end": 3817.176,
    "text": "So, and just what you were saying about the intrinsic reward before I delve into figure three, they did talk a little bit in this paper, and I don't know if I pushed it into here, but maybe we'll get into it in the dot two, but they did talk about trying to push exploration via an intrinsic reward signal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3817.716,
    "end": 3823.699,
    "text": "So we can kind of get into that exploration exploitation discussion in the dot two a little bit more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3824.159,
    "end": 3824.299,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3824.759,
    "end": 3854.003,
    "text": " so figure three the kagen gen dynamics model um it says that arrows transform data across across synapses um and then the gray circles represent stateful neurons and the green diamonds represent error neurons so this is um the multi-layer uh model that we're looking at here with an external input and z of t",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3855.973,
    "end": 3857.574,
    "text": " And we can see the layers across time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3857.614,
    "end": 3861.016,
    "text": "So I think maybe it says more in the next slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3861.096,
    "end": 3861.456,
    "text": "Let's see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3862.696,
    "end": 3873.522,
    "text": "So building upon the notion of planning as inference, we generalized neural generative coding to the case of action-driven tasks, which we call active neural generative coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3874.322,
    "end": 3883.927,
    "text": "Notably, within the neural generative coding action motor model is a modifiable working memory that allows the model to store a finite quantity of projected latent state vectors",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3884.565,
    "end": 3887.567,
    "text": " into a set of self-recurrent memory vector slots.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3888.227,
    "end": 3897.753,
    "text": "This particular working memory module, which we call the self-recurrent slot buffer, serves as the glue that joins the models of Cog and Gen together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3897.953,
    "end": 3903.777,
    "text": "So we talked, we heard about the slot buffer a long time ago, and here we are back to the slot buffer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3905.097,
    "end": 3909.38,
    "text": "And then in the next figure, we're going to look at the action-driven task in the next figure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3911.363,
    "end": 3911.743,
    "text": " Perfect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3912.384,
    "end": 3918.307,
    "text": "So this is the motor model where the internal control portion produces signals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3919.108,
    "end": 3926.232,
    "text": "Those are the CINT that manipulate working memory and the external control portion transmits signals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3926.593,
    "end": 3930.595,
    "text": "So this is the CEXT down at the bottom that affects the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3930.695,
    "end": 3937.62,
    "text": "And so both the internal and external control share the same working memory, which is interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3943.251,
    "end": 3946.734,
    "text": " So explicit declarative memory, episodic memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3948.095,
    "end": 3954.801,
    "text": "So CoggenGen implements a replay mechanism in the form of an episodic memory constructed with Minerva.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3955.541,
    "end": 3965.73,
    "text": "Information is transferred to memory through an intermediate working buffer where pieces of the transition are progressively stored as they are encountered through the agent environment interaction process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3966.795,
    "end": 3974.418,
    "text": " We do not update the motor action and dynamics models online, but instead update their parameters only when episodic memory is sampled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3974.958,
    "end": 3983.281,
    "text": "Thus, the Cog and Gen computational process has two phases at each time step of the simulation, the processing step and the learning step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3984.081,
    "end": 3985.301,
    "text": "And so we'll see figure two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3985.321,
    "end": 3986.702,
    "text": "I think I have it next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3990.41,
    "end": 4011.116,
    "text": " yeah perfect i reordered them because um they were mentioned in in different orders in the um in the paper so daniel showed this to us earlier um do you want to maybe talk a little bit about this figure while i go grab my computer plug yeah do you mind cool well",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4012.691,
    "end": 4032.066,
    "text": " few ways to look at it one of them is we're dealing with this fundamental interface question blanket question boundary question which is how we begin in active inference and free energy principle about the agent in their boundedness interfacing with the environment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4033.157,
    "end": 4050.002,
    "text": " And then while we might see this in a partially observable Markov decision process generative model, here we basically see the formalism from the last several papers, this paper specifically, being represented",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4050.902,
    "end": 4073.177,
    "text": " in the way that we've seen agent environment interface before observation coming in at time step t latent space here it's actually a more sophisticated latent space it's not just like one gaussian parameter that's getting updated there's this entire dialectic with the procedural and the working memory and the episodic all these cognitive features and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4073.897,
    "end": 4095.767,
    "text": " there is motor or action control action is emitted within the time step and then there's the observation at the next time step so this is a cognitive architecture that brings together a lot of the features that we've been talking about plus these higher order structured purely cognitive aspects",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4097.742,
    "end": 4098.323,
    "text": " Thank you so much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4100.224,
    "end": 4101.265,
    "text": "My computer thinks as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4101.966,
    "end": 4113.636,
    "text": "So I'm curious here in this model how things get from the working memory into the episodic memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4114.176,
    "end": 4119.321,
    "text": "So I would like to see maybe more details about that as we go into the dot 2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4123.184,
    "end": 4123.324,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4124.591,
    "end": 4133.384,
    "text": " Okay, so in the mini grid world problem, they are investigating two tasks to evaluate the agents that they used.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4133.604,
    "end": 4139.112,
    "text": "So one is the door key task, the DK task, and the other is the memory task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4139.813,
    "end": 4141.374,
    "text": " So everybody's in a grid.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4141.534,
    "end": 4144.595,
    "text": "It's a partially observable view of the agent's environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4145.376,
    "end": 4147.437,
    "text": "And there's a three channel object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4148.997,
    "end": 4155.561,
    "text": "Yeah, so the agent's environment is a three channel object, a tensor, created by mapping each visible grid cell to three integer values.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4155.921,
    "end": 4159.983,
    "text": "So everything, each tile contains either nothing, one object,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4160.823,
    "end": 4183.886,
    "text": " and a discrete object type so ultimately each tile is encoded to an object index so it's unseen empty wall and then a color index red green whatever and then a state index which is open closed or locked so those are the three um three yeah things three things three things in the environment okay next so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4186.753,
    "end": 4193.799,
    "text": " The agent is restricted to picking up one single object, a key, and may open a locked door if it carries a key that matches the door color.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4194.119,
    "end": 4195.28,
    "text": "So that's the door key problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4195.88,
    "end": 4199.123,
    "text": "The discrete action space for the agent is six actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4199.203,
    "end": 4208.01,
    "text": "Turn left, right, forward, pick up an object, or drop the object that it's currently carrying, or activate, such as opening a door or interacting with an object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4208.63,
    "end": 4211.653,
    "text": "The reward signal provided by all tasks is sparse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4211.733,
    "end": 4214.655,
    "text": "The agent is only given a positive extrinsic reward if it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4215.365,
    "end": 4229.915,
    "text": " extrinsic reward if it reaches a green goal tile and otherwise making all problems difficult from a reinforced reinforcement learning perspective because it's sparse and that's that's like again at the very beginning like i act i asked about the sparsity and what is the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4231.438,
    "end": 4242.002,
    "text": " I mean, there's some overarching level of complexity when there's a sparse set of rewards, a sparse set of problems, a sparse set of activated neurons, I mean, et cetera, et cetera, et cetera, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4242.523,
    "end": 4252.827,
    "text": "Sparse networks are hard to deal with mathematically and computationally, and I guess in terms of programming a system with sparse learning, it's beneficial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4253.667,
    "end": 4254.267,
    "text": "It seems that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4254.387,
    "end": 4257.949,
    "text": "Anyway, okay, so each problem has a specific time step limit",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4259.17,
    "end": 4261.874,
    "text": " limit allotted to allow the agent to complete the task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4262.355,
    "end": 4263.958,
    "text": "So you do it within a certain time or you fail.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4266.288,
    "end": 4292.437,
    "text": " yeah very interesting there sparsity in architecture space time reward utility epistemic value all like we don't live in flatlands we live on the rough and variable Peaks and the very embodied constraints and limitations of how things can actually be connected to each other so that's wild",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4295.077,
    "end": 4305.008,
    "text": " Cool, okay, so for the door key problem, agent must find the key, the position of the key changes inside of a locker room, and then pick up the key in order to unlock the door so it can leave the room.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4305.751,
    "end": 4313.734,
    "text": " Upon entering the second room, the agent must find the green tile in order to successfully exit, terminating the episode by reaching the goal state to receive a positive reward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4315.034,
    "end": 4316.655,
    "text": "So they use a six by six grid.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4316.755,
    "end": 4318.875,
    "text": "The memory task is a different test.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4318.955,
    "end": 4320.116,
    "text": "It's posed as a memory test.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4320.236,
    "end": 4327.078,
    "text": "So in the memory test, the agent starts in a small room where it can see an object, a key or a ball, and they",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4328.047,
    "end": 4333.032,
    "text": " and they modified the problem to ensure that the agent starts looking in the direction of the object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4333.433,
    "end": 4334.093,
    "text": "That's interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4334.394,
    "end": 4337.137,
    "text": "I wonder why, like, so that they don't have to, it does just save time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4337.377,
    "end": 4340.72,
    "text": "Like, so you don't have to look right, look front, look left, look behind you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4340.74,
    "end": 4343.744,
    "text": "I wonder why they modified the problem in that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4343.764,
    "end": 4343.804,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4345.484,
    "end": 4351.506,
    "text": " So after perceiving the object, the agent has to turn around, exit the room, and go through a narrow hollow that ends in a split.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4352.067,
    "end": 4354.628,
    "text": "At the end of the split, the agent can either go up or down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4355.148,
    "end": 4358.509,
    "text": "At the end of each of these splits is a different object, either a key or a ball.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4358.589,
    "end": 4368.613,
    "text": "To successfully complete the episode and receive a positive reward, the agent must remember the initial object that it saw and go to the split that contains the correct matching object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4369.764,
    "end": 4393.512,
    "text": " so did you see a key or did you see a ball and then which way are you going to go at the end of the maze um and then they did a seven by seven grid for that one okay let's see what they found oh not yet so these are the models of comparison so they use their model and a standard dq network model distillation and that's the dqn",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4394.765,
    "end": 4405.634,
    "text": " R&D, which is a curiosity model, and then a DQN that learns through account-based formulation of the Be Bold Exploration Framework, which we'll have to learn more about in the doc too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4406.795,
    "end": 4408.837,
    "text": "So these are the models that they tested against.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4410.958,
    "end": 4412.98,
    "text": "And then this is what they found.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4413.0,
    "end": 4413.04,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4415.919,
    "end": 4422.625,
    "text": " success rate in the memory task for the Coggen Gen was like off the hook, like blew the other ones out of the water, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4423.966,
    "end": 4427.909,
    "text": "Like 98 success rate for the memory task, which is pretty crazy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4428.99,
    "end": 4437.477,
    "text": "And then the door key task was, I guess, like zero for the DQN and then 100%, 100%, 100% for the other ones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4439.279,
    "end": 4440.34,
    "text": "Or maybe then the reverse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4441.02,
    "end": 4441.841,
    "text": "So let's see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4441.901,
    "end": 4443.923,
    "text": "From left to right, the door key task, the memory task,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4444.93,
    "end": 4467.647,
    "text": " the bottom row is success rate over the last 100 episodes the right is the episode length oh there you go the percentage in case of the maximum worst case episode length so that is um dqn having the worst right and then kagenjen wasn't the fastest so oh yeah you can see the episode yeah i think it's just a pure coincidence that this one's 100.0",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4470.247,
    "end": 4472.309,
    "text": " But this is a hundred percent zero, like a hundred percent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4472.83,
    "end": 4476.333,
    "text": "And this one's one hundred time steps point zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4477.434,
    "end": 4485.021,
    "text": "But either way, DQN does worse than all three, which can solve the problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4486.182,
    "end": 4490.827,
    "text": "But of the DK problem, but the Kagen Gen is twice as good on the Mem problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4491.367,
    "end": 4494.671,
    "text": "And then the episode lengths are pretty comparable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4496.32,
    "end": 4496.881,
    "text": " And much shorter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4496.901,
    "end": 4497.441,
    "text": "Except the DQN.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4497.962,
    "end": 4498.522,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4498.562,
    "end": 4499.383,
    "text": "This one is just kind of a baseline.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4499.403,
    "end": 4501.184,
    "text": "The DQN is like, takes forever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4501.204,
    "end": 4504.588,
    "text": "It takes forever and doesn't do very well in the memory task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4505.869,
    "end": 4508.091,
    "text": "So yeah, there you go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4508.111,
    "end": 4508.611,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4508.671,
    "end": 4512.014,
    "text": "So that's a lot of time on the model and very little time on the results.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4512.435,
    "end": 4514.857,
    "text": "And then this is just some more of the results here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4514.977,
    "end": 4522.424,
    "text": "So you can just see the average reward episode length smoothed for the door key problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4522.944,
    "end": 4524.664,
    "text": " and the memory task, which is the right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4524.684,
    "end": 4525.865,
    "text": "So the door key is the left.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4525.945,
    "end": 4527.745,
    "text": "The memory task is the right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4528.425,
    "end": 4531.546,
    "text": "And here, you can see the cog and gen on this bottom one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4531.686,
    "end": 4532.586,
    "text": "Do you see this curve?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4533.166,
    "end": 4538.568,
    "text": "That is the curve depicts the mean and standard deviation over five trials.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4540.628,
    "end": 4543.049,
    "text": "And the left is the average reward, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4543.289,
    "end": 4544.389,
    "text": "Oh, yeah, episodic reward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4544.449,
    "end": 4547.99,
    "text": "So that is where we saw 98 for the cog and gen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4548.83,
    "end": 4551.731,
    "text": "And that's here, too, for the door key task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4553.18,
    "end": 4553.66,
    "text": " memory task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4553.74,
    "end": 4554.721,
    "text": "Okay, results and discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4554.921,
    "end": 4558.363,
    "text": "Based on the results, we find that CoggenGen is able to learn the grid world task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4558.944,
    "end": 4572.912,
    "text": "The performance is comparable to or on par with powerful deep intrinsic curiosity reinforcement learning methods that have access to problem specific global information, and CoggenGen can successfully solve and outperform all baselines on the memory task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4573.372,
    "end": 4574.213,
    "text": "So bravo.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4575.213,
    "end": 4575.954,
    "text": "We have arrived.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4582.258,
    "end": 4582.738,
    "text": "Wow, Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4584.281,
    "end": 4584.842,
    "text": " What a ride.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4586.523,
    "end": 4586.743,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4587.264,
    "end": 4591.007,
    "text": "What do you think about the four paper model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4592.989,
    "end": 4601.296,
    "text": "Well, I can only return to what Alex wrote in an email, which is, it makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4602.352,
    "end": 4604.174,
    "text": " to have done it how it was done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4604.194,
    "end": 4619.726,
    "text": "I think it'd be easy to look at a cognitive architecture like this, which integrates the analytical components and also these more psychological or cognitive features like epistatic and procedural memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4620.167,
    "end": 4627.233,
    "text": "It's easy to look at that in a way that's disconnected from the actual computational implementation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4628.393,
    "end": 4634.515,
    "text": " because connecting up the formalism feels as easy as just writing an equation or just drawing something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4634.995,
    "end": 4639.857,
    "text": "And then to say, well, maybe the working memory sends a message to this other buffer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4639.877,
    "end": 4643.858,
    "text": "It's like, you can just draw that out and nothing's gonna stop you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4644.459,
    "end": 4657.123,
    "text": "But then the first three papers kept it connected very closely to the actual locally implementable computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4658.382,
    "end": 4679.106,
    "text": " so then we were able to get to this point of um looking at such an interesting cognitive model that's also performant and be able to talk about where it could be applied or what would be different or limitations or like these different features of this but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4681.01,
    "end": 4696.356,
    "text": " it it feels very different to look at this after the first three which is the research direction so I think it was a great selection and I'm just looking forward to talking with Alex what about you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4698.837,
    "end": 4708.309,
    "text": " Yeah, I'm looking forward to like diving deeper into the models and kind of understanding more about like getting under the hood, maybe, so to speak.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4708.99,
    "end": 4711.633,
    "text": "So what makes them tick in a little bit more detail.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4711.934,
    "end": 4713.175,
    "text": "So should be good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4713.195,
    "end": 4713.996,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4714.277,
    "end": 4715.158,
    "text": "Any other comments?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4718.849,
    "end": 4719.109,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4719.129,
    "end": 4724.435,
    "text": "Well, thank you for preparing and having fun working on this .0 leading up to now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4725.416,
    "end": 4730.681,
    "text": "And yeah, in the coming weeks, we will proceed with 56.1 and .2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4731.142,
    "end": 4732.363,
    "text": "So thank you, everybody.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4732.383,
    "end": 4733.484,
    "text": "Until next time.",
    "speaker": "SPEAKER_00"
  }
]