[
  {
    "start": 7.486,
    "end": 21.889,
    "text": " hello and welcome everyone this is actin live stream 56.1 it's november 14 2023 and we're continuing our discussion series on these four papers by alexander arobia at all",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 22.99,
    "end": 45.15,
    "text": " welcome to the active inference institute everyone we are a participatory online institute that is communicating learning and practicing applied active inference this is a recorded and archived and a published live stream so please provide us feedback so we can improve our work all backgrounds and perspectives are welcome and will follow video etiquette for live streams",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 46.528,
    "end": 64.721,
    "text": " over to active inference.org to learn more about projects and learning groups at the institute well today in 56.0 we're bringing out all of the four entrees and we'll see where we go with these",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 65.899,
    "end": 86.46,
    "text": " big topics and with alex here to discuss so we'll begin with intros and go from there so i'm daniel i'm a researcher in california and what i would like to explore in this stream",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 87.461,
    "end": 99.041,
    "text": " beyond the trails that were left in the dot zero is to get the zoomed in what is the space of these micro motifs",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 100.546,
    "end": 109.491,
    "text": " And then to compose those zooming ins into the bigger picture, what do cognitive architectures look like in 2023?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 110.311,
    "end": 114.814,
    "text": "How is that different in theory and in practice than 1983?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 115.654,
    "end": 122.298,
    "text": "And then where is this all heading in terms of how we can do useful and important research?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 122.598,
    "end": 122.818,
    "text": "Blue?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 125.828,
    "end": 126.369,
    "text": " Cool, thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 126.729,
    "end": 142.227,
    "text": "Yeah, I'm interested in the 2043 cognitive architecture also, and maybe exploring the space of human cognitive architecture, but also like non-human cognitive architecture and what that looks like and where maybe that might take us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 144.07,
    "end": 145.591,
    "text": "Yeah, that's good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 145.732,
    "end": 145.912,
    "text": "Alex?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 147.489,
    "end": 148.269,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 148.71,
    "end": 163.076,
    "text": "Yeah, I'm Alex Vervea, and I am the director of the Neural Adaptive Computing Laboratory and a computer science assistant faculty professor here at RIT in computer science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 163.117,
    "end": 171.841,
    "text": "I'm also affiliate professor in psychology, soon to be affiliate professor in cognitive science and affiliate faculty in computational neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 172.481,
    "end": 175.743,
    "text": "Kind of a mouthful of different involvements, but I do a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 177.145,
    "end": 182.626,
    "text": " Yeah, and I've known about the Active Inference Institute before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 182.906,
    "end": 185.247,
    "text": "Some of my students are fans of the channel already.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 186.367,
    "end": 188.748,
    "text": "So it's very exciting to be here to talk to you guys.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 188.828,
    "end": 192.809,
    "text": "And I think that you have some really good questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 192.889,
    "end": 202.311,
    "text": "And I think this set of papers that you picked is a nice little pathway through some of the thinking that I've done over the years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 203.091,
    "end": 205.792,
    "text": "What was funny when I was watching the .zero,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 207.033,
    "end": 217.04,
    "text": " And again, I also noted this to both Blue and Daniel in email, is that I thought, oh, there's these other papers that I've written that would have clarified or could have come.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 217.1,
    "end": 221.463,
    "text": "So very easily, this could have become like, why don't you do 25 different papers?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 221.583,
    "end": 224.405,
    "text": "And, you know, I think that might have become quite a burden.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 224.665,
    "end": 251.546,
    "text": " but uh uh some of my bonus slides that I I know Daniel told me I didn't have to make any or it's not typical but I have some slides taken from some pieces of those other papers that uh might have might give some clarity uh to some pieces of your guys questions depending on which ones we start with uh and you know this and the dot two of next week so again thank you for having me this is very exciting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 252.734,
    "end": 253.034,
    "text": " Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 253.095,
    "end": 259.322,
    "text": "I guess to begin, how did you get into cognitive sciences or cognitive modeling?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 260.403,
    "end": 261.224,
    "text": "Oh, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 261.945,
    "end": 264.168,
    "text": "The history, the origin story, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 265.369,
    "end": 266.951,
    "text": "Yeah, it's interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 267.031,
    "end": 267.792,
    "text": "So when I...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 268.973,
    "end": 273.957,
    "text": " without going into too much and spending too much of the podcast on one's own life story.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 274.677,
    "end": 287.767,
    "text": "When I started out in computer engineering or computer science and engineering when I was a young undergraduate and I even came from like a background of art and digital arts, which is kind of interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 287.787,
    "end": 297.495,
    "text": "I had learned a program late in high school and then I'm entering in Bucknell University is where I went for my undergraduate education.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 298.335,
    "end": 299.976,
    "text": " And it was really strange.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 299.996,
    "end": 301.076,
    "text": "I did not do much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 301.096,
    "end": 308.699,
    "text": "I actually did not know at all of machine learning, let alone cognitive models or computational neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 309.159,
    "end": 311.58,
    "text": "It was more of that strict engineering education.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 311.64,
    "end": 319.202,
    "text": "However, I like to think that something that I did, which was I'm a philosophy minor, philosophy of mind is what I studied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 319.562,
    "end": 323.564,
    "text": "I like to think that's what biased me and kind of launched me to where I am today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 324.404,
    "end": 326.745,
    "text": "So I was always studying things like consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 327.485,
    "end": 330.966,
    "text": " also ethics and other aspects of philosophy and Greek philosophy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 331.066,
    "end": 342.648,
    "text": "But philosophy of mind and identity was something that sort of motivated me to think, well, hey, maybe this stuff I'm doing in hardware and engineering, I could combine the two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 343.208,
    "end": 348.489,
    "text": "Is there a way to sort of emulate this concept of identity or consciousness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 349.549,
    "end": 352.49,
    "text": "Little did I even know what the free energy principle was.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 353.55,
    "end": 357.713,
    "text": " And so then towards the end, I worked on complex adaptive systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 358.233,
    "end": 360.715,
    "text": "Again, nothing to do with machine learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 361.475,
    "end": 364.477,
    "text": "However, it ties so beautifully, especially nowadays.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 364.557,
    "end": 372.843,
    "text": "Over the last year, I've done thinking and working with Carl on the free energy principle and aspects of the markup blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 372.863,
    "end": 375.585,
    "text": "It's funny how all that construct ties back together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 375.605,
    "end": 377.066,
    "text": "And it was like, oh, that's stuff I studied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 378.066,
    "end": 383.89,
    "text": " Years ago, wow, it comes back into force full into play really, really strongly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 383.91,
    "end": 396.698,
    "text": "And then grad school, I was in Dr. Celie Giles's lab, who's actually a very well-known information retrieval scientist and a classical deep learning researcher.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 396.718,
    "end": 401.281,
    "text": "And and then I was and he was more artificial intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 402.081,
    "end": 404.101,
    "text": " But that's the reason why I got into deep learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 404.181,
    "end": 405.442,
    "text": "He gave me a survey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 405.462,
    "end": 407.282,
    "text": "I was exposed to neural nets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 408.302,
    "end": 414.103,
    "text": "He actually said to me years later, the reason he gave me that survey was to discourage me from going into it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 414.183,
    "end": 417.344,
    "text": "But he told me he was glad that it didn't work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 417.964,
    "end": 422.945,
    "text": "And then along the way, this is the part where the cognition comes in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 422.965,
    "end": 427.806,
    "text": "I was co-advised by a cognitive psychologist, Dr. David Ryder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 428.806,
    "end": 440.153,
    "text": " at Penn State, who also worked a lot with another well-known cognitive scientist, Dr. Frank Ritter, who was, he himself was advised by Alan Newell and Herbert Simon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 440.173,
    "end": 446.217,
    "text": "So some of the greats of our time in cognitive science and classical artificial intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 446.657,
    "end": 449.238,
    "text": "So I was in the applied cognitive sciences lab as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 449.278,
    "end": 457.884,
    "text": "And so between those two worlds, I think that's what sort of solidified me to saying, hey, there's these big problems in machine learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 458.824,
    "end": 460.426,
    "text": " Particularly with credit assignment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 461.006,
    "end": 462.447,
    "text": "So I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 462.627,
    "end": 466.35,
    "text": "I'm pretty sure you guys are familiar with these concepts in one form or another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 466.991,
    "end": 472.775,
    "text": "But credit assignments, just like when we're doing back propagation on a big neural network, we want to play the blame game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 473.015,
    "end": 478.32,
    "text": "How much does this neuron contribute in a positive or negative way to some cost function?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 478.98,
    "end": 491.709,
    "text": " And for some reason, that always felt at odds with me, because along the way, I worked with all kinds of really non-mainstream models like Hopfield Networks and Boltzmann machines were actually my first loves, if you will.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 492.65,
    "end": 495.132,
    "text": "That's what I did in my early PhD thesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 495.352,
    "end": 499.855,
    "text": "So that was at odds with what's going on in deep learning, even though Boltzmann machines were",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 500.015,
    "end": 527.677,
    "text": " used at the very beginning and then everyone threw them away um and so i think uh those ideas of like memory consolidation and memory storage and the fact that hotfield network couldn't remember everything actually had very limited storage was awesome to me and i was like i want to probe that more uh can i build systems with this and uh so i was one of the early days working on boltzmann machines but like trying to sell them as the thing we should care about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 528.697,
    "end": 531.36,
    "text": " And then towards the end of my PhD, so now I'm going to skip around a bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 531.42,
    "end": 534.502,
    "text": "I did work on recurrent neural nets with Thomas Mikolov.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 534.542,
    "end": 535.563,
    "text": "He's one of my friends.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 536.424,
    "end": 543.53,
    "text": "And then towards the end of my PhD, I had somewhere along the line over the years found predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 544.35,
    "end": 552.157,
    "text": "My joke to my grad students is Rajesh Rao's and Dana Ballard's classical 1990s paper on predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 552.657,
    "end": 575.499,
    "text": " and classical effects of the eye was something that i i read so many times that i said i slept with it under my pillow to hope that i would absorb how incredible it really was that paper probably was the strongest influence on why i decided you know what for the rest of my life i'm gonna do predictive coding i think we need a lot of work here because it's again also not a mainstream area",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 576.059,
    "end": 581.502,
    "text": " It resonated with some aspects of Boltzmann machines for me because I love iterative processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 582.543,
    "end": 590.307,
    "text": "And I also read parallel distributed processing by McClellan, Rommelhard, Hinton, Jeff back in the day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 590.327,
    "end": 593.789,
    "text": "And so all of those things kind of rolled together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 593.969,
    "end": 598.672,
    "text": "And so that led me to saying, I want to do credit assignment, but in a biological way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 598.972,
    "end": 600.973,
    "text": "So backprop's got to go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 601.293,
    "end": 603.314,
    "text": "It's clearly not what the brain is doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 603.374,
    "end": 604.615,
    "text": "I mean, if it turns out it does,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 605.195,
    "end": 606.736,
    "text": " I'm okay with being wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 606.816,
    "end": 610.897,
    "text": "At least we explored some other parts in the space that was beyond backprop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 611.757,
    "end": 618.3,
    "text": "And so I do like the Bayesian brain theory and the free energy interpretations of predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 618.32,
    "end": 621.341,
    "text": "This is why I'm a fan of aspects of Carl's work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 622.16,
    "end": 634.186,
    "text": " And so, you know, taking that interpretation, that came a little bit later, I would say, once I, so after grad school, or my PhD, I got faculty position at RIT.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 634.826,
    "end": 640.709,
    "text": "And that's where the free energy principles sort of biased me and active inference a little bit later on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 641.309,
    "end": 648.255,
    "text": " Actually, most of my students in my lab, at least two of them that promised they would watch the stream, they both work on active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 648.455,
    "end": 653.619,
    "text": "So we talk a lot about that or read a lot of these papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 654.68,
    "end": 667.53,
    "text": "And then, of course, very recently have I finally gotten in touch and I collaborate now, you know, I would say rather readily now with Chris Buckley, who's really well known in active inference, Carl.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 668.546,
    "end": 673.771,
    "text": " in free energy stuff, you know, and Rajesh Rao was on the survey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 673.791,
    "end": 674.951,
    "text": "So it was really great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 675.672,
    "end": 684.799,
    "text": "I actually did not give you in blue, Daniel, that big survey that I recently worked with Thomas Salvatore and Ankur Mali.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 685.78,
    "end": 690.725,
    "text": " But we have this big review of predictive coding over the last like three plus decades.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 691.286,
    "end": 692.708,
    "text": "And Carl's on there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 692.788,
    "end": 693.949,
    "text": "Rajesh Rao's on there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 693.989,
    "end": 695.13,
    "text": "Chris Buckley's on there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 695.23,
    "end": 697.272,
    "text": "Thomas is on there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 697.313,
    "end": 701.037,
    "text": "So there's a lot of really nice names and they're really great people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 701.057,
    "end": 701.897,
    "text": "And it was crazy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 702.947,
    "end": 711.316,
    "text": " When I got to talk to Rajesh Rao, just as I told you earlier, I slept under the pillow with his 1990s nature paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 711.396,
    "end": 717.162,
    "text": "So to actually meet him in Zoom was rather incredible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 717.182,
    "end": 723.309,
    "text": "It was a fun experience to get to ask him even the questions I've always had on the tip of my tongue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 723.689,
    "end": 726.63,
    "text": " And so anyway, that sort of is what molded me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 726.65,
    "end": 748.835,
    "text": "And the cognitive science, cognitive architecture part, which we'll talk about in point two, that was heavily biased by David Ryder and Frank Ritter and my discussions with them and understanding architectures like ACDAR and SOAR, which are these older ones, as you mentioned, I believe Daniel or Blue, like in 1989 or in the 1980s and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 751.263,
    "end": 752.363,
    "text": " What's the future?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 753.084,
    "end": 755.565,
    "text": "And we can have some fun chats about that as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 756.725,
    "end": 768.19,
    "text": "So, yeah, I would say that because of that interesting blend, that sort of led me to say that I'm not just the guy that says we got to get rid of backprop and here's how we do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 768.33,
    "end": 773.612,
    "text": "And, oh, well, let's use the Bayesian brain theory of predictive coding or predictive processing to do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 774.393,
    "end": 776.333,
    "text": "But rather, let's use that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 776.413,
    "end": 779.715,
    "text": "But also let's look to the common model of cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 780.535,
    "end": 787.037,
    "text": " which is sort of like the Graham theory or the blueprint theory in cognitive science that I've also sold my soul to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 787.057,
    "end": 797.16,
    "text": "I was just at DC a couple of weeks ago at the Cognitive Science Symposium, one of the FSS symposiums for AAAI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 798.1,
    "end": 804.382,
    "text": "And I was talking to Andrea Stocko and John Laird and all the greats from like the old cognitive architectures or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 805.503,
    "end": 807.806,
    "text": " brain imaging and brain science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 807.886,
    "end": 811.57,
    "text": "And we were talking about the directions where these go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 811.59,
    "end": 820.62,
    "text": "So actually, if we talk about later the future of cognitive architectures, I might bring some of my thoughts from that really, really nice symposium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 821.341,
    "end": 823.262,
    "text": " And yeah, and I could keep blabbing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 823.362,
    "end": 830.064,
    "text": "I don't know if that really completely answered your question as to why, but I guess too long didn't read TLDR.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 831.164,
    "end": 836.466,
    "text": "Cognitive science co-advisor in grad school combined with an AI main advisor in grad school.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 836.866,
    "end": 838.087,
    "text": "Philosophy of mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 838.847,
    "end": 864.101,
    "text": " in my undergrad strongly biased me with complex systems and I guess I'll just blame Boltzmann machines because honestly those were those were wonderful wonderful and I still think elegant little models that sort of like said we got to look to things that don't do uh don't work with at least gradients uh with the reverse mode uh differentiation algorithm that sort of characterizes back prop",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 867.136,
    "end": 868.877,
    "text": " All the credit goes to Boltzmann in the end.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 870.038,
    "end": 870.378,
    "text": "Always.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 870.398,
    "end": 873.079,
    "text": "Oh, and we should give Helmholtz some love too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 873.48,
    "end": 877.342,
    "text": "Von Helmholtz and the Helmholtz machines, those are wonderful too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 878.743,
    "end": 882.385,
    "text": "Well, Blue, if you want to begin with a question, or I'm happy to ask.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 884.358,
    "end": 903.812,
    "text": " There was a lot there, so I could follow up a few times, but I am interested in what you said about the Hopfield Network forgetting and how you thought that that was perfect and the most exciting thing that it didn't recollect perfectly, the imperfect memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 905.533,
    "end": 910.217,
    "text": "And I think that that's interesting to me also, and that kind of introduces...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 911.657,
    "end": 917.219,
    "text": " which we see like in humans, I'm a very much like, it's all in your mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 917.359,
    "end": 924.52,
    "text": "And like, I like to walk the tightrope between like perception and like reality and like what is reality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 924.78,
    "end": 936.683,
    "text": "And how do you like when you have a variant in a system, like because it forgot X, Y, or Z somewhere along the line, how do you find like the best way",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 937.164,
    "end": 946.04,
    "text": " variants, best variants, like what would and then like, you know, do you go on to selectively refine, like refining selective memory?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 946.32,
    "end": 948.243,
    "text": "And what would that look like?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 949.423,
    "end": 952.224,
    "text": " OK, so let me ask a clarification question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 952.544,
    "end": 957.186,
    "text": "What do you mean by like variant model or variant as in like a deviation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 957.426,
    "end": 959.687,
    "text": "That's maybe some term I'm not quite.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 960.147,
    "end": 961.087,
    "text": "It's not triggering something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 961.647,
    "end": 966.029,
    "text": "So like in biology, you get variants, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 966.089,
    "end": 968.29,
    "text": "Like so you have like a biological variant.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 968.35,
    "end": 977.953,
    "text": "But I mean, just as in humans, like you have 25 people at a party and 25, you have 25 different perceptions and 25 different memories of that party.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 978.593,
    "end": 1001.421,
    "text": " right and so so in when you have like a network that forgets what do you then do without forgetting like what you know you have 25 different networks 25 different memories like how do you select the best one or would you want to and then how do you um like what what do you think could be the outcome of that why is that so exciting that you have selective memory in a network",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1002.429,
    "end": 1006.61,
    "text": " Okay, so I understand now what you're asking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1006.63,
    "end": 1021.573,
    "text": "To unpack that a little bit, briefly to answer why I thought Hopfield networks were so cool or so exciting, and just to make sure that was clear, was the fact that they only had linear storage capacity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1022.033,
    "end": 1024.434,
    "text": "So obviously, you could actually calculate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1024.454,
    "end": 1028.895,
    "text": "I think there's a formula with respect to the dimensionality of the patterns",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1029.395,
    "end": 1058.319,
    "text": " you can actually say how many memories i can store vector patterns especially binary patterns yeah as i see the diagram being pulled up here uh before things start getting corrupt so i think that that was fascinating to me because uh i guess i had assumed that you could just store lots and lots and lots of information these deep networks right and the fact that memory can be corrupted uh it is a very human-like quality right we forget things as you've brought up now blue and your any",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1058.339,
    "end": 1082.381,
    "text": " your comments, and I think it is a human-like thing, but it also highlights, and again, later I would discover catastrophic forgetting in deep neural networks, which isn't really quite, at least in my view, human-like in the way that it happens in machines where, and by the way, for the audience that may or may not know catastrophic forgetting, it's like you train a neural network on one task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1083.341,
    "end": 1084.522,
    "text": " to predict cats and dogs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1084.622,
    "end": 1088.004,
    "text": "And then I move on to airplanes and trucks, and I learn to predict that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1088.405,
    "end": 1091.006,
    "text": "And then I say, hey, by the way, can you tell me if this is a cat or a dog?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1091.046,
    "end": 1092.227,
    "text": "And it gets like 0%.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1092.487,
    "end": 1094.429,
    "text": "It's abysmal performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1095.029,
    "end": 1102.394,
    "text": "That's not quite like a human, because the joke I tell also my students is I'd be like, oh, as I learn to play the piano, I forget how to breathe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1103.034,
    "end": 1118.941,
    "text": " uh that doesn't quite work um so i think now tying that back so that again is like motivation and actually have like a bonus slide to say like future directions this is like one of the things that i've been working to try to resolve uh with biological models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1119.601,
    "end": 1126.467,
    "text": " The Hopfield network was interesting in Boltzmann machines by extension because they're just Hopfield networks with latent variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1127.188,
    "end": 1130.07,
    "text": "I like the concept of attractors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1130.25,
    "end": 1139.638,
    "text": "When you build a Hopfield network, the idea is that because you're learning with contrastive heavy learning, which was also the algorithm that really caught my attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1139.678,
    "end": 1142.86,
    "text": "I love that idea of just, hey, I find equilibrium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1143.261,
    "end": 1145.262,
    "text": "I run my model for a certain phase.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1145.322,
    "end": 1147.004,
    "text": "I compare it to some clamped phase.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1147.404,
    "end": 1148.905,
    "text": " And then I just do a big subtraction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1148.945,
    "end": 1150.346,
    "text": "You get Hebbian rules out of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1150.666,
    "end": 1157.469,
    "text": "That's like one of the central reasons to I liked heavy, sorry, Hopfield networks and Boltzmann models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1158.289,
    "end": 1167.434,
    "text": "But these idea of having these attractors in space where if you could figure out your optimization landscape, usually it's an energy landscape with a Hopfield model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1168.154,
    "end": 1169.535,
    "text": "We are pulling the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1169.975,
    "end": 1181.263,
    "text": " let's say templates even, or representative aspects of data at these little pins that are saying these points in the energy landscape are what I'm going to remember and patterns that look similar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1181.323,
    "end": 1185.826,
    "text": "So I guess this might kind of slightly address your comment on a variant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1186.006,
    "end": 1189.708,
    "text": "So variant as in like variations to particular memories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1189.768,
    "end": 1197.193,
    "text": "If I meet someone or I have certain attributes in a vector, this would fall into this dynamical attractor, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1197.253,
    "end": 1199.535,
    "text": "Which again would fall into this energy landscape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1200.015,
    "end": 1206.841,
    "text": " I really like that interpretation of how memory works because then it's not just me storing things in a hard array, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1206.881,
    "end": 1212.426,
    "text": "The idea of like, let me just store every vector I've ever seen because now you have this problem of capacity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1213.287,
    "end": 1216.99,
    "text": "And then again, how do I build the, and you know, there's some value in modeling things in that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1217.07,
    "end": 1227.399,
    "text": "So this isn't a criticism of any neural models in that regard, but I like the dynamical attractor kind of point of view, which again, then you can connect it nicely to free energy and say, oh, it's your free energy functional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1227.939,
    "end": 1231.604,
    "text": " And I am just walking along my landscape to plot my memories in there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1233.025,
    "end": 1237.651,
    "text": "So I think that's what fascinated me was the energy based interpretation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1237.671,
    "end": 1244.319,
    "text": "And then again, Boltzmann machines and restricted Boltzmann machines, also known as harmoniums.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1245.059,
    "end": 1266.388,
    "text": " They have this beautiful kind of energy-based functional interpretation, and they too are recollecting patterns, right, by this, you could say a dynamical reconstruction, but it's really just like I'm clamping noise and I'm running this until I reach equilibrium, and that sort of retrieves from my memory some particular element of life, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1266.848,
    "end": 1274.371,
    "text": "Something I've experienced in my niche, and I pull out that attractor, or I basically am just saying how similar I am.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1274.591,
    "end": 1296.379,
    "text": " am to that attractor and then of course later on there's been a lot of more efficient work and then there's criticisms of bolts machines but um so i think like that's particularly why i found them specifically fascinating um i'm gonna stop myself there i don't know blue if that was scratching at least that some type of answer to your question that was great thank you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1300.956,
    "end": 1307.621,
    "text": " earlier, you mentioned this grand cognitive science framework, kind of the general",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1309.448,
    "end": 1339.268,
    "text": " cognitive model so how do you pursue that or where do we place or enumerate all these features of diverse intelligences like memory but clearly just in your answer there's multiple implementations that are non-overlapping of memory almost to the point where it's like what can you really say memory even is so what are those core pieces and how will we know or assess that we have the relevant even continents sketched out",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1339.988,
    "end": 1362.996,
    "text": " for for worthwhile pursuit of of anything other than just an abstraction well i mean wonderful question complex question and you know i me i'm not the only person i mean i'm just but one small voice right that you know should speak to that i think all of cotton all the great cognitive scientists i've even just met in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1363.956,
    "end": 1367.937,
    "text": " the short span of my life, have some interesting differing thoughts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1368.357,
    "end": 1376.939,
    "text": "So I think just to clarify what you said, Daniel, the grand kind of blueprint theory that I'm referring to is actually well known.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1376.959,
    "end": 1378.099,
    "text": "There's some nice papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1378.179,
    "end": 1381.46,
    "text": "I can try to pass them on to you in blue if you don't already know of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1381.96,
    "end": 1384.601,
    "text": "It's called the Common Model of Cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1385.846,
    "end": 1410.101,
    "text": " and uh by the way it is not the only way you can build a mind uh it's just the one that resonates the most with me um and so i just want to point that out it's not again just like anything there's no such thing as a silver bullet i would even venture to say that there's probably a no free lunch theorem that applies to cognitive science just like i teach it in machine learning uh so there's probably no one cognitive architecture because i think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1410.561,
    "end": 1423.985,
    "text": " I think Blue said it, but you might have said it, Daniel, about modeling things that are not necessarily human, which I think could have generalized to animal cognition, but it could also even... My brain, weirdly enough, went to alien cognition, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1424.045,
    "end": 1426.866,
    "text": "Things that are not even of planet Earth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1427.046,
    "end": 1428.366,
    "text": "Maybe there's other types of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1428.886,
    "end": 1430.627,
    "text": " intelligent organizations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1430.707,
    "end": 1437.072,
    "text": "And I do believe that there is probably more than one way to build an intelligent computational entity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1437.412,
    "end": 1444.457,
    "text": "But without getting into that, also potential can of worms, the common model of cognition, I think,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1445.748,
    "end": 1450.511,
    "text": " to sketch out what you said, lays out the continents of the mind, to use your word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1451.332,
    "end": 1455.115,
    "text": "The reason I like it is that it sort of is like a synthesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1455.655,
    "end": 1469.305,
    "text": "When you read the paper, they themselves at the time, this was now years ago that the original Common Model of Cognition paper, view paper came out, and they looked at things like ACDAR, SOAR, SIGMA, I",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1469.465,
    "end": 1474.168,
    "text": " I don't know if they looked at like, for example, they might have looked at versions of Randall O'Reilly's work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1474.268,
    "end": 1478.351,
    "text": "He does a lot of really nice stuff like Libra, the Libra architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1478.751,
    "end": 1482.193,
    "text": "I don't remember if that was in there and other variants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1482.274,
    "end": 1488.578,
    "text": "Of course, I don't think they had like Chris Eliasmith's group at Waterloo who did the work on Spawn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1489.038,
    "end": 1493.221,
    "text": "You might have heard of Nango, which are like spiking neural model toolkits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1494.022,
    "end": 1502.035,
    "text": " Spawn is an S-P-A-U-N, Daniel, if you want to write that so that way, because there's like a science paper that he had years ago that came out about Spawn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1503.518,
    "end": 1507.344,
    "text": "But they looked at maybe not those specifically, those would be like the updates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1508.116,
    "end": 1512.639,
    "text": " But they looked at particularly the first three that you have in your notes there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1513.119,
    "end": 1516.281,
    "text": "And they synthesized these architectures and said, what are commonalities here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1516.321,
    "end": 1517.502,
    "text": "What are they trying to model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1518.682,
    "end": 1524.746,
    "text": "And sometimes I misuse the word brain regions, but rather it's more like functional continents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1525.066,
    "end": 1527.087,
    "text": "I'm going to borrow your terminology, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1527.527,
    "end": 1550.314,
    "text": " of the brain and they kind of chop it up into saying well what are the grand pieces of computation that goes on and yeah let's see if i can distill it from my own limited memory uh you know we have our motor functionality our motor cortex we have perception uh and of course now i of course have added my own addendums to that where you could break up perception into modalities",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1550.834,
    "end": 1562.582,
    "text": " like audio, visual, and then of course, olfactory and touch and taste and all these other elements that maybe we don't model very well, but we'll leave that again also as a separate discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1562.602,
    "end": 1564.844,
    "text": "And then the parts of memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1565.104,
    "end": 1570.488,
    "text": "So we have, for example, procedural memory, then we have declarative memory and we have working memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1570.913,
    "end": 1576.298,
    "text": " And those are kind of like the big, big kind of groupings of all the other things inside of there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1576.618,
    "end": 1579.481,
    "text": "There's different types of memory that you could start partitioning up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1580.522,
    "end": 1585.427,
    "text": "And so declarative memory would be like fact-based knowledge or world-based knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1585.447,
    "end": 1589.571,
    "text": "It could also include episodic memory, which is kind of blobbed into there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1590.311,
    "end": 1594.976,
    "text": "And I've done some work on modeling episodic memory because I do things with active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1595.456,
    "end": 1616.412,
    "text": " as applied to reinforcement learning so of course you need you know at least a type of replay memory to sort of refresh your you know statistics and i'll leave that vague for now and then you have working memory which are again this could be a bias on my end because i have studied things like actar but they're like buffers",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1617.313,
    "end": 1622.757,
    "text": " So I think of working memory as not just this one module, but rather many little tiny occurrences of this module.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1623.117,
    "end": 1629.281,
    "text": "And they are the glue that helps transmit information between various continents in the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1629.301,
    "end": 1631.223,
    "text": "And then we have procedural memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1631.763,
    "end": 1634.325,
    "text": "And procedural memory is really interesting to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1634.465,
    "end": 1639.769,
    "text": "And I think it resonates really strongly with just because, again, you're the Active Inference Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1640.229,
    "end": 1655.784,
    "text": " and i have done research in active inference so uh because i remember a question you had daniel on point zero he said where's the action uh and then later you guys answered that question actually but uh just to be clear there's other papers too where i try to show you how to do active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1656.144,
    "end": 1658.465,
    "text": " without even a cognitive architecture with predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1658.885,
    "end": 1662.265,
    "text": "If I ever show you these bonus slides, we could look at some of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1662.346,
    "end": 1672.468,
    "text": "But anyway, and procedural memory, I think, resonates really nicely with active inference in the sense that I put in there its dynamics model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1672.728,
    "end": 1683.891,
    "text": "So again, if we imagine we have perception and we think of that as the context of active inference, which is usually a POMDP, partially observable Markov decision process,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1685.271,
    "end": 1688.776,
    "text": " Let's assume that Markovian assumptions are okay for now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1688.936,
    "end": 1690.658,
    "text": "I have criticisms of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1690.958,
    "end": 1694.142,
    "text": "But the idea is that we have our input space, we have a latent space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1694.483,
    "end": 1697.526,
    "text": "That's what your cortices are doing, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1697.566,
    "end": 1700.971,
    "text": "Like the visual cortex is transforming beams of light or particles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1701.53,
    "end": 1707.996,
    "text": " pixels in a computer into some distributed neuronal representation, ideally very sparse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1708.176,
    "end": 1715.042,
    "text": "And this is, again, I know Blue's very interested in my aspects of sparsity, which is something I'm obsessed with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1715.823,
    "end": 1719.085,
    "text": "And I think we all should be obsessed with because that's very biological.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1720.026,
    "end": 1727.273,
    "text": "And then if we put the motor cortex as like, well, it's going to take other signals and that's where the action comes in, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1727.293,
    "end": 1728.153,
    "text": "So like, for example,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1728.934,
    "end": 1752.178,
    "text": " motor cortex is going to take information from probably information processed in the cortices maybe information queried from various pieces of memory uh transferred to the working memory and then they'll do something and then we'll get our our signals whether they come from another part of the brain like the prior preference part of the brain which is kind of like our you know uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1752.678,
    "end": 1754.359,
    "text": " goal-oriented signals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1755.18,
    "end": 1776.452,
    "text": "And then the part that, again, to go back to the procedural memory, the dynamics model that lives in there, the way that I've been modeling it, and I do this in CogEngine, but also I just do this in my robotics work too, is that that's kind of living in latent space, is trying to guess the next state, the sparse distributed state of predictive coding circuitry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1777.112,
    "end": 1779.895,
    "text": " And with that, it's saying, oh, I'm wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1780.635,
    "end": 1783.237,
    "text": "You get the basis of an epistemic signal, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1783.277,
    "end": 1785.099,
    "text": "And that's how you encourage foraging, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1785.119,
    "end": 1791.805,
    "text": "Because exploration is like, to me, my view is the soup, the real crux of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1792.125,
    "end": 1793.886,
    "text": "You don't have foraging, you don't have this...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1795.047,
    "end": 1800.091,
    "text": " epistemic kind of signal to drive you to be curious about the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1800.191,
    "end": 1809.618,
    "text": "I know you guys have talked about curiosity, but also the prior preference obviously plays a role because you can either encode goals",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1810.499,
    "end": 1838.147,
    "text": " and if we're doing rl we sort of do it like oh well we could use the reward function or maybe we train some prior model but uh the other way to look at this that's where also like homeostatic constraints could be uh you know embodied uh and that's the stuff i'm doing with carl now i'm gonna have a a nice big paper that's about to come out once i finish applying some of his edits and it'll basically address that the the life aspect of this but put that aside",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1838.947,
    "end": 1862.261,
    "text": " because it's another can of worms lots of can of worms to avoid and then the last piece of this puzzle is inside procedural memory there's the basal ganglia which is another structure I'm very obsessed with that in the prefrontal cortex and these particular constructs in the brain they do many things I mean the basal ganglia is often you know you know cited and studied for like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1862.641,
    "end": 1866.243,
    "text": " dopamine application and reward injection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1866.783,
    "end": 1868.344,
    "text": "That's where the reward signals come.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1868.364,
    "end": 1870.665,
    "text": "And I've often used that interpretation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1870.785,
    "end": 1881.09,
    "text": "But another thing, and this is why Andrea Stacco, who's at the symposium and I really enjoy talking to him, has done a lot of study of the basal ganglia.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1881.69,
    "end": 1888.334,
    "text": "He has put in his work and he has found neuroscientific evidence of it being like an information routing system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1888.994,
    "end": 1910.77,
    "text": " And that to me is a humongous tool for tackling catastrophic forgetting, because the way I see it is if I have this neural structure that is responsible for deciding what task I'm in the brain or what pieces of information to play a role in the task that I am doing, it's like suppressing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1911.19,
    "end": 1913.812,
    "text": " regions of neurons and exciting other regions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1913.872,
    "end": 1920.697,
    "text": "So it also induces sparsity to tie back to sparsity at the most extreme level, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1920.737,
    "end": 1925.0,
    "text": "It's like turning off parts of your brain and saying this is task dependent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1925.361,
    "end": 1928.042,
    "text": "And the prefrontal cortex can be argued to do some of this too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1928.883,
    "end": 1931.964,
    "text": " I haven't modeled that specifically, but I've seen other people do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1932.805,
    "end": 1934.645,
    "text": "But again, the basal ganglia was one thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1934.685,
    "end": 1937.667,
    "text": "And so I have work on that that you guys aren't also talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1937.707,
    "end": 1940.228,
    "text": "But again, I've already thrown too many papers at you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1940.308,
    "end": 1946.57,
    "text": "But focusing on just like, oh, can I do information routing with some basic predictive coding circuitry?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1948.571,
    "end": 1972.203,
    "text": " so i think that that sort of big glut of uh of speech that i just threw at you guys sort of gives you an answer daniel as to like how you would why the common model of cognition uh is so nice is what i just explained was uh i just used their blueprint i mean they didn't say the the the mechanics and the active inference part that's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1972.603,
    "end": 1974.484,
    "text": " My twist to it, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1974.965,
    "end": 1979.127,
    "text": "Oh, can I reinterpret common model of cognition through free energy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1979.147,
    "end": 1983.429,
    "text": "The answer is, well, I bet everything I have on that idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1983.449,
    "end": 1989.453,
    "text": "And then, you know, and I teamed up with someone, Mary Kelly at Carleton University.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1990.254,
    "end": 1998.901,
    "text": " And she works on, for example, Minerva 2 memory and hypervector symbolic structures and holographic memory and hypervectors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1999.282,
    "end": 2005.448,
    "text": "And that's where, even though I know Hopfield nets, that's kind of another world that, you know, they sort of intersect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2005.848,
    "end": 2007.589,
    "text": "So we we put that in there, too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2008.07,
    "end": 2011.133,
    "text": "But I don't you know, that's maybe we should save some stuff for point two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2012.694,
    "end": 2019.578,
    "text": " But what I just explained is I walked you through the blueprint, which was very vague.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2019.618,
    "end": 2025.082,
    "text": "It just said we should have these grand continents, and they might do certain things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2025.102,
    "end": 2031.526,
    "text": "They have little arrows in their diagram about information that's transferred, what modulation is going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2032.546,
    "end": 2036.108,
    "text": " But then they leave the implementation level kind of vague, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2036.128,
    "end": 2037.949,
    "text": "The idea is it could be whatever you want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2038.329,
    "end": 2043.492,
    "text": "You could implement it even classically, like in the 1980s with, you know, production systems and.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2044.033,
    "end": 2045.054,
    "text": " If-then statements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2045.074,
    "end": 2047.055,
    "text": "Yeah, this is a good diagram, actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2047.075,
    "end": 2052.498,
    "text": "Yeah, and you can kind of see all some of the key aspects of memory here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2052.518,
    "end": 2060.444,
    "text": "And again, too, what's nice, I took from Common Model of Cognition, and I do have a slide here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2060.464,
    "end": 2061.524,
    "text": "I keep saying I have a slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2061.564,
    "end": 2062.565,
    "text": "Maybe I'll show you one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2062.925,
    "end": 2086.002,
    "text": " just so i can prove to the audience i do have them uh you know the idea is that the action element the active aspect of active inference common model cognition also speaks to right it says well we have to have a motor cortex uh it doesn't tell you what to do with that motor cortex except that it's gonna you know produce some motor command and then you know it will transmit to the body",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2086.942,
    "end": 2089.283,
    "text": " And we'll leave embodiment as another thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2089.323,
    "end": 2092.283,
    "text": "That's another can of worms that I have been trying to address.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2092.363,
    "end": 2096.244,
    "text": "And inactivism, which is your niche and how that relates to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2096.304,
    "end": 2100.145,
    "text": "But let's just zoom in on the architecture of the mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2100.205,
    "end": 2101.545,
    "text": "And it has all these components.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2101.565,
    "end": 2115.108,
    "text": "So the way I envision the future, just to tie this to another question to make sure that I'm not just blabbing, but keeping us useful, is that I think the direction we're going to head or should head.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2115.589,
    "end": 2140.445,
    "text": " I don't know if everyone else will follow that is that you want to build these biological cognitive architectures um rather than just okay you know let's rely on a production system like we do in act art which is valuable I have it's not really a criticism of that because maybe the level of modeling you want to do is I want to encode this knowledge it's a lot more intuitive sometimes to encode in like if then statements and logical statements",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2140.945,
    "end": 2164.981,
    "text": " as you did in classical architectures you can interpret it easier but the part i think that we really need to push for is how do we get that type of behavior that type of self-organization uh without me hard coding this knowledge right because again it gets to expert systems and good old-fashioned ai uh we kind of don't want to be doing that we want to say can we do this in a neural way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2165.919,
    "end": 2178.192,
    "text": " And then the answer I try to jump ahead to is I say, by the way, don't do backprop because while you could do backprop, then there's, I think, work on people trying to build types of cognitive architectures with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2178.212,
    "end": 2184.339,
    "text": "At least it's a better step than, you know, chat GPT and claiming that that solves cognition because it doesn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2185.44,
    "end": 2186.8,
    "text": " And I am in that camp.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2187.461,
    "end": 2189.962,
    "text": "But again, leave that can of worms somewhere else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2190.123,
    "end": 2196.066,
    "text": "But the idea is that you skip that and go into something that's biological, which is predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2196.787,
    "end": 2197.968,
    "text": "There are other things you can do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2198.268,
    "end": 2201.07,
    "text": "I actually am working on other things besides predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2201.63,
    "end": 2205.532,
    "text": "Maybe we can chat about that in future directions if that question comes up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2206.533,
    "end": 2211.696,
    "text": "But I think predictive coding and predictive processing offer you a lot of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2213.33,
    "end": 2218.595,
    "text": " That, you know, other algorithms right now might or might not give you they might have drawbacks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2219.696,
    "end": 2236.089,
    "text": "And this could even help answer if the question comes up, Daniel, if you're interested, like, what aspects of neurobiology does that bring to the table, but I also think it has the best way to convince machine learning individuals is to explain the practical elements of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2236.787,
    "end": 2239.849,
    "text": " because a lot of times they'll say, well, who cares about modeling the brain?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2239.889,
    "end": 2241.67,
    "text": "I just want to build an intelligent system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2242.571,
    "end": 2249.476,
    "text": "But you can use predictive coding and predictive processing as a pragmatic type of argument.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2249.536,
    "end": 2251.917,
    "text": "And you can say, hey, well, you get this, you get this, you get this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2251.997,
    "end": 2257.881,
    "text": "And among those arguments is sparsity, but there's even more powerful pieces that we could go into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2258.562,
    "end": 2261.844,
    "text": "I think I'm going to stop now because that's a lot of information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2261.884,
    "end": 2264.926,
    "text": "I don't know if I missed any piece of your question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2266.809,
    "end": 2267.77,
    "text": " That's great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2267.79,
    "end": 2270.253,
    "text": "I'll ask a short question from the chat.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2270.553,
    "end": 2279.644,
    "text": "Viet writes, can we represent declarative memory with neural network-based techniques such as HopfieldNet?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2279.724,
    "end": 2280.485,
    "text": "Did you say Viet?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2281.266,
    "end": 2281.546,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2283.408,
    "end": 2285.25,
    "text": "I believe that's one of my students.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2285.411,
    "end": 2285.611,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2287.717,
    "end": 2291.899,
    "text": " So, yeah, he's also works on active inference as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2292.019,
    "end": 2295.481,
    "text": "So I'm not surprised that he would throw a question like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2296.281,
    "end": 2297.222,
    "text": "The answer is yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2298.862,
    "end": 2305.445,
    "text": "You can, actually, there's a lot of good work already, even without the cognitive architecture kind of structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2305.465,
    "end": 2313.809,
    "text": "Because again, think of the common model cognition is like a blueprint that tells you what things you're going to need to have and how they interact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2314.589,
    "end": 2323.755,
    "text": " But if you zoom in on one of those continents, declarative memory, as was pointed out in the question, for example, you can use vector symbolic structures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2323.795,
    "end": 2326.616,
    "text": "You can use, for example, Minerva 2 memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2327.177,
    "end": 2327.937,
    "text": "There's a lot better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2328.157,
    "end": 2331.759,
    "text": "I would recommend faster models, which are Hebbian-based systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2331.799,
    "end": 2340.925,
    "text": "You can model Hebbian memory, associative memory, heterossociative memory with a lot of these simple Hebbian-like constructs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2340.985,
    "end": 2342.766,
    "text": "The learning is very efficient as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2343.466,
    "end": 2354.472,
    "text": " They don't come without the drawbacks, but so the answer is yes, and you can model them with, I think, Hebbian networks, Hebbian learning, which is a correlational local learning rule.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2355.432,
    "end": 2359.715,
    "text": "The other part with the Hopfield network, you can also do that, and it's weird because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2360.737,
    "end": 2382.44,
    "text": " while uh the work i have currently done said we will do hopfield networks in our cognitive architecture which we'll probably chat more about that in point two cog engine uh but we do have plans to do like uh what do you call it modern hopfield networks that's a particular uh instantiation of hopfield nets that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2383.479,
    "end": 2392.223,
    "text": " It's actually very efficiently implementable, as I've discussed with my collaborator, Mary, and others like Robert West at Carlston.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2393.632,
    "end": 2395.013,
    "text": " talking about these types of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2395.073,
    "end": 2404.621,
    "text": "But you can use a Hopfield network to create that dynamical attractor interpretation I was telling Blue about earlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2404.641,
    "end": 2408.224,
    "text": "And the idea is that it'll have a certain capacity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2408.524,
    "end": 2418.272,
    "text": "But the problem is we need to make sure that we have enough capacity because, again, I don't think I ever completely properly answered Blue's question about variants or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2418.772,
    "end": 2423.733,
    "text": " you know, differences between what's, you know, reality versus what you think reality is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2423.853,
    "end": 2427.454,
    "text": "And there's some interesting connections to predictive coding that also answer that question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2428.314,
    "end": 2434.876,
    "text": "But the idea is that if you have, you know, one single Hopfield network, that might not be enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2434.916,
    "end": 2447.299,
    "text": "But I imagine chaining a bunch of these together to create what I call an assembly or an assembloid, to use one of Carl's words, assembloids of Hopfield nets, I think is one way to build",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2448.319,
    "end": 2451.482,
    "text": " A completely neural implementation of declarative memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2452.903,
    "end": 2464.411,
    "text": "Another piece of declarative memory that we did model, I won't argue it was the most efficient thing you should do, but it can be done, is Minerva 2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2465.092,
    "end": 2466.713,
    "text": "And again, you can look it up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2466.793,
    "end": 2470.035,
    "text": "It's Hintzman and all and Hintzman's old work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2470.255,
    "end": 2474.458,
    "text": "It's an approximation of a large heavy and auto-associative memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2475.439,
    "end": 2481.903,
    "text": " And what we did is we modeled the episodic memory with like a big Minerva 2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2482.344,
    "end": 2493.111,
    "text": "The reason I say it's not a good idea is Minerva 2 is really slow because it's kind of like approximating this Hebbian associativity with like a weird echo query style lookup table.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2494.191,
    "end": 2501.356,
    "text": "At least the implementation and even when you vectorize it and put it in TensorFlow or, you know, your favorite linear algebra backend,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2502.096,
    "end": 2503.738,
    "text": " You can only get so much of a speedup.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2503.778,
    "end": 2507.961,
    "text": "So for very big memories, I don't think that's the right place to do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2508.221,
    "end": 2517.628,
    "text": "But the value of what we did is we essentially tried to emulate what episodic memory does when you do replay and reinforcement learning, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2517.688,
    "end": 2528.656,
    "text": "So you have to do some weird hacks to make the episodic memory predict the next thing rather than recall this thing from a corrupted input vector.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2529.037,
    "end": 2530.738,
    "text": "That's called heterossociative memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2531.638,
    "end": 2547.548,
    "text": " And we did some things with like a window and we said, hey, have this predict the next sensory or sorry, latent vector, since, you know, I told you live in latent space in the cognitive architecture, maybe predict what you thought the original action you're taking and the reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2547.588,
    "end": 2549.809,
    "text": "And we sort of use that to roll out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2550.289,
    "end": 2553.55,
    "text": " little streams or mini streams of episodes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2554.27,
    "end": 2559.532,
    "text": "And then we use that to train the modules that are inside the cognitive architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2559.652,
    "end": 2573.257,
    "text": "For example, if you do replay, you can refresh the dynamics model, you can refresh the motor cortex, because again, you're querying this episodic declarative memory to say, hey, remember these little tiny mini experiences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2573.957,
    "end": 2589.373,
    "text": " um the other problem with minerva 2 was that all you can only remember so far into the future so it gets a little wonky and hacky when you try to build like these like little lookup windows but there are better memories out there and i actually my collaborator and i've talked about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2590.374,
    "end": 2594.477,
    "text": " using modern hotfield networks as one possible construct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2594.537,
    "end": 2596.559,
    "text": "And they're very cleanly implementable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2596.579,
    "end": 2602.984,
    "text": "They almost look like autoencoders, which is kind of crazy, at least from the engineering point of view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2603.184,
    "end": 2609.009,
    "text": "And so once you understand that, you're like, oh, I could build all of these and build, again, what I said earlier,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2609.509,
    "end": 2633.004,
    "text": " assembloids right or assemblies of uh these hot field network structures right and maybe see what those do uh when i want to recall particular pieces of experience so that would be the answer to your question uh i would say i only have some experience with the episodic piece of declarative when it comes to like the world fact graph organizational knowledge",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2633.624,
    "end": 2635.245,
    "text": " I don't have much to say yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2635.345,
    "end": 2642.367,
    "text": "I know you can use Minerva 2 and vector symbolic and holographic memory and Hopfield memory to emulate that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2642.467,
    "end": 2645.428,
    "text": "People have done that on, for example, language tasks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2646.389,
    "end": 2649.41,
    "text": "Another really nice name, and he's done work on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2650.11,
    "end": 2652.791,
    "text": " I don't know if you guys in the Active Inference Institute know him.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2653.372,
    "end": 2656.273,
    "text": "Ben Goertzel, he's, you know, a premier researcher.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2656.573,
    "end": 2659.634,
    "text": "OK, you know, Ben, I see you shaking, you know, an AGI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2659.654,
    "end": 2660.355,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2660.415,
    "end": 2661.715,
    "text": "And he has OpenTog.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2662.195,
    "end": 2667.078,
    "text": "And I know that he's done some really nice work on graphs, knowledge graphs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2667.398,
    "end": 2670.179,
    "text": "And there's people that have had discussions with him about graphs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2670.359,
    "end": 2681.575,
    "text": " Neural implementations of that, because when he and I have talked, and I also work a bit with him too, I've said to him, you know, okay, what would be the, like, purely neural version of this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2681.656,
    "end": 2686.523,
    "text": "And there are ways to do it, whether it's simulatable in our, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2687.123,
    "end": 2688.425,
    "text": " computing systems nowadays.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2688.485,
    "end": 2689.065,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2689.306,
    "end": 2693.03,
    "text": "It can be expensive, but it can be done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2693.39,
    "end": 2705.322,
    "text": "OpenCog might provide a nicer, cleaner answer than I possibly could today about the world fact knowledge and graph organization of how we think about concepts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2706.864,
    "end": 2709.387,
    "text": "I think OpenCog has some of that answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2710.267,
    "end": 2719.069,
    "text": " But again, I'm going to speak with that as the final statement and boundary of my knowledge and let the audience look into that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2719.629,
    "end": 2722.15,
    "text": "But I do recommend Ben Goertzel's work in that area too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2722.57,
    "end": 2735.713,
    "text": "So Robert West, Ben Goertzel, these are some really nice names to kind of look at how they either use the common model of cognition or they build their own cognitive architecture and they model certain pieces of this structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2736.813,
    "end": 2739.277,
    "text": " that have nothing to do with, let's say, predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2739.297,
    "end": 2743.763,
    "text": "Because Ben, the reason he's working with me is because I've said, oh, we should do it with predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2743.983,
    "end": 2745.245,
    "text": "He was like, that's a great idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2745.265,
    "end": 2748.81,
    "text": "And so, you know, hence, collaborations get born.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2750.134,
    "end": 2766.185,
    "text": " So, yeah, and obviously, and as Daniel's writing that statement, you'll notice I'm extremely biased, but I think with rather good reasoning, even from a neuroscientific point of view, there's a lot more evidence for predictive coding than there is for backprop in the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2766.665,
    "end": 2773.09,
    "text": "Plus, you can approximate backprop with predictive coding if you squint at it and make the right theoretical assumptions in the right way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2773.61,
    "end": 2777.935,
    "text": " So, obviously, I'm going to say everything should be built with predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2778.876,
    "end": 2791.068,
    "text": "And then also the beautiful thing, and I know Carl will like this if he ever watches this is, you know, then you can also state it's optimizing or minimizing a variational free energy and we can derive where that comes from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2791.528,
    "end": 2793.511,
    "text": " And it's a it's a Bayesian model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2793.551,
    "end": 2793.851,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2793.931,
    "end": 2796.834,
    "text": "And so you have this Bayesian graphical model interpretation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2798.196,
    "end": 2800.679,
    "text": "It's a really, really elegant framework, too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2800.799,
    "end": 2803.582,
    "text": "So that's another strength, I think, of predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2803.602,
    "end": 2806.666,
    "text": "I guess I am the market man for it now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2806.826,
    "end": 2810.069,
    "text": "But but I really do believe in it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2810.63,
    "end": 2811.091,
    "text": "And yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2811.911,
    "end": 2820.335,
    "text": " And it's served me well over the last, I mean, as I'm coming up on almost, if we count grad school, almost on a decade of working on this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2820.635,
    "end": 2831.8,
    "text": "And I do think predictive coding is at the forefront of where we need to go if we want, you know, biological, human-like even, machine intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2832.941,
    "end": 2835.762,
    "text": "And I'm going to stop there too, because I don't know if there's more questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2836.302,
    "end": 2837.043,
    "text": "I can keep going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2837.063,
    "end": 2837.583,
    "text": "I'm very...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2839.744,
    "end": 2854.598,
    "text": " yeah it's awesome very um encouraging certainly you lay it out differently everyone does but you lay it out very differently it's actually very rare to start",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2858.656,
    "end": 2883.075,
    "text": " on a high road it's not exactly the high road laid out by the free energy principle but this kind of approach to cognitive science which is like let's sketch out the functionalities and then drill in that's how a big tent is built because it clarifies that there's all these different implementational techniques none of which can be all things in all settings and then another another",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2884.52,
    "end": 2912.195,
    "text": " piece that that the work holds up is what's biological when after all the neural network is the great great great grandchild already of a cell type and so what what is modern and biological and then it just made me think about how there's the pure biomimicry which is usually like if somebody were actually interested in studying that system to resolve some pathology or just to do natural history",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2913.055,
    "end": 2931.328,
    "text": " and that's one sense that we might be doing biologically inspired computation but whether it's leaving the door open to our alien colleagues or developing new synthetic intelligences we need something that's both biological but also novel and then this leads to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2932.088,
    "end": 2959.463,
    "text": " consideration of what are the fundamental constraints other than the historiosity of the life forms today with two wings or six legs or whatever they may be what are the real features and that's where we complement those fundamental attributes identified by the common cognitive model like memory action selection and perception where those come together with like local processing only",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2960.484,
    "end": 2969.507,
    "text": " And then also some more potentially aspirational things like low energy compute and other features.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2970.687,
    "end": 2976.649,
    "text": "So these are just some big topics and it's kind of like, come work on it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2976.909,
    "end": 2980.69,
    "text": "These are the challenges because they're laid out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2980.97,
    "end": 2984.171,
    "text": "The challenges are not esoteric at all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2985.569,
    "end": 2993.698,
    "text": " Oh, we've either known about some of them for a while and just never resolve them or or they're becoming more pressing in today's day and age.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2993.719,
    "end": 2996.682,
    "text": "Like you brought up the energy compute part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2996.802,
    "end": 2996.982,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2997.042,
    "end": 2998.164,
    "text": "And energy efficiency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2998.224,
    "end": 3000.887,
    "text": "And, you know, we had global warming.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3001.467,
    "end": 3005.892,
    "text": " Regardless of whether or not you want to accept it is upon us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3006.633,
    "end": 3009.896,
    "text": "And we have the problems of even an AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3009.976,
    "end": 3012.88,
    "text": "There's this thing called green AI versus red AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3012.92,
    "end": 3020.708,
    "text": "And I've written a little bit about this in some of my papers as a motivation to look into biology because the brain is AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3021.088,
    "end": 3031.514,
    "text": " Regardless of its own limitations, every biological system has trade-offs that it has to make, but it is an extremely energy efficient system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3031.815,
    "end": 3037.358,
    "text": "And it's an example of beautiful parallelism as well as low energy compute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3037.698,
    "end": 3040.2,
    "text": "And if we could get even just a little bit of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3040.82,
    "end": 3064.527,
    "text": " in our systems today that would be huge so i think that's a nice uh motivation of course i also work in well i know you guys talked about one of my papers spiking neural nets which gets us into neuromorphics and neuromorphic computing and i think there's a lot of really nice hardware in silico that's out there that we could take advantage of but the key is finding the right algorithms",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3065.566,
    "end": 3070.192,
    "text": " that we could implement there and carry over the best of all the worlds, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3070.212,
    "end": 3080.105,
    "text": "The best principles that our software simulations and mathematical arguments make, but then instantiate them in, you know, let's say a memorister crossbar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3080.946,
    "end": 3086.031,
    "text": " and I've worked and talked with different people, including Intel's Loihi chip.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3086.051,
    "end": 3090.515,
    "text": "And I'm not saying that there's many different ways you can build these constructs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3091.937,
    "end": 3096.761,
    "text": "And I know that because I've watched some of Carl's chats with you guys and talked with Carl about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3097.141,
    "end": 3102.426,
    "text": "Also, I do think the biological chimeric implementations is a really cool area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3103.027,
    "end": 3104.008,
    "text": "I'm a huge fan of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3104.508,
    "end": 3116.674,
    "text": " organoids and organoid intelligence, I think that that's a humongous place that's like a new frontier almost, given Smirnov's work and a couple other people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3116.714,
    "end": 3127.199,
    "text": "I think that's where these ideas of predictive coding and the computational models we build are valuable to even consider in these biological systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3127.239,
    "end": 3133.903,
    "text": "Either study them and see do they match back to my mathematical theoretical predictions or can we",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3134.823,
    "end": 3142.504,
    "text": " manipulate or engineer them to maybe induce similar kinds of compute, or maybe we'll just see that it pops out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3142.564,
    "end": 3149.626,
    "text": "Maybe they're just doing predictive coding and we're going to see that these neuronal structures emerge, and I think that would be fascinating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3150.386,
    "end": 3162.588,
    "text": "A quick point I want to add, because I see Blue raising her hand, so I just want to mention that the thing I like about my interpretation of predictive coding, and it's not only my own, it's just that I carry that forward, is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3163.208,
    "end": 3167.213,
    "text": " Predictive coding, as I've talked to people, is interpreted in a lot of different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3167.874,
    "end": 3177.826,
    "text": "In psychology, predictive coding kind of has similarities, but it's not quite where I work, which is the mechanistic version of predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3178.366,
    "end": 3179.106,
    "text": " And it's interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3179.327,
    "end": 3188.571,
    "text": "I think you can borrow those worlds like, hey, the idea of predicting error and feeding that back in or matching discrepancies in our memories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3189.231,
    "end": 3190.572,
    "text": "That's a beautiful concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3190.632,
    "end": 3192.373,
    "text": "And that's what psychologists look at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3192.433,
    "end": 3194.794,
    "text": "Cognitive scientists kind of see things in that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3195.875,
    "end": 3198.096,
    "text": "Biologists and neurobiologists might sometimes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3198.396,
    "end": 3213.34,
    "text": " talk about predictive coding, but they might not necessarily mean it in the concrete ways that my work, which was inspired by Regis Rouse and others, to say, let me build you the exact mechanics and the dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3213.36,
    "end": 3215.22,
    "text": "And I think that's important to get right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3215.24,
    "end": 3218.961,
    "text": "I am, even though recently I'm getting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3219.821,
    "end": 3241.017,
    "text": " a little more philosophical, which I love, and theoretical in talking to Carl and others and Ben, there's this engineer in me that cannot divorce away the very specific dynamics and not just the mathematical, like, oh, the ordinary differential equations, but how does that get implemented efficiently?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3241.297,
    "end": 3260.807,
    "text": " Because I think that's what lies in the future is the marriage of these kind of high level theoretical, mathematical, philosophical concepts, their mechanistic description, which is what like predictive coding says, hey, one set of neurons tries to get another set of neurons firing rates or their activities and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3261.147,
    "end": 3271.709,
    "text": " We can feed that back in and you can repeat this motif and build very beautiful constructs like what I try to do in cognitive architectures or little POMDP systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3272.189,
    "end": 3274.27,
    "text": "And then we also have the spikes, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3274.55,
    "end": 3278.471,
    "text": "How does that compute happen at this very fine green level?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3278.871,
    "end": 3281.051,
    "text": "And then how does that get put onto a chip?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3281.712,
    "end": 3283.272,
    "text": "And then I think the other piece that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3284.315,
    "end": 3287.736,
    "text": " and then I'll shut up, is the connection to the niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3288.616,
    "end": 3292.257,
    "text": "I think it goes back to the body, and you can't ignore the body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3292.277,
    "end": 3298.819,
    "text": "And I have a lot more to say about that, but I'm going to bite my tongue for a little bit because I want you guys to read that paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3298.859,
    "end": 3300.719,
    "text": "Maybe we'll have another chat in the future about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3301.62,
    "end": 3304.46,
    "text": "Carl and I have really thought very deeply about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3304.9,
    "end": 3310.602,
    "text": "The role of the body, and that has nothing to do sometimes with neurons, or at least not the neurons that we model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3311.082,
    "end": 3312.242,
    "text": " And then the niche itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3312.702,
    "end": 3313.843,
    "text": "And how does that have a role?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3313.883,
    "end": 3321.264,
    "text": "And then I know you can go into and I know all the cognitive theories like extended cognition, embedded cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3321.544,
    "end": 3325.044,
    "text": "How do other agents and cultures and tools play a role?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3325.765,
    "end": 3331.145,
    "text": "The extended theory of mind, because I did study that as a philosopher.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3331.165,
    "end": 3338.407,
    "text": "So I think like all those parts are going to those all need to be reconciled and build this kind of framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3338.427,
    "end": 3339.727,
    "text": "And I think, Daniel, you're right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3340.657,
    "end": 3344.078,
    "text": " You can use blueprints like the CMC as a stepping stone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3344.298,
    "end": 3350.38,
    "text": "And I think that that top-down way is a nice way, but then you also merge it with all this bottom-up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3350.46,
    "end": 3354.181,
    "text": "It's kind of like you're doing predictive coding, but in the scientific realm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3354.221,
    "end": 3363.964,
    "text": "You have this top-down kind of direction you want to fill, but then you have all this mechanical, low-level stuff that you really can't ignore if you want energy efficiency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3364.384,
    "end": 3387.854,
    "text": " and where do they meet in the middle so it's a bottom up top down which is beautiful because it it repeats the the metaphor of biology and i'll stop because i see blue it's time to let someone else speak you did it yeah so you really like stole my thunder there oh sorry about that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3388.983,
    "end": 3416.373,
    "text": " i have a lot to say sometimes it's okay no no it's perfect so i really wanted to ask about the role of the niche and especially like in when we're talking about like energy efficiency and predictive coding and the compute power etc like i think about um like what makes us efficiently able to do cognition and it really is like cognitive offloading into the niche like the internet the phone like click click click now i know this right and then even like with non-human systems like ants like leaving",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3416.793,
    "end": 3442.535,
    "text": " pheromone traces in the environment that convey a ton of information as to where to go and what to do and so how can we then bring the efficiency of cognitive arc cognitive offloading into cognitive architectures that we can then leverage for increased compute power with very little um you know effort on in terms of like the actual compute so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3443.715,
    "end": 3446.459,
    "text": " The answer to your question is extremely hard.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3446.499,
    "end": 3448.321,
    "text": "It's a grand challenge, if you will.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3449.723,
    "end": 3458.615,
    "text": "I would say that the right path, and these things are okay for me to share because thankfully they are not all of my invention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3462.045,
    "end": 3478.833,
    "text": " to think about how other agents and other tools could be efficiently used to allow our own agents, our artificial agents, to achieve their tasks, you do need to now finally answer the question of the body and the question of the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3479.014,
    "end": 3481.135,
    "text": "And I've been thinking a lot about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3481.475,
    "end": 3483.636,
    "text": "And let's just assume that you can simulate it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3483.676,
    "end": 3485.637,
    "text": "That's another issue in and of itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3485.737,
    "end": 3487.778,
    "text": "But you pick your world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3487.958,
    "end": 3510.989,
    "text": " right so let's say i'm going to so i okay actually i'll pick i'm going to start with my body i'm going to do a quadruped robot right like you know uh what is it big dog or spot right the little robots that are out there and that's going to be my my actual morphological construct the body in which that i'm going to manipulate it now that body let's assume that i have access to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3511.409,
    "end": 3532.489,
    "text": " all aspects of its physical mechanics okay and it's artificial hard-coded routines because robotics have a lot of like automated procedures like you're not going to necessarily need to manipulate every piece of the arm you know you're going to use like take advantage of inverse kinematics and other algorithms that allow you to say i just need to move this point and the rest of the arm will kind of coordinate around that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3533.445,
    "end": 3539.649,
    "text": " And that is an offload of what the neurons need to do, or the neural compute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3539.75,
    "end": 3546.955,
    "text": "Let's say organized, and I'm a fan of common model cognition, so let's assume you build your little brain from the CMC point of view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3547.495,
    "end": 3548.556,
    "text": "That's going to, again,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3549.056,
    "end": 3557.481,
    "text": " not worry that much about the fine-grained mechanics of the pieces of, let's say, the quadruped's front right arm, right, or front left arm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3557.861,
    "end": 3568.108,
    "text": "It's going to offload because it knows that as long as I tell you I plan to move this piece of my, you know, I don't know, joint in this direction, the rest of the arm is going to fall along.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3568.348,
    "end": 3570.429,
    "text": "You've already now done embodiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3570.709,
    "end": 3575.453,
    "text": " which is embodied cognition, which says, and I'm on the extreme end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3575.733,
    "end": 3576.754,
    "text": "There's like spectrums.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3577.074,
    "end": 3578.495,
    "text": "I've studied cognitive science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3579.036,
    "end": 3581.978,
    "text": "There's the body kind of influences the mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3582.038,
    "end": 3584.16,
    "text": "Then there's isolated cognition, brain in a vat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3584.32,
    "end": 3589.544,
    "text": "And then there's really strong embodiment, which is the body does a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3589.904,
    "end": 3594.067,
    "text": " And the brain kind of just says, hey, let me send you a little control signals to manipulate you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3594.527,
    "end": 3595.668,
    "text": "So that's the embodiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3596.148,
    "end": 3597.509,
    "text": "Now we get to the niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3597.629,
    "end": 3602.132,
    "text": "And by the way, so I've already started to answer your question because I picked the body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3602.472,
    "end": 3608.937,
    "text": "You're going to need to commit yourself to a construct, which, by the way, means you're not as general as you would want to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3609.037,
    "end": 3612.839,
    "text": "But it gets you a chance to answer the question because now you say quadruped.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3613.2,
    "end": 3614.36,
    "text": "Now you say, what's the niche?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3614.721,
    "end": 3616.742,
    "text": "Where is that quadruped going to operate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3616.942,
    "end": 3617.903,
    "text": "And I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3617.923,
    "end": 3619.564,
    "text": "I'm going to pick something really simple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3620.705,
    "end": 3627.689,
    "text": " Outside my office, there's, you know, some hills and some grass and some trees, and I'm going to specify this little world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3628.41,
    "end": 3638.196,
    "text": "Maybe I'm going to design some way of recharging that robot's batteries, you know, because obviously we need to create some type of life-giving force, some resources.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3638.996,
    "end": 3642.339,
    "text": " for this to look for, and I specify other properties of my environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3642.379,
    "end": 3644.2,
    "text": "Now I've specified my niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3644.821,
    "end": 3650.545,
    "text": "Now I've answered concretely the exact world that my quadruped is going to operate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3650.946,
    "end": 3654.508,
    "text": "So now I know the inactive cognition comes into play, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3654.548,
    "end": 3657.611,
    "text": "Because now I have to interact with the physics of my world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3658.031,
    "end": 3659.792,
    "text": "It's going to manipulate the robot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3659.832,
    "end": 3661.594,
    "text": "It's going to damage the robot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3661.894,
    "end": 3664.075,
    "text": " The robot's going to have to respond to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3664.915,
    "end": 3670.638,
    "text": "So remember, under the hood is like a CMC neural predictive kind of neural construct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3670.998,
    "end": 3673.319,
    "text": "It's offloading a lot of its cognition to the body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3673.719,
    "end": 3678.522,
    "text": "The body says, oh, I'm going to also take advantage of sensors that I can read in my environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3678.582,
    "end": 3681.103,
    "text": "I know like I don't want to be maybe in a very hot area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3681.483,
    "end": 3696.514,
    "text": " that starts to you know interact badly with certain properties of the robotic construct and then to now get at uh the answer to what you said about other things well in this world i should also and i think there's some work in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3697.755,
    "end": 3703.097,
    "text": " I cited it in the one paper that's going to come out about tools.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3703.197,
    "end": 3708.659,
    "text": "You have to specify what are objects that are manipulable, so you need to define your affordances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3708.719,
    "end": 3711.16,
    "text": "And by the way, this is again defining the niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3711.68,
    "end": 3717.622,
    "text": "I think it's really important not to just say, oh, I'm going to throw it in any environment and it'll work somehow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3717.902,
    "end": 3725.505,
    "text": "You need to define the properties of your niche to some degree because that's how we can also experimentally analyze and study what's going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3725.985,
    "end": 3727.586,
    "text": " And you say, what are the affordances?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3727.906,
    "end": 3729.147,
    "text": "What are things that I can do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3729.167,
    "end": 3734.809,
    "text": "What properties of environment am I able to manipulate that I, let's say, even want to that could help you model this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3735.63,
    "end": 3743.494,
    "text": "And then you introduce other quadrupeds with the same exact underlying cognitive structure, because let's say we're not going to do heterogeneous",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3745.114,
    "end": 3746.235,
    "text": " multi agent system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3746.275,
    "end": 3764.487,
    "text": "So, you know, I introduced a couple other spots, right, which are also operating under the same principles, they minimize a variational free energy inside the common model of cognition, they have the same, you know, roughly, you know, artificial dynamics that they can offload to their robot bodies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3765.188,
    "end": 3769.711,
    "text": "And they could work together, right, they can create herds, right, they could have herd behavior,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3770.211,
    "end": 3776.295,
    "text": " or group behavior, because maybe now they're going to find those port charges or whatever the resources is that I allow them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3776.555,
    "end": 3778.517,
    "text": "Maybe they're solar powered.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3778.577,
    "end": 3778.917,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3778.977,
    "end": 3782.139,
    "text": "I mean, they have solar panels and they need to collect from the sunlight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3782.159,
    "end": 3784.16,
    "text": "But obviously, if it rains, they need to hide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3784.581,
    "end": 3788.283,
    "text": "And so you can now say those dynamics, those groups, now they interact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3788.303,
    "end": 3790.505,
    "text": "Maybe one of the spot bots found a good area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3790.525,
    "end": 3796.469,
    "text": "And this is a really good place to exploit their prior preference, which is to survive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3796.549,
    "end": 3797.87,
    "text": "Hey, I want more energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3797.93,
    "end": 3799.671,
    "text": "I need to just continue living, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3800.271,
    "end": 3802.694,
    "text": " I think life is the place you have to look.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3803.815,
    "end": 3804.676,
    "text": "They don't want to die.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3804.696,
    "end": 3806.058,
    "text": "They don't want to terminate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3806.518,
    "end": 3808.32,
    "text": "So they're going to work together to do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3808.36,
    "end": 3811.704,
    "text": "So that answers the embedded part, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3811.744,
    "end": 3816.91,
    "text": "Because the embedded aspect of it is the cultural, and this is an approximation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3816.95,
    "end": 3817.991,
    "text": "I'm not going to claim that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3818.932,
    "end": 3823.855,
    "text": " a little herd of quadruped spot bots are going to have a society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3824.436,
    "end": 3835.465,
    "text": "I don't know, that's an emergent property perhaps, but they'll have some means of communication and that way allows them to organize themselves as their own little system in their niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3835.685,
    "end": 3838.167,
    "text": "Then of course, because we specified the affordances,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3838.707,
    "end": 3856.008,
    "text": " and properties in the environment that you can manipulate, you have extended cognition because these tools allow them to better survive, better find those areas that, for example, allow them to charge their batteries or collect sun at the right times and avoid damage from the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3856.468,
    "end": 3876.436,
    "text": " you know when it's raining or when there's inclement weather and again i'm kind of like vaguely describing a very complex niche you could really experimentally control maybe make it a lab and you know you have artificial blocks and charging ports and maybe you could kind of simplify this a little bit but i think that's where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3877.336,
    "end": 3892.354,
    "text": " that doesn't like give you the exact answer because you know if i had the exact answer i probably would have implemented it and we would have solved agi right but i do think that's the pathway to answering your question right it says if you want",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3892.958,
    "end": 3913.307,
    "text": " to even have a chance at scratching at the answer of efficient interactions with the environment, using objects and tools to solve problems and offload your cognition to these, let's say, non-neural, non-biological entities or these non-living or non, let's say,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3913.607,
    "end": 3914.508,
    "text": " Planning entities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3914.568,
    "end": 3926.802,
    "text": "I know Carl talked to you guys long ago about the difference between like, well, the environment's also its own system, but it doesn't plan, but it's, you know, subject to thermodynamic constraints and the entity itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3928.784,
    "end": 3932.245,
    "text": " is also, you know, that one is different because it can plan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3932.425,
    "end": 3938.247,
    "text": "So there's like a little bit of like, you know, its own ability to change its outcomes with planning as inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3939.207,
    "end": 3944.188,
    "text": "So you could kind of like use that as your starting point to say, I need to define the niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3944.789,
    "end": 3946.129,
    "text": "I need to define the body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3946.509,
    "end": 3950.65,
    "text": "Then I need to define the organization of the brain structure that goes into that body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3950.67,
    "end": 3952.691,
    "text": "Because you do need to have the neural part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3952.711,
    "end": 3957.312,
    "text": "We're going to, if we're interested in modeling, let's say a very high level cognition model,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3957.672,
    "end": 3961.196,
    "text": " behavior and how does that interact with the hardware?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3961.316,
    "end": 3965.82,
    "text": "And that's another question in of itself that I've been thinking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3966.401,
    "end": 3974.789,
    "text": "And I think with all of that, you get a chance to now simulate, do experiments, and actually see how does that efficient interaction emerge, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3975.61,
    "end": 3987.366,
    "text": " Can we study aspects of embedded cognition into this little experimental niche and agent niche and collective agent niche setup that I've constructed?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3987.466,
    "end": 3989.829,
    "text": "So I think that's an interesting place that...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3990.55,
    "end": 3991.972,
    "text": " I this is where I would go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3991.992,
    "end": 3992.632,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3992.692,
    "end": 3994.934,
    "text": "And I'd love to go if I have resources.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3995.094,
    "end": 4000.139,
    "text": "But, you know, these are that I think that gives you a chance to begin to answer that question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4000.499,
    "end": 4006.805,
    "text": "And it will tell you what's wrong with a lot of things, too, because I think it'll say you're going to quickly, especially if you just even pick the body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4007.711,
    "end": 4013.936,
    "text": " and you're doing embodied cognition, you say, hey, wait a minute, this neural construct, let's say backprop, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4014.657,
    "end": 4016.398,
    "text": "It isn't working very well, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4016.438,
    "end": 4017.079,
    "text": "Because why?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4017.119,
    "end": 4018.66,
    "text": "I need to unroll in time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4018.7,
    "end": 4022.343,
    "text": "I need a time machine to do backprop with time-based data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4022.623,
    "end": 4025.045,
    "text": "But predictive coding doesn't really need that, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4025.265,
    "end": 4033.152,
    "text": "Oh, probably that might be the right neural structure for the brain because now it interacts with my robot hardware, which has very limited resources.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4033.172,
    "end": 4034.573,
    "text": "You have very limited memory, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4034.933,
    "end": 4036.734,
    "text": " and compute that you can run with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4036.854,
    "end": 4040.416,
    "text": "So already there, you've now manipulated your software.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4040.456,
    "end": 4049.721,
    "text": "You have now co-designed the hardware and the software a little bit to interact in the context of this morphological construct, your body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4050.281,
    "end": 4051.302,
    "text": "And because you've",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4051.562,
    "end": 4053.703,
    "text": " You've also defined where it's going to operate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4053.983,
    "end": 4057.283,
    "text": "You also understand what properties of the environment you need to be aware of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4057.323,
    "end": 4066.986,
    "text": "Maybe you can build that as an inductive bias into the system because we don't want to play evolution because that's usually how you emerge these systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4067.066,
    "end": 4074.408,
    "text": "But I don't know if I want to wait doing genetic algorithms for whatever simulated thousands and thousands of years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4074.828,
    "end": 4077.688,
    "text": "So maybe we need to build those inductive biases as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4077.708,
    "end": 4079.609,
    "text": "And that's another interesting research area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4080.612,
    "end": 4083.493,
    "text": " I think now I'm digressing, so I'm going to stop there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4085.334,
    "end": 4086.454,
    "text": "It's great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4086.575,
    "end": 4091.797,
    "text": "Again, just the pathway is clear.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4091.857,
    "end": 4100.24,
    "text": "And in fact, this is even in some ways an anti-reductionist pathway that actually starts from the bigger context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4100.28,
    "end": 4103.862,
    "text": "You stepped through specification of the niche in the context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4104.542,
    "end": 4133.463,
    "text": " getting to the embodiment including the extended embodiment pheromones and all of this with a niche like each time you step through then to the brain the body then into the multi-agent and then that is where the evolutionary and ecological dynamics kick into play eco evo devo is going to pick up once there's like a population even if it's an in silico population that has resource constraints or it actually is a materialized system um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4134.464,
    "end": 4155.929,
    "text": " then the ball's rolling and it either persists or doesn't it's like a landing strip for our efforts and and a organizing principle for our research whether we're like just beginning to do cognitive science research and thinking about",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4157.162,
    "end": 4177.314,
    "text": " going to grad school or something or trying to recap on this flurry of development over the last years of being aware for a long time um it's actually a to me a mark of the advancement not just like how fast or performant the systems are but how many index card type",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4180.35,
    "end": 4204.539,
    "text": " agreements or ways of coordinating that we have we have the common model we have of course active and free energy principle which we've barely talked upon we have this kind of general agreement of the structuring of cognitive systems and then that organizes otherwise what would be essentially arbitrary unlimited information",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4205.578,
    "end": 4219.064,
    "text": " because the scope of cognitive sciences is so vast that having some of these categorizing strategies as part of our recall system is part of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4219.104,
    "end": 4221.585,
    "text": "And then that's an interesting question about jump-starting it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4222.966,
    "end": 4226.088,
    "text": "And what do you bring to zero?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4227.108,
    "end": 4228.549,
    "text": "What do you bring to the table",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4229.918,
    "end": 4241.573,
    "text": " And then we're the agents with our tools that are building other agents and tools and all of the reflexivity and also relevance that comes along with that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4241.593,
    "end": 4247.601,
    "text": "Yeah, I like that summary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4251.654,
    "end": 4253.116,
    "text": " I could go on and on and on about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4253.376,
    "end": 4262.345,
    "text": "I even have different names for these things, but I want to... There's a little bit of thunder I can't steal just yet, but I will ping you guys.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4262.365,
    "end": 4271.974,
    "text": "I have a couple of people in mind about sharing a manuscript I've been working on for many months at this point, and it...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4273.335,
    "end": 4296.474,
    "text": " this is related uh especially the relationship between neurons the body the environment and Beyond and how that all ties together so this is stuff I've been thinking a lot about so it's actually timely your questions are great I didn't know we'd get into this part but uh you know that that's it's fun and uh there's more to the story too there's other but I I want to save that Thunder",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4297.014,
    "end": 4297.976,
    "text": " Yeah, .3.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4298.036,
    "end": 4304.344,
    "text": "Maybe you could have me on about that paper if you ever read that, but that's a different thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4304.624,
    "end": 4305.205,
    "text": "56 never dies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4306.407,
    "end": 4306.968,
    "text": "Exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4307.568,
    "end": 4308.309,
    "text": "He doesn't leave.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4308.61,
    "end": 4309.251,
    "text": "Leave us alone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4310.874,
    "end": 4317.136,
    "text": " Or like a sequel, like a one paper, a one paper sequel, because I will say like four papers was challenging.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4317.156,
    "end": 4329.721,
    "text": "And I don't think we've really like we've skimmed the surface of each paper, but like not even, you know, there's so many interesting threads to untangle in just what we've talked about here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4329.741,
    "end": 4333.603,
    "text": "And like, are you sure you don't want to go into evolution?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4335.083,
    "end": 4335.563,
    "text": "Are you sure?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4335.583,
    "end": 4337.684,
    "text": "I'm not opposed to it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4337.824,
    "end": 4339.665,
    "text": "I think the problem is space source is blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4341.175,
    "end": 4349.87,
    "text": " Yeah, no, I don't know that genetic algorithms is necessarily the way or the means that I mean, but I really am curious about...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4351.158,
    "end": 4376.412,
    "text": " unraveling maybe alien cognition like what does that look like when i really start to think about like what is the most different kind of cognition that i could imagine what is the most different from my own like i really think about plant cognition and then like acts of inference becomes kind of problematic because you know they like they're really limited they have a really restricted like course of action right um but but i i think about like what",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4376.972,
    "end": 4389.964,
    "text": " you know how how plants have evolved and how they've co-evolved with humans like and how they've you know they produce all these lovely things that we like to eat and they produce things that alter our own cognition you know so so like they can totally drastically",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4391.292,
    "end": 4410.581,
    "text": " influence our information transmission pathways and and i really think about what does that cognitive system look like or what is it like to to be a plant or to have a memory that looks like a plant memory right all of your memory is essentially chemical like or evolutionary and i think about that in terms of like why like evolutionary memory might",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4411.281,
    "end": 4437.116,
    "text": " be important um and across species and across you know evolutionary time like not necessarily evolving through genetic algorithms but but what does that evolutionary memory start to look like i mean it's a great question uh i i've only i well i don't have any work of my own well i have worked weirdly enough with by the way i will say i have worked with neuroevolution",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4438.338,
    "end": 4447.124,
    "text": " Actually, you guys had, I know you know, the ant colony paper optimization with Abdul Rahman and Travis, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4447.164,
    "end": 4450.767,
    "text": "I was in the audience and I chimed in and talked to you about active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4452.348,
    "end": 4457.371,
    "text": "So I have hedged my bets a little bit to look at other ways of doing things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4457.451,
    "end": 4462.775,
    "text": "So while I did say I sold my soul to predictive coding and common model of cognition,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4464.276,
    "end": 4468.877,
    "text": " I guess it's not completely the truth because I do look at other things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4469.437,
    "end": 4476.979,
    "text": "But I do think that it's interesting, Blue, that you bring up about things that are not human or even maybe animal-like, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4476.999,
    "end": 4480.079,
    "text": "Because there's also animal cognition, which is... There's some differences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4481.059,
    "end": 4487.741,
    "text": "So when you go into something like plant evolution, it's interesting because there is work, as I have found.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4487.841,
    "end": 4488.201,
    "text": "Again, I...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4489.921,
    "end": 4513.928,
    "text": " i want to say it in a way that again i don't feel too much thunder from this one paper i'm like like it's on the tips of my tongue you know and it's like i got no no hold hold it's almost done i gotta finish the edits put an archive and then we can all chat about it um but there there is a dressel of plant cognition and let's like you said alien cognition or just let's say non-human cognition",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4514.828,
    "end": 4517.35,
    "text": " And this work's existed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4517.41,
    "end": 4518.671,
    "text": "It's wonderful work to read.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4519.111,
    "end": 4525.315,
    "text": "Have you guys heard of the Life-Mind Continuity Thesis by Kirchhoff and others?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4525.695,
    "end": 4529.918,
    "text": "They're also heavily influenced by Carl and Free Energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4530.339,
    "end": 4533.621,
    "text": "They might have even worked with him sometimes because Carl's everywhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4534.381,
    "end": 4541.866,
    "text": "But with that in mind, I like the Life-Mind Continuity Thesis because it addresses a lot of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4543.087,
    "end": 4563.257,
    "text": " things that have emerged from evolutionary psychology, biology, uh, even like work that touches in the world of Michael Levin's world, which Carl also worked a lot with, uh, and, uh, these ideas that there is cognition at the plant level or organism level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4563.317,
    "end": 4564.418,
    "text": "You can even go simpler.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4564.478,
    "end": 4569.14,
    "text": "Like, by the way, it's hard for me, Blue, to imagine I've been studying them, uh, not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4569.5,
    "end": 4575.321,
    "text": " physically, but, you know, theoretically, you know, bacterial organisms, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4575.621,
    "end": 4580.582,
    "text": "Or, you know, even like E. coli is a wonderful example of studying its behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4580.622,
    "end": 4584.343,
    "text": "It too also minimizes its variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4585.123,
    "end": 4596.825,
    "text": "It opens the story to other things, which is also what inspires this work that I've done very recently with Carl that I keep teasing everyone about, but it is, I promise it will come out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4597.665,
    "end": 4597.805,
    "text": "But",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4599.366,
    "end": 4605.69,
    "text": " All of these things have cognition, but they are not cognitive in the way that humans are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4605.71,
    "end": 4611.955,
    "text": "And I've long thought about this ever since I was studying philosophy of mind as a young undergrad.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4613.095,
    "end": 4617.599,
    "text": "Now, of course, the thing when I was very young was about consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4617.899,
    "end": 4626.845,
    "text": "And consciousness is a very big world with a lot of implications that I have to be careful because there's been philosophical theories forever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4627.363,
    "end": 4630.765,
    "text": " and everyone has their holes that they need to fill and then there's flaws",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4631.454,
    "end": 4641.216,
    "text": " I don't want to go into Thomas Nagel or Dennett concepts right now, but I always thought, well, animals are conscious and plants are conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4641.496,
    "end": 4643.217,
    "text": "They're just not conscious in the same way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4643.257,
    "end": 4645.097,
    "text": "There's degrees of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4645.277,
    "end": 4655.139,
    "text": "And the reason I brought up the life-mind continuity thesis is that it sort of talks about gradations or degrees of cognition and cognitive functionality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4655.82,
    "end": 4657.1,
    "text": "And as you go from...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4657.9,
    "end": 4658.901,
    "text": " And I like this premise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4659.041,
    "end": 4660.121,
    "text": "I think it's an important premise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4660.161,
    "end": 4663.983,
    "text": "And since it's published work from them, it's not like I'm stealing any thunder now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4664.043,
    "end": 4666.485,
    "text": "It's already out there and you guys even are nodding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4666.505,
    "end": 4667.485,
    "text": "So I know you know of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4668.346,
    "end": 4672.948,
    "text": "You have the neurons and nervous systems, which evolved a lot later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4673.388,
    "end": 4701.19,
    "text": " in you know when you look at the picture of life right and so what was below that what are things that are more foundational because other organisms might not even have nervous systems and yet they do beautifully complex things they elicit beautifully complex behavior uh even doing photosynthesis in a plant is beautifully complex if you study the details uh and it's you know it's also an alien way of which they get their nutrients right we don't do photosynthesis",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4702.13,
    "end": 4705.791,
    "text": " And so it's a completely different evolved behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4705.811,
    "end": 4720.756,
    "text": "And so Michael Levin and other researchers, not just Michael, but like others, have this thing called basal cognition, which is this really, really, really low level cognitive functionality that emerges through the memory of evolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4720.956,
    "end": 4721.976,
    "text": " So I agree with you, Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4721.996,
    "end": 4725.357,
    "text": "You can't completely ignore the role of evolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4725.397,
    "end": 4730.198,
    "text": "In fact, it's another piece of the puzzle that you sort of have to somehow account for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4730.758,
    "end": 4734.019,
    "text": "And that's where the life-mind continuity thesis goes in the opposite direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4734.039,
    "end": 4739.2,
    "text": "It says we have high-level cognition, our complex minds and brains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4739.48,
    "end": 4741.561,
    "text": "We also have simple minds and brains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4741.621,
    "end": 4743.421,
    "text": "And it's not like all of a sudden there's this,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4743.841,
    "end": 4748.386,
    "text": " hard, discreet flip switch where you say, all of a sudden there's a brain and then there's not a brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4748.426,
    "end": 4752.831,
    "text": "It's like, no, plants do have a brain, just not the brain in which we have a brain, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4752.871,
    "end": 4754.252,
    "text": "And it's not a nervous system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4754.272,
    "end": 4762.661,
    "text": "It's, you know, these evolved biological constructs that, you know, have emerged from their primordial biochemical soup of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4763.121,
    "end": 4778.116,
    "text": " evolution uh to then allow them to for example uh manipulate their structure and response to the weather and rotate and move towards the light right to better conduct photosynthesis you know and their growth mechanisms in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4778.689,
    "end": 4781.149,
    "text": " So they're very simple behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4781.369,
    "end": 4787.21,
    "text": "Obviously, the plant's not going to get up and walk and figure out, oh, I know I want to attack this other plant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4787.23,
    "end": 4787.431,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4787.451,
    "end": 4791.971,
    "text": "That's more high level behavior, although we can come up with a really cool science fiction about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4792.031,
    "end": 4795.792,
    "text": "But, you know, that level of behavior is cognitive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4796.032,
    "end": 4797.452,
    "text": "It's just basal cognitive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4797.512,
    "end": 4803.553,
    "text": "And so that gives you what's called a simple mind or even just a mind in a different part of the spectrum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4803.633,
    "end": 4806.074,
    "text": "And so how do we account for that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4808.536,
    "end": 4831.779,
    "text": " some thoughts and i don't want to steal that thunder but there's also the role of evolution they talk about evolution and life mind continuity thesis and how you actually can't get even the complex minds to emerge without a memory that is evolutionary right so that's where you have an aggregate and so another that leads you and uh the engineer in me i",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4832.515,
    "end": 4848.41,
    "text": " gets a little anxious about this premise, but not because it's not the right path, it's rather my ability to contribute properly to it, because there's only so much you can do, which is, well, now you do have to think in collectives, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4848.45,
    "end": 4850.452,
    "text": "You can't just model the individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4850.772,
    "end": 4854.696,
    "text": "You do have to have many individuals and you need a population",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4855.356,
    "end": 4864.526,
    "text": " to then induce some type of evolutionary process, because you need what Kirchhoff and they say in the Life-Mind Continuity Thesis is a selection history.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4864.927,
    "end": 4866.608,
    "text": "You need the selection history.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4866.628,
    "end": 4869.091,
    "text": "It can be through the evolutionary process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4869.131,
    "end": 4870.232,
    "text": "Maybe there's other ways to do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4870.673,
    "end": 4872.335,
    "text": "They didn't say specifically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4873.015,
    "end": 4874.137,
    "text": "It's just what biology does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4874.857,
    "end": 4882.286,
    "text": " And that's what gives you this emergent behavior, right, to create, for example, the plant cognition that we observe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4882.907,
    "end": 4890.095,
    "text": "And of course, you know, the very long chain that gave rise to the evolution of, you know, apes and primates and then the humans from that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4890.916,
    "end": 4892.858,
    "text": "And so you have that selection history.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4892.878,
    "end": 4895.261,
    "text": "So that means we need to model populations in different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4895.501,
    "end": 4897.902,
    "text": " you know, the processes of which they evolve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4897.922,
    "end": 4910.326,
    "text": "The reason I said the engineer in me gets anxious is it's extremely my world complex to computationally simulate just even one agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4910.666,
    "end": 4916.329,
    "text": " So, and when I do evolution, and I've done neuroevolution, you usually simplify the little agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4916.429,
    "end": 4924.313,
    "text": "Even the ant colony, the paper that you guys talked about, well, that was a really beautiful example of emergence and other really neat things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4924.953,
    "end": 4929.275,
    "text": "Those ant agents, the ants, as my colleague talked to them, they're very simple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4929.316,
    "end": 4938.02,
    "text": "They weren't even neural nets, let alone a common... Imagine running a thousand common model of cognitions, and that's not even enough to do the evolution scale that we want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4938.44,
    "end": 4940.505,
    "text": " So that's where I say, oh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4942.065,
    "end": 4956.83,
    "text": " And again, knowing that that might limit what I could do and researchers like me that go on this pathway, maybe the other solution is, okay, well, I'm just going to figure out what the inductive biases would have been that were evolved from the evolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4957.191,
    "end": 4958.951,
    "text": "And I'll just skip the evolutionary phase.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4959.231,
    "end": 4960.932,
    "text": "However, that means you could be wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4961.152,
    "end": 4963.053,
    "text": "You could have gotten the bias wrong, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4963.133,
    "end": 4965.414,
    "text": "So you just say, well, I need something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4965.434,
    "end": 4969.035,
    "text": "So I'm going to go from there because I'm not given a supercomputer to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4969.415,
    "end": 4972.997,
    "text": " to do the simulations that I dream of doing, I have a GPU.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4973.017,
    "end": 4982.782,
    "text": "So I'm going to build my little agent and I'll just say, when blue, you criticize it and you say, well, you know, that could be the right, why is that the right bias?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4982.822,
    "end": 4984.403,
    "text": "I'll say, oh, it's probably wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4984.623,
    "end": 4987.285,
    "text": "But, you know, it does give me these behaviors, you know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4987.405,
    "end": 4993.688,
    "text": "So if we have the right behavior, plug in my agent into your simulation framework and I'd love to see what happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4993.828,
    "end": 4995.009,
    "text": "So, yeah, and I'll stop there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4995.592,
    "end": 5005.645,
    "text": " So is this where sparsity then comes in, when it becomes too computationally intensive in terms of evolving a million little tiny creatures?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5006.106,
    "end": 5010.292,
    "text": "Or maybe this is a good time to talk about sparsity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5012.116,
    "end": 5016.338,
    "text": " I mean, oh, first of all, oh, I see you put a link here in the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5016.358,
    "end": 5016.898,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5016.999,
    "end": 5020.921,
    "text": "So if you want to see a plant walk around, watch the MIT.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5020.961,
    "end": 5024.382,
    "text": "So the MIT Media Lab has made the, what's it called?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5024.402,
    "end": 5025.563,
    "text": "Elowen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5026.804,
    "end": 5031.866,
    "text": "Anyway, yeah, if you want to see the plant walk around, I've shown this before, but the plant will move.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5032.146,
    "end": 5033.207,
    "text": "There's a little plant robot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5033.227,
    "end": 5034.608,
    "text": "Oh, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5034.628,
    "end": 5035.568,
    "text": "I have to read about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5036.168,
    "end": 5037.209,
    "text": "Yeah, it's cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5040.976,
    "end": 5046.845,
    "text": " On the plant topic, I brought in these papers from 2017 with Friston and Calvo on...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5048.117,
    "end": 5072.686,
    "text": " predictive processing in plants and then a paper from 89 with silver town and gordon making essentially the exact same points in a broader behavioral setting it's just like wave after wave of the realization that there are diverse intelligences over different spatial and temporal scales and the same things that people remarked upon looking at",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5073.996,
    "end": 5099.803,
    "text": " a piece of grass cracking up through the concrete now is being instrumentally unified with the most advanced cognitive modeling that we have and also mike levin's work certainly is to that point you made a great point also about intelligence accelerating evolution and on mike levin's youtube channel there's actually a series of very good discussions to that point",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5100.943,
    "end": 5129.35,
    "text": " um evolution trial by error and selection and pruning and then quantum intelligence basically just teleporting you and getting to the solution without needing to traverse the entire landscape i'll read a question there's a little bit of chris fields there too right because quantum and i know he and carl been doing the quantum version of free energy and markup blankets yeah",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5130.871,
    "end": 5147.408,
    "text": " yeah and the course that chris provided at the institute over the previous months has helped put a lot of things more in a quantum footing but that's a super exciting direction um i'll read a question from the chat",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5151.052,
    "end": 5157.435,
    "text": " Can there be self-regulation of ensembles of noisy oracles without intelligence?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5157.875,
    "end": 5164.058,
    "text": "If so, it would be extremely helpful for a robot mind so it can discount components that are malfunctioning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5166.399,
    "end": 5172.482,
    "text": "Okay, so maybe repeat the question one more time so I make sure it's a little bit of a loaded question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5175.784,
    "end": 5177.965,
    "text": "It so is, aren't they all?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5179.074,
    "end": 5179.574,
    "text": " Of course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5179.594,
    "end": 5181.375,
    "text": "Yeah, I think I need to parse it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5181.475,
    "end": 5182.496,
    "text": "Repeat it one more time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5182.516,
    "end": 5183.637,
    "text": "Make sure I get it right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5184.617,
    "end": 5189.86,
    "text": "Can there be self-regulation of ensembles of noisy oracles without intelligence?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5193.582,
    "end": 5194.022,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5196.684,
    "end": 5202.427,
    "text": "The without intelligence part is a little bit of a curve at the end, but can there be ensembles?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5203.658,
    "end": 5210.848,
    "text": " engaging in distributed regulation seems like, yes, that was the sparsely connected Hopfield system that you described.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5211.809,
    "end": 5215.494,
    "text": "So I think the key, I wish there could be a clarification about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5216.147,
    "end": 5239.61,
    "text": " oracle right because that's usually something you ask for an answer right you know but I guess if it's just to say oh it's like a sensory reading or a hey I need to query this part of myself right of my morphology or my body and I need to understand what's going on and I say hey tell me and you give me the answer if I interpret it that way and not maybe some other interpretation uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5241.658,
    "end": 5263.938,
    "text": " yeah i would agree i think i think our discussion has lent itself to the implication that you want ensembles i mean i've said this already or assemblies right i've said even earlier when i was addressing some comments for blue and uh viet's question i believe was part of this piece about how you implement memory um even just even classical work on like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5264.398,
    "end": 5273.664,
    "text": " auto-associative and hetero-associative memory back before even like talking about the Hopfield and it's like, oh, I have a matrix and I can update it with some heavy and learning and outer products of vectors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5274.885,
    "end": 5281.85,
    "text": "And what I remember when I was studying that is that they said, well, you wouldn't use this one little matrix as the memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5281.93,
    "end": 5285.292,
    "text": "You would actually stitch together an assembly of them, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5285.712,
    "end": 5289.335,
    "text": "And so that's how you get this complex behavior because, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5290.095,
    "end": 5318.938,
    "text": " even in biology all the ranging up to nervous systems to modules and structures in the brain they are these like self-organizing systems of parts and relationships between those parts right and we can interpret them as dynamical systems and there's a lot of nice little frameworks we can apply um so the answer to that or the general gist of that question is yes you could build robotic systems because i think that was the kind of the application area",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5320.019,
    "end": 5330.085,
    "text": " And would you get things like fault tolerance or would you get, for example, if a part of the robot's morphology or body is damaged with that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5330.225,
    "end": 5333.487,
    "text": "I think that that would be the right design paradigm, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5333.528,
    "end": 5339.511,
    "text": "That would be an appropriate design paradigm to construct where you have like a distributed form of intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5340.552,
    "end": 5344.795,
    "text": "I think the nature of the assembly might be important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5345.213,
    "end": 5350.116,
    "text": " For example, it would probably be semi-hierarchical or heterarchical in nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5350.916,
    "end": 5370.807,
    "text": "Carl has done some really nice theoretical sketches of like Markov blankets of Markov blankets, which I will just borrow this question and that statement to address a piece of something I forgot to say to Blue in our earlier discussion of the body and the niche and the neurology or the neuronal constructs is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5371.327,
    "end": 5391.324,
    "text": " I also think it's going to be important going forward to embrace, again, there are other ways to probably do this, but I do like the Markov blanket formalism because it partitions the states of the outer world, the internal states and dynamics of the system, which is very vague, but it leaves that on purpose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5391.644,
    "end": 5394.967,
    "text": "And then you have sensory and active states as your blanket, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5395.007,
    "end": 5396.028,
    "text": "Your little Markov blankie.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5396.968,
    "end": 5399.009,
    "text": " And I think you need to specify that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5400.21,
    "end": 5404.532,
    "text": "And that will give you the notion of like, okay, well, there's the theoretical body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5405.132,
    "end": 5408.114,
    "text": "And then we need to answer the question on how to physically instantiate that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5408.134,
    "end": 5409.815,
    "text": "So that was just a quick thing I had in my notes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5409.835,
    "end": 5412.136,
    "text": "I wanted to make sure I didn't forget to say that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5412.937,
    "end": 5414.537,
    "text": "So I think that's another piece of that puzzle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5415.018,
    "end": 5417.019,
    "text": "You need to embrace that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5417.859,
    "end": 5445.883,
    "text": " and then there's other arguments for it but that there's something quickly and now that goes back to the answer to the question is that you would want to construct uh you know a cognitive system to manipulate the robot let's even leave the common model and predictive coding because those are just other tools that you could use to construct your brain uh but rather think of like the nervous system of the robot and think of it as i want a markup blanket of markov blankets right",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5446.523,
    "end": 5448.145,
    "text": " And Markov blanket is a Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5448.165,
    "end": 5457.395,
    "text": "You can keep doing this recursive nature where now you have your little atomic unit and that Markov blanket kind of construct, right, is your oracle, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5457.455,
    "end": 5461.86,
    "text": "It has its own internal states and that map to some physical universe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5462.02,
    "end": 5463.321,
    "text": " component of the robot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5463.341,
    "end": 5491.032,
    "text": "I think the part is that now you are no longer just saying I abstractly modeled the robot in the software sense, but it actually is grounded in some physical component, hardware property, maybe a particular piece of the robot, and then you model these with these little Markov blankets, and then you have macroscopic or gradually increasing macroscopic level Markov blankets that allow you to say, well, now I have this organization, but the internal states of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5491.412,
    "end": 5496.254,
    "text": " the higher level Markov blanket are, you know, these other Markov blankets that have their relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5496.294,
    "end": 5502.456,
    "text": "And that goes back to my biased background in complex adaptive systems, because what do you get out of that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5502.816,
    "end": 5513.68,
    "text": "You get what Herbert Simon and some of the greats of our time, you know, in the past, you know, talk about heterarchical, partially decomposable hierarchies, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5513.72,
    "end": 5516.481,
    "text": "And you build these beautiful, complicated systems of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5516.861,
    "end": 5527.092,
    "text": " of control right you have top-down modulation because the upper level markup blankets are maintaining their internal states and there's dynamics that we should probably figure out how to model that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5527.935,
    "end": 5532.459,
    "text": " I'm leaving the engineering side of this out because that's an interesting question of itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5533.059,
    "end": 5540.986,
    "text": "And then those dynamics and those relationships and laws between those higher level units, well, they affect those lower level units, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5541.006,
    "end": 5549.713,
    "text": "Because those lower level units upwardly cause the emergence or the existence of the internal states of the upper level markup blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5549.994,
    "end": 5562.738,
    "text": " But the rules of the upper level Markov blanket downwardly cause, this is directions of causation, modulate and shape the behavior and interactions of those lower level modules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5562.758,
    "end": 5570.761,
    "text": "So I think the answer is yes, you could do the assembly and the noisy oracle, well, noise is always a part of it because, you know, for example, physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5571.838,
    "end": 5597.83,
    "text": " always have a thermodynamic exchange with our world there's always loss of heat entropy must go up even if we are an open system uh and the entropy within us goes down the entropy of the entire system of the niche and the agent uh must go up because you can't violate the second law of thermodynamics and i think that when you consider that you're going to have this and you're also going to have inc what do you call it uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5598.743,
    "end": 5617.533,
    "text": " imperfect sensors right and you're going to have noisy sensors i guess that's where the noisy oracle comes into play because you're not always going to have a perfect reading and you're going to have to make decisions based on that that's where the uncertainty part comes into play uh the precision weighting mechanisms of active inference and free energy come into play",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5618.133,
    "end": 5623.478,
    "text": " And then how do those dynamics change when, for example, a part of my system fails, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5623.858,
    "end": 5629.984,
    "text": "I do think that that's a viable pathway or a design paradigm for constructing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5630.004,
    "end": 5634.268,
    "text": "I don't even need to worry about the common model part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5634.688,
    "end": 5659.809,
    "text": " the nervous system right of the robot so we just build you know that complex interaction which is neuronal right uh but we're using sort of that hierarchy or the uh recursive Markov blanket formulation to design this and you can tell I like Markov blankets because they're a nice little entity that tells you what's going on so I don't know if that was a useful enough answer to the question but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5661.325,
    "end": 5684.385,
    "text": " yeah it's great i'll just note two key pieces first in terms of what does free energy principle and active inference offer in alternative or in addition to these other frameworks a very clear principled articulation between the math and the theory and the implementation which is already there",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5685.678,
    "end": 5704.458,
    "text": " in the common framework but then to actually separate out the discussion of how to structure the markov blankets and generative models from the micro implementational message passing on factor graphs and these features that can improve the componentry",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5705.479,
    "end": 5723.33,
    "text": " as a capacity building work while blueprinting can be blueprinting rather than kind of needing to build the blueprint on the ground which is always going to end up with like an overly bespoke setting and then also like even when we are seemingly talking about a single mind",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5724.17,
    "end": 5734.378,
    "text": " whatever an individual would be, we are really always talking about the relationship with the niche, the multiple agents, similar and different types and the whole life cycle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5734.858,
    "end": 5743.245,
    "text": "And then you said that kind of like made you nervous or something as an engineer, because it's like, when you want to think about engineering the car, not a car engineer, but like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5744.185,
    "end": 5768.839,
    "text": " one account would be to focus on the car on the freeway driving and everything working but then actually the real systems engineering of the car is the supply chain on through the recycling and all the different ways that it can interface with things that are outside of the control and so to just build a cognitive model that is like in silico or just has this kind of like inward perfect",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5769.679,
    "end": 5796.381,
    "text": " gaze it may be an interesting project but then to engage with the messiness of the world that's where we again go back to biology look at how it's done and then try to accelerate or complement it yep i mean we can learn a lot from biology so uh i think that's i think you said it well um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5798.726,
    "end": 5800.767,
    "text": " We could look a little bit to a paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5801.288,
    "end": 5803.289,
    "text": "One of the, maybe the first.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5808.132,
    "end": 5813.696,
    "text": "Blue, you focused on the first paper or how about just, what do you see in figure two?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5814.156,
    "end": 5815.897,
    "text": "Alex, how would you describe figure two?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5815.957,
    "end": 5823.862,
    "text": "Or if there's another figure from this first paper that you want to describe, but just if you, whichever one you feel like is the best graphical abstract, just describe how you see it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5824.571,
    "end": 5825.632,
    "text": " I like figure two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5826.993,
    "end": 5829.374,
    "text": "There's a couple other nice diagrams in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5829.474,
    "end": 5830.375,
    "text": "I'm not sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5830.395,
    "end": 5834.157,
    "text": "So I think this one is a nice diagram.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5834.197,
    "end": 5835.578,
    "text": "I saw you guys go through this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5835.598,
    "end": 5843.684,
    "text": "I think everyone should watch point zero because I think you guys did a nice job at least dissecting parts of it and summarizing the main takeaways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5844.404,
    "end": 5865.747,
    "text": " um this is just showing you this is now very fine grain you know our discussion i don't know if that was the intent or maybe that's good thing i don't know how the the podcast likes to keep things constrained but uh we sort of went really high level and then philosophical mathematically conceptual uh and then like you said we haven't really talked about the papers but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5866.207,
    "end": 5894.863,
    "text": " i would say this paper in general is sort of like okay given that discussion now you're back to being the engineer and saying okay where do i start what's my lego blocks if you play with legos or little toys and put things together to build a tower i call this a lego block right this is a computational unit now you could still go further as you guys also did look at another paper called spiking predictive coding i guess we'll save that one for next week next session um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5895.743,
    "end": 5897.104,
    "text": " which is like the same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5897.164,
    "end": 5899.665,
    "text": "It's just really, really intricate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5899.805,
    "end": 5902.146,
    "text": "And that would be what you'd put on neuromorphic chips.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5902.547,
    "end": 5908.45,
    "text": "So this is like, okay, I want to build a little circuit of neurons and I want them to relate to each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5908.93,
    "end": 5912.112,
    "text": "And that's what like figure a one is trying to tell you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5912.132,
    "end": 5916.614,
    "text": "It says that would be sort of like your network in what's called prediction mode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5917.274,
    "end": 5922.417,
    "text": "And the idea is that like the little two dots, the gray dots are,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5922.637,
    "end": 5936.373,
    "text": " actually in general are what are called state nodes or just the neuronal units and the reason I call them state nodes is this is very different than deep learning or at least most of deep learning where these units",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5937.694,
    "end": 5939.715,
    "text": " always exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5940.535,
    "end": 5943.056,
    "text": "This goes back to maybe the earlier part of our discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5943.996,
    "end": 5947.517,
    "text": "This paper is what I would call mechanistic predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5947.617,
    "end": 5954.339,
    "text": "It's saying, I'm not just telling you the principles of error and I bounce it around and I somehow form impressions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5954.399,
    "end": 5956.18,
    "text": "It's like, okay, how do I build this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5956.52,
    "end": 5965.183,
    "text": "And what would a neuronal model, something actually in your brain, maybe a little group of like six neurons, how would they be related to each other?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5965.863,
    "end": 5977.515,
    "text": " Or, you know, maybe you're looking at it a little more abstractly, but this is supposed to describe cortical structure specifically, but I like to think that this paradigm repeats itself almost everywhere in the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5977.555,
    "end": 5979.257,
    "text": "There might be other ways of doing things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5979.758,
    "end": 5980.859,
    "text": "So in figure A1...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5982.369,
    "end": 5988.431,
    "text": " the little two dots, the two gray circles in Z2, those are just like, okay, I have two neurons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5988.871,
    "end": 5991.972,
    "text": "So I have little regions and those are layer two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5991.992,
    "end": 5995.513,
    "text": "Then there's these other two gray circles in one called Z1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5995.573,
    "end": 5997.334,
    "text": "Those are another set of state neurons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5997.854,
    "end": 6020.024,
    "text": " and then we have another set of neurons z zero and that's at the bottom so those are the actual physical neurons and they exist all the time uh and what i mean by that is that we simulate their dynamics this is why i keep saying neural dynamics is that they're emulated through like an ordinary differential equation right so you have maybe an initial condition",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6020.604,
    "end": 6023.247,
    "text": " which is just a number that you put inside each one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6023.628,
    "end": 6033.8,
    "text": "So this model and this paper still has some biological constraints that, oh, you're modeling roughly firing rates, if you want to say that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6034.421,
    "end": 6036.303,
    "text": "So these are like rate-coded neurons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6037.124,
    "end": 6039.107,
    "text": "My spiking implementation and my...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6040.288,
    "end": 6046.13,
    "text": " Generalization of predictive coding tries to say, well, maybe I'm not interested in modeling spike rates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6046.17,
    "end": 6047.53,
    "text": "I want to model the spike trains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6047.73,
    "end": 6049.711,
    "text": "And this is a stepping stone to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6049.931,
    "end": 6057.673,
    "text": "You actually understanding this and understanding those ordinary differential equations that govern Z of L, which is like Z2, Z1, Z0.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6059.253,
    "end": 6081.638,
    "text": " um you kind of just modify them a little bit and you out pop spike trains which is like really cool and uh and i have slides that mention this a little bit but maybe i'll use them next time since we're you know we're going over i'll just play off you guys and the the material you have here and so z2 and a1 is predicting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6082.66,
    "end": 6105.935,
    "text": " z1 and what do i mean by that well z2 i just told you has numbers inside each of those gray circles right it has at a particular snapshot in time they have a firing rate right and it's just represented by a number a scalar and they emit a prediction using those black diamond arrows that are like kind of connecting to e1",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6106.915,
    "end": 6130.693,
    "text": " we'll talk about e1 in a minute but those little black diamond arrows and i have you know like terminology for excitatory and inhibitory neurons just to tell you oh when do you subtract and when do you add but let's just forget about the math because if we get in the math that takes a while and i've found confuses people especially on these uh types of presentations so just imagine those",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6131.514,
    "end": 6156.502,
    "text": " scalar values inside of z2 are being transmitted along those black diamond arrows down to z bar of one that's what that little bar i think you can kind of see it in your in your visual and that's the mean of a gaussian distribution because what the model that we're sort of constructing is we're saying every local set of neurons they are driving like a car",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6157.262,
    "end": 6161.786,
    "text": " the car of a Gaussian, multivariate Gaussian distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6162.346,
    "end": 6173.576,
    "text": "And so I embrace more of a, let's say, a Fristonian kind of view, which is that we're going to learn, in this case, somewhat of a hierarchical Gaussian model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6174.437,
    "end": 6177.72,
    "text": "And so Z2 makes a prediction of the mean, and that's what Z bar 1 is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6178.672,
    "end": 6200.92,
    "text": " in the paper and you can see it in this diagram but it's not like super clear there's also a precision matrix or a covariance matrix because a multivariate gaussian is defined by a vector mean and then a square symmetric matrix for covariance you know parameters and it's kind of like it lies off to the side it's like lateral connections really",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6201.84,
    "end": 6206.842,
    "text": " They are what those weird little open diamond connections in E1 are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6207.262,
    "end": 6212.365,
    "text": "That's the precision weights, if you will, or the covariance weights.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6212.565,
    "end": 6219.207,
    "text": "Between those, you multiply the mean by the precision weights, which is like a lateral competition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6219.287,
    "end": 6220.088,
    "text": "Not even competition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6220.108,
    "end": 6221.488,
    "text": "It's more like a lateral pressure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6221.508,
    "end": 6222.209,
    "text": "Then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6223.649,
    "end": 6224.069,
    "text": " you're done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6224.129,
    "end": 6228.392,
    "text": "You've made a prediction from Z2 to Z1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6228.412,
    "end": 6231.053,
    "text": "Z1, right, I told you has numbers inside of it, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6231.093,
    "end": 6234.655,
    "text": "Because again, these neural dynamics exist at every snapshot in time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6235.176,
    "end": 6241.419,
    "text": "So E1 is what is known in mechanistic predictive coding as the error neurons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6242.02,
    "end": 6242.14,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6242.96,
    "end": 6245.723,
    "text": " We're making other biological simplifications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6245.783,
    "end": 6248.445,
    "text": "We could discuss them later for those criticisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6248.545,
    "end": 6257.271,
    "text": "But E1 says, okay, I also have two little diamonds, these orange diamonds, and I need two of them, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6257.332,
    "end": 6262.075,
    "text": "Because Z2 has to predict Z1, which has two nodes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6262.215,
    "end": 6263.917,
    "text": "So it needs to have a dimensionality of two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6265.047,
    "end": 6267.909,
    "text": " And I need one error neuron to compare each dimension.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6268.249,
    "end": 6269.95,
    "text": "So there's a mapping of one to one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6270.35,
    "end": 6275.333,
    "text": "There's a biological criticism of that, but for computational purposes, it's good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6275.573,
    "end": 6276.533,
    "text": "So we're going to go with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6277.234,
    "end": 6277.374,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6278.05,
    "end": 6301.432,
    "text": " z1 each dimension is compared to each dimension in z bar one and we can emulate this very simply as in the paper you can take derivatives of a free energy functional uh but at the end of the day you do all the math and it comes out to be a subtraction z1 minus z bar one that's it so that's called a mismatch signal and that's sort of emulating",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6302.172,
    "end": 6321.253,
    "text": " in a very very simple way uh you know what what's known as like the superficial pyramidal cells in your brain which sometimes are argued to do like these mismatched computations uh that's kind of one one interpretation of them and the idea make sure that I actually wrote that down make sure I didn't get that flipped",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6322.625,
    "end": 6323.425,
    "text": " Yeah, no, I'm right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6323.605,
    "end": 6323.885,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6324.306,
    "end": 6325.046,
    "text": "The superficial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6325.146,
    "end": 6329.347,
    "text": "And then the state neurons are what are called deep excitatory pyramidal cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6329.367,
    "end": 6334.729,
    "text": "So these are, you could almost argue I'm using a lot of pyramidal cells, but they're just neuronal units.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6335.569,
    "end": 6337.15,
    "text": "That's just the biointerpretation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6337.45,
    "end": 6337.59,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6338.11,
    "end": 6358.162,
    "text": " that's pretty much it so e1 compares z bar 1 to z1 and now you just repeat right so z1 would be guessing the activity of z0 which means it emulates z bar of 0 which is the mean of the gaussian of the layer below and you know you'll have a precision matrix you'll have a set of error neurons",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6358.482,
    "end": 6360.203,
    "text": " But the calculation just repeats.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6360.644,
    "end": 6361.464,
    "text": "And that's pretty much it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6361.524,
    "end": 6365.207,
    "text": "You have now a canonical predictive coding circuit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6366.668,
    "end": 6374.434,
    "text": "The interesting piece of this is this is very similar to like Regish-Rouse model, except it's not applied to image patches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6374.494,
    "end": 6377.055,
    "text": "It's just applied to sort of the vector space directly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6378.436,
    "end": 6380.578,
    "text": " That's what parenthesis 1 is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6380.798,
    "end": 6382.199,
    "text": "It's like the prediction mode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6382.86,
    "end": 6386.342,
    "text": "And then A2 says, okay, you made those predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6386.803,
    "end": 6399.732,
    "text": "By the way, Z2 predicting Z1 is made in parallel, which is a beautiful property that I want to emphasize right now, to Z1 predicting Z0.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6400.112,
    "end": 6402.214,
    "text": "By the way, Z0 in this case, you would...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6402.674,
    "end": 6425.304,
    "text": " clamp those numbers to a data point so for example like i do in this paper and i know you and blue talked about it last time uh pixels of an image right um and maybe by the way you can change the distribution i will add a quick caveat that the bottom layer is actually a multivariate bermudi distribution because i'm modeling binary pixels but if",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6426.324,
    "end": 6427.205,
    "text": " It doesn't really matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6427.325,
    "end": 6430.907,
    "text": "Just pretend everything's Gaussian because it's easy to visualize for the audience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6432.168,
    "end": 6433.509,
    "text": "And so that's prediction mode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6433.829,
    "end": 6435.17,
    "text": "Those things happen in parallel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6435.21,
    "end": 6441.795,
    "text": "Notice that the prediction Z0 bar does not depend on anything except Z1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6442.295,
    "end": 6445.618,
    "text": "So for free, you get something that's already brain-like, which is a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6447.134,
    "end": 6462.815,
    "text": " answering a question i know you and blue had about like what do i get from this right what do i get it's kind of like what what does predictive coding bring to the table you get layerwise parallelism for free and that's a really nice property because if you can you know emulate that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6463.195,
    "end": 6465.435,
    "text": " You have multiple GPUs or CPUs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6465.455,
    "end": 6467.216,
    "text": "You have a performance cluster.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6468.056,
    "end": 6475.297,
    "text": "You could now actually do literal parallelism, whereas deep learning, you have to run a forward propagation pass.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6475.417,
    "end": 6477.498,
    "text": "Everything is locked into sequence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6477.978,
    "end": 6478.818,
    "text": "This is parallel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6479.358,
    "end": 6489.28,
    "text": "Now, the problem with that is now you have to do message passing, which I know you guys are familiar with it, so I don't need to maybe go into so much detail, but that's what 2 is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6489.68,
    "end": 6490.82,
    "text": "It tells you how to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6491.48,
    "end": 6497.644,
    "text": " take the messages at E1 and E0, which are error messages, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6497.684,
    "end": 6502.607,
    "text": "They tell you how far off was the prediction made to the thing I wanted to look at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6503.167,
    "end": 6512.913,
    "text": "And then I backwards transmit that information along a different set of synapses, which is sort of what makes neural generative coding a little bit unique.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6513.634,
    "end": 6520.238,
    "text": "We talk about this in my survey as well, compared to Rajesh Rao's model and even Carl's older models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6521.018,
    "end": 6526.98,
    "text": " which are essentially you would just take the transpose of the weight matrix for forward prediction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6528.121,
    "end": 6532.002,
    "text": "But that's not biological because we don't reuse synapses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6532.042,
    "end": 6538.685,
    "text": "There is no evidence of the weight transport problem, which is I go back along the weights that I've transmitted forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6538.945,
    "end": 6540.365,
    "text": "The brain is really recurrent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6541.306,
    "end": 6542.426,
    "text": "And so I embrace that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6543.266,
    "end": 6545.247,
    "text": "And so you have a different set of synapses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6545.307,
    "end": 6547.668,
    "text": "You can call them feedback if you want, but...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6548.408,
    "end": 6569.696,
    "text": " i call them error synapses it doesn't matter and that's what those little diamond or sorry dashed open circle uh lines are doing is they are taking the little diamonds uh the orange diamond values and they are backwards transmitting them to a particular layer and it's usually back to the state neurons that made the original prediction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6570.356,
    "end": 6599.523,
    "text": " and then the last piece of the puzzle if you just want to understand why are what are those uh dashed solid diamond ones well those aren't actually synapses they could be uh they are just basically oh let me take the error message and let me subtract it and this is how you get top down pressure because you need to have bottom up top down pressures at every layer of neurons and so this is where that message passing happens that one step right now i've only shown you one step",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6600.223,
    "end": 6607.547,
    "text": " Z1's dynamics are going to be perturbed by the message that was passed from the layer below.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6607.667,
    "end": 6611.329,
    "text": "So in this case for Z1, it's the message from E0.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6612.049,
    "end": 6618.572,
    "text": "And then the prediction or the reverse of the prediction of layer Z2, which is the minus E1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6619.093,
    "end": 6621.754,
    "text": "And that's what I have in the equations in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6621.894,
    "end": 6625.816,
    "text": "And I could show some slides that walk you through these steps if you want, maybe next time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6626.736,
    "end": 6629.298,
    "text": "But the idea is that that happens at Z1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6629.898,
    "end": 6641.182,
    "text": " By the way, all the layers of neurons do this, as long as they're not clamped to data, because if you clamp them, that means you fix them to a set of values that you're saying, well, I know what the data is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6641.222,
    "end": 6643.783,
    "text": "I don't need to infer it, so I'm going to put it here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6644.684,
    "end": 6648.245,
    "text": "So that's Z zero in this case would always be pixels of an image.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6648.705,
    "end": 6651.486,
    "text": "Maybe they change with time, but let's keep it static.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6652.066,
    "end": 6658.349,
    "text": "And then all you do is you repeat step one and step two multiple times, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6658.849,
    "end": 6666.54,
    "text": " until you reach a steady state, which is one thing you could do, which is how many times you repeat that will you reach equilibrium?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6667.301,
    "end": 6671.467,
    "text": "Or you just bound it and you say, I'm going to run this for like I do in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6672.638,
    "end": 6675.38,
    "text": " number K, you know, 10 steps, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6675.741,
    "end": 6683.687,
    "text": "And what is this doing is it's changing the values inside of Z1 and Z2 only.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6684.148,
    "end": 6686.59,
    "text": "Notice I've said nothing about synapses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6686.89,
    "end": 6689.092,
    "text": "The synapses are just whatever numbers they are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6689.512,
    "end": 6692.014,
    "text": "The synaptic strengths are fixed at this point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6692.575,
    "end": 6697.599,
    "text": "So let's say I reach a steady state or I do this for like K times and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6697.959,
    "end": 6701.422,
    "text": " Then you make an update to all the synapses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6701.662,
    "end": 6702.343,
    "text": "So the solid",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6705.609,
    "end": 6712.656,
    "text": " solid diamond arrows, which were the generative weights, and the dashed open circle synapses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6712.696,
    "end": 6717.56,
    "text": "Those are put inside matrices, and you just calculate their updates with Hebbian learning, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6717.6,
    "end": 6718.241,
    "text": "It's really easy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6718.281,
    "end": 6719.222,
    "text": "I have statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6719.602,
    "end": 6720.823,
    "text": "Paper shows you those rules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6720.863,
    "end": 6721.984,
    "text": "It's just some outer product.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6723.165,
    "end": 6723.966,
    "text": "What is this doing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6724.426,
    "end": 6731.493,
    "text": "Well, you probably are familiar with dynamic expectation maximization from none other than Carl, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6731.893,
    "end": 6733.114,
    "text": " and generalized filtering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6733.534,
    "end": 6734.395,
    "text": "It's a form of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6734.695,
    "end": 6741.799,
    "text": "It's just a biological manifestation of dynamic EM in this specific context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6743.039,
    "end": 6749.943,
    "text": "When you do things at the spiking level, you don't need to wait so long to do synaptic plasticity updates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6750.683,
    "end": 6751.784,
    "text": "I do those online.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6751.884,
    "end": 6756.507,
    "text": "That means every step in time synapses change and you write out their ordinary differential equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6756.767,
    "end": 6757.027,
    "text": "We can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6757.569,
    "end": 6760.773,
    "text": " save that for I think that is actually supposed to be for next time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6760.813,
    "end": 6764.997,
    "text": "So we can dive into that fun pile of dynamics later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6766.118,
    "end": 6766.838,
    "text": " And that's pretty much it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6767.218,
    "end": 6772.88,
    "text": "I mean, the little diagram B is just trying to show you, oh, what do the cells look like?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6773.121,
    "end": 6781.324,
    "text": "So if I just zoom in on like one single state node and one single error neuron cell, you're looking at scalars, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6781.344,
    "end": 6783.724,
    "text": "And I'm just saying, well, this is how they wire together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6783.744,
    "end": 6794.949,
    "text": "And then the, so that's just a zoom in if you want, if you will, if you don't like matrices, because engineers, we love vectors and matrices and vectorizing, because then you can run them on a GPU.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6796.429,
    "end": 6799.714,
    "text": " But the old fashioned way in the 80s was scalars.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6800.154,
    "end": 6810.407,
    "text": "And then on the right, we have diagram C. And that's actually showing you all four models that we investigated in that journal article.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6811.088,
    "end": 6812.53,
    "text": "And it's cool because.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6813.351,
    "end": 6816.654,
    "text": " This paper's long, by the way, so it's funny.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6816.974,
    "end": 6821.797,
    "text": "I admire you guys for doing four of my papers, and on top of them, they weren't short little guys either.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6822.918,
    "end": 6825.26,
    "text": "This paper has a very long appendix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6825.6,
    "end": 6827.682,
    "text": "I don't know if you found the supplementary material.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6828.322,
    "end": 6829.843,
    "text": "That was the reviewers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6830.224,
    "end": 6832.005,
    "text": "They had us do a lot of extra things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6832.786,
    "end": 6834.507,
    "text": "The appendix actually tells you a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6835.408,
    "end": 6844.218,
    "text": " And among the things that it does is it emphasizes something that I think the message kind of got a little tiny bit muted in the main article, but that's just how nature is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6844.278,
    "end": 6849.023,
    "text": "It wants you to sort of say, give me the main thing, show me the results, all the beautiful math.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6849.924,
    "end": 6865.642,
    "text": " box it up in this nice little corner and if people really care they'll look at it and so the diagram to the right emphasizes something that in the appendix talks about a naming convention so neural generative coding isn't just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6866.443,
    "end": 6867.384,
    "text": " predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6867.504,
    "end": 6874.689,
    "text": "It's like a computational framework that tries to unify as much of predictive coding as I felt that I could in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6874.749,
    "end": 6879.412,
    "text": "And so that's why the model has underneath there GN, CN, T1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6879.853,
    "end": 6884.596,
    "text": "In the appendix, there's like a section that tells you how to interpret why do I use the word GN, CN?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6885.116,
    "end": 6886.117,
    "text": "What is T1?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6886.137,
    "end": 6887.178,
    "text": "It means type one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6887.978,
    "end": 6902.95,
    "text": " T2 means type 2 and those refer to the error synapses because you'll see Regis Rao's name in the model there at the bottom and that's to pay homage because I'm a big buff for historical research and I like to pay credit",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6903.53,
    "end": 6908.371,
    "text": " whereas a lot of people don't, to old work because we stand on the shoulders of giants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6908.651,
    "end": 6910.972,
    "text": "And so as I told you, I've read a lot of Rao's work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6911.712,
    "end": 6920.955,
    "text": "That model is named after him because it is effectively like the fully connected version of his patch model in his classical nature paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6921.415,
    "end": 6925.836,
    "text": "And that is a neural generative coding network under specific assumptions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6925.976,
    "end": 6926.276,
    "text": "And so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6926.776,
    "end": 6933.183,
    "text": " Like any mathematician, you just say, oh, I recover this older model because it's a subset of my theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6933.203,
    "end": 6940.731,
    "text": "And then the second model, usually it's a little bit similar to Regis Rao's.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6941.227,
    "end": 6964.638,
    "text": " essentially carl's model from is either 2008 or 2010 the reviewers wanted us to implement that and it's not a model that many people i hate to say implement besides carl so i had to do that and uh it was fun and basically it's just a large piece of it is making sure you get those precision matrices right because he introduces that in one of his like graphical model papers and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6964.858,
    "end": 6966.519,
    "text": " And so that's why it's named after him.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6966.539,
    "end": 6969.321,
    "text": "That pays homage to his classical work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6969.801,
    "end": 6972.763,
    "text": "And then the two to the right are the new models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6973.143,
    "end": 6980.867,
    "text": "And that's for the ones that, for example, have separate feedback synapses, which is not something that older models directly addressed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6981.208,
    "end": 6983.209,
    "text": "Carl has mentioned them, but he...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6984.129,
    "end": 6991.271,
    "text": " at least the mathematics or the models of those papers did not concretely tell you how to implement them, let alone how to learn them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6991.731,
    "end": 6996.733,
    "text": "So all of my models, all my synapses are learned with Hebbian-like plasticity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6997.113,
    "end": 7004.315,
    "text": "And then the last model, the farthest one to the right, the reason I'm spending time on these is because those are the core models we looked at in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7004.735,
    "end": 7010.237,
    "text": "The one to the far right just says, oh, well, because NGC is such a broad framework,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7010.797,
    "end": 7013.859,
    "text": " you are not committed to a hierarchical model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7014.26,
    "end": 7019.643,
    "text": "You could build a heterarchical model or a weird model that has skip connections, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7020.024,
    "end": 7025.387,
    "text": "And so that's why you see this like weird arrow going from the very, very top layer all the way down to the bottom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7025.908,
    "end": 7030.491,
    "text": "And so the math in the paper shows you, oh, I can turn off with these little gating variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7031.432,
    "end": 7036.917,
    "text": " these weird kind of skip connections that violate the hierarchy, but you can still learn them in Hebbian ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7037.177,
    "end": 7039.119,
    "text": "So the efficiency is all there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7039.619,
    "end": 7041.621,
    "text": "It turns out that model actually worked the best.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7041.961,
    "end": 7048.227,
    "text": "And so there are, you guys actually showed in point zero, the data samples",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7048.887,
    "end": 7050.268,
    "text": " And those are what I used.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7050.288,
    "end": 7053.529,
    "text": "I used the final model, the GNCN PDH.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7053.569,
    "end": 7061.991,
    "text": "That's like a little compression because when you use a naming convention, the names get really long to a certain point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7062.011,
    "end": 7070.494,
    "text": "So you're just like, well, I'm not going to say GNCN T2 L Sigma, which refers to the lateral connections and the precision weights.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7070.814,
    "end": 7088.272,
    "text": " and pdh i'll just call it pdh right you can just say that to your friends and it's quick and uh rolls off the tongue um so that that's a little weird naming thing i did and so the nice thing about these models is they they do show you pretty much all the mechanics uh at least visually",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7088.892,
    "end": 7107.277,
    "text": " and then the other piece of this puzzle is you'll notice those gray circles back in figure a also have synapses that i didn't really address those are lateral synapses at the state node level which is also something that you know you know classical work like rouse and friston's models and others don't really",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7107.717,
    "end": 7113.519,
    "text": " This is something we introduced, which encourages what I would argue extreme sparsity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7114.259,
    "end": 7136.307,
    "text": "And the motivation for that, because I know Blue had a question or just wanted to chat a little bit about sparsity, so maybe this is a way I'll sneak it in, is that Rao, for example, introduced sparsity by imposing a cartotic Laplacian prior, which just is basically a pointy distribution over the neural firing rates that just say,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7136.687,
    "end": 7140.31,
    "text": " I want some of these neurons to go to zero and other ones to be high.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7140.45,
    "end": 7143.232,
    "text": "And I want, you know, as many of them to be zero as possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7143.793,
    "end": 7145.674,
    "text": "And that's a useful way to do sparsity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7145.714,
    "end": 7149.457,
    "text": "It actually comes from Bruno Hausen and sparse coding work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7149.537,
    "end": 7150.678,
    "text": "And I cite Bruno.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7150.758,
    "end": 7151.699,
    "text": "I've met Bruno Hausen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7151.719,
    "end": 7152.4,
    "text": "He's a cool guy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7153.34,
    "end": 7156.863,
    "text": "You know, you can get these activities to be really, really, really sparse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7156.923,
    "end": 7159.065,
    "text": "And most of them are zero because zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7159.485,
    "end": 7160.626,
    "text": "Why do we care about zero?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7160.746,
    "end": 7162.408,
    "text": "Not just from a biological point of view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7162.728,
    "end": 7163.889,
    "text": "Hardware loves zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7164.349,
    "end": 7165.95,
    "text": " Zero means I don't compute it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7166.31,
    "end": 7169.412,
    "text": "So if I don't have to compute it, I don't use any hardware resources for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7169.753,
    "end": 7170.573,
    "text": "I can ignore it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7171.334,
    "end": 7174.716,
    "text": "It's those numbers that aren't zero that are annoying for a computer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7175.136,
    "end": 7182.301,
    "text": "And so instead of doing a Laplacian prior, which I did investigate in this paper, and I think I even have the dynamics in there as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7182.341,
    "end": 7183.582,
    "text": "It's like one of the equations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7184.723,
    "end": 7189.146,
    "text": "And to be faithful to Rao, Rajesh, I had to put that in there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7190.046,
    "end": 7193.809,
    "text": "But the lateral synaptic connections, the state nodes,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7194.749,
    "end": 7201.353,
    "text": " what they do is you, uh, what we did in this one is we introduced fixed weights because that's the easiest thing to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7201.393,
    "end": 7203.614,
    "text": "You don't have to learn them later on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7203.694,
    "end": 7204.695,
    "text": "I learned them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7204.755,
    "end": 7206.196,
    "text": "That's like some future work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7206.796,
    "end": 7212.539,
    "text": "Um, and what these, these lateral synapses do is they have, uh, it's like a, a matrix, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7212.918,
    "end": 7215.259,
    "text": " And they are shaped to be a square.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7215.28,
    "end": 7218.782,
    "text": "And they are like, let's say, the dimensionality of a layer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7218.822,
    "end": 7220.723,
    "text": "So in the top layer, it'd be two cross two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7221.363,
    "end": 7226.967,
    "text": "Along the main diagonal are a set of positive numbers or maybe negative numbers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7226.987,
    "end": 7231.59,
    "text": "You have to make sure that the middle diagonal is excitatory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7232.35,
    "end": 7243.723,
    "text": " And it's called self-excitatory, which means if a single neuron fires at a step in time, its new firing rate is going to be amplified by its own firing rate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7243.743,
    "end": 7246.706,
    "text": "So that's called self-excitatory or self-excitation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7247.668,
    "end": 7258.364,
    "text": " And the off diagonal, so the lower and upper right triangle of this lateral matrix that I'm talking to you about, that has to be the opposite sign.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7258.904,
    "end": 7263.231,
    "text": "So I would believe it would be negative unless you wrote the negative sign in the ODE.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7263.531,
    "end": 7264.172,
    "text": " then it changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7264.652,
    "end": 7267.015,
    "text": "And those are negative numbers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7267.415,
    "end": 7280.088,
    "text": "And the idea is that those put a downward pressure and says this neuron, let's say in this one element of the column, will laterally inhibit other neurons in that layer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7280.749,
    "end": 7286.615,
    "text": " And the cool part, and again, it's in the super long appendix of that paper, you can find it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7288.117,
    "end": 7294.984,
    "text": "That matrix, even though I fix it, because I didn't, you could try to learn it with like heavy and learning and I later like investigated that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7296.212,
    "end": 7323.722,
    "text": " you what you might say okay i'll put some random numbers in that matrix but wait a minute do i really want every neuron in the main diagonal to inhibit all the other neurons the answer is probably not you could that is a type of pattern what i did is i initialize a masking matrix and in that matrix without going into the details of that because there's a little bit of an algorithm it just basically says little groups of neurons inhibit each other",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7324.362,
    "end": 7325.663,
    "text": " and no one else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7325.803,
    "end": 7333.327,
    "text": "And so you basically turn off things in that matrix, you fix it with a mask, and now you get group sparsity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7333.747,
    "end": 7343.673,
    "text": "And so the long story short, with all of that cool description, is that you get K-winner take all type lateral competition, but it's biologically implemented.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7343.953,
    "end": 7345.974,
    "text": "So I'm not using an activation function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7346.655,
    "end": 7352.698,
    "text": "And as you go through the dynamics of this model, this matrix, what it'll do is it'll emphasize neurons",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7353.198,
    "end": 7362.321,
    "text": " that are really important for the object that you're processing, and it will shut up all the other neurons that aren't relevant, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7362.681,
    "end": 7369.744,
    "text": "And so this is, to answer a question, I believe it was Blue and you, Daniel, were discussing last week about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7370.669,
    "end": 7379.361,
    "text": " the results that we had in this paper, because it's not shown here in this diagram, but the idea is that we also got really good classification performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7379.701,
    "end": 7381.544,
    "text": "This model has no label, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7381.904,
    "end": 7385.289,
    "text": "So we trained like a little probe or whatever on the topmost layer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7385.689,
    "end": 7387.451,
    "text": " And we also showed some Ts and E plots.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7387.872,
    "end": 7404.33,
    "text": "And the reason I think that the model works as well as it does for something it wasn't trained to do, which is discrete categorization of object categories, like different numbers, like the digit zero is the zero category, is because of that sparsity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7404.81,
    "end": 7408.433,
    "text": " And we did measure the sparsity levels and they were really, really, really tiny.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7408.453,
    "end": 7418.28,
    "text": "The proportion of neurons that were active as you go through these dynamics, especially as it learned, is it said, oh, I don't need a lot of neurons to represent zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7418.52,
    "end": 7425.906,
    "text": "So it's sort of like extracted out little sub networks that specialize to these templates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7426.066,
    "end": 7426.366,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7426.386,
    "end": 7432.911,
    "text": "So I don't we didn't we didn't exactly probe that hypothesis, but that's what I speculate is going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7433.952,
    "end": 7435.132,
    "text": " It's also very easy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7435.353,
    "end": 7437.694,
    "text": "You can justify it from the past.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7437.714,
    "end": 7443.138,
    "text": "You can say sparsity is a really important way to do memory retrieval.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7443.479,
    "end": 7449.563,
    "text": "It's a beautiful way to fight catastrophic forgetting, which is another piece of my work that tries to look at that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7449.583,
    "end": 7456.068,
    "text": "The idea is that you're going to get non-overlapping representations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7456.268,
    "end": 7459.751,
    "text": "If we only have a few neurons in a sparse distributed memory,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7460.311,
    "end": 7484.638,
    "text": " semantically if these units activate they're probably related to roughly the same concept and you'll learn as long as you have big enough layers of course this is the thing where you do need like brain level stuff you need lots of neurons uh you'll find that they don't cross talk with each other they don't fight each other so much so knowledge for zero doesn't fight with the knowledge of two and so you'll have this nice beautiful separation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7485.444,
    "end": 7489.027,
    "text": " And I think it makes things like classification a little bit easier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7489.547,
    "end": 7496.952,
    "text": "It's really nice for fighting forgetting because you'll remember things a lot more until eventually you run out of capacity and then you just need more neurons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7498.153,
    "end": 7499.514,
    "text": "And it's also energy efficient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7499.774,
    "end": 7508.961,
    "text": "So the big argument is if everything is zero, except for like a few neurons firing, that's a perfect candidate for neuromorphic computing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7509.902,
    "end": 7514.185,
    "text": "And then if we can make them spike, which is what the other paper you guys reviewed tried to do,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7514.985,
    "end": 7519.01,
    "text": " Then we solve all of those weird things because you should only be communicating with bits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7519.45,
    "end": 7529.281,
    "text": "You shouldn't be communicating with rate-coded continuous values, which are clean, but they're not good for hardware like a neuromorphic chip or a memristor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7530.743,
    "end": 7532.184,
    "text": " That's kind of the general gist of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7532.424,
    "end": 7539.947,
    "text": "And I think that's where you get this beautiful benefit of sparsity and you see this nice interaction and you're learning a generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7539.967,
    "end": 7543.389,
    "text": "And of course, that paper actually synthesizes the models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7543.449,
    "end": 7545.65,
    "text": "We look at what samples are produced.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7547.351,
    "end": 7552.313,
    "text": "Yeah, and I could keep going on and on, but hopefully that that was useful and made sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7552.753,
    "end": 7556.095,
    "text": "I see blue is gone, so maybe I got boring here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7560.549,
    "end": 7588.584,
    "text": " that was great and a lot yeah it was a lot what do you did it make sense it helped me it helped me even after reading all the papers multiple times hearing this explanation still really did help i hope it's helpful for other people too um there's an enormous amount of condensation",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7590.735,
    "end": 7615.861,
    "text": " you really are laying it out like an engineer how do we build the three-story building what's the wiring diagram of each floor and then you're clearly um striking a fine balance with how much of the mathematics to visually convey versus explore here and that's why there's appendices that's why there's sequences of papers",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7618.032,
    "end": 7619.733,
    "text": " What are you looking forward to in DOT 2?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7620.313,
    "end": 7622.034,
    "text": "Or just as we kind of close out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7622.955,
    "end": 7624.756,
    "text": "Yeah, I don't know if we went too long.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7624.836,
    "end": 7625.336,
    "text": "I'm sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7625.356,
    "end": 7627.417,
    "text": "Oh, it's fine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7627.858,
    "end": 7631.079,
    "text": "Well, I mean, I'm looking forward to continuing some of this discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7631.139,
    "end": 7644.487,
    "text": "I think we didn't really even touch on the convolutional one, which is really, you could even argue is more of a, to use Carl's terms, you could think of it as the convolutional neural coding is a corollary of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7645.007,
    "end": 7651.69,
    "text": " to the neural generative coding framework because it just says, wait a minute, how do I do image processing in an efficient way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7651.71,
    "end": 7654.951,
    "text": "Let's do deconvolution or convolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7655.311,
    "end": 7658.233,
    "text": "That could be something we briefly touch on next time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7658.913,
    "end": 7663.995,
    "text": "I'm looking forward to the spiking stuff because I really, really love spiking neuronal cells and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7664.495,
    "end": 7684.651,
    "text": " i don't think he was able to make it but one of my students works with me on spike timing and uh synaptic plasticity is driven through solely spikes um so i you know i i have a particular soft spot for that and i think the future predictive coding at least where i'm trying to lead the crowd",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7685.271,
    "end": 7709.403,
    "text": " is to do things at the spike level because neuromorphic computing offers beautiful energy efficiency we could do edge computing so i'm looking forward to some of that chat i also love we sort of borrowed a big chunk of what i think you wanted daniel us to do with the cognitive architecture because we kind of brought all that today i know blue is very interested in that so we sort of front loaded with a lot of that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7710.864,
    "end": 7715.146,
    "text": " So I was going to say I'm looking forward to that, but I mean, I'm always looking forward to chatting more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7715.967,
    "end": 7721.13,
    "text": "I think we front loaded it, so maybe we could address more the predictive coding pieces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7721.53,
    "end": 7725.553,
    "text": "However, I do have slides that I'll probably share if you want me to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7727.114,
    "end": 7738.363,
    "text": " and maybe talk about other aspects of the cognitive architecture that aren't just the cog engine, but rather like, oh, I'll show you something I did in robotics in a paper at ICRA this year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7738.524,
    "end": 7747.511,
    "text": "I could show you some things about how you can make predictive coding do something a little bit more concretely active inference without obscuring it with the common model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7747.531,
    "end": 7753.276,
    "text": "Because I think the common model is like you get kind of lost, not you, but the audience in general,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7753.556,
    "end": 7757.139,
    "text": " might say, oh, all these continents of mind, and how do they relate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7757.179,
    "end": 7758.7,
    "text": "Well, wait, where's the active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7758.76,
    "end": 7761.262,
    "text": "And I talk about it's in there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7762.182,
    "end": 7768.067,
    "text": "I think sometimes it's good to say, let me throw away all that for just a minute, because memory can kind of cloud it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7768.487,
    "end": 7770.889,
    "text": "Let's just look at epistemic foraging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7771.589,
    "end": 7781.171,
    "text": " and prior preference, and maybe do something simple like have a robot arm manipulated, manipulate an object, and I could talk about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7781.191,
    "end": 7785.432,
    "text": "And also just chatting more about the future of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7785.892,
    "end": 7794.314,
    "text": "I think that this is... I think what I am trying to represent, and actually with a lot of discussion with Carl...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7795.214,
    "end": 7812.165,
    "text": " I think I've narrowed down what I what I bring to the table to the fields of cognitive science, computational neuroscience and machine learning, which is the three, the triad that my lab represents is this thing called biomimetic intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7812.605,
    "end": 7819.27,
    "text": "And I think that we need to understand the neurophysiology, the biology of things,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7819.89,
    "end": 7847.41,
    "text": " and also understand the physics of things and understand how the niche and the body and the neuronal constructs all interplay together to then build technological artifacts that do things like robotics at in an energy and energy efficient way um and i think this is that path this is one possible pathway to agi i think it's the path but uh i'm obviously could be clearly wrong",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7848.11,
    "end": 7877.144,
    "text": " uh you know we all don't know until we get there and we have perfect hindsight but i think that that could be a fun little bit of discussion because i know you guys were interested in knowing about the future work that my team has been trying to do as well as the history of those papers which i didn't get to talk about i know blue had said something she was interested to know what was the order of these papers and i had this in my notes so we can we can save those for the next session if you guys want to talk about them or other questions i'm open to anything really",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7881.023,
    "end": 7883.684,
    "text": " Yeah, this was huge.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7885.825,
    "end": 7891.327,
    "text": "It really is a tour de force of cognitive science and engineering.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7891.407,
    "end": 7892.788,
    "text": "So I hope the people enjoyed it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7893.708,
    "end": 7895.829,
    "text": "Looking forward to talking next week.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7895.909,
    "end": 7900.311,
    "text": "If you're watching Dot One now and you want to join next week, this may be possible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7900.591,
    "end": 7902.072,
    "text": "And thanks again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7902.772,
    "end": 7903.052,
    "text": "See you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7903.272,
    "end": 7903.672,
    "text": "And thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7903.772,
    "end": 7904.553,
    "text": "Thank you for having me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7905.573,
    "end": 7906.193,
    "text": "We appreciate it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7906.313,
    "end": 7906.553,
    "text": "See you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7906.573,
    "end": 7906.633,
    "text": "Bye.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7907.274,
    "end": 7908.054,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  }
]