[
  {
    "start": 6.533,
    "end": 33.597,
    "text": " all right hello and welcome everyone it's november 21st 2023 we're here in actin live stream number 56.2 discussing a quartet of papers with alex arurbia this is the third discussion we've had we had a dot zero giving some background and context right hello everyone it's november 21st 2022. alexander you're in active live stream",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 35.481,
    "end": 55.26,
    "text": " empirical demonstration of the feedback delay of live streaming so let's just jump in perhaps blue if you have any initial kind of remarks or questions then to Alex and also if anyone's watching live they can of course write a question and I'll check it out so go for it blue and we'll just jump in",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 58.001,
    "end": 64.763,
    "text": " So for me today, I think I'm really excited to get into the cognitive model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 64.843,
    "end": 70.865,
    "text": "So like the last paper was my favorite and it was, I think maybe like the most zoomed out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 71.106,
    "end": 79.889,
    "text": "So I'm really kind of looking forward to getting into that and then maybe exploring what that would look like in the non-human system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 80.169,
    "end": 83.91,
    "text": "So that's, I mean, I kind of always want to go there, but I'm still, I still want to go there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 89.072,
    "end": 93.136,
    "text": " What figure should we jump to or what part of the paper should we jump to, Alex?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 95.417,
    "end": 99.02,
    "text": "I mean, whichever one caught, I think, yours and Blue's interest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 99.08,
    "end": 101.262,
    "text": "I guess we could go to the architecture one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 101.803,
    "end": 106.947,
    "text": "Oh, I do want to, if you don't mind, a tiny shameless plug that I just want to take the moment right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 107.027,
    "end": 113.152,
    "text": "I'm going to post this link in the chat because it relates to our conversation we had in point one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 113.172,
    "end": 116.895,
    "text": "So this is a paper that just came out the end of last week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 117.535,
    "end": 141.156,
    "text": " um i just want to add that as contextualization especially blue you might find it interesting because uh this was work i worked on i think i even alluded to it over like the last seven months um this is why i was talking about inactive and embodied cognition uh and uh there's a lot more so now now it's out there i don't have to pretend like oh it's a secret project",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 142.036,
    "end": 142.436,
    "text": " That was it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 142.456,
    "end": 143.597,
    "text": "So that's my only shameless plug.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 143.637,
    "end": 144.197,
    "text": "Let's go back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 144.877,
    "end": 146.398,
    "text": "I should start with this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 147.398,
    "end": 155.501,
    "text": "So the the the as not to steal the thunders of 56.1 were this paper that came out in the time between.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 155.521,
    "end": 158.802,
    "text": "Yeah, it literally came out last end of last week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 158.962,
    "end": 159.223,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 159.343,
    "end": 159.603,
    "text": "Wow.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 160.023,
    "end": 163.924,
    "text": "So, I mean, maybe just while we're here, like, could you just review it?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 164.104,
    "end": 168.046,
    "text": "I've already had some you already have so many papers, but it might be worth it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 169.046,
    "end": 176.669,
    "text": " Could you just give us the elevator pitch about this paper and maybe your favorite figure?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 177.77,
    "end": 180.491,
    "text": "We were really excited for your comments last week.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 180.511,
    "end": 181.872,
    "text": "Scroll up, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 182.672,
    "end": 183.492,
    "text": "It's actually early.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 183.552,
    "end": 184.673,
    "text": "There's cool stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 186.794,
    "end": 187.774,
    "text": "It's a very long paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 188.034,
    "end": 188.814,
    "text": "Yeah, that picture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 189.095,
    "end": 193.396,
    "text": "It also has an appendix or supplement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 193.837,
    "end": 195.757,
    "text": "It was a longer original paper, too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 197.501,
    "end": 203.344,
    "text": " Just that way, again, I don't steal a thunder of this particular podcast because our focus was different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 204.644,
    "end": 215.77,
    "text": "Now, the general idea is my my thesis or Carl and my thesis is about moral computation, which is a phrase that Jeffrey Hinton.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 216.69,
    "end": 245.786,
    "text": " uh introduced uh very briefly like in about like two sentences or a small paragraph in his paper in december uh and i have written at length about it in a couple of my own papers end of december of last year in january and february um so this is sort of like uh the big uh deep dive into what does it mean to make a computer that is not immortal which is what we have in computer science today",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 246.566,
    "end": 253.65,
    "text": " The computer is inextricably bound or rather the software is inextricably bound to the hardware.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 254.63,
    "end": 256.131,
    "text": "Sorry, not bound to the hardware.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 256.471,
    "end": 257.632,
    "text": "I'm just making a mistake there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 257.652,
    "end": 265.896,
    "text": "So, for example, we can copy our software machine intelligence program across any amount of computers and it doesn't really matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 267.537,
    "end": 270.459,
    "text": "And it's also extremely energy inefficient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 270.959,
    "end": 289.673,
    "text": " and then the opposite side of that is mortal computation which is essentially drawing inspiration from life itself uh for example uh when any one of us dies a human dies your computations your memories your quirks the things that define who you are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 290.433,
    "end": 312.128,
    "text": " are essentially gone right because it's unique to you and that is because you're an embodied inactive agent um and so what's kind of nice about this diagram is it's it's a really colorful pretty diagram but it's in it sort of synthesizes two out of the three perspectives in this paper so uh carl and i investigated biophysics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 312.828,
    "end": 339.62,
    "text": " uh which is sort of like the intersection of physics physiology biology chemistry and the ideas that have echoed over i mean essentially the last century and that's the top half the bottom half is a classical and very interesting domain called cybernetics which is like the intersection of computer science control theory also physics and a bunch of other domains and information theory",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 340.538,
    "end": 364.344,
    "text": " and it also has similar ideas and everything centers around this idea of homeostasis and all the millions of uh variations in higher order uh you know uh concepts that build on that and the ideas that uh our intelligence and uh essentially is driven by our our desire to persist and to survive in an environment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 364.804,
    "end": 386.995,
    "text": " And so this actually takes my comments from the last point one podcast with you guys to its natural conclusion, which is I don't just believe you need a body, you need an environment, you need essentially a drive to persist and to fight thermodynamic dissolution or dissipation into the environment or disintegration is a better word.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 387.575,
    "end": 405.1,
    "text": " um so we are essentially applying the biological second law of thermodynamics which is why it's also about free energy uh and so then uh we and then there's another person but it's also that it's a later diagram cognitive science and uh carl and i uh propose",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 406.041,
    "end": 422.5,
    "text": " 5e cognitive theory which is just taking the classical 4e theory um i don't remember if i said this to you last time but embedded uh extended uh inactive and uh you know the ends uh yeah embedded oh embodied",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 423.602,
    "end": 430.088,
    "text": " The traditional four E's, we added something called elementary cognition, which I did say to you guys, basal cognition last time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 430.148,
    "end": 442.161,
    "text": "So this kind of like ties these three areas together, as well as the philosophy of life and death and existentialism and kind of combines them together into a unified framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 442.661,
    "end": 445.602,
    "text": " And then we dive into Markov blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 446.662,
    "end": 457.606,
    "text": "I think they're a beautiful and elegant formalism for tying these ideas together and getting us a step towards the mortal computation, mortal computer design.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 458.066,
    "end": 465.869,
    "text": "And then we talk about the free energy principle underpinnings that essentially the mortal computer embodies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 466.269,
    "end": 469.05,
    "text": "And we review a couple of existing ideas",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 469.21,
    "end": 496.14,
    "text": " mortal computers which do exist so organoids or micro physiological intelligence is a beautiful example of this uh even uh we talk about fungal computers also michael levin's work on xenobots so we have like a nice little table and then there's an appendix with a little bit of expansion on that also we have to give credit to uh ashby uh who's a really well known and or uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 496.56,
    "end": 516.925,
    "text": " very important cybernetical scientist cyber cybernetic cybernetician um and his homeostat which is also an example of an in silico model computer so long story short uh we if we want one path to artificial general intelligence is not going to be the way we have it now",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 517.777,
    "end": 522.319,
    "text": " It's not through just bigger and bigger transformers, which are extremely energy efficient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 522.339,
    "end": 525.821,
    "text": "They're labeled in the domain of AI itself, red AI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 526.282,
    "end": 527.362,
    "text": "We want green AI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 527.422,
    "end": 529.223,
    "text": "We want edge computing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 529.283,
    "end": 538.468,
    "text": "We want neuro robots that are also able to do human-like actions and enact in human-like behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 539.209,
    "end": 547.582,
    "text": " Because we think, for example, the human model or even animal models, right, are a good template for how we can interact and engage in our environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 548.764,
    "end": 553.131,
    "text": "Then the idea is that we need to transition to this idea of mortal computation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 553.641,
    "end": 561.429,
    "text": " and leave behind, my last point here, the tool-oriented view of artificial general intelligence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 561.569,
    "end": 575.983,
    "text": "Because the way we treat AGI today, and we say this towards the end of the paper, that while it's very important and very helpful for humanity to build artificial intelligence systems that are very, very narrow,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 576.363,
    "end": 577.764,
    "text": " and very tool centric.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 577.784,
    "end": 581.227,
    "text": "They are more to support something for a particular task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 581.267,
    "end": 592.094,
    "text": "If we want to build general intelligence, then Carl and I put forth the mortal computation thesis as one possible pathway to go into the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 592.135,
    "end": 598.059,
    "text": "So this is sort of also a call for researchers across all these different domains to come together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 598.68,
    "end": 607.075,
    "text": " ranging from biophysics to biology to computer science and machine learning to computational neuroscience, cognitive science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 607.295,
    "end": 609.058,
    "text": "It's pretty much in cybernetics, of course.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 610.393,
    "end": 618.134,
    "text": " all of them kind of converging to perhaps build a different pathway to what we call the mortal computer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 618.455,
    "end": 621.655,
    "text": "And so I think that wasn't quite a good elevator pitch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 621.675,
    "end": 627.056,
    "text": "That was a little bit longer, but I'm going to stop there because I think then you can just read the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 627.876,
    "end": 628.256,
    "text": "It's fun.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 629.777,
    "end": 630.957,
    "text": "Well, it's a tall elevator.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 630.997,
    "end": 632.377,
    "text": "There's a lot of floors in the bunker.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 634.798,
    "end": 636.298,
    "text": "I think there's a perfect...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 637.799,
    "end": 651.569,
    "text": " articulation there 56.2 let's focus on living functioning cognitive frameworks but it's really cool that you're going into the life and death elements that way so",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 654.261,
    "end": 675.457,
    "text": " I do think that the paper that Blue wants to talk about, there's a complement to it, because we do mention very briefly in this paper cognitive architectures like the common and also the common model of cognition blueprint that we also talked about in point one, which is the center basis for the paper that Blue was going to ask some questions about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 675.797,
    "end": 681.942,
    "text": "I think it's mentioned here briefly, and we also talked about as that being a potential",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 682.402,
    "end": 683.523,
    "text": " Maybe we don't say it this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 683.583,
    "end": 689.868,
    "text": "I said it in conversation to someone, but an inductive bias, which you did write, you wrote basis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 689.948,
    "end": 702.379,
    "text": "I also talk about it as like the idea of cognitive architecture and modules of mind serve sort of like as a prior, and that is produced by evolution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 703.099,
    "end": 707.56,
    "text": " And we also talk in the paper to the moral computing paper, evolution is important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 707.94,
    "end": 710.441,
    "text": "Natural selection is an important ingredient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 710.461,
    "end": 716.482,
    "text": "And if we don't use that, then we have to design the results of evolution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 716.622,
    "end": 723.623,
    "text": "So I think the common model of cognition, which can help segue into the paper now, is a beautiful bias.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 723.923,
    "end": 726.224,
    "text": "It is one of our best bets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 726.744,
    "end": 730.886,
    "text": " for how do we emulate the modules of mind and how things interact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 731.826,
    "end": 737.489,
    "text": "And this would get at the neural computation component of a mortal computer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 737.589,
    "end": 751.756,
    "text": "Obviously, it does not say anything about the body, about the niche, about other agents, but you can imagine it is a little block that would go into this framework, and that would be one step towards a mortal computer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 754.329,
    "end": 756.429,
    "text": " So can I just temporarily derail us?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 757.07,
    "end": 759.05,
    "text": "I just have to ask a follow-up question I have to ask.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 759.15,
    "end": 761.851,
    "text": "It's my fault for derailing at the beginning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 762.931,
    "end": 778.414,
    "text": "So just in terms, when you're talking about mortal computing, I mean, I just couldn't help but go to quantum computing, where the computation itself is so heavily dependent on the substrate and the modality of the hardware.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 778.474,
    "end": 782.515,
    "text": "The hardware and the computation are really inextricably linked there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 783.495,
    "end": 788.958,
    "text": " And in the same way that I can write a paper, you can write a paper, all of these things will outlast us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 789.198,
    "end": 795.321,
    "text": "So some of our computations will survive beyond the point where we're biologically dead, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 795.801,
    "end": 803.945,
    "text": "So in a quantum computer, similarly, all of those computations can then be taken and translated and put into Python and all of the things, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 805.125,
    "end": 818.313,
    "text": " But I just wonder to what extent and like I know I kind of know where quantum computers and artificial intelligence like meet, you know, like everything has got to go into the cubo and then the answer comes out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 818.493,
    "end": 823.936,
    "text": "And so then we take the answer and put it back into Python and do regular AI things with it or in some language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 823.976,
    "end": 824.116,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 824.156,
    "end": 825.477,
    "text": "Not always Python, but sometimes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 825.517,
    "end": 825.637,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 826.437,
    "end": 850.826,
    "text": " so where do you think can a quantum computer or can we ever get quantum computation or what is the role of quantum computation how can that intermingle with artificial intelligence and then become a mortal computer or is that just like too far-fetched we're not going to think about that well so the paper doesn't go into that specifically however we touch on a little bit because uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 852.068,
    "end": 863.653,
    "text": " A little bit of the paper, and we cited plenty, Carl's work with Chris Fields, which I know you guys have been doing a series with him on quantum computing and quantum information theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 864.533,
    "end": 870.296,
    "text": "He had a paper, Neuromorphic Computing Induces the Free Energy Principle, or some version of that title.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 870.356,
    "end": 872.597,
    "text": "I read that many times as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 873.397,
    "end": 881.221,
    "text": "And in there, I think, is the way that quantum computing or quantum information theory would interact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 881.861,
    "end": 908.451,
    "text": " with the mortal computer and so I don't see I see it as another perspective there could have been a fourth perspective in this already long paper and I did originally have some ambition to write something about that and we distilled it to just the concept that Chris Fields introduces which was the interface so I think the quantum information theoretic interpretation of the brain",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 909.071,
    "end": 932.756,
    "text": " and the body especially like as presented in that paper and related work could be a better way to deal with the markov blanket formalism that uh carl and i uh constructed in this paper this paper uh which is largely grounded by also my educational background too because i only have uh you know some moderate knowledge in you know",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 932.936,
    "end": 936.497,
    "text": " quantum mechanics and it was a while since I studied that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 936.597,
    "end": 947.639,
    "text": "But in there we are treating the paper is like a classical interpretation or you could say almost the Newtonian interpretation of the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 948.259,
    "end": 956.141,
    "text": "And in Carl and I discuss as many times as we were working on this paper that that has a limitation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 956.441,
    "end": 959.462,
    "text": "It's not necessarily that you can't build a more I think this paper",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 959.94,
    "end": 965.082,
    "text": " It gives you all the foundation you need to literally build a mortal computer or get started.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 965.222,
    "end": 968.743,
    "text": "It's like a theoretical, mathematical conceptualization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 968.803,
    "end": 977.886,
    "text": "However, there are some weird things about the thermodynamic energy exchange between the internal states of your...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 978.712,
    "end": 981.634,
    "text": " agent, your entity in the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 982.194,
    "end": 988.097,
    "text": "And originally I had a different diagram of the Markov blanket so that there is later in the paper, you'll see it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 988.117,
    "end": 992.0,
    "text": "And I really liked that diagram because it really made, yeah, you probably saw it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 992.02,
    "end": 992.9,
    "text": "It was there towards the end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 992.92,
    "end": 994.461,
    "text": "It looked like a spider almost.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 995.321,
    "end": 995.842,
    "text": "Yeah, that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 996.722,
    "end": 1024.134,
    "text": " so this originally had a different version where i had these uh extra states uh because i like to take old concepts and extend them myself and i had these thermodynamic states in there and i had them tried and i had probabilistic arcs that wired them all these arcs are designed carefully to make sure that it adheres to the markov blanket principles of like you know the dependency relationships between children and parents and the children of children",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1024.675,
    "end": 1027.769,
    "text": " or the children of parents, and how they relate to Go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1027.869,
    "end": 1028.975,
    "text": "So I had embedded",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1029.992,
    "end": 1054.723,
    "text": " extra states and carl said that i should remove those because it's uh it violates the classical interpretation of the free energy principle and long story short is that you have this energy exchange in the diagram and you can represent that is dissipation but it's not a state that the agent would have like access to in the markov blanket so now back to the chris fields interpretation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1055.183,
    "end": 1060.348,
    "text": " If you go to the interface, I think he calls it a quantum interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1061.449,
    "end": 1062.63,
    "text": "He had a name for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1062.71,
    "end": 1065.293,
    "text": "It has this really fancy symbol in the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1066.334,
    "end": 1069.517,
    "text": "If you use that, you get access.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1069.637,
    "end": 1075.323,
    "text": "It's not like you have access to manipulate it, but you can sort of perceive it from the perspective of the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1075.703,
    "end": 1081.524,
    "text": " You see the sensory and the action states or the partitions of that field.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1082.444,
    "end": 1086.045,
    "text": "And I'm probably butchering his language, Chris's language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1086.785,
    "end": 1092.026,
    "text": "And then you also have the thermodynamic exchange portion or partition of that field.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1093.066,
    "end": 1097.567,
    "text": "And it's like the non-manipulatable and manipulable portions of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1097.587,
    "end": 1101.188,
    "text": "And so I think that interpretation could be a more powerful way",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1102.309,
    "end": 1118.922,
    "text": " like you said, Blue, earlier, that quantum information theory and quantum, sorry, quantum information theoretic and quantum computing interpretations lend themselves to that natural entanglement that this paper takes from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1119.162,
    "end": 1129.469,
    "text": "So, again, we surveyed work all the way back to Descartes and Immanuel Kant, but, you know, and tying all their ideas together, because, by the way, even though we're",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1130.29,
    "end": 1140.572,
    "text": " putting forth the phrase mortal computation, the mortal computation thesis, and trying to essentially establish that as our foundation for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1141.587,
    "end": 1144.988,
    "text": " all of science to build on, it's kind of been echoed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1145.688,
    "end": 1149.409,
    "text": "Brilliant minds, thinkers, theoreticians, engineers have existed forever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1149.489,
    "end": 1159.211,
    "text": "So it's kind of like a synthesis and unification of already wonderful ideas across vast parts of all the domains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1159.971,
    "end": 1165.712,
    "text": "But I think the quantum information theoretic way could be the next step, the fourth perspective to quantum computing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1166.192,
    "end": 1171.413,
    "text": " and it could lend itself to maybe easier implementation, especially if you have access to a quantum computer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1171.473,
    "end": 1191.418,
    "text": "Obviously, this is the joke we had last time when we talked about evolution and why I specifically might not directly work in that, although I have some work in genetic algorithms and neuroevolutionary with Travis Dazzle, who was on here for the ant colony optimization work that was presented.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1193.158,
    "end": 1210.46,
    "text": " it's compute right i don't have access to the quantum computers of our time or maybe the simulator and of course the knowledge to perhaps use that effectively however i think that someone who does could perhaps take the principles that are put forth here take the chris fields",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1211.961,
    "end": 1215.723,
    "text": " interface interpretation, and he goes into a lot more detail.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1216.003,
    "end": 1219.304,
    "text": "He had something called a TDNN or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1219.364,
    "end": 1223.465,
    "text": "It was like the quantum neural network, and they were trying to come up with the morphology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1223.805,
    "end": 1227.906,
    "text": "But the principles there are echoed in some sense here, too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1227.926,
    "end": 1230.447,
    "text": "And we cite that word, obviously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1230.567,
    "end": 1232.588,
    "text": "But Carl's on there, too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1232.748,
    "end": 1249.528,
    "text": " But the the the principles of morphology, which are like essentially and we originally had another word in the title called morphic, because the idea is that intelligence should ultimately you can't divorce it from any form of instantiation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1249.568,
    "end": 1250.65,
    "text": "You've got to choose something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1250.99,
    "end": 1253.873,
    "text": " You're going to be brittle, but you're going to be thermodynamically efficient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1254.173,
    "end": 1262.14,
    "text": "And I think if you could interpret it from that perspective, the quantum information theoretic, that might lend itself to a more powerful implementation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1263.422,
    "end": 1276.213,
    "text": "The last comment I'll make, and I'm already long-winded on this, so the final point is we do also briefly mention in the conclusion of this paper, and we haven't even talked about the papers that we wanted to about today, but in the conclusion,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1277.475,
    "end": 1291.691,
    "text": " I also mentioned quantum computing, but in a weird way, so I hope it doesn't feel too contradictory to that I just said that if you take the quantum information theoretic interpretation of mortal computing or build your own interpretation, because we don't",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1292.031,
    "end": 1296.316,
    "text": " really do it much for you here, except mention the interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1297.557,
    "end": 1308.19,
    "text": "While that could be a powerful and perhaps the best way, who knows, to implement it, we also mentioned quantum computation as sort of like, okay, others have been looking at this in AI,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1308.67,
    "end": 1318.113,
    "text": " And for example, saying like we can do if we have a properly developed quantum computer, we can do big brute force search.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1318.173,
    "end": 1318.373,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1318.413,
    "end": 1323.474,
    "text": "We can do simulated kneeling faster than our minds ever could have conceived with classical computing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1323.494,
    "end": 1326.335,
    "text": "And that's kind of just been in what's we can do machine learning better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1326.355,
    "end": 1331.697,
    "text": "And we we sort of argue a little tiny bit against it, not against the.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1331.997,
    "end": 1345.36,
    "text": " interpretation, but rather the fact that quantum computing plus machine learning is just another way to do what we currently do, which is narrow AI brute force search better and faster.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1345.9,
    "end": 1350.421,
    "text": "And so that's essentially it keeps alive immortal computation, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1350.641,
    "end": 1352.101,
    "text": "Because what are we going to probably do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1352.461,
    "end": 1355.462,
    "text": "I'm not pretending to be a seer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1355.482,
    "end": 1356.862,
    "text": "I'm not pretending to predict the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1356.922,
    "end": 1358.783,
    "text": "There's no way I can know of all people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1359.223,
    "end": 1359.443,
    "text": "But",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1361.789,
    "end": 1369.094,
    "text": " The way we're going about it is that, oh, we're going to try to put chat GPT or some transformer-like model in a quantum computer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1369.154,
    "end": 1371.075,
    "text": "And yeah, it's going to work a lot faster.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1371.115,
    "end": 1372.316,
    "text": "It might be more efficient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1372.656,
    "end": 1377.539,
    "text": "But at the end of the day, we're going to be programming that quantum computer at a separation level, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1377.559,
    "end": 1381.222,
    "text": "We're going to try to deal with it like we do in a normal operating system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1381.653,
    "end": 1390.24,
    "text": " Maybe we all have to learn a little quantum mechanics to do it, and we write our code, and we write our software, and then we just hope that the quantum computer can execute it really fast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1390.78,
    "end": 1394.783,
    "text": "That's not the premise that I would want a quantum computer to be used.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1395.044,
    "end": 1399.948,
    "text": "That's still immortal computation, just done in an accelerated, faster way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1400.308,
    "end": 1405.012,
    "text": "So we do warn, or rather even just more like slightly comment,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1405.805,
    "end": 1423.113,
    "text": " that while quantum computing will be important, and there is promise there to even speed up the computations we do today, it's not necessarily, its current use or the way we sort of project to use it is not the right path to AGI either.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1423.653,
    "end": 1427.655,
    "text": "Or biomimetic intelligence, which is really what the paper's trying to say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1427.695,
    "end": 1432.297,
    "text": "If we want to build biomimetic AGI, maybe there's other types of AGI,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1432.777,
    "end": 1454.567,
    "text": " and i don't mean like animal because animals are definitely a part of this paper uh organisms anything that maintains homeostasis to some level that's what this paper says is the the pathway to that style of agi there might be something else again i don't want to comment on whether or not uh large language models and transformers and these new architectures",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1455.007,
    "end": 1463.211,
    "text": " There might be something alien that I can't foresee, and maybe quantum computing will make that more energy efficient in some way or faster.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1464.051,
    "end": 1473.095,
    "text": "It's still going to carry forward, though, the premise of tool-based AI and AI in the way that we do narrow AI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1473.155,
    "end": 1474.956,
    "text": "I don't think it's going to lend itself to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1476.136,
    "end": 1497.065,
    "text": " the path that we would really want general intelligence and general intelligence really is tied uh at least if we use organisms as our exemplars tied to the fact that we we don't have forever right uh that we we know to some degree whether we're conscious or unconsciously aware of the fact that i am at odds with my environment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1498.021,
    "end": 1500.402,
    "text": " I'm going to behave in this way in service of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1500.442,
    "end": 1504.204,
    "text": "And of course, evolution encodes some of that knowledge going into it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1504.224,
    "end": 1511.488,
    "text": "So I just want to comment that I think that it depends on how you use the quantum perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1511.608,
    "end": 1522.334,
    "text": "Like if you use it from the Chris Fields quantum information, theoretic interpretation of the Markov blanket, that might be a really excellent way for someone to even follow up on this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1522.934,
    "end": 1528.62,
    "text": " And add the fourth perspective that Carl and I kind of just dance around a little bit or an implementation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1528.9,
    "end": 1531.302,
    "text": "I think there could be some really fascinating things here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1531.603,
    "end": 1545.456,
    "text": "But if you're just using quantum computing to accelerate your normal run of current day machine learning, the current approaches that we have, then you're just still carrying forward the banner of immortal computation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1546.497,
    "end": 1549.578,
    "text": " Again, too, I want to make one last comment just because we talked about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1550.558,
    "end": 1553.139,
    "text": "This paper says we need mortal computation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1553.659,
    "end": 1554.76,
    "text": "And it was weird.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1555.56,
    "end": 1562.422,
    "text": "There isn't much more than Jeff's one mention of it in his 2022 Ford Ford learning paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1562.843,
    "end": 1567.704,
    "text": "Then my paper had a little bit longer section, the predictive Ford Ford algorithm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1568.044,
    "end": 1572.766,
    "text": "And then I had the spiking version of the Ford Ford, the pioneer, that idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1573.166,
    "end": 1576.957,
    "text": " And we had like an introduction, like about a page about mortal computation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1577.157,
    "end": 1579.283,
    "text": "And then there's this one with Carl, which is, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1579.781,
    "end": 1604.035,
    "text": " really really long uh doozy of a paper um so aside from that I've only seen Mortal Computation sort of discussed oh I see a little bit of Mortal Kombat appearing um I see discussions like brief mentions of Mortal Computation but there was something that Jeff mentioned somewhere along the line or maybe it was an interpretation of it I don't also think Mortal Computation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1604.531,
    "end": 1607.993,
    "text": " to completely replace immortal computation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1608.013,
    "end": 1610.595,
    "text": "I think both have a place in society.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1610.895,
    "end": 1615.878,
    "text": "We just need to understand that they both do different things and they both have different purposes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1616.318,
    "end": 1619.741,
    "text": "If we want, you know, intelligent agents and narrow robots,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1620.581,
    "end": 1639.266,
    "text": " i'm on the camp you need mortal computation to do it right but if we want that type of general behavior but immortal computation is not going to go away it's just more like we understand it has a very high thermodynamic cost because we have to deal with the von neumann bottleneck the memory bottleneck we're not using in memory processing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1640.718,
    "end": 1642.961,
    "text": " Maybe quantum computing will speed that up, too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1643.061,
    "end": 1647.748,
    "text": "And then immortal computation can live side by side, and we'll have those as tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1648.228,
    "end": 1657.201,
    "text": "So I also want to make that clear for anyone that ever watches this recording later, that the mortal computation thesis isn't to say it's the only way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1657.501,
    "end": 1682.942,
    "text": " to do computation it's just we should shake up the roots of computer science at its foundation and say maybe there's another way to do it and we should have both live side by side and hey this one might lend itself to agi um which by the way some people might disagree with that as well i don't again i we do offer it very humbly in the paper as one possible pathway not the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1683.663,
    "end": 1686.044,
    "text": " Because, again, I could be completely wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1686.124,
    "end": 1687.444,
    "text": "There could be a better way to do this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1687.584,
    "end": 1689.545,
    "text": "But yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1692.285,
    "end": 1697.467,
    "text": "So, well, that was a really good answer, and you really articulated what I was trying to ask about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1697.507,
    "end": 1701.868,
    "text": "And I think it's actually really easy to get access to a quantum computer, but it's not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1702.328,
    "end": 1705.789,
    "text": "It's really easy to get access to the interface.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1706.863,
    "end": 1707.864,
    "text": " to a quantum computer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1707.944,
    "end": 1713.769,
    "text": "And I think that what you, what you keyed in on is like, you need the morphology, you need the structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1713.849,
    "end": 1728.023,
    "text": "Like, so in order to play with a quantum computer and program the quantum computer to do mortal computation, you actually have to play with the substrate itself and not just have access to the computer through some interface network, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1729.164,
    "end": 1729.324,
    "text": "Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1729.384,
    "end": 1729.924,
    "text": "Bingo.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1730.345,
    "end": 1730.645,
    "text": "Bingo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1733.806,
    "end": 1740.049,
    "text": " to kind of bring us towards the non-human cognitive modeling slash fourth paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1741.55,
    "end": 1747.333,
    "text": "Something coming up in that was all the different ways that we talk about interface and also the different ways we represent it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1747.373,
    "end": 1759.278,
    "text": "Like this is really creative and I've never seen the blanket represented this way with a zone and which connects nicely to the blanket index.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1759.338,
    "end": 1761.92,
    "text": "But whether we're talking about the kind of strict",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1762.972,
    "end": 1786.668,
    "text": " analytical base graph markov blanket or the quantum interface or just an engineering interface input output or flow diagram systems dynamics or the kind of perhaps most general or accounting system of them all like applied category theory we're describing these different facets of the interface",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1787.589,
    "end": 1795.012,
    "text": " So that's one place to begin when modeling a non-human or a human cognitive architecture is its interfaces.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1795.232,
    "end": 1804.056,
    "text": "It's like if those aren't accounted for, we're either speculating information that we're measuring or observing or interacting with this cognitive thing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1804.076,
    "end": 1812.42,
    "text": "We're either speculating about what we could do or about what we could measure, or we're missing things that we actually can intervene with and measure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1813.24,
    "end": 1815.321,
    "text": "So maybe how do we go about...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1816.678,
    "end": 1824.072,
    "text": " before even wondering about which formalism it's gonna be described as, how do we think about the interface of a cognitive system?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1825.748,
    "end": 1829.69,
    "text": " Well, you just brought up a really good point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1829.71,
    "end": 1846.641,
    "text": "I just want to point out that you said if we don't design the interface between, let's say, the internal states of the agent, which just to connect it to the cognitive modeling paper, you could think of the common model of cognition as the design of the internal states, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1846.961,
    "end": 1848.102,
    "text": "It's the brain, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1848.682,
    "end": 1852.224,
    "text": "And let's just keep it like the organization itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1852.424,
    "end": 1853.685,
    "text": " all principles of the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1853.725,
    "end": 1858.548,
    "text": "Because again, I think of CMC, common model of cognition, as a blueprint.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1859.008,
    "end": 1869.354,
    "text": "And, you know, cog engine, which is what that paper is about, is a physical, well, it is a computational instantiation of some pieces of CMC.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1870.074,
    "end": 1873.016,
    "text": "And even that is still only a part of the puzzle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1873.216,
    "end": 1877.959,
    "text": "So, but you can think of that, that's going to be what's inside the Markov blanket, all right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1878.039,
    "end": 1881.461,
    "text": "And then, of course, inside of it could be more Markov blankets, because we also talk about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1881.721,
    "end": 1891.135,
    "text": " markup blankets of markup blankets of markup blankets and there's a recursive assembly kind of but uh you brought up daniel if you don't design",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1897.052,
    "end": 1913.181,
    "text": " It could also be an engineered, you know, permeable boundary with pumps and things that, you know, for example, remove toxins from the internals of the agent and brings in nutrients and energy, which we do talk about as well in the in the mortal computation paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1914.995,
    "end": 1919.317,
    "text": " Regardless of the formalism, you're all if you don't account for it and you don't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1919.398,
    "end": 1930.744,
    "text": "So while cog engine does not account for it, it's still one of those like, well, we're going to just say we're looking at some very, very specific internal states and we're going to probe it in a very specific way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1931.004,
    "end": 1934.726,
    "text": "Although we kind of have an agent because we do use the Jim mini grid.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1934.766,
    "end": 1936.107,
    "text": "So there is a body, but it's like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1936.767,
    "end": 1961.327,
    "text": " a really really really simplified body uh you're missing out on a lot of intelligence and cognition that the boundary itself will give you so even in cells right so this is to take what you said daniel and you know jack uh boost it even higher the boost the signal uh is that i also believe a lot of the intelligent computations that we do",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1962.168,
    "end": 1963.489,
    "text": " are offloaded, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1963.509,
    "end": 1965.829,
    "text": "This is the embodiment thesis of cognitive science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1967.01,
    "end": 1977.434,
    "text": "Even the permeable cell boundary, right, of just single-celled organisms or multicellular organisms, it does a lot of beautiful things that the internal states are not doing like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1978.134,
    "end": 1980.716,
    "text": " consciously or directly with effort.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1980.756,
    "end": 1983.097,
    "text": "May I should be careful of consciousness at different levels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1983.157,
    "end": 1993.342,
    "text": "But that boundary, the Markov blanket offloads some of that compute that the brain or the internal states need to worry about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1994.262,
    "end": 1997.444,
    "text": "And they can sort of rely on what the boundary does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1997.504,
    "end": 2001.766,
    "text": "Now, of course, there's more to that story that even the Markov blanket",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2002.785,
    "end": 2030.429,
    "text": " doesn't necessarily need to address it but there's the fact that there's also autopesis so the idea is that the system reproduces it's self-reproducing that's where why there's a lot more it's a paper that very much is like an iceberg you can read the beginning and be like that's a beautiful phrase and then what's underneath it is this extremely deep and i don't even think i carl and i have properly even captured all the facets that you could add to this there's more like we just talked about the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2030.789,
    "end": 2033.03,
    "text": " quantum interpretations as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2034.071,
    "end": 2051.66,
    "text": "So assuming that we have everything taken care of, that things self heal, self repair, the boundary itself is in constant reconstruction, you have this nice power or nice advantage that you not only account for how energy flows in and out of the system,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2052.3,
    "end": 2056.602,
    "text": " and things that you would normally not account for in our traditional agents that we design today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2057.763,
    "end": 2060.725,
    "text": "But you would also have the ability to offload cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2060.745,
    "end": 2066.387,
    "text": "There's even a domain, we mentioned it in the paper too, but you might have heard of morphological robotics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2067.588,
    "end": 2074.952,
    "text": "And there's even classical ideas going back to even, I believe even Rodney Brooks mentioned aspects of this as well in some of his early work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2075.892,
    "end": 2076.653,
    "text": "If you study",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2077.253,
    "end": 2082.327,
    "text": " the way that we move our joints and our arms uh you know there's a lot of uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2083.174,
    "end": 2106.697,
    "text": " cognition offloaded into that act and you can also get that in terms of robotics too and just saying by understanding the you know kinematics that drive an arm now the robotic brain if you will the neuro robot only needs to say i need to move my hand to this point and then it can sort of trust its digital nervous system or rather the actual constructs and the robotic hardware",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2107.611,
    "end": 2127.775,
    "text": " to move the rest of the arm like it doesn't have to think consciously about moving the elbow just needs to move the point you know from computer graphics inverse kinematics right you only need to move the point of the hand to where you want to go and then the rest takes care of the motion and it looks you know it doesn't break the constraints of how like the bones are structured and the skeletal structure of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2128.115,
    "end": 2129.316,
    "text": " armature of the character.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2129.716,
    "end": 2133.977,
    "text": "So I think there's even more to just model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2134.638,
    "end": 2143.841,
    "text": "So we do talk about modeling, too, because some of us, or a lot of us, might not have access to the hardware as well, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2144.242,
    "end": 2144.782,
    "text": "I think it's in the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2145.762,
    "end": 2149.764,
    "text": " I think it had to be moved to the supplement of the paper because it was already very long.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2150.184,
    "end": 2153.826,
    "text": "Yeah, it is in the supplement, but we have this problem called the body niche problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2154.926,
    "end": 2163.87,
    "text": "And besides the fact it's a nice sounding philosophical problem, there's this issue that robotic hardware or even organoid, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2164.81,
    "end": 2188.748,
    "text": " constructs or biological substrates or chimeric won't be available to everyone so if we want to democratize things we're going to probably need to model these digitally and so we have this concept called a digital morphology so maybe we can take whatever principles of physics and other aspects of thermodynamics maybe we can construct bodies that we can simulate for cheap so that way people can work on mortal computers",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2189.651,
    "end": 2215.4,
    "text": " simulated right uh although the ultimate would be you just like blue brought up earlier about the best way to use a quantum computer would be to literally have access to the quantum computer and then design your internal states your software that would run it run it uh literally on chip right or on on quantum computer whatever the right word for that would be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2215.86,
    "end": 2216.841,
    "text": " But they're entangled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2217.021,
    "end": 2234.53,
    "text": "So you're only paying the cost, the thermodynamic cost of reading and writing to the memory right on the chips or right on the actual platform itself, rather than having these separations, even including operating systems and the transfer of memory in a hierarchy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2234.97,
    "end": 2237.532,
    "text": " And so having the actual hardware would be the best.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2237.972,
    "end": 2243.355,
    "text": "And I think that's where, you know, even the work kind of says this is where the future really lies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2243.555,
    "end": 2247.838,
    "text": "But probably along the way, we could probably work with digital morphologies as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2248.418,
    "end": 2257.243,
    "text": "So long answer, but just to say that your point is great and we could boost it even further by offloading cognition to the body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2257.503,
    "end": 2262.126,
    "text": "And I also think, as you said, what formalism would you choose?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2262.626,
    "end": 2263.747,
    "text": "And I don't think...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2264.682,
    "end": 2292.986,
    "text": " any one formalism is you know like superior per se they give you different things i think the marco blanket is nice because it connects to uh bayesian probability and then you can kind of at least characterize the relationships between states um but from an engineering point of view i don't think you like directly have to design the exact marco blanket because now you're dealing with a graphical model and what would you what do we usually do we usually choose discrete states and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2293.405,
    "end": 2314.928,
    "text": " world's continuous i've thought about this like i thought okay now that this paper has come out how do i build my own mortal computer right just to show how we could do this uh but you know i think michael levin has a great example uh with the xenobots like that's one way to do it although it's very biological artificial um but i think just designing boundaries",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2315.949,
    "end": 2331.141,
    "text": " And sort of clearly explaining or accounting for the thermodynamic exchange and understanding, like, what are the resources that we have at hand, even in a very controlled environment, might be the way to design the Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2331.181,
    "end": 2337.426,
    "text": "Because then you get for free if you have, like, and I think we talked last time about, like, a quadruped neuro robot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2337.646,
    "end": 2366.462,
    "text": " like spot or something and you know have it outside right if you already choose your body and you put it in an environment you've already now dealt with the boundary in the niche you just need to understand the properties of that which is where we can leverage the the wonderful knowledge across domains like physics and biology and chemistry understand the properties of that body right understand the properties of that niche and then all we have to work on is the internal state design",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2367.302,
    "end": 2393.107,
    "text": " and how does that interact with maintaining persistence right for example battery level power level that's a homeostatic variable or a metabolic variable there you go now you can build your agent about keeping that variable uh in within a certain range right because homeostasis is about a set point so may have a target or actually the we changed the word to something more powerful hormy or he says",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2393.587,
    "end": 2396.168,
    "text": " which is homeostasis over time, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2396.188,
    "end": 2399.73,
    "text": "Because set points might change like in flux to the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2400.691,
    "end": 2403.452,
    "text": "So that's a kind of a cool concept as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2403.752,
    "end": 2406.354,
    "text": "There's like a word for everything I learned when writing this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2406.454,
    "end": 2408.995,
    "text": "So many concepts already exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2409.035,
    "end": 2411.877,
    "text": "All we have to do is just stitch them together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2411.897,
    "end": 2417.18,
    "text": "And this is one way to stitch them together into a nice little framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2418.34,
    "end": 2419.481,
    "text": "So did that make sense?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2421.277,
    "end": 2449.072,
    "text": " yeah i'll i'll make a note and then blue i'll be curious to see what you think about this i think with what you've just described you've almost given some of the most specific ways to think about what is offloadable we've talked about extended cognition and about having passive artifacts in the niche like paper and pen and then having active artifacts in the niche like autonomous agents or whether they're material or or just digitalized",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2450.032,
    "end": 2467.385,
    "text": " So it's interesting that by putting certain computation on the boundary or on the interface, broadly conceived with both a material thermodynamic and a informational semantic component, then it's like, yeah, the nucleus doesn't decide about the cell morphology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2467.825,
    "end": 2470.928,
    "text": "And so it's like, how many layers can you put in between",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2472.674,
    "end": 2496.344,
    "text": " between so that the computation goes out to the interfaces everywhere's an interface from somewhere and that's where the work is really done and then there's just so many other great points but what do you think about this kind of conclusion to 2023 live streams after long arcs with thinking about embodied cognition and cognitive architectures",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2500.902,
    "end": 2516.998,
    "text": " um so wow what is offloadable uh i have a lot to say about that um so like in terms of what the body does um and let me know if my internet cuts out and i'll shut my video off um but in terms of what the body does",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2517.879,
    "end": 2520.681,
    "text": " Like it's like you think about things that are automatic, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2520.721,
    "end": 2526.525,
    "text": "Like the heartbeat and the breath and stuff that like we just ignore.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2526.545,
    "end": 2532.61,
    "text": "And like, I mean, if you really you could do biofeedback and slow your heart rate and like breathing, you can definitely control.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2532.65,
    "end": 2534.251,
    "text": "I mean, it's very obvious that you can control it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2536.051,
    "end": 2541.493,
    "text": " But, like, I wonder about these things, like, what is offloaded to the body that we're ignoring, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2541.513,
    "end": 2554.996,
    "text": "Like, if you offload too much, you know, like, we have, like, gut reactions to things, like, you know, these, like, sensations, and there's, like, a lot of computation happening within our own morphological structure that maybe we're not conscious of.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2555.116,
    "end": 2560.878,
    "text": "Like, so a lot is unconscious, but then, like, are we overlooking stuff that we should then be paying attention to?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2560.978,
    "end": 2564.539,
    "text": "Like, I wonder, what is the price of offloading?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2566.567,
    "end": 2567.948,
    "text": " I think that's a great question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2570.73,
    "end": 2571.73,
    "text": "I mean, I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2572.931,
    "end": 2584.778,
    "text": "To be fair, I can't say I know the exact sweet spot because that would also mean that I have the exact instantiation of the mortal computer that I wish to build, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2585.319,
    "end": 2587.1,
    "text": "You know, the answer is we need to study that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2587.76,
    "end": 2588.921,
    "text": "That's the short answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2588.941,
    "end": 2591.283,
    "text": "The slightly longer answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2591.303,
    "end": 2594.925,
    "text": "How do I say this without letting myself ramble?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2597.947,
    "end": 2609.193,
    "text": " Well, so maybe there is a point where we cross where we had, let's say humans, animals, even any, any entity has failed to find the sweet spot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2609.293,
    "end": 2612.415,
    "text": "Like you just said, blue, even we humans.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2613.677,
    "end": 2625.621,
    "text": " When we do something, we have a gut reaction and we might tend to listen to that gut reaction rather than doing some other type of processing like thinking critically or logically and counteracting it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2625.661,
    "end": 2640.167,
    "text": "We also have emotions, which I think is very important, which we don't really quite have that in today's AI, but we do kind of have a little bit of some good work has been done in cognitive science and cognitive architectures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2642.441,
    "end": 2655.608,
    "text": " I think that we might have already crossed the sweet spot because some of us listen more to our guts and our emotions than logical logic or reasoning or, you know, planning things out more carefully or listing pros and cons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2655.869,
    "end": 2659.691,
    "text": "Some of us might not listen enough to our gut feelings and we listen too much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2659.751,
    "end": 2663.913,
    "text": "So I think the diversity in even within society",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2664.093,
    "end": 2689.869,
    "text": " any entity such as a human is vast and so maybe someone has the optimal sweet spot i don't know who does it varies but it doesn't matter so it's kind of interesting we it's it's an interesting question to quantify and worth looking at but at the same time in designing a mortal computer let's say i failed to design the one that has the right balance let's say i designed a computer that mortal computer that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2690.409,
    "end": 2694.133,
    "text": " leaned more heavily towards gut reactions than not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2694.513,
    "end": 2705.843,
    "text": "Well, I would still be thrilled that we built such a computer because while it would be great to find and characterize these set points, or sorry, these boundaries and regions,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2707.634,
    "end": 2715.796,
    "text": " we would still have the premise that, look, life is built on these hierarchical or rather layers of complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2716.176,
    "end": 2726.599,
    "text": "So homeostasis, sorry, homeohesis and homeostasis, which sit at sort of the bottom of what we talk about in the paper, and then underneath that are like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2727.697,
    "end": 2742.384,
    "text": " Got to be careful a little bit, but they're like metabolic pathways or what we or Carl and I call essential primitives or variables, which are kind of like the materials and the very base constructs that maybe we manipulate to survive with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2742.704,
    "end": 2747.766,
    "text": "But above that are things like allostasis and complex processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2747.786,
    "end": 2749.587,
    "text": "And of course, we put at the top of our hierarchy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2750.367,
    "end": 2770.64,
    "text": " auto pieces but technically the idea is that everything would be self-repairing and healing but if we put the growth and dynamic change aside for just a minute our allostasis can be argued and it has been argued to be all kinds of things it can be oh we have little neural circuits that try to predict",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2771.3,
    "end": 2775.762,
    "text": " when homeostatic processes are going to need resources.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2775.862,
    "end": 2796.69,
    "text": "And so this is where you can see it in animals and insects and other types of creatures that, oh, I know that the seasons are going to change, like birds, they fly to another, and so they have these kind of instincts built in, or they have some sensors in circuit processing to say, I should probably go somewhere else where I'm not going to die for the winter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2796.73,
    "end": 2798.431,
    "text": "And so then they flock away, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2798.911,
    "end": 2799.672,
    "text": "Or they fly away.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2800.672,
    "end": 2803.413,
    "text": " So there's already some higher level behavior built on there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2803.673,
    "end": 2819.02,
    "text": "The reason I bring up that, just to tie it back to that balance point that you bring, Blue, is that we would have the opportunity to design those neural processes that could override, for example, your gut reaction or your",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2819.72,
    "end": 2821.362,
    "text": " more primitive instincts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2821.742,
    "end": 2829.089,
    "text": "And so this is what's kind of nice about the mortal computer is we would want that ability to do planning, to do higher level thinking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2829.129,
    "end": 2832.832,
    "text": "And this is, again, what connects nicely to the cognitive architecture, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2832.852,
    "end": 2838.057,
    "text": "If we have a more developed, let's say, brain region area, right, we have different types of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2838.117,
    "end": 2847.159,
    "text": " memory, like procedural declarative memory, now we're able to start to think at a higher level that's not just purely driven by our instincts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2847.199,
    "end": 2854.481,
    "text": "And so the 5E cognitive theory in the paper, elementary cognition, I don't think is the only thing you need.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2854.781,
    "end": 2857.742,
    "text": "That would be like, I only rely on my gut instincts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2857.822,
    "end": 2860.243,
    "text": "I am primitive in the sense, primal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2860.363,
    "end": 2863.684,
    "text": "I only want to live and I will do whatever it takes to live.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2863.704,
    "end": 2865.104,
    "text": "But for example, if you live in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2865.544,
    "end": 2890.985,
    "text": " a society of mortal computers which is one way you could think of humans i'm not gonna start calling my friends mortal computers but we live in a in a relationship we have a we are a complex system in ourselves well now we're not just only thinking about uh exactly like i i don't want to die right now right because if that's how we live then you know we go back to uh kill or be killed law of the jungle right we are just sort of fighting amongst each other so i think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2892.054,
    "end": 2917.717,
    "text": " while it's hard to answer what's the sweet spot or the balance point i would still think having a mortal computer that even has the ability to engender those primal gut instincts would be very powerful and then we could work on thinking well what are the right neural processes to counteract that right to add the critical logical thinking what constructs would have evolution evolved to allow us to counteract that um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2918.936,
    "end": 2919.817,
    "text": " Does that make sense?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2919.937,
    "end": 2934.538,
    "text": "Because I think it's almost like it's a good question to ask, but I don't think it's more like it would be profound if we had something that leaned a little too heavily on its gut instinct and we say, okay, but now we have these allostatic processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2934.878,
    "end": 2951.645,
    "text": " We're just missing more of that higher level behavior to counteract that because we humans are able to, for example, ignore even sometimes our primal needs, our desire, not maybe completely desire to persist because some of that's very deep, low level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2952.285,
    "end": 2954.946,
    "text": "But like we even have the act of like heroism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2955.146,
    "end": 2955.366,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2955.406,
    "end": 2959.948,
    "text": "You know, like I'm going to go save someone that I care about and that will end your persistence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2959.968,
    "end": 2964.229,
    "text": "You will thermodynamically disintegrate when, you know, I go into the fire.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2964.289,
    "end": 2964.469,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2964.829,
    "end": 2967.21,
    "text": "So we have these higher level cognitive processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2967.27,
    "end": 2972.972,
    "text": "We're going to need to design those two or let some evolutionary process let those emerge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2973.112,
    "end": 2977.073,
    "text": "So I would still we just don't have the low level either.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2977.313,
    "end": 2986.562,
    "text": " And we might not have the full picture of the higher level, but right now, a lot of artificial intelligence doesn't even have that that primal persistence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2986.642,
    "end": 2986.942,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2987.363,
    "end": 2994.309,
    "text": "So I think I would be thrilled to have that problem and say, oh, blue, it's a little too survival oriented.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2994.669,
    "end": 2999.054,
    "text": "Maybe we could try to introduce the right mechanisms to counterbalance that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2999.534,
    "end": 3000.335,
    "text": "That's another thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3002.173,
    "end": 3025.581,
    "text": " so i just i'm rereading a book by um the theoretical physicist fred allen wolf and he talks about um like literally in terms of quantum entanglement he talks about the entanglement of thought and emotion which i think like thinking about quantum computing and quantum entanglement like the entanglement between thought and emotion is just like a really",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3027.091,
    "end": 3037.428,
    "text": " interesting concept to me or just an interesting way to think about like who wins or like can you have one without the other or one always knows what the other one is doing or yeah",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3040.925,
    "end": 3063.773,
    "text": " And the problem we have in, I agree, we have that entanglement, and it's fascinating, the problem in artificial systems or technological artifacts, which, by the way, another theme of this paper, and we sort of wrap it up, is it's like a path to, it's going to sound a little odd, artificial sentience, and then that also opens up the whole moral",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3065.41,
    "end": 3076.199,
    "text": " issues and ethical dilemmas, but, um, but even get there, I would argue we're missing the half of your entanglement, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3076.279,
    "end": 3087.648,
    "text": "We're missing more the emotional side, which I think also stems from, you know, even the lower level processes that kind of give rise to the emotional states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3087.748,
    "end": 3094.513,
    "text": "And cause you know, there's, there's a lot of physiology and a lot of physiological connections between like the chemicals and things in our body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3094.833,
    "end": 3097.216,
    "text": " that also help drive those emotions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3097.437,
    "end": 3098.358,
    "text": "And I think we need them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3098.658,
    "end": 3102.903,
    "text": "And I think technological artifacts are missing at least.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3103.344,
    "end": 3113.537,
    "text": "I'm not going to say if we've tackled sufficiently the higher level cognitive behavior, because there's still the work being done in cognitive architectures and cognitive modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3114.257,
    "end": 3125.384,
    "text": " Although I also think that because we're missing half, which is the emotional side of things and the biophysical drives and manipulations, we're missing that entanglement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3125.464,
    "end": 3129.026,
    "text": "So the design of our intelligent system is sort of like detached.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3129.386,
    "end": 3137.051,
    "text": "We're still in many ways in AI, and we also mentioned this in that paper, you might have heard of brain in a vat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3137.991,
    "end": 3141.072,
    "text": " which is the idea of what you can think of intuitively.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3141.252,
    "end": 3142.712,
    "text": "It's an old cognitive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3143.092,
    "end": 3144.472,
    "text": "No one really ever said it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3144.672,
    "end": 3162.236,
    "text": "It's more of like a criticism of old cognitive science, which is to say that neural processing, our mental representations, our decisions that we make and our plans that we make and our complex logical order processing are completely divorced of the body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3162.316,
    "end": 3163.456,
    "text": "It's the extreme.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3164.396,
    "end": 3182.221,
    "text": " uh it's essentially mortal immortal computation which is kind of another fun thing we pointed out um but in the cognitive sciences and philosophy of mind realm and because we've been designing things from that perspective for so long uh we're missing that entanglement and i think there's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3183.001,
    "end": 3199.555,
    "text": " some of the roadblocks we will face in the future some of the things we can't necessarily build maybe the holy grails that still remain like you know higher order logical reasoning and uh complex planning that you know transformers and the big neural models can't really quite do today",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3199.955,
    "end": 3223.42,
    "text": " despite claims that are being made from the public relations of different companies um i think that we're missing that other piece of the equation that could have helped inform and make those processes that we design better but we're also missing that relationship so that entanglement blue is inherently not there uh which is there in for example",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3223.9,
    "end": 3227.441,
    "text": " human entities and animals or living beings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3227.461,
    "end": 3232.042,
    "text": "We have that interplay, and then we have the ability to decide if we want to override it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3232.082,
    "end": 3234.763,
    "text": "But technological artifacts don't have that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3234.803,
    "end": 3236.263,
    "text": "There's nothing to override.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3236.343,
    "end": 3239.164,
    "text": "So at least I'm going to make that claim.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3239.184,
    "end": 3248.026,
    "text": "I'm sure that there is this world called effective computing, but I'm not 100% clear if whether or not that has",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3249.173,
    "end": 3262.992,
    "text": " all the ingredients that I would say need to be in place to build that 50% of the entanglement of emotion to higher level cognition and reasoning and non-emotional reasoning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3264.193,
    "end": 3293.042,
    "text": " so and we need that so i would love to have that and then we could then quantify that entanglement right and talk about the relationship or proportion of emotional processing or even low-level biological processing to higher level or cognitive processing and planning and decision making i don't know if blue heard that but i see her think green so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3295.834,
    "end": 3324.946,
    "text": " yeah wow i i brought up an image this is a figure 1.2 from the textbook with the high road and the low road so the low road how it's constructed and that's bayesian but we could consider other ways that things are actually built like jf cloutier working on the symbolic active inference so programs from the bottom up or there could be different heterogeneous elements we talked about quantum and neuromorphic so",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3326.132,
    "end": 3341.91,
    "text": " as many material substrates as there are material substrates to be inclusive of what ecosystems actually consist of and then first principles thinking first principles approaches including the free energy principle",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3342.851,
    "end": 3360.326,
    "text": " or unified through consideration with the free energy principle all of these terms that include complex systems phenomena self-organization autopoiesis like you mentioned and how",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3362.386,
    "end": 3382.011,
    "text": " the current narrow or whatever it is computer science that we continue to ride inertia and acceleration on from the kind of von neumann architecture um and scaling in in materials with a lot of costs like that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3383.152,
    "end": 3404.101,
    "text": " is almost missing these two complements one of them is the top-down organizing principle though there are organizational principles within computer science of course it's a formal field but unified principle and then almost like you know in a very interesting relation that that i hope people can explore later is this other complementary relationship",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3405.051,
    "end": 3433.827,
    "text": " between i mean to put it coarsely like the heart and the brain and the integration with the hands and about pragmatic value and the affective value and blue you ask like what if we're what if we're like least aware of what we offloaded it's like that's we're only aware of what we're not offloaded so every every if we just take a a mental survey of what we know that's the remainder",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3434.887,
    "end": 3449.464,
    "text": " of what we don't know and that's a very different very integrated compressible perspective that then can unroll a lot of different ways that isn't just like we have to do what we're doing now but just more",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3452.162,
    "end": 3466.232,
    "text": " Well, and just a quick point, there's also this beautiful concept called, and it's being embraced in cognitive science more recently because it was even the theme of COGS, I believe, last year, cognitive diversity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3467.013,
    "end": 3474.819,
    "text": "And that's the beautiful part of embodiment, the embodiment thesis in cognitive science, which is it can give you an explanation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3475.599,
    "end": 3485.005,
    "text": " of all the different ways in which we might have something more offloaded than not into the different varying degrees.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3485.085,
    "end": 3494.892,
    "text": "And so even maybe the question sometimes isn't what's optimal, but rather, can we capture the wide array of different amounts of cognitive offloading?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3494.952,
    "end": 3498.274,
    "text": "Because if you change the body, you change the cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3498.314,
    "end": 3501.436,
    "text": "And that's like the embodiment thesis in its natural form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3501.817,
    "end": 3509.459,
    "text": " And this paper echoes that extreme kind of view a bit that if you change the body, you're going to change the thinking and fundamentally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3509.813,
    "end": 3527.419,
    "text": " And we know this even internally within the same body if you are feeling sick, if you are feeling hungry, or even if you can fight these things with a top-down approach to some degree, but it will affect, for example, your focus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3527.619,
    "end": 3530.58,
    "text": "If you're sick, it's harder sometimes to write a paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3530.62,
    "end": 3532.881,
    "text": "You have something called brain fog, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3532.941,
    "end": 3536.822,
    "text": "And so that's where the body is so intimately involved",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3537.482,
    "end": 3564.245,
    "text": " uh in our biophysics and our physiology so intimately involved in our everyday processing that uh and different people are affected to different degrees i mean i'm sure there's someone out there's like no i'm uh maybe they had for example uh a really bad cold and they're like no i was able to get the same amount of work done as always right i mean and that would also show you that it's going to be vastly different even within the same type of entity and so um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3564.986,
    "end": 3590.337,
    "text": " that that's something cognitive diversity I think gets captured by this type of thinking and it could be really interesting you know from using the premise of a mortal computer to sort of construct systems that are like that and by the way the mortal computer rests on that nice diagram that you have there you know with the active inference and the free energy it sort of tries to hit most of those main points and sort of like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3590.897,
    "end": 3595.02,
    "text": " agglomerate them into, well, we even propose a definition, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3595.24,
    "end": 3596.961,
    "text": "I mean, is it a complete definition?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3597.001,
    "end": 3598.883,
    "text": "I'm sure there's extensions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3599.623,
    "end": 3603.646,
    "text": "There's probably corollaries to add to the mortal computation thesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3605.592,
    "end": 3614.954,
    "text": " But I just wanted to throw that point in there because I think that that's where it's that that how much we offload will also change, even if it's like maybe not optimal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3615.014,
    "end": 3618.474,
    "text": "But, you know, that would be more dictated by an evolutionary process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3619.374,
    "end": 3633.537,
    "text": "But you have different entities and different organisms that offload to different degrees and depending on your body and what affordances it gives you, what what abilities it offers you to interact with affordances in the environment and tools and things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3634.878,
    "end": 3641.528,
    "text": " If I had eight legs, I'm going to be able to do drastically different things than, you know, with my bipedal body right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3642.088,
    "end": 3645.834,
    "text": "And morphological robotics usually explores some of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3646.815,
    "end": 3650.981,
    "text": "What can different bodies beyond the humanoid style do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3651.481,
    "end": 3674.874,
    "text": " uh provide and for example quadruped robots which they take you know another thing in nature like oh let's say animals like dogs and cats but they're wonderful for like search and rescue right whereas a bipedal system might struggle to get into certain spots but if we had a quad in there we've changed the body and hence we've changed the cognition and the mental neural processing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3679.963,
    "end": 3706.768,
    "text": " yeah a lot lot just even from the outside of robotics i hear about cognitive robotics so the adjective is saying well we're pulling back to consider cognitive architectures and then there's another layer which is like well how does it get there what's the developmental trajectory and then what is the ecology of similar or different minds and and bodies and then what's the evolutionary process you can",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3707.955,
    "end": 3736.181,
    "text": " keep the um like you you you again in in um kind of distinction describe the immortal it's designed as if immortal but of course in reality the linux operating system or any given language model is mortal you just unplug it because its energy resources aren't accounted for so it's kept in this suspended bare life state where it's at the behest of something else and so then that like unsustainability",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3737.611,
    "end": 3766.193,
    "text": " propagates through a system causing externalities so ensuring that the externalities can be understood where they are leads so we expect to scalable interpretable systems that don't just hide the semantic ambiguity and the material components they're so abstractly considered",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3767.699,
    "end": 3773.845,
    "text": " And it's so unintegratable with emotive components that it feels like a dead end.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3778.729,
    "end": 3782.772,
    "text": "So I hate to keep talking about mortal computation, but we're doing it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3784.294,
    "end": 3786.396,
    "text": "Well, it's your guy's podcast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3786.536,
    "end": 3788.698,
    "text": "I'm happy to blab about anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3788.738,
    "end": 3789.859,
    "text": "I just want to make sure that...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3791.032,
    "end": 3796.837,
    "text": " If you wanted to talk about those papers... By the way, we did talk about those papers last time, too, and they're integrated, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3796.877,
    "end": 3798.358,
    "text": "Maybe we can relate some of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3798.598,
    "end": 3807.566,
    "text": "Like, I keep bringing the cog engine paper, not because it in and of itself is mortal, but I argue that it is a piece of that puzzle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3807.806,
    "end": 3811.709,
    "text": "Like, if I were to go, yeah, that architecture there, that's not a mortal computer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3811.749,
    "end": 3817.834,
    "text": "However, it is a cognitive architecture, and I think it plays a role in the design of systems, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3817.874,
    "end": 3819.976,
    "text": "For example, maybe blue, it helps...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3820.476,
    "end": 3831.566,
    "text": " It would help us, for example, to design higher-level processing to counteract some of the lower-level emotive decisions that an agent would want to make.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3831.686,
    "end": 3833.148,
    "text": "So I just want to make a mention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3833.488,
    "end": 3835.229,
    "text": "I'm fine with talking about whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3835.37,
    "end": 3836.771,
    "text": "I'm the one that shamelessly plugged it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3836.811,
    "end": 3840.774,
    "text": "I just actually wanted to plug it, and then we could go from there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3840.794,
    "end": 3843.677,
    "text": "But they're intertwined.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3845.017,
    "end": 3849.938,
    "text": " It's not like my thinking is, oh, when I work on CogEngine, I turn off the mortal computer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3849.978,
    "end": 3852.719,
    "text": "It's like, no, they're all swirling around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3852.779,
    "end": 3853.959,
    "text": "It's all part of the same thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3854.019,
    "end": 3856.639,
    "text": "So if you want to keep talking about it, be my guest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3857.339,
    "end": 3858.059,
    "text": "I'm your guest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3858.76,
    "end": 3871.962,
    "text": "So I just have a question about when we talk about scalability and interpretability, I wonder how much interpretability is due to the fact that we're missing that emotive",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3872.962,
    "end": 3873.783,
    "text": " setup, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3874.003,
    "end": 3892.113,
    "text": "So if we have some kind of interplay between persistence, emotion, thought, if there's some kind of struggle, like who's winning the war when we make a decision, when we choose to act, are we going to lose interpretability when we start to design mortal computation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3892.133,
    "end": 3896.076,
    "text": "Or is there a way that we can keep interpretability?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3896.116,
    "end": 3897.637,
    "text": "I mean, I guess we do all the programming.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3897.677,
    "end": 3897.817,
    "text": "So",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3898.537,
    "end": 3902.759,
    "text": " Is it going to end up being more black box?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3902.779,
    "end": 3904.619,
    "text": "I mean, a human is way like, I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3905.299,
    "end": 3906.5,
    "text": "I just compute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3906.9,
    "end": 3907.9,
    "text": "I don't know what's going on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3907.92,
    "end": 3910.701,
    "text": "I mean, I can try to check in and like, where is this coming from?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3910.741,
    "end": 3912.842,
    "text": "Is this my logical brain or is this from my heart?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3912.902,
    "end": 3918.744,
    "text": "Or is it just like a motor kinesthetic memory or that's driving me to act?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3919.184,
    "end": 3924.326,
    "text": " in a certain way, like I can try to dissect it, but even it's hard to know my own like computational process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3924.366,
    "end": 3931.208,
    "text": "So when we're looking at like designing an artificial system, are we gonna lose that interpretability in the design?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3931.248,
    "end": 3932.108,
    "text": "Is that like built in?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3934.168,
    "end": 3939.29,
    "text": "Well, fascinating point or fascinating premise",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3941.553,
    "end": 3952.084,
    "text": " I think it depends, not to bust out the famous it depends answer, and any of my students listening will be like, well, there he goes under the shield of it depends.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3952.344,
    "end": 3958.09,
    "text": "But it really does, and I think it depends on what interpretability you're looking for.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3958.811,
    "end": 3964.437,
    "text": "And I'm also going to mix, and it is different to some degree, explainability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3965.277,
    "end": 3975.167,
    "text": " And I'm going to bring in that word here because there's those that work in, like, interpretable AI versus explainable AI, and they can get pretty mad if you, like, say, oh, it's the same thing, and it's not quite.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3976.769,
    "end": 3980.412,
    "text": "So in designing, let's say, a mortal computer, let's even say, like, a con...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3984.056,
    "end": 3988.818,
    "text": " The beginnings, because by the way, we are encouraging everyone to contribute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3989.338,
    "end": 3996.56,
    "text": "We have sort of like a low level or what we call a homeohedic or homeostatic mortal computer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3997.0,
    "end": 4006.444,
    "text": "And then things that have other processes are allostatic and things that are at the top level, the complex computer would be autopedic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4006.984,
    "end": 4008.804,
    "text": "And that would be like the ideal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4008.884,
    "end": 4011.125,
    "text": "That would be like, oh, well, there we have a human, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4011.145,
    "end": 4011.965,
    "text": "We have an animal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4011.985,
    "end": 4013.746,
    "text": "We have at least a sentient organ organ.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4014.591,
    "end": 4020.274,
    "text": " Um, yeah, if you're looking for Daniel, it's like after it's in section five, uh, under the definition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4020.374,
    "end": 4024.135,
    "text": "But if you wanted to see that little, it's like, it's sort of a taxonomy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4024.155,
    "end": 4027.897,
    "text": "Uh, and then we use it to evaluate modern day mortal computers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4027.937,
    "end": 4028.297,
    "text": "No scroll.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4028.377,
    "end": 4029.097,
    "text": "It's not a picture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4029.117,
    "end": 4029.478,
    "text": "No, no, no.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4029.518,
    "end": 4032.259,
    "text": "It's a, under the definition, it's, it's a bullet point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4032.319,
    "end": 4032.779,
    "text": "Scroll down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4032.819,
    "end": 4033.439,
    "text": "You were close.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4033.639,
    "end": 4034.12,
    "text": "It's weird.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4034.62,
    "end": 4034.9,
    "text": "All right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4035.04,
    "end": 4035.28,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4035.68,
    "end": 4036.08,
    "text": "Go down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4036.14,
    "end": 4037.141,
    "text": "That's the definition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4037.281,
    "end": 4039.722,
    "text": "And then you scroll down right there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4040.322,
    "end": 4041.743,
    "text": "So there, yeah, we, you had it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4041.783,
    "end": 4042.523,
    "text": "You had it right there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4043.063,
    "end": 4043.904,
    "text": "Uh, scroll up a little more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4044.721,
    "end": 4045.342,
    "text": " No, a little more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4047.324,
    "end": 4048.005,
    "text": "Scroll a little more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4049.027,
    "end": 4052.07,
    "text": "Homeostatic, allostatic, autopedic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4052.451,
    "end": 4057.818,
    "text": "So we sort of give a little bit of a characterization of like mortal computers of varying complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4059.017,
    "end": 4062.341,
    "text": " So I'm referring to this just in answering Blue's question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4062.681,
    "end": 4069.149,
    "text": "If I designed the ideal MC, Mortal Computer, Autopedic, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4069.169,
    "end": 4070.991,
    "text": "So it has all the ingredients we want.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4071.552,
    "end": 4073.294,
    "text": "And you're saying, is it interpretable?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4073.314,
    "end": 4075.376,
    "text": "Do we lose some interpreting?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4076.097,
    "end": 4078.56,
    "text": "I would argue not completely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4082.411,
    "end": 4094.497,
    "text": " The parts of interpretability you preserve, and I think it's even better in some ways than your run-of-the-mill transformers and large neural models that are in operation today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4095.769,
    "end": 4116.923,
    "text": " is when, for example, ChatGPT or GPT-5 or Stable Diffusion does something really interesting, like, oh, it can do this downstream task that I never expected to do, like zero-shot learning, which arguably is very interesting and promising that these models can do some elements of this type of adaptation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4118.577,
    "end": 4120.358,
    "text": " We can't answer why that happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4120.418,
    "end": 4127.822,
    "text": "The best answer we have is, well, it's because we keep throwing more and more parameters at these models, more neurons, more synapses that connect them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4128.322,
    "end": 4137.607,
    "text": "And so if I toss more Legos at this, it'll just, through emergence, create complex behavior, and we get these nice little properties.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4138.317,
    "end": 4158.833,
    "text": " And it's interesting because that does relate to complex system, complex adaptive systems theory, like John Holland's work in the 90s and the Santa Fe Institute and other other people that have worked on dynamical systems and complexity theory and how you get complex structures that emerge from these very simple structures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4158.913,
    "end": 4161.916,
    "text": "And self-organization was actually on Daniel's work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4162.597,
    "end": 4166.061,
    "text": " Hierarchy was like a one piece of an organizing principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4166.702,
    "end": 4172.008,
    "text": "So that part is like the part where it might be hard to completely interpret.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4173.05,
    "end": 4175.433,
    "text": "Why does this behavior emerge?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4175.473,
    "end": 4179.498,
    "text": "Because it is this complex, multi-level interaction of parts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4180.198,
    "end": 4198.85,
    "text": " and you could at least say it comes from like and we do talk about it too in the paper uh because we do talk about self-organization you can't without if you're gonna talk about any living system you have to go into self-organization uh upward causation and downward causation so upward causation is like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4199.25,
    "end": 4206.215,
    "text": " The little parts give rise to complex emergent parts and then their relationships to each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4206.595,
    "end": 4221.045,
    "text": "And then the top-down causation is you have these higher-level parts that have now laws and physical relationships and implicit relationships with each other that exert a modulatory effect on the lower-level parts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4221.385,
    "end": 4228.55,
    "text": "And so that's why you have top-down, bottom-up arrows of causation and interaction and constraint.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4229.39,
    "end": 4231.972,
    "text": " Sort of give rise to a complex system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4233.032,
    "end": 4239.616,
    "text": "And so you can point to those pieces and say, well, that's the reason why certain behaviors probably emerged.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4240.277,
    "end": 4251.103,
    "text": "But then you get into nonlinear systems and it's very, very hard to even mathematically analyze them, let alone come up with intuitive, qualitative pictures of what's going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4251.423,
    "end": 4273.543,
    "text": " But the part that you also get in designing a mortal computer and like the cog engine architecture that Daniel has here on the slide is you get interpretability in terms, at least the structure and some roles, especially if we're talking about like the internal states, like the reason I like the common model of cognition and there's other, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4273.905,
    "end": 4275.466,
    "text": " theories and blueprints out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4275.506,
    "end": 4277.007,
    "text": "It's not to say it's the only one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4278.028,
    "end": 4288.134,
    "text": "But the reason I really like it is it sort of cuts up or cleaves the mind up into these general blobs of responsibilities and has some relationships.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4288.174,
    "end": 4293.618,
    "text": "It doesn't commit you to any implementation as we talked about at the podcast point one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4294.605,
    "end": 4299.693,
    "text": " But it sort of tells you like, oh, procedural memory, it's going to be doing this very specific thing, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4299.733,
    "end": 4307.826,
    "text": "It's going to learn how to memorize sequences of actions, kind of like a reactive, physiological, physical reactive components.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4308.266,
    "end": 4309.869,
    "text": "And, you know, the way I interpret it was",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4310.109,
    "end": 4318.172,
    "text": " the transition dynamics model of active inference, or let me build a predictive coding little structure that tries to guess latent states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4318.512,
    "end": 4327.036,
    "text": "But then you have like declarative memory and it stores the facts of the world, things that, you know, I bind the name of a person to their face.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4327.116,
    "end": 4332.198,
    "text": "And, you know, I'm storing these little bits of knowledge into my representations and declarative memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4332.618,
    "end": 4337.38,
    "text": "So you get the interpretability, at least at the level of, I know what these modules are doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4337.52,
    "end": 4339.401,
    "text": "I probably could investigate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4339.801,
    "end": 4361.773,
    "text": " and probe in even a computational fashion the contents of memory cognitive architectures in general so that's the part that i like they bring at least a level of interpretability because you have this organizational principles you have responsibilities for different modules and even classical cognitive architectures have things like production systems and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4362.543,
    "end": 4364.624,
    "text": " You can encode knowledge into them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4365.684,
    "end": 4375.928,
    "text": "There's good work on if-then statements, and you can break up knowledge into at least bits and pieces of logic, and we can very easily inspect that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4376.788,
    "end": 4385.911,
    "text": "While that might not be computational in the most efficient way, we could probably do mappings between the neural representations since they're essentially mimicking",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4386.591,
    "end": 4402.049,
    "text": " what like act are and soar and very classic prominent cognitive architectures are trying to do to these production systems there's been good work even from Yashua's group uh he had a paper uh neural production systems which I kind of like that idea",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4402.549,
    "end": 4407.934,
    "text": " about how do we emulate that piece of cognitive architectures with just neural networks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4409.114,
    "end": 4418.182,
    "text": "And so we can take advantage of that mapping and we could probably get some decoding going on and interpret some pieces of our architecture",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4418.722,
    "end": 4438.417,
    "text": " agent system mortal computer and also by the way the very design of the moral computer you actually would have a clear picture of like well these are the essential variables or the metabolic pathways here are the homeostatic processes these are the things I defined that define the life of this system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4438.997,
    "end": 4441.118,
    "text": " Or otherwise it will die, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4441.498,
    "end": 4443.959,
    "text": "And then the allostatic processes live above that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4443.979,
    "end": 4454.502,
    "text": "And so that's what that, like, cool picture that I really like in the middle of the paper, the biophysics, shows you, like, the hierarchy of different types of processing that would happen from biology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4454.562,
    "end": 4459.223,
    "text": "And then the cybernetics tells you what is it going to do from, like, an analysis point of view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4459.403,
    "end": 4463.525,
    "text": "It's, you know, trying to, you know, find stable states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4463.685,
    "end": 4465.085,
    "text": "It wants to be ultra stable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4465.538,
    "end": 4469.64,
    "text": " to use Ashby's and the cyberneticist's old terms, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4469.66,
    "end": 4485.448,
    "text": "And that's, you know, I'm able to very quickly satisfy my constraints so I can keep living and not, you know, die and essentially preserve or have enough internal variety to counterbalance my external variety.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4485.468,
    "end": 4490.451,
    "text": "And that's the cybernetician's kind of framing of what's going on in society.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4490.971,
    "end": 4518.059,
    "text": " and organizing systems and so you get that interpretability in terms of the design you know the parts the mechanisms behind it but you will lose the piece of like why did that behavior specifically come about it's going to be a non-linear process so you will lose it and i don't think you can get all of that back here's the last point i said at the very beginning explainability",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4518.621,
    "end": 4525.107,
    "text": " Now, this is different than interpretability, and it's going to be my digested version of explainability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4526.007,
    "end": 4535.316,
    "text": "So, Blue, you were saying to me earlier, I might be able to inspect the contents of my mind and come up with a reasoning for why I did something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4536.036,
    "end": 4540.898,
    "text": " And then you mentioned that, well, it could be wrong or, you know, I might not completely capture it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4540.958,
    "end": 4543.698,
    "text": "And I agree because we do this in all the fields, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4543.738,
    "end": 4545.659,
    "text": "Like especially anything about the mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4545.999,
    "end": 4557.483,
    "text": "I try to think about the contents of why I did something or what was going on in my brain or break down my process and then try to turn that in a computational model that then explains like the actual entity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4557.803,
    "end": 4558.943,
    "text": "And it might be wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4559.003,
    "end": 4559.923,
    "text": "It might be biased.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4560.364,
    "end": 4563.084,
    "text": "However, there's something cool about doing that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4563.544,
    "end": 4565.065,
    "text": "That's the explainable part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4565.56,
    "end": 4579.748,
    "text": " you blue might not know the true reason, the real reason of the universe, or the biological reasoning, or the thermodynamic cognitive reasoning of why you did something specifically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4580.168,
    "end": 4585.211,
    "text": "However, you can provide an explanation or a rationalization of why you did it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4585.331,
    "end": 4594.637,
    "text": "And while it might not be perfect, and we shouldn't take the account as wholesale the exact truth, you are able to communicate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4595.769,
    "end": 4612.788,
    "text": " basis of your decision so you are able to use your construct your biology your neural processing to formulate and then of course we also have this thing called communication you use the other parts of your body to transmit those sound waves to me and daniel",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4613.368,
    "end": 4637.196,
    "text": " across a tool zoom um and we hear what you're saying and you say oh i when i wanted to solve this problem i did x y and z and what we would find is then if we did x y and z maybe that's not exactly the true explanation why you did it but i would be able to solve the problem now and we teach right we pass on this knowledge and so the explainable part might arise",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4637.896,
    "end": 4641.197,
    "text": " I think that might counterbalance the lack of interpretability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4641.577,
    "end": 4652.041,
    "text": "So while we might not be able to say exactly 100%, I still argue we have more interpretability than monolith structures like transformers today, where we just say, eh, it emerged.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4653.315,
    "end": 4654.296,
    "text": " And that's cool, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4654.336,
    "end": 4656.417,
    "text": "I mean, there is probably analysis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4656.617,
    "end": 4659.219,
    "text": "I don't want to completely dismiss Transformers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4659.239,
    "end": 4663.221,
    "text": "There probably is interesting work on maybe identifying what parts of the network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4663.501,
    "end": 4672.907,
    "text": "But from the design principles or the inductive bias that evolution gave us, I think a cognitive architecture gives you some interpretability in a structural way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4673.407,
    "end": 4677.83,
    "text": "But then you're going to get a mortal computer that would probably be able to explain to you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4678.591,
    "end": 4679.412,
    "text": " Why did it do this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4679.453,
    "end": 4680.014,
    "text": "Because why?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4680.034,
    "end": 4683.342,
    "text": "The 5e cognition theory that Carl and I have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4684.375,
    "end": 4713.254,
    "text": " doesn't it absorbs or expands for e-cognitive theory which includes embedded and the embedded cognition is really important because that's part of that like other diagram i had where i had the slices of a pie of cognition in a mortal computer and among there it's saying i have to interact with other well i had other neural robots but i'm talking to you blue and that means that i have to be able to communicate some approximation of why i did something",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4714.515,
    "end": 4721.003,
    "text": " There is an explainable, you know, there's explainability and I communicate this reasoning to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4721.383,
    "end": 4729.172,
    "text": "You give me feedback and, you know, we kind of come up with a solution to the problem or a better understanding of something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4729.493,
    "end": 4732.917,
    "text": "And I think that's where the mortal computer in its full glory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4733.417,
    "end": 4734.638,
    "text": " Would give you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4734.698,
    "end": 4736.859,
    "text": "Because it would be able to tell you why.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4736.879,
    "end": 4738.22,
    "text": "It would interact with you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4738.3,
    "end": 4740.022,
    "text": "Because it also needs to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4740.522,
    "end": 4741.903,
    "text": "Because you're part of its niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4742.403,
    "end": 4743.904,
    "text": "You affect its survival.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4744.264,
    "end": 4745.986,
    "text": "So it can't sort of like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4747.126,
    "end": 4747.446,
    "text": "Oh okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4747.466,
    "end": 4748.567,
    "text": "I'm just going to ignore you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4748.607,
    "end": 4750.368,
    "text": "Because actually it might be really important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4750.388,
    "end": 4753.19,
    "text": "It might be important for it to achieve its goals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4753.23,
    "end": 4755.532,
    "text": "Which could be to allow it to get more power.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4755.572,
    "end": 4757.313,
    "text": "If we go back to the primal connection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4757.333,
    "end": 4759.274,
    "text": "There's a lot of jumping around going on here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4759.715,
    "end": 4761.776,
    "text": "But you are an essential part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4762.056,
    "end": 4763.157,
    "text": "We humans.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4763.557,
    "end": 4767.682,
    "text": " All of us are an essential part of what a true mortal computer would be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4768.002,
    "end": 4771.025,
    "text": "This is what makes it artificially sentient, too, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4771.366,
    "end": 4775.73,
    "text": "It has to live in its niche, and the niche, you know, can get very complex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4775.79,
    "end": 4782.678,
    "text": "It's not going to be a laboratory that I put it in a little white-walled room and, you know, oh, okay, I've emulated life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4782.798,
    "end": 4783.659,
    "text": "No, ultimately...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4784.019,
    "end": 4797.463,
    "text": " You would want this to integrate with human society and to interact with us because there's things that you get with a group, with a collective, with social norms that you don't get living in pure isolation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4797.563,
    "end": 4799.764,
    "text": "And so you're going to get that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4800.124,
    "end": 4803.005,
    "text": "It's not interpretability, but it's explainability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4803.125,
    "end": 4810.567,
    "text": "And I think that that communication and that part might counterbalance the fact that we're dealing with, as you rightly point out, Blue,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4811.167,
    "end": 4840.024,
    "text": " an extremely non-linear complex system that it's gonna be very hard to say exactly why did it do what it did based on inspection of its contents even if we designed it so the explainable part i think will counterbalance that to some degree wow sounds like psychotherapy psychotherapy for the mortal computer there you go yes we need it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4843.695,
    "end": 4846.081,
    "text": " There's so many pieces to add in.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4847.525,
    "end": 4848.689,
    "text": "I barely know where to go.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4851.383,
    "end": 4874.787,
    "text": " yeah it's a it's a lot you brought out i think the connection to complexity science is very good because that's where we can ask and have a laboratory for like well what's the account you can give of this double pendulum what's the account you can give of wolfram's rule 30. what's in and by that we can contextualize yeah how many experiments of what type would we expect to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4875.287,
    "end": 4899.764,
    "text": " before we could understand a fruit flies decision in a tea maze what about a human in this or that and then this tension but fundamental so we can quickly come to adapt to it that there's things we do and don't know about it's one of the quotes beginning a chapter in the 2022 textbook i think it's like a minsky quote we're aware of least what our brains do best",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4900.885,
    "end": 4921.255,
    "text": " and so that whole like searching under the street light with the light of attention that every agent is only engaged in as a fundamental constraint that's one constraint is the attentional informational another constraint is the material physical niche which is always actual",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4922.563,
    "end": 4944.508,
    "text": " and that's that's um connected to the environment totally fundamentally like there can't be a discussion of what ant colony foraging strategy works best even for one field location there's going to be different ant species with different total strategies and different nest mates with sub strategies as modeled by so",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4947.759,
    "end": 4973.56,
    "text": " embarked on a wildly fundamental task that combines a lot of the discussions happening in active inference with the broader cognitive sciences broader complex systems and it's definitely interesting and relevant so i really appreciate that you share it this way i'm happy you guys uh",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4974.281,
    "end": 4975.563,
    "text": " took to it so well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4975.923,
    "end": 4978.947,
    "text": "And I certainly want that idea out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4979.007,
    "end": 4982.431,
    "text": "So now, now that there's a, what do you call it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4982.891,
    "end": 4987.517,
    "text": "A proper treatment, an initial treatment of moral computations,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4988.677,
    "end": 4989.717,
    "text": " please spread the word.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4989.957,
    "end": 5003.623,
    "text": "You know, I want, I want to hear other people come back to me like, Oh yeah, I heard about mortal computer and I'd love to see you guys and everyone else try to take a whack at designing even the most primitive versions of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5003.663,
    "end": 5012.166,
    "text": "Cause I think this is like, I don't know if it's quite that, but it almost feels like, uh, like a little baby step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5012.506,
    "end": 5014.827,
    "text": "Cause if this paper is, uh, is, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5015.723,
    "end": 5036.296,
    "text": " intensive as it has been uh and informative and so fun working with carl on it um it is just a step in a big direction as you just said daniel and it's a wild wild place and it also goes at odds with a lot of like maybe this group here you know we're a lot more what do you say receptive",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5037.307,
    "end": 5039.008,
    "text": " and excited by these prospects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5039.429,
    "end": 5047.734,
    "text": "But it does go even to challenge a lot of what we hold dear and near and dear to ourselves, which is that we really do like our immortal computers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5048.075,
    "end": 5051.257,
    "text": "And, you know, there's going to be trade-offs to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5051.317,
    "end": 5052.698,
    "text": "And the paper does talk about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5052.758,
    "end": 5057.822,
    "text": "It even starts by trying to address the reader by saying, the reader might ask...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5058.642,
    "end": 5079.205,
    "text": " you know themselves you know why do I really want this because it's also very brittle I'm gonna just be clear too but then again humans and animals and organisms are also brittle as well um but why do I want this right and you know and then we had and we motivate this with like uh three kind of stabs which is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5079.525,
    "end": 5081.546,
    "text": " thermodynamic, which is the most important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5081.566,
    "end": 5088.929,
    "text": "By the way, the free energy principle in physicists in the room might say, well, wait a minute, free energy, that's thermodynamic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5089.029,
    "end": 5090.389,
    "text": "This is not quite the same thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5090.409,
    "end": 5093.83,
    "text": "There's the mixture of information theory in here as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5093.89,
    "end": 5099.132,
    "text": "But, you know, the thermodynamic free energy is a really important piece to this puzzle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5099.713,
    "end": 5103.774,
    "text": "And the way that computers are organized is sort of what this challenge is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5103.894,
    "end": 5108.576,
    "text": "And, you know, it also, we have tools to attack this, like neuromorphic chips.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5109.631,
    "end": 5137.351,
    "text": " wonderful wonderful platform uh for uh you know a mortal computer uh and we do talk about it in the supplement it got moved to the supplement because again i was already a little bit too long um so i talk about uh neuromorphic architectures and the also neuromimetic algorithms which kind of connect to the papers too like predictive coding it isn't like front and center i don't we don't try to like throw it in your face uh even though it is a uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5137.892,
    "end": 5141.963,
    "text": " one way of thinking, a consequence of free energy minimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5143.568,
    "end": 5145.173,
    "text": "And so we talk about these things, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5146.275,
    "end": 5175.216,
    "text": " I think it also challenges and gets us to think about existentialism and philosophy of life and death because there was even citations to Heidegger and Soren and all kinds of wonderful thinkers too that have just thought about philosophy of mind and how our identities and our thought processes are just naturally influenced by the fact that we know that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5175.976,
    "end": 5199.886,
    "text": " you know things are going to possibly end um and wonderful thinkers and there's also been this concept of like and again and this is a little heideggerian but uh you know your your being there's this famous book being in time and you think about well you know at the end of time you you have to understand when you live you're projecting your being to there and then going backwards and so there's a quote that kind of starts the paper from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5200.306,
    "end": 5218.649,
    "text": " sarin kikegaard about uh you know we we look at life backwards but we must live it forwards and there's that interaction with knowing that this this rodeo is this play is not going to last forever um which is a motivator for why we do a lot of things including teaching and passing on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5219.39,
    "end": 5220.431,
    "text": " to the next generation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5220.831,
    "end": 5222.853,
    "text": "And the other part was, again, cognitive science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5222.893,
    "end": 5228.036,
    "text": "I think cognitive science got a little bit of a spotlight because it needed to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5228.156,
    "end": 5243.026,
    "text": "I think the embodiment thesis, inactive cognition, and then Kirchhoff's and his collaborators' life-mind continuity thesis needed to sort of be foregrounded a little bit because I think that's another piece of this puzzle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5243.666,
    "end": 5248.73,
    "text": "And it kind of ties everything together about how to think about minds and brains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5249.711,
    "end": 5252.295,
    "text": " But it all challenges what things we're very used to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5252.315,
    "end": 5255.62,
    "text": "We're very used to when we design, especially artificial intelligence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5256.662,
    "end": 5258.925,
    "text": "Okay, I trust this hardware is good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5258.945,
    "end": 5264.514,
    "text": "I'm going to try to build some software and I believe that I can design all my processes properly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5264.874,
    "end": 5283.528,
    "text": " uh from you know from scratch without even accounting for maybe what you know evolution might have given us uh we are seeing some of that especially bayesian uh framings have some of that in there right the idea of a prior uh i think is important but a lot of modern day neural systems don't",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5284.228,
    "end": 5305.395,
    "text": " 100% I think foreground that and play how important these priors are to sort of like driving your behavior and so that's what's going to be interesting is that this is truly a weird place to be and it also really says you gotta have a body you gotta have an environment so you're not done if you say I have this wonderful algorithm that I think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5305.835,
    "end": 5312.024,
    "text": " emulate some piece of intelligence, that's wonderful, but that's not going to be the end of the story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5312.044,
    "end": 5313.906,
    "text": "In fact, you're far from the end of the story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5313.926,
    "end": 5321.556,
    "text": "You need to be integrating that into a brittle body where that process that you've designed is also going to be shaped now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5322.057,
    "end": 5349.476,
    "text": " by the substrate right and its interactions its thermodynamic exchange with the environment the environment itself is going to change how it works and so you sort of get this malleable flexible kind of framing of ai as well that intelligence is you just no longer can divorce it from the mechanics of interaction with interacting with the world you cannot divorce it from the thermodynamic exchange that's how we're going to get energy efficient ai",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5349.736,
    "end": 5354.097,
    "text": " I think that's like the other main message, but it's challenging, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5354.157,
    "end": 5359.178,
    "text": "And others will say, well, I have quantum computing and it is very promising.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5359.258,
    "end": 5360.918,
    "text": "It's not any dismissal of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5361.438,
    "end": 5364.919,
    "text": "I'm just going to do the same AI I've always done, but faster.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5365.479,
    "end": 5369.54,
    "text": "And do I really need to look at, you know, how life emerges?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5369.84,
    "end": 5372.701,
    "text": "Do I really need to look at how neurons really do things?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5374.161,
    "end": 5375.761,
    "text": "You know, it'll be interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5375.781,
    "end": 5378.702,
    "text": "If nothing else, it might be a little bit of a race going forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5378.742,
    "end": 5379.182,
    "text": "Maybe it'll be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5379.782,
    "end": 5404.512,
    "text": " the mortal computing still you know on its pedestal being the dominant paradigm in mortal computing being rather niche for a while i mean it's kind of same thing with the free energy principle and active inference i like to think of the mortal computation as you know another con a big expansion of free energy and active injury because you know active inference is a corollary of the free energy principle",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5405.092,
    "end": 5430.541,
    "text": " and at its mortal computer's heart is the free energy principle right it talks about the non-equilibrium steady state the mass and that's kind of like at the core and we cast there's the other part of the paper there's a lot of parts of the paper about inference learning and structure and you cannot ignore any of those pieces if you're going to build a proper and that's actually part of our definition there's an entanglement there",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5431.485,
    "end": 5439.015,
    "text": " That's a whole other conversation, but it's like an expansion of the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5439.095,
    "end": 5442.219,
    "text": "It says, where does this go next?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5442.58,
    "end": 5446.585,
    "text": "And it's really like how free energy often is used in the literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5447.526,
    "end": 5457.452,
    "text": " to explain other phenomenon in like, for example, Carl and many others try to use that to do things in neuroscience and neurophysiology and computational psychiatry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5457.832,
    "end": 5468.838,
    "text": "This is what would happen if you take the free energy principle and you merge it with hardware considerations and morphology and place it in the world of AI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5470.158,
    "end": 5480.662,
    "text": " If our goal is for in silico artificial sentience, not sentience, artificial sentience in our artifacts, well, this is where it's natural consequence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5480.882,
    "end": 5487.685,
    "text": "I like to think of it as an extension in placing a pathway if you come from that line of thinking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5487.885,
    "end": 5490.186,
    "text": "All of you guys, the Active Inference Institute, it's like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5490.786,
    "end": 5517.619,
    "text": " perfect candidates right because you're you're studying deeply the free energy principle um dying mortal computation is just like the next step right it's like okay well that's another piece to this puzzle it's where you go if you want to build technological artifacts with what we would consider sentience if that makes sense blue wanna add anything",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5520.151,
    "end": 5540.547,
    "text": " sure um i mean i i have millions of questions but um nothing pressing but this one i think maybe goes back to um you talking about cognitive diversity and then daniel mentioning like shining the light of attention um and just as we're as we're thinking about um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5542.532,
    "end": 5560.322,
    "text": " like attention as as maybe like the foundation for cognitive diversity because like while we are all fundamentally have the same programming the same like voluntary and involuntary consciousness right i guess we'll say it like that like my heartbeat and kind of the my self-sustaining system um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5561.923,
    "end": 5589.989,
    "text": " we can kind of make that conscious like i've mentioned the breathing but also like just through like motor control like you can activate motor circuits like we all have different like some people can spread their toes out and some people cannot like if you've never tried to do that like it's hard and you have to like practice practice practice but then like through constantly paying attention to those like neural connections neuromuscular connections you you gain like a different perspective",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5590.809,
    "end": 5616.608,
    "text": " um than others and so just um in terms of cognitive diversity for humans it's gonna look really different like within like intra-species and inter-species diversity um is gonna be crazy right like you know a tardigrade doesn't even have a toe to spread maybe they do i don't know um i don't think they have toes but but um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5618.094,
    "end": 5631.703,
    "text": " Just across the different species, maybe we, this is the time to kind of look a little closer at like procedural memory, long-term memory, like at what, like what is long-term memory, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5631.743,
    "end": 5632.143,
    "text": "Like if...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5634.378,
    "end": 5656.677,
    "text": " you know when you're looking at something like an insect that doesn't really have a brain definitely doesn't have like a hippocampus to store the long-term memory do you get um long-term memory does it go into the generative model like or where does it go like i mean you think about they just have like the working buffer memory or if you were to try to design one of these cognitive kernels for a non-human",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5657.638,
    "end": 5672.397,
    "text": " um like maybe you don't have to go to a plant but like where would you start to kind of add or subtract things like long-term memory because we know that that's really different just even in the animal kingdom well i",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5674.773,
    "end": 5677.355,
    "text": " First of all, I agreed with most of what you were saying at the beginning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5677.415,
    "end": 5680.277,
    "text": "That just resonated with cognitive diversity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5680.297,
    "end": 5688.864,
    "text": "Talking about how would I design or begin to think about something like a fruit fly as opposed to a human,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5691.112,
    "end": 5694.536,
    "text": " again, the mortal computation definition and, like, the general framing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5694.576,
    "end": 5702.225,
    "text": "And let's just, again, for the audience members that might join in and say, wait, what are they talking about that's not in any of the four papers we're mentioning?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5702.465,
    "end": 5706.85,
    "text": "Let's just think of the mortal computation thesis as subsuming all of these, because I think of all those...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5707.51,
    "end": 5714.856,
    "text": " Just as a quick point to all of that work, I think, is in service of this, even though this was written far more recently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5715.356,
    "end": 5719.739,
    "text": "And I know, Blue, you were going to ask at one time, what was the history of the ordering of these papers?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5719.839,
    "end": 5723.542,
    "text": "But obviously, they're not in a strict sequence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5725.143,
    "end": 5747.051,
    "text": " so it's like mortal computation is like one way to do a synthesis of all these ideas um now to build like something like a fruit fly mortal computation just says you need at least at its heart a generative mod right everything's a generative model but the form of that generative model is not con you know it's not specified um because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5747.711,
    "end": 5761.137,
    "text": " there's the the principles like for example in that paper brings up the cybernetic ideas of like the good regulator theorem i'm sure you guys have encountered this too because you kind of are all especially in any discussion with those with free energy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5762.031,
    "end": 5764.012,
    "text": " They always borrow from cybernetics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5764.052,
    "end": 5764.793,
    "text": "It's impossible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5764.973,
    "end": 5769.756,
    "text": "So law of requisite variety and the good regulator theorem are kind of like the most well-known.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5770.056,
    "end": 5773.258,
    "text": "That paper talks about a lot of other ones that I don't think get enough attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5773.638,
    "end": 5776.58,
    "text": "So all the axioms of cybernetics are kind of in that paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5777.041,
    "end": 5784.605,
    "text": "But the good regulator theorem and the principle of model internal control, which is not as popular as good regulator, but...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5785.606,
    "end": 5814.949,
    "text": " you sort of need those at the formation of any of these entities and so as long as you're able to design the body of that fly and you are i'm assuming you're going to study the object in reality right so you're going to study the actual fruit fly and hopefully extract principles because again this is biomimetic so the title of the paper says we are mimicking or performing mimicry of biology",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5815.329,
    "end": 5819.891,
    "text": " or the things that we perceive in our real world, the physiological organisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5820.951,
    "end": 5835.237,
    "text": "And so if you're able to study the fruit fly, I would imagine you're constructing a body that's very similar to it, tries to adhere to as many of its physics and physical principles that govern how it moves and interacts and its exchange with materials.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5835.257,
    "end": 5836.558,
    "text": "If you have all that part,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5837.398,
    "end": 5839.58,
    "text": " I think you're almost there, believe it or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5839.6,
    "end": 5851.55,
    "text": "That's the kind of the fun part of the mortal computer is designing that Markov blanket and implicitly explicitly, however you want to go about it and placing in a niche gets you really close.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5851.57,
    "end": 5860.378,
    "text": "Cause again, embodiment offloads a lot of that cognition because that fruit fly does a lot of what he does based on reactions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5860.738,
    "end": 5862.439,
    "text": "And, uh, it's, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5863.34,
    "end": 5884.786,
    "text": " interactions with its niche and that is where in like the 5e cognitive theory of the paper uh the bottom the most let's say you need this because you it influences everything else is called what carl and i did introduce is the it's a rewrapping of basal cognition you need elementary cognition",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5885.166,
    "end": 5888.127,
    "text": " Which you could just, if you want to call it basal cognition, that's also fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5888.147,
    "end": 5892.968,
    "text": "We cite the heck out of that in Michael Evans' group and many other biologists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5893.948,
    "end": 5895.608,
    "text": "So you would be implementing that level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5896.108,
    "end": 5902.41,
    "text": "So you'd say, if I'm going to build the fruit fly, I'm not going to be building, you know, embodied.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5902.63,
    "end": 5907.311,
    "text": "Well, you're going to get embodied cognition from that, but you're not going to be building these complex processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5907.331,
    "end": 5909.391,
    "text": "You're going to focus on that slice, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5909.571,
    "end": 5911.253,
    "text": " And that's what's kind of nice about five ethers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5911.273,
    "end": 5914.617,
    "text": "You can slice it up and say, I'm going to design at this level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5915.818,
    "end": 5918.922,
    "text": "Obviously, the bottom level affects the upper level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5918.962,
    "end": 5920.865,
    "text": "So you sort of do have to account for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5921.345,
    "end": 5928.494,
    "text": "And so you would be saying, well, what are the basal cognitive functions that define something like a fruit fly?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5928.974,
    "end": 5955.847,
    "text": " what does it do what would evolution have given it because if you're not going to simulate evolution which would give you those things if you know properly done and with enough compute uh you're going to design those inductive biases you're going to hopefully study the fruit fly and then its internal cognitive model will not be the common model of cognition because the common model of cognition is sort of like okay that was the product of the human evolutionary track",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5956.267,
    "end": 5979.057,
    "text": " right and that's what evolution gave us is like our organizing principle of the brain um but other animals don't necessarily have that to the same degree and creatures as you get smaller and smaller and simple let's say different on the spectrum especially as you move towards things that are a little bit simpler like single-celled organisms they're going to have a lot less of that functionality but still under the hood is that generative model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5979.457,
    "end": 5990.02,
    "text": " It just might not be a generative models and like, oh, I have a neural circuit that's trying to predict the next state of the environment, like a fantasy or a dream sequence that I unroll out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5990.04,
    "end": 5996.321,
    "text": "Like we humans can sort of like, oh, let me think about what's going to happen if I close my eyes and I knock over the computer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5996.361,
    "end": 5998.702,
    "text": "We can use our internal physics simulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5999.142,
    "end": 6002.064,
    "text": " to figure out what it's going to do and say, nah, I'm not going to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6002.084,
    "end": 6008.768,
    "text": "Whereas a flute fly might have some sense of physics, but it might not be like, oh, I'm rolling out over a long-term trajectory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6008.808,
    "end": 6018.454,
    "text": "So I'm not going to be building, for example, a procedural memory or an episodic memory quite like what I do in the common model of cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6018.934,
    "end": 6027.499,
    "text": "And I might only need very simple little neural circuits because, again, the number of neurons and, for example, like insects is really, really, really small.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6027.599,
    "end": 6028.78,
    "text": "And that's why we can study them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6029.355,
    "end": 6056.895,
    "text": " too that's also why people study that or even like it's not necessarily the same as a fruit flights is a lot simpler but still fascinating is c elegans right has been studied a lot because we can map out every single bit of its neural circuits and that in of itself is rather complex so i would argue that the fruit fly cognitive model will be simpler will and it will be dictated by what we decide are the elementary cognitive functions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6057.975,
    "end": 6061.177,
    "text": " that make its mortal computer, it a mortal computer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6061.717,
    "end": 6072.921,
    "text": "And we won't need these complex modules interacting in the way we do in, for example, a human model or let's say an animal model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6073.501,
    "end": 6076.843,
    "text": "I think that's, but again, that's grounded in something like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6077.699,
    "end": 6079.121,
    "text": " You understand you're mimicking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6079.481,
    "end": 6081.724,
    "text": "So you go with the route of biomimicry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6082.165,
    "end": 6090.757,
    "text": "You should probably be studying the fruit fly or at least understand what we understand about it and dissect that and bring back what are its base functions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6090.777,
    "end": 6092.118,
    "text": "And then how am I emulating that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6092.719,
    "end": 6103.863,
    "text": " And then, you know, you build your little cognitive internal states right inside the Markov blanket that maintain, for example, what are the essential variables that the fruit fly needs to maintain?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6103.903,
    "end": 6109.425,
    "text": "It's not going to be the same biochemical processes that dictate a human, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6109.465,
    "end": 6113.807,
    "text": "Like, for example, when we have blood, we're looking at like pH level and temperature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6114.147,
    "end": 6116.728,
    "text": "The fruit fly might be looking at a little bit different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6117.248,
    "end": 6118.409,
    "text": " essential variables, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6118.469,
    "end": 6121.69,
    "text": "Certain chemical concentrations matter to it more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6122.75,
    "end": 6123.691,
    "text": "You'd want to model that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6123.971,
    "end": 6137.636,
    "text": "And I think that that, by the way, when you talk about the basal cognition, in designing it, my thought on this is that you are approaching it from what are those life-sustaining variables that characterize that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6137.996,
    "end": 6138.777,
    "text": "Start from there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6139.377,
    "end": 6141.738,
    "text": "And then you say, okay, well, does that explain...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6142.478,
    "end": 6167.831,
    "text": " some of the things that i observe you know let's say again we're modeling at this point but you know what the fruit fly does like for example flying around why does it fly around well maybe it's because it needs to you know reach this particular nutrient and so it knows if i go to this region i am more likely to achieve it that might be an allostatic process right and you'd say oh okay there's something that i need uh and this could also be like a bottom-up design",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6168.451,
    "end": 6186.184,
    "text": " If you don't think that you need the inductive bias that's provided by the common model, you sort of build your little functions as needed, and now you build your little internal generative model, your good regulator, into the fruit fly based on the key functions it needs to satisfy so that it does not die.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6186.784,
    "end": 6212.428,
    "text": " right and ultimately the best way to probably do this is then you simulate evolution right and maybe you let some natural selection happen because if you don't want to design those processes then you'd want to simulate you know the origins of it and by the way mortal computation doesn't ignore evolution here it doesn't talk about designing it because you know that's a whole realm in of itself but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6213.297,
    "end": 6220.204,
    "text": " Even the life-mind continuity thesis from Kirchhoff's group, they talk about you need a selection history.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6220.605,
    "end": 6231.236,
    "text": "And I think the only way to get around the selection history is when you say, well, okay, if I'm not going to simulate the selection history and let these primitives emerge into the structures that make, for example, fruit fly work,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6231.736,
    "end": 6258.81,
    "text": " you need to figure out well what was those what was the product of our current non-selection history right what did evolution do to give the fruit fly as is so you got like two choices study the real thing and try to emulate some of those very basic principles like identifying its essential variables identifying allostatic processes that might service those essential variables and the homeostasis of them or the hormonohesis of them um or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6260.049,
    "end": 6265.652,
    "text": " talk about some very basic primitives and then say, I'm going to simulate a population of these.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6265.693,
    "end": 6280.442,
    "text": "And that might be more difficult because if you're dealing with the actual, like, let's say you have a little fruit fly robot, since we're talking about substrates, that might be not very cheap to do where it might be easier to do it in simulation and doing it with a digital morphology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6280.462,
    "end": 6281.883,
    "text": "And that's another can of worms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6282.243,
    "end": 6285.625,
    "text": "So I don't know if that kind of gives you something blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6286.937,
    "end": 6287.638,
    "text": " No, it definitely does.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6288.539,
    "end": 6292.423,
    "text": "And like, yeah, so sorry, my brain works faster than my tongue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6292.443,
    "end": 6295.766,
    "text": "Sometimes insects definitely have brains, just nothing like our brains.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6296.066,
    "end": 6298.229,
    "text": "They just definitely don't have brains like ours, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6298.249,
    "end": 6301.892,
    "text": "Like, so nothing that we can map analogously over.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6302.573,
    "end": 6306.978,
    "text": "Although some of the neurotransmitters and things still work, but just in a different form.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6307.378,
    "end": 6334.159,
    "text": " functional way to my to my knowledge um also andrew barron is building like a tremendous model of the honeybee brain that is just so super cool i think if you don't know his work it's really really neat send me a link to that i'd love to see that that sounds awesome yeah it's way cool um has him running around in mazes and doing all kinds of learning like how to tell van gogh apart from a monet i mean they're they're really doing some pretty pretty complex uh stuff and and that's why like it um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6335.202,
    "end": 6339.427,
    "text": " you know, it always makes me wonder, like, where does this stuff go?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6339.728,
    "end": 6342.11,
    "text": "Like, where is the memory there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6342.871,
    "end": 6352.603,
    "text": "And it just is such a fascinating process to me, how memories are created and stored and, like, how they map into the brain and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6353.504,
    "end": 6375.737,
    "text": " like sometimes i can pull something up right away and like sometimes it'll take me four days to remember someone's name like what was the name of and like i'll remember it i'll be just driving down the road it was whatever and like it's just like how many layers of circuitry did i have to like transgress to get from a to b you know um and like yeah how do different kinds of animals do that is always really fascinating to me",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6376.437,
    "end": 6405.573,
    "text": " i think a piece of that too is evolution also has a memory right and i think that selection history is what goes into things like for example the fruit fly right so there's its predecessors you know you know maybe they did certain other behaviors that were not conducive to their survival i think there's that too that implicit kind of memory and then that gets encoded uh in the morphology right and this is where it goes back to where i just said if you want it or like your your",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6406.073,
    "end": 6427.392,
    "text": " collaborator your friend that you mentioned about designing like the honeybees uh it's kind of the same principles you say well okay what did evolution give it let me design that you're just skipping the evolutionary phase i think there's some memory in the structure too so this is where the body now of course with your example about you retrieving it there's layers of intricacy there like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6428.038,
    "end": 6429.278,
    "text": " I'm not complaining about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6429.519,
    "end": 6434.5,
    "text": "But even like the fruit fly, why does it remember to do certain things or why does it seem to have certain patterns?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6435.04,
    "end": 6451.666,
    "text": "And that's also what the moral computation thesis does account for, or at least tries to, by saying that it is because that body changes and it's subject to a selection history because it's constantly in this eternal change of repair.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6452.188,
    "end": 6460.57,
    "text": " In maintenance, in the face of disintegration, because it's always the threat of disintegration, your identity will cease when you die.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6460.59,
    "end": 6469.312,
    "text": "And so because of that, things get encoded in that memory, and that's also this beautiful piece of the interplay of physics and cybernetics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6470.352,
    "end": 6477.074,
    "text": "This is without ever getting into the probably wonderful quantum interpretations I'm sure Chris Fields could enlighten us all about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6477.094,
    "end": 6477.154,
    "text": "But",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6478.934,
    "end": 6507.476,
    "text": " you know the idea that information or variety gets encoded into these interact through its interactions gets encoded into the morphology the very organization and structural manifestation of that organization because organization is not structure it is the relationships of the parts and it can exist independent of the manifestation and the manifestation is like oh okay here's the body that embodies those principles that also encodes that is a memory",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6507.967,
    "end": 6517.793,
    "text": " Because, for example, an organism that understands a particular chemical interaction might say, well, look, I need to filter out this toxin or I'm going to die.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6517.813,
    "end": 6519.715,
    "text": "And I need to pump in these nutrients.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6520.075,
    "end": 6520.835,
    "text": "That's a memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6521.596,
    "end": 6523.377,
    "text": "It's just not a retrievable memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6523.457,
    "end": 6525.338,
    "text": "It's just like an implicit memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6526.079,
    "end": 6530.301,
    "text": "But that's why, for example, it's able to conduct the actions that it does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6530.361,
    "end": 6537.326,
    "text": "And this is why moral computation really tries to, and this is where I think it's very forward thinking or very far ahead of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6537.806,
    "end": 6544.01,
    "text": " of what we can probably even do easily, which is it really says you do need to understand the body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6544.451,
    "end": 6546.292,
    "text": "The substrate is so important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6546.892,
    "end": 6557.12,
    "text": "And understanding how that will then affect the internal states and how you do this processing, that has to be at the front and center of your story, of whatever you build.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6557.7,
    "end": 6560.442,
    "text": "And then the niche, you can't escape the niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6561.843,
    "end": 6576.211,
    "text": " By having a body, you're like, well, okay, but the body only existed because it was in response to the environment and it has evolved or it has adapted because of the perturbations the environment has subjected it to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6578.892,
    "end": 6582.333,
    "text": " That's why I like the thesis so much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6582.653,
    "end": 6584.734,
    "text": "We need to flip our thinking a bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6584.834,
    "end": 6590.176,
    "text": "Not, okay, we're going to design the brain and someday in the future we'll have good bodies for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6590.536,
    "end": 6596.057,
    "text": "I think that was valuable and it has produced some interesting things, but it can only get you so far.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6596.518,
    "end": 6597.118,
    "text": "Then you miss",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6598.178,
    "end": 6603.622,
    "text": " at least 50% of the puzzle that could also inform that design where we talked earlier about like emotions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6604.142,
    "end": 6612.968,
    "text": "And, you know, I don't, I wouldn't argue that the systems that we have today, despite the media claims, and you know, there's the stuff with open AI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6613.389,
    "end": 6619.513,
    "text": "And I saw some comments about Oh, well, you know, Alton and others, they have some secret AGI program, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6619.813,
    "end": 6622.195,
    "text": " I've heard conspiracies about that stuff all the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6622.215,
    "end": 6624.497,
    "text": "So I don't, I put too much credence to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6625.237,
    "end": 6631.161,
    "text": "I don't think that they've cracked the, the emotional nut, the biophysical nut.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6631.562,
    "end": 6638.267,
    "text": "I think it's more like we've had lots of people either argue, study very specific slices of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6639.347,
    "end": 6642.009,
    "text": "But those voices need to be echoed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6642.41,
    "end": 6642.65,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6642.71,
    "end": 6647.073,
    "text": "And so that's what I think the moral computation is an echo as well of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6648.419,
    "end": 6650.16,
    "text": " At least like a century of thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6651.121,
    "end": 6651.801,
    "text": "And it's saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6652.202,
    "end": 6653.803,
    "text": "This is how we can approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6654.403,
    "end": 6655.644,
    "text": "Artificial general intelligence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6655.984,
    "end": 6657.565,
    "text": "And then it can account for things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6657.625,
    "end": 6658.506,
    "text": "Like the fruit fly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6658.786,
    "end": 6661.968,
    "text": "Actually you said Andrew was his name.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6662.769,
    "end": 6663.71,
    "text": "On the work on like honeys.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6664.07,
    "end": 6665.651,
    "text": "That to me is an example of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6666.452,
    "end": 6668.073,
    "text": "He's got a learning component.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6668.133,
    "end": 6669.514,
    "text": "And an inferential component.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6669.994,
    "end": 6671.975,
    "text": "And there is some organizing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6672.015,
    "end": 6672.776,
    "text": "He has a body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6672.836,
    "end": 6674.197,
    "text": "He has a niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6674.237,
    "end": 6676.699,
    "text": "That's very close to an in silico.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6677.319,
    "end": 6679.501,
    "text": " version of a mortal computer, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6679.801,
    "end": 6684.665,
    "text": "You know, the only other components that it might be more like an allostatic MC.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6684.925,
    "end": 6690.209,
    "text": "So and again, in the paper, we have a table and Carl did want that to stay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6690.769,
    "end": 6693.391,
    "text": "I was going to move it to the appendix again length.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6694.172,
    "end": 6700.476,
    "text": "So we made a compressed table of different types of mortal computers and we kind of characterize them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6700.496,
    "end": 6701.957,
    "text": "There's a few that are auto-pedic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6702.097,
    "end": 6705.14,
    "text": "We actually do have very like organoids",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6706.048,
    "end": 6708.91,
    "text": " really, really close to what you would want, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6708.95,
    "end": 6710.231,
    "text": "But they're all biophysical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6710.391,
    "end": 6716.995,
    "text": "So there's not like, oh, I designed something on a neuromorphic chip with predictive coding, like what I would do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6717.015,
    "end": 6723.84,
    "text": "This is, you know, oh, we're using stem cells to construct this microphysiological architectures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6724.16,
    "end": 6728.523,
    "text": "I do think that has a place, a super important role going forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6728.563,
    "end": 6735.548,
    "text": "And I would only hope that there's some democratization of an exchange of ideas between this wonderful, really new world,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6736.208,
    "end": 6747.173,
    "text": " and machine intelligence to learn and study organoids, but also fungal and mold-based computing, really interesting place to be as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6748.274,
    "end": 6755.337,
    "text": "And to think about how does that biophysical organization give rise to, and those are examples of mortal computers,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6757.297,
    "end": 6768.28,
    "text": " Ashby's homeostat deserves a lot of love and attention because it's the oldest and really the most prominent example of what I would argue is a true in silico mortal computer, but it's homeostatic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6768.96,
    "end": 6771.561,
    "text": "A little bit allostatic, depending on what you've done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6771.661,
    "end": 6772.861,
    "text": "There's variations to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6773.581,
    "end": 6776.562,
    "text": "But like the xenobots, really interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6777.382,
    "end": 6781.903,
    "text": "I think the xenobots are an example of something that they use frog cells for.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6782.103,
    "end": 6805.323,
    "text": " lake cells and pieces of frogs to actually instantiate these little tiny robots that can self-heal and repair and i think that's going to be the part where we have autopedic computers already in front of us like organoids and xenobots are some of the most interesting i think profound examples of how you get this computer and then for example andrew's work would have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6805.723,
    "end": 6825.46,
    "text": " you know maybe the missing component so his would be more allostatic so mid-level kind of Mortal computers and I'd have to read more about them but just from your explanation um but the structural selection the evolution of the morphology the self-replication part of the story which we also talk about as well",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6826.401,
    "end": 6828.022,
    "text": " is more in like the xenobots.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6828.263,
    "end": 6845.179,
    "text": "And so I think it's interesting how do those two worlds interact and how do you get those properties of self-repair, self-replication, which by the way, if you add a mutation to self-replication, you get reproduction because now that creates a new system that's now subject to natural selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6845.479,
    "end": 6847.641,
    "text": " And now you've essentially done reproduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6847.801,
    "end": 6858.449,
    "text": "And now we have an account in your your your computer has all the pieces that, you know, complex organisms do to also ensure their persistence, which is we have offspring.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6858.729,
    "end": 6859.049,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6859.169,
    "end": 6863.553,
    "text": "You know, that's another way we project ourselves into the future in an indirect way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6863.793,
    "end": 6866.135,
    "text": "So it'd be kind of cool to take like the honeybee model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6867.051,
    "end": 6874.119,
    "text": " And think about what are the ways in which we can have its morphology be damaged and conduct self-repair.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6874.48,
    "end": 6876.482,
    "text": "And that gets into the real nitty gritty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6876.502,
    "end": 6878.404,
    "text": "And even it might be difficult to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6878.605,
    "end": 6878.885,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6878.945,
    "end": 6882.169,
    "text": "And that's where I think the this is where the grand challenge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6882.249,
    "end": 6882.429,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6882.469,
    "end": 6885.793,
    "text": "It's got an open an open pathway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6886.293,
    "end": 6892.415,
    "text": " I don't think like any one of us has an exact candidate, you know, for, okay, there's already exists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6892.435,
    "end": 6894.855,
    "text": "Cause there'd be really no point in writing the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6895.436,
    "end": 6903.458,
    "text": "Um, I do think the Xenobots and organoids can teach us a tremendous amount about structural selection, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6904.969,
    "end": 6924.086,
    "text": " morphogenesis uh and self-repair and then maybe may build like a you know a synthetic uh you know honeybee mortal computer that also is autopedic right it's able to constantly uh repair itself to some degree i mean that that would be very interesting so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6925.627,
    "end": 6933.112,
    "text": " The fact that you brought that up was kind of like, oh, that's probably another example of an in silico mortal computer versus a biophysical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6933.652,
    "end": 6935.553,
    "text": "We have some good examples of biophysical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6936.293,
    "end": 6938.395,
    "text": "Not as many in silico to my knowledge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6938.435,
    "end": 6942.057,
    "text": "Even like robots today, they're not mortal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6943.078,
    "end": 6958.156,
    "text": " There might be some interesting things I'm not aware of, but largely they have all the parts, they have the ingredients, I think, for mortal computers, but they're not completely there yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6958.476,
    "end": 6976.024,
    "text": " And so I think that making a robot inherently, whatever the robot system, it could be the honeybee, it could be a creature that we come up with, it could be humanoid, making it inherently driven by just this fundamental process of persistence is the starting point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6976.304,
    "end": 6978.786,
    "text": "And then thinking about what are those essential variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6979.166,
    "end": 6984.048,
    "text": "And like we talked about the fruit fly, designing all of those principles from the ground up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6984.328,
    "end": 6985.489,
    "text": "And then at one point you've got to say,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6986.389,
    "end": 6987.849,
    "text": " Is this supposed to be human-like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6988.61,
    "end": 6998.172,
    "text": "Am I going to be able to evolve a population of these, or am I going to need to employ inductive biases like a common model of cognition?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6998.232,
    "end": 7006.373,
    "text": "And I like to think of cognitive architectures as a possible bias and say, well, okay, I'm going to design a brain based on these principles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7006.833,
    "end": 7008.914,
    "text": "It could be the wrong bias, but you know what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7010.014,
    "end": 7014.675,
    "text": "It's probably capturing a lot in, you know, cognitive architectures are fit to a lot of human data, so...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7015.115,
    "end": 7037.684,
    "text": " they do explain a lot of different effects so I I would say it's a pretty good bet um and you bring in those biases and now you design the internal states and now you have a a very complicated Mortal computer but you know the future will be a very interesting place and hopefully uh more interesting Mortal computers will emerge in the future",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7041.701,
    "end": 7042.462,
    "text": " Thank you, Alex.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7042.502,
    "end": 7045.066,
    "text": "These are really great points.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7046.087,
    "end": 7057.203,
    "text": "In closing, Blue, first, as much as you'd like to add, and then Alex, any closing thoughts that you want to kind of leave it with?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7059.901,
    "end": 7063.284,
    "text": " I don't know that Andrew Barron is building a robot bee.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7063.304,
    "end": 7064.265,
    "text": "That would be super cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7064.945,
    "end": 7071.491,
    "text": "He's just modeling the real actual biological honeybee brain, which does some level of mortal computing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7071.531,
    "end": 7073.213,
    "text": "I guess it is a mortal computer, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7073.253,
    "end": 7074.934,
    "text": "But it's in vivo, not in silico.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7079.419,
    "end": 7087.711,
    "text": " But Alex, thank you so much for entertaining all of my fun questions and for, you know, trancing us down this like super fun path toward mortal computing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7087.771,
    "end": 7092.158,
    "text": "I'm super excited to read your new paper and appreciate your time on the stream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7095.253,
    "end": 7096.213,
    "text": " Yeah, thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7097.014,
    "end": 7099.715,
    "text": "Thank you, Blue, and thank you, Daniel, for inviting me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7099.735,
    "end": 7102.696,
    "text": "This was a really thrilling discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7102.716,
    "end": 7116.181,
    "text": "I really like your guys' podcast series, and I think it's great that you guys are pushing for the narrative of free energy and active inference and trying to educate the greater public on it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7116.281,
    "end": 7120.803,
    "text": "So my students, as I already told you, are fans of your channel, so it was great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7121.519,
    "end": 7122.901,
    "text": " my pleasure to be on here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7122.921,
    "end": 7125.784,
    "text": "I hope you guys enjoy the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7125.804,
    "end": 7132.913,
    "text": "And I guess as a one final comment, I guess it's now sort of our own private running joke.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7134.054,
    "end": 7140.682,
    "text": "Again, for those that tuned in hoping to like have a deep dive into I think you guys did a good job on point zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7141.519,
    "end": 7146.581,
    "text": " going through all four of those papers, to be fair, I think that captured their essence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7146.701,
    "end": 7153.363,
    "text": "And then last time at the end of point one, I gave like a crash course on the NGC predictive coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7154.343,
    "end": 7160.585,
    "text": "So just to make a final comment to sort of like tie everything together to today's, I didn't actually expect I,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7161.065,
    "end": 7167.911,
    "text": " It's my fault for introducing the paper, but it may use a welcome derailment going down mortal computer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7167.951,
    "end": 7173.135,
    "text": "But I think those four papers you could argue are like building blocks as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7173.596,
    "end": 7176.678,
    "text": "There are other pieces to the puzzle of mortal computation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7177.099,
    "end": 7187.527,
    "text": "For example, my preference or my thoughts are predictive coding, which is a manifestation of free energy or variational free energy minimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7188.408,
    "end": 7213.372,
    "text": " that's going to be an important piece your neural circuitry should probably adhere to that because i think it's very friendly to a lot of hardware like neuromorphic chips so that's kind of like where all the predictive coding stuff just to think about my papers they're like oh okay that's how that relates it's probably going to be the allostatic processes if i were to guess uh and building circuits there and building little modules like we do in cog engine uh the cog engine paper",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7213.912,
    "end": 7242.684,
    "text": " is we have talked about it even if it's not about it specifically the common model of cognition is a wonderful bias if you want to try to skip ahead rather than evolve from the ground up to human cognition um and if we want to build a mortal computer that has aspects of human behavior we should maybe appeal to that type of bias um there's a lot more in the world and i encourage you know viewers to go into the world of cognitive science and computational neuroscience and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7243.084,
    "end": 7247.145,
    "text": " dig into the eternal well that is of the knowledge there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7247.985,
    "end": 7249.146,
    "text": "So I recommend that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7249.406,
    "end": 7251.086,
    "text": "And that's how that paper relates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7251.386,
    "end": 7256.548,
    "text": "The spiking predictive coding and the convolutional, which we didn't, we only like sort of like touched on them briefly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7257.048,
    "end": 7267.371,
    "text": "I'll just comment that the convolutional predictive coding paper, which was like the second one that you guys talked about, is like an extension of the nature paper in NGC.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7267.411,
    "end": 7269.691,
    "text": "And it just says, how do we do vision processing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7270.052,
    "end": 7271.032,
    "text": "I consider that as...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7271.892,
    "end": 7280.499,
    "text": " Another version of the same building block that would go into a mortal computer and the spiking predictive coding, I think, is really interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7280.88,
    "end": 7289.107,
    "text": "It says, well, if I'm going to try to get as close as I can to biophysical, right, and get as close as I can to neuromorphics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7289.767,
    "end": 7293.128,
    "text": " we should be able to think about what do real neurons do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7293.188,
    "end": 7297.929,
    "text": "So it's kind of like we're building the neuron as a little biome, a little mortal computer in of itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7298.009,
    "end": 7300.289,
    "text": "And we know that they communicate with spikes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7301.409,
    "end": 7305.33,
    "text": "And so the spiking predictive coding is like one way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7305.73,
    "end": 7313.352,
    "text": "There's other ways to emulate predictive coding at a very fine course, fine grained dynamics level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7313.972,
    "end": 7317.953,
    "text": "And I would imagine that that would probably be a great way to build a neuromorphic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7318.653,
    "end": 7320.694,
    "text": " chip-based mortal computer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7321.154,
    "end": 7327.617,
    "text": "So the idea is if you get into neuromorphics, and the mortal computing paper does talk about it, not in great detail.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7328.717,
    "end": 7337.141,
    "text": "It talks about even my other work that's beyond predictive coding, like forward-forward, predictive forward-forward only learning and other variants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7337.701,
    "end": 7353.724,
    "text": " um and also spike timing dependent plasticity and how do all those relate to the mortal computer and i think that's in the supplement so if you're like really a glutton for punishment and you can't get enough there's you know an appendix with a couple sections um and it's talked about there and so i think that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7354.565,
    "end": 7359.469,
    "text": " You can just, for the viewers of this podcast, this closing podcast, you could be like, well, that's how it all relates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7359.789,
    "end": 7361.651,
    "text": "Really, it was all parts of a mortal computer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7361.971,
    "end": 7369.558,
    "text": "And we can all pretend that from the beginning I had envisioned a mortal computer, even though that only came out the framework in the last seven months.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7370.038,
    "end": 7373.781,
    "text": "I see all those parts as giving rise to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7374.181,
    "end": 7381.788,
    "text": "And there are tools that you can use, just like Daniel brought up the whole framework of active inference and the free energy principle and Bayesianism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7382.849,
    "end": 7392.815,
    "text": " they're all tools that might help you build, you know, very powerful and interesting mortal computers, whether they are simulated or whether they're real world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7393.436,
    "end": 7401.741,
    "text": "And then as we brought up in this one, you guys have, and I think it's a compliment to like some of Chris Fields teachings and some of his work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7402.142,
    "end": 7405.204,
    "text": "There's the, also the whole quantum interpretation, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7405.504,
    "end": 7430.522,
    "text": " not quantum computing as a solution but rather a mortal computer and a neuromorphic system which that's what you know carl and chris did and carl and i did in mortal computation the interpretation from the quantum information theoretic could be a very promising uh way of formulating it and right and that might open up the doors to an extremely powerful form like being quantum computing so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7431.383,
    "end": 7438.469,
    "text": " I think there's a lot of wonderful wild out there places to go, but they're not too out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7438.769,
    "end": 7440.71,
    "text": "That's my last point that I want to make.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7441.271,
    "end": 7441.871,
    "text": "They're out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7442.051,
    "end": 7449.217,
    "text": "They go against a lot of our, like I said earlier, held beliefs, especially those tied to immortal computation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7449.697,
    "end": 7462.86,
    "text": " But I also think that there's the kind of build on intuitions and ideas that have existed in other places, like if we take biology and biochemistry and biophysics seriously and we know that these things work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7463.24,
    "end": 7469.381,
    "text": "So it's not like, oh, I'm going to do something drastically strange and controversial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7469.401,
    "end": 7474.862,
    "text": "It's just saying, let's take a little bit deeper inspiration from the world around us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7475.602,
    "end": 7500.561,
    "text": " and living entities to build what could arguably be one way to do artificial general intelligence and ultimately artificial sentience which i think is kind of like the the final end goal right and then yeah and we end up there so thank you guys again it was so much fun talking letting thank you for letting me at some points ramble i hope my rambling was useful but you know",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7502.008,
    "end": 7526.025,
    "text": " thank you i'll give a short closing remark so first thank you blue for working on the dot zero diligently and thank you alex for like suggesting to take on this challenge and reading between and among the citations is like always what it's about and the engagement and the developments in the real world so it's just epic it's fun and it's live the research program is lived forward but experienced backwards or however it was",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7527.026,
    "end": 7545.12,
    "text": " um definitely very excited for everything you've described and on on all these topics i hope we can continue to discuss and that people will be excited to step up and do like a 56.3 um and we can just like continue working together and i'll close actually just by reading a short selection from an abstract",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7545.72,
    "end": 7550.863,
    "text": " because I think it really contextualizes a big element of Bayesian mechanics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7551.183,
    "end": 7554.725,
    "text": "So this is the paper, Is There a Newton of the Blade of Grass by Peter Schuster 2011.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7555.585,
    "end": 7557.466,
    "text": "So just the first sentences.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7557.546,
    "end": 7560.788,
    "text": "In 1790, Immanuel Kant makes the famous statement in his Critique of Judgment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7561.468,
    "end": 7568.715,
    "text": " There will never be a Newton of the blade of grass because human science will never be able to explain how a living being can originate from inanimate matter.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7569.255,
    "end": 7575.741,
    "text": "The German naturalist Ernst Haeckel, about 70 years later, celebrates Charles Darwin to be such a Newton of the grass blade.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7576.722,
    "end": 7585.209,
    "text": "Haeckel's enthusiasm about Darwin was not shared among his contemporaries and is not too widespread today, although the path-breaking role of Darwin's scholarly work is not...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7586.13,
    "end": 7604.33,
    "text": " least doubted or questioned the american philosopher physicist and molecular biologist evelyn fox keller says that considering darwin as the newton of biology is simply wrong darwin himself has systematically avoided dwelling upon the question of how life has originated from inanimate materials natural selection begins with a living cell",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7605.939,
    "end": 7618.445,
    "text": " And I think it's actually this nexus that you're addressing with the 1900s and early 2000s in mind that is a big one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7619.025,
    "end": 7627.029,
    "text": "So thank you again for undertaking the project and for joining these streams and talk to you next time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7627.949,
    "end": 7629.49,
    "text": "Yeah, thank you for having me again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7629.63,
    "end": 7630.77,
    "text": "Looking forward to the next time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7631.771,
    "end": 7631.911,
    "text": "Bye.",
    "speaker": "SPEAKER_03"
  }
]