[
  {
    "start": 8.269,
    "end": 8.55,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9.251,
    "end": 10.632,
    "text": "Hello and welcome everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 11.133,
    "end": 12.054,
    "text": "It is January 28th, 2022.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 15.066,
    "end": 22.368,
    "text": " We're here in ACT-INF Lab model stream number 5.1 with Pietro Mazzaglia and Tim Verbellen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 22.949,
    "end": 30.791,
    "text": "So this is going to be a model stream presentation and discussion on their recent work, Contrastive Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 31.412,
    "end": 35.493,
    "text": "We're going to have a presentation section and then a discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.133,
    "end": 41.435,
    "text": "So please feel free to ask any questions during the presentation that we can address in the discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 42.136,
    "end": 44.48,
    "text": " And Tim and Pietro, thanks a ton.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 44.52,
    "end": 47.466,
    "text": "We really appreciate you joining to share your work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 47.606,
    "end": 50.352,
    "text": "So please take it away and thanks again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 52.634,
    "end": 55.495,
    "text": " Yeah, thanks, Daniel, for inviting us as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 55.735,
    "end": 62.839,
    "text": "So I'm Tim Verbeel and together with my colleague Pietro, we'll talk on our work on contrastive active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 63.719,
    "end": 69.922,
    "text": "So maybe first to set the scene, why are we looking at active inference?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 70.923,
    "end": 73.684,
    "text": "Well, basically, our lab wants to build intelligent agents.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 74.364,
    "end": 80.588,
    "text": " And so from that perspective, we noticed early on, if you want to build something intelligent, it needs to be embodied.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 80.608,
    "end": 83.73,
    "text": "It needs to be interacting with its environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 84.55,
    "end": 97.198,
    "text": "And then it's a small step, of course, to develop interactive inference, where basically your agent needs to understand the environment it's interacting with and need to build a model, basically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 103.155,
    "end": 105.096,
    "text": " and the way that we approach this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 106.257,
    "end": 113.301,
    "text": "A lot of this material has also been covered in a previous model stream, I think number three.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 113.621,
    "end": 117.003,
    "text": "So if you want more details, you can dig up that one again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 117.984,
    "end": 128.39,
    "text": "And so then afterwards, Pieter will take over, and he will go into the pretty details of the contrastive approach to active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 129.05,
    "end": 129.951,
    "text": "So let's get started.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 131.317,
    "end": 135.92,
    "text": " So basically, active inference, it's a process theory of the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 136.501,
    "end": 149.45,
    "text": "And basically, it says that your brain or the agent, he builds a generative model of the environment, which is basically a joint probability distribution over observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 149.731,
    "end": 155.315,
    "text": "So a thing that you can see or experience actions, which we denote as A.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 157.095,
    "end": 162.06,
    "text": " states or hidden states of the environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 162.801,
    "end": 173.21,
    "text": "So basically you have your agent that is separate from the environment and it can do actions, it can interact with the environment and this gives rise to new observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 173.891,
    "end": 181.418,
    "text": "And so the idea of the generative model is basically the agent figures out which are kind of the hidden states that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 185.169,
    "end": 199.817,
    "text": " and that give rise to my observations and if you can build such a model then basically this enables the agents to plan some actions to bring the agent to some preferred observations or outcomes",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 201.104,
    "end": 210.628,
    "text": " The crucial bit is basically how do you get this model of what happens if I do my actions?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 211.149,
    "end": 218.532,
    "text": "How does this influence the state and how does this influence the outcomes that I see?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 218.552,
    "end": 220.973,
    "text": "The crucial part in active inference is twofold.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 221.113,
    "end": 222.334,
    "text": "First of all, it says okay,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 223.288,
    "end": 229.814,
    "text": " This is what the agent does, and it does so by optimizing so-called free energy, which isn't a profound surprise or prediction error.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 229.894,
    "end": 237.961,
    "text": "So basically, the generative model allows the agent to predict the outcomes that it will see, that it will witness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 238.742,
    "end": 245.448,
    "text": "And the better these match your actual observations, the more happier you are as an agent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 246.801,
    "end": 254.184,
    "text": " And crucially, you will also select the actions that will minimize the free energy you expect in the future.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 254.204,
    "end": 268.35,
    "text": "So we'll dig a bit into the mods just to set the scene on the one hand notation-wise so that we all know what O's and S's and A's are, but also to then see the move",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 268.868,
    "end": 281.24,
    "text": " that Piet will make from the, let's say, vanilla active inference presentation towards a more contrastive formulation of the active inference objective, of the energy objective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 283.123,
    "end": 286.685,
    "text": " So we start off with setting the sea with a generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 286.785,
    "end": 294.488,
    "text": "So it's a bit laid out, the diagram of the agents and the environment that was on previous slides.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 294.508,
    "end": 297.109,
    "text": "So basically, this unfolds over time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 297.59,
    "end": 301.611,
    "text": "So you are in a certain state that gives rise to a certain observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 301.631,
    "end": 308.014,
    "text": "And then given an action on your previous state, you basically move ahead to the next state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 309.115,
    "end": 311.416,
    "text": "And this process unfolds over time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 312.421,
    "end": 317.603,
    "text": " And you can see some of the circles are colored gray.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 318.123,
    "end": 320.104,
    "text": "And these are basically the things that you can observe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 320.804,
    "end": 324.286,
    "text": "So you know the actions that you did up until now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 324.986,
    "end": 328.768,
    "text": "And you know the observations that you saw up until now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 329.668,
    "end": 332.05,
    "text": " And all the rest is basically for you to infer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 332.59,
    "end": 344.417,
    "text": "So you can only infer the hidden states until now, but you can also try to infer the hidden states of the future, the actions that you want to take, or the observations that you will experience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 345.238,
    "end": 356.064,
    "text": "And so basically, the so-called joint model or joint distribution over the sequence of observation states and action is then basically characterized as follows.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 356.124,
    "end": 358.346,
    "text": "So you have a prior over actions,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 360.46,
    "end": 369.386,
    "text": " You have a likelihood model, so you have prior over actions, so this basically determines what is the probability you take certain actions at a certain time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 369.966,
    "end": 379.432,
    "text": "You have some transition probabilities, so what is the probability that I will transition to this next state given my previous state and the action I did.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 379.992,
    "end": 384.475,
    "text": "And you have the likelihood model, which basically says, given the state I am,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 386.531,
    "end": 388.331,
    "text": " which observation I will see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 388.771,
    "end": 403.174,
    "text": "And so this basically covers the so-called Markov assumption that your observation that you see at this time step, it only depends on your hidden state, and it does not really directly depend on anything else.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 404.114,
    "end": 408.915,
    "text": "Because if you know your current hidden state, then you know the observation you will see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 410.216,
    "end": 412.596,
    "text": "So that's basically what is reflected here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 413.988,
    "end": 428.457,
    "text": " But of course, as an agent, having this generative model, this allows you to assess how likely is a sequence of observations, for example, and it allows you to predict, given these actions, what will happen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 428.917,
    "end": 432.48,
    "text": "But one crucial bit, of course, is still the inverse of this model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 432.54,
    "end": 438.803,
    "text": "Like, given that I saw these observations, that I did these actions, which is my current state?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 440.164,
    "end": 440.885,
    "text": "And this is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 441.516,
    "end": 443.197,
    "text": " basically non-trivial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 443.877,
    "end": 449.899,
    "text": "So even if you have the exact generative model, inverting this is typically intractable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 450.86,
    "end": 461.904,
    "text": "So that's why in active inference, you resort to variation inference and you just say, okay, I just assume that I can build a model, the so-called, for example, steering model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 462.604,
    "end": 469.487,
    "text": "And this is the thing that will tell me, given certain observations, what is my probability to be in a certain state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 470.772,
    "end": 472.033,
    "text": " So this is what's depicted here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 472.093,
    "end": 477.436,
    "text": "So we introduce this Q, and Q is basically a variational percent posterior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 477.456,
    "end": 478.777,
    "text": "So it can be any distribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 478.797,
    "end": 479.517,
    "text": "You can choose it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 480.618,
    "end": 488.482,
    "text": "And you just say, OK, given some observation, I want to have the best estimate for the state I am in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 489.723,
    "end": 491.544,
    "text": "And the reality principle",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 494.38,
    "end": 495.201,
    "text": " then this is easy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 495.241,
    "end": 511.081,
    "text": "You just optimize the free energy, which is the node F here, and it's basically expectation over states generated by your approximate posterior, the expectation over the difference between the local accuracy of your approximate",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 511.161,
    "end": 513.942,
    "text": " posterior and the likelihood of the gen-f model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 514.583,
    "end": 528.709,
    "text": "And if you can minimize that, that basically means that you will have the best explanation for the observations you see, but at the same time you also have the best approximate posterior for the true one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 529.19,
    "end": 530.11,
    "text": "You're not going to go to the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 530.64,
    "end": 533.042,
    "text": " whole derivation of this flow.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 533.483,
    "end": 537.988,
    "text": "But basically, you can convert this to the second equation line.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 538.028,
    "end": 548.618,
    "text": "And this is the one that we use most often in our models, which is basically Kähler version between this upper to the posterior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 549.079,
    "end": 552.042,
    "text": "So basically, what is the state I am given the observations I saw.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 555.813,
    "end": 563.597,
    "text": " this prior that basically says this is my guess that I am in this state given my previous state and action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 563.637,
    "end": 570.921,
    "text": "So I don't know the observation yet, but I want to have the best guess without my observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 571.041,
    "end": 575.564,
    "text": "And if I see the observation, I don't want my beliefs to completely switch.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 577.85,
    "end": 579.031,
    "text": " there's something wrong with my model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 579.812,
    "end": 584.175,
    "text": "And then you have the second term, which is the log likelihood term.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 584.535,
    "end": 590.78,
    "text": "This is basically the accuracy of your model, or how good are you at reconstructing the outcomes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 595.399,
    "end": 617.026,
    "text": " this is all for the past basically or up until your current time step so you know the observations you saw and you can evaluate the energy and then you can basically update your model in order to to minimize this thing but of course you also want to know your actions you want to look into the future and so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 617.867,
    "end": 621.532,
    "text": " If you look into the future, then we talk about the expected free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 622.313,
    "end": 628.681,
    "text": "So here, we use pi as a shorthand for a sequence of actions into the future.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 628.702,
    "end": 635.511,
    "text": "I also switched from t to tau just to denote that we are talking about future time steps, basically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 638.769,
    "end": 665.96,
    "text": " bit is now that in the expectation now you don't have expectations only over states but also over outcomes because you you couldn't sense uh your observations yet so you don't know them so you can just kind of do an expectation over anything that could happen and and then uh the move that uh is made in active inference is basically that uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 667.31,
    "end": 680.667,
    "text": " on the one hand form a term which they call or which we call the instrumental value or realizing preferences and it's basically stating that okay as an agent for future outcomes",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 681.886,
    "end": 705.064,
    "text": " have some prior that i think that i will regardless what happens that i think i will realize it's kind of your your preferred outcomes let's say you can also cause this more like homeostasis so my body temperature to be 37 degrees celsius so my expectation before knowing anything is that it will be at 37 degrees and have",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 708.03,
    "end": 708.75,
    "text": " to make it so.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 708.79,
    "end": 710.231,
    "text": "So that's a bit reflected here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 710.811,
    "end": 716.474,
    "text": "You disregard the dependency on your future actions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 716.514,
    "end": 720.336,
    "text": "You just say, okay, my prior is that this is what I expect.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 721.437,
    "end": 723.378,
    "text": "So this becomes the instrumental value.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 724.158,
    "end": 730.902,
    "text": "And then the second assumption is basically that your approximate posterior model is basically very close",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 733.811,
    "end": 742.503,
    "text": " then you can rewrite it in the second term, which basically means that you have, on the one hand,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 744.676,
    "end": 763.464,
    "text": " burn that says this is my belief of the state given the actions i will do and the other thing is also a belief about future states given the actions and some certain outcomes that i expect to see so basically it says",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 764.522,
    "end": 771.428,
    "text": " What would be the information that I get from looking for certain outcomes?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 772.128,
    "end": 778.874,
    "text": "And it's kind of an epistemic value or an information gain, which can drive you to explore, basically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 780.495,
    "end": 789.663,
    "text": "If you don't know how to get to your preferred state, at least you want to get to states that give you more information on where you are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 791.445,
    "end": 794.826,
    "text": " Colferston often says it's like the owl that needs food.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 795.346,
    "end": 796.066,
    "text": "So what do you do?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 796.126,
    "end": 798.607,
    "text": "Do you eat first or do you search for prey first?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 798.707,
    "end": 802.708,
    "text": "And so the epistemic value is basically searching for prey.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 802.909,
    "end": 808.15,
    "text": "It's like, where should I go to get more information on where the prey is?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 808.67,
    "end": 814.012,
    "text": "And then once you know where it is, then you can realize your preferences and preferences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 819.378,
    "end": 823.202,
    "text": " So how does the action selection work then?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 823.762,
    "end": 827.846,
    "text": "Well, basically, you want to select the actions that minimize your expected free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 827.886,
    "end": 840.277,
    "text": "So at each time step, first thing you do is you use your approximate model to estimate your current state, like knowing in which state am I now given my latest observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 841.32,
    "end": 848.384,
    "text": " Then you can evaluate the expected free energy for each policy or plan.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 848.444,
    "end": 854.888,
    "text": "So for any future sequence of actions, you can evaluate the expected free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 856.289,
    "end": 859.992,
    "text": "And then this basically results in a belief over policy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 860.052,
    "end": 870.338,
    "text": "So you basically take the negative expected free energy, you multiply with this precision parameter, which just states how, yeah,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 872.053,
    "end": 875.915,
    "text": " how much confidence you have that your expected free energy is correct, basically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 876.375,
    "end": 878.897,
    "text": "And then you use the softmax prediction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 878.917,
    "end": 890.323,
    "text": "So basically, it just says the policies that have low expected free energy are the ones that are most likely, basically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 890.483,
    "end": 891.943,
    "text": "That's the only thing this formula says.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 892.524,
    "end": 894.545,
    "text": "And then you refer the next action according to this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 894.585,
    "end": 900.588,
    "text": "You just select the next action for the sequence that you think will give you the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 901.284,
    "end": 904.669,
    "text": " at the minimum expected energy, and that's how it goes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 904.729,
    "end": 908.976,
    "text": "And then you take this action, you get a new observation, and the process repeats.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 911.079,
    "end": 913.683,
    "text": "So one crucial point in all our work",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 917.898,
    "end": 918.178,
    "text": " model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 918.799,
    "end": 930.449,
    "text": "And typically, you have a certain problem and you know how the problem looks like, what the observations are, what the hidden state might be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 930.89,
    "end": 936.535,
    "text": "And then you can really pinpoint and write down the exact model and start optimizing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 937.136,
    "end": 939.598,
    "text": "But in our case, this is often not true.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 939.678,
    "end": 940.679,
    "text": "If you look at the robots,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 945.182,
    "end": 949.525,
    "text": " How is the state space that you need to track?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 949.966,
    "end": 954.029,
    "text": "How do you convert these pixels to the state space?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 954.089,
    "end": 958.292,
    "text": "All these things are just not there yet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 958.332,
    "end": 964.737,
    "text": "The goal in our work is that, can we completely start from scratch and learn this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 964.777,
    "end": 967.439,
    "text": "For this, we use deep neural networks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 970.469,
    "end": 974.774,
    "text": " to actually provide us with these models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 975.274,
    "end": 980.919,
    "text": "And we optimize the parameters of these neural nets also by minimizing the free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 981.16,
    "end": 982.941,
    "text": "That's the core idea, let's say.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 983.862,
    "end": 984.843,
    "text": "So how does it look like?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 985.444,
    "end": 988.006,
    "text": "We call this an artificial work model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 988.567,
    "end": 991.609,
    "text": "So we start off with observations and actions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 991.649,
    "end": 992.25,
    "text": "So this can be...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 994.266,
    "end": 1005.79,
    "text": " pixels, basically, so an N by M matrix of numbers, let's say, and actions, which could be any action vector, it could be your velocity or whatever your agent can do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1007.03,
    "end": 1009.991,
    "text": "And these numbers are put into a neural net, which we call the encoder.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1010.511,
    "end": 1012.132,
    "text": "And this basically then reflects this",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1015.167,
    "end": 1027.271,
    "text": " my previous state action and my current observation, it outputs a probabilistic state representation, which is basically the means and the variances of multivariate portions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1028.311,
    "end": 1031.792,
    "text": "And then we have a second neural net, which we call the transition model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1032.272,
    "end": 1040.155,
    "text": "And this is then saying, what will happen if I do a certain action?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1040.215,
    "end": 1043.796,
    "text": "How will my state evolve if I do a certain action?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1044.659,
    "end": 1051.423,
    "text": " Now, finally, we also have the decoder or the likelihood model that then outputs, given the states, some observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1051.463,
    "end": 1055.305,
    "text": "So in the case of an image, for example, this will generate you a new image.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1056.085,
    "end": 1062.648,
    "text": "And the goal is, of course, to have the best predictions possible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1063.049,
    "end": 1067.031,
    "text": "So if you look at the free energy formula again, in this case,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1067.971,
    "end": 1087.029,
    "text": " it's again you have this likelihood term which basically just says that given the output of the decoder so the generated image i just want to have this close to the actual image that you then see basically so it's just a reconstruction loss in terms of uh neural net let's say and the second term",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1088.422,
    "end": 1098.921,
    "text": " The second term is the KL divergence between the distribution that you generate from the encoder and the distribution that you generate from the transition model, basically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1105.322,
    "end": 1112.451,
    "text": " So we applied this on a number of cases, which also were seen in the previous model stream.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1112.851,
    "end": 1115.174,
    "text": "So just to give you some intuition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1115.194,
    "end": 1120.1,
    "text": "So first thing was the multi-core problem, which is a basic control problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1120.12,
    "end": 1124.686,
    "text": "So here, the sensory input is the position you are with the card.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1125.751,
    "end": 1131.039,
    "text": " you basically have to infer not only the position you're in, but also the momentum you have, the velocity you have.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1131.56,
    "end": 1135.987,
    "text": "And so you can see that on the right, you can see the model",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1139.192,
    "end": 1140.493,
    "text": " for going left or right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1141.054,
    "end": 1148.598,
    "text": "And you can see how in the beginning, it's not sure on the velocity, so it's very spread out in what it will predict.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1148.998,
    "end": 1154.902,
    "text": "But the more information it gets, the more it kind of collapses to, yeah, I'm pretty sure that this is the behavior that will happen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1154.942,
    "end": 1162.487,
    "text": "And then you can use this to drive the agent towards a preferred state, in this case, the flag.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1163.581,
    "end": 1167.943,
    "text": " The second one was using the car racer environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1167.963,
    "end": 1174.546,
    "text": "So here you get these observations that are now just pixels from this game.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1175.207,
    "end": 1178.528,
    "text": "And the preferred state of the car was to be in the center of the track.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1179.349,
    "end": 1185.111,
    "text": "And so you can see how it actually infers the actions that will bring it to the center of the track.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1186.552,
    "end": 1191.655,
    "text": "And it might even get corners in order to reach its preferred state a bit faster.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1192.595,
    "end": 1201.7,
    "text": " And finally, we also did this on the robots navigating our lab, where we equipped it with a number of sensor modalities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1201.74,
    "end": 1208.284,
    "text": "So you can see the camera, but also a front-facing lidar and also a radar range doppler.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1208.324,
    "end": 1218.83,
    "text": "So the radar range doppler basically gives you, in the y-axis, the range, and in the x-axis, the velocity of the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1219.07,
    "end": 1220.711,
    "text": " The reflection is basically the Doppler.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1221.372,
    "end": 1225.254,
    "text": "And here you can see how in the beginning, we feed it with a number of observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1225.815,
    "end": 1228.637,
    "text": "And then we basically let the model imagine what could happen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1229.077,
    "end": 1230.458,
    "text": "So these are real observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1230.618,
    "end": 1235.901,
    "text": "And now it basically imagines what it will see if it turns around, for example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1235.941,
    "end": 1243.286,
    "text": "And you can see it actually learns basic dynamics, basic behavior of all these sensor modalities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1243.306,
    "end": 1244.007,
    "text": "So it's pretty cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1246.667,
    "end": 1249.689,
    "text": " Okay, so what are the limitations of this thing?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1250.59,
    "end": 1255.093,
    "text": "Well, there are two core limitations that we address in the work of Pietro.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1255.233,
    "end": 1270.243,
    "text": "The first one is we use this pixel-wise reconstruction both to learn the model, but also to define your preferred state, like this is the image that you want to see and try to make it happen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1270.99,
    "end": 1278.855,
    "text": " But the problem is that mean squared error in terms of pixels is not really the best metric.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1279.195,
    "end": 1292.223,
    "text": "So for example, if you have the left image and you want to assess how good an image is similar to that one, we have two examples here on the right, and you can see that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1295.827,
    "end": 1306.991,
    "text": " is actually scoring worse in terms of mean squared error than an image where the two joint arm is actually incorrect.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1307.551,
    "end": 1316.254,
    "text": "So although in terms of behavior, the left one is better in terms of mean squared error, the right one is better.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1316.294,
    "end": 1320.775,
    "text": "So that's, of course, problematic if you want to control the arm towards the goal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1321.675,
    "end": 1323.256,
    "text": "And then the second limitation is that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1326.138,
    "end": 1334.589,
    "text": " energy for a huge number of potential trajectories, potential actions you can do, then of course this becomes intractable as the number increases.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1335.35,
    "end": 1339.996,
    "text": "And so the ways that we coped with this in the contrastive work is on the one hand,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1341.167,
    "end": 1345.731,
    "text": " instead of using a pixel-wise reconstruction error, is to use contrastive learning instead.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1346.672,
    "end": 1350.736,
    "text": "How exactly this works will become apparent in the next few slides.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1351.457,
    "end": 1357.622,
    "text": "And then the second thing is, instead of evaluating the expected free energy for all the policies,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1358.743,
    "end": 1361.165,
    "text": " we basically amortize the policy section scheme.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1361.185,
    "end": 1364.927,
    "text": "So we also train neural net to output actions given .",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1366.508,
    "end": 1375.593,
    "text": "And so with that, we can now shift to Pietro, who will talk about the contrastive formulation of the executive inference problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1382.517,
    "end": 1382.998,
    "text": "Thank you, Tim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1385.683,
    "end": 1388.204,
    "text": " All right, so thank you, Daniel, for having us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1388.544,
    "end": 1390.305,
    "text": "And thank you, team.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1390.325,
    "end": 1392.226,
    "text": "I hope you can hear me well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1395.327,
    "end": 1400.03,
    "text": "OK, so I'll try to share my screen now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1404.852,
    "end": 1405.372,
    "text": "OK.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1407.013,
    "end": 1413.436,
    "text": "All right, so now I will talk about our recent work, contrastive active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1414.508,
    "end": 1427.331,
    "text": " So this work was recently published at NeurIPS 2021, so it's very recent, it came out like last month, and let's start delving into it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1428.803,
    "end": 1446.137,
    "text": " So the setting that we discuss in Active Inference is very similar to the reinforcement learning one, with the difference that in reinforcement learning, all behavior learning is driven by rewards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1446.157,
    "end": 1448.92,
    "text": "So the agent receives a reward function",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1449.72,
    "end": 1461.916,
    "text": " And the positive rewards should reinforce positive behaviors, while negative rewards should penalize the agent to avoid those states and actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1462.731,
    "end": 1470.217,
    "text": " However, one of the problems that comes with reinforcement learning is that in order to actually learn from rewards, you need a reward function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1470.458,
    "end": 1472.88,
    "text": "And that's not always easy to have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1473.34,
    "end": 1480.166,
    "text": "For instance, as Tim mentioned, especially when the state is not known in advance, so the agent doesn't exactly know its state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1480.206,
    "end": 1489.974,
    "text": "It's difficult in that case to design a reward function because you're not sure of what the agent knows and how it can assess its performance compared to the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1491.818,
    "end": 1495.041,
    "text": " So we instead focus on active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1495.842,
    "end": 1502.608,
    "text": "In active inference, the agent separates to the principle of minimizing free energy, as we have just seen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1503.009,
    "end": 1508.614,
    "text": "So the principle of minimizing free energy actually enables two things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1508.954,
    "end": 1512.458,
    "text": "The one thing is to learn a model of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1512.678,
    "end": 1516.722,
    "text": "We call this an artificial world model in our work, a steam show.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1517.617,
    "end": 1526.122,
    "text": " And the other objective is to minimize the free energy in the future by trying to achieve some preferred outcomes of the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1526.263,
    "end": 1535.728,
    "text": "So we assume that the agent has some preferred outcome distribution that he wants to achieve, and that his goal will be in the future to actually achieve these preferred outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1538.29,
    "end": 1545.655,
    "text": "So the environment setting we discussed is that one of PONDP, so a partially observable market decision process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1546.624,
    "end": 1552.106,
    "text": " So just to recap, we have observation that the agent receives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1552.266,
    "end": 1555.527,
    "text": "He has to infer the internal state of the environment, which is not observed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1556.028,
    "end": 1567.112,
    "text": "And then there's actions which are actually known for the past, but the agent should infer or somehow choose among a set of possible actions in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1569.028,
    "end": 1573.772,
    "text": " So this is just a summary of what an artificial world model looks like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1573.852,
    "end": 1580.117,
    "text": "So as we've seen in the previous slides, we have an encoder that encodes the information from an observation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1580.257,
    "end": 1582.179,
    "text": "We focus on visual environments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1582.219,
    "end": 1586.882,
    "text": "So here we have, again, an image, which is basically n by n metrics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1587.002,
    "end": 1590.225,
    "text": "So the encoder could be, for instance, a convolutional neural network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1591.155,
    "end": 1598.418,
    "text": " In our case, then we have the hidden state model, which takes the previous state and the previous action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1599.138,
    "end": 1607.882,
    "text": "And in particular, in our case here, we use some form of recurrent neural network model in order to keep preserving the history of the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1608.482,
    "end": 1614.584,
    "text": "And then we have the decoder that computes a reconstruction of the observation of the current state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1614.604,
    "end": 1620.667,
    "text": "So it tries to encode inside the hidden state as much information as possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1621.587,
    "end": 1623.709,
    "text": " from what comes from the observation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1625.13,
    "end": 1632.957,
    "text": "So the problem with reconstruction is that computing them, especially in visual environments, is quite complicated because you need",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1635.342,
    "end": 1654.711,
    "text": " big models that have a very good representational capacity and also the models cannot be 100% accurate as in low dimensional settings because, for instance, predicting an image pixel by pixel is practically very unfeasible, so it very rarely happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1655.531,
    "end": 1657.152,
    "text": "So I'll show an example here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1657.332,
    "end": 1660.894,
    "text": "So a few weeks ago, I was training",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1662.074,
    "end": 1683.661,
    "text": " VAE like models or like a model similar to this one on the left so where we have this encoder decoder architecture on an Atari game the breakout game and try to learn an hidden state to learn action on top of the interstate the problem is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1684.642,
    "end": 1686.884,
    "text": " the reconstruction of the VAE.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1687.124,
    "end": 1692.407,
    "text": "So we're actually pretty bad in that they were losing very important information about the game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1692.487,
    "end": 1709.719,
    "text": "So for instance, it was kind of able, so with some uncertainty, to model where the paddle of the game is, but it wasn't able to model where the ball is, which is actually one of the two most important details in order to actually be able to play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1709.799,
    "end": 1713.641,
    "text": "So even adding the reward function in this case, so adding the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1715.243,
    "end": 1726.932,
    "text": " the game score available and the agent wasn't able to learn the task because of the state which was lacking the most important information in order to keep improving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1727.753,
    "end": 1731.696,
    "text": "So this is one issue that we try to overcome in our work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1732.58,
    "end": 1739.064,
    "text": " And the second part of active inference involves learning to pursue the preferred outcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1739.825,
    "end": 1744.628,
    "text": "So in order to pursue preferred outcomes, active inference agent will do two things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1745.228,
    "end": 1755.315,
    "text": "One, try to minimize the distance with respect to these preferred outcomes, but on the other way, also minimize the ambiguity with respect to the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1757.128,
    "end": 1771.418,
    "text": " So normally this is done by trying to match the two distributions or trying to match, as we saw with a KL divergence, try to match the distribution of the imagined outcome with the preferred outcomes distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1772.438,
    "end": 1780.684,
    "text": "However, again, in a high dimensional setting, this can be quite complex because how do you define a distribution on an high dimensional image?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1781.524,
    "end": 1785.947,
    "text": "Could it be, for instance, just a center Gaussian around the pixel?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1785.987,
    "end": 1786.508,
    "text": "So with the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1787.622,
    "end": 1791.286,
    "text": " with the mean being the pixel value and then some fixed standard deviation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1791.366,
    "end": 1808.702,
    "text": "But in that case, we get into trouble because we have the same issue we discussed before with, for instance, having this kind of goal here and a noisy observation like this, which actually adds an higher mean squared error compared to an image that is very distant from the goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1809.463,
    "end": 1823.928,
    "text": " And this kind of situation, especially when using reconstruction or in more realistic settings, are very, very likely because, for instance, you can think that the center image is actually just a reconstruction of the model, which is not 100% accurate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1824.188,
    "end": 1825.269,
    "text": "So that could be the case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1825.569,
    "end": 1836.713,
    "text": "And indeed, the agent could be confused, and he will think that he's not achieving the goal compared to maybe, for instance, a past observation, but it seemed that it was actually closer to the goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1837.393,
    "end": 1845.439,
    "text": " Or again, when there is some noise in the environment in real world setup, like also robotic, we always have this noise into the observation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1845.499,
    "end": 1851.603,
    "text": "So it's hard to match a preferred outcome in a high dimensional setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1851.883,
    "end": 1854.886,
    "text": "So we also try to overcome this issue here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1855.856,
    "end": 1858.82,
    "text": " So what we do propose is to use contrastive learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1860.021,
    "end": 1869.193,
    "text": "Contrastive learning is a mechanism popular in the unsupervised learning scene that we will discuss more in depth in a few moments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1871.616,
    "end": 1881.306,
    "text": " The objective that we want to have with our method are to avoid reconstruction in learning the word model so we don't have anymore the decoder here as we see on the right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1882.206,
    "end": 1888.573,
    "text": "Then we want to be able to match preferred outcomes in a lower dimensionality space because we have seen that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1889.253,
    "end": 1911.248,
    "text": " in a dimensionality that's problematic and also we we would like the this low dimensional state to be somehow representative of the task so that when we match our goal in this low dimensional state we are actually doing something that actually brings us closer to the actual preferred outcome that we we want to achieve in the high dimensional settings",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1913.559,
    "end": 1923.705,
    "text": " So let's try to compare to see what are the differences between using the likelihood active inference model and the contrastive model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1923.765,
    "end": 1930.528,
    "text": "So the idea in the likelihood active inference model is that we want to maximize the accuracy of reconstruction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1930.648,
    "end": 1940.414,
    "text": "So basically this means that we have this decoder that maximizes this maximum likelihood of the observation given the state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1940.814,
    "end": 1942.095,
    "text": "So we want the state to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1943.035,
    "end": 1949.158,
    "text": " to maximize the information that it contains about the observation, basically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1950.219,
    "end": 1955.901,
    "text": "In contrastive learning, in contrastive active inference, we do something different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1955.941,
    "end": 1970.148,
    "text": "So instead of trying to reconstruct the current observation, we try to compress with the encoder again this observation and compare it to all the other",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1972.029,
    "end": 1980.317,
    "text": " not all the other as we'll see in a while because that's invisible, but many, many other samples that represent something different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1980.497,
    "end": 1990.767,
    "text": "So that in the latent space, in this compressed space, we want our state and the compressed image to be very close.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1991.828,
    "end": 1997.069,
    "text": " while our state should be very distant from all the other images.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1997.249,
    "end": 2013.113,
    "text": "So we are indeed maximizing the similarity with the corresponding sample, this is here called the positive sample, where we want to minimize the similarity, so maximize the distance against all the other samples that are called negative samples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2013.843,
    "end": 2014.784,
    "text": " in contrastive learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2015.044,
    "end": 2022.433,
    "text": "So as we'll see also in a moment, this mechanism here maximizes the lower bound of the mutual information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2022.513,
    "end": 2034.487,
    "text": "So we are basically trying to maximize the information in between corresponding observation and state while minimizing the information with respect to all the other negative pairs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2036.886,
    "end": 2044.389,
    "text": " So as we've seen before, the free energy of the past can be summarized with this equation here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2044.429,
    "end": 2051.332,
    "text": "So here I'm just talking about one time, one moment in discrete time steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2051.532,
    "end": 2058.956,
    "text": "So instead, the team presented for all sequences by using the tilde notation, while here we're just considering one time steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2059.793,
    "end": 2066.487,
    "text": " the time so as we as we have seen the free energy is basically a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2067.677,
    "end": 2072.678,
    "text": " an upper bound on the surprisal information that we want to minimize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2072.738,
    "end": 2078.919,
    "text": "So we minimize free energy in order to minimize the surprisal of the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2079.379,
    "end": 2084.26,
    "text": "And here is actually evident that we have this evidence bound.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2084.28,
    "end": 2087.481,
    "text": "So the scale divergence is always greater or equal to zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2087.521,
    "end": 2095.402,
    "text": "We wanted to basically to reach zero hypothetically in order to minimize this evidence bound.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2096.627,
    "end": 2102.369,
    "text": " And this can also be rewritten in a way that is more practical to implement it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2102.409,
    "end": 2119.095,
    "text": "So by having the likelihood of the observation given the state, which actually means the accuracy of our model, and having, again, the complexity of the model, which is the KL divergence between our variational distribution Q, which we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2121.656,
    "end": 2131.198,
    "text": " We use Q , which is basically using the autoencoding variation of a variational posterior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2131.538,
    "end": 2137.68,
    "text": "So this is as typical as is done in variational autoencoders.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2137.84,
    "end": 2144.982,
    "text": "So when you try to infer the parameters of your posterior distribution by using the corresponding observation,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2145.902,
    "end": 2161.557,
    "text": " And then we want to minimize the KL divergence between this autoencoded posterior and our prior about the current or future state, we can say, given the past state and actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2162.318,
    "end": 2168.764,
    "text": "And in our case in particular, we generally learn this prior, so we don't just use a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2169.932,
    "end": 2178.377,
    "text": " a uniform prior of a state, but we will learn our prior to be predictive of what the state is given the past state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2178.417,
    "end": 2185.662,
    "text": "So it can basically seem like for machine learning practitioner as a conditional variation of the encoder.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2188.212,
    "end": 2201.517,
    "text": " With contrastive learning, what we try to do is, as I said, to maximize state similarity with the correct and corresponding observations of our positive sample while minimizing with the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2201.537,
    "end": 2214.542,
    "text": "This means, again, that we want to maximize the mutual information between the positive sample and the corresponding state and minimizing the information with the negative samples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2215.282,
    "end": 2217.323,
    "text": " this can be written like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2217.424,
    "end": 2233.514,
    "text": "So the noise contrastive estimation, so NCE, that's the abbreviation, basically provides, again, a lower bound on the mutual information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2234.495,
    "end": 2238.438,
    "text": "So where we see that we basically have like a soft max.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2238.558,
    "end": 2240.279,
    "text": "So over all the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2242.967,
    "end": 2244.948,
    "text": " the observational state, what does it mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2244.968,
    "end": 2272.216,
    "text": "So for each pair of state and observation, we want this value, so the value of this critic function f to be as high as possible, or we want it to be very low with respect to the other, so that actually the exponential of this compared to the sum of all the other exponential is higher with the corresponding observation and very low with the rest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2272.964,
    "end": 2282.328,
    "text": " So this is basically saying that you want matching pairs to be very close and distant pairs to a very low value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2288.188,
    "end": 2307.977,
    "text": " This lower bound is an approximation, normally, when we take a number of samples key from a joint distribution that we define between x and y. In particular, in our case, this x and y represent our observation and our hidden states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2309.278,
    "end": 2311.259,
    "text": "So we define a priority.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2313.018,
    "end": 2319.503,
    "text": " this joint distribution to actually represent the fact that this state corresponds to this observation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2319.703,
    "end": 2322.305,
    "text": "And we want to maximize the information in between them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2323.396,
    "end": 2329.76,
    "text": " And this function xy, again, is a so-called critic function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2330.28,
    "end": 2331.241,
    "text": "So what does it mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2331.261,
    "end": 2336.004,
    "text": "It's a function that should approximate this log density ratio that we see here on the right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2336.605,
    "end": 2342.748,
    "text": "I won't go into the mathematical details of this, but basically, it's a mapping of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2344.255,
    "end": 2345.916,
    "text": " of the two inputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2345.956,
    "end": 2349.717,
    "text": "So basically, it's a mapping of our observation and our state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2351.217,
    "end": 2359.1,
    "text": "And we want this, again, these outputs to be i for corresponding pairs and low for non-corresponding pairs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2361.0,
    "end": 2369.703,
    "text": "So how do we transition from the free energy of the past that we've seen to our contrastive formulation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2371.494,
    "end": 2385.539,
    "text": " So the first step that we do is adding to the free energy functional a term that we assume to be constant, that is the entropy of the observation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2385.96,
    "end": 2389.261,
    "text": "So how can we assume that the entropy of the observation is constant?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2389.997,
    "end": 2396.703,
    "text": " So in machine learning, we generally have a data set from which we samples our observation about the past.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2397.244,
    "end": 2404.071,
    "text": "So we assume when we train that our data set so that the distribution over the observation is fixed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2405.342,
    "end": 2416.815,
    "text": " So the entropy of this distribution will always be a constant because we cannot modify that, as opposed, for instance, to the states, which we instead learn.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2416.935,
    "end": 2421.42,
    "text": "So the distribution of our outcomes cannot be modified, and so its entropy is a constant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2421.66,
    "end": 2424.623,
    "text": "If we add this term to the free energy functional,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2425.484,
    "end": 2436.408,
    "text": " we can rewrite it as the KL divergence minus this information gain or mutual information term here between the states and the observation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2437.909,
    "end": 2454.615,
    "text": "So given this, we can now apply the fact that contrastive learning functionally is a lower bound on the mutual information to actually derive the free energy of the past",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2455.868,
    "end": 2461.952,
    "text": " we're expliciting all the terms out according to the previous slide math.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2462.612,
    "end": 2465.874,
    "text": "We basically have, again, this KL divergence term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2466.174,
    "end": 2477.781,
    "text": "And then we have this, the value of F between O and S to maximize and then to minimize all the, again,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2481.522,
    "end": 2485.987,
    "text": " the value of the function with respect to all the other negative pairs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2488.41,
    "end": 2491.153,
    "text": "So this brings us to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2492.961,
    "end": 2495.501,
    "text": " Again, an upper bound on the surprisal term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2495.741,
    "end": 2503.923,
    "text": "We see that this upper bound is actually even higher than the normal free energy upper bound.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2504.103,
    "end": 2522.286,
    "text": "But as we'll see later, these are some nice properties that explicitly help us to get rid of the reconstruction and to learn a different representational space that has some advantages compared to the likelihood-based representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2524.597,
    "end": 2532.119,
    "text": " So let's now talk about how can we learn to behave using contrastive active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2532.299,
    "end": 2542.401,
    "text": "So in the likelihood-based active inference model, what we were trying to maximize was, again, the likelihood of the future observation, but under the preferred distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2542.841,
    "end": 2551.523,
    "text": "So we want the imagined outcomes to be as close as possible to the outcomes that we prefer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2554.271,
    "end": 2569.756,
    "text": " So this, for visual environment, implies that we reconstruct what we imagine will happen in the high-dimensional space, so the image, basically, and then we compare it to our preferred image, for instance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2570.596,
    "end": 2582.78,
    "text": "And as we said before, we can, for instance, use a max mean squared error distance, or we can just use like, we can use a Gaussian and compute the likelihood under the preferred distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2584.158,
    "end": 2597.545,
    "text": " For contrastive active inference, we again instead use a contrasting mechanism when we want now the future state to be corresponding with our samples from the preferred distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2597.605,
    "end": 2604.648,
    "text": "So we want the outcomes that we prefer to actually be close to the state that we imagine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2604.828,
    "end": 2611.372,
    "text": "So that now we don't need anymore to reconstruct what the outcome of our action will look like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2611.872,
    "end": 2612.912,
    "text": "But we can just say is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2614.193,
    "end": 2627.099,
    "text": " the state that we imagine matching with the preferred outcome that they want to achieve and that's what we maximize similarity with and again we also have some",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2627.975,
    "end": 2636.604,
    "text": " some form of ambiguity minimization or epistemic value in trying to minimize the similarity respect to other outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2636.824,
    "end": 2649.376,
    "text": "So in this case, minimizing the similarity respect to outcomes that are not in the preferred distribution basically means that you either want to go far from something that you have already seen before,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2650.637,
    "end": 2654.159,
    "text": " in order to maybe get closer to the preferred outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2654.799,
    "end": 2658.1,
    "text": "Or you either just want to minimize your ambiguity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2658.12,
    "end": 2668.565,
    "text": "So you want to be as far as possible from other outcomes and as close as possible to the actual preferred outcome that you're hoping for.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2670.185,
    "end": 2675.367,
    "text": "So as we've seen before, the expected free energy can be summarized like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2675.387,
    "end": 2677.648,
    "text": "I'll first highlight some difference with respect to the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2680.29,
    "end": 2706.961,
    "text": " equation the team presented so first of all here we we take action to be part of the of the active inference process so the inference process well uh before we have seen that you can you can have a distribution of our policies and then you can you can sample the action from the policy and and compute the free energy of the future a given a posterior on your",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2709.002,
    "end": 2710.683,
    "text": " on a policy, on a given policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2710.824,
    "end": 2727.759,
    "text": "Instead here we make the actions part of the generative model for the future and we actually want the agent to infer the action from the future and not just compute them as a posterior over some distribution of the policies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2728.638,
    "end": 2745.347,
    "text": " So we have now in the posterior this AT that we infer both the future state and the future action, and also the prior over the preferred outcomes that I indicate with tilde.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2745.547,
    "end": 2751.07,
    "text": "I hope that's not confusing, because before, the tilde was used to indicate sequences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2752.111,
    "end": 2755.313,
    "text": " In the paper, I actually used it to indicate the preferred outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2755.613,
    "end": 2759.235,
    "text": "So yeah, notation issues, but I hope that's not confusing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2759.255,
    "end": 2766.64,
    "text": "So the tilde here is basically to say this is the preferred distribution over observation, state, and action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2766.7,
    "end": 2771.763,
    "text": "So this is basically our target distribution, what we hope to achieve in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2772.623,
    "end": 2774.864,
    "text": "And we can rewrite this as a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2775.959,
    "end": 2777.721,
    "text": " as the sum of three terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2777.861,
    "end": 2778.902,
    "text": "So we have this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2779.703,
    "end": 2791.534,
    "text": "So first of all, I'm assuming that the agent has no prior preference on action so that for him, any action that will bring it to the preferred outcomes, it's fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2791.674,
    "end": 2794.417,
    "text": "So he has a uniform prior of action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2794.617,
    "end": 2799.942,
    "text": "So the action doesn't really matter with this as long as it brings to the goal, let's say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2800.72,
    "end": 2805.083,
    "text": " And so in this way, we obtain an action entropy term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2805.443,
    "end": 2812.127,
    "text": "And then the rest, the intrinsic value, is the same epistemic value that we've seen before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2812.707,
    "end": 2822.593,
    "text": "And so the one that should lead the agent to explore the environment more or either to reduce its ambiguity about the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2823.134,
    "end": 2828.617,
    "text": "And then we have the extrinsic value, which is basically rewards or just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2831.235,
    "end": 2834.819,
    "text": " just a way to get closer to the actual preferred outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2835.039,
    "end": 2841.407,
    "text": "So the value to pursue in order to minimize distance from the preferred outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2843.354,
    "end": 2850.923,
    "text": " In our contrastive expected free energy, we again do a similar move as we did from the past.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2851.123,
    "end": 2856.91,
    "text": "So here we assume that we are taking expectation over our preferred outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2857.05,
    "end": 2861.074,
    "text": "Since we don't imagine outcomes in the future, we just assume that the outcomes will",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2861.94,
    "end": 2872.071,
    "text": " will be according to the preferred outcome distribution so that we can, again, sum the entropy over our fixed preferred outcome distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2872.812,
    "end": 2874.453,
    "text": "And then the steps are the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2874.553,
    "end": 2883.142,
    "text": "So we have, again, this mutual information term between the preferred outcomes and the state that we imagine in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2883.763,
    "end": 2893.555,
    "text": " and the action entropy term and the scale divergence between the posterior over states and the prior over states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2893.835,
    "end": 2901.544,
    "text": "So it's a complex term, I'll say, because it basically should represent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2902.636,
    "end": 2910.142,
    "text": " the difference between what the agent believes it will happen and what is supposed to happen in the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2910.462,
    "end": 2916.227,
    "text": "So normally in active inference, we assume for the future that the model of the world is correct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2917.008,
    "end": 2921.011,
    "text": "So that the agent does not control over his world model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2921.071,
    "end": 2926.955,
    "text": "So it cannot change how the environment dynamics will transition from one state to another.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2928.597,
    "end": 2933.481,
    "text": " I'm assuming here that this scale divergent term is actually zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2933.902,
    "end": 2950.797,
    "text": "Though I've seen that some work this could also be left being greater than zero, but then it's basically having the agent imagine that it can violate the impairment dynamics, hoping for a better dynamics that it will allow it to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2952.058,
    "end": 2958.261,
    "text": " to be optimistic and think, yeah, the thing that I imagine will happen is actually going to happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2958.861,
    "end": 2965.044,
    "text": "So here, we don't allow the agent to modify how the environment moves from one state to another.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2965.104,
    "end": 2973.047,
    "text": "And we just assume, yeah, the dynamics environment, so our posterior over the transition dynamics of the environment is correct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2973.147,
    "end": 2974.708,
    "text": "And so the scale diverges in zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2975.128,
    "end": 2978.53,
    "text": "And then our objective, again, doing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2980.043,
    "end": 2991.318,
    "text": " applying the contrastive learning lower bound translates into this, when we have this contrastive mutual information between the preferred outcomes and this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2992.762,
    "end": 2994.083,
    "text": " this action entropy term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2994.444,
    "end": 3006.436,
    "text": "So if you write it out explicitly, we again have these two terms, which kind of reminds the two extrinsic value and intrinsic value for the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3006.536,
    "end": 3010.26,
    "text": "So we have the term that actually should",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3012.277,
    "end": 3023.025,
    "text": " minimize the similarity with the negative sample that is doing something similar to what the intrinsic value in active inference should do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3023.145,
    "end": 3035.674,
    "text": "So basically trying to be distant from previously seen outcomes is kind of similar to explore the environment, to minimize your ambiguity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3035.694,
    "end": 3040.758,
    "text": "So try to find something that gives you more information, not something that you have already seen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3042.731,
    "end": 3051.44,
    "text": " And so the world model can be summarized in these three main components that we learn.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3051.98,
    "end": 3066.814,
    "text": "We have our prior network that, as I said before, is learned and should learn the transition dynamics of the environment, so trying to predict future states given past states and actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3067.853,
    "end": 3073.655,
    "text": " And then we have this GRU cell that is shared between the prior and the posterior network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3073.755,
    "end": 3078.217,
    "text": "And this is what allows us to bring our history with us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3078.237,
    "end": 3086.881,
    "text": "So just not stop to the previous state, but also to include some information about previous states so that we have more information available in order to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3087.301,
    "end": 3090.122,
    "text": " infer what the current state actually is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3090.842,
    "end": 3096.964,
    "text": "Then we have our posterior network, which also has access to the observation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3097.264,
    "end": 3103.106,
    "text": "And this posterior CNN, as I mentioned, is a convolutional neural network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3103.55,
    "end": 3109.599,
    "text": " And yeah, here we have the actual layer description for our environment, which are 64 by 64.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3110.38,
    "end": 3112.243,
    "text": "But yeah, that's less important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3112.263,
    "end": 3117.931,
    "text": "The important thing is that we have a convolutional model that compresses the information from the observation for us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3118.872,
    "end": 3131.383,
    "text": " And this same convolutional network is also linked to the representation model that is the critic of the contrastive learning mechanism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3131.483,
    "end": 3143.594,
    "text": "So the function that is indeed matching states and the observation in order to learn a good contrastive learning representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3145.225,
    "end": 3160.932,
    "text": " So the function that we minimize with respect to the past is our contrasting free energy of the past summed over an arbitrary number of discrete time steps over past sequences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3162.113,
    "end": 3169.857,
    "text": "It is important to say that for the past, the negative samples that we take are an observation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3173.359,
    "end": 3177.202,
    "text": " of the same sequence of the corresponding observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3177.222,
    "end": 3179.964,
    "text": "So let's say that we have an observation in the States.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3180.384,
    "end": 3192.034,
    "text": "The negative samples will be all the other observations within the same sequence that are not the same in time, but also observations that come from other sequences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3193.018,
    "end": 3200.281,
    "text": " So that we're basically contrasting the current state with different time steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3200.521,
    "end": 3209.724,
    "text": "So what happened in different moment of the same sequence of actions and what happened in different situations or different sequences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3210.565,
    "end": 3216.887,
    "text": "And that's how we try to foster our contrastive learning mechanism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3218.595,
    "end": 3220.036,
    "text": " Then we have the action model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3220.056,
    "end": 3223.177,
    "text": "So for our action model, we have two networks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3223.577,
    "end": 3231.961,
    "text": "One is the so-called action network, which basically infers the action to take a given state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3232.122,
    "end": 3234.363,
    "text": "And then we have this expected utility network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3234.423,
    "end": 3241.286,
    "text": "And this helps us pursuing what the team anticipated so that the fact that we are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3244.349,
    "end": 3259.955,
    "text": " amortizing the action selection process for very long-term sequences by using a network that should estimate what the value of a certain state is in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3261.495,
    "end": 3265.637,
    "text": "So I'll try to be more clear here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3265.697,
    "end": 3267.897,
    "text": "So basically, you have the action network",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3270.444,
    "end": 3285.075,
    "text": " minimize this g lambda t functional that is basically an estimate of how much value is in a certain states",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3286.314,
    "end": 3288.356,
    "text": " And how do we get this estimate?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3289.096,
    "end": 3293.94,
    "text": "So this estimate is provided by this formula here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3294.5,
    "end": 3303.207,
    "text": "So basically, at every step, we provide the actual expected contrastive free energy for that state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3303.567,
    "end": 3305.449,
    "text": "And then for the future,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3307.51,
    "end": 3324.876,
    "text": " we sum, we compromise in between an estimate of what the network will predict is going to be the value in the future and the value itself that we are computing with the functional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3325.496,
    "end": 3331.638,
    "text": "So that at every step, we basically sum the value that we expect in that step",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3333.198,
    "end": 3349.707,
    "text": " We bootstrap, that's the way we normally say in reinforcement learning, so we apply some form of dynamic programming approach to sum this value with what we expect will happen in the future, and we use this as our",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3350.467,
    "end": 3352.409,
    "text": " target for learning the estimate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3352.609,
    "end": 3359.135,
    "text": "So we basically have the estimate and the estimate of the future plus the current value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3359.676,
    "end": 3360.537,
    "text": "And we compare the two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3360.577,
    "end": 3368.324,
    "text": "And we want the actual estimate to be closer to what is actually happening plus the future estimate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3369.565,
    "end": 3382.335,
    "text": " And this is actually what is normally done in reinforcement learning when you apply the so-called Bellman equation in order to estimate what's going to happen in the future by using what you actually know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3382.355,
    "end": 3392.903,
    "text": "So generally like the rewards and in our case the explicit free energy value and what you already can estimate for the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3395.994,
    "end": 3407.948,
    "text": " So in our experiments, we compare four flavors that make for reinforcement learning using likelihood model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3408.564,
    "end": 3410.806,
    "text": " This is Dreamer, the Dreamer baseline.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3410.946,
    "end": 3419.294,
    "text": "So it does a likelihood-based learned word model, and it uses rewards for learning action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3419.434,
    "end": 3423.317,
    "text": "So the reward function is already given to the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3423.637,
    "end": 3425.959,
    "text": "And then we compare with contrastive Dreamer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3426.22,
    "end": 3429.743,
    "text": "It is a modification of Dreamer using contrastive",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3430.403,
    "end": 3432.845,
    "text": " a learning for this word model instead of reconstructions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3433.486,
    "end": 3443.194,
    "text": "And then we compared the two flavors of active inference, the standard, let's say one, with the likelihood reconstruction model and our contrasting formulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3445.596,
    "end": 3450.66,
    "text": "So we use similar architecture and training routine for all the four baselines.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3450.921,
    "end": 3457.006,
    "text": "And the training routine can be summarized as we see here in pseudocode.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3458.098,
    "end": 3468.321,
    "text": " So for a certain amount of number of training steps that we fix in advance, we are going to train our world model on the previous experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3468.561,
    "end": 3474.343,
    "text": "So on a replay buffer that basically represents our data sets of past experiences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3475.544,
    "end": 3493.165,
    "text": " Then we are going to use the trained word model to imagine some trajectories in the future by using our action model and the replay buffer as well, which is used because we need to take the negative samples for the contrastive free energy functional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3494.632,
    "end": 3506.421,
    "text": " And then on the imagined trajectories, we are going to train our action model in order to actually try to pursue the preferred outcomes better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3507.402,
    "end": 3522.753,
    "text": "And then we are going to go back to the environment, collect a new trajectory using our word model to infer what the hidden state of the environment is at every time step, and using the action model to select the action according to the state that we inferred.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3523.567,
    "end": 3528.151,
    "text": " and just collect the trajectory to the data set.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3528.652,
    "end": 3529.833,
    "text": "And we do this continuously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3529.893,
    "end": 3549.831,
    "text": "So train the word model, imagine some trajectories, and train the action model, and again, keep collecting so that we continuously improve both the data collection process, because the word model and the action model gets better, and also our model indeed, so that we get closer to the goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3552.091,
    "end": 3566.121,
    "text": " So one important insight that I first introduced before getting into an empirical evaluation of the method is the fact that using contrastive learning strongly reduces the computational requirements of the model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3566.882,
    "end": 3573.486,
    "text": "So here I am comparing the number of million multiplied accumulation operations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3575.268,
    "end": 3597.91,
    "text": " for our models and the number of parameters that we as we see these are much lower when we use a contrastive mechanism compared to using a likelihood model and this is also reflected in term of work clock time so our model is quite faster compared to dreamer that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3599.847,
    "end": 3624.398,
    "text": " that trains the likelihood-based model for the world that uses just three words for learning action and is much, much faster than the likelihood active inference model because the likelihood active inference model, other than having to do the reconstruction during the world model training, also has to imagine the high-dimensional outcomes in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3624.918,
    "end": 3638.654,
    "text": " So in that case, you have even more computation because for every imagined trajectory, you have to imagine all the possible images in our context that you will get pursuing a certain policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3639.395,
    "end": 3642.439,
    "text": "So our model is quite faster than that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3644.071,
    "end": 3649.115,
    "text": " So the first task that I will discuss is a simple mini-grid task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3649.636,
    "end": 3660.525,
    "text": "So the agent represents the red arrow that will navigate a black grid in order to reach a green square that is placed in one of the corners of the grids.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3661.346,
    "end": 3668.552,
    "text": " So the environment is partially observed because the agent doesn't know what's in every pixel of the grid.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3668.652,
    "end": 3681.963,
    "text": "So in order to find the goal first, you should explore the whole grid and find the green square, or at least be in a position that allows him to see the green square in front of him.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3682.803,
    "end": 3685.826,
    "text": "So for the reward model, of course,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3687.347,
    "end": 3691.531,
    "text": " We have the highest reward and in correspondence of the goal state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3691.551,
    "end": 3698.057,
    "text": "So when the agent is actually on the goal square, it will receive a reward of plus one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3698.698,
    "end": 3700.76,
    "text": "And this is a sparse reward task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3700.78,
    "end": 3705.324,
    "text": "So for all the other states, the agent will just receive zero rewards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3706.125,
    "end": 3709.228,
    "text": "So it will be just encouraged to reach the goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3710.643,
    "end": 3719.566,
    "text": " Well, for active inference method, the way that I chose to define the preferred outcome is to have an image of the agent that sees himself on the goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3720.067,
    "end": 3725.809,
    "text": "So basically the agent sees himself on the goal and says, this is the position that they want to reach in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3727.307,
    "end": 3732.609,
    "text": " And let's see what happens from a qualitative level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3732.669,
    "end": 3742.773,
    "text": "So as I said before, the rewards for this task is just a plus one in the right square, in the goal square.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3743.534,
    "end": 3746.395,
    "text": "What happens for the active inference model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3746.435,
    "end": 3756.379,
    "text": "So what will the active inference model provide as a value of a certain state to the agents in order to pursue the preferred outcome?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3757.319,
    "end": 3771.452,
    "text": " So we see that the likelihood active inference that is imagining the outcome and comparing it to the preferred images is actually giving a very high value for the right square.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3775.063,
    "end": 3777.003,
    "text": " In a scale from 0, 1, we can say that's a 1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3777.264,
    "end": 3777.984,
    "text": "Oh, sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3778.804,
    "end": 3779.785,
    "text": "We can say that's a 1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3780.065,
    "end": 3791.789,
    "text": "But other than that, the function it is providing is a bit confusing because it is giving some higher rewards in the centers compared to the, let's say,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3795.811,
    "end": 3816.614,
    "text": " the last row and column that are the one that leads to the final goal the other corner are not even close to the goal one so it's just providing a perfect match and we have no control of what the distance the goal is because for the perfect match the goal that's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3817.535,
    "end": 3820.377,
    "text": " that is indeed the correct value that it is providing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3820.417,
    "end": 3827.121,
    "text": "But other than that, it's difficult to understand what the likelihood active inference model is providing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3827.341,
    "end": 3831.964,
    "text": "With the contrastive active inference, we see that there is a different pattern.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3832.344,
    "end": 3837.007,
    "text": "So the agent is providing a very low value for the center.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3837.087,
    "end": 3842.19,
    "text": "So it's understanding that the center is, of course, not what it wants to see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3843.05,
    "end": 3846.173,
    "text": " But then it's providing high values to all the corners.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3846.753,
    "end": 3858.063,
    "text": "And in particular, the highest value is provided to the right corner, so the one with the goal, because it's, of course, the one that corresponds the most with what we want to achieve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3858.163,
    "end": 3860.204,
    "text": "But then all the other corners also have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3860.945,
    "end": 3861.826,
    "text": " a very high value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3862.326,
    "end": 3875.013,
    "text": "And the fact is that I would say that the contrastive active inference is probably capturing more, I would say, semantic information about the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3875.173,
    "end": 3886.4,
    "text": "So in order to distinguish a corner from a center of tile is actually modeling the fact that there is a corner in a certain state of the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3887.16,
    "end": 3893.622,
    "text": " And when it looks at the preferred outcome image, it actually says, first of all, this is a corner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3894.402,
    "end": 3895.663,
    "text": "And that's the way it distinguishes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3895.823,
    "end": 3902.665,
    "text": "And then there is the green tile where the agent is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3903.685,
    "end": 3915.489,
    "text": "So from a value perspective, we can say that a corner is closer in semantics with respect to a central tile to our goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3916.024,
    "end": 3921.23,
    "text": " And then, of course, when you also have the green tile, which represents the goal, then you are the closest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3922.171,
    "end": 3929.48,
    "text": "So this is, of course, a bit risky because it can also lead to suboptimal behavior in some cases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3929.78,
    "end": 3934.706,
    "text": "But with good exploration of the environment, it will work through.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3935.652,
    "end": 3941.115,
    "text": " lead to the optimal behavior because still the maximum value is still provided correctly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3941.195,
    "end": 3943.036,
    "text": "So it's still the value for the right corner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3943.096,
    "end": 3949.319,
    "text": "But if you didn't see the other corner, the agent will just go to another corner and say, okay, this looks similar to the goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3949.659,
    "end": 3953.682,
    "text": "So I'm trying to do something similar to what I would like to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3954.382,
    "end": 3957.804,
    "text": "If I didn't see anything else this closer, this is my goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3958.504,
    "end": 3959.284,
    "text": " the best I can do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3959.905,
    "end": 3967.489,
    "text": "So this highlights how exploration is important in order to achieve preferred outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3967.609,
    "end": 3971.811,
    "text": "And I think that also applies to likelihood-active inference as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3972.291,
    "end": 3978.854,
    "text": "Because if you didn't see the goal, you just had some noisy signal in the center.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3978.914,
    "end": 3981.736,
    "text": "So you wouldn't be able to reach the goal as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3983.854,
    "end": 3986.556,
    "text": " And then here we quantify the performance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3986.957,
    "end": 4004.092,
    "text": "We see that with the likelihood active inference, the agent struggles to reach the goal consistently, while our method leads to consistent performance that are in line with the reward-based baselines.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4004.252,
    "end": 4007.515,
    "text": "Of course, the reward-based baseline have an advantage because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4009.048,
    "end": 4011.849,
    "text": " during training, they always have a filtered objective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4011.889,
    "end": 4019.553,
    "text": "So even if their model is not correct, they always have this reward function, filtered function that tells them, yes, this is where you need to go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4019.613,
    "end": 4027.017,
    "text": "Well, our model can take a little bit more time in order to first have a good model and then being able to match.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4027.277,
    "end": 4037.843,
    "text": "But with the contrastive mechanism, this process actually happens fast and leads to consistent performance with likely the active inference we see that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4039.523,
    "end": 4046.766,
    "text": " It will probably take more time to converge or it just leads to suboptimal behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4046.786,
    "end": 4049.887,
    "text": "So it's just inconsistent according to our evaluation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4050.828,
    "end": 4055.249,
    "text": "And yeah, these are two different grid environments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4055.689,
    "end": 4057.35,
    "text": "One is smaller, one is bigger.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4057.41,
    "end": 4062.172,
    "text": "But yeah, the results are very similar in terms of performance obtained.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4063.783,
    "end": 4078.875,
    "text": " Then the other task that we discuss is a continuous control task with a 2D planar environment where a robotic arm will penetrate a sphere goal, so the red sphere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4079.916,
    "end": 4103.678,
    "text": " and this sphere is bigger in the the so-called richer easy environment which is the one for which we see the preferred outcome on the left and it is smaller for the for the so-called richer art environment that is the one that we we see in the on the right so for a reward based agent we have the reward function that provides",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4106.004,
    "end": 4110.213,
    "text": " when the agent penetrates the sphere fully, a reverse of one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4110.474,
    "end": 4111.356,
    "text": "Otherwise, when it's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4113.144,
    "end": 4121.468,
    "text": " off-penetrating or just partially penetrating the sphere, it provides a dense reward that tells you, yeah, you're getting closer to the goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4121.548,
    "end": 4133.352,
    "text": "So in this case, the reward function is actually helping the agent a bit more because it's telling him that he's getting closer to the goal and he should just try in the neighbor area.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4134.173,
    "end": 4141.316,
    "text": "While for active inference, we just provide the preferred state in the environment, which is...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4142.657,
    "end": 4144.299,
    "text": " the agent penetrating the gold sphere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4144.359,
    "end": 4146.782,
    "text": "And let's see what happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4147.263,
    "end": 4152.169,
    "text": "So again, we have a similar pattern actually",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4153.188,
    "end": 4155.689,
    "text": " Yeah, similar but different from the previous one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4155.729,
    "end": 4165.055,
    "text": "So in this case, the mean squared error distance from the goal is actually more confusing, as we've seen in previous example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4165.755,
    "end": 4176.061,
    "text": "So the likelihood active inference agent totally fails to reach the goal because probably all the states look alike in the environment because the background stays the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4176.521,
    "end": 4180.744,
    "text": "So the background is not moving as it was happening, for instance, for the mini-grid environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4181.728,
    "end": 4184.15,
    "text": " The goal is always in the same position.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4184.17,
    "end": 4190.934,
    "text": "So the difference between two images is just provided by the few yellow pixels that move around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4190.954,
    "end": 4200.521,
    "text": "And if the model is not imagining perfectly where these pixels go, it's very difficult that it will provide some informative objective for the stars.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4201.491,
    "end": 4207.315,
    "text": " Instead, our contrastive active inference agent is able to provide an informative goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4207.896,
    "end": 4219.284,
    "text": "And apparently, the fact that it's providing some semantic information about the task is actually helping it to converge even faster than the reward-based baseline.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4219.324,
    "end": 4225.869,
    "text": "Because the reward-based agents have access to rewards just when they're close to the goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4226.009,
    "end": 4230.052,
    "text": "But the contrastive active inference provides a reward function everywhere in the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4230.572,
    "end": 4239.52,
    "text": " So when we see that the arm is very far, we have the mutual information term that should basically take over and tells you, yeah, you don't",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4240.365,
    "end": 4241.826,
    "text": " want to stay there, go elsewhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4242.506,
    "end": 4248.328,
    "text": "And until we eventually find the goal sphere and we converge to the correct behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4248.928,
    "end": 4252.85,
    "text": "So the agent is actually converging a bit faster than the other baselines.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4252.91,
    "end": 4261.993,
    "text": "And then, yeah, the contrastive dreamer baseline is converging a bit faster than dreamer one because its model is faster to learn because it's contrastive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4264.438,
    "end": 4279.975,
    "text": " so this is what actually happens these are gif on the right at some point they should they should reset so basically we just see here that the task is uh is correctly executed so that the agent is uh is able to match the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4281.551,
    "end": 4282.532,
    "text": " the correct behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4283.112,
    "end": 4286.355,
    "text": "So yeah, this is taking a bit longer than expected.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4286.395,
    "end": 4296.243,
    "text": "But yeah, you can see that, for instance, in the R task, the agent oscillates around the current behavior, but it keeps saying, okay, here we see it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4296.903,
    "end": 4303.546,
    "text": " So basically, the environment is oscillating in a position that is very close to the goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4303.626,
    "end": 4314.731,
    "text": "So it tries to stay as much as possible to that point and not be driven far from the goal by the inertia of the arm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4318.12,
    "end": 4324.285,
    "text": " Then we analyze qualitatively what's happening in terms of the value is provided to the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4324.305,
    "end": 4329.628,
    "text": "So what is the objective that is given to the agent in order to learn here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4330.589,
    "end": 4340.416,
    "text": "And as I try to explain, the reward is somewhere in the middle between 0 and 1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4341.539,
    "end": 4347.844,
    "text": " when the agent is partially penetrating the goal, and it's totally 1 when the agent is fully penetrating the goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4348.064,
    "end": 4349.706,
    "text": "In all the other situations, it is 0.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4351.527,
    "end": 4360.535,
    "text": "For the active inference likelihood-based model, we see that the signal is very close for all the states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4361.235,
    "end": 4364.238,
    "text": "So the agent basically thinks that there is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4365.074,
    "end": 4372.338,
    "text": " very little difference between being very close to the goal and being actually very far off from the goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4372.878,
    "end": 4379.341,
    "text": "And that's likely the reason why it's not converging to the optimal behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4379.361,
    "end": 4389.827,
    "text": "For contrastive active inference instead, we see that the agent is provided an objective value somewhat in between 0 and 1 when it's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4393.661,
    "end": 4398.089,
    "text": " not close to the goal and something that is very close to one when it's in the goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4398.129,
    "end": 4405.483,
    "text": "And in particular, when it's closer to the goal, the value is actually a bit higher than when it's far off.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4406.44,
    "end": 4416.209,
    "text": " So we see that there is, again, some semantic information provided, which is the actual distance of the arm from the right goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4416.47,
    "end": 4427.901,
    "text": "Or we can just see it as the contrastive learning mechanism saying, OK, this pose of the arm is actually very different from the one that I hope to obtain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4427.921,
    "end": 4431.244,
    "text": "So let's try to move to a pose that is actually closer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4432.679,
    "end": 4441.045,
    "text": " And we indeed obtain higher values when the pose is similar to the one that we want to achieve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4442.466,
    "end": 4455.996,
    "text": "So we exploit the fact that some semantic information is provided to the agent by using contrastive learning to work on a more difficult setup, the richer distracting environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4456.863,
    "end": 4462.887,
    "text": " So in the research destructing task, we have the same objective as before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4462.927,
    "end": 4467.931,
    "text": "So we want the agent to reach the goal by penetrating the red sphere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4467.991,
    "end": 4475.576,
    "text": "But now we have varying backgrounds, and we have destructuring the environment, which could be just altered colors on the tilted camera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4476.497,
    "end": 4481.52,
    "text": "And we still want to achieve the agent to penetrate the sphere despite that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4481.88,
    "end": 4484.202,
    "text": "So for the real world-based agents,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4485.342,
    "end": 4505.395,
    "text": " The reward is the same as before, so being provided for the agent penetrating the goal sphere, while for active inference, the goal here is actually a bit troublesome to define because given the fact that the background is constantly varying across different episodes, we cannot a priori define what's the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4508.274,
    "end": 4510.395,
    "text": " what the preferred outcome looks like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4510.815,
    "end": 4523.598,
    "text": "So instead of doing that, we attempted providing a more neutral preferred outcome, with the agent seeing itself achieving the goal, but with the standard task background.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4523.758,
    "end": 4532.421,
    "text": "So we have the blue background with the arm penetrating the goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4532.541,
    "end": 4536.482,
    "text": "And we aim for this preferred outcome to transfer",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4537.422,
    "end": 4557.545,
    "text": " uh to the to the distracting setup this is of course pretty much impossible for for the likelihood active inference model because of course it's trying to match this in uh with a mean squared error like uh function so of course the the signal provided would be very confusing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4558.967,
    "end": 4565.431,
    "text": " Very interestingly, we see here that also the Dreamer method fails because it's based on likelihood-based models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4565.652,
    "end": 4572.936,
    "text": "And as we'll see, reconstructing all the variations in the environment is very difficult.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4573.577,
    "end": 4584.844,
    "text": "So the reconstruction-based world model struggles to provide informative states of the environment, while the contrastive learning-based models succeed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4584.884,
    "end": 4586.405,
    "text": "And in particular, it's very interesting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4586.565,
    "end": 4590.507,
    "text": " that our model was able to actually achieve the goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4590.687,
    "end": 4603.834,
    "text": "Here we see less consistency than before, so there is a higher variance, but still the agent is often able to reach the correct position despite all the difference in the background and all the destruction present in the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4603.854,
    "end": 4605.735,
    "text": "So we see that the representation is actually",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4610.718,
    "end": 4617.965,
    "text": " learning what the pose of the robot should be and trying to match it in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4619.466,
    "end": 4623.069,
    "text": "And then here we see some videos what's happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4623.209,
    "end": 4633.178,
    "text": "So we see here indeed that the arm is oscillating a bit more, so it's actually a bit more difficult for him to assess that he's doing the right thing, but still the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4634.4,
    "end": 4640.49,
    "text": " The behavior obtained is still quite good, I would say, so it's pretty much achieving the goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4643.092,
    "end": 4648.973,
    "text": " And this shows why a likelihood-based model will fail in this environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4649.033,
    "end": 4663.416,
    "text": "So here we compare the ground truth in the different varying backgrounds and what the DREAMers or the likelihood active inference model sees through the reconstruction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4663.716,
    "end": 4670.818,
    "text": "So we see that either reconstructing from the posterior state or from the prior state, the agent cannot",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4671.397,
    "end": 4678.063,
    "text": " perfectly model important information of the environment, which in this case is the arm pose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4678.143,
    "end": 4688.672,
    "text": "So it sees where the first link of the robot arm is, but it is not able to see normally where the second part of the arm is because it's very uncertain about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4689.471,
    "end": 4702.195,
    "text": " And that leads the agent to not being able to actually assess where it is in the environment and to provide the right value for what's going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4702.255,
    "end": 4714.239,
    "text": "So using reconstruction in this environment leads to this kind of problem where the agent is not certain about the internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4714.599,
    "end": 4718.661,
    "text": "And so it's uncertain of what it should do next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4719.807,
    "end": 4723.59,
    "text": " because the signal of the state is uncertain, is confused.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4723.91,
    "end": 4730.975,
    "text": "And so it is also the value provided to the agent by the model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4732.509,
    "end": 4734.17,
    "text": " And that's it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4734.31,
    "end": 4737.131,
    "text": "So I'll just briefly summarize what we have seen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4737.151,
    "end": 4746.735,
    "text": "And so basically, we used a contrastive model to reduce the computation of active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4746.815,
    "end": 4749.856,
    "text": "This also brought some advantages in reinforcement learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4749.896,
    "end": 4756.099,
    "text": "But yeah, we focused on the active inference area where this model brought to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4756.639,
    "end": 4764.543,
    "text": " to a twofold advantage, both in learning the word model faster, but also in imagining further trajectories faster because you don't have the reconstruction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4766.224,
    "end": 4771.786,
    "text": "Then we saw that the contrast representation learned features that better capture relevant information for the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4772.066,
    "end": 4784.052,
    "text": "And this was key in solving both the richer task and especially in the richer distracting task, where without this feature, we wouldn't be able to solve the task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4786.212,
    "end": 4799.725,
    "text": " And then we show that we can use this method to provide performance that are similar to engineering rewards, but in a much easier way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4799.785,
    "end": 4805.951,
    "text": "So you can just say, OK, this is what I want to achieve in the environment, provide the observation to the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4806.531,
    "end": 4822.979,
    "text": " and the agent will find itself a way to reach that state without actually having to provide a rework function for every possible states of the environment, which especially in realistic cases is usually unfeasible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4825.037,
    "end": 4840.004,
    "text": " And finally, we have also seen that the exploration is very key for our method to work because we don't want the agent to converge to a suboptimal behavior that looks like the right outcome, the preferred outcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4840.044,
    "end": 4850.348,
    "text": "So it's very important to wisely explore the environment before actually delving into learning our preferred policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4851.128,
    "end": 4854.55,
    "text": "And we aim to look more into this in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4856.343,
    "end": 4857.904,
    "text": " So thank you very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4859.444,
    "end": 4860.605,
    "text": "That was it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4861.005,
    "end": 4863.566,
    "text": "I don't know if there's any questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4866.868,
    "end": 4867.788,
    "text": "Thank you both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4867.968,
    "end": 4870.309,
    "text": "Very interesting presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4870.71,
    "end": 4877.033,
    "text": "So if anyone watching live wants to ask a question, otherwise I have a few.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4877.953,
    "end": 4881.875,
    "text": "So you mentioned a critic model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4883.035,
    "end": 4887.777,
    "text": " when you were describing the architecture, and that reminded me of language learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4888.077,
    "end": 4893.119,
    "text": "Like if someone says, repeat after me, and then they give a sound, you might be accurate or you might not be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4893.159,
    "end": 4895.539,
    "text": "But if someone said, no, it was not .",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4896.82,
    "end": 4899.061,
    "text": "You have a negative and a positive example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4899.621,
    "end": 4907.904,
    "text": "So what does that speak to perhaps the biological basis of contrastive learning or how these contrastive learning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4909.289,
    "end": 4913.373,
    "text": " settings, active inference or not relate to the ways that organisms learn?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4918.438,
    "end": 4920.64,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4920.881,
    "end": 4921.742,
    "text": "I will say that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4923.619,
    "end": 4952.08,
    "text": " the contrasted learning mechanism, though it's not completely equal, I would say it somehow resembles the Abbeon learning mechanism, where you, when you have corresponding pairs of, so the things that should correspond, you actually want to strengthen the link, and when you have stuff that shouldn't be corresponding, you actually want to awaken the link.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4952.7,
    "end": 4958.584,
    "text": " So I think that biologically, we could actually see it this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4958.684,
    "end": 4973.554,
    "text": "So when you have something that you want to link further, in our case, the thing that we want to link further, so to reinforce, is the fact that a certain observation corresponds to a certain state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4974.714,
    "end": 4976.415,
    "text": "Then you strengthen this connection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4979.372,
    "end": 4986.616,
    "text": " you want to be far, and that's where the contrast, I think, a bit differs maybe from this biological perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4986.636,
    "end": 4987.656,
    "text": "We actually push it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4988.557,
    "end": 4996.4,
    "text": "We push it farther, which is not always the case for retinal learning because normally you don't have this pushing farther mechanism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4996.52,
    "end": 4999.982,
    "text": "So I would say this could be one possible links.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5002.263,
    "end": 5007.644,
    "text": " As you said, yeah, the critic function is actually doing something very similar to what you mentioned.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5007.704,
    "end": 5011.665,
    "text": "So you have positive samples and you reinforce.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5011.705,
    "end": 5014.246,
    "text": "So the critic tells you, yeah, this is correct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5014.666,
    "end": 5016.586,
    "text": "And it should tell you that this is correct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5016.906,
    "end": 5017.967,
    "text": "So it's trained to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5019.267,
    "end": 5020.887,
    "text": "We do it with machine learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5020.927,
    "end": 5023.488,
    "text": "But, well, if you have a good critic, you could use that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5024.849,
    "end": 5036.19,
    "text": " Yeah, it should tell you, yeah, this is the right samples while for non-corresponding states and observation, it should tell you, yeah, this is not what we want in our representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5036.29,
    "end": 5037.312,
    "text": "We want this farther.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5039.194,
    "end": 5051.743,
    "text": " Maybe to add on, Daniel, I think what you're hinting at, providing it should be like this, is more like a way to define preferred states, so to speak.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5052.483,
    "end": 5063.09,
    "text": "If you translate it to what we're doing, it's basically saying these observations are what you should like, basically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5063.35,
    "end": 5067.093,
    "text": "They come into place for creating the action model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5068.814,
    "end": 5069.415,
    "text": " observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5069.937,
    "end": 5072.142,
    "text": "The contrastive learning port is more like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5074.48,
    "end": 5077.502,
    "text": " being able to distinguish different things, basically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5078.263,
    "end": 5087.39,
    "text": "And it's more broad than what you like to have.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5087.79,
    "end": 5092.794,
    "text": "So the contrastive learning just learns to distinguish all kinds of sounds, even all the bad ones.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5093.655,
    "end": 5098.919,
    "text": "And you just now say, okay, but now I really want to have this sound.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5098.939,
    "end": 5100.74,
    "text": "So try to get there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5100.94,
    "end": 5103.302,
    "text": "I think that's the difference here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5106.138,
    "end": 5114.74,
    "text": " That kind of sounds like paying attention to the right details, which we saw with multiple times, like the breakout games, like how could you miss the ball?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5115.001,
    "end": 5122.962,
    "text": "Humans are watching that GIF and we're watching the ball, but we also have a sense of how to pay attention to the right details.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5123.543,
    "end": 5128.584,
    "text": "And then in terms of action to have curiosity about the right things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5128.784,
    "end": 5133.565,
    "text": "So it definitely starts to bridge into some very interesting behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5135.069,
    "end": 5141.011,
    "text": " Another question was about the action entropy term in the free energy calculations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5141.571,
    "end": 5148.053,
    "text": "So maybe could you restate what the action entropy term is since it's one of the major contributions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5148.533,
    "end": 5150.894,
    "text": "And also what does that say about adding terms",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5152.813,
    "end": 5154.594,
    "text": " to the free energy calculation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5155.075,
    "end": 5160.039,
    "text": "Like the action entropy is always greater than zero, kind of like a KL divergence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5160.599,
    "end": 5167.504,
    "text": "And so that you mentioned gives some perhaps nice properties about the boundedness of F within a lower and an upper bound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5167.845,
    "end": 5170.867,
    "text": "So maybe just what is the action entropy doing here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5171.367,
    "end": 5175.971,
    "text": "Can we just add other terms that are bounded at zero to free energy and use that in other ways?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5179.855,
    "end": 5191.965,
    "text": " Okay, so I'll start with the question about the action entropy term, and then I'll also delve into the using different bounds for the free energy term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5191.986,
    "end": 5192.406,
    "text": "So here in this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5197.847,
    "end": 5210.31,
    "text": " In the way we casted the active inference process for learning the actions, the key part is that the actions are now part of the future inference process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5210.951,
    "end": 5224.234,
    "text": "So I could also go back to the previous slide if that's necessary, but normally the way that we see this objective is without this A term, here and here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5224.734,
    "end": 5226.575,
    "text": "But instead, we have like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5227.538,
    "end": 5231.141,
    "text": " a conditional on a policy, on a certain policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5231.881,
    "end": 5241.668,
    "text": "So normally that means that you have some set of policies already, and you're just trying to decide which of them is better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5242.748,
    "end": 5255.477,
    "text": "So this could be done like using an Occam browser first, and then just assessing the one that you think are best, or just assessing all of them, but that's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5256.089,
    "end": 5265.814,
    "text": " That's impossible, for instance, in a continuous action setup where you cannot assess all possible policies because the actions are continuous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5265.834,
    "end": 5268.356,
    "text": "The number is infinite for every dimension.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5268.436,
    "end": 5271.157,
    "text": "So this makes infinite by infinite and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5271.357,
    "end": 5276.52,
    "text": "So it's a huge dimensionality space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5277.46,
    "end": 5283.204,
    "text": "So instead here, we make the action part of the inference process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5283.224,
    "end": 5284.524,
    "text": "So we want to have a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5286.221,
    "end": 5292.527,
    "text": " separate model that tells us what's the action to take at every step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5293.547,
    "end": 5311.182,
    "text": "And I said that we obtain an action entropy term and that's because in choosing the best action, so in trying to match our actions to the one that we should actually prefer, we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5312.699,
    "end": 5317.081,
    "text": " We think it like we don't have a preference over action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5318.622,
    "end": 5332.788,
    "text": "So for instance, if I want to reach a certain stated environment, so if I want to go from this room to the kitchen, maybe I don't care what the shortest path is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5332.848,
    "end": 5334.929,
    "text": "I just care about getting there at some point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5335.882,
    "end": 5343.534,
    "text": " Or I don't care about going left or going right now when I get off my chair.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5343.554,
    "end": 5344.615,
    "text": "I just want to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5345.899,
    "end": 5347.04,
    "text": " to go where I need to go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5347.4,
    "end": 5350.483,
    "text": "So we don't place a prior over the action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5350.563,
    "end": 5356.788,
    "text": "We just say, whatever action is fine as long as it brings you the fastest as possible to the goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5357.228,
    "end": 5363.873,
    "text": "Because the fastest thing is not given by the action itself, but by minimizing the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5363.933,
    "end": 5367.076,
    "text": "So we don't want a preference over the actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5367.376,
    "end": 5371.139,
    "text": "We want the free energy to lead us to the fastest spot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5372.034,
    "end": 5378.579,
    "text": " And so the actions are, we assume a uniform distribution over them, and what remains is just an entropy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5379.039,
    "end": 5396.432,
    "text": "So it will be a KL divergence between the Q over action, given the states, and this PAT, which basically becomes an entropy value if you assume this is a constant, because it's just subtracting a constant to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5397.529,
    "end": 5403.75,
    "text": " And yeah, switching to the other part of the question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5403.83,
    "end": 5408.911,
    "text": "So what does it mean to us, this constant term here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5409.411,
    "end": 5413.772,
    "text": "So is adding constant term useful?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5414.012,
    "end": 5420.093,
    "text": "So I don't know if there's any other useful constant term that we could add.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5420.433,
    "end": 5424.694,
    "text": "So mathematically speaking, adding a constant, so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5426.36,
    "end": 5432.462,
    "text": " Having an upper bound because of a constant, because you're minimizing the same objective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5432.782,
    "end": 5439.945,
    "text": "But then on top of that, we apply the contrastive approximation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5440.645,
    "end": 5443.726,
    "text": "And that leads to another upper bound.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5444.046,
    "end": 5446.387,
    "text": "And as I said, there are some implications of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5446.467,
    "end": 5449.268,
    "text": "We get maybe a better representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5449.328,
    "end": 5453.41,
    "text": "But are we getting farther from the actual objective?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5455.845,
    "end": 5466.388,
    "text": " From my point of view, as long as we achieve something that is actually better, it doesn't really matter how far are we from the actual surprise of the signal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5467.148,
    "end": 5475.431,
    "text": "So in any case, we will always get some kind of amortization or approximation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5476.109,
    "end": 5482.833,
    "text": " And we will probably never get a hundred percent close to the surprise value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5483.513,
    "end": 5487.715,
    "text": "So, because we don't have a perfect model, so a perfect model of the world doesn't exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5488.216,
    "end": 5495.439,
    "text": "It's impossible to imagine that we can model every details of the environment, even with a, with a billion machine learning parameter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5495.539,
    "end": 5500.102,
    "text": "And it's impossible to think that we will always act perfectly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5500.689,
    "end": 5510.752,
    "text": " and always get in the perfect route to the goal, choosing the always optimal action, especially because there's always some uncertainty in the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5511.192,
    "end": 5518.014,
    "text": "And there's a lot of things that we normally want to ignore in our everyday life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5518.054,
    "end": 5525.196,
    "text": "So a lot of things here is not actually important to capturing the world model or action wise not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5525.676,
    "end": 5550.979,
    "text": " always important to be 100% accurate in our movements in the action we take the important thing is that we get close to the goal so I would say yeah if there are any other term that we any other constant term or just any other modification that we could do to the free energy functional that actually leads to better results without compromising the original goal of minimizing free energy I think that's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5551.96,
    "end": 5570.904,
    "text": " there would be a good way to address some of the issues that we currently have with active inference that could ultimately lead to improving the performance of the artificial implementation of active inference significantly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5571.004,
    "end": 5578.066,
    "text": "So that's also why I think that taking advantage of some lessons that we learned",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5578.346,
    "end": 5596.677,
    "text": " from reinforcement learning is actually useful in active inference as well because there has been a ton of research about a way to amortize this thing or approximate this thing better or train a better deep learning model for some very specific aspect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5596.757,
    "end": 5604.242,
    "text": "And I think the active inference research should benefit from this, should take inspiration from this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5614.947,
    "end": 5627.47,
    "text": " Yeah, so maybe to make clear here for maybe people that are less familiar with reinforcement learning, but are coming from a more active inference background.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5627.49,
    "end": 5638.793,
    "text": "So in terms of active inference, as Scott Whistling would look at it, this is basically something that you should not do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5640.437,
    "end": 5651.804,
    "text": " So basically what happens here is that we see action inference more like a habitual thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5651.985,
    "end": 5662.111,
    "text": "Like I know I'm in this state or I think I'm in this state, so therefore I can just infer my action without even planning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5662.271,
    "end": 5665.313,
    "text": "It's kind of you become habituated",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5671.414,
    "end": 5698.552,
    "text": " amortize this action into an amortized policy so that's basically the kind of the mechanism that that we apply here in order to avoid planning um all the time because that's that's the the tricky part uh we have too much options to plan so we don't want to do this so we just say let's amortize it from the start which basically means that this a this this",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5701.664,
    "end": 5702.907,
    "text": " but also over actions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5703.528,
    "end": 5710.883,
    "text": "And then so the action entropy just falls out by introducing the action in the queue there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5713.157,
    "end": 5716.419,
    "text": " add an action attribute term to the formulation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5716.519,
    "end": 5723.803,
    "text": "It just comes out because of having the actions as part of our approximate posterior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5724.163,
    "end": 5729.787,
    "text": "But so keep in mind that this also means that we have an approximate posterior over our action selection.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5730.407,
    "end": 5736.55,
    "text": "And this works in these reinforced flowing problems because they're",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5737.671,
    "end": 5764.297,
    "text": " yeah your goal is always the same your it does not shift uh it's it's not a it's also not a uh um if you if you think back on on biological agents it's not like a complex distribution to maintain homeostasis basically just yeah this is the reward this is where you get it it's always the same thing so this basically means that your environments wherein in which we test these agents and which also reinforce",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5768.507,
    "end": 5778.83,
    "text": " is tuned for, I can amortize what I have to do, because if I know my state, I know what I have to do, basically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5779.271,
    "end": 5783.212,
    "text": "Things will change, I guess, if you have another environment in which",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5787.261,
    "end": 5802.768,
    "text": " You could still have multiple options to do and you can only really know what to do by planning ahead or by first search for information on what's happening.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5803.248,
    "end": 5810.351,
    "text": "And in these kinds of environments, I think that amortization trick won't help you a lot or you cannot do it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5810.951,
    "end": 5812.193,
    "text": " just by amortizing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5812.593,
    "end": 5824.807,
    "text": "So it's a trick we did to allow it to work in this kind of environment because we have to benchmark against some things and you have to be a bit on par there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5825.247,
    "end": 5830.153,
    "text": "But so keep in mind, it's not a silver bullet that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5831.96,
    "end": 5858.224,
    "text": " do deviate from vanilla active inference here we cost action inference as like we just want to learn habits we don't want to plan but this also means that there might be situations where it will not work and then it's not due to active inference or free energy principle that's not working it's more like yeah we did a crude approximation here by which things might not work anymore",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5860.728,
    "end": 5870.294,
    "text": " That's interesting about which training environments favor what kind of algorithms and then how that shapes the perception of different algorithms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5870.534,
    "end": 5882.461,
    "text": "Like the navigation task, what if there was a fuel tank or there was a larger space that was going to require multiple information foraging trips, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5883.162,
    "end": 5888.185,
    "text": "And so then the sort of single-minded seeker is going to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5889.571,
    "end": 5913.04,
    "text": " just die fast but then something that's able to actually engage in planning wouldn't so that was a little bit like to those who are familiar with active inference and then here's a variant on what we've seen before how about for those who are more familiar with the dreamer architecture or reinforcement learning what makes active inference active inference and how is it different",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5918.519,
    "end": 5937.099,
    "text": " well i think um they are they're largely uh similar let's say i think that would be the starting point because of often people think about what's the difference but but i think the the main point that we",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5940.934,
    "end": 5946.823,
    "text": " is that there are a lot more similarities between reinforcement learning and active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5947.283,
    "end": 5957.858,
    "text": "I would say that active inference is a bit more general than reinforcement learning in the sense that on the one hand, we don't use a reward",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5958.078,
    "end": 5982.266,
    "text": " function per se but we relax that a bit as in we just have a distribution over preferred outcomes which is a bit more general I would say and then the second thing is that instead of by starting off from the free energy principle as in this is the objective that we want to minimize you also get the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5988.325,
    "end": 5991.328,
    "text": " thing as what a reinforcement learning agent would optimize.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5991.728,
    "end": 5998.635,
    "text": "So if you only look at extrinsic value, your free energy agents will also do this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5999.376,
    "end": 6007.664,
    "text": "But the added value, I would say, comes in the information gain terms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6008.425,
    "end": 6011.968,
    "text": "And these will only give you an additional benefit",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6012.734,
    "end": 6015.396,
    "text": " in environments where there is information to gain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6016.616,
    "end": 6020.359,
    "text": "And this is not your typical reinforcement learning environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6021.099,
    "end": 6027.083,
    "text": "But if you look at, for example, the Team Mace mouse from Carl Friston,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6027.768,
    "end": 6036.154,
    "text": " These are typical environments where you can actually show that if you only go for extrinsic value, you will be acting suboptimal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6036.394,
    "end": 6049.183,
    "text": "So you can actually prove almost that in some environments, only looking at extrinsic value, given the correct model of the environment, active inference will win.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6049.603,
    "end": 6054.086,
    "text": "I think the crucial thing that we need to research on is how do you",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6057.731,
    "end": 6084.945,
    "text": " your world in which by optimizing your expected tree energy actually you do the sensible planning and this is still largely unresolved and with our models we are taking steps in that direction but as you can see there are lots of issues why to just find the correct model because in in if you just look at the mouse the likelihood based model should be perfectly fine but by",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6085.505,
    "end": 6099.439,
    "text": " by the way you optimize and practice, then you see all kinds of problems like, okay, this little pixel is actually the most important pixel of the thing, and that does not appear in my loss function, so that's why everything collapses.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6100.039,
    "end": 6104.404,
    "text": "So in theory, it should work, but there are a lot of practical problems to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6104.864,
    "end": 6111.227,
    "text": " to find the correct model that pays attention to the correct details or the correct aspects of your observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6111.608,
    "end": 6119.232,
    "text": "And this is something that is shared with model-based reinforcement learning as well as active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6120.512,
    "end": 6129.337,
    "text": "And I think there's a huge opportunity to find new techniques that can put forward both fields.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6130.218,
    "end": 6130.998,
    "text": "And we also showed",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6133.029,
    "end": 6139.113,
    "text": " in the distracting environment also improve performance on the normal dream.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6139.153,
    "end": 6141.775,
    "text": "So by having a technique that's",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6142.642,
    "end": 6161.275,
    "text": " lets you build a better model, any model-based algorithm will work, and Active Inference has this special notion of also taking into account information gain in environments where you might be unsure on what your status is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6161.575,
    "end": 6165.117,
    "text": "So that's where it can prevail, but I think in most",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6172.796,
    "end": 6191.981,
    "text": " probably get away with uh just maximizing rewards uh which is in in in fact also an active inference uh agents and to some sense if of course if it's if it's more i'm talking about a model-based technique so like dreamer agent in this case of course the model three uh ones are uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6193.01,
    "end": 6204.699,
    "text": " These are a bit different as they don't need a model at all, but at least for model-based reinforcement learning agents, I think it's pretty similar to what an active inference agent would do in these environments.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6209.023,
    "end": 6209.523,
    "text": "Thank you, Tim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6209.723,
    "end": 6211.424,
    "text": "Pietro, anything you'd add to that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6214.387,
    "end": 6220.712,
    "text": "Yeah, I would like to discuss",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6224.65,
    "end": 6230.734,
    "text": " overlooked is the fact that it makes this amortization similar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6230.814,
    "end": 6233.036,
    "text": "And it's also similar to what we have done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6233.136,
    "end": 6237.679,
    "text": "So yeah, we learn a policy, basically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6237.719,
    "end": 6243.202,
    "text": "We're in an action network that provides the correct state, the correct action for every state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6243.463,
    "end": 6251.028,
    "text": "But the key step that actually brings us closer to the active inference formulation is that we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6252.059,
    "end": 6255.5,
    "text": " we imagine several time steps in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6255.74,
    "end": 6272.363,
    "text": "So it is true that we don't evaluate long policies over time that we have this prior about action that is given by our action network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6273.343,
    "end": 6276.144,
    "text": "But it is also true that given the fact that we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6277.776,
    "end": 6280.518,
    "text": " We evaluate the state that we expect to see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6280.538,
    "end": 6288.925,
    "text": "And then from there, we restart doing the action optimization process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6288.965,
    "end": 6293.669,
    "text": "We actually get closer to the optimization scheme of active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6293.709,
    "end": 6298.854,
    "text": "In particular, there is a paper called Sophisticated Inference that discuss this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6299.034,
    "end": 6306.18,
    "text": "When you actually take an action and then you reimagine from that step what's going to happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6306.56,
    "end": 6307.501,
    "text": " what's going to happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6307.541,
    "end": 6317.345,
    "text": "There are some implications of this, but we are not completely drifting away from the original active inference theory because of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6317.465,
    "end": 6322.007,
    "text": "It's just a different way of doing the action selection process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6322.087,
    "end": 6327.71,
    "text": "And in that, indeed, the dreamer is also very close to active inference itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6332.281,
    "end": 6352.394,
    "text": " cool thank you I I wrote down if you don't know where you prefer to go you are lost drive fast if you know how to get there figure it out if you don't and then reassess continually and I hope that conveys some of the similarities and differences do you have any final comments",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6356.294,
    "end": 6361.621,
    "text": " This is a very interesting line of research and we really appreciate this model stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6362.582,
    "end": 6369.211,
    "text": "Hope to see you in the future, or should I say we expect and prefer it, but thanks again, Pietro and Tim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6369.251,
    "end": 6370.032,
    "text": "This is really awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6372.355,
    "end": 6373.056,
    "text": "Thanks for having us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6374.217,
    "end": 6374.958,
    "text": "Thank you for having us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6375.419,
    "end": 6376.14,
    "text": "Have a good day, everyone.",
    "speaker": "SPEAKER_00"
  }
]