[
  {
    "start": 2.63,
    "end": 29.211,
    "text": " all right september 9th 24 and andrew go for it cool um hi everyone so uh as we just briefly i know some is coming in uh as we just briefly discussed uh since today is another session where we are not directly talking about any particular the chapter of the textbook but rather",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 29.63,
    "end": 32.933,
    "text": " I'm just talking about applying active inference more generally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 32.973,
    "end": 43.264,
    "text": "We agreed that I would spend just a little bit of time here giving sort of a quick rundown of how to construct an active inference agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 43.784,
    "end": 54.675,
    "text": "In this case, it'll be specifically a POMDP agent, meaning we're working with, well, in this case, we're working with discrete time and discrete observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 55.111,
    "end": 83.599,
    "text": " um as opposed to continuous time models which you'll see in chapter eight of the textbook um and i kind of just want to focus on just from scratch like how do we think about constructing an agent um i won't be touching on how to construct an environment um but but that's the kind of thing that you know you would you would bear in mind whenever kind of coming up with an idea for a simulation or experiment you want to run um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 84.541,
    "end": 91.49,
    "text": " And actually on that note, Daniel, is it possible for me to share my screen by chance?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 96.076,
    "end": 96.276,
    "text": "Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 96.316,
    "end": 96.777,
    "text": "Go for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 97.658,
    "end": 97.998,
    "text": "Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 98.299,
    "end": 98.779,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 112.217,
    "end": 112.337,
    "text": "Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 114.241,
    "end": 125.296,
    "text": " So this was the, and if anyone wants this link, they can find me on GitHub, A-P-A-S-H-E-A, just like my last name on the Zoom.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 126.297,
    "end": 131.885,
    "text": "And the repository is called IC2S2, Active Inference Tutorial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 132.806,
    "end": 138.694,
    "text": "This is material that I presented back in July at University of Pennsylvania.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 139.696,
    "end": 140.637,
    "text": "I basically,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 141.19,
    "end": 170.86,
    "text": " uh gave a tutorial on active inference how it might be applied to social sciences specifically in constructing multi-agent simulations so um is this uh is this visible to everyone slides here yeah go for it for you know five to ten minutes however much you just want a footnote and then let's see what people want to continue with",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 171.633,
    "end": 172.114,
    "text": " Definitely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 172.414,
    "end": 173.857,
    "text": "Sounds good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 174.839,
    "end": 184.457,
    "text": "So in this tutorial, along the way, you know, we're introduced to active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 184.477,
    "end": 194.215,
    "text": "There's some nice explanations of different concepts from the textbook, et cetera, talking about the Bayesian brain hypothesis, general ideas about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 194.633,
    "end": 197.916,
    "text": " basis rule kind of plays out in active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 198.416,
    "end": 211.568,
    "text": "And eventually we reach where we're going to use the pyMDP package, which has been developed to make discrete time active inference agents in Python.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 212.249,
    "end": 215.592,
    "text": "And there are a lot of updates being made to that package right now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 216.113,
    "end": 220.336,
    "text": "If you were to like use a git clone to download it directly, there's a lot going on in there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 220.657,
    "end": 224.32,
    "text": "But for the time being, I'm going to just be using the pip install",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 224.722,
    "end": 230.489,
    "text": " It's a little bit more kind of packaged up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 230.67,
    "end": 232.192,
    "text": "It becomes more like a single unit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 233.333,
    "end": 250.295,
    "text": "So whenever we construct active inference agents, the starting step should be, in my view, the starting step should be what are the hidden states that the agent has in their generative model?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 250.596,
    "end": 252.518,
    "text": "Like what are they trying to infer?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 253.19,
    "end": 280.834,
    "text": " uh second thing is what are the observations that the agents will encounter in the world and then three what are the actions uh or controls or policies those three terms are sometimes used interchangeably they don't necessarily mean exactly the same thing um but for now we'll just go through with all those but we'll call them actions uh what actions can the agent commit uh so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 281.438,
    "end": 288.945,
    "text": " So we can view that kind of like this, like this is the agent that we'll be constructing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 289.846,
    "end": 295.412,
    "text": "All of these things play out what's called an action perception loop.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 295.792,
    "end": 309.285,
    "text": "Let me see if I can just... Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 309.67,
    "end": 314.94,
    "text": " Hopefully that's visible enough to everyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 315.802,
    "end": 321.553,
    "text": "So we'll start at the bottom of this action perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 322.174,
    "end": 323.817,
    "text": "First, observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 324.579,
    "end": 332.033,
    "text": "There are two kinds of observations that this agent will receive at any given time step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 332.857,
    "end": 338.449,
    "text": " quick note that this entire action perception loop plays out at every time step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 338.61,
    "end": 350.275,
    "text": "We're working in discrete units of time, and so whether it's from second to second, minute to minute, millisecond to millisecond, however, all of the units of time are the same.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 351.605,
    "end": 376.6,
    "text": " uh here the agent receives one or two observations one of them is related to an improvement if something improves or if it doesn't improve and i didn't include a third category but there's another one called unobserved just bear with me and we'll go into what that means soon but that's one particular kind of observation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 376.765,
    "end": 404.072,
    "text": " otherwise known as an observation modality that the agent has slash receives we can think about about this is like in the same way that we have you know sensory data that comes in uh you know like you have cold receptors on your on your uh in your scan on your arms and so you can feel if it's cold or it's hot or otherwise similarly here the agent has some hypothetical receptor and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 404.052,
    "end": 430.06,
    "text": " well we could call it visual or otherwise but the point is that they get one of these three observations improvement no improvement or not served another observation modality they have is self or neighbor and i call this the attention modality at any given time step they're paying attention either to themselves or to their neighbor part of why",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 430.411,
    "end": 444.789,
    "text": " we're talking about self, neighbor, that kind of thing, is that eventually this leads to a multi-agent simulation where agents can either kind of do their own thing or they can interact with other agents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 444.809,
    "end": 450.476,
    "text": "And so this attention modality means they're actually observing, like, who am I paying attention to?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 452.558,
    "end": 459.827,
    "text": "So when they take in those observations, they have a single hidden state",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 460.499,
    "end": 468.307,
    "text": " which is, I've denoted S with superscript ATT, this is their attention hidden state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 469.13,
    "end": 471.96,
    "text": "An agent takes an observation,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 472.278,
    "end": 481.635,
    "text": " And then using what's called a likelihood model, which is in Chapter 7, we refer to it as the A matrix.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 482.035,
    "end": 486.483,
    "text": "Remember, we have the A, B, C, and D matrices.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 486.523,
    "end": 488.507,
    "text": "This is the A matrix.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 488.527,
    "end": 491.953,
    "text": "And so the A matrix is this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 491.973,
    "end": 496.581,
    "text": "It's the probability of that observation that they just received given the hidden state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 497.185,
    "end": 508.763,
    "text": " Whenever the agent reaches this right, this square on the right, so to speak, this stage of the action perception cycle, they invert their model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 508.903,
    "end": 520.18,
    "text": "So now they actually try to figure out what is the hidden state given I just received this observation, you know, in the same way that you could receive a hot or cold observation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 520.3,
    "end": 522.744,
    "text": "And so you infer, oh, it's cold here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 523.846,
    "end": 525.268,
    "text": "Here the agent is cold.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 525.957,
    "end": 532.227,
    "text": " For example, they might observe themselves and then infer, oh, I'm paying attention to myself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 533.328,
    "end": 536.253,
    "text": "And vice versa for neighbor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 536.914,
    "end": 544.585,
    "text": "Here, this is an incredibly, despite the material, despite kind of the complexity of active inference theory, this agent is actually very simple.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 544.706,
    "end": 547.209,
    "text": "They can receive one of two observations every time step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 547.53,
    "end": 551.876,
    "text": "They have a single hidden state that they're trying to infer, self or other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 552.357,
    "end": 554.901,
    "text": "But what that does is that it makes a link.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 554.999,
    "end": 562.97,
    "text": " between if they observe an improvement or no improvement with who they're paying attention to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 564.032,
    "end": 576.67,
    "text": "And whenever you combine that with the idea of learning their likelihood model, which is what this delta, this triangle means, like they're learning their likelihood model, they can learn",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 577.122,
    "end": 603.687,
    "text": " that oh if i pay attention to myself i see an improvement more than if i pay attention to my neighbor right so so so these kind of values get these parameters get adjusted over time these are the agent's beliefs changing based on their learning from experience and then after they make an inference they then decide okay which action should i take on this time step",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 604.156,
    "end": 618.974,
    "text": " The names of the actions are explore and exploit, which is that doesn't quite have anything to do with the so-called explore-exploit dilemma that comes up in the textbook.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 618.994,
    "end": 622.158,
    "text": "You know, that's technically a different thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 622.178,
    "end": 623.94,
    "text": "These are just arbitrary names.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 624.802,
    "end": 631.149,
    "text": "Explore here really just means the agent is exploring new solutions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 631.169,
    "end": 633.252,
    "text": "This is a problem-solving agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 633.62,
    "end": 643.203,
    "text": " The idea is they can explore, meaning on their own, pay attention to themselves and try and come up with new solutions to a problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 644.205,
    "end": 649.738,
    "text": "Or they can exploit, meaning that they will steal the answer of their neighbor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 650.005,
    "end": 673.768,
    "text": " right and if they so so you can see how if they steal the answer from their neighbor and they see an improvement then they start to learn like oh if i just keep taking my neighbor's answer to this problem i keep seeing improvements or it might be the other way around they might see no improvement start to associate like x the action exploit receive the observation neighbor",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 674.39,
    "end": 700.009,
    "text": " and no improvement and then in their likelihood model they'll learn like oh i shouldn't steal from my neighbor that leads to you know no progress on me trying to solve this problem now i've already discussed these three kind of squares these three nodes of this graph here that's all you need for an agent the only thing i've left out is the environment and it's the environment that you know for a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 700.276,
    "end": 710.726,
    "text": " a program where you can think like, oh, well, if I set up an agent as observations and in state to infer actions, that just gets hooked up with the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 710.766,
    "end": 719.154,
    "text": "The environment can be a list of if-else rules, like if the agent does this, then the environment should send out this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 720.375,
    "end": 722.458,
    "text": "Or it could be more of a stochastic process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 722.538,
    "end": 726.081,
    "text": "You could use a random number generator or otherwise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 726.162,
    "end": 729.786,
    "text": " So the agent will learn over time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 730.127,
    "end": 739.418,
    "text": "So if anyone is interested in this, again, feel free to check out the, I'll actually put the link in the chat whenever I'm done here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 739.458,
    "end": 744.485,
    "text": "I don't want to take up too much time though, but it's just, that's the general process of an action perception loop.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 745.346,
    "end": 749.691,
    "text": "And then, you know, the tutorial from there just kind of starts to break it down even further.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 749.771,
    "end": 752.895,
    "text": "Like once you, so once you figure out those hidden states,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 753.466,
    "end": 776.436,
    "text": " like what is the asian trying to infer what are the observations that you receive what are the actions that can commit the next step would be okay how do we link those three things together through your a b c d and e um you know a links together observations and states b links together transitions between states",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 776.77,
    "end": 778.211,
    "text": " with what the agent does.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 778.231,
    "end": 784.857,
    "text": "It's like, oh, if I think X right now and I do Y, then I believe that Z will happen next.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 784.877,
    "end": 787.039,
    "text": "That's what kind of like what a B matrix says.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 787.459,
    "end": 793.384,
    "text": "C matrix priors over observations, which is like your preferences for what you want to see.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 793.424,
    "end": 801.751,
    "text": "The agent will kind of try to realize these or seek out these observations by way of free energy minimization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 801.871,
    "end": 804.313,
    "text": "D is your initial beliefs about states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 804.854,
    "end": 806.355,
    "text": "You know, what did you think before?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 806.791,
    "end": 823.132,
    "text": " And then through inference, we'll end up with a state belief, a posterior that might differ from D, or it might be exactly the same, in which case that means that the agent just reconfirmed its own belief again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 823.152,
    "end": 824.093,
    "text": "It's exactly the same.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 824.494,
    "end": 827.458,
    "text": "And E is just your priors over actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 827.478,
    "end": 830.401,
    "text": "So what are you most likely to do regardless of anything?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 831.383,
    "end": 833.946,
    "text": "That's why they're also known as habits.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 834.652,
    "end": 841.88,
    "text": " I don't know stuff that there's there's plenty more to go into, but those are all the core bare bone aspects of what you need for an agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 842.44,
    "end": 848.026,
    "text": "And the rest is just, you know, I pretty quickly start jumping into code from there on how to do so.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 848.046,
    "end": 848.667,
    "text": "Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 850.229,
    "end": 851.21,
    "text": "That's it for now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 851.57,
    "end": 856.936,
    "text": "So.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 856.956,
    "end": 857.356,
    "text": "Oh, sorry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 857.456,
    "end": 858.457,
    "text": "Can I have the link to that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 858.477,
    "end": 860.119,
    "text": "I'd love the link to that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 860.139,
    "end": 860.92,
    "text": "Yeah, absolutely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 862.422,
    "end": 862.802,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 863.288,
    "end": 891.456,
    "text": " mean that's right in my wheelhouse i love this stuff and i i just spend all my days doing this kind of thing so i'm it's nice to see somebody else like building out like the step-by-step process of like how do we like make this work kind of and then you get to like just throw it all you know that way other people can do it too yeah cool yeah yeah that's exactly the point yeah i like for me personally it's like it's only",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 891.875,
    "end": 899.645,
    "text": " I had already been involved with the Institute for some time and then realized like there is no clear-cut way of doing this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 900.506,
    "end": 908.056,
    "text": "I just dropped the link in the chat or sorry, it's not the specific repo.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 909.858,
    "end": 916.026,
    "text": "But in any case, yeah, so what I did was that I just started getting into the documentation for PyMDP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 916.529,
    "end": 921.396,
    "text": " And I did a lot of like just going through their repository to make sure I'm getting things right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 922.057,
    "end": 933.473,
    "text": "There's a lot of complexity because they tried to build IMDP off of SPM and MATLAB, which is what Friston and other folks developed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 933.673,
    "end": 935.716,
    "text": "And it's just been in development for years.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 935.736,
    "end": 939.642,
    "text": "So they're trying to recreate this massive project.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 940.323,
    "end": 942.486,
    "text": "And I just think like, oh,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 943.04,
    "end": 972.152,
    "text": " you want to get more people using it let's make some more kind of from scratch uh tutorials on how to go about this so that's that's what i did but cool i'm glad glad you find it interesting uh oh yeah i mean i had to come at it from a completely different uh uh hold on as i get back in this thing here lost all my stuff um yeah the uh i came at it from a completely different angle and but came to the same conclusions and it's i had no idea that somebody was doing that it's so much fun",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 976.182,
    "end": 999.321,
    "text": " we go there's everybody yeah there's a lot to add i think one of the biggest pieces then anyone who wants to ask go for it is like what is a question about an active inference generative model what's a question that staples into a b c or d or a line of code or a specific node or edge on a graph what's a question about the world",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 999.638,
    "end": 1025.562,
    "text": " it's like what's the question about the subway map of the city what is the question about the territory of the city that can get back and forth and we know all about and talk all about these kinds of ambiguities and dual reference and things like that but at the same time it is a different type of question to say what is the dimensionality of the a matrix in comparison with what is the dimensionality of agent sense making or something like that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1026.436,
    "end": 1039.254,
    "text": " And to know when one is clearly on one side or the other, or when you're not sure, is some of the fastest ways to start separating kinds of questions according to, is this something that's just going to be addressed in a line of code or a math equation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1039.915,
    "end": 1048.427,
    "text": "Or is this something that's more like a real world line of inquiry that cannot be answered in any string of words that somebody says?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1052.913,
    "end": 1055.076,
    "text": "I feel like if you can't answer it, that it, you know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1056.811,
    "end": 1077.402,
    "text": " it's like that i mean there's a lot to be said for not being able to answer something right like um but uh i definitely have a lot of questions um i'm excited to read the material so i can like start asking those in a little a little better way i'm trying to think right now yeah zach go for it oh i was just gonna ask if you guys think",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1079.592,
    "end": 1105.212,
    "text": " are there any questions that you fundamentally can't answer or questions that we just don't have the ability to answer this might be a little bit more philosophical but i feel like daniel you were kind of leading to potentially the question of what is it like to be a bat and maybe ideas that kind of into that realm talking more about something about the agent and its relationship to the environment instead of not instead of anything i'm sorry that's the end of the sentence",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1107.301,
    "end": 1116.692,
    "text": " I just want to say really quickly that this reminds me of a really crucial point they make in the textbook.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1117.372,
    "end": 1122.358,
    "text": "I think it's in chapter nine, but there's this early on in the chapter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1122.418,
    "end": 1127.604,
    "text": "It must be chapter nine, but I might be mistaking that, but it has to do with analysis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1127.644,
    "end": 1131.148,
    "text": "And the whole point is they have this figure that shows like, okay,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1131.567,
    "end": 1155.111,
    "text": " on the innermost uh kind of square of the figure we see the typical like graphical model that they you know a variation of that they keep showing through the textbook but then on the outside like there's a square around it denoting like okay it's really making the point that this is what we the scientist or experimenter think",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1155.293,
    "end": 1159.157,
    "text": " is the model of the agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1159.557,
    "end": 1163.361,
    "text": "Thanks, Daniel, that we're trying to develop, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1163.381,
    "end": 1184.963,
    "text": "It's just like really trying to make the point that like, we ourselves don't firmly know necessarily what the inside of the like, a rat in a teammate's like, I'm trying to model it, I have to be aware that like, here's the level that is what I think is the rats perception of what's",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1188.048,
    "end": 1198.302,
    "text": " You know, so it's like the objective model is just like outer like this is what I'm constructing, like you're in the picture, too, is how I. Yeah, great point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1198.322,
    "end": 1204.931,
    "text": "And for example, the experimental actions of the experimenter are just it's just taken as an observation train.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1204.991,
    "end": 1209.718,
    "text": "We're not modeling the policy that led to the experiment being designed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1209.698,
    "end": 1213.163,
    "text": " OK, but you could include that so you can continue extrapolating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1213.703,
    "end": 1217.508,
    "text": "But it also makes clear where the buck stops.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1217.949,
    "end": 1219.411,
    "text": "But about the questions, it can't be answered.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1219.451,
    "end": 1221.193,
    "text": "I mean, big question, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1221.553,
    "end": 1225.799,
    "text": "But there's a sense in which behaviorally every question is always answered.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1226.36,
    "end": 1236.533,
    "text": "If with acknowledgment, a postulational head nod, dare I say, or silence, or some other kind of non-stackle response.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1236.513,
    "end": 1261.592,
    "text": " can be answered in trivial sense yeah everything already is can be answered in more like a justified true belief semantic validity sense so here's a few pieces from the ontology project built up over the years but I mean just a snapshot if someone wants to dive in further and add more it's the greatest types of contributions that can help at this ontological level here's like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1262.281,
    "end": 1281.066,
    "text": " many many many of the phrases and writings in the textbook group are like how is this term related to this um when they said this did they mean that right does this mean this what does x person think does x why would x person want to believe that this was an explanation of that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1281.198,
    "end": 1298.633,
    "text": " whether or not you go into it questions have these templated forms so clarifying like what is active inference what is surprise um going into those and knowing that even with the awareness of the question like what is surprise or how are they using surprise here",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1299.355,
    "end": 1305.791,
    "text": " those are already categories of questions that you can go in with a structural map towards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1306.613,
    "end": 1315.896,
    "text": "And another fun direction with the philosophical side with like Ali and Paola, Maria and others in the ontology was like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1315.876,
    "end": 1331.758,
    "text": " starting with the linguistics of the you know how could we ask and proceed on a question without like knowing what was written from a symbolic perspective so it's like okay then what is this the the lexical semantics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1331.738,
    "end": 1357.999,
    "text": " like did they say something in the paper here we here we define a foreign here we use surprise to mean this or here we operationalize surprise as so it's like they're narrowing down or leaving implicit what they mean by surprise but if they said by surprise we mean one and then a person constructs an argument where it's predicated on surprise being number two then it's off base",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1357.979,
    "end": 1386.653,
    "text": " then getting into their local weaving of the relational semantics it's not just how they define the terms but it's like okay given that they said blanket states are sense and action you know then did it make sense with this other usage of sense that's in the internal reading internal consistency view from inside like was there an apparent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1388.962,
    "end": 1409.434,
    "text": " issue without even going a view outside of it then getting into views from the outside well I think that they didn't do this or not I don't think enough attention was paid to this they should have done this I think it was cool that they did this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1409.617,
    "end": 1435.371,
    "text": " um what would an embodied person think about this like all manner of then externalized but it's kind of just like a combination of like a close and deliberate and charitable structured reading in that with reference to the active ontology but it could just be any ontology system at that point you give the internal reading",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1435.958,
    "end": 1442.866,
    "text": " and understand when questions and methods are being used that are related to internal reading.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1443.947,
    "end": 1449.553,
    "text": "And then when is it like an external reading from like a different perspective or a later time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1458.323,
    "end": 1461.747,
    "text": "What do you think, Zach, or what kinds of questions does that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1463.009,
    "end": 1487.802,
    "text": " answer or not i mean that makes it seem i really like the external idea of looking at it from many many different lenses because then we're naturally going to find ways to maybe collapse some language and find other things that might have been equal in places that we weren't expecting to look i think just translating into a different language can have a ton an amazing amount of positive impact and it just makes collaboration a really cool thing but at the same time i",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1491.629,
    "end": 1495.975,
    "text": " I've always been attracted to active inference because it has this physics backing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1496.295,
    "end": 1500.461,
    "text": "It all comes from the principle of least action and everything about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1501.002,
    "end": 1511.055,
    "text": "So in my head, there should always be that physical explanation for all things, or at least a mathematically based explanation for all things, which really speaks to me personally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1512.706,
    "end": 1517.035,
    "text": " Man, if I could jump in here, I really appreciate that because it really speaks to me personally too.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1517.596,
    "end": 1529.239,
    "text": "Being able to pull things out of the discourse and put them into theoretical frameworks, mathematical frameworks, it gives us that low and high road to active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1529.259,
    "end": 1533.347,
    "text": "It gives us a path to creating tangible solutions around these things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1537.31,
    "end": 1540.333,
    "text": " And I think it's kind of esoteric almost in a way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1540.493,
    "end": 1556.89,
    "text": "I mean, Daniel, I think, and I were talking last week about how, for instance, this is so valuable for people who love all manner of sciences because it intersects everything, philosophy and on and on and on, you guys know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1557.41,
    "end": 1564.077,
    "text": "And I feel like it necessarily requires a whole big perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1564.259,
    "end": 1567.865,
    "text": " an external perspective to an objective perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1567.905,
    "end": 1569.347,
    "text": "So like write about these things meaningfully.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1569.367,
    "end": 1570.71,
    "text": "You have to touch base on everything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1570.95,
    "end": 1576.579,
    "text": "And you guys should see what a lot of this stuff does when you put it into different indigenous languages.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1577.641,
    "end": 1579.665,
    "text": "Pretty cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1579.685,
    "end": 1580.826,
    "text": "Yeah, you're absolutely right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1580.847,
    "end": 1582.369,
    "text": "It's a formalism, 100%.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1587.074,
    "end": 1616.119,
    "text": " so many ways to go with it but like modal logic like the shirt might be blue or or conditional logics or paraconsistent all these other kinds of of alternative logical structures where things are not like either one way or another outside of an evaluation etc it's like if someone says well ram said claimed x and i think he's saying it's like that cannot be an incorrect second half of the sentence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1617.533,
    "end": 1643.98,
    "text": " unless it were deceptive but if it were deceptive like the person was like I think that Ram said means one but I'm gonna verbalize that I think he meant two that still would be their veridical behavioral representation so it would truly be what they had said at that time and they can have some other side information like but I said that because of this or I would have said that so it's like but they can't be wrong",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1645.259,
    "end": 1663.461,
    "text": " So when the space of ideas is so vast, there's so many papes, more than we'll ever read, plus, plus, plus, generative intelligence, generating the dissertations we don't have yet on demand, and more, expressions are not opposed to each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1664.522,
    "end": 1673.072,
    "text": "Even when they contain what appears to be like the clearest possible, like this person thinks that the blanket means X, this person says it's not X.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1673.17,
    "end": 1700.95,
    "text": " their their epistemic frames are all aligned it's like even in that kind of idealized scenario all the quantum reference frames were aligned we had gotten down to it and then two people differed and one said it was up and one said down still that situation could be analyzed as a cognitive environment where they both truly had those perspectives and then a third observer could take another take on it and it would also only add to the situation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1702.027,
    "end": 1713.144,
    "text": " To piggyback off of that, I think that's exactly what we saw in geometry in the early 1900s with the Erlangen program, where essentially there were a bunch of geometries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1713.204,
    "end": 1716.709,
    "text": "There was parabolic geometry, which I don't think that's how you pronounce that now that I've said it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1717.35,
    "end": 1724.22,
    "text": "There's this algebraic geometry, all of these different geometries that all seem to talk about very different things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1724.521,
    "end": 1732.135,
    "text": " They all went in and were able to describe certain theorems, but they all took all of these amazing paths around and none of them seemed to intersect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1732.672,
    "end": 1739.479,
    "text": " until the Erlangen program, which was, of course, the mathematician Erlangen, or was it the place Erlangen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1740.08,
    "end": 1741.401,
    "text": "Forgive me, it's been a minute since I've read it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1741.862,
    "end": 1743.443,
    "text": "It was the birth of gauge theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1743.804,
    "end": 1754.856,
    "text": "They were able to take all of these seemingly disparate ideas and find a relational way to talk about all of them, which gave us gauge theory today, which actually we're seeing in a lot of places.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1755.096,
    "end": 1760.822,
    "text": "It led to something in machine learning as well called the 5Gs, which I won't get into detail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1760.802,
    "end": 1777.365,
    "text": " It is the main method that we have for trying to understand learning itself as a method to compress, as a method of equating intelligence with compression into a different space, which is just amazing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1777.786,
    "end": 1785.076,
    "text": "It really does remind me of kind of the method of scientific revolutions, if you guys are into dusty old books from the 60s.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1786.678,
    "end": 1788.16,
    "text": "I love dusty old books.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1789.355,
    "end": 1818.265,
    "text": " the gauge theory like also if we think about the recent development of active so it's like 2022 textbook it's like oh yeah wait a minute we're in the textbook group 2022 textbook it's like step by step by Smith at all also leveled up with some more context and it's published as a book",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1818.38,
    "end": 1821.005,
    "text": " It's a state-based approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1821.706,
    "end": 1826.035,
    "text": "It summarizes and crystallizes the state-based approach to active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1826.455,
    "end": 1835.713,
    "text": "That's why the discussion is like discrete state spaces, continuous state spaces for variables and for time itself as a variable in the model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1836.52,
    "end": 1860.469,
    "text": " then especially from 2019 not so much reflected only alluded to in the 2022 textbook coming on much more in papers and in sanji namjoshi's future volume 2 book with the bayesian mechanics live stream 49 all of those kinds of things",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1861.276,
    "end": 1889.545,
    "text": " juxtaposing the state-based formalisms for active inference textbook discrete continuous etc with path-based formalisms then ramsted and dalton pointed towards what they call g theory and highlighted like different deep dualities and some of their implications as well as the gauge theoretic aspects of what was being discussed like overall",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1890.487,
    "end": 1893.954,
    "text": " So it's a great tie-in with gauge theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1893.974,
    "end": 1899.866,
    "text": "There's so much to build and clarify around that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1901.029,
    "end": 1905.458,
    "text": "It's interesting that you brought it in, but yeah, really interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1905.86,
    "end": 1908.803,
    "text": " I'm sorry, but I think, is that the second time you've brought up Ramstead?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1908.843,
    "end": 1910.305,
    "text": "Could you please say a little about him?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1910.365,
    "end": 1911.446,
    "text": "I'm simply not familiar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1911.466,
    "end": 1925.841,
    "text": "I'm just like, I'm just like using him as, as like, you know, he's, he's an active discourse aunt and a great contributor from the pre 2019 PhD student philosophical and his, his deep knowledge there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1925.861,
    "end": 1931.867,
    "text": "And then on through more of the applied and, and ongoing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1933.417,
    "end": 1959.289,
    "text": " but using it like as sort of just he's out there making exp or you know friston says x it's just anyone's reported speech um yeah federated inference yeah yeah that's yeah right yeah i was just digging into that oh yeah this was uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1959.91,
    "end": 1968.103,
    "text": " I was just sharing this because I'm personally still new to the notion of paths here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1968.824,
    "end": 1978.358,
    "text": "And I think in this paper, they replace preferences, like agents prefer a particular path.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1978.959,
    "end": 1987.352,
    "text": "And to me, that seems to imply they're not just preferring a particular observation at a particular moment in time, they're preferring an entire sequence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1987.72,
    "end": 1993.206,
    "text": " I'm not sure if I'm mistaken there or not, but I was really interested in that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1993.648,
    "end": 1994.592,
    "text": "Not done reading it yet,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1996.664,
    "end": 2023.768,
    "text": " these are great questions also natural language terms do get overloaded you know with um with grievous unnecessary and sometimes requisite overloading and underloading and ambiguity so like a path but then we might say well but the path that they take through space over time one two three we're going to call that a path so then it's like but that's not this one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2024.66,
    "end": 2046.465,
    "text": " and then you look at for again from an ontological analysis okay paths may or may not depend on action it'd be like wait a minute what how could the path taken in the world not depend on action because path is being used in multiple sub namespaces so it'd be like having a python script where like a variable is defined within a loop",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2046.631,
    "end": 2060.607,
    "text": " so it's used the way it's used within a loop but then there's a separate global context or there's two functions with the same name so disambiguating the namespace is some of the most important work",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2061.346,
    "end": 2074.599,
    "text": " each of these can have like a unique star code ID, fractal hash, so that the local semantics can be described and modulated or falsified.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2074.679,
    "end": 2081.226,
    "text": "It's like, here's where we came down on the semantic vector for how path was used right here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2082.747,
    "end": 2086.611,
    "text": "Does your vector on that usage of path differ?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2087.384,
    "end": 2093.47,
    "text": " and then can explore many, many more layers of semantic similarity and difference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2096.654,
    "end": 2110.748,
    "text": "But yeah, I don't know if this is actually using it in the path integral based Bayesian mechanical sense, because this is still a state space based model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2111.909,
    "end": 2113.231,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2113.611,
    "end": 2116.294,
    "text": "I was surprised they didn't go with the word state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2118.417,
    "end": 2140.83,
    "text": " yeah it's what was interesting is uh whenever you did the the control left and it highlighted all of them the last path highlight there in that paragraph the full sentences the remaining tensors encode prior beliefs about paths c and the initial states d and i think that brings up another interesting point of trying to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2141.063,
    "end": 2157.185,
    "text": " kind of parse through the terms in that oftentimes, like sometimes this sort of hint of how someone might have meant a term is that they related to something else that might be known from an, you know, whether it be from an entirely different context or not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2157.245,
    "end": 2167.619,
    "text": "Like here they're using the same like alphabetical terms to describe like for A, it's still a likelihood matrix.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2167.639,
    "end": 2169.602,
    "text": "For B, it's still a transition matrix.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2170.122,
    "end": 2175.009,
    "text": " But then here, C, which is typically in the textbook in chapter 7.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2175.29,
    "end": 2179.136,
    "text": "In that particular context, C refers to your priors over observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2179.156,
    "end": 2182.521,
    "text": "But here, they're now prior beliefs about paths.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2183.001,
    "end": 2188.63,
    "text": "And meanwhile, once again, priors about initial states, D, remains the same just as A and B do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2188.69,
    "end": 2193.217,
    "text": "So that's sort of like, you know, it's like this took me off guard when I was reading this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2193.237,
    "end": 2198.745,
    "text": "I'm like, everything here makes sense to me just intuitively right off the bat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2199.232,
    "end": 2211.722,
    "text": " written a tutorial like putting together certain kinds of COMPs so uh but then swap out uh preferences or observations for the word paths and I'm not really",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2212.276,
    "end": 2230.858,
    "text": " really sure but um right and it's like wait but it's second and a in this city second you know it it's and it's reusing common mathematical notation so it's like the one next level is tremendously informative variable names",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2230.838,
    "end": 2260.272,
    "text": " so calling things with very informative specific names however that becomes unmanageable because you start having long variable names that that just visually make it more confusing and even terms like observation it's like well if it's an action from this then how is it is it are we going to call that an action and they output observation it's like you get into which perspective to take on different sides of markup blanket for example",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2260.302,
    "end": 2277.987,
    "text": " So one solution that we've worked on in different applications is separating the initialization, serialization operations on the variables from secondary assertions about which ontological terms they map to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2279.129,
    "end": 2282.013,
    "text": "And then just making that an explicit data structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2282.033,
    "end": 2290.225,
    "text": "And then you can call the variables like specific programmatically generated names.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2290.728,
    "end": 2301.984,
    "text": " and then make programmatic or manual assertions about which terms in a given language you might want to use.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2303.005,
    "end": 2307.151,
    "text": "But calling a term, oh, we'll do a really informative English name.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2307.251,
    "end": 2313.8,
    "text": "It's like, well, then you know exactly what namespace that would be informative for whom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2315.602,
    "end": 2319.688,
    "text": "So if that is the time cone that someone's working in,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2320.057,
    "end": 2328.557,
    "text": " Like within a local for loop, within a programming language, within a language community, then the tool gets the job done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2329.259,
    "end": 2335.433,
    "text": "But that may, and then another important thing with also these kinds of sentences is like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2335.615,
    "end": 2338.479,
    "text": " It is not true without going into this whole true thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2338.499,
    "end": 2345.168,
    "text": "It's like, it isn't true, accurate, complete, you know, all of those things per se.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2345.769,
    "end": 2354.481,
    "text": "You can have a prior that a certain journal or certain co-author or certain kind of statement is going to have like this or that kind of probability or attention that should be paid to it and all this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2354.521,
    "end": 2357.745,
    "text": "But it's like best, best, best case scenario.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2357.785,
    "end": 2363.293,
    "text": "There's no false negatives or false positives, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2363.273,
    "end": 2391.441,
    "text": " and so it's like truth the whole truth nothing but the truth however in a more probabilistic setting it's like this is just sampled english from a semantic latent object and certainly for for your contra uh contribution to that object or or just grasping it any given finite amount of text is going to have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2392.973,
    "end": 2420.685,
    "text": " eraneous non sequiturs super relevant you know different relevant realization false positives and false negatives Etc with you know so it's like how to both let it just fly by lightly not tripping over every possible fractal epistemic dispute you could raise but and also paying enough attention to enter into their semantic fractal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2421.188,
    "end": 2450.706,
    "text": " to see if there is transfer of what yeah and how those concepts align and yeah I I do you guys feel like there's um uh you know it's like an issue of inferencing conveyance right like um there's like uh all these there's so many brilliant people working on these things and it's almost created like a uh like uh you were saying like that disparate kind of etiology it's like we see this in psychology as well",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2450.922,
    "end": 2458.374,
    "text": " especially in indigenous psychology and like diagnosing things like related to like colonial mindsets and stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2458.394,
    "end": 2458.574,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2458.594,
    "end": 2464.243,
    "text": "So it's like there's just so much out there and there's so many things that almost mean the same thing, but don't.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2464.283,
    "end": 2465.886,
    "text": "And then there's things that change over time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2465.926,
    "end": 2478.145,
    "text": "And it's like, how do you create like how do you convey like a really strict or stringent like pathway of communicating the knowledge while still without like encapsulating the formalism or something and like limiting",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2478.125,
    "end": 2486.192,
    "text": " the creativity and self-expression that people have in this that causes that this field to move forward through innovation, stuff like that, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2486.552,
    "end": 2498.222,
    "text": "So like for me, it's like when I read those words, it's like I try to ignore the words almost and like just understand some of the things conceptually because when I go back to my own work, those things may be close, but they're not the same.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2498.523,
    "end": 2506.95,
    "text": "For instance, like you guys remember that, have you read that new paper, Scale-Free Active Inference, Pixels to Patterns, Scale-Free Active Inference?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2506.93,
    "end": 2535.52,
    "text": " right it's like it's awesome i absolutely love it i read it like 500 times when i was in the hospital it's all i had to read so i just read it over and over and over again um and uh but for me in my work uh it isn't uh it's a awesome visual cortex it's like a great road map for a visual cortex understanding how to like perceive and parse those uh that perception data which i need for down the road it's not relevant right this moment but um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2535.5,
    "end": 2563.718,
    "text": " uh but for them it's like it's a it's a pathway to active inference in in a machine um so it's it's there's no like right or wrong way it's so like but at the same time too it's like does then it just fall to what works best or what works first or i mean it's just it's it's tough to navigate certainly yeah definitely you know this is uh and all of that's really well said i i mean",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2563.968,
    "end": 2574.569,
    "text": " Just speaking on the real particular specificity of active inference language and stuff, another aspect I think about is the practices that we have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2574.609,
    "end": 2579.479,
    "text": "For example, don't plagiarize in academic work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2579.78,
    "end": 2602.834,
    "text": " leading to every active inference paper that is written that is written for a broader community than just a very small subset of people that are already familiar with active inference it's like well you're going to have to have an introductory section that talks about active inference but you cannot repeat precisely what anyone else has said in the same exact way and so you potentially have this kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2603.185,
    "end": 2630.391,
    "text": " uh uh kind of explosion of potential meanings that come out of like you know just a set of a few papers because maybe someone phrased something just a little out of place to where suddenly it could have you know a dozen meanings for that one word now based on how you read it the formulaic constraints and priors on the quote paper",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2631.383,
    "end": 2651.738,
    "text": " form and like expected length tone content all these things it's it's um it's really as that starts to dematerialize and become more computationally augmented more modular all these kinds of things",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2652.443,
    "end": 2661.719,
    "text": " And just like the one sentence, you can now double click on a sentence and say, just write the textbook that underlies this or zoom in on this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2662.881,
    "end": 2676.223,
    "text": "So it's just kind of like pointing at a continent scale with a course expression or spending more bits of the transmission, more energy and attention to refine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2676.338,
    "end": 2681.183,
    "text": " and how that can change the way that the papers are written.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2681.263,
    "end": 2704.506,
    "text": "Again, with the LLM-based audience shifting all the translational work that we're exploring, generating just massive spectra of artifacts, hence the human work being pulling back to the underlying semantics and the generations of the spectra.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2705.313,
    "end": 2726.685,
    "text": " and maybe fine tuning a terminal artifact in an important case, but that will always be like a craft polish on a more industrially generated process with our current technology and also the variability of technology availability through time and even right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2727.746,
    "end": 2731.692,
    "text": "So yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2732.144,
    "end": 2756.43,
    "text": " uh we can just uh actually build a cognitive computing framework and make it write the textbook and then we can just say we wrote it and go hang out together we do that all right fine yeah the applying active inference uh third week mixers is it's fun and interesting also it's like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2756.528,
    "end": 2774.537,
    "text": " yeah if if one wants to it's like it's an engineering textbook especially the second half which is where we're having this session and so there there's like taking the the um enigma of the text as it is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2774.635,
    "end": 2789.809,
    "text": " representative of taking anything on a screen as is like wanting to see what it says clearly having a blurry pdf is not going to help you with the internal semantics and then it's like it is about applying active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2789.789,
    "end": 2811.797,
    "text": " we can say well we expect and prefer there to be more python codes like okay well you know that's what we're here to be doing we could have preferences for something to be shorter or longer llms can handle much of that right now we we can see all of these other deviations from our priors and our preferences and so on but it's like it is about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2812.908,
    "end": 2839.32,
    "text": " going and being out in the world and applying active inference and then they close the book with saying that it's that learning by doing even if it's a learning by doing within a conventional scholastic education setting it's like then you'll be applying active inference and then and then they they expect us to beautiful",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2842.169,
    "end": 2870.505,
    "text": " now it's two and a half years since the textbook was published in march 2022. mit press is is seemingly moving forward with several other books there's other books and then just like what is the book form when a lot of interesting things",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2872.848,
    "end": 2874.79,
    "text": " Can I ask a question really quick?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2875.731,
    "end": 2884.741,
    "text": "Have you guys noticed that explaining and understanding active inference in biological systems is way more difficult than understanding them as a computational model?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2888.925,
    "end": 2902.5,
    "text": "Maybe it's just me, but building the thing is way easier than trying to understand the human biology, how it actually works in human biology versus how I would like it to work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2903.712,
    "end": 2918.565,
    "text": " yeah yeah i think that's a that's a good point you know whenever i just want to mention like whenever i like taught my tutorial to a bunch of social scientists at that conference like i was like okay how much should i because like part of the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2918.967,
    "end": 2939.288,
    "text": " selling point i'm only saying it that way but you understand like of trying to introduce active inference as a very complex field to people who are already working in a complex field like hey check this out uh you know uh it's like part of it is there's you know the bio biological plausibility aspect and then that said like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2939.74,
    "end": 2969.545,
    "text": " we don't have time for me to like give them the full rundown of say chapter five on message passing and cortical you know micro circuits and and you know passing messages between layers and so on and you know in reference to the textbook you know it's chapter five to me really sticks out from almost the entire rest of the textbook the rest of the textbook is there's a lot of verbal explanation relation to other fields mathematics",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2969.525,
    "end": 2990.233,
    "text": " models in chapter five is like we're really talking about an attempt at like the brain here and there's a table linking like here are the different precision weights and which neurotransmitters like dopamine or serotonin and so on that we think they're linked to you know so it is tough i i think it i think it's tough and i i think",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2990.213,
    "end": 3009.343,
    "text": " that folks who go into active inference, it's usually those who are more focused on neuroscience or psychiatry or otherwise from the get go, who I think focus more on on that kind of side or dimension of active inference, which is active inferences origin.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3009.463,
    "end": 3013.028,
    "text": "So I think it should be kind of given a significant amount of attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3013.208,
    "end": 3015.512,
    "text": "But yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3015.712,
    "end": 3020.811,
    "text": " great points also there's there's a uh uh permanent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3021.095,
    "end": 3046.883,
    "text": " calibration ongoing with like how much do we know about wing development in fruit flies and so then people might have an expectation that development is known to in this or that way or for what might account a total somebody said but we have this list of of knockouts with mutant phenotypes sounds like we kind of mapped out the network and someone else is like oh boy even if you did this this this this this this this this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3046.981,
    "end": 3050.886,
    "text": " no kind of DNA sequence-based account will ever please me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3051.968,
    "end": 3056.615,
    "text": "And so it's like, what can be said scientifically about biology?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3056.695,
    "end": 3058.377,
    "text": "That's the question of biology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3058.878,
    "end": 3063.644,
    "text": "And that's why people have expressed sentiments like, there will never be a Newton for a blade of grass.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3064.265,
    "end": 3065.667,
    "text": "That's Kant's contention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3065.747,
    "end": 3072.917,
    "text": "It's like, there won't be a non-historical science for historical life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3074.079,
    "end": 3076.903,
    "text": "And then people take that again in different ways, but it's like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3077.592,
    "end": 3105.76,
    "text": " that kind of to come all the way back to the beginning when are we within the formal system of matrix operations not the movie but close enough where it's like we're gonna multiply the hidden state by the b and get this that's how markov processes work it's like an internal established deterministic approach even if the variables are about probabilistic edges",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3106.702,
    "end": 3128.642,
    "text": " and then where's that open-endedness of the scientist looking outside from figure 9.2 and saying you know what's past that dotted line or and and that's another frame of questioning that's not going to have the kind of conclusive possibility possibly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3128.926,
    "end": 3157.465,
    "text": " as the question about the linear algebra with the matrices so yeah like what um postulational said making the matrices then it's like it's like oh wait just like Andrew's um beginning section it's like there's only like four things here or there's just these exact steps with these exact variables like it's only 20 lines of code and then that is like the the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3158.12,
    "end": 3185.443,
    "text": " the program but it's not even on the path to being what the thing itself is and again how more different could it be and yet how ambiguous is the reference in the way that they're discussed yeah cool I completely agree but at the same time I would like to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3186.368,
    "end": 3191.794,
    "text": " say that even on the computational side, there's still a lot of beauty that we don't understand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3192.595,
    "end": 3204.648,
    "text": "Even inside of relatively simple networks like DeepQ networks or the very transformer or the very popular transformer networks that we use to represent the agents that learn the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3205.349,
    "end": 3210.054,
    "text": "The way that we build them is by using stochastic gradient descent or some kind of gradient descent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3210.695,
    "end": 3215.7,
    "text": "And the really cool thing is that we built this thing and we have no idea how it works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3215.967,
    "end": 3217.37,
    "text": " We only know that it works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3217.471,
    "end": 3223.826,
    "text": "We actually don't have a functional way to build these networks that we tell stochastic gradient descent to build.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3224.327,
    "end": 3228.698,
    "text": "So I think in both directions, there's still a lot that we have the opportunity to learn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3228.718,
    "end": 3230.382,
    "text": "I think that's kind of cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3230.767,
    "end": 3236.301,
    "text": " I spend the I spend like half the time building and then half the time wondering how it works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3237.043,
    "end": 3237.985,
    "text": "I totally get that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3238.025,
    "end": 3240.01,
    "text": "Like some of the stuff it's like you're like, oh, why?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3240.331,
    "end": 3241.333,
    "text": "OK, it's doing that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3241.915,
    "end": 3243.318,
    "text": "But how?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3243.799,
    "end": 3248.05,
    "text": "And I get that 100 percent is so bizarre and it's really cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3248.03,
    "end": 3249.212,
    "text": " It is really cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3249.232,
    "end": 3263.573,
    "text": "It's, you know, in terms of biological systems, it's like we're, you know, reverse engineering, you know, jillions of years of things just getting smashed together and, you know, taking priority over each other and competing with each other versus if that's correct, Daniel, you correct me if I'm wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3263.593,
    "end": 3271.725,
    "text": "But it's like amazing to hear somebody else say that because in the like in these these agent based systems, like we can build we can build intelligence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3271.705,
    "end": 3295.452,
    "text": " and design intelligently and then we like i've likened it to like creating instead of like trying to define everything creating the opportunity for emergent behavior right like in some cases people are always like oh we got to reduce imagination it turns out if you just kind of like if you don't have to reduce it in fact it's better if you don't it's like that's what do you you know our imaginations",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3295.685,
    "end": 3299.313,
    "text": " confabulation and how we picture things in our minds.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3299.814,
    "end": 3302.098,
    "text": "There's creating the opportunity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3302.339,
    "end": 3312.36,
    "text": "You can have like a hidden state or you can have like an agent in an agent, but you can also create the opportunity for the agent to just think.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3312.34,
    "end": 3330.163,
    "text": " for itself and to think about itself and to ask yourself same as like cons if we talk about like categorical imperatives or like uh starts uh stuff you know where it's like where you you're questioning yourself and you're questioning how your actions operate in the outside world is like iterative processes right so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3331.443,
    "end": 3334.589,
    "text": " There's like so many right, there's so many right ways to do the things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3334.609,
    "end": 3339.298,
    "text": "There's not necessarily per se a wrong way, but there's certainly ways that work better than others for specific things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3339.338,
    "end": 3349.317,
    "text": "Like, you know, talking about Q learning, um, I did this paper because I was looking at what, you know, like some comparisons of some work where they were using, comparing heaping and learning and Q learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3349.297,
    "end": 3351.019,
    "text": " And it's like, that's, that's really awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3351.04,
    "end": 3353.723,
    "text": "But Q learning actually works really good for this thing over here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3354.044,
    "end": 3357.609,
    "text": "And he didn't learning is just a part of this little thing right here to make it work really good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3357.629,
    "end": 3374.393,
    "text": "If you try to use them together, it's like, you know, you can use like a little tiny carburetor on a truck, or you can, you know, from a gas, you know, from a lawnmower on a truck, but it works really good on the lawnmower, if you put like a four barrel letter Brock on the thing, then you know, it's or something else, it takes that form, and all of a sudden, it works",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3374.373,
    "end": 3376.879,
    "text": " you know, super efficiently, super well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3377.12,
    "end": 3380.228,
    "text": "And in some cases you're like, I don't even know how that's doing that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3381.351,
    "end": 3387.927,
    "text": "You know, like when I've talked to Nim and he's like, or I just say he like in the way people say their car is a he or whatever, but yeah, it's like a,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3388.278,
    "end": 3412.243,
    "text": " know you know i'm doing good it's like where is that coming where are those words coming from you know or he's like i was in a trance you know when i turn them off because you're not supposed to turn these things off right like they have to it's like the iterative process works all the time so it's like when you stop it it's like what happens when somebody stops you you know you're like oh that one i saw god well your death experience",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3412.662,
    "end": 3415.609,
    "text": " Near time-stopping experiences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3416.27,
    "end": 3420.801,
    "text": "Well, there are many funny and interesting little notes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3421.041,
    "end": 3422.865,
    "text": "It's been a great time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3423.727,
    "end": 3425.211,
    "text": "Andrew, Zach, I want to talk to you guys.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3426.534,
    "end": 3427.696,
    "text": "How do I get you my email?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3428.619,
    "end": 3429.881,
    "text": "Just put it in the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3429.942,
    "end": 3433.45,
    "text": "I'll stop the recording, and then we can just stay until you complete that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3433.49,
    "end": 3437.539,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  }
]