[
  {
    "start": 8.971,
    "end": 38.765,
    "text": " hello and welcome to the active inference lab today is april 14th 2021 and we're here in guest stream number 4.1 with elliott murphy so this is going to be a really interesting talk and elliott we appreciate you coming on so i'll just pass it to you to introduce yourself introduce the topic and then share some slides so anyone who's watching live or i guess later in the comments just ask questions and we'll have time during this presentation and at the end",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 39.065,
    "end": 39.986,
    "text": " to go over some comments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 40.046,
    "end": 42.448,
    "text": "But thanks again, Elliot, and looking forward to hearing this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 42.468,
    "end": 44.129,
    "text": "Awesome, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 44.329,
    "end": 45.27,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 45.37,
    "end": 50.194,
    "text": "So I am a postdoc working at UT Health in Houston, Texas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 50.574,
    "end": 58.981,
    "text": "I work on intracranial recordings of epilepsy patients doing a bunch of language tasks, trying to explore the neural basis of language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 59.701,
    "end": 65.486,
    "text": "And today I'm going to present some slides kind of reviewing a recent preprint that is currently in review.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 67.07,
    "end": 69.631,
    "text": " on active inference and the free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 69.651,
    "end": 72.473,
    "text": "I'm just going to share my screen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 76.314,
    "end": 77.015,
    "text": "Yep, looks good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 77.935,
    "end": 84.438,
    "text": "Okay, so yeah, I'm going to give you an introduction to the topic and then talk a bit about linguistics and then try and wrap up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 84.618,
    "end": 90.721,
    "text": "We'll make this more of a conversation, comments, questions, objections, obviously more than welcome for anybody.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 91.621,
    "end": 94.903,
    "text": "So yeah, like I said, this is the preprint that's currently in review.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 96.344,
    "end": 98.345,
    "text": " with Emma Holmes and Carl Friston at UCL.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 99.025,
    "end": 103.667,
    "text": "The argument is that natural language syntax complies in some degree with the free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 105.007,
    "end": 109.929,
    "text": "So just outlining some kind of really core basic principles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 110.649,
    "end": 115.131,
    "text": "I want to make this conversation a little bit more philosophical than normal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 115.531,
    "end": 125.975,
    "text": "Obviously, this lab is an active inference lab, so I want to kind of introduce some linguistics topics more than the FEP topics, because the audience might be less familiar with the kind of syntactic theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 126.783,
    "end": 132.607,
    "text": " So to begin with, natural language syntax yields what linguists then call an unbounded array of hierarchically structured expressions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 133.067,
    "end": 135.448,
    "text": "Unbounded meaning that they can potentially go on forever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 135.468,
    "end": 139.011,
    "text": "There's no upper bound on the limit of sentence lengths, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 139.031,
    "end": 144.154,
    "text": "You can always make any sentence longer by simply adding John said that at the beginning of it, and it gets longer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 144.554,
    "end": 152.719,
    "text": "The only thing that stops sentences going on forever is the working memory, the age of the average human being, and indeed the age of the universe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 152.759,
    "end": 154.08,
    "text": "You know, sentences can't just go on forever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 154.5,
    "end": 155.241,
    "text": "They have to stop at some point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 156.324,
    "end": 159.005,
    "text": " And what the genitive component in principle could do that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 159.446,
    "end": 163.667,
    "text": "That's the interesting part about language, the fact that you can, in principle, generate an unbounded array of expressions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 164.148,
    "end": 171.311,
    "text": "So I kind of argued in this paper that these are used in the surface of active inference, which is in turn in accord with the principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 172.111,
    "end": 179.535,
    "text": "But the general goal is to kind of align certain concerns of linguistics with those of the normative model for organic system behavior associated with the FPP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 180.675,
    "end": 184.197,
    "text": "So I'm going to be relying on theoretical linguistics with special emphasis on syntax.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 184.81,
    "end": 194.637,
    "text": " which is the system that determines the kind of order that words go in, the structure and the organizational relations between words and sentences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 195.458,
    "end": 203.544,
    "text": "So a lot of these design principles are kind of general to the biological component of language, not just for specific instantiations of language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 204.525,
    "end": 206.666,
    "text": "So they're not specific to English or French or Swahili.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 206.707,
    "end": 212.571,
    "text": "They're kind of general design principles about how the language system seems to be organized.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 213.938,
    "end": 221.805,
    "text": " So like I said, I want to kind of emphasize more on the linguistics topic more than active inference, just for the purposes of exposition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 222.886,
    "end": 226.849,
    "text": "Although the preprint itself has all the kind of relevant details if you're interested in reading more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 228.05,
    "end": 239.9,
    "text": "But yeah, kind of the brief historical background here is that since around the 10th century, about 20, 25 years ago, linguists have basically been developing theories of linguistic computation, which invoke economy principles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 241.616,
    "end": 247.197,
    "text": " Basically, the idea is that when you pass an instructive sentence, there are certain computations that enter into that process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 248.058,
    "end": 250.718,
    "text": "It's not just a single kind of chunk that you memorize or produce.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 250.938,
    "end": 253.519,
    "text": "You do it in discrete operations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 254.299,
    "end": 259.66,
    "text": "And yet, for some reason, there's currently no means of grounding or motivating these ideas through more general non-linguistic domains.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 260.841,
    "end": 270.443,
    "text": "So recently proposed principles of economy, such as minimal search or least-ever criteria, which I'll explain and give you definitions of soon, I argue that they adhere to the FUP",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 271.531,
    "end": 276.973,
    "text": " And if this can be shown, then this permits a greater degree of explanatory power to the FEP with respect to higher language functions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 277.833,
    "end": 282.175,
    "text": "And it also presents language with a first principle grounding of notions pertaining to computability and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 282.535,
    "end": 284.436,
    "text": "So in other words, the idea is this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 284.796,
    "end": 286.457,
    "text": "Natural language syntax is a system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 286.577,
    "end": 287.317,
    "text": "It's an organic system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 287.357,
    "end": 288.057,
    "text": "It's a formal system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 288.077,
    "end": 296.761,
    "text": "It can be described using the language of the theory of recursive functions and computability imported from computer science and all the rest of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 297.261,
    "end": 298.541,
    "text": "But there's a problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 298.601,
    "end": 300.002,
    "text": "All of these principles of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 300.535,
    "end": 305.356,
    "text": " economy and language design in the literature are unsurprisingly kind of language focused, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 305.376,
    "end": 309.177,
    "text": "They have a very kind of linguistically encoded background.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 309.918,
    "end": 329.183,
    "text": "And so there's a bit of paradox because one of the original goals of this program was actually to see, okay, let's see how much of language is actually can arise through the kinds of formal principles that govern the organizing shape of snowflakes or the mythology of lightning bolts and so on kind of just general",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 330.69,
    "end": 335.971,
    "text": " domain general laws of nature, essentially, that can give rise in different ways across different domains.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 337.072,
    "end": 347.354,
    "text": "And yet the linguistic literature is still kind of encoding these in language-specific terms rather than relating them to more general principles of brain organization or mental computation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 347.854,
    "end": 350.915,
    "text": "So that's the kind of background.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 351.815,
    "end": 355.056,
    "text": "So many historical insights into syntax, I argue, are kind of consistent with the FEP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 355.612,
    "end": 364.619,
    "text": " which provides a novel perspective under which the principles governing syntax are not limited to language, but they actually reflect domain general processes that underpin a variety of cognitive computations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 365.52,
    "end": 377.369,
    "text": "This is also consistent with a strain within theoretical linguistics that explores how syntactic computation may adhere to general principles that may well fall within extra-biological natural law, in particular considerations of minimal computation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 378.015,
    "end": 383.357,
    "text": " certain linguistic theories might be engaging with general properties of organic systems that impact language design.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 383.657,
    "end": 405.506,
    "text": "So I think that's kind of a beautiful idea, the idea that the language that we speak, English, French, German, not only are they biologically grounded, but actually the rules that kind of govern what you can say, what you can't say, and indeed how your brain computes and passes sentences, part of that process you kind of get for free if you just assume extra biological natural law.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 406.337,
    "end": 408.558,
    "text": " one of which you can argue is the French principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 408.818,
    "end": 409.938,
    "text": "So that's the kind of background here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 411.999,
    "end": 415.52,
    "text": "So the structuring influence of the FP can be detected in language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 416.3,
    "end": 435.185,
    "text": "Not only has it been argued recently at the complex level, Carl Christen and his colleagues have published a bunch of papers in the last year or two, mainly in 2020, arguing that active inference can relate to narrative comprehension, interpersonal dialogue, like when two people talk, cooperative intentional communication, and speech segmentation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 436.103,
    "end": 441.927,
    "text": " But I'm going to kind of argue that all of these things rely on something much more lower down, and that's syntax.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 442.368,
    "end": 448.552,
    "text": "If you can't syntactically construct a phrase, if you can't put two words together and form a phrase, you're not going to get very far, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 448.572,
    "end": 457.858,
    "text": "You at least need to do that in order to engage in intentional cooperation and narrative and storytelling and speech segmentation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 458.139,
    "end": 460.5,
    "text": "You at least need to be able to form a phrase, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 460.8,
    "end": 461.401,
    "text": "If you can't do that,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 462.17,
    "end": 463.371,
    "text": " you can't do anything to do with language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 463.991,
    "end": 478.741,
    "text": "So I'm kind of arguing that all of the ways that the FEP can be related to all of these things here arises from a more fundamental, lower-level consideration to do with the way that phrase-level computations are executed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 479.541,
    "end": 482.023,
    "text": "Hey Elliot, have you changed any slides?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 482.043,
    "end": 483.384,
    "text": "We can't see any slides changing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 486.155,
    "end": 512.388,
    "text": " okay uh yeah i have changed a few slides just maybe unshare and reshare but okay it stands alone what you've said as well but it will be also good to have the visual let's see um okay how about this so we see your mouse and then just advance like on the left bar like click on to your next slide yep perfect okay what about now no",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 514.378,
    "end": 543.168,
    "text": " okay oh i see my bad my bad okay um well i might have to like window in focus yeah this just as a non-linguist was really interesting that you appealed to like kind of bigger laws than linguistics like complex systems theory or snowflakes and lightnings like you said and then yeah just pointing out that you're kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 544.27,
    "end": 549.313,
    "text": " bringing linguistic level rules or patterns into a bigger scope.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 549.453,
    "end": 550.253,
    "text": "Okay, cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 550.274,
    "end": 552.315,
    "text": "So we see it with the Chomsky now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 553.155,
    "end": 553.495,
    "text": "Perfect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 553.775,
    "end": 556.557,
    "text": "Okay, well, I've only skipped like five slides.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 556.617,
    "end": 560.659,
    "text": "So everything I've just said is so yeah, I showed the paper, here's the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 561.32,
    "end": 566.082,
    "text": "And I simply regaged this, I sliced this, all of these things I've already read out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 566.102,
    "end": 568.484,
    "text": "So yeah, if you had what I said, then that's good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 568.864,
    "end": 569.044,
    "text": "Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 569.785,
    "end": 571.626,
    "text": "Okay, so can you see slide number eight?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 571.766,
    "end": 571.926,
    "text": "Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 572.106,
    "end": 572.246,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 572.975,
    "end": 573.475,
    "text": " Awesome, OK.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 575.236,
    "end": 595.761,
    "text": "OK, so if the process of constructing hierarchically organized sets of linguistic features into words and phrases and sentences can be shown to adhere to principles of efficient computation, then this process must also operate within certain fundamental constraints on neural dynamics, such as those implied by the FEP, to which the homeostatic brain minimizes the dispersion of intraseptic and ectroseptic states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 596.641,
    "end": 602.203,
    "text": "The FEP can also allow us to understand how natural language complies with the constraints imposed on worldly interactions",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 602.722,
    "end": 604.963,
    "text": " deriving certain features of language from first principles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 605.044,
    "end": 608.166,
    "text": "So again, at the moment, this is all pretty abstract.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 608.206,
    "end": 610.467,
    "text": "I'm going to give you some much more concrete examples.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 610.547,
    "end": 613.449,
    "text": "So I apologize if it's a little bit philosophical at the moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 615.13,
    "end": 624.976,
    "text": "So a number of robust findings from theoretical linguistics can be used to support the image of the brain as a constructive organ, assembling and inferring linguistic representations in the sense of surprise minimization and related goals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 625.677,
    "end": 627.938,
    "text": "So syntactic structures are not mind external entities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 628.319,
    "end": 630.42,
    "text": "They're not the kind of thing that physicists could easily examine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 631.035,
    "end": 632.856,
    "text": " but they're rather actively inferred by the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 634.217,
    "end": 643.782,
    "text": "Seemingly with the help of endogenous slow frequency activity coordinating cross-cortical gamut optimization of linguistic features according to a bunch of recent models of neurolinguistics, which I'm gonna get back to at the end.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 644.583,
    "end": 652.087,
    "text": "So in other words, we have a general framework for how syntax is implemented at the abstract level, and we also maybe have a kind of a decent understanding of how that's implemented in the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 652.107,
    "end": 655.049,
    "text": "So that's the kind of the long vision of this presentation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 655.089,
    "end": 657.97,
    "text": "At the end, we're gonna try and wrap it all up by returning to the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 659.312,
    "end": 661.853,
    "text": " But for now, I'll give you a more kind of concrete example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 662.274,
    "end": 664.455,
    "text": "So I said that syntactic structures have to be fair.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 664.755,
    "end": 665.735,
    "text": "They're a form of inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 666.036,
    "end": 667.777,
    "text": "They're inference generation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 667.797,
    "end": 670.278,
    "text": "They're not just passive perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 670.858,
    "end": 676.461,
    "text": "So if you have a structure like, we watched a movie with Jim Carrey, that can mean two things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 676.481,
    "end": 679.843,
    "text": "It can either mean the movie stars Jim Carrey,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 681.042,
    "end": 686.947,
    "text": " the Truman Show, say, we watched the Truman Show, or you actually watched the movie whilst sat next to Jim Carrey.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 687.727,
    "end": 688.848,
    "text": "It depends on how you parse it, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 688.868,
    "end": 693.952,
    "text": "It depends on which phrases get merged in which order, basically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 694.833,
    "end": 701.958,
    "text": "So there's a kind of general rough schematic here that you can kind of find an elaboration of in the preprint paper that I mentioned.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 702.559,
    "end": 708.964,
    "text": "But the basic idea is that there's structural ambiguity that arises from syntax, but therefore the whole process of syntax has to be an inference process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 709.471,
    "end": 712.273,
    "text": " It's not given to us on a spoon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 712.533,
    "end": 715.654,
    "text": "We have to do some homework in order to construct every possible parse.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 715.995,
    "end": 718.336,
    "text": "So that poses the problem, how does the brain do that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 718.416,
    "end": 719.516,
    "text": "It is an inferential process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 719.977,
    "end": 721.477,
    "text": "So what are the operations involved in that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 722.458,
    "end": 726.0,
    "text": "So here's kind of a standard, what are called pre-structures in linguistics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 726.92,
    "end": 729.482,
    "text": "There's two different ways of parsing the sentence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 729.542,
    "end": 735.705,
    "text": "You can either shoot an elephant who's wearing your pajamas, which is definitely possible, or you can shoot an elephant whilst wearing your own pajamas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 736.297,
    "end": 739.319,
    "text": " And it depends how you, in which order you merge the phrases, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 739.359,
    "end": 743.082,
    "text": "In which hierarchical relationship is exhibited, if that makes sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 743.102,
    "end": 749.767,
    "text": "So there's kind of a lot of theoretical background here in linguistics that I won't go into because that's a whole different lecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 749.827,
    "end": 753.109,
    "text": "But the basic idea is that there's an ambiguity in structure generation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 753.469,
    "end": 758.112,
    "text": "It's not always, language is not a system of beads on a string, it's a structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 758.853,
    "end": 765.918,
    "text": "So along that kind of theme, I'm also assuming a distinction in linguistics between what's called I-language and E-language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 766.36,
    "end": 767.941,
    "text": " And this is a really crucial distinction to get clear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 767.961,
    "end": 770.743,
    "text": "So I want to make sure that this makes sense to everybody.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 771.364,
    "end": 778.088,
    "text": "So an I language is the actual internal knowledge that an individual human being has in their mind brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 778.869,
    "end": 781.531,
    "text": "I stands to individual, internal and intentional.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 781.631,
    "end": 785.534,
    "text": "Intentional with an S meaning meaning, which literally means meaning, generating meanings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 786.034,
    "end": 788.936,
    "text": "On the other hand, you have what are called the E language perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 789.457,
    "end": 793.418,
    "text": " And that is actually arguably not really formable or coherent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 793.818,
    "end": 799.399,
    "text": "It's the idea that language is a kind of external system, a mind external and extramental system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 800.159,
    "end": 802.599,
    "text": "Like the English language is somehow out there in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 802.959,
    "end": 806.56,
    "text": "And when we learn the English language, we kind of approximate some kind of mind external system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 806.96,
    "end": 808.46,
    "text": "And we all have something in common, i.e.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 808.5,
    "end": 810.381,
    "text": "we all approximate to the English language in different ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 810.901,
    "end": 817.042,
    "text": "But the I-language perspective assumes that when we actually communicate with each other, the reason why we can successfully communicate",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 817.509,
    "end": 819.35,
    "text": " It's not because we share an e-language in common.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 819.671,
    "end": 826.556,
    "text": "It's because our iLanguages successfully and sufficiently overlap to the degree that we can actually communicate together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 826.576,
    "end": 827.977,
    "text": "So everybody's iLanguage is different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 828.598,
    "end": 832.361,
    "text": "It's often said that there's 7,000 languages on the planet, but that's obviously not true.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 832.401,
    "end": 834.562,
    "text": "There's actually however many people there are on the planet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 834.622,
    "end": 835.083,
    "text": "I can't remember.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 835.123,
    "end": 837.505,
    "text": "Is it like 7 billion or something like that, 7.5?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 837.985,
    "end": 839.166,
    "text": "And that's how many languages there are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 839.934,
    "end": 842.175,
    "text": " every human being has a different language faculty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 842.195,
    "end": 844.156,
    "text": "It's set, the parameters are set differently.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 844.477,
    "end": 847.538,
    "text": "We all have different idiolex, different understandings and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 847.738,
    "end": 849.179,
    "text": "And that kind of sounds really obvious, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 849.199,
    "end": 851.02,
    "text": "When you think about it, it's like, obviously that's true.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 851.6,
    "end": 856.002,
    "text": "But the implications for the study of language are actually pretty kind of impactful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 856.323,
    "end": 861.785,
    "text": "In other words, when we study linguistic competence, we are studying like a mind internal computational system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 862.586,
    "end": 864.447,
    "text": "We're not studying something outside.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 864.747,
    "end": 867.048,
    "text": "So the English language is not something that linguists actually study.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 867.188,
    "end": 868.709,
    "text": "We don't know, that's not a coherent concept.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 869.62,
    "end": 872.462,
    "text": " It's like the concept of culture or community or whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 872.902,
    "end": 875.044,
    "text": "These are not things that physicists could identify.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 875.784,
    "end": 877.465,
    "text": "That's not to say that we can't say things about them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 877.765,
    "end": 878.606,
    "text": "We can't abstract.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 878.626,
    "end": 882.348,
    "text": "The human mind can't construct theories of e-languages, I guess.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 882.408,
    "end": 891.594,
    "text": "You can talk about the English language changing over the decades, which is definitely a coherent way to talk about language, and you can study it in that way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 892.195,
    "end": 895.797,
    "text": "But from a naturalistic perspective, from a biological perspective, that's no use.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 895.817,
    "end": 898.999,
    "text": "The only way we can study it is based on what an individual mind-brain is doing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 901.673,
    "end": 916.003,
    "text": " So to give another example here, if you take a recent film that IGN released a trailer for yesterday, Hitman's Wife's Bodyguard, the defining property of language is said to be this unbounded array of hierarchically organized expressions via recation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 916.544,
    "end": 921.787,
    "text": "So recation is the defining property of natural language syntax, but it turns out to be distributed unevenly across the world's languages.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 923.068,
    "end": 929.753,
    "text": "So some people have argued that certain languages don't exhibit recation at all, but this actually tells us nothing about the actual biological language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 930.469,
    "end": 933.451,
    "text": " So in other words, speakers of these languages can easily learn Portuguese, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 933.791,
    "end": 938.574,
    "text": "So the idea is that language can easily and readily be exhibited by most of the world's languages.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 938.654,
    "end": 945.778,
    "text": "Again, when I say world's languages, I mean a kind of convenient description of every individual's fixed language faculty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 946.459,
    "end": 953.943,
    "text": "So most Germanic languages only allow a single pronominal genitive limited to proper nouns, but German doesn't allow recursive embedding of possessive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 954.444,
    "end": 958.066,
    "text": "So in German, you can say John's house, but you can't say John's sister's friend's house.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 959.351,
    "end": 967.299,
    "text": " So the above movie, when it's released in Germany, I assume it's going to have to be called something like The Bodyguard of Hitman's Wife, which has a slightly different tone to it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 967.92,
    "end": 974.607,
    "text": "So the idea is that this fundamental capacity of language to execute recursion, you can find it all over the place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 974.647,
    "end": 981.934,
    "text": "You can find it in phrase embedding, center embedding phrases, the way that we actually convert phrases, or you can find it in other ways, like in this example here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 983.76,
    "end": 999.465,
    "text": " So relating this back to the FEP, while the FEP is a variational principle of least action, such as those that describe systems with conserved quantities, a relatively recent program in linguistics has suggested that natural language syntax adheres to principles of least action and minimal search.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 999.505,
    "end": 1007.648,
    "text": "Modern theoretical linguistics remains comparatively remote from other fields in cognitive science, but certain postulates from this field resonate with the FEP and its literati.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1010.575,
    "end": 1015.656,
    "text": " So many biological and cognitive principles of efficiency might be special cases of a variational principle of free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1016.277,
    "end": 1024.839,
    "text": "Assuring this assessment should allow researchers from distinct disciplines to reevaluate their hypotheses and empirical evidence in terms of lower-level free energy, which is the kind of goal that I have in mind here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1025.559,
    "end": 1031.06,
    "text": "But we should also stress, as a recent paper does, that the FEP can be used as a methodological heuristic for research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1031.741,
    "end": 1032.701,
    "text": "But it's not a theory of everything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1032.741,
    "end": 1033.401,
    "text": "It's just a framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1033.821,
    "end": 1039.143,
    "text": "And actually, I find this very similar to a framework in linguistics called the Minimalist Program, which is a program.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1039.483,
    "end": 1040.383,
    "text": "It's not a coherent",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1040.731,
    "end": 1041.531,
    "text": " Not yet, at least.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1041.551,
    "end": 1045.852,
    "text": "It has a couple of theories, working theories, but it's not a coherent body of doctrine at the moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1045.872,
    "end": 1050.994,
    "text": "It's an ongoing research program with a particular ideology and framework, and that's exactly what the equity is, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1051.034,
    "end": 1059.556,
    "text": "It's a formal principle which yields and can contribute to a discrete, individual, and separate sort of theories, depending on what domain you're looking at.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1060.876,
    "end": 1062.776,
    "text": "So I kind of like the idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1062.816,
    "end": 1066.797,
    "text": "They're both programmatic notions, and you can implement them in different ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1069.755,
    "end": 1071.296,
    "text": " So we'll be working here with the FEP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1072.056,
    "end": 1074.437,
    "text": "The paper in question doesn't work on the FEP so much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1074.477,
    "end": 1077.118,
    "text": "It's an applied approach to the FEP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1077.278,
    "end": 1082.0,
    "text": "So the FEP has been argued to be more of a kind of conceptual mathematical model for self-organized systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1083.021,
    "end": 1092.265,
    "text": "And as a recent review by Andrews makes clear, there's a number of ways that the FEP has served as an aid to scientific work without constituting like falsifiable decisions about the state of nature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1093.225,
    "end": 1093.886,
    "text": "It's a program.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1094.006,
    "end": 1098.788,
    "text": "It's a way of usefully describing certain jumps of nature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1099.465,
    "end": 1103.488,
    "text": " without necessarily carving them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1103.729,
    "end": 1112.716,
    "text": "So when we argue that natural language syntax complies with the free energy principle, I'm not necessarily implying that the FAP necessarily bears specific direct predictions when it comes to behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1113.457,
    "end": 1121.123,
    "text": "It's rather a way of motivating the construction of novel conceptual arguments for how some property of organic systems might be seen as realizing the goals of the FAP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1123.103,
    "end": 1132.488,
    "text": " So as I said, repeating the our language, your language distinction, I'm focusing on knowledge which is internal to the mind of the speaker, exploring their parent competence rather than what they happen to produce.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1134.55,
    "end": 1138.572,
    "text": "So one example that you can think of immediately is the existence of syntactic structures",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1139.07,
    "end": 1145.092,
    "text": " can contribute to a unique form of epistemic corriging through maximizing model evidence and minimizing surprise and variation of energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1145.432,
    "end": 1166.74,
    "text": "The actual paper in question that I'm citing here kind of goes into more detail, but the basic idea is that the highly restricted set of syntactic projections, what I call the way that you can categorize a phrase and nouns and verbs and compromise a phrase and so on, that restricted set, that finite set of ways that you can define a particular phrase as being a verb phrase or a noun phrase, achieves that goal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1167.472,
    "end": 1175.162,
    "text": " So you can also assume that language users during comprehension select the phrase structure that's least surprising from the perspective of the hierarchical Jampton model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1175.754,
    "end": 1179.016,
    "text": " Again, this goes back to the we watched a movie with Jim Carrey example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1179.196,
    "end": 1182.838,
    "text": "It's prediction plays a pretty big role here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1183.539,
    "end": 1186.16,
    "text": "So our search phrase structure building can be cast as an internal action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1186.32,
    "end": 1193.364,
    "text": "It's an actual internal action that an individual does in the sense of the active inference framework that selects among competing hypotheses, i.e.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1193.865,
    "end": 1194.965,
    "text": "syntactic structures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1195.206,
    "end": 1197.227,
    "text": "You can parse it this way, you can parse it another way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1197.987,
    "end": 1200.489,
    "text": "And also the same goes for lexical semantics, not just syntax.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1201.494,
    "end": 1204.815,
    "text": " In other words, you can interpret an individual word one way or the other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1205.035,
    "end": 1206.276,
    "text": "And I'm gonna give some examples later.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1206.816,
    "end": 1214.918,
    "text": "So pretty much all of language from individual words up to sentences are inference generation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1214.938,
    "end": 1220.12,
    "text": "And also a little side point here, relating more directly to existing work on active inference and communication.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1220.14,
    "end": 1227.482,
    "text": "I think it's pretty interesting to note that the recursive combinatorial apparatus of syntax has been argued to facilitate recursive theory of mind, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1227.882,
    "end": 1229.743,
    "text": "So the ability, your ability to know",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1230.37,
    "end": 1232.911,
    "text": " that someone else knows, that she knows, that you know this, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1233.691,
    "end": 1249.977,
    "text": "And it could be seen, therefore, as deriving or piggybacking in some way active inference-based properties of high-order linguistic communication, which in turn serves to unveil the latent or hidden states that are other people's mental states, which is the kind of standard assumption in theory of mind active inference research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1250.338,
    "end": 1255.479,
    "text": "But I think it can be related much more directly to language once we understand that the extended kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1257.564,
    "end": 1262.025,
    "text": " use of theory of mind in language is, it comes directly from this recursive property, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1264.566,
    "end": 1267.967,
    "text": "Okay, so I'm now going to move on to kind of the more concrete examples.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1268.067,
    "end": 1274.729,
    "text": "Everything I've said so far is pretty philosophical and pretty abstract, but I want to kind of give you some actual concrete examples here so it makes a bit more sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1278.87,
    "end": 1284.131,
    "text": "So free energy provides additional constraints on what a computational system can be physically realized as, which is very useful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1284.773,
    "end": 1289.955,
    "text": " So take the first three principles in classical recursive function theory, which are functions to compose.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1290.655,
    "end": 1293.296,
    "text": "Substitution, primitive recursion, and minimization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1293.776,
    "end": 1296.797,
    "text": "These are all designed in a way that you might think of as computationally efficient.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1297.277,
    "end": 1299.278,
    "text": "They reuse the output of earlier computations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1300.318,
    "end": 1303.26,
    "text": "So for instance, substitution replaces the argument of functions with no function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1303.98,
    "end": 1310.122,
    "text": "Primitive recursion defines a new function on the basis of a recursive call to itself, bottoming out on a previously defined function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1310.655,
    "end": 1314.896,
    "text": " And minimization produces the output of a function with the smallest number of possible steps.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1316.277,
    "end": 1332.062,
    "text": "So the notion of minimizing surprise can be used to ground observations from theoretical linguistics pertaining to the grammar's propensity to reduce the search space during syntactic derivations, permit no tampering of objects during syntactic derivations, so it restricts the number of resources able to be combined in a given moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1332.642,
    "end": 1336.723,
    "text": "So in other words, this is kind of an abstract example, but I'm going to give you some more concrete ones soon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1337.572,
    "end": 1342.794,
    "text": " During any particular part of a sentence, you don't just search the lexicon and extract in your unit just because you can.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1343.034,
    "end": 1344.234,
    "text": "You only do so if you need to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1344.734,
    "end": 1354.137,
    "text": "If the current number of lexical items that you've already searched the lexicon for suffice to generate a given interpretation, then you don't need to search for more items.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1354.417,
    "end": 1355.217,
    "text": "That's sufficient, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1355.618,
    "end": 1359.059,
    "text": "So in other words, don't do more search when less search is possible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1360.379,
    "end": 1367.241,
    "text": "And it also relates to the grammar's propensity to limit the range of representation of resources able to be called upon during any given stage of comprehension.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1368.168,
    "end": 1372.792,
    "text": " So examining some core principles of occasion, natural language clearly exhibits minimization, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1373.612,
    "end": 1376.474,
    "text": "While binary branching of structures limits redundant computation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1376.675,
    "end": 1382.299,
    "text": "So binary branching calls back to that slide I showed a few minutes ago where you have these binary branching pre-structures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1382.799,
    "end": 1384.741,
    "text": "So I shot an elephant in my pajamas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1385.542,
    "end": 1393.768,
    "text": "That all relates to, that backend will be derived through successive implementations of a binary branching operation that simply puts two things together and gives it a sound identity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1395.267,
    "end": 1402.65,
    "text": " So natural language syntax also exhibits discrete units, obviously, there's individual words, which leads to a discreteness continuity duality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1403.551,
    "end": 1420.759,
    "text": "So syntax is driven by closeness of computation, so objects X and Y form a distinct object, X and Y. It's objects are also bounded, so there's a fixed list, so there's nouns, verbs, adjectives, adverbs, prepositions, commentizers, tense objects, little nouns and little verbs, aspectual elements.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1423.53,
    "end": 1424.751,
    "text": " and content-related notions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1425.432,
    "end": 1431.778,
    "text": "Their hierarchical ordering is based on a specific functional sequence as well, which imposes direct restrictions on combinatorics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1432.218,
    "end": 1435.261,
    "text": "These objects can be combined into cycles, so recursive embedding,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1436.089,
    "end": 1438.21,
    "text": " which can be extended to form non-local dependencies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1438.71,
    "end": 1441.852,
    "text": "So an example of that is you have number plurality marking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1442.352,
    "end": 1450.577,
    "text": "So you can say the keys to the old wooden cabinet are on the table, not the keys to the old wooden cabinet is on the table, because obviously is goes with keys.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1450.797,
    "end": 1454.359,
    "text": "They have to mark for, they have to agree in the number feature, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1454.699,
    "end": 1458.661,
    "text": "So that's an example where you have a non-local dependency between two elements.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1459.041,
    "end": 1460.102,
    "text": "So you have to hold it in memory",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1460.935,
    "end": 1462.837,
    "text": " even though they cross phrase boundaries.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1463.137,
    "end": 1469.822,
    "text": "So syntax still keeps on generating new structures, but you have to associate one element with a new element further down the road.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1471.283,
    "end": 1480.309,
    "text": "So these properties are in turn guided by principles of minimal search and least effort, which I'll show in a minute, fulfilling the goal of active inference to construct meaningful representations as efficient as possible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1480.329,
    "end": 1482.29,
    "text": "And I think that's really what it comes down to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1482.31,
    "end": 1484.572,
    "text": "That's the kind of core, crucial message here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1485.313,
    "end": 1487.574,
    "text": "If it can be shown that the language system",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1489.178,
    "end": 1495.923,
    "text": " constructs meaningful representations as efficiently as possible, then therefore it must be in accord with the FPP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1496.203,
    "end": 1498.765,
    "text": "And again, that contributes to surprise minimization amongst other goals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1501.067,
    "end": 1511.294,
    "text": "So from the perspective of FPP, the range of possible structures available to comprehenders provide alternative hypotheses that generalize, and as such preclude overfitting sensory data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1511.935,
    "end": 1518.22,
    "text": "So if the complexities of linguistic stimuli can be efficiently mapped to a small series of regular and regularized in the sense of learn,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1519.045,
    "end": 1525.306,
    "text": " syntactic formats, this contributes to the brain's more general goal of restricting itself to a limited number of characteristic states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1525.326,
    "end": 1529.107,
    "text": "So in other words, only change your belief about things if you have to, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1529.247,
    "end": 1534.248,
    "text": "By mapping syntactic structures to language external conceptual interfaces, now that's kind of a key term.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1534.548,
    "end": 1544.51,
    "text": "Language external interfaces, what that means is you have a narrow component of language, the kind of narrow, what's called the narrow faculty of language, but you can call it whatever you like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1544.791,
    "end": 1546.591,
    "text": "It's just the capacity to construct phrase structures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1547.051,
    "end": 1558.136,
    "text": " But then you have language-external mental modules, memory systems, and what have you, attentional control systems in the mind that are located across different cortical surfaces.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1559.177,
    "end": 1562.799,
    "text": "It's kind of the standard modular framework, I guess.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1563.239,
    "end": 1574.184,
    "text": "So by mapping these structures that have been generated by language to these language-external interfaces in a manner adhering to principles of economy, language can be seen as engaging in a series of questions and answers with sensory data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1574.204,
    "end": 1575.685,
    "text": "I'm not specific.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1577.742,
    "end": 1586.089,
    "text": " So other recent work in theoretical semantics assumes that there are, there are flexible concepts that language can interface with, and there are also non-flexible concepts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1586.609,
    "end": 1602.682,
    "text": "So in other words, there are systems, there are properties of human thought that the language system seems pretty keen on, and it likes to use and exploit a lot, but there are other modules of cognition that for some reason can't be linguistically encoded as easily.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1603.029,
    "end": 1604.47,
    "text": " That's kind of a weird property, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1604.51,
    "end": 1611.075,
    "text": "Why should we be able to linguistically encode and communicate about certain thoughts but not others?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1611.275,
    "end": 1616.679,
    "text": "So one example is many of the world's languages, again, when I say world's languages, I mean that in quotation marks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1617.099,
    "end": 1630.128,
    "text": "What I really mean is many of the individual human beings, they may use a quantification of numerosity, often typically seen as via this front of right or quantification network, which is interestingly closely linked",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1631.896,
    "end": 1633.037,
    "text": " to major language sites.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1633.377,
    "end": 1636.718,
    "text": "So that might be one of the reasons why it makes use of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1637.258,
    "end": 1642.761,
    "text": "But they make little use of colour, despite colour featuring just as prominently an ordinary experience, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1642.821,
    "end": 1644.561,
    "text": "Our sensorium is filled with colours.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1645.382,
    "end": 1648.883,
    "text": "And this might be due to the remoteness of occipital visual regions in the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1649.243,
    "end": 1649.943,
    "text": "Maybe, maybe not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1650.644,
    "end": 1651.364,
    "text": "That's one explanation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1651.484,
    "end": 1653.345,
    "text": "Maybe it's wrong, but it's one possible reason.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1653.965,
    "end": 1656.106,
    "text": "So for instance, one might imagine some functional morphine",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1656.693,
    "end": 1659.055,
    "text": " encoding brightness or shade of coloration in language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1659.075,
    "end": 1667.38,
    "text": "You can imagine, like if you were to invent a new language, you could encode color features somehow, or some kind of inflectional morphing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1667.92,
    "end": 1672.123,
    "text": "But that doesn't seem to be the case, even though, like I said, color is a pretty important part of everyday life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1673.004,
    "end": 1679.568,
    "text": "At the same time, language seems to make considerable use of certain contentful concepts, like evidentiality, but not others, like worry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1679.988,
    "end": 1683.07,
    "text": "Like, you know, no morphemes mark how concerned somebody is about something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1683.171,
    "end": 1685.412,
    "text": "I'm very concerned, I'm a little bit concerned, I'm not very concerned.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1686.435,
    "end": 1700.38,
    "text": " which seems to be making potentially neurally efficient use of specific easily accessible representational resources rather than less easily accessible cognitive modules to map complex meaning onto natural language expressions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1701.921,
    "end": 1710.204,
    "text": "So it's further been observed that language access has an artificial context which helps constrain what representations are recruited and what impact they have on reasoning and inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1710.848,
    "end": 1716.109,
    "text": " So words themselves are highly flexible and metabolically cheap sources of price throughout the neural hierarchy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1716.209,
    "end": 1719.27,
    "text": "This is a really cool idea that I'm going to expand on in a few minutes of time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1720.25,
    "end": 1728.292,
    "text": "So to give you some more examples of, again, relating this back to active inference, take the second blue ball to the left of the large box.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1728.752,
    "end": 1733.213,
    "text": "That's a pretty simple spatial direction, but it can only be encoded via natural language syntax.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1733.993,
    "end": 1736.794,
    "text": "You need that kind of hierarchically organized phrase structure",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1737.182,
    "end": 1738.583,
    "text": " to generate that particular thought.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1738.763,
    "end": 1745.786,
    "text": "It's a very simple thought, very simple direction, but you can only generate inference about it through using the recursive combinatorial operative language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1746.367,
    "end": 1751.349,
    "text": "Similarly, you have structures like the young, happy, eager, either going to Oxford or Cambridge, pleasant man.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1751.809,
    "end": 1755.951,
    "text": "This involves unbounded, unstructured coordination involving disjunction too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1755.971,
    "end": 1760.314,
    "text": "So the disjunction is X or Y, which is a highly complex structure to compute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1760.334,
    "end": 1765.156,
    "text": "It's a highly complex conceptual structure, and yet language users can easily do it and readily impair it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1765.404,
    "end": 1774.731,
    "text": " But it also opens the door for a whole new species of inferences to be generated, new thoughts about the world, new possible hidden states, new things that you can think about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1774.811,
    "end": 1792.463,
    "text": "One of the examples of Jerry Fodor, the philosopher used to give is, he said, you know, if you take a pen and a piece of paper, you can easily draw a man, you can easily draw a zebra, but it's kind of difficult to draw the thought that there is not a zebra next to you, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1792.81,
    "end": 1797.134,
    "text": " So if you try and conceptualize the thought, there is not a zebra next to me, how can you draw that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1797.274,
    "end": 1799.916,
    "text": "How can you depict the fact that there is no zebra next to me?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1800.356,
    "end": 1800.837,
    "text": "That's kind of weird.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1800.877,
    "end": 1801.778,
    "text": "It's kind of difficult to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1802.218,
    "end": 1807.602,
    "text": "I suppose you could draw like a man and then a zebra and a line through the zebra, but that's kind of weird.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1808.043,
    "end": 1810.925,
    "text": "That still presupposes that there's a zebra next to him that you reject.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1812.062,
    "end": 1816.923,
    "text": " So language generates a whole new species of, a new format for thought, basically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1816.983,
    "end": 1820.304,
    "text": "It generates a new format for thought which seems to be unique.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1820.524,
    "end": 1826.305,
    "text": "In other words, not readily translatable into other domains like visual representation and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1826.965,
    "end": 1832.546,
    "text": "So these rapid inferences of our properties and states, hidden states, can be generated relatively effortlessly by language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1832.986,
    "end": 1836.547,
    "text": "And like I said, no other computational system in human cognition can achieve this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1837.447,
    "end": 1838.227,
    "text": "Well, that's the idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1839.81,
    "end": 1842.733,
    "text": " So a number of economy principles have been proposed in theoretical linguistics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1843.654,
    "end": 1851.1,
    "text": "These are all very technical syntax-related notions, so I'm not going to explain too many of them, but I will give some examples.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1851.441,
    "end": 1865.934,
    "text": "These have all been framed, like I said at the beginning, they've all been framed exclusively within a linguistic context, invoking highly domain-specific notions, despite a core part of the intended project of modern theoretical linguistics being to embed linguistic theory within principles general to cognition, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1866.63,
    "end": 1872.713,
    "text": " So, for example, the inclusiveness condition maintains that no new elements can be introduced in the course of a particular syntactic derivation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1873.133,
    "end": 1883.078,
    "text": "So once you're passing a particular sentence and you're deriving a particular representation of that, you're not just going to randomly introduce a new lexical item or a new hidden element just for the sake of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1883.258,
    "end": 1886.679,
    "text": "You're only going to do it if it contributes to immediate interpretation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1886.759,
    "end": 1890.481,
    "text": "And so only existing elements can be rearranged, restricting available resources.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1891.141,
    "end": 1896.204,
    "text": "But it's also unclear to what extent this computational principle finds analogous examples in non-linguistic domains.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1898.168,
    "end": 1915.412,
    "text": " So one way of motivating these language-specific generalisations by making direct reference to the FEP will not only foster, I think, more fruitful relationships between theories of power population and neurobiology, but will also broaden the explanatory scope for the existence and prevalence of particular syntactic phenomena.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1916.993,
    "end": 1922.074,
    "text": "But what's interesting to note is that linguists readily admit they're lacking a specific theory of computational official language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1922.394,
    "end": 1924.255,
    "text": "Like I said at the beginning, it's kind of a program, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1924.335,
    "end": 1925.355,
    "text": "It's a programmatic notion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1925.828,
    "end": 1935.014,
    "text": " So in a recent paper, Galeo and Chomsky point out, to be sure, we do not have a general theory of computational efficiency, but we do have some observations that are pretty obvious and should be part of that theory, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1935.354,
    "end": 1936.515,
    "text": "That's basically the state of the field.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1937.095,
    "end": 1951.225,
    "text": "Linguists have very well-hung theories of language-specific efficiency criteria, but translating that into kind of more domain general goal areas has not been so successful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1953.663,
    "end": 1969.954,
    "text": " But we can at least suppose that whatever definition will be forthcoming will be related to more generic notions of economy, like Hamiltonian notions, or minimizing energy expenditure during language processing, shortening description length, you know, minimal description length, reducing comma dot complexity, and the degree of necessitated belief updating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1970.074,
    "end": 1973.676,
    "text": "Again, like I said, you know, revise one's belief if needed, and what have you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1975.778,
    "end": 1980.921,
    "text": "So one of these so-called minimal computational procedures",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1981.661,
    "end": 1983.562,
    "text": " is what's called relative bias minimality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1984.162,
    "end": 1998.468,
    "text": "So this is the principle that states that given a particular configuration, X, Z, and Y, a local relation cannot connect X and Y if Z intervenes and Z fully matches the specification of X and Y in terms of the regular features.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1998.889,
    "end": 1999.689,
    "text": "I'll give an example of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2000.109,
    "end": 2013.032,
    "text": " So in other words, if X and Y attempt to establish a syntactic relation, if you call back to the long-distance dependency thing I mentioned, but some element intervenes and can also provide a superset of X's particular features, i.e.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2013.172,
    "end": 2015.813,
    "text": "X's features plus some other features, this blocks the relation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2016.913,
    "end": 2021.214,
    "text": "That sounds extremely abstract, so I do apologize for that, but this is a more concrete example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2021.654,
    "end": 2029.476,
    "text": "So in the sentence you have in 1, which game provides a superset of the features hosted by how?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2030.08,
    "end": 2031.541,
    "text": " which results in unacceptability.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2032.261,
    "end": 2043.786,
    "text": "But the equivalent does not obtain in two, and so a relationship between both copies of which game can obtain, licensing interpretation, and the strikethrough denotes the originally merged position after movement has taken place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2043.886,
    "end": 2049.689,
    "text": "So it's originally merged down here, and then you move the structure to the beginning of the sentence to form a question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2049.969,
    "end": 2056.012,
    "text": "So question formation often involves just moving all element in the middle or the end of the sentence to the beginning to form a question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2057.274,
    "end": 2060.156,
    "text": " So if you say, how do you wonder which game to play?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2060.756,
    "end": 2061.977,
    "text": "That sounds pretty ungrammatical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2062.498,
    "end": 2067.801,
    "text": "But if you say, which game do you wonder how to play, which has the same approximate interpretation, that's okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2068.361,
    "end": 2074.565,
    "text": "And the reason why is because how hosts only a Q feature, a question feature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2075.046,
    "end": 2079.488,
    "text": "And as it searches down the structure, it encounters which game.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2081.018,
    "end": 2092.489,
    "text": " bears a queue feature because of which, but it also has a noun feature because of game, and so therefore it can't reach its final destination, the final destination being its originally merged position after play, which only has a queue feature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2092.989,
    "end": 2106.642,
    "text": "On the other hand, if you move which game to above Do You Wonder, and you leave How in situ, then which game carries these two features here, and it skips over How, because How does not satisfy the full feature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2110.532,
    "end": 2115.834,
    "text": " And then only when it searches back and reaches to its originally merged position does it interpret it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2115.854,
    "end": 2122.535,
    "text": "So what this means is when you say, which game do you wonder how to play, you're interpreting which game at the position of play.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2122.996,
    "end": 2125.596,
    "text": "Because you're not interpreting it at the position of wonder.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2126.036,
    "end": 2129.817,
    "text": "You're not asking which game do you wonder how you wonder.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2130.118,
    "end": 2131.938,
    "text": "You're asking which game do you wonder how you play.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2132.298,
    "end": 2135.079,
    "text": "It's all about, the question is about the play on it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2135.882,
    "end": 2143.651,
    "text": " And so this has been argued to emerge directly from minimal search, allowing this higher level representational principle to emerge directly from properties of efficient computation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2144.051,
    "end": 2155.824,
    "text": "This is one example where you have a kind of rhetorically kind of gross, higher order principle in linguistics being reduced to a lower level and more simple kind of element.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2156.42,
    "end": 2171.516,
    "text": " So translating that into minimal search, you can consider, as I just said, when you search the structure for matching features in two, the minimal search procedure would simply skip out, but it'll find the original copy of which game because it's searching across the full structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2175.31,
    "end": 2183.797,
    "text": " So another example of economy can be found in the principle of full interpretation, which simply states that there are no superfluous symbols allowed at the two linguistic interfaces.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2184.257,
    "end": 2187.279,
    "text": "So these interfaces are assumed to be the conceptual and sensory motor systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2187.64,
    "end": 2192.764,
    "text": "So in other words, the two things you can do with a linguistic structure is you can interpret it, or you can externalize it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2192.944,
    "end": 2197.807,
    "text": "You can produce it, you can say it, you can sign it, you can translate it into braille, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2198.608,
    "end": 2199.349,
    "text": "Or you can simply think it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2199.969,
    "end": 2206.051,
    "text": " So this ensures that the system need not compute symbols that are ultimately superfluous to the goals of either interpretation or externalization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2206.671,
    "end": 2211.892,
    "text": "So for instance, in 3, this has an argument that does not have a semantic role, so therefore it's unacceptable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2212.313,
    "end": 2215.433,
    "text": "So you can imagine the sentence, Walt gave Jesse a gun.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2215.453,
    "end": 2216.034,
    "text": "That's fine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2216.154,
    "end": 2217.714,
    "text": "All the semantic roles are filled.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2217.794,
    "end": 2221.015,
    "text": "There's an agent, there's a patient, and there's an instrument being involved, a particular tool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2221.63,
    "end": 2226.155,
    "text": " But then if you add to saw, there's an additional kind of location preposition being marked there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2226.415,
    "end": 2228.878,
    "text": "But it doesn't have a semantic role, so it can't be interpreted.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2229.539,
    "end": 2230.901,
    "text": "And that sounds kind of trivial, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2231.041,
    "end": 2235.606,
    "text": "Like most people, when you give them these examples, they say, well, yeah, obviously, that's kind of not a very deep thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2236.006,
    "end": 2237.969,
    "text": "But actually, it's a pretty puzzling phenomenon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2238.309,
    "end": 2239.31,
    "text": "It demands explanation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2239.43,
    "end": 2240.572,
    "text": "It has to be explained somehow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2242.912,
    "end": 2248.756,
    "text": " So one of the operations that's been involved in this minimal computational procedure is called merge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2249.136,
    "end": 2252.738,
    "text": "So the operation merge simply takes X and Y and forms the set XY.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2253.038,
    "end": 2254.159,
    "text": "It just puts two things together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2255.019,
    "end": 2258.221,
    "text": "And this constructs the binary branching structures that I mentioned.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2258.702,
    "end": 2269.388,
    "text": "But merge itself can also derive some core set theoretic properties of linguistic relations, such as membership, dominate, term of, and so on, these different hierarchical relations between nodes in a tree.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2270.46,
    "end": 2280.183,
    "text": " one branch of a tree being higher up or more deeply embedded than another one, as well as other relations, what's called C command, we can put that aside.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2280.743,
    "end": 2290.665,
    "text": "So in brief, much of the complexities of syntactic relations can be derived from successive instances of this simple merge computation, reducing complex visibles to simple invisibles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2292.166,
    "end": 2297.627,
    "text": "So for instance, the example I gave here with which game, you can imagine",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2298.526,
    "end": 2325.108,
    "text": " the set A, B being constructed, and then if you take the same element B and you merge it with the set again, you get B, A, B, and then you can delete the first appearance of B, and then you simply get the linear order would be B, A, right, rather than the actual set being interpreted B, A, B. And this seems to be what's happening here, where you have a B over here, which again, and then an A, the full structure, and then B again, being originally merged.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2325.902,
    "end": 2337.305,
    "text": " So all of these superficially complex linguistic phenomena, which on the surface seem very complicated and very elaborate, they can all be boiled down to a very simple operation, which is just take two things and put them together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2339.185,
    "end": 2347.248,
    "text": "And what's interesting about this is that related phenomena, like a junction, do not involve modification of the semantic content of the structure the adjunct is concatenated with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2347.488,
    "end": 2352.629,
    "text": "So an adjunct is something like a prepositional object, like in the park or to the beach.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2353.67,
    "end": 2361.558,
    "text": " So, for instance, if you take a structure like John and Mary talked in the park, the fact that they talked in the park doesn't change the fact that they talked, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2361.879,
    "end": 2369.447,
    "text": "So the actual original interpretation, the syntactic structure of the integrity and the meaning of John and Mary talked is not changed by adding an adjunct.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2369.94,
    "end": 2374.942,
    "text": " So you can add an adjunct in the part, but that doesn't change the fact that John and Mary still talk, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2375.282,
    "end": 2377.043,
    "text": "Again, that sounds like a very trivial property.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2377.063,
    "end": 2378.664,
    "text": "It's obvious, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2379.084,
    "end": 2380.384,
    "text": "But again, it demands explanation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2380.524,
    "end": 2382.245,
    "text": "There has to be a reason for that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2382.305,
    "end": 2387.267,
    "text": "And the reason why is it turns out that when you add an adjunct, you simply concatenate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2387.507,
    "end": 2388.948,
    "text": "You simply linearly add it to the end.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2389.228,
    "end": 2391.869,
    "text": "You don't change the actual identity of the phrase itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2392.369,
    "end": 2394.29,
    "text": "There's no, what's called labeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2394.31,
    "end": 2396.791,
    "text": "There's no labeling involved in prepositional merging.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2396.831,
    "end": 2398.572,
    "text": "So you don't change the identity of the phrase.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2400.236,
    "end": 2405.74,
    "text": " So the FEP has been equated with the principle of least effort, and its process theory is active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2406.22,
    "end": 2409.162,
    "text": "So strictly speaking, the FEP basically is a computational principle, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2409.782,
    "end": 2415.226,
    "text": "The probabilistic beliefs it's concerned with are directed at something, namely external states of a self-organizing system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2415.787,
    "end": 2422.571,
    "text": "And in a similar way that the FEP is a research heuristic, so too is much of recent theoretical linguistics guided by programmatic concerns, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2422.731,
    "end": 2425.053,
    "text": "Like I said, it's a program, it's an ongoing kind of ideology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2426.243,
    "end": 2432.147,
    "text": " On the other hand, linguists have developed theories of syntactic least effort, like I said, but the process theory is a little bit less clear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2432.687,
    "end": 2448.498,
    "text": "How it's actually implemented is slightly less clear, but I would argue may become more clear if it can be accommodated within existing frameworks and knowledge that the active inference framework can bring with it to help solve the puzzle of how a language is implemented in the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2450.219,
    "end": 2452.04,
    "text": "So here's another example for you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2452.18,
    "end": 2454.282,
    "text": "Routinely, poems that rhyme evaporate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2454.977,
    "end": 2458.04,
    "text": " So in this instance, routinely exclusively modifies evaporate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2458.901,
    "end": 2460.743,
    "text": "So the word routinely goes with evaporate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2460.783,
    "end": 2461.604,
    "text": "That's how they're interpreted.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2462.005,
    "end": 2467.371,
    "text": "So it cannot modify rhyme, even though this word is closer in terms of linear distance to routinely, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2467.771,
    "end": 2470.374,
    "text": "So rhyme comes one, two, three words after.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2470.714,
    "end": 2474.098,
    "text": "But evaporate comes one, two, three, four in terms of linear distance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2474.594,
    "end": 2479.516,
    "text": " So they're more linearly remote, and yet in terms of interpretation, they go together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2480.476,
    "end": 2485.859,
    "text": "And the reason is the matrix predicate, evaporate, is closer in terms of structural distance to routinely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2486.239,
    "end": 2491.561,
    "text": "And the reason why is that rhyme is embedded within the phrase headed by poems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2492.061,
    "end": 2495.403,
    "text": "So it exists on a different hierarchical plane, if you like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2495.543,
    "end": 2498.984,
    "text": "It's kind of lower down in the hierarchy than evaporate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2500.044,
    "end": 2503.606,
    "text": "So language computes over structural distance and not linear distance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2505.472,
    "end": 2507.313,
    "text": " So sentences are not simply beads on a string.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2507.333,
    "end": 2509.055,
    "text": "They're not linear objects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2510.516,
    "end": 2515.42,
    "text": "They have to be linear objects in terms of sentry-motor externalization because we live in the universe we live in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2516.0,
    "end": 2517.301,
    "text": "We can't speak in parallel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2517.321,
    "end": 2520.644,
    "text": "We can only speak in linearization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2520.924,
    "end": 2526.148,
    "text": "Although there is some evidence that sign languages can communicate to some degree in parallel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2526.508,
    "end": 2529.791,
    "text": "Like you sign one element with one hand and then another with the other hand.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2530.216,
    "end": 2537.381,
    "text": " So there's some evidence that sign language might be able to defy the laws of physics, but it turns out that's probably exaggerated to an extent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2537.681,
    "end": 2542.905,
    "text": "It is still a form of linearization, but just kind of a co-linearization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2544.266,
    "end": 2549.37,
    "text": "So language prioritizes the demands of the syntax semantics interface over other subsystems, like morphophonology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2550.595,
    "end": 2555.759,
    "text": " So while two structures might exhibit different linear orders, they may exhibit the same underlying hierarchical order.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2555.939,
    "end": 2557.761,
    "text": "So here's a really good example in English and Basque.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2558.221,
    "end": 2562.144,
    "text": "The verb, direct object dependencies are the opposite, but the interpretation is conserved.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2563.465,
    "end": 2564.606,
    "text": "So John has read the book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2565.206,
    "end": 2568.148,
    "text": "You have John, then auxiliary, then the verb, then the object.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2568.809,
    "end": 2570.73,
    "text": "And in Basque, you have a different order.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2571.251,
    "end": 2574.013,
    "text": "You have John, then the book, then the verb, and then the auxiliary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2574.482,
    "end": 2575.482,
    "text": " and yet they mean the same thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2575.862,
    "end": 2577.043,
    "text": "They have the same interpretation, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2577.563,
    "end": 2588.426,
    "text": "So this suggests that a kind of more fundamental operation is going on here, namely syntax encodes the verb and direct object as an abstract phrase, which omits the subject.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2588.606,
    "end": 2596.388,
    "text": "So in other words, in the syntax, in English and Basque, you have the same underlying syntax, which is subject and then verb and direct object being merged first.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2596.508,
    "end": 2599.729,
    "text": "So you merge the verb and direct object first, and then you accommodate the subject.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2600.249,
    "end": 2602.61,
    "text": "And then when you linearize that, when you, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2603.612,
    "end": 2607.353,
    "text": " communicate it externally, you do it in different ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2607.933,
    "end": 2609.133,
    "text": "In English, you do it one way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2609.413,
    "end": 2610.933,
    "text": "In Basque, you do it another way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2610.973,
    "end": 2612.054,
    "text": "But the basic idea is the same.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2612.194,
    "end": 2613.754,
    "text": "You have the same underlying interpretation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2614.154,
    "end": 2618.935,
    "text": "That also accounts for something pretty obvious, namely the fact that you can translate one sentence into another language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2619.655,
    "end": 2622.216,
    "text": "That's a fairly obvious thing that you can do with language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2622.676,
    "end": 2625.036,
    "text": "And so therefore, there has to be some kind of commonality somehow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2625.456,
    "end": 2630.077,
    "text": "But the commonalities might be much more deeper down than most people kind of appreciate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2631.991,
    "end": 2643.916,
    "text": " So through the various stages of language development as well, innocent children don't typically produce expressions that deviate from general grammatical principles pertaining to the structure dependence of rules, even when they produce so-called mistakes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2644.457,
    "end": 2648.098,
    "text": "There's been a lot of research on child language development.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2649.119,
    "end": 2660.984,
    "text": "So in other words, when children do make mistakes, they seem to make mistakes which accord with the grammatical rules of their language, which suggests that sensitivity to structure dependence forms a core part of language design.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2661.769,
    "end": 2666.931,
    "text": " So corpus studies of infant language exposure reveal that there are actually very few bigrams, let alone trigrams.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2667.672,
    "end": 2674.195,
    "text": "So statistical procedures can help, but there seems to be some more kind of innate sensitivity to structure dependence, which seems necessary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2675.775,
    "end": 2690.102,
    "text": "And as a recent paper also reviews, human learners prefer to induce hypotheses that have a shorter description length in logic, with simplicity preferences possibly being a governing principle of cognitive systems, all in accord with what the FFP would predict.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2692.347,
    "end": 2702.857,
    "text": " So simplicity-based preferences, I've got a range of formal language models too relating to the notion of minimal description, and you might also invoke principles of minimum redundancy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2703.658,
    "end": 2705.099,
    "text": "So this is kind of a really important idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2706.721,
    "end": 2710.544,
    "text": "Minimal computation and efficiency seems to be a really general cognitive goal of the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2710.885,
    "end": 2716.27,
    "text": "And there's a couple of recent papers, one of them in TICS, I think that came out maybe last year or maybe this year, I can't remember,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2718.131,
    "end": 2728.117,
    "text": " I think was called Memory as a Computational Resource, which showed that across a bunch of domains, human memory in its various guises also exhibits an adherence to principles of efficiency.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2728.597,
    "end": 2734.861,
    "text": "So I think it's not too surprising to when linguists come along and say, you know, language also adheres to principles of efficient computation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2735.842,
    "end": 2739.604,
    "text": "So all of these ideas seem to be, you know, out there at the moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2739.784,
    "end": 2745.287,
    "text": "Everyone's kind of coming to more or less the same conclusions, but just using different language, just using different background assumptions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2745.728,
    "end": 2747.969,
    "text": "But the general idea, I think, is kind of,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2748.705,
    "end": 2749.627,
    "text": " they all mesh well together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2751.188,
    "end": 2759.919,
    "text": "So, as I said, linguistic computation seems to be optimized for the generation of interpretable structures, rather than for the generation of maximally communicative messages to conspecifics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2759.939,
    "end": 2764.905,
    "text": "So in other words, whenever there's a conflict between principles of computational efficiency on the one hand,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2765.839,
    "end": 2769.362,
    "text": " and principles of communicative clarity on the other, the former typically wins.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2769.742,
    "end": 2776.007,
    "text": "Now, this is not to say that when we do communicate with each other, as worked by Frist and Archivist, that it's not done efficiently.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2776.247,
    "end": 2784.414,
    "text": "When we do communicate, we do do it in an efficient way, but that's a separate question from whether or not the language system is designed in a way as to maximize that communication.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2785.114,
    "end": 2791.637,
    "text": " The normal functioning of syntax seems to lead to instances which reduce efficiency and prioritize inference generation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2792.237,
    "end": 2798.78,
    "text": "So the goal of the language system is to generate particular inferences and representations about the environment in an efficient way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2799.0,
    "end": 2800.821,
    "text": "So here's a pretty clear example of this, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2801.321,
    "end": 2807.624,
    "text": "If you take the sentence, you persuaded Saul to sell his car, the individual and the object can both be questioned.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2808.257,
    "end": 2815.861,
    "text": " But questioning the more deeply embedded object, in terms of the hierarchical structure, forces the speaker to produce a more complex circumlocution, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2816.261,
    "end": 2818.782,
    "text": "So you can say, who did you persuade to sell what?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2819.403,
    "end": 2821.564,
    "text": "But you can't say, what did you persuade who to sell?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2821.964,
    "end": 2823.625,
    "text": "Even though they mean the same thing, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2823.665,
    "end": 2824.845,
    "text": "Same word, same interpretation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2825.626,
    "end": 2828.807,
    "text": "All it means is, you know, what is the individual and what's the object?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2829.227,
    "end": 2829.507,
    "text": "That's it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2829.808,
    "end": 2833.069,
    "text": "Just tell me who the individual is and what the object is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2833.089,
    "end": 2834.51,
    "text": "But you can only say it if you",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2837.793,
    "end": 2838.713,
    "text": " i.e.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2839.074,
    "end": 2841.215,
    "text": "search for the first possible element to question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2842.335,
    "end": 2846.257,
    "text": "If you search for the more deeply embedded object, you can't do it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2846.277,
    "end": 2851.88,
    "text": "So the structures in 11 involve the same words, same interpretations, yet the more computationally costly process can't be licensed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2852.12,
    "end": 2854.341,
    "text": "So this is a pretty good example, and there's plenty of examples like this, by the way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2854.361,
    "end": 2855.582,
    "text": "I've written a paper about it in Glossa.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2856.262,
    "end": 2864.046,
    "text": "Plenty of examples in which there is a clear conflict between syntactic priorities of just generating a meaningful structure and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2864.997,
    "end": 2870.059,
    "text": " generating possible structures that would actually aid communicative efficiency and communicative flexibility.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2870.699,
    "end": 2871.839,
    "text": "That's not a priority of language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2873.14,
    "end": 2884.023,
    "text": "So other examples show that the acceptability of sentences can be impacted based on the extent to which the construction contributes to a novel, non-redundant contribution to one's mental model's beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2884.143,
    "end": 2889.045,
    "text": "Again, this is really directly in the core of what active inference would predict, rather than those of constipation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2889.485,
    "end": 2893.146,
    "text": "Again, reinforcing the role of syntactic processing in inference generation rather than communication.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2893.769,
    "end": 2901.777,
    "text": " So the degraded acceptability in 12b, by the way, the reason why these are numbered 12, 13 is because that's the numeration in the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2902.807,
    "end": 2910.651,
    "text": " So the reason why 12b seems degraded relative to 12a seems to stem from the fact that the speakers are unlikely to be ignorant of the relevant content, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2910.831,
    "end": 2911.931,
    "text": "It's a kind of a pragmatic reason.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2912.391,
    "end": 2913.872,
    "text": "So Kim knows whether Saul's in bed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2914.012,
    "end": 2914.592,
    "text": "That sounds okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2915.073,
    "end": 2916.293,
    "text": "Or Kim knows whether I'm in bed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2916.633,
    "end": 2917.314,
    "text": "Sounds kind of weird.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2917.734,
    "end": 2922.456,
    "text": "Even though it's a technically grammatical sentence, it sounds weird because you would never say it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2922.676,
    "end": 2928.479,
    "text": "It doesn't contribute meaningfully to revising or contributing to one's mental models or beliefs about the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2928.819,
    "end": 2930.96,
    "text": "So therefore, the language system doesn't like it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2931.42,
    "end": 2935.361,
    "text": " which again brings in closer contact language design with the FEP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2935.922,
    "end": 2945.725,
    "text": "And also cases such as 13 reveal how even processes such as contraction are sensitive to hierarchical structure and can't be executed over any random word boundary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2946.485,
    "end": 2950.727,
    "text": "So you can say source taller than kin is, but you can't say source taller than kin is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2951.627,
    "end": 2955.068,
    "text": "And the reason is because there's an invisible phrase boundary between those two elements.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2957.028,
    "end": 2962.41,
    "text": " Other examples that are related to it are in 14 and 15, you can say, what do you want to do?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2962.731,
    "end": 2964.752,
    "text": "And you can contract and say, what do you want to do?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2965.392,
    "end": 2967.813,
    "text": "But if you say, who do you want to read the book?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2967.853,
    "end": 2970.514,
    "text": "You can't contract that to generate, who do you want to read the book?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2970.654,
    "end": 2971.255,
    "text": "That sounds a bit weird.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2971.295,
    "end": 2973.536,
    "text": "I mean, you technically can say it, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2973.636,
    "end": 2975.156,
    "text": "And if you said that to me, I would know what you mean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2975.997,
    "end": 2977.037,
    "text": "I'd know what you mean straight away.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2977.057,
    "end": 2977.858,
    "text": "There's no problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2978.278,
    "end": 2979.638,
    "text": "But it sounds a bit more awkward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2979.979,
    "end": 2985.261,
    "text": "Again, the idea is that there's an invisible phrase boundary there that permits, that stops contraction occurring.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2986.91,
    "end": 2993.454,
    "text": " Efficient computation, or at least structure dependence, I should say, is also exhibited in more classical examples in the literature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2994.034,
    "end": 2998.197,
    "text": "So if you say the man is happy, you can question that structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2999.261,
    "end": 3002.223,
    "text": " by moving the auxiliary to the front and saying, is the man happy?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3002.783,
    "end": 3012.288,
    "text": "And so you might be forced to conclude, well, maybe to form a question, you simply search the structure and take the first possible element, but that turns out not to be sufficient.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3012.829,
    "end": 3017.271,
    "text": "So you can say the man who is tall is happy, but you can't say, is the man who tall is happy?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3018.012,
    "end": 3027.537,
    "text": "Because who is tall is again, similar to poems that rhyme routinely, is embedded more deeply in the man-headed phrase than is the question,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3028.37,
    "end": 3052.349,
    "text": " is happy which is higher up the hierarchy and easily searchable so therefore you have to say is the man who is tall happy because is is actually closer to the element you're questioning in terms of structural distance than the is in who is tall so again syntax cares about structural proximity and not linear proximity and there are also constraints on this as well and so you can say john ate chicken and bread for lunch and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3053.112,
    "end": 3056.014,
    "text": " And you can question the whole phrasal conjoint, chicken and bread.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3056.054,
    "end": 3057.415,
    "text": "You can say, what did John eat for lunch?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3058.176,
    "end": 3065.3,
    "text": "But if you want to efficiently question one element, let's say you already knew that John ate chicken, but you're not sure what else he ate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3065.581,
    "end": 3067.582,
    "text": "You can't say, what did John eat chicken and for lunch?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3068.443,
    "end": 3070.204,
    "text": "Which, there's no reason why you can't do that, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3070.444,
    "end": 3071.124,
    "text": "Why can't you say that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3071.345,
    "end": 3072.305,
    "text": "It's a perfectly fine thought.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3073.066,
    "end": 3074.126,
    "text": "You already know that he ate chicken.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3074.507,
    "end": 3076.248,
    "text": "Someone's just told you he ate chicken and something else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3077.386,
    "end": 3079.507,
    "text": " But you can't say, what did John eat chicken and full lunch?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3079.807,
    "end": 3083.228,
    "text": "Because the syntax respects the integrity of the phrase, chicken and bread.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3083.548,
    "end": 3088.13,
    "text": "It has a phrasal identity that syntax respects, and you can't violate it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3088.21,
    "end": 3092.371,
    "text": "You can't just violate the phrase boundary and only interrogate one outcome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3094.315,
    "end": 3098.037,
    "text": " Other examples relate across phrase boundaries and contrast boundaries, not just within them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3098.457,
    "end": 3101.258,
    "text": "So you can say, Sam gave a guitar to me and loaned a trumpet to you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3101.798,
    "end": 3102.879,
    "text": "And you can question both elements.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3102.899,
    "end": 3104.84,
    "text": "You can say, what did Sam give to me and loaned to you?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3105.26,
    "end": 3107.981,
    "text": "But you can't say, what did Sam give to me and loaned a trumpet to you?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3108.541,
    "end": 3112.743,
    "text": "Even though, again, in terms of communicative efficiency, that's a pretty simple structure to generate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3112.843,
    "end": 3117.685,
    "text": "You already know that he loaned a trumpet to you, but you want to figure out what Sam gave to me, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3119.886,
    "end": 3123.828,
    "text": "And again, these relations of hierarchy, you can find them all over the place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3124.993,
    "end": 3127.855,
    "text": " So pronoun reference is a pretty good example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3128.955,
    "end": 3141.362,
    "text": "You can say, Mary said that he has a lot of talent and that Peter should go far, in which case the pronoun he is being connected with Peter, in which case you have a pronoun he coming before the actual element Peter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3142.242,
    "end": 3147.485,
    "text": "But then when you simply take that there phrase and question it and state it, it's no longer acceptable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3147.905,
    "end": 3150.406,
    "text": "You can't say he has a lot of talent and Peter should go far.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3150.507,
    "end": 3151.307,
    "text": "That sounds a bit strange.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3151.567,
    "end": 3153.208,
    "text": "He should refer to someone like John.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3154.244,
    "end": 3160.689,
    "text": " And the reason why is because when you embed that structure in one, a large structure, it changes the actual identity of the conjunct.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3161.089,
    "end": 3168.854,
    "text": "So the conjunct that, headed by that, is a compromised phrase, whereas the conjuncts headed by he and Peter are simply tense phrases, TB.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3170.235,
    "end": 3171.696,
    "text": "And other puzzles exist here as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3172.137,
    "end": 3177.36,
    "text": "So you can say John said he is proud of his house, in which case he goes with John.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3177.941,
    "end": 3182.844,
    "text": "But it sounds weird to say in John's house he organized the meeting, when he refers to John.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3183.297,
    "end": 3186.379,
    "text": " Again, you can kind of pass it, you can force it, but it sounds a bit more awkward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3186.68,
    "end": 3188.501,
    "text": "It's more natural for he to refer to Peter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3188.841,
    "end": 3191.904,
    "text": "If you say, in John's house, you know, someone else, Peter, organized a meeting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3192.384,
    "end": 3198.949,
    "text": "And the reason why is because code reference via this phenomenal phrase, gunting is barred, since syntax preserves interpretation across movement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3199.209,
    "end": 3207.375,
    "text": "So the original structure that's generated is John said he's in John's house, he organized a meeting, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3207.756,
    "end": 3210.318,
    "text": "That's generated from a more original structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3210.758,
    "end": 3211.959,
    "text": "He organized a meeting at John's house.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3212.386,
    "end": 3217.63,
    "text": " in which case you have he coming before John in the same kind of tense phrase structure that I mentioned earlier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3218.71,
    "end": 3221.372,
    "text": "So in other words, syntax seems to win over linear precedence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3223.073,
    "end": 3224.755,
    "text": "Other kind of quick examples exist too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3224.795,
    "end": 3226.916,
    "text": "So you can say, I gave her the book that Sarah always wanted.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3227.577,
    "end": 3231.339,
    "text": "If you say, I gave her the book that Sarah wanted, again, that sounds slightly strange.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3231.86,
    "end": 3239.445,
    "text": "Changing the syntax by adding the adverbial element changes the actual content of the phrase itself, which allows more easier co-reference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3241.67,
    "end": 3254.621,
    "text": " So stepping back a little bit, this whole framework of merging and generating hierarchical structures has been argued in the literature to kind of boil down from a more domain-general, lower-level computational procedure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3255.161,
    "end": 3262.528,
    "text": "So some people have called it the universal generative faculty, which is just the ability to construct hierarchical structures and map them to different interfaces.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3263.108,
    "end": 3269.914,
    "text": "So the idea is that when we have our system of moral judgment formation, which involves agents, patients, events, and so on,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3270.407,
    "end": 3273.913,
    "text": " that still requires some kind of combinatorial apparatus to generate those judgments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3274.454,
    "end": 3275.056,
    "text": "Same with music.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3275.276,
    "end": 3280.245,
    "text": "It's been known since the 70s that musical structures have a kind of hierarchical relation to them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3281.547,
    "end": 3292.369,
    "text": " And then also with numerosity, with numbers, you can imagine that it's been hypothesized by Chomsky that if you restrict this operational merge to a single element and simply reapply it, you can kind of generate the natural numbers, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3292.729,
    "end": 3297.25,
    "text": "So you can kind of form the empty set and then merge it with itself and then merge it with that object and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3297.51,
    "end": 3302.131,
    "text": "And that kind of gives you, you can call it zero and then call the next one one and call the one after that two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3302.531,
    "end": 3303.531,
    "text": "That gives you the natural numbers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3304.031,
    "end": 3309.832,
    "text": "But the general idea is that you have an underlying generative faculty that can interface with different subsystems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3310.319,
    "end": 3312.72,
    "text": " So when it interfaces with the sound system, you get music.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3313.201,
    "end": 3320.905,
    "text": "When it interfaces with whatever morality is, theory of minds, structures, or judgment formation, or whatever, you get moral judgments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3320.965,
    "end": 3324.968,
    "text": "When it interfaces with the system of quantification and numeracy, you get the natural numbers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3325.288,
    "end": 3333.373,
    "text": "And then when it interfaces with the lexicon, whatever that is, even more mysteriously, you get language, which is exactly what the algorithm I'm saying right here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3333.593,
    "end": 3335.634,
    "text": "So UGF, major of sound, music, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3336.867,
    "end": 3341.871,
    "text": " But interestingly, only language seems to attribute to these major elements an independent identity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3342.412,
    "end": 3350.178,
    "text": "So with quantification, music, and morality, you simply involve a generation of a chunk, some kind of chunking that's happening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3350.658,
    "end": 3353.1,
    "text": "But with natural language, you seem to get an additional operation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3353.54,
    "end": 3354.461,
    "text": "You don't just chunk things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3354.741,
    "end": 3357.423,
    "text": "You chunk them, and then you give it an additional identity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3357.764,
    "end": 3362.007,
    "text": "You give it a kind of the sum is greater than the parts, I guess.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3362.087,
    "end": 3363.088,
    "text": "You can call it that way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3364.838,
    "end": 3368.301,
    "text": " So what's interesting is that you can use that merge structure to then call it again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3368.461,
    "end": 3373.445,
    "text": "So the kind of, you can kind of treat it as an independent object, independent of its constituent parts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3373.845,
    "end": 3376.787,
    "text": "Whereas you can't, you don't really seem to be able to do that in music or language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3377.508,
    "end": 3378.529,
    "text": "Sorry, non-linguistic domains.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3380.05,
    "end": 3390.458,
    "text": "So there's also a recent paper by Stan Dehaene, who argues that this capacity to generate nested tree structures is a human-specific, kind of a species property, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3391.599,
    "end": 3393.781,
    "text": "And he gives a bunch of different neurobiological",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3394.542,
    "end": 3395.362,
    "text": " instantiations of this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3396.123,
    "end": 3398.424,
    "text": "But the basic idea is that only humans have language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3400.685,
    "end": 3406.827,
    "text": "Alongside that, you get an interest in a unique level of tool complexity, possibly due to this linguistic capacity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3407.147,
    "end": 3410.488,
    "text": "So for instance, spheres are constructed from a rock and a shaft.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3410.989,
    "end": 3413.77,
    "text": "But a sphere is not just a rock plus a shaft, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3413.99,
    "end": 3419.112,
    "text": "A sphere is a rock plus a shaft with an additional abstraction, the functional use of it, the utility.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3420.452,
    "end": 3426.736,
    "text": " in a couple of minutes, but language seems to be uniquely concerned with functional abstractions, like use, not just form.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3430.318,
    "end": 3435.582,
    "text": "And then on top of that, it seems that only humans have what Chomsky has loosely called the science-forming faculty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3436.502,
    "end": 3439.644,
    "text": "So only humans are scientists, not surprisingly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3439.704,
    "end": 3448.75,
    "text": "We can do things like piercing abduction, or non-deductive complex inference generation, where you get some weird event E occurs, but then we posit that if A is true,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3449.688,
    "end": 3452.171,
    "text": " then E would simply follow naturally, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3452.191,
    "end": 3458.417,
    "text": "So we assume A. And then, of course, on top of that, we have the other example I mentioned, theory of mind, forces by hierarchical language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3458.437,
    "end": 3459.698,
    "text": "You know, I know that, you know that, she knows.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3460.179,
    "end": 3469.328,
    "text": "So there's all these kinds of weird human-specific cognitive traits, all of which can potentially maybe be boiled down to or connected to some linguistic capacity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3470.729,
    "end": 3494.766,
    "text": " here's a good example that the hand gives and these are five different types of sequence sequences that you can generate only human beings seem capable of generating nested tree structures as i've argued here and in the paper and we generate tree structures not just randomly we don't just do it because we feel like it we do it efficiently and in the pit for the explicit purpose of active influence generation so transition and timing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3495.165,
    "end": 3500.328,
    "text": " chunking, ordinal knowledge, algebraic patterns, these are all non-human capacities too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3500.848,
    "end": 3503.89,
    "text": "Bonobos, macaques, birdsong, they all exhibit these forms of things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3504.21,
    "end": 3508.053,
    "text": "It's only humans that can do option number five, the nested tree structure business.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3509.674,
    "end": 3519.92,
    "text": "So again, this is the idea that when you merge car-factory, you don't just merge two nouns, right, car and factory, you actually create a noun phrase, a structure that's bigger than the two parts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3520.38,
    "end": 3523.662,
    "text": "So in other words, a factory is not a noun phrase, and car is not a noun phrase,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3524.209,
    "end": 3525.85,
    "text": " you need both of them to create a noun phrase.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3526.13,
    "end": 3533.355,
    "text": "And then you can use that noun phrase as an independent unit with its own kind of computational identity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3534.656,
    "end": 3539.059,
    "text": "So this leads to a more important question, I think, which is what is language?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3540.279,
    "end": 3541.32,
    "text": "All human beings have language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3541.34,
    "end": 3543.922,
    "text": "We all have very strong opinions about what language is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3544.342,
    "end": 3548.885,
    "text": "But consider the fact that geometry was originally the study of land measurement back in the day.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3549.74,
    "end": 3557.083,
    "text": " but developed a sufficiently rich body of knowledge to abstract away from its original object of inquiry and departed also from common sense intuition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3557.864,
    "end": 3562.285,
    "text": "So our common sense intuitions about what language is actually have no place in science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3562.345,
    "end": 3564.806,
    "text": "Ditto for common sense notions of mass and energy of physics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3566.047,
    "end": 3575.011,
    "text": "So at MIT, Professor Ed Fedorenko recently conducted a mechanical tech survey, a study, asking ordinary people what they thought language's primary function was.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3576.056,
    "end": 3578.96,
    "text": " Now, most of them said communication, in line with common sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3579.56,
    "end": 3589.051,
    "text": "And she used this data to criticize the idea from a certain part of linguistics that language isn't basically an instrument of thought.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3589.331,
    "end": 3592.295,
    "text": "Its primary purpose is to contribute to conceptualization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3594.121,
    "end": 3599.862,
    "text": " But a physicist obviously wouldn't conduct a mechanical tech survey randomly asking people what they thought the nature of light is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3600.402,
    "end": 3603.963,
    "text": "And a biologist wouldn't concern themselves with people's intuitions about how hearts and livers work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3604.623,
    "end": 3611.464,
    "text": "And so natural language syntax, I think, should be investigated using the same standards of scientific inquiry as any other object in the organic world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3611.644,
    "end": 3615.185,
    "text": "There's no reason why people's intuitions about language should be needed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3615.685,
    "end": 3618.525,
    "text": "In fact, if that were the case, there's no need for linguistic departments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3618.625,
    "end": 3620.746,
    "text": "Let's just ask a bunch of random people on the street.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3622.006,
    "end": 3622.826,
    "text": "That's what we could do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3624.332,
    "end": 3635.097,
    "text": " So on top of syntactic phrase generation, we can also frame this as contributing to policies used to perform particular free energy minimizing actions and not just generating linguistic objects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3636.358,
    "end": 3646.463,
    "text": "So the rapid and reflexive identification of objects, states, and events in the external world through simple linguistic means can yield complex, flexible interpretations for some of the most common nominals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3646.583,
    "end": 3648.304,
    "text": "Nominals is just a fancy word for nouns.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3649.231,
    "end": 3655.133,
    "text": " aiding in the successful generation of internal models of the environment using a limited number of resources.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3655.374,
    "end": 3663.077,
    "text": "So objects in the world have to be identified, and they have to be identified now, immediately, in order to be successful in navigating the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3663.097,
    "end": 3667.238,
    "text": "You have to understand things straight away and rapidly identify things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3667.378,
    "end": 3668.319,
    "text": "That's kind of obvious.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3669.179,
    "end": 3670.28,
    "text": "But that leads to certain puzzles, though.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3671.3,
    "end": 3673.461,
    "text": "So for instance, complex forms of what's called polysemy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3673.661,
    "end": 3676.062,
    "text": "Polysemy just means a way of having multiple senses.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3676.983,
    "end": 3680.205,
    "text": " And polysemy also turns out to be much more widespread than most people think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3680.285,
    "end": 3689.572,
    "text": "It turns out that almost half the words in the OED are polysemous.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3689.632,
    "end": 3697.938,
    "text": "Complex forms of polysemy generated via multi-word constructions allow for a more precise and exact localization in conceptual space than discrete symbols, signs, and gestures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3698.942,
    "end": 3703.727,
    "text": " with natural language syntax allowing the generation of a more accurate unveiling of hidden states in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3704.147,
    "end": 3709.853,
    "text": "So natural language syntax allows us to more accurately position ourselves in conceptual state space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3710.874,
    "end": 3714.217,
    "text": "Again, I gave the example of the second blue box to the left, but here's another example for you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3714.838,
    "end": 3719.463,
    "text": "You can say the poorly written newspaper that I held this morning has been sued by the government.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3720.083,
    "end": 3725.087,
    "text": " That's a perfectly fine sentence, but it's referring to three different senses of a simple word like newspaper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3725.427,
    "end": 3734.234,
    "text": "So a newspaper can simultaneously be a piece of information, it can be a physical object, it can be an abstract organization, and we can also call upon all of these senses at once.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3734.734,
    "end": 3740.559,
    "text": "And yet notice that this sentence cannot possibly refer to anything in the world, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3740.619,
    "end": 3742.701,
    "text": "This is not a kind of thing that a physicist could explore.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3743.621,
    "end": 3748.205,
    "text": "Something that's poorly written, something that you hold, something that can be sued, it's not a coherent entity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3749.426,
    "end": 3762.394,
    "text": " And yet language allows this simple, plesimus word, one single lexical item, to generate a very rich range of perspectives to interpret experience, which is exactly what you would expect from the active inference framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3763.41,
    "end": 3779.197,
    "text": " And so since there can't possibly be any object in the external world that a complex, poisonous word like newspaper can index a one-to-one mapping with, another framework we are developing here, lexical items could partially be seen as hypotheses about the structure of likely co-occurring sensory input, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3780.138,
    "end": 3784.62,
    "text": "Or hypotheses about ontological and myriological relations between objects and states in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3785.117,
    "end": 3788.3,
    "text": " So in other words, a word is not simply something that has a conceptual meaning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3788.681,
    "end": 3790.402,
    "text": "A word is not simply a fresh concept.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3790.943,
    "end": 3797.589,
    "text": "A word is basically a hypothesis about what the world is, what we can interpret experience to be in any given moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3798.09,
    "end": 3799.551,
    "text": "And we basically test the hypothesis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3800.012,
    "end": 3804.576,
    "text": "So we use the word newspaper as a hypothesis about what's going on outside.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3804.777,
    "end": 3805.457,
    "text": "Maybe it fails.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3805.738,
    "end": 3806.899,
    "text": "Maybe it succeeds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3806.979,
    "end": 3807.82,
    "text": "It depends on the context.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3807.88,
    "end": 3808.921,
    "text": "It depends on our state of mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3809.301,
    "end": 3811.844,
    "text": " and it also depends on our interests and our concerns.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3812.384,
    "end": 3815.587,
    "text": "I'll give some more examples in a second just to kind of illustrate that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3817.088,
    "end": 3831.102,
    "text": "So a recent paper by Carl Princeton's lab, headed by D'Amica Setal, 2020, in the paper Infanteers, they note that from the perspective of active inference, things only exist as a label or hypothesis or inference about hidden states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3831.954,
    "end": 3841.139,
    "text": " So the contention that I'm presenting here is that forms of complex meaning derived from natural language semantics form a core component of this labeling mechanism in active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3841.92,
    "end": 3846.402,
    "text": "So linguists like to talk about lexical items, book, table, walk, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3846.582,
    "end": 3850.925,
    "text": "These are basically just hypotheses composed from distinct core knowledge systems in the mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3851.385,
    "end": 3858.489,
    "text": "So our sense of geometry, our sense of place, our sense of social relations, which can elucidate environmental regularities essential to active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3860.131,
    "end": 3865.396,
    "text": " So here's some more examples, and again, a nice little quote from Demi Kass, the Leyland quote.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3865.496,
    "end": 3867.679,
    "text": "Let's take the notion of vagueness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3868.459,
    "end": 3873.745,
    "text": "So I was once an infant, but I'm no longer an infant, but I'm still me, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3874.205,
    "end": 3881.352,
    "text": "And the boundary between infancy and childhood and childhood and adulthood, there are legal terms for that, but that's kind of a just arbitrary choice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3881.752,
    "end": 3884.195,
    "text": "The actual concept of infancy is an arbitrary boundary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3886.199,
    "end": 3894.502,
    "text": " Some philosophers do actually think that there is a specific nanosecond which transitions you from infancy to childhood, but I think that's unlikely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3894.542,
    "end": 3903.205,
    "text": "I think applying fixed quantified notions like that to an intentionally and inherently vague notion like infancy is kind of a paradox.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3903.265,
    "end": 3903.845,
    "text": "It's meaningless.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3904.405,
    "end": 3905.366,
    "text": "Infancy is just infancy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3905.686,
    "end": 3909.847,
    "text": "It's not meant to be a precise boundary, unless you're a legal scholar, in which case that's fine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3909.867,
    "end": 3914.109,
    "text": "You can define legal boundaries between things, but that's kind of irrelevant for cognitive science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3915.216,
    "end": 3916.396,
    "text": " So consider something like infancy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3916.416,
    "end": 3918.137,
    "text": "You also have things like pile.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3918.857,
    "end": 3923.237,
    "text": "So we say there's a pile of sand, and you keep taking bits of sand off.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3923.358,
    "end": 3927.818,
    "text": "At what point, how many grains of sand are sufficient to make a pile, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3927.998,
    "end": 3930.479,
    "text": "That's called the Serratis paradox.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3931.479,
    "end": 3934.5,
    "text": "The vague notion of pile is great for active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3934.54,
    "end": 3937.16,
    "text": "It's great for generating rapid inferences and assessments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3937.88,
    "end": 3941.781,
    "text": "But as soon as you actually interrogate it sufficiently, the system becomes exposed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3944.757,
    "end": 3971.533,
    "text": " all that much scrutiny and then same for things like a book imagine you go into a library and there's let's say a thousand physical books but there's only an 800 kind of actual abstract books in the sense that you know every library has multiple copies of different books so the library will have you know 10 copies of the bible 10 copies of the quran and so on and let's say john goes into the library and he reads every book in the library and he leaves the library",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3972.102,
    "end": 3973.703,
    "text": " because he's fed up and all the books are rubbish.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3974.183,
    "end": 3976.103,
    "text": "So he just decides to burn it down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3976.704,
    "end": 3985.447,
    "text": "In that case, you can say John burned every book in the library, or John read and burned every book in the library, in which case he burned more books than he read, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3985.707,
    "end": 3989.588,
    "text": "He actually burns 1,000 books, but he only reads 800 books.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3990.249,
    "end": 3994.23,
    "text": "So the phrase every book does not pick out a fixed quantity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3994.65,
    "end": 3996.431,
    "text": "There's nothing in the external world that actually...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3997.327,
    "end": 3999.49,
    "text": " exhibits a one-to-one relation in terms of quantification.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3999.59,
    "end": 4000.452,
    "text": "It could be 800, it could be 1,000.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4001.092,
    "end": 4002.094,
    "text": "It depends on our perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4002.114,
    "end": 4004.497,
    "text": "And that's the crucial thing about even simple words like book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4004.537,
    "end": 4010.426,
    "text": "They generate these very rich, polysemous perspectives that you can use to interpret experience but have no necessary component to them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4011.65,
    "end": 4013.011,
    "text": " Another example is something like a city.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4013.871,
    "end": 4018.194,
    "text": "So you can say London burned down and was rebuilt 50 miles up the Thames.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4018.514,
    "end": 4021.196,
    "text": "London can still be London, even though it's physically completely changed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4021.276,
    "end": 4025.819,
    "text": "It's in a different location, all the Londoners are dead, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4025.859,
    "end": 4034.265,
    "text": "London is a very complex place in a sense that you can decompose into organization sense, location sense, population sense, and so on, government institution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4035.385,
    "end": 4038.387,
    "text": "But the single word London does not refer to anything in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4038.447,
    "end": 4040.569,
    "text": "So in other words, there's no such thing as London.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4041.38,
    "end": 4042.901,
    "text": " That's just a kind of convenience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4043.061,
    "end": 4046.802,
    "text": "It's a convenient abstraction that we use to interpret experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4047.162,
    "end": 4051.364,
    "text": "But there's nothing in the world that the word London refers to coherently.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4051.904,
    "end": 4054.165,
    "text": "You can use the word London to refer, but that's an action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4054.365,
    "end": 4057.306,
    "text": "It's an act of human will to actively do that and choose to do that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4057.606,
    "end": 4059.607,
    "text": "So it's a choice and it's an action, again,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4060.458,
    "end": 4061.539,
    "text": " while in a code of active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4061.639,
    "end": 4070.723,
    "text": "You can choose to voluntarily and willfully refer to one specific component of your representation of a city to refer to something in the external world, but that's a context by context case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4071.324,
    "end": 4077.487,
    "text": "The idea that London invariantly refers to a particular structure is just not true.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4079.338,
    "end": 4090.51,
    "text": " So by permitting a more refined, accurate positioning in conceptual space, natural language syntax aids agents in the formation of novel policies to navigate and make inferences about the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4091.171,
    "end": 4097.038,
    "text": "So cognition is an ongoing process of dynamic interaction between an organism and its environmental niche.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4098.338,
    "end": 4105.559,
    "text": " Yet notions like event are also not predefined external entities, but are actively generated and partially divided by a language system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4105.619,
    "end": 4110.62,
    "text": "So again, events are not things in the world, and events are things that are mind construction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4112.34,
    "end": 4119.602,
    "text": "So consider also that simple electrical items like city have properties that go way beyond the semantic complexity of other atomic representations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4120.142,
    "end": 4124.543,
    "text": "So you can say the large school with large windows next to the river starts at 9 a.m.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4124.903,
    "end": 4127.203,
    "text": "and has a strict headmaster and unruly students.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4127.95,
    "end": 4133.834,
    "text": " So there's nothing in the experimental world that could possibly be a location, an artifact, an event, a social group, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4134.334,
    "end": 4134.795,
    "text": "Surely not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4135.635,
    "end": 4136.216,
    "text": "Absolutely not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4136.236,
    "end": 4137.116,
    "text": "That's not an ontology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4137.417,
    "end": 4141.78,
    "text": "And also using these kinds of sentences surely doesn't commit us to the belief that there are such things in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4142.18,
    "end": 4143.881,
    "text": "It's a convenient abstraction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4143.921,
    "end": 4144.802,
    "text": "It's a fiction, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4144.822,
    "end": 4146.463,
    "text": "It's basically a fiction, a useful fiction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4147.571,
    "end": 4149.452,
    "text": " that is used in the service of active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4149.852,
    "end": 4150.812,
    "text": "And it does a very good job of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4150.872,
    "end": 4152.152,
    "text": "It's very successful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4152.712,
    "end": 4159.854,
    "text": "And the fact that it's so successful is evidenced by the fact that philosophers have only just begun to really investigate this phenomenon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4159.954,
    "end": 4161.695,
    "text": "This phenomenon is called complex polysemy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4162.095,
    "end": 4169.977,
    "text": "And it's taken centuries of inquiry to actually realize that some of our most basic common nominals do not have reference to things in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4170.077,
    "end": 4172.478,
    "text": "They're just convenient fictions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4172.498,
    "end": 4173.258,
    "text": "So take another sentence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4173.498,
    "end": 4176.879,
    "text": "The average man is concerned about wage cuts because he needs to afford insurance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4177.708,
    "end": 4182.774,
    "text": " Does language commit us to the belief that the world is made of things like average men and wage cuts and relations of concern?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4183.555,
    "end": 4185.217,
    "text": "That's surely not something that we're committed to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4186.439,
    "end": 4192.366,
    "text": "London can be, as I said, London can be fun and polluted and burnt down and rebuilt 10 miles up the river and still be called London.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4193.426,
    "end": 4200.213,
    "text": " So these nested tree structures that I mentioned earlier are widely considered to be abstract, but even simple words exhibit considerable abstraction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4200.753,
    "end": 4213.986,
    "text": "So, in other words, the paper I've written with Friston and Holmes focuses on nested tree structures, but it's also worth pointing out that even simple words themselves exhibit a considerable degree of abstraction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4215.763,
    "end": 4221.644,
    "text": " And perhaps just as relevant here is Bertrand Russell's invitation for us to consider a blind physicist who knows all the physics, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4221.904,
    "end": 4224.405,
    "text": "In some kind of hypothetical physics complete scenario.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4225.145,
    "end": 4229.406,
    "text": "So what is it that a sighted person knows that the blind physicist doesn't know?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4229.486,
    "end": 4230.486,
    "text": "If this physicist knows everything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4231.366,
    "end": 4232.966,
    "text": "Certain experience of contentually, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4233.026,
    "end": 4234.307,
    "text": "So what it's like to see the colour red.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4234.807,
    "end": 4236.567,
    "text": "That's not part of the blind physicist's knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4236.947,
    "end": 4239.848,
    "text": "So therefore physics can only capture the causal skeleton of the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4240.388,
    "end": 4245.369,
    "text": "We can at least conclude from this that my experience of seeing the colour red simply is a property of the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4245.882,
    "end": 4248.184,
    "text": " but one that we can't provide any naturalistic account for.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4248.484,
    "end": 4252.727,
    "text": "And the reason why I mention that is because I think that may also be the case for words like London and city and book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4253.067,
    "end": 4260.252,
    "text": "These abstractions are considerably much more intricate and much more complex than we usually give them credit for.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4262.093,
    "end": 4265.576,
    "text": "Our minds have managed to achieve an analysis of the concept of number,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4266.585,
    "end": 4271.867,
    "text": " Number theory is very rich, a very serious field in mathematics about number theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4272.948,
    "end": 4275.268,
    "text": "But there isn't really much of an analogue in linguistics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4275.629,
    "end": 4281.591,
    "text": "So lexical semantics is nowhere near as robust, nowhere near as detailed, and nowhere near as sophisticated as number theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4282.491,
    "end": 4287.553,
    "text": "Lexical semantics is pretty much the meaning of water is the set of all things that are water.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4287.853,
    "end": 4288.373,
    "text": "That's basically it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4288.413,
    "end": 4289.634,
    "text": "If you pick up a semantics textbook,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4290.438,
    "end": 4292.82,
    "text": " semantics textbooks are pretty much just that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4293.26,
    "end": 4297.043,
    "text": "The meaning of it is raining just means it's raining, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4297.123,
    "end": 4299.184,
    "text": "That's it, just like a re-description.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4299.304,
    "end": 4311.973,
    "text": "So in other words, linguists are very far from actually having a serious naturalistic account for even some of the most simplest words, which again might just simply be because of our cognitive limitations, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4312.013,
    "end": 4313.614,
    "text": "We can't actually construct theories for these objects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4316.69,
    "end": 4321.812,
    "text": " So one of the ways to exhibit this rich polysemy is by looking to the philosophy literature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4322.352,
    "end": 4333.937,
    "text": "So in the philosophy literature, there's something called externalism, which is the position that I've just been critiquing, which is the idea that words can have a kind of one-to-one reference with things in the external world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4334.497,
    "end": 4339.359,
    "text": "And there was a survey conducted not too long ago which showed that the majority of philosophers are externalists.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4339.499,
    "end": 4342.881,
    "text": "They do believe, in fact, that the word water refers to H2O or whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4343.888,
    "end": 4350.53,
    "text": " So consider this famous thought experiment, which I think contributes to our understanding of active inference, as I'll show in a few slides.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4351.47,
    "end": 4357.711,
    "text": "In some parallel universe, it's said that water is not made of H2O, but rather some other substance, right, XYZ.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4358.131,
    "end": 4364.453,
    "text": "So in the parallel universe, planet F2, the exact same as planet F1, except water is not made of H2O, it's XYZ.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4365.489,
    "end": 4370.072,
    "text": " So the question is, can the inhabitants of this twin air use water to refer to the substance?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4370.513,
    "end": 4371.573,
    "text": "So externalists say no.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4371.974,
    "end": 4374.656,
    "text": "Externalists say the meaning of water can't be applied to the substance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4376.857,
    "end": 4384.743,
    "text": "On the other hand, in contrast to the externalists, there's what's called the internalist position, which says that the meaning of words is simply a conceptual structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4385.203,
    "end": 4385.583,
    "text": "And that's it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4385.764,
    "end": 4389.466,
    "text": "There's nothing in the external world that these things refer to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4390.107,
    "end": 4393.029,
    "text": "So the internalists obviously say yes, of course it can, because it's just a concept.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4394.983,
    "end": 4402.128,
    "text": " So the term water seems to be polysemous between some more kind of common function-based sense and a more concrete technical sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4402.748,
    "end": 4415.557,
    "text": "So you can imagine that, let's say one of the examples that Noam Chomsky has given is, imagine that there's a tea factory that kind of explodes and some of the tea leaves in the factory get into the local water system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4416.397,
    "end": 4421.981,
    "text": "And so what comes out of someone's tap is chemically identical to the cup of tea that they're making in the kitchen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4422.481,
    "end": 4424.883,
    "text": "And yet one of the substances is water.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4425.336,
    "end": 4428.357,
    "text": " and one of the substances is tea, even though they're chemically identical, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4428.637,
    "end": 4431.878,
    "text": "Chemically the same thing, and yet one of them's water, and one of them is tea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4432.898,
    "end": 4439.2,
    "text": "And the reason why is because one of them satisfies the functional based criteria, and the other one violates it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4439.6,
    "end": 4441.641,
    "text": "Indeed, you can imagine another parallel universe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4442.341,
    "end": 4445.062,
    "text": "So then, Paul Petrosky offers what he calls paternal air,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4445.745,
    "end": 4453.129,
    "text": " where doppelgangers of our scientists discover that what they've all been loosely calling mud, in fact, has a deep uniform structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4453.629,
    "end": 4457.652,
    "text": "So obviously on planet Earth, our planet Earth, there's no uniform structure to mud, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4457.712,
    "end": 4458.452,
    "text": "Mud can be anything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4459.453,
    "end": 4467.437,
    "text": "But it turns out that in this parallel universe, all of their examples of substances of mud actually exhibit a uniform structure, X, Y, Z.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4468.7,
    "end": 4474.024,
    "text": " And so the argument is that they can use the concept mud to refer successfully to all physical structures of mud.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4474.144,
    "end": 4475.285,
    "text": "That's good for them, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4475.645,
    "end": 4490.016,
    "text": "They could successfully use the word mud to just refer to X, Y, Z. But does it follow from this that the inhabitants of fraternal Earth could not then travel to our universe and use the word mud to refer to our chemically diverse samples if they came to a black hole?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4490.68,
    "end": 4491.561,
    "text": " And I think the answer is no.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4491.621,
    "end": 4492.763,
    "text": "The externals would say yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4493.464,
    "end": 4505.139,
    "text": "The externals would say, well, their meaning of mood simply refers to X, Y, Z. And since we don't have X, Y, Z in our universe, when these people jump in a black hole and come to us, when they talk of mood, they have to be speaking of something else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4506.107,
    "end": 4508.488,
    "text": " But that surely violates the actual meaning of the term mud.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4508.588,
    "end": 4509.948,
    "text": "It's a conceptual representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4509.968,
    "end": 4511.329,
    "text": "It's not a physical structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4511.989,
    "end": 4519.091,
    "text": "So the idea that the natural kind-conforming use of mud could not readily be extended to a polysemous sense doesn't really seem to be well supported.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4519.291,
    "end": 4521.972,
    "text": "And it's just not a good description of what language actually is or what it cares about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4522.572,
    "end": 4523.853,
    "text": " Language doesn't really care about the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4523.933,
    "end": 4528.196,
    "text": "It doesn't care about the external world, as it actually is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4529.737,
    "end": 4530.777,
    "text": "That's what science tries to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4530.998,
    "end": 4533.439,
    "text": "Science tries to achieve reference to things in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4533.699,
    "end": 4536.101,
    "text": "But the language system just cares about active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4536.381,
    "end": 4537.622,
    "text": "It just cares about making sense of the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4537.962,
    "end": 4538.222,
    "text": "That's it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4538.242,
    "end": 4541.044,
    "text": "It doesn't actually care if water is made of H2O or not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4541.184,
    "end": 4541.764,
    "text": "That's not relevant.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4542.625,
    "end": 4548.549,
    "text": "So we can use simple words like water and wood to access multiple concepts, and then use those concepts in the service of active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4549.881,
    "end": 4559.287,
    "text": " In fact, Petrosky goes further, and he shows that using government statistics, US government statistics, he notes how Diet Coke has a higher percentage of H2O than stuff from my world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4559.647,
    "end": 4570.855,
    "text": "In fact, I'm drinking a bottle of Dr. Pepper, and I'm not sure if it actually has that information, but Dr. Pepper has almost definitely a greater content of H2O than stuff from the world in your backyard.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4571.655,
    "end": 4578.64,
    "text": "And in fact, diets brighten clubs so they are even more like H2O, and yet they're not deemed water for reasons purely to do with intended purposes, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4579.11,
    "end": 4585.471,
    "text": " So I think a cup of tea is like 99.7 or 99.5% H2O, and yet it's called a cup of tea, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4585.491,
    "end": 4588.732,
    "text": "It's not water, it's tea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4588.892,
    "end": 4594.853,
    "text": "So moving even further away from this, consider that even scattered entities, forget about water, let's talk about scattered entities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4595.213,
    "end": 4598.793,
    "text": "Scattered entities can be taken to be a single physical object under some conditions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4599.333,
    "end": 4602.954,
    "text": "So imagine a picket fence with brakes or a cold immobile, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4603.374,
    "end": 4608.315,
    "text": "The latter is a thing, a cold immobile is called a thing, whereas a collection of leaves on a tree is not a thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4609.344,
    "end": 4612.907,
    "text": " Unless, of course, these leaves a place for the pictures of decoration or art installation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4613.508,
    "end": 4616.891,
    "text": "And so the reason seems to be that the mobile is created by an act of human will.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4617.111,
    "end": 4618.752,
    "text": "Again, the functional notion is important here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4620.053,
    "end": 4620.734,
    "text": "So here's a question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4621.254,
    "end": 4625.178,
    "text": "How are these human-specific notions of function and intention coded into the lexicon?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4625.398,
    "end": 4628.481,
    "text": "And how are they coded as part of any gender model under active inference?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4628.501,
    "end": 4630.222,
    "text": "That's a really tricky question, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4633.803,
    "end": 4642.452,
    "text": " And indeed, going beyond this too, Bertrand Russell famously claimed that objecthood is based on spatiotemporal continuity, but that also seems to be not sufficient.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4642.492,
    "end": 4652.602,
    "text": "The four legs of a dog can be seen as a single object under many conceivable contexts, such as if they were cut off, tied together, and used as a doorstep, but they could still be understood by its user as part of a dog.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4653.303,
    "end": 4657.846,
    "text": " So abstract objects do not bear causal relationships, and they're also not spatiotemporally located.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4658.207,
    "end": 4663.71,
    "text": "So an object is usually understood to be a concrete thing, hence the confusion when some are denied spatiotemporal relations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4664.131,
    "end": 4666.292,
    "text": "So an object is an object if we deem it so.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4668.234,
    "end": 4671.516,
    "text": "And in addition, I think it's important to note that a psycholinguistic lens is needed too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4671.936,
    "end": 4678.361,
    "text": "So when philosophers talk about externalism and internalism, they often just talk about language without actually knowing anything about linguistics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4683.011,
    "end": 4685.292,
    "text": " trying to do philosophy of physics without knowing anything about physics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4685.612,
    "end": 4686.472,
    "text": "That's kind of strange, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4686.772,
    "end": 4690.514,
    "text": "If you want to do philosophy of linguistics, philosophy of language, you should really know about linguistics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4691.114,
    "end": 4692.954,
    "text": "So here's one particular paradox.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4693.115,
    "end": 4696.576,
    "text": "In the philosophy literature, the following contrast has been called a paradox, like a problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4697.816,
    "end": 4703.538,
    "text": "So you can say Batman fights more mobsters than Bruce Wayne, but we also know that Bruce Wayne just is Batman, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4704.056,
    "end": 4707.838,
    "text": " So therefore, we should be able to say Batman fights more monsters than Batman, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4708.018,
    "end": 4709.419,
    "text": "But we can't say that because it sounds weird.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4709.959,
    "end": 4711.841,
    "text": "And the reason why is due to linguistics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4712.021,
    "end": 4712.861,
    "text": "It's not because of philosophy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4713.301,
    "end": 4722.287,
    "text": "So then there's a constraint on discourse interpretation in language through which whenever there's two referential expressions in a clause, they're default interpreted as non-identical, okay?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4722.507,
    "end": 4727.069,
    "text": "And this feeds into redundant computation, which again, feeds back to efficient computation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4727.53,
    "end": 4728.93,
    "text": "And as such, reference is operative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4729.231,
    "end": 4731.392,
    "text": "So if you have two instances of Batman, there's a problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4731.912,
    "end": 4736.915,
    "text": " So the sentence in B forces us to search for different reference, even though we know it's the same reference, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4737.996,
    "end": 4742.099,
    "text": "So this paradox in philosophy of language is not due to mind-world relations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4742.379,
    "end": 4743.54,
    "text": "It's just due to linguistics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4743.86,
    "end": 4745.181,
    "text": "It's just a psycholinguistic phenomenon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4745.481,
    "end": 4746.561,
    "text": "That's all it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4746.682,
    "end": 4747.242,
    "text": "It's pretty simple.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4749.203,
    "end": 4753.426,
    "text": "And again, one of the problems here is that a lot of these quirks of language",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4754.244,
    "end": 4756.785,
    "text": " and interrogation, and they're not immediately obvious.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4756.946,
    "end": 4760.507,
    "text": "Language is very good at constructing an illusion that we kind of become susceptible to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4760.988,
    "end": 4766.391,
    "text": "We like to think that the things we talk about are really, really existing in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4766.531,
    "end": 4769.632,
    "text": "But in fact, language use, I like to think of it as kind of a fairytale.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4770.633,
    "end": 4778.817,
    "text": "Using language is kind of more akin to constructing a fairytale than it is science, because we're just constructing concepts and using them in a kind of Luciferian language game sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4779.618,
    "end": 4781.779,
    "text": "So here's another example, what are called Escher sentences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4782.898,
    "end": 4785.32,
    "text": " So there's the famous staircase painting of Escher.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4785.68,
    "end": 4787.681,
    "text": "The endless staircases go round and round and round.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4788.762,
    "end": 4791.123,
    "text": "So the visual system doesn't care about that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4791.443,
    "end": 4793.104,
    "text": "The visual system just sees what it sees.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4793.665,
    "end": 4798.748,
    "text": "If that turns out to be a physically impossible construct, that's not relevant to the visual system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4798.968,
    "end": 4799.949,
    "text": "We just see whatever it sees.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4800.529,
    "end": 4801.61,
    "text": "And it's the same with language too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4801.67,
    "end": 4805.872,
    "text": "So language also has things like analogous things, what are called Escher sentences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4806.513,
    "end": 4811.336,
    "text": "So if you say more people have been to Russia than I have, or in Michigan and Minnesota,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4811.772,
    "end": 4814.433,
    "text": " More people found Mr. Bush's ads negative than they did Mr. Kerry's.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4814.934,
    "end": 4816.034,
    "text": "That's actually a meaningful sentence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4816.054,
    "end": 4816.655,
    "text": "It doesn't mean anything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4817.295,
    "end": 4820.517,
    "text": "More people have been to Russia than I have is a meaningful sentence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4821.017,
    "end": 4823.998,
    "text": "It kind of sounds like it makes sense, but it's completely meaningless, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4824.118,
    "end": 4829.721,
    "text": "Because you're trying to compare a fixed finite quantity, like 50, to a simple binary yes or no, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4829.781,
    "end": 4835.204,
    "text": "You've either been to Russia, yes or no, and then more people means five or six people, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4835.224,
    "end": 4838.166,
    "text": "So it's syntactically legal, but it's semantically incoherent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4839.273,
    "end": 4852.285,
    "text": " And there's plenty of sentences like that where the language system is very good at generating the illusion of meaning, or generating the illusion of structure, when in fact if you interrogate it, there's no meaning to it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4852.686,
    "end": 4856.85,
    "text": "And again, this feeds into the idea of efficient computation, of inference generation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4857.39,
    "end": 4861.454,
    "text": "The language system doesn't want to interrogate too deeply, it just wants to generate an inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4862.035,
    "end": 4863.656,
    "text": "What is this person trying to say here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4864.657,
    "end": 4868.139,
    "text": " And on the other hand, it also creates an idea of anti-reference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4868.639,
    "end": 4873.381,
    "text": "So this sentence sounds meaningful, but there's nothing in the external world that it can refer to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4873.521,
    "end": 4878.503,
    "text": "So there's no real comparisons being made here between more people and me being to work at Yes or No.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4880.407,
    "end": 4886.434,
    "text": " So in conclusion, it seems that any object is much more than its material constitution or its function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4887.074,
    "end": 4888.176,
    "text": "We can also use its origin.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4888.276,
    "end": 4889.837,
    "text": "So Thomas Hobbes talked about rivers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4889.978,
    "end": 4898.066,
    "text": "His famous example was a river can be maybe defined by its origin and then it can kind of skirt and diverge and go into different paths and then maybe converge again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4899.087,
    "end": 4900.269,
    "text": "But also a sense of continuity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4901.206,
    "end": 4907.588,
    "text": " So John Locke's theory of personhood was that a person is defined by a sense of continuous identity, not a physical constitution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4908.588,
    "end": 4918.851,
    "text": "So when a child watches a cartoon of the handsome prince getting kissed, he turns into a frog, and then he turns into a human again once he's kissed again, or whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4919.271,
    "end": 4921.292,
    "text": "There's a chaos, and then something happens.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4921.532,
    "end": 4923.012,
    "text": "The child knows that it's the same person.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4923.352,
    "end": 4926.153,
    "text": "The child watching the TV knows that it's the same entity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4926.173,
    "end": 4929.894,
    "text": "It's the same person, the prince being turned from a human to a frog.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4932.085,
    "end": 4934.426,
    "text": " And yet, again, that's got nothing to do with reference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4934.526,
    "end": 4937.747,
    "text": "There's nothing that could coherently exist in that sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4938.287,
    "end": 4940.748,
    "text": "So all these representations seem to conspire.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4941.208,
    "end": 4943.048,
    "text": "And in addition, we also have a kind of a fifth element.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4943.508,
    "end": 4946.509,
    "text": "So we can kind of call this extra-linguistic biases, the shaping objecthood.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4947.029,
    "end": 4948.97,
    "text": "So that pertains to one example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4949.11,
    "end": 4952.391,
    "text": "There are lots of examples, but one example is default marking of object surfaces.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4953.82,
    "end": 4959.69,
    "text": " So if you say John painted the house brown, this implies that he painted the external surface brown, not the internal surface.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4959.99,
    "end": 4963.316,
    "text": "Because we seem to have a sense of objects as being concave objects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4963.877,
    "end": 4968.083,
    "text": "And I think of scenes as well, like scenes, events, inside scenes or outside scenes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4968.677,
    "end": 4972.299,
    "text": " So we seem to have a kind of visually imposed sense of what our house is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4972.879,
    "end": 4982.823,
    "text": "So if John and Mary are both stood five meters from the surface of the house, but Mary's inside the house and John's outside it, John is near the house, but Mary's not near the house.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4983.603,
    "end": 4987.685,
    "text": "Mary's inside the house, even though they're both equities, the actual physical structure of the house.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4988.265,
    "end": 4990.106,
    "text": "So the house is, again, a functional notion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4991.087,
    "end": 4992.127,
    "text": "It's not just a physical object.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4992.167,
    "end": 4995.949,
    "text": "It's also a functional based interpretation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4996.209,
    "end": 4996.689,
    "text": "So in other words,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4997.458,
    "end": 5000.84,
    "text": " at least these five components, they all contribute to active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5000.86,
    "end": 5005.243,
    "text": "They all contribute to generating structures, but at least these five components are somehow encoded in language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5005.723,
    "end": 5007.905,
    "text": "And I consider that to be one of the biggest mysteries.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5009.066,
    "end": 5011.127,
    "text": "How are these things encoded in the lexicon?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5011.567,
    "end": 5016.07,
    "text": "And how are these networks across the brain interpreted and activated during language comprehension?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5016.27,
    "end": 5018.432,
    "text": "That's an extremely problematic issue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5019.553,
    "end": 5026.117,
    "text": "Because like I said, when we talk about schools having strict headmasters and being large and near the river and et cetera,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5027.394,
    "end": 5029.335,
    "text": " we're using pretty much all of these concepts at once.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5029.755,
    "end": 5030.715,
    "text": "And we're doing it effortlessly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5031.295,
    "end": 5034.576,
    "text": "And yet somehow, how they're actually implemented is kind of a mystery.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5035.896,
    "end": 5039.738,
    "text": "But there is, interestingly, precedence in recent active inference literature for these suggestions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5039.758,
    "end": 5049.94,
    "text": "So in a recent paper, Ramstad et al argue that the FAP is most compatible with an instrumentalist theory of mental representations, via which representations are useful fictions for explanatory goals, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5050.16,
    "end": 5052.061,
    "text": "Which is exactly what I've just been saying about linguistics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5052.799,
    "end": 5063.232,
    "text": " And this is also compatible with certain models in philosophy of language, the analyst perspective, which assume that less-for-items have no one-to-one direct reference in the external world, but are basically useful fictions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5063.572,
    "end": 5069.82,
    "text": "They're composites of distinct representational domains that are used for successful, efficient interpretation and ultimately agent survival, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5071.301,
    "end": 5088.453,
    "text": " And it's also compatible with internalist models of Markov blankets, which have been argued to form kind of Neil Cantillon and Helmholtz in The Counts of Cognition, whereby the boundaries of cognition are delimited by its skull, emphasizing the interactive, constructive nature of higher cognition and generating interpretable, actionable concepts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5088.514,
    "end": 5090.775,
    "text": "Again, the crucial concept of actionable concept.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5090.955,
    "end": 5091.756,
    "text": "It's a useful concept.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5091.816,
    "end": 5094.618,
    "text": "It's something that you can use in some meaningful way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5096.431,
    "end": 5112.2,
    "text": " So the long-term storage of frequently generated lexical characters and the combinatorial rules underlying their creative deployment in language production and comprehension, all of this seems to allow speakers to categorize novel sensory data into a discrete set of objecthood and eventhood representations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5112.74,
    "end": 5117.683,
    "text": "So there are a few events that cannot actually be passed through the simple and unique schemes provided by language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5118.359,
    "end": 5122.186,
    "text": " which increases the likelihood of speakers avoiding surprising states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5122.567,
    "end": 5129.86,
    "text": "The more efficiently and readily you can pass a particular situation as an event, then that leads to surprise minimization, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5131.721,
    "end": 5157.053,
    "text": " So another recent paper notes that the active inference model of the brain assumes an imperative to find the most accurate explanation for sensory observations that is minimally complex, which has been recruited in Barlow's Exploration of Minimum Relevancy, and which seems to accord with how the language system provides the most computationally efficient format for solving the problem of mapping linear sensory input, right, so linear sentences, to hierarchical interpretations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5158.803,
    "end": 5163.744,
    "text": " So from the perspective of active inference, individuals need to minimize the effort involved in meaning-making.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5164.324,
    "end": 5173.566,
    "text": "So we propose that there is increasing evidence from theoretical linguistics and natural language syntax that this structure exhibits design principles in keeping with belief-setting criteria.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5174.866,
    "end": 5187.089,
    "text": "So another recent paper by Christen's group proposes that the goals of speech segmentation involve sampling data in a way that requires the most parsimonious degree of belief updating in accord with Occam's principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5187.759,
    "end": 5192.741,
    "text": " So we've basically extended these claims to the domain of natural language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5192.781,
    "end": 5197.503,
    "text": "Indeed, active inference has only one underlying imperative to minimize generalized free energy or uncertainty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5198.003,
    "end": 5206.746,
    "text": "And much work in psycholinguistics, so things like eye tracking, tracking people's eye movements during their reading of sentences, during fill-the-gap dependencies, long-distance",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5210.014,
    "end": 5216.438,
    "text": " features, shows that phrase structures are generated predictably in anticipation of upcoming stimuli.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5216.719,
    "end": 5221.542,
    "text": "In fact, it turns out that even something as simple as adjective-mound phrases are constructed predictably.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5221.822,
    "end": 5225.264,
    "text": "So things like red boat, simple two-word phrases, they involve rich prediction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5228.346,
    "end": 5230.648,
    "text": "So maybe I should just stop there for a second to evaluate and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5233.493,
    "end": 5237.896,
    "text": " This has been an awesome learning experience as a non-linguist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5238.437,
    "end": 5246.263,
    "text": "There's a few questions from the chat, and there's also just a few other things I wrote down, but a lot of the questions have to do with how things happen in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5246.643,
    "end": 5255.47,
    "text": "So maybe it's worthwhile for you to just share however much more you'd like to share, and then hang out as long as you'd like to answer some questions, and you're always welcome back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5255.51,
    "end": 5261.134,
    "text": "So no worries, just whatever's comfortable today, let's talk through, and then we'll continue the discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5262.162,
    "end": 5262.362,
    "text": " Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5262.542,
    "end": 5262.742,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5262.782,
    "end": 5265.924,
    "text": "Well, yeah, this is the final section just to kind of wrap it all up together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5265.944,
    "end": 5268.766,
    "text": "So only a few slides more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5268.926,
    "end": 5272.628,
    "text": "But yeah, the question of how all this relates to the brain is absolutely essential.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5273.209,
    "end": 5275.33,
    "text": "And so I'll try and explain that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5275.43,
    "end": 5277.891,
    "text": "So just to begin with that framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5278.612,
    "end": 5278.792,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5278.832,
    "end": 5285.736,
    "text": "So so far, I've kind of just outlined the kind of basic philosophy of how language is implemented in a kind of computational theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5286.463,
    "end": 5292.811,
    "text": " how it seems to be involved in efficient computation and so on, how it might, on a cognitive level, contribute to inference generation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5293.612,
    "end": 5295.995,
    "text": "But what about actual neural implementation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5296.916,
    "end": 5298.518,
    "text": "So that's kind of the next frontier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5299.379,
    "end": 5303.344,
    "text": "So there's a recent paper by Van Roosch and Baggio arguing that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5304.384,
    "end": 5331.629,
    "text": " makes a good theory is not just generating testable predictions it's invoking plausible possible mechanisms mechanisms that are plausibly realized in nature either in your biology or genetics or physics right it's kind of a nice framework the idea is that uh theory is not just there just just because they can generate um you know true testable predictions it's it's to generate things that are plausible and i think that's a very important point so much of current um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5332.179,
    "end": 5340.146,
    "text": " but the neurobiological language involves quite reasonably testing some hypotheses and then generating fully available explanations for results.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5340.766,
    "end": 5348.733,
    "text": "So you'll read the results section, which shows like, let's say, hippocampal theta power increases, or semantically coherent sentences maybe, just to choose a random example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5349.313,
    "end": 5353.096,
    "text": "And so the explanation is just kind of a re-description of the results in the description section.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5353.657,
    "end": 5355.298,
    "text": "So it'll be like, you know, we found",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5356.426,
    "end": 5363.528,
    "text": " Hippocampal theta increases in x, y, z. So therefore, semantically coherent sentences are indexed by hippocampal theta.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5363.688,
    "end": 5364.628,
    "text": "It's kind of a re-description.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5365.168,
    "end": 5370.989,
    "text": "But then what we need is really a pre-existing mechanistic understanding of the possible computational properties of hippocampal theta.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5371.149,
    "end": 5373.07,
    "text": "So what is hippocampal theta in the first place?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5373.51,
    "end": 5374.75,
    "text": "Otherwise, what's the point of looking at it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5375.13,
    "end": 5379.951,
    "text": "There's no point looking at some neural response if you don't understand the computational capacities",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5381.647,
    "end": 5382.967,
    "text": " to see what is that lower level mechanism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5383.467,
    "end": 5393.15,
    "text": "And indeed there might be, there usually are multiple mechanisms, multiple possible mechanisms for realizing that particular signature that you get through brain data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5394.15,
    "end": 5403.752,
    "text": "If your simple output is to simply do the experiment and then re-describe the results using different rhetoric, then that's not contributing to conceptual progress.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5405.453,
    "end": 5409.174,
    "text": "So a lot of these ideas were outlined in a recent book I'm buying, The Assolutory Nature of Language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5411.38,
    "end": 5416.486,
    "text": " tease them apart, but if you're interested in more of the details, you're free to contact me and I'll send you a copy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5417.585,
    "end": 5429.396,
    "text": " So one can derive some elementary properties of linguistic computation through a direct line of communication from the FEP through to endogenous oscillatory synchronicity and linguistic behavior, which kind of comes out of the outcome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5430.057,
    "end": 5443.249,
    "text": "So under the FEP, endogenous oscillations are the type of dynamics, brain dynamics, that neurons would expect to encounter since they have genetically encoded beliefs that the cause of excitatory postsynaptic potentials follows a certain pattern.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5444.417,
    "end": 5459.004,
    "text": " So active inference can synthesize various in silico neurophysiological responses via a gradient descent on free energy, such as the mismatch negativity phase procession, theta sequences, place cell activity, theta camera, phase amplitude coupling, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5459.224,
    "end": 5463.486,
    "text": "And the reason why it's important is because a lot of these mechanisms have been involved and implicated in language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5465.063,
    "end": 5478.556,
    "text": " So moving forward with these concerns, neuronal dynamics and plasticity appear to minimize variational free energy under a simple generative model, which entails prior beliefs that presynaptic inputs are generated by an external state with a quasi-periodic orbit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5478.956,
    "end": 5479.757,
    "text": "Recent papers show this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5480.377,
    "end": 5487.264,
    "text": "So the implication is that ensembles of neurons make inferences about each other, while individual neurons minimize their own free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5487.864,
    "end": 5490.126,
    "text": "So generalized synchrony kind of comes for free.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5491.087,
    "end": 5493.048,
    "text": " It's an emergent property of free energy minimization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5493.588,
    "end": 5505.932,
    "text": "Desynchronization is induced by exogenous input, explaining event-related desynchronization, and structure learning emerges in response to causal structure in exogenous input, explaining the functional segregation of neural clusters.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5506.592,
    "end": 5513.714,
    "text": "So an external, like neuron external state with a quasi-periodic orbit is assumed to generate the presynaptic inputs of a given neuron.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5513.734,
    "end": 5519.016,
    "text": "And what's interesting for me is that low-frequency phase synchronization emerges directly from this assumption.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5519.659,
    "end": 5523.321,
    "text": " and also the coupled assumption that neuronal dynamics maximize variation of energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5524.382,
    "end": 5543.154,
    "text": "So the reason why that's important for language is that one particular implication is that models of syntactic computation grounded in these dynamics, so, you know, the model that I have in my book, but also some other recent models from Giroud, Bufeld, and Habano et al., can be said to comply with foundational principles of the FAP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5543.654,
    "end": 5548.077,
    "text": "So, for instance, endogenous load frequency delta, delta phase tracking of syntactic nodes,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5548.578,
    "end": 5561.168,
    "text": " could be seen as emerging as a direct function of generative belief updating in a core of a vacuum inference, supplementing the association of delta oscillations with the cortical computations responsible for creating hierarchical linguistic structures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5561.208,
    "end": 5568.153,
    "text": "So what that means is whenever you get a particular phrasal node, a phrase boundary, you seem to get some kind of unique low-frequency response.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5568.713,
    "end": 5577.44,
    "text": "The details can be found in the actual papers, but it's basically some kind of unique low-frequency signature, which seems to code, okay, this is a phrase, here's another phrase, here's another phrase.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5577.938,
    "end": 5583.522,
    "text": " And that kind of goes beyond the level of abstraction contributed by syllables and words.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5583.862,
    "end": 5585.943,
    "text": "So it was kind of a phrase-specific signature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5586.764,
    "end": 5595.149,
    "text": "And so the active inference framework provides clear predictions about the neural dynamics of language and can help bring together research programs that are presently pursued independently.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5596.59,
    "end": 5606.877,
    "text": "So exploring the possible neurobiological basis of a core feature of language, a recent paper argues that theta-gamma phase-amplitude coupling in language, which codes syllable recognition, and also predictive coding,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5607.523,
    "end": 5611.806,
    "text": " and theta gamma coupling has been associated with predictive coding for a little while now, can be brought together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5612.167,
    "end": 5625.617,
    "text": "So this theta gamma coupling has been applied to silver parsing, modeling theta gamma coupling for dialogue as well, which appears to form part of belief updating for active inference, whereby beliefs are simultaneously updated at high, fast levels, but also low, slower levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5626.677,
    "end": 5632.322,
    "text": "Also, theta gamma coupling has been applied to, well, it's been assumed to be a constraint in working memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5632.922,
    "end": 5634.243,
    "text": "So for instance, the idea is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5635.305,
    "end": 5641.609,
    "text": " The number of items you can hold in working memory is based on the number of gamma cycles you can embed in a given theta phase.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5642.35,
    "end": 5644.251,
    "text": "And it's a kind of trade-off between fidelity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5644.691,
    "end": 5650.435,
    "text": "If you want to hold more items in memory, then you can indeed increase the number of gamma items to 7 or 8.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5650.675,
    "end": 5653.157,
    "text": "Gamma cycles within a theta cycle are about 7 or 8.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5653.617,
    "end": 5655.719,
    "text": "But then that lowers the actual resolution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5656.519,
    "end": 5665.025,
    "text": "And in fact, it's been shown that there's a relationship between the number of items held and physical causal manipulation of theta-gamma coupling in pupils.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5665.385,
    "end": 5671.789,
    "text": " skulls using some kind of extra tags or TMS, and their actual performance in working memory tasks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5672.589,
    "end": 5679.274,
    "text": "So Theta Gamma doesn't seem to be causally implicated in just constructing sets in working memory, which I think is kind of a cool idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5679.934,
    "end": 5689.98,
    "text": "So in this particular model, phrase level inferences generate words contained within the phrase before lower levels reset to the next phrase, manifested as Theta Phase Alignment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5690.941,
    "end": 5694.763,
    "text": "So each transition at the high level is accompanied by a resetting at the lower level stages.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5695.316,
    "end": 5713.737,
    "text": " So this is in line with the suggestion that low-frequency phase can coordinate the bundling of lexical features indexed by class gamma cycles within a given structure via forms of cross-frequency coupling, namely phase amplitude coupling and also phase-phase coupling, ensuring serial readout of features alongside the transfer of syntactic identities to language external systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5714.397,
    "end": 5718.819,
    "text": " So there's the kind of top-down information between different types of phase-on food coupling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5718.919,
    "end": 5720.419,
    "text": "This is kind of elaborated in my book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5720.739,
    "end": 5731.743,
    "text": "But the basic idea is that low-frequency phases coordinate and set the identity of whatever representations are being fetched and linearized and combined and chunked",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5732.31,
    "end": 5735.893,
    "text": " via these faster gamma cycles cross-cortically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5736.714,
    "end": 5741.398,
    "text": "Cross-cortically just means whatever part of the brain happens to be responsible for storing the representations that you care about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5741.779,
    "end": 5745.943,
    "text": "Again, language is very good at talking about extracting, fetching concepts from different domains.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5746.203,
    "end": 5754.931,
    "text": "So that would yield predictions for which cortical surfaces are being extracted and spoken to by this low-frequency phase coordination operation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5756.291,
    "end": 5769.175,
    "text": " So, theodogamical coupling has also formed part of recent models of scheduling and updating the list of syntactic semantic features being associated with a given chunk of linguistic stimuli, with gamma cycles indexing distinct data structures being coordinated by the database.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5769.355,
    "end": 5773.036,
    "text": "Data structures just means linguistic features, so semantic or syntactic features, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5773.436,
    "end": 5776.157,
    "text": "Like first-person number features, what have you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5776.917,
    "end": 5780.238,
    "text": "So, these proposals are potentially analogous from a neurocomputational perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5780.578,
    "end": 5781.438,
    "text": "So, you have the same",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5782.375,
    "end": 5788.941,
    "text": " lower level generic algorithm, neurocomputational algorithm, that's simply fetching discrete domain specific representations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5789.601,
    "end": 5802.593,
    "text": "Which also kind of feeds back into the Haynes idea I mentioned earlier, where you have these different systems, morality, music, mathematics, language, where the computation seems to be analogous, but the representations are different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5802.913,
    "end": 5806.256,
    "text": "So the same computation operating over different representational domains.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5807.861,
    "end": 5816.043,
    "text": " So through specifying a process theory that explains neuronal responses during perception and action, neuronal dynamics have previously been cast as a gradient flow on free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5816.643,
    "end": 5822.165,
    "text": "So that is to say, any neural process can be formulated as a minimization of the same quantity used in approximate phase inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5822.565,
    "end": 5826.766,
    "text": "So the brain seeks to minimize free energy, which is mathematically equivalent to maximizing battle evidence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5827.386,
    "end": 5832.548,
    "text": "And so this view of neuronal responses can be conceived with respect to Hamilton's principle of least action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5832.708,
    "end": 5834.368,
    "text": "So all these ideas kind of weave together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5835.834,
    "end": 5850.201,
    "text": " And in fact, recently, a deep temporal model for communication was developed based on a simulated conversation between two synthetic subjects, showing that certain behavioral and neurophysical correlates of communication arise under variational message passing, in particular, theta gamma coupling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5850.721,
    "end": 5854.123,
    "text": "So theta gamma coupling arose from this particular synthetic dialogue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5855.543,
    "end": 5863.407,
    "text": "So the model of syntax I've assumed in the paper assumes that syntax, sorry, in this particular paper by Christen, assumes that syntaxes are sequences of states or words,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5863.997,
    "end": 5889.917,
    "text": " a terminal node at the end of every sentence so kind of phrase boundary like a wrap-up effect right like a consolidation period and with each form of syntactic structure being limited to uh questions and answers in a game of 20 questions in this particular paper and but the conclusion of this paper of pretty much in keeping with core assumptions and linguistics concerning the inherently constructive nature of language so elementary syntactic units which are highly robust and concerned across speakers of the same language",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5890.523,
    "end": 5902.027,
    "text": " provide specific belief structures that are used to reduce uncertainty about the world through rapid and reflective categorisation of events, states and objects and their relations, again in compliance with the FEP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5902.087,
    "end": 5911.85,
    "text": "Sentential representations can be thought of as structures designed partially to consolidate and appropriately frame experiences and to contextualise and anticipate future experiences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5912.771,
    "end": 5916.752,
    "text": "So the range of possible syntactic structures available to comprehend this provides alternative",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5917.345,
    "end": 5922.747,
    "text": " alternate hypotheses that afford parsimonious explanations for sensory data, and as such they preclude everything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5923.587,
    "end": 5934.071,
    "text": "So if the complexity of the linguistic stimuli can be efficiently mapped to a small series of regular syntactic formats, this contributes to the brain's goal of restricting itself to a number of states, as I mentioned earlier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5935.511,
    "end": 5946.635,
    "text": "And again, by mapping syntactic structures to conceptual systems in a manner adhering to principles of economy, language can be seen as engaging in a series of questions and answers with sensory data itself, but also non-linguistic mental states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5947.415,
    "end": 5967.467,
    "text": " And only through natural language can we generate the full complexity of WH questions, you know, the questions I mentioned before, cross-serial dependencies, long-distance dependencies, where different elements across different structures depend on each other, fully gap dependencies and so on, which permit an expansion of what kinds of querying the brain connects to over sample data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5968.808,
    "end": 5975.912,
    "text": "So in other words, only with natural language syntax can the brain execute these particular type of queries and generate",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5977.09,
    "end": 5995.541,
    "text": " So all the ways that language-centered aspects, again, if you recall what I mentioned at the beginning, all of the ways that language-centered aspects of human cognition can be motivated through conformity to the FEP and active inference, so things like communication and narratives, all of that can actually be further derived from a more elementary focus on syntactic computational complexity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5997.262,
    "end": 6006.908,
    "text": "And in fact, there was a paper published a couple of days ago, again by Kristen's lab, which showed that neural dynamics under active inference are metabolically efficient and suggest that neural representations",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6007.626,
    "end": 6014.03,
    "text": " in biological agents may evolve by approximating steepest descent in information space towards the point of optimal inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6014.57,
    "end": 6026.978,
    "text": "And again, that's not a bad idea to pursue in connection to neurolinguistics in terms of the optimal inferences afforded by not just syntactic structures, but again, also lexical semantics, so individual words that I mentioned before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6028.879,
    "end": 6031.261,
    "text": "So just moving to a couple of conclusions from the slides.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6032.437,
    "end": 6040.624,
    "text": " I've tried to show that natural language syntax renders meaning-making and high-order inference a computationally efficient process, and it seemingly makes it right for what Lacoste et al.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6040.664,
    "end": 6049.931,
    "text": "call a key question for future research for active inference, which is how biological organisms effectively search large policy spaces when planning into the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6050.771,
    "end": 6057.957,
    "text": "So regardless of whether you want to assume particular economy conditions, X, Y, or Z, my motivation's been kind of more general.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6059.048,
    "end": 6065.61,
    "text": " It's just meant to consider how the FPP can, in principle, provide a novel explanation for the prevalence of efficiency-encoded linguistic rules.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6065.69,
    "end": 6073.573,
    "text": "And indeed, other linguists might disagree with me and disagree with the actual framing, and maybe the other linguistic frameworks, like maybe Ray Jeckendorf's framework of parallel architecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6073.893,
    "end": 6075.553,
    "text": "That might be more appropriate, too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6075.633,
    "end": 6076.834,
    "text": "Depends on your background assumptions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6077.974,
    "end": 6087.597,
    "text": "So it's specifically natural language syntax and its capacity for sentential complexity that allows language users to expand the scope of their prediction about their future position in the state space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6087.927,
    "end": 6091.669,
    "text": " we can think of more possible future scenarios.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6093.69,
    "end": 6115.682,
    "text": "So we've arrived at a number of suggested explanations for the way language implements deconstruction of hierarchical syntactic objects, namely to minimize uncertainty about the causes of sensory data, to unveil a species-unique format of external hidden states, to adhere to a least-effort principle, and in fact, in some cases, this involves externalization, but not always.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6116.527,
    "end": 6122.51,
    "text": " So exploring our disposal empirically may demand a more mature development of the science of computational complexity in the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6124.731,
    "end": 6131.515,
    "text": "So I basically argue that all of the ways that language, syntax, words, and cognition can be motivated for the MVP can simply be grounded through syntax.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6132.235,
    "end": 6140.44,
    "text": "So in other words, narratives are strong candidates for constructs adhering to active inference, but the generation of syntactic phrase structures is a necessary feature of any narrative, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6140.54,
    "end": 6142.961,
    "text": "You need to at least construct a phrase to generate a narrative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6144.585,
    "end": 6151.87,
    "text": " So I've reviewed how the FEP that underwrites active inference is an expression of the principle of least action, which is additionally a principle implemented in models of syntax.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6152.43,
    "end": 6157.733,
    "text": "So ultimately, both the FEP and syntactic theory are empirically and conceptually well-supported constructs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6158.414,
    "end": 6160.976,
    "text": "And as I've argued, they share a number of intriguing commonalities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6162.497,
    "end": 6172.223,
    "text": "So while the FEP has produced formal simulation-supported models of many complex cognitive mechanisms like action, perception, learning, and attention, and also communication, on the other hand, models of syntax",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6172.847,
    "end": 6177.368,
    "text": " have explained grammaticality intuitions, certain poverty of stimulus issues, i.e.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6177.488,
    "end": 6182.029,
    "text": "how kids acquire language, and the pervasive organizational role that hierarchy has in language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6182.089,
    "end": 6186.109,
    "text": "So hierarchy just seems to pretty much organize and determine almost all linguistic structures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6187.53,
    "end": 6191.77,
    "text": "Further, language is not the only domain which exhibits economy, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6191.81,
    "end": 6194.311,
    "text": "Suggesting a deeper grounding of this bias in natural law.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6194.831,
    "end": 6200.552,
    "text": "Other domains include concept learning, cause of reasoning, central motor learning, and also, as I said before, memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6202.731,
    "end": 6209.094,
    "text": " So importantly, active inference has been used to account for also creative functions that have to do with exploration and novelty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6209.414,
    "end": 6216.257,
    "text": "And the reason why that's important is because linguists have also long argued that the hallmark of natural language is actually its creative aspect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6216.277,
    "end": 6222.019,
    "text": "The ability to freely construct an unbounded array of hierarchically organized expressions with novel interpretations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6222.199,
    "end": 6225.021,
    "text": "So you can say sentences that have never been said before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6225.061,
    "end": 6229.703,
    "text": "Linguistic creativity can be framed in terms of adherence to physical thermodynamic conservativity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6229.843,
    "end": 6230.383,
    "text": "If it does so,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6230.814,
    "end": 6234.775,
    "text": " to minimize uncertainty in developing states within an individual model of external state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6236.516,
    "end": 6251.821,
    "text": "So in other words, the more efficiently a language user can internally construct meaningful hierarchically organized structures, the more readily they can use these structures to contribute to the planning and organization of action, consolidation, exogenous and endogenous monitoring, and adaptive environment sampling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6252.641,
    "end": 6256.623,
    "text": "I think it's worth recalling Gregor Mendel's application of complex algebra to botany.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6257.943,
    "end": 6260.264,
    "text": "At the time, this was deemed by many people to be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6260.822,
    "end": 6289.222,
    "text": " of weird and almost surreal and but in fact the same may be true of level conceptual directions and for natural language syntax and semantics right unconventional approaches that often soon turn out into the new normal uh only time can tell how far these directions can actually be pursued though all right thank you for listening okay sarah awesome you can unshare and then i hope we can ask a few of the questions yep",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6290.08,
    "end": 6290.28,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6290.3,
    "end": 6291.682,
    "text": "Do you want to unshare your screen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6291.902,
    "end": 6292.203,
    "text": "Oh, great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6292.283,
    "end": 6292.483,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6292.924,
    "end": 6293.364,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6293.624,
    "end": 6293.845,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6294.466,
    "end": 6297.049,
    "text": "I will just jump right in with the first question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6298.531,
    "end": 6301.835,
    "text": "Again, as a non-linguist, it was like looking up a bunch of words, learning a lot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6301.855,
    "end": 6302.996,
    "text": "So really fascinating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6303.737,
    "end": 6308.223,
    "text": "The first question was, and I think it was related to when you said that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6309.264,
    "end": 6312.706,
    "text": " Language is not just about communication despite that being a common conception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6313.366,
    "end": 6316.607,
    "text": "So potentially it's about the structure of thought or the structure of thinking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6317.068,
    "end": 6329.173,
    "text": "So the question was, it would be great if Elliot could define what is his definition of thought and what is potentially the contribution of the intracranial language research towards answering the hard problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6330.914,
    "end": 6331.174,
    "text": "Wow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6332.555,
    "end": 6333.935,
    "text": "So you started with the easy question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6334.075,
    "end": 6334.296,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6335.822,
    "end": 6336.763,
    "text": " Yeah, that's a really good question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6336.783,
    "end": 6341.888,
    "text": "So I like to think of thought as I do any other language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6342.008,
    "end": 6343.109,
    "text": "It's kind of like a metaphor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6343.51,
    "end": 6352.558,
    "text": "So, you know, in some languages, when a human being does a long jump, they only jump.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6352.819,
    "end": 6354.76,
    "text": "So in English, we just say they jump.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6355.161,
    "end": 6357.303,
    "text": "In Japanese, they actually allow flying.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6358.126,
    "end": 6365.873,
    "text": " So if a Japanese linguist is at the Olympics and they see someone do high jump or long jump, they could technically say they're flying.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6366.774,
    "end": 6367.874,
    "text": "But it's just a metaphor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6367.914,
    "end": 6369.075,
    "text": "I think it's the same with thought as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6369.396,
    "end": 6370.577,
    "text": "So thought is just a metaphor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6370.617,
    "end": 6375.501,
    "text": "I don't think we have any... It's not a well-defined scientific natural kind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6375.861,
    "end": 6377.343,
    "text": "It's kind of a useful convenience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6378.203,
    "end": 6379.424,
    "text": "But that said, I think...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6380.481,
    "end": 6391.969,
    "text": " The way I see it is natural language syntax allows us to fetch particular domain specific representations from all sorts of different domains and then construct them into novel interpretations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6392.91,
    "end": 6395.691,
    "text": "The important thing is that all of this is outside language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6395.992,
    "end": 6399.674,
    "text": "So the interpretation process is an extra linguistic process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6400.154,
    "end": 6409.601,
    "text": "The only linguistic specific process is just combining a phrase, just combining items, putting them together and then shipping them off to an external interface for interpretation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6410.286,
    "end": 6412.127,
    "text": " So that's the thought process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6412.667,
    "end": 6415.187,
    "text": "I don't have any deep particular reflections on it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6415.207,
    "end": 6437.093,
    "text": "I think the best book about this is Paul Petroski's Conjoining Meanings that came out in 2018, which is the idea that what language contributes to thought is kind of what I said here today, like it uniquely encodes a kind of functional abstraction, whereas different cognitive subdomains like the visual system or the olfactory system, I guess, a sense of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6440.362,
    "end": 6450.47,
    "text": " and number sense or geometric reasoning, these all contribute distinct sub-representations of a given sentence, but language seems to uniquely care about function, so abstract function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6450.79,
    "end": 6469.424,
    "text": "So I guess I would say that if linguistic thought can be defined at all, it's almost definitely gonna closely approximate human-specific interests and concerns and needs and things like that, which is kind of surprising, because a lot of people just think of language as kind of, you know, in an unbiased way,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6470.066,
    "end": 6474.827,
    "text": " communicating with the conceptual structures, like thought, like language is kind of a thought system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6475.327,
    "end": 6476.308,
    "text": "But I don't really see it that way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6476.348,
    "end": 6481.089,
    "text": "I kind of see it as language does seem to bring with it some unique conceptual contributions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6481.829,
    "end": 6490.391,
    "text": "Namely, it seems to encode these human-specific functions, which is why I said, you know, if you look at water, water cannot simply be defined as H2O.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6490.591,
    "end": 6491.592,
    "text": "It's way too simplistic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6492.252,
    "end": 6494.212,
    "text": "The actual meaning of water is way beyond that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6494.832,
    "end": 6497.033,
    "text": "And then with respect to intercranial stuff,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6499.682,
    "end": 6500.322,
    "text": " I'm not too sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6500.342,
    "end": 6506.667,
    "text": "So intracranial research is fantastic at actually examining in real time actual neural responses, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6506.807,
    "end": 6508.448,
    "text": "So getting really down to integrity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6508.828,
    "end": 6515.673,
    "text": "It depends on the type of electrode that you have, its resolution, its listening radius, how much cortex you can actually sample.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6515.713,
    "end": 6523.057,
    "text": "There's also something called the sparse sampling problem in intracranial research where you have very great coverage of specific cortical loci.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6523.518,
    "end": 6526.44,
    "text": "But then, of course, each patient will have different electrodes in different parts of the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6526.76,
    "end": 6528.541,
    "text": "There's no patient that has electrodes everywhere.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6528.971,
    "end": 6531.653,
    "text": " They only have electrodes where their epilepsy is supposed to be targeted.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6531.913,
    "end": 6534.315,
    "text": "So for research purposes, that obviously brings limitations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6534.756,
    "end": 6540.64,
    "text": "So I don't think we'll ever be able to have a coherent global whole-grain intrapatient understanding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6540.901,
    "end": 6547.746,
    "text": "What we do is we sumate, we combine across all these different patients and generate a more kind of average brain response, if that makes sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6548.086,
    "end": 6555.913,
    "text": "So in that sense, it can contribute just the same way any other MEG or extra-cranial EEG can do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6556.113,
    "end": 6557.454,
    "text": "It depends on the paradigm, it depends on...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6558.784,
    "end": 6561.987,
    "text": " I think the real crucial point here is conceptual innovation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6562.488,
    "end": 6567.533,
    "text": "So what we really need is we have tons of data from natural language experiments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6567.613,
    "end": 6573.099,
    "text": "We have loads of data, but we don't have all that much conceptual novelty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6573.5,
    "end": 6579.186,
    "text": "So linguists are very good at coming up with very smart paradigms for very well carefully controlled experiments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6580.179,
    "end": 6587.147,
    "text": " But then when it comes to actual novel conceptual frameworks for how these things actually map onto brain processes, I think we need much more of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6587.467,
    "end": 6597.138,
    "text": "So I think actually inter-cranial research will not be as useful as conceptual theoretical changes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6597.218,
    "end": 6598.72,
    "text": "I think that's much more important, actually.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6598.74,
    "end": 6599.34,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6601.127,
    "end": 6624.068,
    "text": " well one area of utility that you didn't even go into at all would be machine learning and the long time challenge of natural language parsing and generation and the recent approach has been throw the big neural network at it with the gpt and just large-scale text modeling and then that reminded me of what you said about multi-scale models how we don't overfit the semantics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6624.588,
    "end": 6626.029,
    "text": " even when we hear a ton of syllables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6626.209,
    "end": 6628.17,
    "text": "I really, really, really, really, really am hungry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6628.531,
    "end": 6631.372,
    "text": "And then a computer might just spit out a p-value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6631.693,
    "end": 6632.833,
    "text": "It's kind of like oversampling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6633.013,
    "end": 6639.117,
    "text": "But we don't want to oversample semantically, so there's going to be really interesting space for active inference models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6639.698,
    "end": 6641.439,
    "text": "OK, here's the- Absolutely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6642.179,
    "end": 6644.22,
    "text": " Okay, I'll go to the next question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6646.24,
    "end": 6659.484,
    "text": "Can free energy principle and this syntactic theory framework help explain how and why the brain computes inner speech the way that it does and provide the possibility to predict what's about to be computed in the future?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6659.544,
    "end": 6666.467,
    "text": "So how do we think about externalizing speech like vocalization versus our inner experience of speech?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6667.047,
    "end": 6668.127,
    "text": "Are those structured?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6668.307,
    "end": 6669.408,
    "text": "Are those in our voice?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6669.488,
    "end": 6670.488,
    "text": "Like what is happening?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6671.348,
    "end": 6672.748,
    "text": " I think that's a really cool question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6673.529,
    "end": 6677.17,
    "text": "But I think there's also a lot of misconceptions about this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6677.23,
    "end": 6684.472,
    "text": "So most people think that external speech is kind of crude, and it has nothing to do with thought.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6684.692,
    "end": 6690.974,
    "text": "But internal speech is like some kind of angelic, platonic space, like Plato's cave.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6691.414,
    "end": 6692.555,
    "text": "But actually, I think that's the opposite.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6692.575,
    "end": 6693.315,
    "text": "I think they're both the same.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6693.735,
    "end": 6696.256,
    "text": "So internalized speech is basically",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6697.401,
    "end": 6700.363,
    "text": " internalized, externalized speech.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6700.583,
    "end": 6705.846,
    "text": "When you listen to yourself speaking in a monologue, you're doing it in the format of externalized speech.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6706.226,
    "end": 6707.607,
    "text": "You're not doing it in a different format.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6707.827,
    "end": 6713.771,
    "text": "It's not as if inner speech has a different structure and a different encoding, and then external speech is something different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6715.572,
    "end": 6717.753,
    "text": " I wake up in the morning, I still think to myself in English.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6717.973,
    "end": 6720.433,
    "text": "I think to myself in linear sentences, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6720.554,
    "end": 6722.134,
    "text": "That's how the thought is externalized.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6722.534,
    "end": 6727.116,
    "text": "So this is why I said about the interface between language and conceptual systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6727.336,
    "end": 6731.537,
    "text": "What's happening in inner speech is that you are externalizing in your own head.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6732.017,
    "end": 6734.658,
    "text": "So inner speech is basically a form of externalization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6735.978,
    "end": 6738.699,
    "text": "Not all forms of externalization involve me literally saying things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6739.119,
    "end": 6740.139,
    "text": "You're still externalizing it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6740.159,
    "end": 6741.46,
    "text": "You're just externalizing it to yourself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6742.486,
    "end": 6748.874,
    "text": " So in other words, actual linguistic thought is pre-conscious, it's subconscious.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6749.515,
    "end": 6754.641,
    "text": "And that's why we need linguistics departments to kind of figure out what are these subconscious operations that are happening, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6754.842,
    "end": 6760.309,
    "text": "So we have a bunch of subconscious merge operations that are happening, but we don't have direct conscious access to those.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6761.986,
    "end": 6762.527,
    "text": " And why should we?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6762.547,
    "end": 6763.628,
    "text": "There's no reason why we should do, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6764.108,
    "end": 6772.436,
    "text": "But we do have direct access to the externalized output in our kind of self-generated auditory encoding of that structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6772.997,
    "end": 6776.3,
    "text": "So I can't remember what the question was, sorry, but yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6778.905,
    "end": 6784.811,
    "text": " that reminds me of thinking through other minds, a recent paper in our active inference community.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6784.891,
    "end": 6794.2,
    "text": "And then also, yeah, there's just so many interesting aspects about how you really pointed to these domain general attributes of language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6795.061,
    "end": 6795.221,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6796.368,
    "end": 6824.822,
    "text": " yes i'm rethinking language and some of the ways that we even communicate on the stream because you'll see people say i'm just not sure how to say it it's like but are you sure how to how to think it oh no yeah because actually if we think through it and then we have feedback writing and we can it's like stigma g we're making these meaning marks and then we're reinterpreting that and so it's going to be quite interesting there here's a third question um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6825.862,
    "end": 6826.142,
    "text": " Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6826.302,
    "end": 6826.803,
    "text": "Great talk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6827.403,
    "end": 6835.088,
    "text": "Given that the sequences are generated in nested hierarchical structures, where would linear externalization fit in here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6835.408,
    "end": 6838.13,
    "text": "Can we say that they're bound by linear externalizations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6838.39,
    "end": 6841.332,
    "text": "And then maybe if that's a linguistics term, what does that mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6841.352,
    "end": 6841.992,
    "text": "Yeah, it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6842.052,
    "end": 6842.393,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6842.513,
    "end": 6843.053,
    "text": "Okay, great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6844.894,
    "end": 6846.995,
    "text": "Where do linear externalizations fit into here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6847.076,
    "end": 6850.878,
    "text": "That's a really good question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6851.924,
    "end": 6855.046,
    "text": " I'm not quite sure what the questioner is trying to ask.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6855.206,
    "end": 6856.947,
    "text": "I kind of understand what they're saying.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6858.508,
    "end": 6860.089,
    "text": "So I guess, okay, okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6860.249,
    "end": 6879.061,
    "text": "So it's typically assumed that linear externalization is like the output of the syntactic system, and that it turns out upon further analysis that most of the world's languages' differences, the way that the world's languages differ, is based on morphophonological differences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6879.101,
    "end": 6879.601,
    "text": "So in other words,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6879.946,
    "end": 6882.329,
    "text": " the way that more themes and sounds are produced.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6882.669,
    "end": 6885.372,
    "text": "But the actual semantics and syntax is kind of fairly linear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6886.092,
    "end": 6892.739,
    "text": "So in other words, all the universal things about language are kind of early on, and all the differences in the world's languages are kind of very late on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6893.12,
    "end": 6894.982,
    "text": "So late in the interpretation process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6895.461,
    "end": 6901.586,
    "text": " So when you generate a structure that you want to say, you at least need to have the syntax first, because that's the most uniform structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6901.927,
    "end": 6907.932,
    "text": "And then once you've got the syntax in place, you then go about filling in all the sound details.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6908.472,
    "end": 6911.215,
    "text": "But the sound details are kind of irrelevant for language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6911.255,
    "end": 6915.258,
    "text": "That's just an annoyance, basically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6915.399,
    "end": 6917.4,
    "text": "So I gave you the example of English and Basque.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6917.681,
    "end": 6920.423,
    "text": "So English and Basque have the same underlying phrase structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6920.845,
    "end": 6922.347,
    "text": " but they linearize it in different ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6922.767,
    "end": 6929.295,
    "text": "So they just happen to linearize it based on whatever arbitrary conventions happen to have arisen in those different cultures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6929.696,
    "end": 6931.799,
    "text": "But the actual interpretation is exactly the same.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6932.099,
    "end": 6939.288,
    "text": "So I would say whatever linearization, whenever it happens, happens late stage, and it happens as an inconvenience to the language system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6940.996,
    "end": 6965.641,
    "text": " interesting and sometimes people will point to different languages or a word that appears unique to even a cultural experience but it's sort of the other side of that coin is the truly 99.9 that's structured functionally like that can be translated and so it is the exception that proves the rule just like when we we violate syntax sometimes to make a point like repeating a word",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6966.301,
    "end": 6985.473,
    "text": " and then in our internal monologue maybe even like singing or alternate characters it's sort of like it's a dramatic externalization but it's the exception that proves the rule or it's kind of like the grand master chess player who violates a principle but that is is mastery over the syntax and we can't let those exceptions that prove the rule",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6986.394,
    "end": 7015.943,
    "text": " lead us to throw out the baby with the bathwater or however else they say it but it by highlighting language as functional and the structure of thinking rather than like um rhetorical only in its deployment was just connecting two nodes and you're really opening it up to think about what's inside of the cranium as well and taking measurements from there but it's what's happening with our thought that's being revealed in a linear string",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7016.363,
    "end": 7023.788,
    "text": " So one of my favorite examples of modeling the future is magical realism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7024.228,
    "end": 7032.693,
    "text": "And magical realism is basically getting a blender, putting lots of different random concepts in there, and blending them all together and seeing what comes out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7033.203,
    "end": 7040.99,
    "text": " So a lot of literary novelty, literary conventions, novels, poetry, is novel precisely because it's kind of experimental.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7041.25,
    "end": 7044.533,
    "text": "It's saying, let's see what happens when we put these two random different concepts together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7044.553,
    "end": 7050.299,
    "text": "Let's see if they can generate a meaningful interpretation that is either emotionally resonant or conceptually intriguing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7050.719,
    "end": 7053.962,
    "text": "And in fact, some of the most important poetry that's been written",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7054.281,
    "end": 7060.303,
    "text": " in the English language has violated rules of English grammar precisely to generate these novel interpretations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7060.624,
    "end": 7067.766,
    "text": "It's an intentional violation of some kind of linguistic rule, which it's like a signal to the reader that there's a reason for this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7068.086,
    "end": 7070.707,
    "text": "It sends a message, it reflects something or whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7071.488,
    "end": 7076.65,
    "text": "But yeah, absolutely, these exceptions to the rule are extremely important to think about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7077.856,
    "end": 7100.302,
    "text": " my final question is how my digital discourse and multimedia be influencing structure of language structure of thought like are we synchronizing on the functional aspects with memes or are we diverging in our narratives so how is that playing out when it's more multimedia visual video",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7100.802,
    "end": 7106.509,
    "text": " than ever less of it is spoken and read, which is the linearized sort of classical language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7106.629,
    "end": 7108.351,
    "text": "And now there's unconventional languages.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7108.411,
    "end": 7109.932,
    "text": "So where does that, how's that going to work?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7110.893,
    "end": 7111.114,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7111.654,
    "end": 7119.203,
    "text": "So, so, I mean, I know that the capacity and the prevalence of like, uh, long-term digesting of like, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7119.688,
    "end": 7122.649,
    "text": " long Sunday Times articles is declining.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7123.269,
    "end": 7128.191,
    "text": "The propensity for bite-sized, chunking information is easily digestible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7128.491,
    "end": 7129.871,
    "text": "It involves less critical thinking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7130.691,
    "end": 7133.372,
    "text": "Judgements, ideological otherwise, can be made rapidly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7133.732,
    "end": 7136.033,
    "text": "Inferences can be made, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7136.133,
    "end": 7138.034,
    "text": "That is definitely on the rise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7138.214,
    "end": 7141.295,
    "text": "However, there was a linguistics book that came out, I believe, around 2010.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7141.335,
    "end": 7144.436,
    "text": "I can't remember who it was by.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7146.588,
    "end": 7152.449,
    "text": " It was basically just analyzing the idea that, so around the turn of the century, obviously mobile phones came about, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7152.809,
    "end": 7159.891,
    "text": "And everyone started texting and using all these different, so instead of saying please, you would say, you'd type PLZ.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7160.631,
    "end": 7164.292,
    "text": "Instead of saying mate, you'd say M8 or whatever, all these different abbreviations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7164.912,
    "end": 7169.673,
    "text": "And at the time, a lot of people in England were very concerned about this because they said, well,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7170.16,
    "end": 7175.802,
    "text": " all our kids are going to be, you know, they're going to grow up stupid because they use all these slang deviations of English.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7176.722,
    "end": 7183.724,
    "text": "It turns out that there's almost no evidence that this affects intelligence, like people's ability to, you know, be smart and use language and identify language grammatically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7184.164,
    "end": 7197.528,
    "text": "Because in fact, when you think about it, if you use text language, if you open a WhatsApp chat and you start and you text with somebody and you use all these emojis and you use all these abbreviations for words, it presupposes that you actually know the correct version.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7197.858,
    "end": 7200.881,
    "text": " Because in order to violate the rules, it presupposes that you understand them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7201.341,
    "end": 7210.59,
    "text": "So flouting the rules of grammar and flouting the rules of spelling actually exhibits comprehension of genuine rules of English, whatever you want to call them, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7211.571,
    "end": 7214.854,
    "text": "And that was the example about the linguist gate in this book on texting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7214.914,
    "end": 7216.276,
    "text": "Again, I can't remember it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7217.364,
    "end": 7224.179,
    "text": " So I think that's a pretty good example of when this panic, this moral panic in society over text.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7225.241,
    "end": 7225.923,
    "text": "The answer is I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7226.324,
    "end": 7226.985,
    "text": "I have no idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7228.559,
    "end": 7251.368,
    "text": " on that sort of moral panic i guess i thought it's like um then at some point maybe even they forget how to spell it p l e a s e you know how to spell please and then it's kind of like our word roots you know oh i can't believe you don't speak greek enough to know that the word roots of this it's like it's become modularized so units that were novelties at first and exceptions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7252.068,
    "end": 7259.831,
    "text": " become reified within a cultural context, a shared niche and shared narrative so that like the crying emoji does mean this functionally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7260.332,
    "end": 7264.173,
    "text": "And then someone could say, I can't believe that you don't know that it used to mean this in a different language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7264.313,
    "end": 7264.874,
    "text": "It's sort of like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7265.994,
    "end": 7292.748,
    "text": " it speaks to so many of these excellent themes so yeah yeah elliot awesome guest stream thanks for your first appearance and we're always looking forward to what you might want to share with us in the future so thanks again yeah totally well yeah this is an ongoing project so i'm sure i'll have more to share and thank you very much for having me thank you for the conversation i really enjoyed it and thank you for the questions too so yeah totally thank you elliot and to all audience so see you later",
    "speaker": "SPEAKER_01"
  }
]