[
  {
    "start": 2.782,
    "end": 3.182,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4.825,
    "end": 5.425,
    "text": "Hello, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7.888,
    "end": 10.632,
    "text": "Cohort 5, it's our first discussion on Chapter 4.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 11.773,
    "end": 18.762,
    "text": "So, does anyone want to give just any thought on 4 overall?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 22.386,
    "end": 29.295,
    "text": "Just any aspect of what they expected or got from it or however far they got or some section that was...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.195,
    "end": 33.257,
    "text": " Just interesting to them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 45.277,
    "end": 46.118,
    "text": "I have a question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 51.026,
    "end": 51.587,
    "text": "So.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 52.748,
    "end": 69.049,
    "text": " One kind of generative model that I am familiar with is one way of representing a generative model is using Markov decision process or partially observable Markov decision process.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 70.41,
    "end": 78.641,
    "text": "This is for discrete, the discrete case of generative modeling.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 79.161,
    "end": 80.443,
    "text": "I'm wondering,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 80.879,
    "end": 88.833,
    "text": " What else what other what are other very popular or common structures that are used to.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 90.476,
    "end": 92.399,
    "text": "write down or express gender models.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 102.436,
    "end": 104.119,
    "text": "Anyone want to give a thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 116.84,
    "end": 124.728,
    "text": " I would say one alternative way to write down parts of generative models is the continuous time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 125.79,
    "end": 136.941,
    "text": "But are you asking, is there another way to represent discrete time generative models other than with a POMDP?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 137.963,
    "end": 145.851,
    "text": "Right, to begin with, because of course there's the whole other area of continuous time, but...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 145.898,
    "end": 165.415,
    "text": " There's one important aspect to the whole question of Bayesian inference, which is, or some agent, some organism that's implementing Bayesian inferences.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 166.015,
    "end": 175.163,
    "text": "How does it not only learn the parameters of a generative model, but how does it also learn the structure?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 175.227,
    "end": 175.928,
    "text": " of that model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 177.009,
    "end": 200.02,
    "text": "And this is connected, for example, to questions about nature versus nurture and development in humans or animals, like what are the initial conditions, what kind of either inductive priors or like",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 200.641,
    "end": 225.282,
    "text": " um structure biases does our neural architecture uh provide us with from the very beginning and whatever it doesn't provide us with how how do we figure out what kinds of structure is appropriate for for modeling a particular domain",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 234.526,
    "end": 235.468,
    "text": " Paul, do you have any thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 241.638,
    "end": 258.087,
    "text": "Well, first of all, about the initial states of any system that I mean, it doesn't always in active inference modeling, we don't always assume",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 258.809,
    "end": 264.779,
    "text": " Any agent like Tabula Rasa, I mean, we don't always begin from scratch.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 265.3,
    "end": 284.513,
    "text": "So in most cases, we necessarily impose some initial conditions in order to make it more efficient to model the exact behavior or phenomenon of interest, because otherwise",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 284.493,
    "end": 291.644,
    "text": " we won't be able to model the whole process.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 291.864,
    "end": 303.341,
    "text": "I mean, all the emergent properties that the agents have acquired through their lifespan.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 304.002,
    "end": 306.366,
    "text": "So it is...",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 306.346,
    "end": 322.87,
    "text": " it wouldn't be feasible to try to put everything in such an encapsulated form of generative model in order to encompass the agents",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 322.85,
    "end": 340.943,
    "text": " uh entire uh i mean experience and lifespan so it is necessarily uh more focused than that and it addresses a specific problem uh we're trying to uh we're trying to model so uh",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 340.923,
    "end": 357.363,
    "text": " I guess it's not something a priori, and it isn't any prerequisite to model any situation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 357.983,
    "end": 369.597,
    "text": "But when it comes to how an agent acquires those initial learnings, those initial states, well, obviously, there are many, many ways to",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 369.88,
    "end": 372.245,
    "text": " Kaveh Khoshnood, address that problem.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 372.285,
    "end": 376.133,
    "text": "Kaveh Khoshnood, With with various perspectives, but.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 376.754,
    "end": 384.21,
    "text": "Kaveh Khoshnood, Of course, FAP or active inference, in my opinion, is not.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 385.252,
    "end": 388.699,
    "text": "Kaveh Khoshnood, A theory or a framework that can answer.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 388.983,
    "end": 398.856,
    "text": " every question regarding to the behaviour of the agent in every possible situation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 399.217,
    "end": 410.552,
    "text": "So we need to look for other granular problems in order to account for the lifespan experience of an agent.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 412.27,
    "end": 412.631,
    "text": " Got it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 413.131,
    "end": 413.512,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 414.293,
    "end": 420.201,
    "text": "So just to kind of reiterate and clarify this response for myself.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 422.124,
    "end": 440.269,
    "text": "In my mind, I kind of related a bit to the one hand, this distinction we we often need to make and keep in mind between and a realist interpretation, active inference and a instrumentalist one where",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 440.249,
    "end": 451.593,
    "text": " the latter is us taking this mindset of like, okay, there are agents out there in the world, there are things out there in the world, and they do stuff.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 452.154,
    "end": 460.992,
    "text": "We can't be completely sure of exactly what they're implementing mechanistically, but we can develop a framework.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 460.972,
    "end": 490.843,
    "text": " for making some sense of it for ourselves and part of the way that we make some progress on that making sense project is to use our own suspicions use our own power knowledge to to write down or express or postulate some some structure to postulate some generative model uh and then we can we can",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 490.823,
    "end": 507.406,
    "text": " active references or templates where we can input that generative model, perform inference on it, and then perhaps eventually make some predictions about the behavior of the system and compare that to what the system is actually doing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 508.227,
    "end": 520.003,
    "text": "But something that you're pointing out is that within the context of the framework, there isn't necessarily some",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 521.317,
    "end": 537.351,
    "text": " uh procedure for figuring out okay if you didn't have this uh these priors about what what it is that the generative model could look like uh and and",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 538.85,
    "end": 554.757,
    "text": " I suspect we suspect that, for example, humans don't come with all of the structure that they need embedded from the moment they're born in order to model the world.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 555.799,
    "end": 562.63,
    "text": "Maybe they have some structure built in, but they acquire more of it and learn more of it over time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 563.048,
    "end": 567.335,
    "text": " What's active reference is is not doesn't have all the tools.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 569.037,
    "end": 575.547,
    "text": "To perform that learning of the structure you that's also an area of work that's.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 577.31,
    "end": 581.196,
    "text": "You can do, but it's not.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 581.216,
    "end": 582.098,
    "text": "explicitly.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 583.32,
    "end": 586.845,
    "text": "Part of active reference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 586.977,
    "end": 599.749,
    "text": " Just to clear up a little bit here, because you see, even in the very fabric of the first principles of active inference, namely the free energy principle.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 599.769,
    "end": 616.225,
    "text": "So the free energy principle assumes the existence of code-uncode things, and then try to characterize what would the existence of those things constitute.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 616.205,
    "end": 633.927,
    "text": " Okay, so it doesn't necessarily provide an account for, I mean, how the existence occurred, how those emergent properties arise from",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 634.7,
    "end": 649.148,
    "text": " Um, uh, from, uh, from lower causalities, uh, of course it can describe, uh, those causes relationships by assuming that those, uh, uh, emergent phenomena.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 649.448,
    "end": 672.908,
    "text": " uh have happened uh already so uh it takes as the very first as the very first step and as an initial uh as an initial uh state the very existence of those things right uh so when it comes to uh modeling um",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 672.888,
    "end": 696.28,
    "text": " an agent's behavior within active inference framework i believe the same mindset applies here as well so it doesn't necessarily account for the how questions but rather to it it tries to characterize the what questions",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 696.479,
    "end": 720.597,
    "text": " I'm not sure if it clears up your question here or not, but it's not an account that tries to, let me put it this way.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 720.779,
    "end": 746.803,
    "text": " if we have this system at our disposal that we we try to understand the its mechanism or or the way it behaves active inference provides a comprehensive tool to write down the behavior of the agent",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 747.357,
    "end": 772.47,
    "text": " within specific mathematical technology but it doesn't necessarily account for the emergence of that agent it doesn't necessarily account for how that agent emerged at the first place so that's one of the misconceptions about free energy principle",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 772.855,
    "end": 791.155,
    "text": " and active inference, because some people think that free energy principle being the theory of every code unquote thing would necessarily entail accounting for the emergence of those ontological entities.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 792.196,
    "end": 798.342,
    "text": "But it's it was never the claim of free energy principle.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 798.442,
    "end": 800.044,
    "text": "So",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 800.8,
    "end": 812.246,
    "text": " Yeah, it takes the existence of those things as the given and then try to describe those behavior.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 813.028,
    "end": 813.61,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 814.712,
    "end": 816.396,
    "text": "Inks, then Andrew.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 820.139,
    "end": 832.461,
    "text": " Hi, I have a separate question, but now I got involved in this so, but I do want to understand, so if we were to model like super deep seek temporal modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 833.977,
    "end": 861.199,
    "text": " of a person as they're born and they go through their life if someone was sitting there active inferencing everything that they're doing that would account for the development of the faster prior updating of priors and the slower updating of generative models right that would somehow build like a human with their understanding of the world not build but model how they become themselves",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 865.077,
    "end": 872.408,
    "text": " I mean, to the coarsest approximation, yeah, you could make a generative model that included decades.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 874.491,
    "end": 880.18,
    "text": "Would that mean it would give useful insights or interface with empirical data?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 880.22,
    "end": 883.465,
    "text": "Not at that coarse graining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 884.346,
    "end": 887.37,
    "text": "Could it be developed to be richer and more useful and meaningful?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 889.153,
    "end": 890.495,
    "text": "Interesting question, but I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 890.776,
    "end": 892.418,
    "text": "Does anyone else want to give a thought on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 900.295,
    "end": 901.517,
    "text": " Well, I would find it useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 901.577,
    "end": 903.059,
    "text": "I do have another question though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 903.079,
    "end": 905.342,
    "text": "That was just... Okay, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 905.362,
    "end": 906.124,
    "text": "Okay, sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 906.144,
    "end": 917.861,
    "text": "So this is from the book, page 77, where the figure 4-4 describes the Bayesian message passing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 918.922,
    "end": 926.353,
    "text": "So my question there is the black circle one,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 928.477,
    "end": 939.475,
    "text": " the one that says intuitively current beliefs about states under each policy at each time are compared with those that would be predicted given beliefs about states at other times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 940.797,
    "end": 951.394,
    "text": "So this is the statistician inferring by comparing different predicted states at different times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 951.474,
    "end": 953.117,
    "text": "Does that mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 953.266,
    "end": 977.873,
    "text": " is basically time flowing left to right and you're trying all these different policy policies or are these alternative policies about something you can do right now and you can do different things about it and you're trying them out in your mind is this time flowing left to right or are these in my mind like if i do this this will happen if i do this this will happen",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 978.815,
    "end": 1001.498,
    "text": " and i compare them in my mind almost barely like they are counterfactuals to each other thank you yes ali uh okay so there's a distinction in active interest literature between uh the time as uh",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1001.663,
    "end": 1003.986,
    "text": " T as the letter T and tau.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1005.247,
    "end": 1019.104,
    "text": "So more often than not, when active inference researchers use the letter T for time, they mean the flow of time as we know it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1019.725,
    "end": 1022.629,
    "text": "I mean, the intuitive time or our perceived time.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1023.209,
    "end": 1030.438,
    "text": "But when they use tau, it doesn't necessarily refer to the flow of time, but rather",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1030.418,
    "end": 1047.482,
    "text": " uh to uh to the steps uh that an agent uh would take in order to achieve a goal so uh tau in a spec in a particular moment is not necessarily uh",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1047.968,
    "end": 1055.339,
    "text": " I mean, the time interval between two taus are not necessarily equal, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1055.419,
    "end": 1067.436,
    "text": "So it tries to model the specific steps of the decision-making or the action taken to achieve a particular goal.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1071.081,
    "end": 1071.442,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1071.462,
    "end": 1073.044,
    "text": "That's one aspect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1073.184,
    "end": 1077.25,
    "text": "I think, does anyone else want to give another thought on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1078.057,
    "end": 1092.133,
    "text": " Can I clarify, my question is, are there counterfactual policies that only one will get implemented or is it step after step of of enacting like a project of long a strategy of many policies so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1093.43,
    "end": 1117.564,
    "text": " in the pseudo code usually as implemented during the policy updating so going from the policy prior to the policy posterior that's using the expected free energy so that's when different policies are being considered so policy however long it is it's going to start with your next action and then include that many steps out",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1118.135,
    "end": 1124.503,
    "text": " So then if there's four options at each step, four affordances, so you're going to do policies of step two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1125.284,
    "end": 1126.565,
    "text": "So there's 16.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1126.585,
    "end": 1132.032,
    "text": "So then in the pseudocode, there's 16 policies, and then there's the prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1132.052,
    "end": 1135.656,
    "text": "So if they're all equally likely, then they'll be all even.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1136.557,
    "end": 1140.442,
    "text": "Then all of them are iterated over in a loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1141.443,
    "end": 1145.188,
    "text": "And then while each one's getting iterated over, it is rolled out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1148.105,
    "end": 1157.534,
    "text": " And then they're all compared at the end, resulting in the updated distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1158.876,
    "end": 1165.943,
    "text": "And then so let's just say it's 80% for the first option, and then 10, and then five, and then a few.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1167.384,
    "end": 1176.593,
    "text": "So then you could draw from that distribution and choose to do that, or you could pick just like the best option.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1177.079,
    "end": 1186.773,
    "text": " Which is actually something that Magnus discussed in this live stream 55.1, which is about this message passing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1188.215,
    "end": 1201.433,
    "text": "Because it's kind of a lot to it, but also it's a very important relationship and also one that's not really addressed in the textbook just a few times kind of dropped in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1208.973,
    "end": 1237.512,
    "text": " uh okay andrew and then anyone else yeah i just wanted to give my stab at uh the prior question um it seemed to be asking what active or the free energy principle is or isn't and um to me it it's a set of constraints it's it's telling you what open functions and functors",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1237.812,
    "end": 1249.633,
    "text": " namely your C's and your Q's, if I am correct, can and cannot do if they are to be an entity that persists spatial temporarily.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1251.877,
    "end": 1256.385,
    "text": "So it doesn't tell you what those functions are.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1256.665,
    "end": 1262.976,
    "text": "It leaves them as three variables, but it constrains their behavior.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1264.424,
    "end": 1274.238,
    "text": " So I guess it's a different way of thinking about things than thinking about like what is force equals mass times acceleration.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1277.042,
    "end": 1279.966,
    "text": "It's not showing transfer of energy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1280.006,
    "end": 1286.415,
    "text": "It's saying where energy is constrained to go if something is to persist over time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1290.597,
    "end": 1314.512,
    "text": " yeah that's very interesting um also this this is one one paper the title kind of summarizes this very simple yet perplexing argument by Axel constant it's not about what it takes it's about what took you there so it's pretty interesting um raw",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1315.724,
    "end": 1321.399,
    "text": " yeah can you elaborate what's your interpretation of that pedal is.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1322.984,
    "end": 1323.525,
    "text": "Of what is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1324.147,
    "end": 1328.198,
    "text": "Of this title it's not about what it takes it's about what took you there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1334.405,
    "end": 1336.727,
    "text": " I think here is said really well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1338.009,
    "end": 1346.738,
    "text": "So just to generalize it, if something exists right now under the right conditions, it's because it's done something like minimizing its free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1347.179,
    "end": 1350.862,
    "text": "So it's as if it's used variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1351.743,
    "end": 1359.592,
    "text": "However, the question of whether it will exist tomorrow cannot be settled purely by resorting to the fact that it will minimize its free energy to get there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1361.734,
    "end": 1362.775,
    "text": "So something could just,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1364.122,
    "end": 1374.818,
    "text": " All just you know it's I don't it may also be like saying like past results is not future performance or something like things could change in the niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1376.541,
    "end": 1378.864,
    "text": "So it's it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1380.887,
    "end": 1383.972,
    "text": "Including it minimizing free energy right to the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1386.876,
    "end": 1389.64,
    "text": "So there's kind of a few other aspects but but um.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1391.223,
    "end": 1414.885,
    "text": " yeah and related to as Ali mentioned earlier like conditioning on a thing existing by by choosing that kind of boundary of framework then there's questions that aren't being addressed and ones that are but yeah right so just to clarify my original question um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1416.637,
    "end": 1424.448,
    "text": " So definitely we in order to be able to apply any of this of these ideas, we take for granted.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1424.488,
    "end": 1435.624,
    "text": "We take as as assumed the existence of Markov blanket, which is what gives our definition of a thing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1435.604,
    "end": 1459.35,
    "text": " my question is about uh so already assuming that a thing exists and it has its its boundary uh internally it is representing is encoding some uh model of the generative process that's going on outside uh in the world and it's um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1459.33,
    "end": 1469.761,
    "text": " uses perception and action to make sure that that model is as consistent as possible with its observations in the world.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1470.582,
    "end": 1474.546,
    "text": "So my question is about what's inside that generative model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1476.428,
    "end": 1483.735,
    "text": "For example, in the case of a POMDP, which is one way of representing",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1483.934,
    "end": 1490.803,
    "text": " a discrete time generative model, there's some structure to what that POMDP looks like.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1491.063,
    "end": 1493.266,
    "text": "The way that we write it down and what are the parameters.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1494.127,
    "end": 1509.026,
    "text": "And I need to become more familiar with the actual degrees of freedom, so to speak, the different things that you can add or take away to construct different varieties of a model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1509.246,
    "end": 1513.131,
    "text": "But let's just take that POMDP.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1513.111,
    "end": 1519.793,
    "text": " Christopher McConkey- category as an example, and the way that I am thinking about it right now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1519.833,
    "end": 1523.104,
    "text": "What what you have is, as you're",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1523.455,
    "end": 1536.013,
    "text": " incorporating this this generative model, you have some parameters, and over time you update the parameters of the perception.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1536.033,
    "end": 1544.485,
    "text": "You update the parameters of that dinner model to be more consistent to reduce your free energy to minimize your free energy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1544.465,
    "end": 1573.527,
    "text": " but my question is about the structure of that generative model, not just the parameters, but, for example, if it's a Bayesian network that is describing the causal links between some hidden variables, some causes, causes in the world and the observations that you're receiving,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1574.182,
    "end": 1576.445,
    "text": " that Bayesian network has some structure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1576.466,
    "end": 1578.869,
    "text": "There are different nodes and connections between that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1579.731,
    "end": 1586.641,
    "text": "And somehow you have to figure out what should that network look like?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1587.643,
    "end": 1589.466,
    "text": "What should the connections between nodes be?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1589.486,
    "end": 1591.409,
    "text": "And what should each node represent?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1592.691,
    "end": 1602.045,
    "text": "And so I'm wondering if within the context of active inference, there is",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1603.291,
    "end": 1615.623,
    "text": " there's a procedure there's procedure for exploring that structure or for given a thing that already exists, how does it the its general model evolve, not only in terms of its parameters.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1617.024,
    "end": 1617.604,
    "text": "But more.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1621.588,
    "end": 1632.218,
    "text": "Generally, in terms of its structure, maybe this is related to the idea of hierarchical models which I haven't learned much about yet but.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1632.856,
    "end": 1662.863,
    "text": " yeah maybe i hope that to clarify a bit more of my question yeah two short answers first there's structure learning that is the whole question of modeling and but that's what the question of modeling is that's why it's just not done just by thinking about it because you have to fit the base graph to be capturing whatever factors you're modeling but also this paper and some other ones in that area approach the structure learning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1664.969,
    "end": 1677.964,
    "text": " And also in live stream 54 with the learning structure versus structure learning discussion that Toby uses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1681.749,
    "end": 1682.089,
    "text": "Excellent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1682.109,
    "end": 1682.49,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1682.95,
    "end": 1684.212,
    "text": "Did you link these somewhere?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1684.232,
    "end": 1685.934,
    "text": "Oh, yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1686.034,
    "end": 1687.956,
    "text": "Just in where the notes are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1688.999,
    "end": 1715.985,
    "text": " notes for chapter four four thank you so much yeah all right any other like thoughts on four or some section that some one found interesting if no one else has a question about four i have a question about",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1716.185,
    "end": 1743.019,
    "text": " uh inference algorithms but but I want to give everyone a chance to to answer questions does anyone have like any overall thought on four yeah okay Andrew",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1744.282,
    "end": 1744.682,
    "text": " Sure.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1744.822,
    "end": 1749.126,
    "text": "I was still kind of reflecting on the question earlier about message passing.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1749.967,
    "end": 1751.929,
    "text": "And I feel like I'm going to mix some things up here.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1751.989,
    "end": 1754.491,
    "text": "But so that's back on figure 4.4.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1754.651,
    "end": 1758.275,
    "text": "And I was just thinking about the question of counterfactuals.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1761.478,
    "end": 1774.069,
    "text": "Because, I mean, if an agent were to, and you'd have to, of course, like model them, you'd have to construct them in such a way that they were able to engage in planning.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1774.724,
    "end": 1784.414,
    "text": " Adrian Holovaty, Which I suppose would involve minimizing expected free energy G. Adrian Holovaty, So in that in that case, whenever one is engaging in.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1784.454,
    "end": 1788.838,
    "text": "Adrian Holovaty, You know, planning, we could model that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1789.459,
    "end": 1803.313,
    "text": "Adrian Holovaty, Then I guess is someone I mean they'd be comparing counterfactual in that case right they'd be comparing different potential policies that they have not already engaged in or.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1804.07,
    "end": 1825.2,
    "text": " potentially are already underway um in some way but like you know maybe you're so far along the way in your series sequence of actions associated with a particular policy or you haven't started it yet and then from there the idea is you would go with the policy that has the highest",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1827.34,
    "end": 1840.605,
    "text": " Michael Prast- Probability is it right you'd basically you'd go with the policy that minimizes expected free energy, which would also like whenever we look at that in terms of a distribution over policies and be the policy that has the highest.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1840.846,
    "end": 1845.855,
    "text": "Michael Prast- probability which you end up necessarily going for.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1846.274,
    "end": 1873.665,
    "text": " i'm just trying to because i'm slowly learning how important it is to specify when you're modeling like all these factors and things can get a little blurry whenever we start speaking a little bit more philosophically or from real life experience i'm just i don't know if all of that made sense right but uh just throwing that out there just a quick uh clarification",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1874.658,
    "end": 1894.236,
    "text": " question uh you brought up counterfactuals in relation to action planning and then daniel wrote down here planning considering future time steps is all counterfactual uh what that brings to my mind is that the way that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1894.604,
    "end": 1919.194,
    "text": " um we're thinking about inference sorry planning inactive references uh imagining the outcomes of different policies uh and rolling those out into the future and then computing the expected free energy over those rollouts for each policy um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1919.663,
    "end": 1929.521,
    "text": " And then you kind of score the different policies according to their expected free energy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1929.601,
    "end": 1941.283,
    "text": "And this kind of gives you a distribution over which policy you expect to take or which policy you believe",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1941.263,
    "end": 1966.36,
    "text": " you're you're going to take um but but it seems like you you maybe like you sample from that distribution so it's not like you you just uh take the um the policy with with the the lowest expected free energy if that's not true please someone uh dispel that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1967.386,
    "end": 1995.216,
    "text": " yeah right yeah all planning is that's one kind of counterfactual counterfactual just being um considering something that is not a factual like observable so anything about the future time steps is counterfactual um or like alternative pasts but then considering the future it's all counterfactuals and then this is also kind of from figure 5.4",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1995.989,
    "end": 2011.126,
    "text": " this is that section of taking in habit and then either passing habit through the policy prior or updating it according to expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2013.389,
    "end": 2022.84,
    "text": "But whether habit is passed through or there's an update, then the most likely path",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2023.478,
    "end": 2050.212,
    "text": " results or that distribution is sampled from yeah Jesse these are two yeah these are two possible selection methods either maximum posterior or sampling those are two methods of policy selection given a policy posterior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2054.039,
    "end": 2078.494,
    "text": " i guess for me uh what i'm attempting to do is i mean because quite frankly it's all a little bit over my head but um trying to pull this back from like a lot of this conversation you know we're we're trying to apply this to conscious processes which i think makes it a little bit more difficult in some respects because there's so much you know",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2079.082,
    "end": 2099.605,
    "text": " it's philosophical baggage um and so in the last section of this chapter even though I don't really understand the uh application of like a little um no I'm sorry it wasn't the Laplacian uh approximate yeah the Laplace approximation uh on same motor reflexes and trying to think about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2099.922,
    "end": 2126.132,
    "text": " this like even thinking about the the message passing framework uh in a purely physiological paradigm where the message passing is say you know the sensory response from the you know the doctor hits your you know under your knee with a little rubber hammer and either you're going to have a reflex response or you're not",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2126.635,
    "end": 2156.271,
    "text": " And so in that respect, if I try to look at the counterfactuals or the policies, not as some conscious process, but as a purely physiological one, it just kind of, I think for me, makes it a little bit, and maybe I'm on the wrong path and just misunderstanding it, but for me, it's just making it a little bit",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2157.061,
    "end": 2185.92,
    "text": " more simplistic, I guess, to deal with all the symbolisms and the idea of gradients and the idea of, it's not like we're consciously always doing this and undergoing the statistical process, but this is essentially a way of understanding the probability that given certain factors and parameters, your knee gets hit with a little rubber hammer and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2186.373,
    "end": 2188.657,
    "text": " you kick or you don't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2188.677,
    "end": 2194.205,
    "text": "So I guess I just wanted to kind of throw that out there for possible direction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2195.567,
    "end": 2214.777,
    "text": "Yeah, I mean, it's very true and relevant that that not not everything maps or just people may have wildly different maps of what features or psychological experiences they mapped like different intuitions about these concepts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2216.022,
    "end": 2217.324,
    "text": " So it's a huge space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2219.167,
    "end": 2220.749,
    "text": "Andrew, then Ra.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2225.156,
    "end": 2228.0,
    "text": "I don't want to be redundant.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2228.04,
    "end": 2234.79,
    "text": "Daniel pretty much summed up my point, but it's, yeah, I think it's more about just thinking about it as far as like,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2235.344,
    "end": 2238.912,
    "text": " like take the perspective of someone who's modeling.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2239.854,
    "end": 2255.648,
    "text": "Think of like, you could produce a model of like a person or some other phenomena, whatever agent you're looking at, and you could include planning as like an entire sort of dimension, so to speak, or layer to,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2255.628,
    "end": 2280.606,
    "text": " your model but that could just entirely be foregone i imagine most people who are trying to model you know uh reflex arcs and looking at yeah the movement of joints in response to you know the pressure at this particular spot probably from an active inference approach i imagine would not include planning in the modeling process meanwhile of course if you're trying to model",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2280.586,
    "end": 2285.774,
    "text": " someone thinking and consciousness or however close you want to come to that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2285.854,
    "end": 2290.361,
    "text": "I think last week we discussed the neuro phenomenology paper.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2290.421,
    "end": 2298.814,
    "text": "I could drop a link to that again, but like that kind of modeling, certainly you could include planning as a dimension.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2298.794,
    "end": 2318.294,
    "text": " And I bring this up again because it's just that's what I'm slowly learning with active inference is like, while I enjoy the philosophical discussion, I think it's super important to just think about like from a modeler's perspective, even though that kind of like can remove some of the magic of of the process.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2318.354,
    "end": 2324.56,
    "text": "But it's it's you choose what you're going to include or not include in the model, I suppose.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2324.58,
    "end": 2324.7,
    "text": "Right.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2324.68,
    "end": 2338.791,
    "text": " um i think i i just hope that that clarifies anything it was clarifying to me to start to understand yeah just to connect to um thomas parr's guest stream",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2339.378,
    "end": 2368.727,
    "text": " um and like a little bit of the development of different generative models because chapter four is where the generative models being described seven and eight will go into more detail into the discrete and the continuous time but chapter four is kind of like just considering generative models um generally so the early implementations were in continuous time then people were thinking about how to get sequential Dynamics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2370.023,
    "end": 2385.163,
    "text": " that's discussed in this textbook with these predator prey type models so that is like where there was repetitive cursive writing so it was doing like repetitive structures",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2386.021,
    "end": 2409.497,
    "text": " but it was in a continuous state space of time um then they started going more into the explicit planning explicit like the pomdps kind of tied back to the earlier discussions that we had so um and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2411.114,
    "end": 2434.843,
    "text": " later um the continuous models were used at the more like sensory motor layer and then the discrete state space models at higher levels of decision making just want to make that point thomas explains more but yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2438.418,
    "end": 2441.161,
    "text": " Any other thoughts on 4?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2447.107,
    "end": 2451.191,
    "text": "Yeah, I'd like to chime in just a bit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2452.832,
    "end": 2464.824,
    "text": "So I think it's worth noting that this whole active inference is still very much in its infancy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2464.864,
    "end": 2466.906,
    "text": "And",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2467.223,
    "end": 2468.685,
    "text": " you know, there's a lot to work out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2469.225,
    "end": 2480.097,
    "text": "I mean, you know, when we talk about, um, and you know, to Jesse's point is that, you know, there, there is no authority here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2480.117,
    "end": 2484.422,
    "text": "I mean, we're talking about how humans model their lives.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2485.923,
    "end": 2496.775,
    "text": "And so, um, yeah, the assumptions that not only the modeler has, but I'll say the person has is going to, um, you know, bear",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2496.957,
    "end": 2512.198,
    "text": " on the counterfactuals and so you know to produce a model of a person you know we can't really discount the fact that what they're perceiving is not reality so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2515.233,
    "end": 2517.155,
    "text": " I hear a lot of assumptions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2518.037,
    "end": 2539.884,
    "text": "So I question these assumptions, and maybe it's because I'm coming out of worldly mapping, but there's just a lot of assumptions that bring up questions for me as to the accuracy, which is the intent of the whole project is to become more accurate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2543.769,
    "end": 2544.75,
    "text": "Thank you, Susan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2546.536,
    "end": 2571.649,
    "text": " one approach there because I I really agree with with a lot of what you raised um by using similar terms and just being clear about what terms we're using then some expressions can be evaluated and then and just sort of like very carefully understood",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2574.464,
    "end": 2578.028,
    "text": " And then different people may still make different claims about the same topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2578.769,
    "end": 2581.612,
    "text": "Certainly, that's what discourse is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2585.316,
    "end": 2604.437,
    "text": "Right, that's a very interesting aspect of this cohort and the Institute more broadly, which is, as I mentioned, Susan, this is a very stair of the art, a young kind of project.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2604.923,
    "end": 2624.755,
    "text": " um and the institute is part of the group of people who like everyone here and i'm just trying to understand the framework is participating in developing it and carrying it forward but also something that i know that the institute is really um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2625.207,
    "end": 2637.36,
    "text": " working on and keeping in mind is how to optimize this process of doing the science of thinking about the ideas collectively.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2638.381,
    "end": 2649.493,
    "text": "And as Daniel just mentioned, part of that is to the extent that we engage with each other more often and have these discussions together and use",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2650.739,
    "end": 2656.461,
    "text": " the most precise language that we can, the ontology and become more familiar with the ontology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2656.482,
    "end": 2659.433,
    "text": "Then we start to become kind of like,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2659.987,
    "end": 2661.669,
    "text": " almost an approximation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2662.569,
    "end": 2671.278,
    "text": "I have like a mathematical approach to thinking about it, because in math you have very clear definitions for everything that you're working with.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2672.038,
    "end": 2686.332,
    "text": "So this is very helpful that we're becoming more familiar with the concept and the terms and then using them in a shared way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2686.615,
    "end": 2692.063,
    "text": " where that hopefully makes sense to as many people as possible in every session.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2694.127,
    "end": 2704.843,
    "text": "But it's also really excellent to have people who are maybe less familiar with some of the technical details, because then you can stop",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2704.823,
    "end": 2725.988,
    "text": " uh others and say like hey that's um isn't completely clear to me or i'm thinking of it from this more intuitive perspective can you uh explain how my intuition lapses into your hands to the terms that you're using yeah thank you um andrew",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2728.82,
    "end": 2730.742,
    "text": " Yeah, quick follow on to that point.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2731.043,
    "end": 2737.37,
    "text": "I was hoping the ontology on our, what do you call it?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2737.45,
    "end": 2747.843,
    "text": "Our epistemological space had a lookup table for the equation symbology.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2748.904,
    "end": 2758.776,
    "text": "And I didn't find that, but it'd be really helpful if there was like words or something I could do for lookup cards",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2759.937,
    "end": 2771.517,
    "text": " to help embed that ontology built into the active inference textbooks equation into my brain.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2774.517,
    "end": 2775.778,
    "text": " It's a great idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2775.818,
    "end": 2777.72,
    "text": "Definitely something we've considered.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2777.78,
    "end": 2781.484,
    "text": "There's several steps that we know we'd have to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2781.545,
    "end": 2791.315,
    "text": "So like in our literature analysis from the end of 2022, we annotated the number of equations in each paper for several hundred papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2791.535,
    "end": 2793.497,
    "text": "Obviously, we have that information for textbooks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2793.517,
    "end": 2795.94,
    "text": "So determine where the equations are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2795.98,
    "end": 2802.567,
    "text": "Then, just like we have for some of the equations, but not all of them,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2802.547,
    "end": 2819.147,
    "text": " develop the natural language descriptions using the ontology terms, that natural language description would be including all of the terms that you need to include, make the mapping between the symbols and the ontology terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2820.449,
    "end": 2831.743,
    "text": "I mean, it's a project that the ontology will include and other features pending slash admitting people who want to do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2834.508,
    "end": 2835.57,
    "text": " Thanks for pointing that out.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2836.23,
    "end": 2837.292,
    "text": "Yeah, but it would be epic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2837.452,
    "end": 2844.062,
    "text": "And if you want a subpage or if you want a form to do it in, let's figure out how to do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2847.867,
    "end": 2848.548,
    "text": "Yeah, Susan?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2855.118,
    "end": 2861.347,
    "text": "So if I'm premature in asking this question, just say so and we move on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2861.387,
    "end": 2864.211,
    "text": "But before equations would",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2864.815,
    "end": 2885.605,
    "text": " become accurate, wouldn't it be a matter of pattern languages that would be more of a broad scope to be able to audit the equations by?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2889.15,
    "end": 2893.236,
    "text": "That's a very interesting question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2894.903,
    "end": 2918.278,
    "text": " yeah a lot of ways you could say it the equations are being evaluated according to kind of standard math so if we consider that as a pattern language like math is a pattern symbol set then and also the equations equations are usually trivially true",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2919.929,
    "end": 2948.923,
    "text": " because they're codifications of assumptions basically yeah they're manipulations of of what is brought in to the formalism right so then that has a certain epistemic status it's not nothing there are theoretical and mathematical findings that that are they are real findings but that that doesn't justify or or imply direct application to anything of anything",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2953.797,
    "end": 2955.339,
    "text": " Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2955.36,
    "end": 2955.74,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2960.888,
    "end": 2978.657,
    "text": "Yeah, like making it more like a living textbook with re-rendering equations with the natural language or making the variables compatible or using the computer variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2981.185,
    "end": 2996.612,
    "text": " of those could help a lot otherwise there's a lot of variability in which notation are used and to what extent notation is described like hopefully to a limited extent in a textbook",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2998.195,
    "end": 3013.236,
    "text": " But still there's a lot of notation in the textbook and it kind of like shifts among the chapters, just bringing in more variables, not necessarily like using one core set of variables, which would be hard to do, but that's not what they do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3018.323,
    "end": 3019.344,
    "text": "So one more question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3020.666,
    "end": 3023.73,
    "text": "Since we're at the top of the, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3024.335,
    "end": 3048.233,
    "text": " would it be premature to announce that we're we have a special guest that might challenge our assumptions on um physics Daniel I mean we'll we'll announce it when it's organized but yeah that sounds good",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3051.082,
    "end": 3058.898,
    "text": " anyone like have any thoughts on chapter four or like or what they want to ask about next week",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3104.947,
    "end": 3107.774,
    "text": " Anyone have any other thoughts on 4?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3108.597,
    "end": 3109.058,
    "text": "Yeah, Inks?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3112.326,
    "end": 3115.294,
    "text": "I just want to say I love this...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3115.831,
    "end": 3121.718,
    "text": " They're not equations, but the ones that look like waterfalls that go in different patterns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3121.998,
    "end": 3123.5,
    "text": "It's very inspiring to see them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3123.94,
    "end": 3126.403,
    "text": "And just to express gratitude for you guys.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3126.423,
    "end": 3128.586,
    "text": "You are saints to do this with us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3129.227,
    "end": 3138.377,
    "text": "To just sit here, Danielle, and try to figure out what the hell I mean when I say that and want to help us understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3138.658,
    "end": 3141.981,
    "text": "I don't know that you guys get enough appreciation and gratitude.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3142.162,
    "end": 3143.323,
    "text": "So just saying that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3146.105,
    "end": 3146.606,
    "text": " Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3148.428,
    "end": 3155.358,
    "text": "Yeah, it's awesome that people come out and care and it's interesting topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3155.378,
    "end": 3159.104,
    "text": "And even without even understanding only at this level of zoomed out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3161.147,
    "end": 3162.208,
    "text": "It still is pretty cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3169.94,
    "end": 3170.901,
    "text": "I want to second that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3171.161,
    "end": 3171.802,
    "text": "Thank you, Daniel.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3172.443,
    "end": 3173.665,
    "text": "Yeah, thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3175.012,
    "end": 3175.753,
    "text": " A hundred percent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3175.993,
    "end": 3176.834,
    "text": "It's amazing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3176.854,
    "end": 3177.355,
    "text": "All you guys.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3184.022,
    "end": 3184.263,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3184.463,
    "end": 3187.907,
    "text": "Everyone updating generative models, learning about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3190.049,
    "end": 3198.319,
    "text": "We can only do like the tiniest amount in the synchronous times, but you know, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3199.025,
    "end": 3200.289,
    "text": " Okay, cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3201.512,
    "end": 3205.083,
    "text": "See you all next time for part two on chapter four.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3206.286,
    "end": 3206.627,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3206.647,
    "end": 3207.49,
    "text": "Thanks, everyone.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3207.51,
    "end": 3209.134,
    "text": "Great to see you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3209.154,
    "end": 3209.355,
    "text": "Bye.",
    "speaker": "SPEAKER_04"
  }
]