[
  {
    "start": 6.516,
    "end": 7.977,
    "text": " All right, I think we are live.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8.677,
    "end": 13.239,
    "text": "Hello everyone and welcome to Team Calm Podcast 4.2.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 13.8,
    "end": 17.582,
    "text": "This is an exciting day because we are testing out new technology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 18.222,
    "end": 20.663,
    "text": "And so thanks to all of our participants.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 21.263,
    "end": 24.325,
    "text": "We hope this works for all of you listening and in attendance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 25.846,
    "end": 26.926,
    "text": "Let's go to the slides.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 27.967,
    "end": 29.648,
    "text": "Welcome to Team Calm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 30.488,
    "end": 35.951,
    "text": "Team Calm is an experiment in online team communication and learning related to active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 37.608,
    "end": 40.671,
    "text": " You can find us on Twitter at our Inference Active Handle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 40.891,
    "end": 44.014,
    "text": "You can email us at activeinference at gmail.com.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 44.475,
    "end": 47.858,
    "text": "Find us at our public Keybase team or watch us on YouTube.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 48.639,
    "end": 54.364,
    "text": "This is a recorded and archived live stream, so please provide us with feedback so we can improve on our work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 55.385,
    "end": 57.788,
    "text": " All backgrounds and perspectives are welcome here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 57.928,
    "end": 61.532,
    "text": "We welcome all questions that can help people understand active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 62.313,
    "end": 66.558,
    "text": "And as far as basic video etiquette, please mute if it's noisy in your background.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 66.698,
    "end": 70.963,
    "text": "Feel free to use the raise hand feature in Jitsi so that we can make sure to call on you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 72.13,
    "end": 76.971,
    "text": " We are here in Active Inference Stream 4.2, following up on 4.1.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 77.731,
    "end": 87.494,
    "text": "In 4.1, we discussed cultural affordances, scaffolding local worlds through shared intentionality and regimes of attention, a 2016 paper by Ramsted et al.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 88.234,
    "end": 91.475,
    "text": "Today, we're going to do a check-in and warm-up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 92.675,
    "end": 99.017,
    "text": "And last time we had a discussion of the figures- Daniel, sorry, we can't see slides by now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 100.854,
    "end": 126.472,
    "text": " yes okay good point i can see the slides on the live stream but uh they're not being shared in the jitsi so what i'm going to do and we're um hashtag doing it live i'm going to post the live stream link and if you'd like you could have the live stream muted in the background and just see what the slides are because it will just be rapidly um following so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 127.333,
    "end": 134.483,
    "text": " I'll continue on this first part and the link will be put into the Jitsi chat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 134.624,
    "end": 136.747,
    "text": "If you could just give me one second.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 137.368,
    "end": 139.851,
    "text": "How about something on active inference and multitasking?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 140.432,
    "end": 141.353,
    "text": "That's what I want to know about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 143.686,
    "end": 146.527,
    "text": " Last time we had an awesome discussion of the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 146.787,
    "end": 153.589,
    "text": "We went through the abstract, the claims and the aims of the work, and we also went through all the figures in pretty nice detail.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 154.189,
    "end": 164.772,
    "text": "This time we are going to have further discussion, which has been separated into a few different topics that none of the conversions have been prepared on beforehand, so it will be fun and improvisational.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 165.732,
    "end": 191.026,
    "text": " so let's start with the check-in and warm-up people can introduce themselves and their location if they'd like the first question is what is a local world that you live in any thoughts on local worlds it's a good question um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 195.734,
    "end": 200.037,
    "text": " I mean, I guess this says something about the way that we live.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 200.077,
    "end": 208.063,
    "text": "I mean, I live in Montreal and my local world, I live around the McGill area, so it's very studenty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 209.884,
    "end": 214.948,
    "text": "I guess I live in a world where people share progressive values.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 215.368,
    "end": 224.615,
    "text": "And I also get the feeling that there's something like a rift, where several of us are sharing the same geographical location.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 226.482,
    "end": 240.36,
    "text": " But don't necessarily live in the same world, per se, in the sense that things don't afford the same kinds of things that they do for other people living in another, as it were, world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 240.38,
    "end": 241.722,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 243.177,
    "end": 243.397,
    "text": " Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 243.877,
    "end": 248.941,
    "text": "The first thing I thought of was that local can be geospatial or it can be informational.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 249.261,
    "end": 253.744,
    "text": "One informational link away is just one video chat away, one phone call away.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 254.304,
    "end": 260.608,
    "text": "And what we're experiencing in a big way is that tension between our informational local worlds and our spatial ones.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 260.868,
    "end": 263.49,
    "text": "And that can lead to discordance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 264.851,
    "end": 266.172,
    "text": "Any other thoughts on this part?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 268.473,
    "end": 268.693,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 270.154,
    "end": 270.334,
    "text": "Maybe...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 272.142,
    "end": 283.07,
    "text": " In this term of local, maybe it's based on communications which happens most often with you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 283.411,
    "end": 291.817,
    "text": "Even in a global environment, but if you communicate each day with somebody, you are kind of local world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 292.864,
    "end": 293.124,
    "text": " Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 294.065,
    "end": 294.685,
    "text": "Second question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 295.125,
    "end": 297.427,
    "text": "What gives meaning to our local worlds?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 298.247,
    "end": 300.509,
    "text": "So this can be maybe a thought from the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 300.789,
    "end": 307.272,
    "text": "What did they propose gives meaning to local worlds or just experientially, what is it that gives meaning to your local world?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 313.436,
    "end": 313.856,
    "text": "Yes, Steven.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 313.876,
    "end": 317.899,
    "text": "Well, I think there's the geographical",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 319.218,
    "end": 322.541,
    "text": " like physical embeddedness of that world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 322.741,
    "end": 332.229,
    "text": "So how you actually, when I think of world, I kind of think very much of it in terms of the physical space, being part of the, of that whole piece.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 334.091,
    "end": 343.819,
    "text": "But then, like you say, how those things show up, then starts to become maybe more abstract or more inferred through other people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 346.912,
    "end": 357.46,
    "text": " Yep, and from a process perspective, as we'll get to later, it's the feedback loops that happen within ourself and amongst various people that provide semiotic meaning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 357.7,
    "end": 358.02,
    "text": "Sasha?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 360.382,
    "end": 374.933,
    "text": "Yeah, for some reason, I just thought of this phrase, like theory of place, kind of going along with theory of mind, that in this kind of local information environment, but maybe not...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 376.854,
    "end": 384.72,
    "text": " geospatially local, that the people that you're communicating with, you may or may not know where they're communicating from.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 385.24,
    "end": 396.629,
    "text": "And that could be helpful in your communication or not, because simply because we're all here on this live stream, we don't really need to know the exact location of each of the participants.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 398.09,
    "end": 403.774,
    "text": "But if I did know, it might add something to our communication or the narrative that we're building.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 405.816,
    "end": 408.358,
    "text": " to kind of know where we can all connect from.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 409.818,
    "end": 415.722,
    "text": "And then to follow up with the thinking through other minds idea, it's like thinking through other spaces.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 416.022,
    "end": 420.204,
    "text": "It's about putting yourself in someone else's shoes, understanding where they're coming from.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 420.624,
    "end": 425.627,
    "text": "These are embodied and spatial metaphors that we use, just like, can you grasp it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 425.727,
    "end": 427.108,
    "text": "Can you sketch out the idea?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 427.448,
    "end": 431.19,
    "text": "These are tactile ways to talk about abstract things like ideas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 431.65,
    "end": 439.572,
    "text": " And so you're literally putting yourself in someone else's shoes if you ask, what is the accessibility of this room going to be for somebody who's coming from a different place?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 440.212,
    "end": 442.792,
    "text": "And these are the important things to consider.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 443.252,
    "end": 447.893,
    "text": "And we'll return to this, I think, when we talk about the third space that exists in social interactions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 450.254,
    "end": 457.755,
    "text": "In terms of the paper cultural affordances, the proposal there is something like, well, what",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 458.496,
    "end": 464.213,
    "text": " What's at stake is something like a dialectic between affordances and expectations, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 465.725,
    "end": 481.638,
    "text": " What ends up shaping the worlds that we inhabit, which we're conceptualizing in terms of affordances, really are the shared expectations that we have with other people in our community.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 481.678,
    "end": 492.306,
    "text": "And by shared expectations, I mean something very broad to encompass the beliefs that we have about the shared world, but also the norms that are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 493.769,
    "end": 501.32,
    "text": " kind of structuring our appraisal and interaction with the world, as well as practices that might be ongoing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 501.74,
    "end": 505.005,
    "text": "And crucially, the shared physical environment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 505.869,
    "end": 513.231,
    "text": " that we have in common that in the case of humans comes to encode information about the way that we live.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 514.651,
    "end": 530.794,
    "text": "So, you know, think about the fact that in most cities, streets meet at right angles or, you know, the use of traffic signalization to kind of coordinate our patterns of movement throughout a city.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 531.955,
    "end": 534.195,
    "text": "I think what's at stake is really this dialectic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 535.765,
    "end": 535.965,
    "text": " Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 536.205,
    "end": 547.151,
    "text": "The ant colonies architecture is in feedback with their behavior and they're updated and generated by the very same process, which is niche construction or distributed cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 547.231,
    "end": 549.453,
    "text": "Different contexts are going to have different terms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 550.373,
    "end": 555.316,
    "text": "A final warmup question is what are you trying to get a grip on?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 555.636,
    "end": 562.48,
    "text": "And this is looking forward to talking about grip later on in this discussion, but what's just something that you're trying to get a grip on?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 562.64,
    "end": 564.461,
    "text": "I just thought it'd be a fun, random question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 571.013,
    "end": 592.77,
    "text": " One thing we were talking about just right before we started was trying to get a grip on some of these formalisms and understanding which formalisms in the free energy principle and in active inference are downstream of each other, which ones are necessary or sufficient for each other, and also what is the best way to on-ramp and to learn about them from various different perspectives.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 594.772,
    "end": 595.992,
    "text": "I was going to say exactly that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 596.012,
    "end": 599.115,
    "text": "I was going to talk about the reading group and the progress that we're making there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 600.741,
    "end": 602.984,
    "text": " What have you found interesting or liked about that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 604.206,
    "end": 612.939,
    "text": "Well, I mean, I didn't expect this to really turn into the rich discussion and exchange community that it's turned into.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 614.326,
    "end": 628.87,
    "text": " I mean, yeah, we're really coming to grips, I think, as a group with basically all the math and physics that goes into it, like really becoming familiar with all the moving parts and all the ingredients.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 628.93,
    "end": 631.131,
    "text": "It's been a really positive experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 631.151,
    "end": 635.272,
    "text": "So that's what we're, I guess I'm also trying to learn guitar a bit more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 635.292,
    "end": 637.813,
    "text": "That's another thing I'm coming to literally grips with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 638.153,
    "end": 640.993,
    "text": "Those are the two main things I'd say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 641.754,
    "end": 642.014,
    "text": "Nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 642.114,
    "end": 643.074,
    "text": "And Stephen, do you raise your hand?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 644.622,
    "end": 649.463,
    "text": " Yeah, like you were talking about this idea of putting yourself or getting in someone else's shoes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 650.424,
    "end": 659.506,
    "text": "So I'm trying to put myself or trying to understand to put myself in someone else's shoes in terms of understanding what I'm talking about, all this stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 659.666,
    "end": 662.387,
    "text": "And then I think the whole idea of like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 663.207,
    "end": 681.373,
    "text": " am I trying to understand in this dialectic with someone else where they are in relation to me or am I actually getting into their shoes in a place or in a field of practice or in some sort of stance in relation to some concepts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 681.613,
    "end": 684.194,
    "text": "So I think there's something kind of about actually",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 685.697,
    "end": 711.931,
    "text": " how we try and understand what it means in a meta level like you know because and how we move between them because we i tend to find that a lot of um the stuff like in anthropology and that it tends to have particular metaphors that we end up all having to follow from gold or whoever and that's particularly true in the arts it's all like it's all deluse and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 713.28,
    "end": 715.682,
    "text": " and then everything stay as metaphors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 716.162,
    "end": 722.408,
    "text": "So like how do you jump in and out of those different sort of shoes that people are in?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 722.908,
    "end": 724.85,
    "text": "I think that's really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 725.11,
    "end": 730.054,
    "text": "Yep, being specific with generalizations, being tangible with the abstraction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 730.194,
    "end": 732.436,
    "text": "Those are tensions that we work with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 732.796,
    "end": 735.539,
    "text": "And also one thought on local worlds and getting a grip.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 735.939,
    "end": 740.443,
    "text": "So once there's a grip on the object, it becomes part of your extended cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 740.623,
    "end": 741.624,
    "text": " You have the grip on the hammer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 741.764,
    "end": 742.524,
    "text": "You can hit the nail.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 742.585,
    "end": 747.308,
    "text": "But if you don't have a grip on the hammer, it's not part of your affordances to nail that in with a hammer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 747.729,
    "end": 752.973,
    "text": "Or if you're in someone else's shoes, the local world kind of becomes the foot-shoe container.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 753.573,
    "end": 759.518,
    "text": "And the local world is what gives meaning to that coupling between the foot and the shoe, between the hand and the hammer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 759.978,
    "end": 765.662,
    "text": "And so in just a spatial way, but perhaps also in an abstract way, the local world is...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 766.383,
    "end": 770.284,
    "text": " tying back to the affordance idea and upon that control idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 770.745,
    "end": 771.045,
    "text": "Sasha?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 776.647,
    "end": 777.227,
    "text": "Sasha muted.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 779.168,
    "end": 783.349,
    "text": "Yeah, just to add a little meta level comment on that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 784.87,
    "end": 793.373,
    "text": "The way that we communicate, it has to capture the content of what we're trying to communicate and then also",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 794.815,
    "end": 798.477,
    "text": " in a way that makes sense to the receiving party.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 799.078,
    "end": 812.046,
    "text": "But it's just funny, especially on this sort of podcast conversation style that we're trying to communicate with each other, but also in a way that is going to be understandable to a future audience.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 812.766,
    "end": 822.112,
    "text": "And so I think there's a few different levels of modulating our communication style and the kind of affordances that we have.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 823.564,
    "end": 830.281,
    "text": " Perfect transition to our first bucket of questions, which is feedback and affordances.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 830.962,
    "end": 831.844,
    "text": "So on this one,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 833.117,
    "end": 836.438,
    "text": " This slide has a picture of a termite nest.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 836.758,
    "end": 840.819,
    "text": "It also has a picture of some brain computer images.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 841.339,
    "end": 842.659,
    "text": "And there's a quote from the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 842.839,
    "end": 854.002,
    "text": "It reads, this multilevel embodiment of the generative model, as we shall argue below, extends to the concrete material human design milieus or designer environments in which humans operate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 854.602,
    "end": 858.824,
    "text": " Some generative models in this wide sense involve semantic content and others do not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 859.345,
    "end": 863.166,
    "text": "They involve something more minimal than satisfaction conditions, i.e.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 863.287,
    "end": 864.547,
    "text": "reliable co-variation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 865.248,
    "end": 873.672,
    "text": "So my question, which is pretty broad, was what does active inference tell us about niche construction in the physical sense or in the cultural sense?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 876.954,
    "end": 878.014,
    "text": "There's a lot to say there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 878.634,
    "end": 880.095,
    "text": "And there were many subsequent papers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 884.25,
    "end": 888.132,
    "text": " Well, I mean, if I can just make a few points to get us started.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 889.813,
    "end": 902.019,
    "text": "So Axel Constant and Jelle Breenenburg, I think, are the two first people to really start working on the niche construction aspect of Active Inference back in 2017 or so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 904.56,
    "end": 913.666,
    "text": " And so all this work rests on the fact that whenever we're talking about active inference, we're talking about a story that's symmetric in some deep sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 914.167,
    "end": 930.417,
    "text": "So active inference is a story about how organisms over the course of development and learning and through perception and processes like evolution become more like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 930.979,
    "end": 946.036,
    "text": " their ecological niche, which technically means that their statistical structure comes to recapitulate, in some sense, the structure of the environment in which the organisms that we're interested in exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 947.654,
    "end": 953.978,
    "text": " So for example, you can tell a lot about my environment just by looking at my physical body, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 954.158,
    "end": 958.701,
    "text": "So the fact that I'm wearing a parka tells you that summer's over in Canada, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 960.142,
    "end": 966.826,
    "text": "So there are these kind of predictive relations between the state of my phenotype and the expected state of the environment that kind of come together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 969.403,
    "end": 973.846,
    "text": " So the other side of active inference that's often emphasized is the active bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 974.286,
    "end": 983.973,
    "text": "So rather than making my beliefs more like the environment, I can make my environment more like my beliefs or conform to my preferred data distributions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 985.334,
    "end": 991.938,
    "text": "What was overlooked before 2017 is that from the point of view of the organism and environment, the story is symmetric.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 992.499,
    "end": 997.522,
    "text": "So when we're making the environment more like our preferred data distributions,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 998.064,
    "end": 1010.606,
    "text": " as an active inference, we're effectively changing the structure of the environment to make it more like our own structure, to make it like the structure of the preferences that we're encoding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1012.738,
    "end": 1024.325,
    "text": " And so I think a lot of the more interesting work done on culture recently in the active inference tradition draws on this niche construction stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1024.625,
    "end": 1031.67,
    "text": "I mean, at some point, the idea is you've only got so many layers of Cortex, and Cortex is metabolically expensive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1032.01,
    "end": 1039.395,
    "text": "So where are you going to keep optimizing after the sixth layer or whatever of increasingly meta...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1040.015,
    "end": 1043.078,
    "text": " increasingly centralized representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1043.118,
    "end": 1045.52,
    "text": "Well, one way to go is really just in the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1046.101,
    "end": 1061.735,
    "text": "So there's a sense in which really, like, coordinating amongst conspecifics, you know, like, or with a team member or whatever, is sort of like constructing a niche in another person, in a sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1061.755,
    "end": 1063.256,
    "text": "You're sort of like, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1063.78,
    "end": 1076.871,
    "text": " uploading into another person the sets of priors that will optimally allow you to interface together, which relates to some of the top top effects that we were discussing last week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1077.351,
    "end": 1089.762,
    "text": "So I mean, ultimately, the picture that I kind of draw for multiscale active inference is that you have two stacks, essentially, you've got a kind of vertical stack and a horizontal stack.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1090.672,
    "end": 1097.374,
    "text": " Uh, by vertical stack, I mean that all the systems that we're considering are nested systems of systems of systems, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1097.394,
    "end": 1104.217,
    "text": "So, uh, you know, our bodies are made of organs that are made of cells and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1104.877,
    "end": 1115.821,
    "text": "Um, or, you know, uh, the broader, uh, socioeconomic community in North America is made up of like, you know, more regional groups, like the U S Canada, Mexico,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1116.636,
    "end": 1121.577,
    "text": " which in turn are made up of, you know, so you've got these kind of nested structures going.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1122.938,
    "end": 1138.601,
    "text": "And the active inference story then can be used to, I think, make sense of the ways in which we structure the environment, especially humans.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1138.641,
    "end": 1145.343,
    "text": "This is especially the case for humans that we structure the environment in order to foster adaptive patterns of group behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1147.789,
    "end": 1149.34,
    "text": " Any other thoughts on that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1149.904,
    "end": 1150.649,
    "text": "And I can add as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1151.735,
    "end": 1153.716,
    "text": " Well, and raise your hand if so.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1153.916,
    "end": 1164.6,
    "text": "One part that I thought was really interesting, Maxwell, was this notion of like a deep symmetry, especially when the two interacting components of the system have very different affordances.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1165.081,
    "end": 1168.042,
    "text": "So I was thinking about winter, just like you brought up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1168.582,
    "end": 1173.084,
    "text": "We don't recapitulate snow or cold weathers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1173.424,
    "end": 1179.447,
    "text": "However, we do come to embody those regularities in the day and in the year with our weather.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1180.307,
    "end": 1196.526,
    "text": " first our thermoregulation as an organism and then with our behavior and with our extended phenotype with our buildings and with our air conditioners and so we do in a very deep sense come to embody those regularities and then the air conditioners change the climate",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1197.086,
    "end": 1208.95,
    "text": " in some sense, maybe a little, maybe a lot, maybe it's in a good direction, maybe it's in a bad direction, but there is a consequence of this coming to embody the regularities, and especially when the systems are very different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1209.21,
    "end": 1218.233,
    "text": "Maybe when you're doing a call and response, it looks symmetrical at the syntactic level, and it has this deep symmetry at the turn-taking level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1218.673,
    "end": 1226.216,
    "text": "And then with other systems where the turn-taking looks very different, it's still something symmetrical, but it's not quite symmetrical at the first pass.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1227.409,
    "end": 1227.609,
    "text": " Right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1227.649,
    "end": 1251.208,
    "text": "Well, so the, the, the idea was, I was trying to elaborate a bit earlier with this vertical and horizontal stack is touches precisely on this is that it's not just that organisms are stacked in this kind of vertical ways that you also have this kind of horizontal relationship between an organism, or an agent and its niche, the turnout to also be stacked in this kind of way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1251.609,
    "end": 1253.21,
    "text": "So it's not just that my cells",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1253.877,
    "end": 1263.406,
    "text": " make up organs that make up my body, for instance, it's that my body is a niche for my organs, and my organs are a niche for my cells.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1264.747,
    "end": 1276.938,
    "text": "And so when we're talking about niche construction, it's very much as Sasha was describing a few moments ago, it's that we're thinking through the environment that is populated by others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1276.978,
    "end": 1278.46,
    "text": "We're thinking through other worlds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1279.219,
    "end": 1281.38,
    "text": " By the way, I noticed that my camera is frozen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1281.541,
    "end": 1283.362,
    "text": "Ours is not, so you can reload.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1283.942,
    "end": 1301.052,
    "text": "One thought I'll give there on the primacy of the organism from a philosophy of biology or natural selection perspective is it was seen that the organism, or more specifically to some, the genes of the organism, are the only thing that make it through the Weissman barrier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1301.152,
    "end": 1306.276,
    "text": "The only thing that make it into the next generation is the information that encodes the organism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1307.216,
    "end": 1325.173,
    "text": " in one sense and so that says okay well the organism is the unit of analysis and things lower are subgroups yes the beta cells in the in the pancreas have a niche that's surrounded by other types of cells and yes the oocyte is supported by other kinds of cells but still the organism is the unit of selection and so that gives um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1325.954,
    "end": 1336.577,
    "text": " Some people reason to think that that is the default and that anything bigger than an organism is collective behavior, anything smaller than the organism is molecular physiology or some different field.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1336.957,
    "end": 1341.459,
    "text": "But some of the implications of taking this multi-scale proposal seriously",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1342.219,
    "end": 1350.082,
    "text": " are that we still get the richness of collective behavior, of lateral interactions within a level, as well as the hierarchical layering.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1350.602,
    "end": 1360.466,
    "text": "And that combination of hierarchical layering with lateral interactions goes by various names, including a heterarchical system from the social insect literature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1361.006,
    "end": 1369.589,
    "text": "And when we start thinking about things like the whole genome, like the genome encoding a developmental trajectory in relationship with an environment and a microbiome,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1371.377,
    "end": 1372.698,
    "text": " Pretty interesting stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1372.738,
    "end": 1375.661,
    "text": "And it leads to question what the unit of selection is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1375.841,
    "end": 1377.183,
    "text": "Is it the organism?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1377.723,
    "end": 1378.704,
    "text": "Is it the kin group?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1379.004,
    "end": 1381.006,
    "text": "Is it the kin group and the extended phenotype?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1381.166,
    "end": 1392.057,
    "text": "And one of the ways that we at least delay the question while deepening our understanding is by just observing and by modeling in the most integrative framework that we can imagine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1392.597,
    "end": 1394.779,
    "text": " And then many of these other things fall out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1394.879,
    "end": 1398.082,
    "text": "Many of the relationships between higher and lower levels fall out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1398.442,
    "end": 1406.609,
    "text": "But just because there's a relationship between a higher and a lower level spatially or laterally doesn't mean that one level or the other is the one where things are actually happening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1406.689,
    "end": 1408.311,
    "text": "It's actually happening across all the levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1410.112,
    "end": 1410.332,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1410.352,
    "end": 1410.592,
    "text": "Oh, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1410.673,
    "end": 1419.2,
    "text": "I mean, I think that there's a perspective that's being opened up here that really allows us to move beyond, you know, these kind of,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1420.009,
    "end": 1431.941,
    "text": " simplistic and empirically inadequate models like homo economicus, like this idea that what human beings are really doing at the end of the day is optimizing their individual expected utility",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1432.962,
    "end": 1434.803,
    "text": " when they're performing tasks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1435.184,
    "end": 1440.627,
    "text": "I mean, it turns out that humans act in a way that's deeply social.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1440.687,
    "end": 1446.13,
    "text": "We evince a fairness psychology, not Nash equilibrium type.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1446.41,
    "end": 1452.474,
    "text": "So there's some interesting work in comparative mythology that puts chimpanzees against humans in a variety of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1453.655,
    "end": 1456.378,
    "text": " economic tasks, like the ultimatum game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1457.839,
    "end": 1463.704,
    "text": "And yeah, it turns out that humans just don't operate according to the principles of classical economics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1463.925,
    "end": 1466.487,
    "text": "We don't zero in on Nash equilibria.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1466.887,
    "end": 1471.672,
    "text": "It turns out that classical economics is actually pretty good at predicting the behavior of chimps, though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1473.29,
    "end": 1486.823,
    "text": " And so it's probably the case that humans in particular are subject to forms of social and cultural selection, like forms of, let's use the word, it's group selection, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1487.503,
    "end": 1495.651,
    "text": "And this might have been spooky and hard to explain a while back, but with the nested Markov blanket formalism, I think we're finally getting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1496.311,
    "end": 1507.477,
    "text": " to a point where we can talk about group selection in a way that's not just slippery and in a way that doesn't reduce everything being selected to, as you're saying, Dan, to the genes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1507.577,
    "end": 1508.597,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1509.058,
    "end": 1510.158,
    "text": "Two quick points on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1510.258,
    "end": 1513.84,
    "text": "First, with the homo economicus, it debases us twice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1514.36,
    "end": 1516.721,
    "text": "It says behavior is fundamentally economic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1517.162,
    "end": 1517.562,
    "text": "One strike.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1517.822,
    "end": 1519.263,
    "text": " And two, you're not even that good at it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1519.463,
    "end": 1524.707,
    "text": "You make errors or you have these cognitive biases that lead you to make false positive investments or false negative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1525.187,
    "end": 1532.572,
    "text": "Instead, we could just take a step back and observe how we see people interacting in a phylogenetic context, just like you were describing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1533.033,
    "end": 1534.834,
    "text": "And maybe that is how we are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1535.294,
    "end": 1540.495,
    "text": " Which is that we are pro-social and it's not an error correction on an error correction on a debasement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1540.855,
    "end": 1550.857,
    "text": "It's actually we can step into the richness of us as social creatures rather than thinking of sociality as being recovered after we've already paid off everybody.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1551.538,
    "end": 1557.039,
    "text": "And then also the question about group and kin selection and all these different levels of selection debate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1557.679,
    "end": 1567.727,
    "text": " First off, in the last several years through the work of Akasha and others, it has been described that some of these mathematical equations are actually formally identical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1568.188,
    "end": 1573.932,
    "text": "So there's an isomorphism and it's like you can model it different ways, but you're going to get to some of the same consequences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1575.593,
    "end": 1580.276,
    "text": " And we can think about the affordances of a single cellular bacteria, let's say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1580.576,
    "end": 1587.139,
    "text": "Now, a single cellular bacteria's niche may also involve metabolites from conspecifics and social interactions like quorum sensing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1588.26,
    "end": 1591.482,
    "text": "That's an example where the replicator is still the single bacteria.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1591.802,
    "end": 1594.163,
    "text": "However, there's collective behavior like quorum sensing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1594.523,
    "end": 1619.81,
    "text": " and then the major transitions in evolutionary individuality so like the prokaryote plus another uh something to make a eukaryote eukaryotes coming together to make multicellular organisms and multicellular insects becoming the eusocial organisms it's not based upon you know formica economicus it's not the ants making an economic trade-off it's that when their affordances change in the context of a niche",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1620.45,
    "end": 1628.132,
    "text": " you end up seeing an evolutionary trajectory that favors obligate cooperation at that scale.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1628.392,
    "end": 1628.832,
    "text": "Precisely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1629.092,
    "end": 1639.435,
    "text": "It sidesteps a lot of these, how would I feel if I were an ant who didn't get to reproduce type questions, which are really sidetracks relative to what is happening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1640.215,
    "end": 1640.456,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1640.596,
    "end": 1641.916,
    "text": "And, you know, I think, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1643.112,
    "end": 1645.893,
    "text": " it's doing a lot of damage if we're being real about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1646.033,
    "end": 1652.475,
    "text": "I mean, you know, these economic models are not just flawed theoretically and empirically inadequate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1653.035,
    "end": 1655.296,
    "text": "They're also driving investment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1656.836,
    "end": 1665.338,
    "text": "And, you know, the current state of the economy, I think, which is, you know, despite what you might hear from propaganda, like not so great right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1665.398,
    "end": 1666.539,
    "text": "I mean, it's...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1668.699,
    "end": 1676.002,
    "text": " I think in part it has to do with the flawed way in which we're understanding human economic behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1676.023,
    "end": 1681.985,
    "text": "What we really need to be doing is fostering a move towards value or affordance-based economies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1682.325,
    "end": 1693.971,
    "text": "Yeah, or instead of how can we give everybody enough US coin so that they can buy food, another way to phrase that is how could we reduce people's uncertainty about their next meal?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1694.491,
    "end": 1697.255,
    "text": " And maybe sometimes it looks this way, sometimes it looks that way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1697.556,
    "end": 1710.815,
    "text": "But if we were focused on reducing physiological surprise rather than as a proxy trying to increase some value on a spreadsheet, thinking that people would then just acquire the foods, it's an interesting idea if we",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1711.255,
    "end": 1731.909,
    "text": " pivoted from these reward-based framings of political or economic issues to uncertainty-based issues because it's often what you hear people needing help with is not knowing where the next place they're going to sleep or get their meal from not i don't have enough to get a meal i don't know where the meal is coming from so it's actually interestingly an uncertainty question even in that case oh yeah absolutely",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1732.469,
    "end": 1733.891,
    "text": " Here's our next slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1734.391,
    "end": 1750.149,
    "text": "Another quote from the paper is, we hypothesize that the central mechanisms whereby cultural affordances are acquired, especially conventional context involving affordances, consists in looping our feedback relations between shared intentionality",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1751.894,
    "end": 1762.286,
    "text": " And share attention in this light, one can view social norms and conventions as devices to reduce mutual uncertainty that is constantly with a free energy framework as entropy minimizing devices.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1763.107,
    "end": 1772.397,
    "text": "One must know what is in the minds of others, such as what one would see and how one would interpret another's action generally and context in order to make a successful inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1772.757,
    "end": 1780.161,
    "text": " both explicit content involving or implicit correlational inferences about other agents in each situation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1780.841,
    "end": 1784.623,
    "text": "So the question here was, how do narratives reduce uncertainty?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1784.944,
    "end": 1786.224,
    "text": "How does conversation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1788.666,
    "end": 1789.546,
    "text": "That's a great question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1791.307,
    "end": 1800.412,
    "text": "I mean, y'all did our paper on narratives a few weeks ago, so I'm sure you have some elements to answer that already.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1800.95,
    "end": 1807.434,
    "text": " But I mean, the fundamental idea, I think, is the... Also, I don't want to take up too much room.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1807.554,
    "end": 1813.177,
    "text": "If other people have more interesting things to say, please, by all means, jump in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1813.778,
    "end": 1821.943,
    "text": "But I think narratives do this in two main ways, following the two main senses of narrative that we've outlined, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1822.988,
    "end": 1828.473,
    "text": " By a narrative, you might understand some kind of internal cognitive shama, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1828.513,
    "end": 1831.376,
    "text": "So like when you tell the story of your life or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1832.177,
    "end": 1835.14,
    "text": "And like from that point of view, what narratives allow is for a kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1837.463,
    "end": 1845.265,
    "text": " a novel kind of useful re-representation of lived events that you've already undergone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1845.685,
    "end": 1852.966,
    "text": "So it's a way of kind of introducing new structure and meaning into the flow of events that have happened to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1854.727,
    "end": 1858.208,
    "text": "But by narrative, you might also mean a shared story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1859.368,
    "end": 1864.449,
    "text": "So literally a cultural artifact that is produced through a storytelling practice",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1865.533,
    "end": 1893.717,
    "text": " And from a niche construction point of view, these are shared elements of a common environment that we interact with and effectively internalize the structure of such that we're then able to redeploy the ideas, concepts, values, and so on that are present in the structure of that narrative to structure our social life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1894.659,
    "end": 1897.2,
    "text": " If I had to, in a nutshell, I think those are the two main functions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1898.04,
    "end": 1898.24,
    "text": "Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1898.62,
    "end": 1903.342,
    "text": "And please, anyone on Team Calm, raise your hand if you want to bring in the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1903.942,
    "end": 1914.286,
    "text": "The idea of that narrative as almost being embodied in our evolutionary priors reminds me of the hero's journey and the narrative structure of the hero's journey.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1914.346,
    "end": 1917.707,
    "text": "It's not about the hero tying and untying their shoes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1918.288,
    "end": 1921.729,
    "text": "It's about a story arc, which goes from A to Z.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1922.549,
    "end": 1924.229,
    "text": " And that does many things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1924.409,
    "end": 1936.112,
    "text": "It compresses the past into a distilled representation so that you don't need to remember every single detail of the past, but rather you can remember the action relevant sections of the past.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1936.492,
    "end": 1938.392,
    "text": "Like the bird told me something relevant.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1938.412,
    "end": 1940.473,
    "text": "You don't need to remember how many feathers were on the bird.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1940.753,
    "end": 1945.194,
    "text": "It's enough to know that in a certain space and time, you had an interaction where the bird",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1945.774,
    "end": 1973.893,
    "text": " told you go down this path not that one and then the symbolism as well and so words are symbols these are things we'll return to as well and so the narratives are like paths of symbols whether strings of words um or evocative uh patterns yeah stephen yeah and this also probably changes a bit in terms of how indigenous cultures work with story and legend and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1975.183,
    "end": 2003.065,
    "text": " animalism and unknowns in the environment which they were tuning to and the way that we've kind of codified our narratives these kind of grand narratives which rather than it being about the land which an indigenous culture tends to be about the land and timeless qualities that are unfolding you get this kind of you know you mentioned about the past as an entity that's in a timeline",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2003.786,
    "end": 2011.433,
    "text": " where we have a sense of self in the timeline, which is actually kind of a more modern way of thinking about things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2011.493,
    "end": 2030.369,
    "text": "So in some ways we've actually designed an understanding of how we fit into the world because our niche has changed in the way that, you know, you were talking about, because we've constructed our own way of understanding what our sort of human world is and attuned to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2031.169,
    "end": 2031.93,
    "text": "Now we're kind of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2032.898,
    "end": 2044.945,
    "text": " we're even redefining the way we see our history and the way we see narratives because narratives are these broader temporal depths which can stretch and then stories have become kind of commodified.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2045.085,
    "end": 2061.634,
    "text": "Whereas in indigenous culture, story and land and us are much more kind of in the present in this kind of enfolded kind of cycle that nature provides rather than say what our calendars",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2062.529,
    "end": 2063.891,
    "text": " or our watches provide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2064.832,
    "end": 2066.394,
    "text": "Yeah, two thoughts on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2066.635,
    "end": 2069.499,
    "text": "One is the distinction between chronos and kairos.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2069.879,
    "end": 2071.822,
    "text": "So the chronometer is the clock.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2072.102,
    "end": 2073.585,
    "text": "That's tick, tick, tick, tick, tick.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2073.845,
    "end": 2075.988,
    "text": "That's the regularities and the decimal system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2076.368,
    "end": 2077.69,
    "text": "And kairos means timeliness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2078.371,
    "end": 2081.074,
    "text": " And so it relates to dinner time versus 6 p.m.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2081.134,
    "end": 2082.375,
    "text": "Those are very different things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2082.736,
    "end": 2086.099,
    "text": "One is an exact time independent of an embodied experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2086.439,
    "end": 2090.023,
    "text": "And the other one is actually the experience independent of the clock time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2090.403,
    "end": 2091.805,
    "text": "So that's important.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2092.205,
    "end": 2100.394,
    "text": "And then also just to highlight the pragmatism of taking an action oriented approach or the active inference approach to thinking about our modern life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2101.415,
    "end": 2118.409,
    "text": " As Team Calm, we often find it helpful when beginning and closing a meeting like bookends to almost have narrative review, just restating syntactically, here's who's here, here's what we intend to get out of this interaction, or here are the goals of the meeting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2119.21,
    "end": 2126.633,
    "text": " In previous frameworks, like getting things done is technically an action-oriented framework, but not in the inactive embodied sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2126.754,
    "end": 2130.315,
    "text": "It's sort of in a productivity homo economicus framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2130.635,
    "end": 2138.059,
    "text": "And so you get convergent evolution of sometimes the recommendations like make a to-do list or restate the goals at the beginning of the meeting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2138.499,
    "end": 2142.621,
    "text": "But rather than thinking about these as simply tasks to be achieved,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2143.141,
    "end": 2149.384,
    "text": " it actually helps us realign at an increasingly fine scale with the work that needs to be done.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2150.224,
    "end": 2159.968,
    "text": "And that is a full stack alignment from the syntactic level, the details and the nitty gritty of the work that does need to get done up through the narrative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2160.028,
    "end": 2161.148,
    "text": "Where are we at this moment?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2161.248,
    "end": 2163.629,
    "text": "And what alphas does this project relate to?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2163.709,
    "end": 2168.271,
    "text": "That's from the systems engineering framework all the way up to the highest level, which is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2169.071,
    "end": 2170.213,
    "text": " What is our group doing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2170.313,
    "end": 2171.414,
    "text": "What is our company doing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2171.454,
    "end": 2173.197,
    "text": "What problems are we trying to solve?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2173.738,
    "end": 2179.686,
    "text": "And these ground floor or pet house level questions, depending on how you think about it, are foundational.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2180.106,
    "end": 2183.852,
    "text": "And we return again and again to these questions about what our purpose is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2184.372,
    "end": 2185.833,
    "text": " And that's man's search for meaning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2186.214,
    "end": 2187.635,
    "text": "That's the whole task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2187.935,
    "end": 2189.657,
    "text": "And that doesn't really end.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2190.077,
    "end": 2205.69,
    "text": "So by framing the problem, not just as a set of popping in tasks to the stack and then finishing them, we can think about this as this ongoing process of realignment of the details of our sensory states to our desired regularities that we want to see in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2206.871,
    "end": 2208.632,
    "text": "Any other thoughts on this slide?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2210.454,
    "end": 2210.614,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2212.375,
    "end": 2215.978,
    "text": " All right, so we are going to have a few embodied affordance questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2216.058,
    "end": 2217.399,
    "text": "So here's a quote from the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2217.859,
    "end": 2221.402,
    "text": "Sports science provides an illustration of this tendency towards optimal grip.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2221.982,
    "end": 2235.452,
    "text": "Studies of the dynamic interplay between a boxer's stance and position and the action possibilities available to them as a function of stance and position have shown that punching bags afford different kinds of strikes to boxers as a function of the distance between boxer and punching bag.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2236.112,
    "end": 2242.598,
    "text": " Boxers tend to move their bodies to an optimal distance from the punching bag, specifically one that affords the greatest variety of strikes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2242.798,
    "end": 2252.628,
    "text": "So not the most powerful, not the most rewarding, not the most unexpected to the other person in a theory of mind, but actually the greatest variety from an embodied perspective of the actor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2253.388,
    "end": 2255.65,
    "text": "This is a case of moving towards optimal grip.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2256.111,
    "end": 2258.493,
    "text": "So it's beyond the grasping.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2258.753,
    "end": 2259.934,
    "text": "Now we're talking about stance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2260.635,
    "end": 2266.54,
    "text": " When observing a painting, we also move our bodies and our gazes in a way that maximizes our grip on the scene or details observed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2266.98,
    "end": 2273.946,
    "text": "We might call such dynamic adaptive engagement with a field of affordances in rolling cycles of action, perception, skilled intentionality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2274.566,
    "end": 2277.969,
    "text": "So the question here is what is being optimized by the body?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2279.05,
    "end": 2280.331,
    "text": "What do bodies do?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2280.351,
    "end": 2285.215,
    "text": "That's a good question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2287.315,
    "end": 2295.597,
    "text": " There's probably a couple of answers and we can maybe go reveal half of the hint, which is how do predictions play into this optimization?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2296.157,
    "end": 2298.237,
    "text": "So what is the body optimizing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2299.797,
    "end": 2303.218,
    "text": "Doesn't need to be the end all be all answer, but what is something the body optimizes?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2303.318,
    "end": 2306.078,
    "text": "And then how do predictions play into this optimization?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2307.439,
    "end": 2314.78,
    "text": "Well, I mean, a lot of my own work has been about since writing this paper has been about figuring out exactly what this means.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2316.856,
    "end": 2325.838,
    "text": " But you know if if the free energy principle holds Then it's not just brains that are doing this free energy minimization business.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2326.338,
    "end": 2342.481,
    "text": "It's really every level of biological self-organization and there it really just means the same thing across all levels, which means that you know, you have a desired distribution over your data and You know actions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2343.866,
    "end": 2349.87,
    "text": " acting on the environment is generated such that this preferred data distribution is brought about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2349.97,
    "end": 2360.917,
    "text": "What changes at each scale is what the relevant data is, what the relevant set points are, and what the mechanisms are that bring about the preferred data distribution, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2360.937,
    "end": 2369.883,
    "text": "So from a cellular point of view, the Markov blanket of a cell is effectively its membrane,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2371.797,
    "end": 2387.448,
    "text": " where the sensory states are all the receptor surfaces of the cell and the active states are like the cytoskeleton and other mechanisms that allow the cell to move about and to effectively generate the patterns of data that it expects to encounter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2388.549,
    "end": 2396.595,
    "text": "But this very same story can be told at basically every level of, like I was saying, a biological self-organization where like from a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2397.213,
    "end": 2407.455,
    "text": " from an interoceptive point of view, what the body is doing is trying to keep some of its core homeostatic variables within viable ranges, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2407.495,
    "end": 2425.92,
    "text": "So, you know, core body temperature might be maintained using such a mechanism where when you register a deviation from 36 and a half degrees, you know, you might have like a kind of low level autonomic kind of reaction, you know, you'll start shivering and you'll get goosebumps and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2427.221,
    "end": 2436.208,
    "text": " But, you know, for animals like ourselves that have repertoires of cultural behavior, well, you might put on a parka, you might turn your air conditioning on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2436.228,
    "end": 2439.19,
    "text": "There are a bunch of other solutions to the same issue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2439.21,
    "end": 2442.713,
    "text": "I mean, I think this is really the strength of the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2442.733,
    "end": 2444.174,
    "text": "I alluded to this last week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2444.875,
    "end": 2455.443,
    "text": "At the time of writing this, I sort of had an idea how this would work, but it took the following four years of my life to really figure out what that entailed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2456.038,
    "end": 2460.6,
    "text": " you know, along with our collaborators, Carl Friston and everyone else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2461.801,
    "end": 2465.482,
    "text": "If I can add one point on this and to how the predictions play into the optimization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2465.902,
    "end": 2481.709,
    "text": "So there's the classical control theory thermostat, temperature drops, and then the body can engage in the interoceptive affordances like uncoupling in the mitochondria or shivering or the behavioral and the cultural affordances like wearing a jacket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2481.989,
    "end": 2485.251,
    "text": "But how about if you were planning a trip to somewhere that was cold?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2485.751,
    "end": 2490.214,
    "text": " So there's nothing in your local environment that's telling you that your temperature is dropping.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2490.314,
    "end": 2494.196,
    "text": "In fact, you could be in Arizona sweating, but you're packing for somewhere that's cold.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2494.716,
    "end": 2498.819,
    "text": "And so traditional theories of semiotics might be challenged by that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2499.079,
    "end": 2509.085,
    "text": "They could say, well, you saw the cold city and you looked at the website and so you made some sort of connection and you keep on doing this back propagation of symbols, which is a valid account.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2509.625,
    "end": 2514.891,
    "text": " But also we can think about what the body's doing is optimizing its thermal range.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2514.931,
    "end": 2519.255,
    "text": "It's minimizing surprise about excursions from its thermal range that's tolerable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2519.876,
    "end": 2523.119,
    "text": "And then it's acting based upon its prediction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2523.74,
    "end": 2531.828,
    "text": "And so similarly, there's substances or states where your body's prediction, it's now cast prediction or its future prediction can be wrong.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2532.409,
    "end": 2537.431,
    "text": " And so you can have people who are shivering even though their body temperature is high in the case of the flu or something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2537.912,
    "end": 2544.135,
    "text": "So it's really the interaction of the prediction and the affordances, not necessarily the instantaneous.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2544.375,
    "end": 2546.796,
    "text": "However, the instantaneous is often the most at hand.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2547.476,
    "end": 2547.736,
    "text": "Sasha?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2553.119,
    "end": 2557.141,
    "text": "This is quite funny, but this metaphor reminded me of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2559.537,
    "end": 2586.598,
    "text": " just kind of the stereotypical, like when you go out, your mother tells you to bring a jacket and that's because like the older caretaker role thinks farther ahead into future states and the younger child role, they're just thinking about right now or where they're going and they're not thinking to this possible future state.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2586.658,
    "end": 2587.859,
    "text": "They're not planning for that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2589.875,
    "end": 2590.515,
    "text": " possibility.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2590.555,
    "end": 2603.283,
    "text": "So I just thought that was a nice parallel to this whole jacket thermoregulation, how far ahead we're willing to plan to reduce variability or uncertainty in our environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2603.723,
    "end": 2608.946,
    "text": "And differences potentially in risk tolerance to even say, I know it's going to be cold, mom.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2609.026,
    "end": 2613.169,
    "text": "I just don't want to risk losing my jacket or I want to be cold or something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2613.189,
    "end": 2615.19,
    "text": "I don't want to listen to you because whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2616.21,
    "end": 2618.972,
    "text": "Sasha, I think you're putting your finger on precisely",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2619.474,
    "end": 2630.113,
    "text": " like the core kind of political economic issue that we're dealing with as a species right now, which is that the problems that we're dealing with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2630.862,
    "end": 2643.635,
    "text": " are occurring at a scale that is more or less invisible to the generative models that we've evolved in our heads effectively, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2643.675,
    "end": 2652.044,
    "text": "So climate change, global warming, these are processes that unfold over decades.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2653.77,
    "end": 2667.605,
    "text": " And that require large scale responses, you know, probably to address this, you know, in any way decently, like a kind of multinational coordinated response.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2669.431,
    "end": 2682.603,
    "text": " But our brains are meant to deal with phenomena spanning from a few seconds to maybe a year in more traditional societies when you're dealing with the season cycle and everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2684.105,
    "end": 2685.666,
    "text": "And so there's a huge gap there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2686.527,
    "end": 2690.931,
    "text": "And I think the disconnect between the kind of scientific consensus",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2691.811,
    "end": 2701.139,
    "text": " And, you know, at least in the U.S., the kind of lay consensus on, say, climate change has to do with the difference in temporal depth of the models that we're looking at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2701.179,
    "end": 2715.572,
    "text": "So as scientists, we deal with these like, you know, models that in the case of like astrophysics allows us to increase by like, you know, orders and orders of magnitude for like the scope of our predictions and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2715.592,
    "end": 2717.013,
    "text": "But then there's this gap.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2718.427,
    "end": 2723.071,
    "text": " you know, between our intuitive understanding of the world and physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2723.551,
    "end": 2730.036,
    "text": "And this also connects back to the world that we live in, you know, what kind of world we share ultimately.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2730.056,
    "end": 2734.38,
    "text": "Yeah, so all of that stuff, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2734.74,
    "end": 2735.721,
    "text": "Yes, nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2736.341,
    "end": 2736.662,
    "text": "Stephen?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2738.703,
    "end": 2741.165,
    "text": "Yeah, I think I agree with what's being said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2741.225,
    "end": 2747.811,
    "text": "And we've got into this world at the moment where we're very focused on what we want and how we can achieve that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2748.82,
    "end": 2774.44,
    "text": " um but in our bodies might be when we're putting on the coat or something we're meeting our needs as an organism for the heat and in complex adaptive systems for development they're looking at like need want and love to have happen and like the want is what we might you know and we tend to focus on this instrumental want but that can change",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2775.532,
    "end": 2797.529,
    "text": " within like this construct but our bodies we tune into this kind of deeper feeling of what we need like we can infer that and connect to that and i think that is um that's partly what active influence sort of helps us go back to okay when we're starting to sit into that because indigenous cultures look at that thing of seven generations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2798.542,
    "end": 2803.784,
    "text": " And it's not like they plan for seven generations, but they sense what's needed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2804.565,
    "end": 2809.727,
    "text": "So they're kind of working at that kind of, you know, organic level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2810.007,
    "end": 2817.79,
    "text": "One way also that the temporality becomes embodied in our language, inactive through language, is which words don't have plurals in English?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2818.11,
    "end": 2821.032,
    "text": "Now, this isn't like a hard and fast rule, but oil, fish...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2822.012,
    "end": 2822.292,
    "text": " Sheep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2822.652,
    "end": 2825.193,
    "text": "There's a lot of words where it's just like it's air.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2825.733,
    "end": 2826.713,
    "text": "It's just there's no airs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2826.894,
    "end": 2827.714,
    "text": "How many airs are here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2827.754,
    "end": 2828.894,
    "text": "It just air is around us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2829.414,
    "end": 2833.235,
    "text": "So implicitly, one shouldn't have to worry about depleting it, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2833.696,
    "end": 2835.776,
    "text": "Well, wrong, because of course you can overfish.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2836.276,
    "end": 2844.399,
    "text": "And so it really bridges us to asking about how could we construct our actions today so that it influences",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2845.259,
    "end": 2846.4,
    "text": " the way that we want the future to be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2847.08,
    "end": 2854.046,
    "text": "Just to complete this slide, the last question is, beyond physical grip, where does this idea of optimal grip apply?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2854.546,
    "end": 2867.576,
    "text": "And a really nice visualization was from Jelle Broomberg's and Eric Reitvohl's paper on self-organization, free energy minimization, and optimal grip on a field of affordances, which was cited in Ramsted's paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2868.297,
    "end": 2872.703,
    "text": " And so here we see three representations of fields of affordances.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2872.844,
    "end": 2874.906,
    "text": "So these are like blocks that you could pick up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2875.027,
    "end": 2878.632,
    "text": "They're blocks that you could sit on, maybe blocks that you could carve a sculpture out of.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2879.032,
    "end": 2881.275,
    "text": "They're things that you could do stuff with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2881.656,
    "end": 2883.719,
    "text": "And depending on the affordance, it's going to...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2884.64,
    "end": 2902.21,
    "text": " be a different one and the normal on the top in a we see that there's multiple different kinds of affordances of different types there's a bunch of yellow ones a bunch of red ones and a bunch of blue ones and maybe they have differential salience or they're adequate for different uses like a taller or a shorter person",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2903.226,
    "end": 2910.968,
    "text": " Then in B and C, we see two sort of hyperbolic and simplified, but still didactic representations of alternate states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2911.448,
    "end": 2917.99,
    "text": "So in B, which is depression, all of the field of affordances look less interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2918.37,
    "end": 2923.052,
    "text": "They all look relatively drab and sort of not fun.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2923.872,
    "end": 2948.506,
    "text": " and in ocd we see that there's a massive highlighting of one of these affordances at almost the expense of completely blocking the perception of all of these other affordances and so i find this to be a really helpful framework because it helps highlight the commonalities between for example different people who are in a depressed state or different representations of obsession on different topics it could be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2948.906,
    "end": 2972.904,
    "text": " rumination in thought it could be a specific motor behavior but when we think about it like this we can actually go from this representation backwards and say okay well could we change our perspective so that yes the red square is still really big but also we can see at least just for now just see these other affordances or could we make one of those gray boxes a little bit more exciting",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2973.504,
    "end": 2982.489,
    "text": " So I just like this as a representation and it shows that this grip concept and the affordance idea is really transferable to different areas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2982.629,
    "end": 2992.155,
    "text": "Greenberg, Eric Rubell, Julian K. Verstein don't necessarily get enough credit for this whole skilled intentionality framework that they've developed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2992.895,
    "end": 3000.739,
    "text": "I think it's some of the connective tissue that really allowed us to build the cultural affordances framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3002.688,
    "end": 3019.922,
    "text": " I really, really like the way that they connect the kind of inactive emphasis on, you know, action orientation and embodied kind of coping with an environment with the ecological psychology literature on affordances and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3020.843,
    "end": 3022.764,
    "text": "I mean, we were discussing this last week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3023.385,
    "end": 3031.932,
    "text": "Their use of affordance is also not, I think, consonant with the kind of classical Gibsonian sense of affordance where, you know...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3032.873,
    "end": 3042.22,
    "text": " And I mean, the common sense and use of affordance, I think, in academia, at least, also doesn't really resonate with what Gibson meant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3042.74,
    "end": 3061.173,
    "text": "Recall that what Gibson meant really was that all the information that an organism needs to interact with its environment is already available in its sensory array as it moves through its environment, such that an internal reconstruction of the environment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3061.733,
    "end": 3065.874,
    "text": " wasn't all that necessary because you could just directly interact with the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3065.894,
    "end": 3074.817,
    "text": "So a lot of these commitments are kind of falling out, especially in our use of the construct in the free energy principle framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3075.037,
    "end": 3086.201,
    "text": "We're explicitly reintroducing notions like inference, reconstructing the set of causes that led to the sensory stimulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3088.225,
    "end": 3102.748,
    "text": " I think some of the people who make the concept palatable and usable in things like sports sciences and so on are these people pushing the skill intentionality framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3103.229,
    "end": 3108.89,
    "text": "It's a very useful framework, especially, I don't know, Stephen, I'd be curious to hear what you think about this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3110.01,
    "end": 3122.325,
    "text": " As someone who's coming more at this from the practice end, I think the concepts there are more readily usable than some of the more formal stuff coming from active inference and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3122.405,
    "end": 3125.449,
    "text": "And yet it's all kind of part of the same conceptual framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3127.867,
    "end": 3129.209,
    "text": " Yeah, I agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3129.229,
    "end": 3139.781,
    "text": "I mean, this is where it gets complex because you've got quite a radical form of affordances being thought of, and intentionality, and you've got, obviously, the active inference complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3140.282,
    "end": 3143.226,
    "text": "But they talk about social practice theory,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3143.906,
    "end": 3149.389,
    "text": " in environmental science work now a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3149.809,
    "end": 3158.173,
    "text": "So they're trying to look at things through what's the social practices and the social norms that kind of align people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3158.193,
    "end": 3161.914,
    "text": "And I think it's the same kind of thing that you're talking about here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3162.755,
    "end": 3168.157,
    "text": "It gives an actual plausible mechanism so that it doesn't jump from like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3169.09,
    "end": 3190.94,
    "text": " this is what's happening in my body and then suddenly there's some theoretical framework which is somehow completely separate it's like okay it makes sense that i'm i'm enacting putting my coat on i'm enacting looking at this painting and trying to understand it i'm now enacting looking at this painting like i used to work in um in graphic reproduction so when you look",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3192.793,
    "end": 3212.387,
    "text": " you know, you're not looking at it as the painting anymore, you're looking at it for the colours in it, or is it going to reproduce, or I'm going to zoom in on it with Photoshop, so it's like the practice of engaging with the environment, and then like what's that fitted into if it's going to go into a publication, so what's the intentionality, what's the kind of scales of practices,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3214.801,
    "end": 3239.831,
    "text": " and i think that i think what you're saying makes sense i don't know if the two have quite managed to join up yet to make it fully practice ready because to try and explain it but i think what maybe that's where it just has to be used in practical applications in like an activity and maybe the people doing the activity don't need to know all the stuff that's going on behind the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3240.251,
    "end": 3243.494,
    "text": " under the hood, if that makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3243.614,
    "end": 3243.774,
    "text": "Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3244.595,
    "end": 3244.855,
    "text": "Nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3245.135,
    "end": 3249.618,
    "text": "Well, I want to come to some of the other ideas in our other sections.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3249.759,
    "end": 3253.121,
    "text": "So this is the section on ontologies and culture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3253.982,
    "end": 3263.909,
    "text": "So here are two nice representations, one of people working together all around the world and the other one of the skeleton that we all know and love, of active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3264.75,
    "end": 3268.372,
    "text": " The question is, how do ontologies relate to culture?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3268.992,
    "end": 3279.438,
    "text": "And then if a person wanted to address that question with a raised hand or the second question is, what kinds of tools are needed to work with ontologies and narratives?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3283.584,
    "end": 3290.51,
    "text": " So I'll start with one of language as an ontology scheme for the regularities and the objects that are around us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3290.99,
    "end": 3295.934,
    "text": "So it's one of the cliches that X culture has Y words for Z concept.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3296.014,
    "end": 3298.496,
    "text": "Oh, this culture has 22 ways to describe this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3298.936,
    "end": 3307.703,
    "text": "And of course you can always add adjectives to describe a variety of different kinds of snow or sand or whatever it is, but it becomes deeper",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3308.504,
    "end": 3330.875,
    "text": " through time and there becomes specialized words that really capture and can finesse as an as a handleable as a grippable concept different types of sand snow whatever happens to be trees and then can then be built into larger systems or sentences maxwell um yeah so i mean i i i think what you just said was very interesting um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3332.402,
    "end": 3337.386,
    "text": " I just want to clarify a bit what we meant by ontologies in this context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3338.087,
    "end": 3347.355,
    "text": "So, I mean, we're drawing on the ontological turn material that's coming out of anthropology in large part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3347.735,
    "end": 3348.996,
    "text": "Apologies to Steven.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3349.436,
    "end": 3351.338,
    "text": "Some of this material is Deleuzian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3351.358,
    "end": 3361.006,
    "text": "I mean, you know, I also tend to share your reservations about some of the stuff coming out of Deleuze and stuff, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3362.861,
    "end": 3373.867,
    "text": " So the ontological turn fundamentally is saying something like, well, what we should be doing is talking about the worlds in which people inhabit in the way that they inhabit it, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3373.947,
    "end": 3380.33,
    "text": "Rather than just saying what we have as scientists, as knowledge, and what other people have as mere belief.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3381.631,
    "end": 3390.776,
    "text": "What we should be doing is talking about like really the worlds in which people live and the ontologies or like the categories of types of being, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3391.405,
    "end": 3393.488,
    "text": " that people are kind of bringing on board.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3393.508,
    "end": 3406.165,
    "text": "I think we're at odds with some of the people in the ontological term, because we take a meta-Bayesian approach to this, which is to say, well, we all operate with beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3406.685,
    "end": 3411.489,
    "text": " The scientific worldview is also a set of beliefs that comes with its own ontology and whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3411.889,
    "end": 3423.279,
    "text": "So as long as it's an even playing field and that there's no kind of disparity between the respect that we're according to different kinds of knowledges, then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3423.949,
    "end": 3426.45,
    "text": " We're sort of all operating with our ontologies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3427.071,
    "end": 3436.115,
    "text": "And in the context here in this paper, what we mean more specifically is things like ontologies of persons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3437.176,
    "end": 3446.981,
    "text": "So for those of us in the American and particularly North American context, racism and colorism are major issues.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3447.681,
    "end": 3452.204,
    "text": "And it just is the case that young children even",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3453.177,
    "end": 3464.386,
    "text": " even children that hail from minority groups internalize the categories of personhood of the dominant political group, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3464.406,
    "end": 3481.08,
    "text": "So, you know, the well-known, you know, experiments on children suggesting that, you know, children from racialized communities tend to prefer dolls, for example, that look like white people or whatever over dolls that are consonant with their own kind of ethnic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3482.598,
    "end": 3502.075,
    "text": " uh you know outward appearance uh and so yeah well what we're talking about then is like the categories of p you know uh different kinds of people uh different kinds of places uh all of these kind of concepts and norms and frameworks that so all this is an ontology",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3502.975,
    "end": 3508.3,
    "text": " It's a way of cutting up your sensory stream, effectively, of parsing your phenomenology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3508.78,
    "end": 3514.164,
    "text": "And what we're suggesting is that this is acquired mainly through immersive participation and practices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3515.085,
    "end": 3523.412,
    "text": "So you don't have to be explicitly told, for example, the first time you go to a fancy restaurant not to jump up and down on the tables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3525.49,
    "end": 3552.943,
    "text": " humans are exquisitely sensitive to context and we're able to just dynamically extract the norms of the situation or at least most neurotypical humans are able to do this on the fly without instruction and so this is where the ontology stuff at least comes in in this paper yeah Alejandra yeah well actually I was thinking about this um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3553.669,
    "end": 3572.113,
    "text": " idea about the landscape affordances and the shared attention, and how this shared attention is determining which expectations will be encoded in this hierarchical predictive processing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3572.713,
    "end": 3578.234,
    "text": "So I was wondering, and also in terms of these ontologies related to culture,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3581.292,
    "end": 3582.573,
    "text": " about social networks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3583.053,
    "end": 3597.241,
    "text": "It's kind of weird, but yeah, it's like constantly in my mind, how these new ways of interacting are changing",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3598.514,
    "end": 3601.855,
    "text": " It's a kind of a massive joint attention.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3603.216,
    "end": 3615.279,
    "text": "I don't know how to say it, but yeah, like a massive joint attention, kind of extended culture that is manipulating us to what to attend.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3615.299,
    "end": 3623.301,
    "text": "So in some ways it's changing what we believe that is relevant",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3624.276,
    "end": 3633.618,
    "text": " and manipulating us, our attention and what to expect, but in a massive way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3634.479,
    "end": 3644.981,
    "text": "And I think we are not conscious about this, the effect that it's having on our beliefs.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3645.381,
    "end": 3652.423,
    "text": "And as you were saying, Maxwell, this racism and social,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3655.912,
    "end": 3674.406,
    "text": " I think that, I don't know if I'm explaining myself, but this massive joint attention is kind of affecting our grip, the way we grip with society in unexpected ways.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3674.826,
    "end": 3677.028,
    "text": "Yeah, that makes total sense to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3677.989,
    "end": 3680.51,
    "text": "I really think that this is like a really key issue",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3681.963,
    "end": 3693.366,
    "text": " I mean, you know, it's unfortunate, but, you know, prejudicial behavior, like hate crimes have been on the rise steadily since, you know, the Trump administration took power.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3694.287,
    "end": 3707.631,
    "text": "And, I mean, I think it speaks to the power of, you know, the power of the media effectively and of shared images and shared narratives, you know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3709.312,
    "end": 3719.494,
    "text": " I mean, personally, I think a lot of the issue comes from the fact that, you know, older generations weren't taught to be information skeptic, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3720.674,
    "end": 3729.916,
    "text": "So, I mean, you know, growing up now as a 30-something, when I was a kid and internet was, like, starting out, you know, what you learned was don't trust everything you read on the internet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3730.376,
    "end": 3738.137,
    "text": "So, I think one of the issues is that communities form around different",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3738.493,
    "end": 3741.394,
    "text": " types of epistemic standards effectively.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3743.915,
    "end": 3766.005,
    "text": "And I mean, if you sort of look at the split, the cultural split, the increasingly deepening kind of cultural split between more conservative and more liberal populations in the US, for example, I think what you see is really a split in modes of adequate justification",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3768.063,
    "end": 3779.109,
    "text": " So it's stunning to me how the same kind of fact base can lead to completely opposite interpretations in this kind of context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3779.369,
    "end": 3795.258,
    "text": "But unfortunately, the fact that you have these very hateful groups that now spread messages on a medium that then is shared",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3796.014,
    "end": 3807.69,
    "text": " I mean, it really takes the... Joseph Henrich puts this well in his great book, The Secret of Our Success.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3808.743,
    "end": 3831.273,
    "text": " He says, essentially, the same things that make us capable of incredible feats of coordination and that have allowed us to build large-scale cities and develop modern medicine, the same capacity for intense cooperation is also what makes us docile and what makes us crave totalitarian rulers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3832.574,
    "end": 3844.143,
    "text": " We just like to be very nice and agreeable, you know, and if everyone kind of decides that some group is going to be the scapegoat, well, you know, there's a tendency to go along with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3845.084,
    "end": 3857.494,
    "text": "And, you know, if our hypothesis is correct, and there's also a tendency to just acquire, unthinkingly download the kind of information that's presented to us in immersive contexts,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3857.975,
    "end": 3870.283,
    "text": " then it's not surprising that, you know, if these messages are spreading online, you know, in very highly immersive kind of tunnel vision things like YouTube channels that just, like, relink similar content.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3870.343,
    "end": 3876.967,
    "text": "I mean, like, yeah, I don't know if this is an entirely coherent message, but I do deeply resonate with what you were saying, Alejandro.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3877.007,
    "end": 3881.87,
    "text": "I think this is a huge set of issues that we need to address.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3882.99,
    "end": 3887.113,
    "text": "A lot of my own research for the next several years is going to be directed and precisely focused",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3887.89,
    "end": 3913.852,
    "text": " this direction uh like countering understanding and countering the spread of these narratives and like just modeling social dynamics using these tools more broadly yeah exactly sorry then just to add something um in terms of like your personal narrative your own story um how how is affected um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3915.659,
    "end": 3918.54,
    "text": " I can see it in adolescents or in child.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3919.3,
    "end": 3930.122,
    "text": "They are just expecting a like, and that's so meaningful to minimizing prediction error about yourself.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3930.182,
    "end": 3940.444,
    "text": "So it's like you have thousands or hundreds of people just paying attention about your picture.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3940.744,
    "end": 3943.245,
    "text": "And if you receive 10 likes,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3944.776,
    "end": 3955.301,
    "text": " or 100 likes what is like the way that the self is gripping to this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3955.521,
    "end": 3957.282,
    "text": "Oh, that's an interesting point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3957.302,
    "end": 3959.583,
    "text": "There's a weird kind of self-evidencing, I guess.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3959.843,
    "end": 3960.043,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3960.303,
    "end": 3964.425,
    "text": "It's very sad, but I guess that it's really tragic when you think about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3964.725,
    "end": 3970.187,
    "text": "Right, we off-sourced our sovereignty of attention to algorithms, and those are driven by exploit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3970.847,
    "end": 3972.468,
    "text": "And our sense of self-worth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3973.024,
    "end": 3998.77,
    "text": " right so there's from an active inference point of view likes and retweets and shares and whatever are evidence for your existence right for for for a model of you having worth in a social environment uh that's actually i think worth at least a paper if you want to write that up alejandra like send me a dm and we'll write that up as a paper it sounds it's a great idea um sasha",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4001.921,
    "end": 4008.042,
    "text": " Yeah, I just wanted to add onto that a comment about don't trust the internet.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4010.463,
    "end": 4015.124,
    "text": "I really like the phrase that you used, Alejandra, the massive joint attention.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4018.625,
    "end": 4025.446,
    "text": "And then it seems like social media is kind of able to bypass that filter of don't trust the internet, but",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4026.633,
    "end": 4027.514,
    "text": " these are my friends.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4027.854,
    "end": 4028.874,
    "text": "This isn't the internet.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4029.195,
    "end": 4043.663,
    "text": "These, um, the social network somehow is able to pass through that filter that this is a group of people that we trust or that we feel that we trust more than the internet as this, um, greater entity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4043.883,
    "end": 4046.465,
    "text": "Well, they don't call it antisocial media.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4046.705,
    "end": 4048.186,
    "text": "They don't call it physical distancing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4048.226,
    "end": 4049.367,
    "text": "They say social distance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4049.787,
    "end": 4055.711,
    "text": "These words really matter as far as slipping in the back door semantically with what, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4056.551,
    "end": 4059.633,
    "text": " is being communicated in the end.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4060.154,
    "end": 4061.054,
    "text": "So, yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4062.155,
    "end": 4068.28,
    "text": "To pick up on what Sasha was saying, I think the Internet's epistemic status is very much up in the air.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4068.3,
    "end": 4076.225,
    "text": "I think I'm always a bit naively optimistic, and so I like to think that people are critical about what they read on the Internet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4076.245,
    "end": 4084.972,
    "text": "But I think it was a joke somewhere, I forget who said it, but it's something like, when I was growing up, my mother told me, don't get into a car with strangers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4086.216,
    "end": 4095.546,
    "text": " And like now I literally summon strangers from my internet having mobile device to pick me up and to bring me places, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4096.587,
    "end": 4096.968,
    "text": "Like the,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4099.557,
    "end": 4106.523,
    "text": " I mean, as some of you are pointing out, it's sort of the connective tissue of a lot of relations, especially post-COVID.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4106.543,
    "end": 4109.746,
    "text": "A lot of my friendships, for example, have been pursued over the internet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4110.586,
    "end": 4112.388,
    "text": "So that's actually a very interesting point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4112.728,
    "end": 4117.172,
    "text": "Maybe the fact that this information is being presented through",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4117.876,
    "end": 4126.198,
    "text": " our friends that are sharing this information does tend to increase its precision for us and make it more salient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4126.218,
    "end": 4126.198,
    "text": "100%."
  },
  {
    "start": 4126.378,
    "end": 4131.459,
    "text": "It's why the word of mouth recommendation of a product is the highest form.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4131.539,
    "end": 4133.899,
    "text": "It's why influencers try to be personable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4133.979,
    "end": 4136.28,
    "text": "There's so much to that angle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4136.62,
    "end": 4145.642,
    "text": "And using the pre-existing and the possible social networks to leverage the spreading of memes that might be just purely corrosive, not even...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4146.809,
    "end": 4151.775,
    "text": " for or against one side, just pure disinformation or pure things that are divisive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4152.315,
    "end": 4161.085,
    "text": "Let me just run through a few of our ladder questions so we can get some more neurons firing, connect some more ideas and stabilize these concepts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4162.026,
    "end": 4171.811,
    "text": " So in this quote, which I will not read, it's just about how cultural affordances are acquired through cultural practices.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4172.272,
    "end": 4178.035,
    "text": "And I found a really nice image that I thought tied together ontologies with culture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4178.535,
    "end": 4181.417,
    "text": "So this is an image from the ontotext.com on the bottom there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4181.817,
    "end": 4190.142,
    "text": "And it writes, ontologies do not only introduce a shareable and reusable knowledge representation, but can also add new knowledge about the domain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4190.962,
    "end": 4206.812,
    "text": " So I had a few questions here about ontologies, and that could be in that anthropological term, the ontological term, as Maxwell was describing it, or in the more computational sense, like gene ontologies, the structure of words that we use to describe genes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4206.852,
    "end": 4209.914,
    "text": "So ontology in that sense means like a formal knowledge structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4210.554,
    "end": 4216.178,
    "text": "And about the attention and relationship between attention and ontology, between ontologies and development.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4216.838,
    "end": 4218.82,
    "text": "And then especially for this group,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4219.62,
    "end": 4227.365,
    "text": " how do ontologies and active inference interact, and how does that actually add knowledge to a situation rather than being a pure descriptor?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4230.186,
    "end": 4234.449,
    "text": "Well, I mean, in part, you don't grasp the world in a naked way, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4234.769,
    "end": 4245.695,
    "text": "Like, we grasp it through our conceptual categories, through the salience structures that are encoded in our conceptual categories in large part, and...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4248.973,
    "end": 4267.984,
    "text": " Yeah, I mean, the point of having an ontology is to kind of, you know, fix the frame problem, in a sense, to kind of say, okay, what, out of all of these elements that could be monopolizing my attention at a given moment, you know, who are the relevant interlocutors that are deserving of my attention?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4268.444,
    "end": 4273.688,
    "text": "What are the salient aspects of the scene that require my processing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4275.769,
    "end": 4277.63,
    "text": "Yeah, and in general, what",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4279.351,
    "end": 4281.432,
    "text": " Just in the broad sense, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4281.452,
    "end": 4290.755,
    "text": "Because otherwise you're just dealing with a sensory stream, which is all fine and good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4291.355,
    "end": 4297.977,
    "text": "So the ontology is what you bring to bear on the sensory stream to kind of parse things out from it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4299.181,
    "end": 4299.341,
    "text": " Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4299.822,
    "end": 4301.704,
    "text": "And I like where you took that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4301.784,
    "end": 4303.787,
    "text": "It was exactly what I was thinking about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4303.827,
    "end": 4306.249,
    "text": "Like how many tennis balls can you fit in your hand?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4306.51,
    "end": 4314.72,
    "text": "Maybe three, maybe you have a large hand, four tennis balls or something, but you have a bag and you can cluster the tennis balls and you could pick up a bag with a hundred tennis balls.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4315.18,
    "end": 4321.863,
    "text": " So that's the grip physical metaphor is the tools, the affordances that cluster allow you to grip more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4322.303,
    "end": 4330.446,
    "text": "And so similarly, we can use ontologies of ideas and use that to get a grip on really high level concepts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4330.826,
    "end": 4341.39,
    "text": "And then when we pick up the double edged sword, though, right, because I mean, you know, this is the problem of using priors in general, is that, you know, you're starting from a point that might not be the right one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4341.84,
    "end": 4348.697,
    "text": " And that might actually prevent you from, you know, so ontologies are the reason why we have, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4350.322,
    "end": 4356.704,
    "text": " the capacity to interact with each other, for example, as peers, you know, because we have these categories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4356.944,
    "end": 4359.705,
    "text": "You are my peers and my friends and we can interact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4359.965,
    "end": 4365.186,
    "text": "But, you know, ontologies are also responsible for racist behavior, for sexism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4366.046,
    "end": 4375.769,
    "text": "You know, if my ontology says women are inferior to men or the people with dark skin, I don't believe any of that bullshit, just to be clear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4375.809,
    "end": 4379.47,
    "text": "But, like, if that is my ontology, then I'm bound to treat",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4380.45,
    "end": 4383.432,
    "text": " others in a way that reflects those beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4384.673,
    "end": 4393.157,
    "text": "So this is why they're so important to culture, I think, because it's not unrelated to this formal definition that you were discussing, Dan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4393.257,
    "end": 4399.18,
    "text": "It gives you the kind of general tracks that you'll follow in your treatment of others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4400.101,
    "end": 4404.683,
    "text": "So then it becomes interesting to use anthropological methods, for example,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4405.464,
    "end": 4408.748,
    "text": " to see what are the ontologies that people are actually bringing to bear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4408.768,
    "end": 4413.673,
    "text": "And to use that physical carrying metaphor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4413.733,
    "end": 4415.896,
    "text": "So you go, okay, well, I can hold three eggs in my hand.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4416.416,
    "end": 4418.699,
    "text": "I should have a bag with 500 eggs because I can pick it up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4418.819,
    "end": 4420.982,
    "text": "Well, now you have none or you have a mess.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4421.442,
    "end": 4423.244,
    "text": "And so oversimplification...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4424.045,
    "end": 4446.203,
    "text": " through any number of mechanisms within a value structure simply leads to false positives and false negatives and another way that we can bring in the free energy principle is the phrasing of free energy as model accuracy penalized by complexity and in some ways the extreme uh simple model let's say a one category model like all people are people",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4446.923,
    "end": 4471.894,
    "text": " or two or three category model and so do the models get more accurate in terms of reducing surprise as we include more and more parameters and then in the extreme case we have everyone is unique which is an interesting bookshelf you know end piece to contrast with this everybody's the same and so somewhere in between is where we're actually going to end up and so how do we help",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4472.694,
    "end": 4479.137,
    "text": " bring these implicit generative models of the world and our priors into being shaped and designed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4479.717,
    "end": 4483.379,
    "text": "And personally, I think we never escape the value question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4484.039,
    "end": 4487.961,
    "text": "And it's one thing to come together with somebody who has a different perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4487.981,
    "end": 4498.146,
    "text": "And it's why it's so important to highlight coming together across differences, because there's just no amount of cultural or genetic or whatever homogeneity that is going to prevent conflict.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4498.746,
    "end": 4506.869,
    "text": " And so instead we can have a coming together story about working together across differences rather than wedging tiny differences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4507.369,
    "end": 4514.492,
    "text": "And that story itself is in a trade-off with essentially gaslighting and telling people that suffering is just part of how things are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4514.932,
    "end": 4515.973,
    "text": "So there's so many trade-offs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4516.773,
    "end": 4520.294,
    "text": " that exist, especially when we're talking about issues that matter most.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4520.354,
    "end": 4523.054,
    "text": "I mean, we're not talking about species definitions in foxes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4523.294,
    "end": 4526.815,
    "text": "We're talking about our own lives and our world and our ecosystem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4527.135,
    "end": 4529.436,
    "text": "And so, yes, they're touchy topics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4529.736,
    "end": 4534.257,
    "text": "And it's so important to be clear about what is and also what we want to see.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4534.817,
    "end": 4539.858,
    "text": "And so I think there's so much that can be explored and expanded on here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4540.678,
    "end": 4545.539,
    "text": "I like that you brought in complexity minus accuracy, because in a sense, the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4546.069,
    "end": 4555.595,
    "text": " you know, this is a little bit, a slightly looser way of thinking about it, but in general, you want as little boxes as possible, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4556.916,
    "end": 4562.16,
    "text": "Boxes, I mean, if you listen to Buddhist wisdom, for example, boxes are the source of suffering, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4562.54,
    "end": 4573.247,
    "text": "We cling to our boxes, we put things in boxes, and it makes us feel comfortable, but really this is the source of suffering, you know, to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4573.907,
    "end": 4580.713,
    "text": " this tendency to only be comfortable with things when they're nicely packaged in these kind of nice binary categories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4580.733,
    "end": 4590.14,
    "text": "I think this is why people get so uncomfortable when these binaries get challenged by gender fluidity and transness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4590.72,
    "end": 4592.101,
    "text": " and these kinds of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4592.521,
    "end": 4595.963,
    "text": "On the flip side, if we didn't have boxes at all, we would die, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4596.603,
    "end": 4606.529,
    "text": "You know, you need to be able to parse that sensation as hunger, in order to generate like, you know, appropriate survival generating behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4607.341,
    "end": 4633.159,
    "text": " So I think that's the fundamental paradox of human existence is both that we need boxes to survive, but that they also are the source of much suffering, both that we're inflicting to ourselves by forcing these kind of conceptual straitjackets onto ourselves, but also because of the social wrongs that can be the result of using the wrong ontology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4633.703,
    "end": 4658.966,
    "text": " yep and cognitive diversity means differences in risk tolerance it means of course different perspectives unique perspectives and also um maybe on that explore exploit or on that model accuracy versus complexity some people will accept um a more accurate model from their perspective that is also a lot more complex whereas somebody else's the coefficient of how much they're penalizing a complex model is different so they're going to come to a different conclusion",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4659.466,
    "end": 4662.652,
    "text": " And it's not as simple as right versus wrong in that situation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4662.732,
    "end": 4663.894,
    "text": "It's model preference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4664.034,
    "end": 4665.557,
    "text": "And could we take a step back?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4665.898,
    "end": 4670.045,
    "text": "Could we reframe and understand how we're all part of the ensemble that's learning?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4671.215,
    "end": 4671.775,
    "text": " It would be nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4672.635,
    "end": 4678.797,
    "text": "Let's go through a few of these last topics on communication and semiosis or meaning generation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4679.678,
    "end": 4685.96,
    "text": "So here is from figure one of the paper, which we discussed last time as far as what it was describing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4686.02,
    "end": 4688.1,
    "text": "But here I want to connect it to one of the quotes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4688.721,
    "end": 4689.021,
    "text": "They write,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4690.021,
    "end": 4697.643,
    "text": " Conventions need not be explicitly formulated as rules and may instead originate in the actor's engagement with local backgrounds over time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4698.243,
    "end": 4704.925,
    "text": "That is, from non-contentful developmental experiences, learning or participation in social and cultural practices.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4705.465,
    "end": 4709.746,
    "text": "To operate with conventional affordances, agents must have shared sets of expectations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4710.166,
    "end": 4712.547,
    "text": "We must know what others expect us to expect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4713.007,
    "end": 4723.291,
    "text": " So, yes, we're hitting the same idea from figure one, but there's a lot we're kind of spiraling another layer and coming back to this idea where we're in a remote group right now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4723.851,
    "end": 4728.712,
    "text": "And so we are getting our expectations about what to expect and all these things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4728.992,
    "end": 4736.175,
    "text": "Not only are they going to be very different person to person because our local worlds are quite different, but there's this algorithmic level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4736.835,
    "end": 4766.455,
    "text": " that influences what we expect and it changes on the inputs that we receive and reducing our surprise about the sensory inputs is one of the drivers of behavior and so how does what we see in the news feed end up recapitulating the things that we will draw our attention to and that's sort of this self-radicalization process that can happen is attention is brought to something and then it continues to basically percolate upwards as people pay more and more attention",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4766.995,
    "end": 4787.953,
    "text": " and are more and more cautious or more and more aware of something that... It's hard to take a step back from any scientific worldview and say that one is better or the other because although I'd love to hear a workaround, it's hard to get a purely secular perspective because someone could say, I'm just pursuing my accuracy by doing something that's aberrant to you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4788.614,
    "end": 4790.295,
    "text": "And it's difficult to see...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4791.636,
    "end": 4794.777,
    "text": " purely within the framework, nor does there have to be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4795.237,
    "end": 4813.301,
    "text": "I think what free energy and active inference and focusing on the communication dynamics allows us to do is let our values be values, let our communication be communication, let our behavior be behavior and talk about what we expect using ways that we want to communicate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4813.401,
    "end": 4815.282,
    "text": "And if people don't want to use nonviolent communication,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4816.727,
    "end": 4830.732,
    "text": " Other people may or may not choose to communicate with them, but it's how we communicate what we expect when there's not only that computational intervention, but also a lot of coming together of different perspectives.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4830.872,
    "end": 4832.932,
    "text": "It's one of the challenges of our day.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4833.733,
    "end": 4834.533,
    "text": "And then also just,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4835.487,
    "end": 4838.249,
    "text": " This cultural iceberg was a nice image.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4838.469,
    "end": 4852.361,
    "text": "Some of the words are small in there, but the quote on here is, joint attention is usually understood as occurring in a diet of two people or between agents in direct interactional spheres of communication, gaze following, finger pointing, or other verbal or nonverbal cues.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4853.121,
    "end": 4868.764,
    "text": " To address more complex social situations, it is useful to revise current socio-cognitive models of joint attention to encompass fundamentally triadic situations in which the third is the socially constituted niche of affordances supported by local ontologies and abilities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4869.184,
    "end": 4872.285,
    "text": "So before you get to the questions, just some of these in the iceberg.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4872.405,
    "end": 4877.386,
    "text": "Above the iceberg, we have dress, folklore, language, fine arts, holidays, food.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4877.826,
    "end": 4879.847,
    "text": "And below, we have family values.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4880.127,
    "end": 4881.307,
    "text": "We have gender roles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4882.107,
    "end": 4883.608,
    "text": " pride, concept of justice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4884.088,
    "end": 4887.089,
    "text": "So this, and there's different versions of the iceberg.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4887.169,
    "end": 4888.849,
    "text": "I just thought this one had a lot of nice ideas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4889.549,
    "end": 4897.292,
    "text": "My questions here were, what is the third member of a social interaction and how can active inference help us design culture?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4899.252,
    "end": 4906.695,
    "text": "If I can jump in quickly, it's sort of, it's sort of the, so a human once in culture, it is never alone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4907.714,
    "end": 4908.234,
    "text": " in a sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4909.115,
    "end": 4913.858,
    "text": "We're always constantly seeing things through the eyes of others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4914.258,
    "end": 4917.86,
    "text": "It starts off as, what would mommy want me to do in this situation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4917.88,
    "end": 4921.242,
    "text": "It's remarkable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4921.322,
    "end": 4922.903,
    "text": "Canadians are really good at this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4923.583,
    "end": 4934.47,
    "text": "I'd have to pull up the studies, but there are studies that show that Canadians, even at night when there are no policemen, will stop at a red light and just wait it out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4935.114,
    "end": 4939.057,
    "text": " you know, and go even if there are no agents that could penalize them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4940.718,
    "end": 4951.326,
    "text": "I mean, it's really remarkable the extent to which we internalize these kinds of norms, and they end up then directing the way that we interact with others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4953.041,
    "end": 4953.261,
    "text": " Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4953.521,
    "end": 4954.922,
    "text": "Any other thoughts on this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4955.002,
    "end": 4965.989,
    "text": "Or we can just... It's something for pondering because we have the explicative portion of our experience, which is that which comes to our conscious awareness, that which is stated verbally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4966.37,
    "end": 4975.896,
    "text": "But on the input side, subconscious input, and on the generative models that can't be expressed in words, sometimes they can be expressed through art or through action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4976.216,
    "end": 4976.316,
    "text": "But",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4976.776,
    "end": 4993.047,
    "text": " the whole iceberg is there and so it's just i really like that once you're in culture you're never alone and indeed we we are never alone because to be aware is to be communicating it's almost like the uh cog ergo sum it's like i communicate therefore we exist something like that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4994.727,
    "end": 5005.52,
    "text": " In this last page on semiosis, which I think is an interesting topic, the authors wrote, however, cultural symbols and signs are usually polysemous.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5005.68,
    "end": 5009.866,
    "text": "That means having many or multiple meetings and their interpretation depends on context.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5009.906,
    "end": 5010.466,
    "text": "It's contextual.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5011.027,
    "end": 5020.769,
    "text": " Our hypothesis is that feedback loops mediating shared attention and shared intentionality are the principal mechanism whereby cultural, especially conventional affordances are acquired.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5021.289,
    "end": 5022.329,
    "text": "So conventional is fun.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5022.429,
    "end": 5028.03,
    "text": "I think in this setting, because it alludes to conventional, like normal, like it's just the conventional approach.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5028.07,
    "end": 5039.032,
    "text": "It's the normal approach, but also based upon convention and convention in that sense means both the coming together, like it's a convention of the knife sharpeners or something, but also it's a, it's a joint it's agreed upon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5039.332,
    "end": 5040.232,
    "text": "So it has many senses.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5040.672,
    "end": 5064.473,
    "text": " and it shows how normal and agreed upon often are related that's one symbol and so here was a few graphics that i found on a nice the dsproject.com so on the left is what is known as the piercean triad by cs pierce and that's the sign the interpretant and the object and on the right is um sarsour who is another semiotician",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5065.214,
    "end": 5066.636,
    "text": " that may have used different words.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5067.497,
    "end": 5071.181,
    "text": "And here we see that there's the signifier and the signified and then the referent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5071.701,
    "end": 5081.372,
    "text": "And so I like this because it shows that there's multiple ontologies, even when we're talking about sensemaking, about meaning generation, there's multiple ways we can parse that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5081.492,
    "end": 5083.694,
    "text": "And do we choose to see it as a triad",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5084.255,
    "end": 5096.102,
    "text": " Or do we choose to see it as a binary with another binary, like the SR and the SD are one whole and then the RF is another, you know, is it a pair of binaries or is it just an integral triad?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5096.382,
    "end": 5101.464,
    "text": "So that's one way where there's multiple frameworks we can use just to talk about meaning generation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5102.385,
    "end": 5103.526,
    "text": "And then this image,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5104.406,
    "end": 5133.179,
    "text": " is a representation by those authors about unlimited semiosis and this is sort of looking through time how that triad evolves and so i just thought how does this relate to active inference to that unfolding idea to this notion that our meaning generation our sense making process is ongoing with respect to the symbols but we can modify those symbols as well so how can we maybe use active inference at least to grasp what are the outlines of this problem",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5141.607,
    "end": 5145.088,
    "text": " Some of it, I think, was addressed in later papers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5145.168,
    "end": 5152.011,
    "text": "For example, I forget which Act-Inf stream, but when we talked about is the free energy principle a formal theory of semantics?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5152.811,
    "end": 5155.192,
    "text": "And it relates to that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5156.213,
    "end": 5164.176,
    "text": "I think it would probably be cool at almost the end of our time just to switch into panel mode",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5165.436,
    "end": 5176.702,
    "text": " and just see if anyone had any last thoughts that they wanted to talk about, any last questions or where are you going with what we've discussed today?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5176.742,
    "end": 5182.225,
    "text": "What do you think would be a good question to leave people on or a good next step for us to take?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5187.929,
    "end": 5192.111,
    "text": "I thought this was a really interesting and useful exercise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5193.031,
    "end": 5193.832,
    "text": "I'm super grateful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5195.188,
    "end": 5200.875,
    "text": " to all of you for this continued attention to the work that we've done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5200.895,
    "end": 5209.908,
    "text": "Yeah, I told the team earlier, but I've blocked off these mornings to participate regularly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5212.148,
    "end": 5215.589,
    "text": " So I mean, I'm very satisfied with this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5216.209,
    "end": 5217.209,
    "text": "I think it's very cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5217.929,
    "end": 5221.77,
    "text": "And I think we've raised a lot of issues that could be pursued as papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5223.551,
    "end": 5239.475,
    "text": "Yeah, particularly this issue that you were raising, Alejandro, about social networks and the way that they tie into attentional dynamics, I think should be the target of much more discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5241.897,
    "end": 5246.521,
    "text": " Yeah, I mean, I thought everyone had very, very interesting things to say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5246.541,
    "end": 5247.121,
    "text": "So thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5247.221,
    "end": 5255.848,
    "text": "Here's one angle on that is an evolutionary prior is that your social networks are constituted of people who are not adversarial with you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5256.308,
    "end": 5264.734,
    "text": "Most of the people who you're engaged with, whether or not they believe the exact same thing, you have to be relaxed enough around them to sleep, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5265.275,
    "end": 5269.278,
    "text": "And so the deepest prior is if we're relating, then we're",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5269.818,
    "end": 5272.72,
    "text": " we're going to be to some broad extent in agreement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5273.161,
    "end": 5288.532,
    "text": "Okay, now we know from active inference and niche construction that the two ways that you can deal with uncertainty or with unexpected sensory inputs is by changing the environment, that's niche construction, or by changing your internal model, that's inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5288.952,
    "end": 5293.756,
    "text": "So what happens when you're in a social contrived situation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5293.796,
    "end": 5295.317,
    "text": "It says, oh, but your friend posted this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5295.637,
    "end": 5297.599,
    "text": "Okay, so it's coming in through the friend door.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5298.179,
    "end": 5298.86,
    "text": "And it's a...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5299.48,
    "end": 5323.88,
    "text": " something that for my current value system at time t i think of is not chill there's all kinds of things not being chill but it just isn't and the two ways that i can deal with that are change my model to be more like that so i make that less surprising some type of hateful speech i get numb to it or i come to embody it actually to reduce my surprise on the inference side or",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5324.66,
    "end": 5332.666,
    "text": " I can get doubled down in my beliefs and try to reduce my uncertainty or the surprise from those sensory cues by getting into a debate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5332.686,
    "end": 5340.792,
    "text": "I mean, think about how much mental energy gets burnt on these sort of debates and people trying to change each other's mind online.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5341.413,
    "end": 5345.416,
    "text": "And there's something beautiful about people sharing their differences in idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5346.056,
    "end": 5351.22,
    "text": "But when that whole discussion is being basically discussed,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5351.38,
    "end": 5360.224,
    "text": " overviewed by an algorithm that doesn't exactly have those people's mental health or the alignment of different cultures in mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5360.724,
    "end": 5361.964,
    "text": "Not exactly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5362.024,
    "end": 5362.805,
    "text": "Not exactly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5363.005,
    "end": 5364.225,
    "text": "You know, it's correlated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5364.285,
    "end": 5366.086,
    "text": "No, it can get off the rails.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5366.626,
    "end": 5372.589,
    "text": "And so that deep evolutionary prior isn't something that can just be unlearned like you were speaking about earlier, Maxwell.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5373.089,
    "end": 5376.831,
    "text": "And so when our deepest prior and our intergenerational ones",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5377.871,
    "end": 5395.818,
    "text": " get taken advantage of it's like these slow waves and they can't quite cope with these very fast frequencies and so the options are to slow it down that's like the archaeo futurist you know oh well in the future we'll return to a more heterogeneous uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5397.597,
    "end": 5398.538,
    "text": " organization of people.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5398.938,
    "end": 5405.143,
    "text": "So slow down these high frequency waves or come to a better way that we can predict and communicate about them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5405.644,
    "end": 5411.829,
    "text": "I mean, there's a lot more that we could think about there, but it just it's yeah, there's yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5412.769,
    "end": 5413.75,
    "text": "Stephen and then Alejandra.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5415.572,
    "end": 5419.515,
    "text": "Well, I think, like you were saying, these ways that we think about what is happening",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5421.377,
    "end": 5425.74,
    "text": " is really important in terms of how we construct our conversations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5425.78,
    "end": 5435.007,
    "text": "But I think there's also the where and the where we've taken our attention to be able to have our conversations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5435.027,
    "end": 5444.274,
    "text": "So when you're locked in, they call it context collapse when you're on like Facebook, because you have no context, you have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5444.727,
    "end": 5468.403,
    "text": " no story, you have no... So one of the things with complex adaptive systems, the work of Cynthia Kurtz and David Snowden, they work with stories, small micro-stories, say 100, 1,000, and start to make sense of them, like attribute them with titles and metadata and actually work with story.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5468.483,
    "end": 5474.287,
    "text": "Because when you're working with story, each story, if it's kept raw, so it's not an opinion,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5474.967,
    "end": 5503.082,
    "text": " they call it it's like it's kind of maintains the internal complexity of it so you can still reinterpret it but once you've got an opinion an opinion is collapsed down you can't really reinterpret an opinion so we're kind of trapped in these kind of interpretive kind of inductive deductive spaces which is great if it's a case of like i have the right answer or you have the right answer so then we can like debate it but the trouble is what if we don't know and no one wants to admit they don't know",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5505.318,
    "end": 5507.499,
    "text": " Can we work with something more complex?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5507.599,
    "end": 5512.281,
    "text": "And maybe that's a where question and a how question, not a what question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5513.001,
    "end": 5513.241,
    "text": "Nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5513.601,
    "end": 5514.021,
    "text": "Alejandra?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5520.083,
    "end": 5523.084,
    "text": "Yeah, and I totally agree.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5523.124,
    "end": 5532.947,
    "text": "And also taking what Sasha said, that the idea that we are talking with our friends and, yeah, that's like the...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5535.311,
    "end": 5539.133,
    "text": " like our conscious, um, um, internal belief.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5539.493,
    "end": 5554.02,
    "text": "They are our friends, but we actually not have any idea, um, how these platforms work, um, how these platforms are manipulating our attention.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5554.04,
    "end": 5564.485,
    "text": "So we are communicating with others, but, um, we have something between this communication that we don't know actually how it's working.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5565.189,
    "end": 5576.637,
    "text": " And I don't know, I was thinking that we are kind of playing in terms of active inference to constantly increase our prediction error.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5577.958,
    "end": 5593.468,
    "text": "And you have to engage with this platform in order to reduce or minimize prediction error in terms of emotions or the way I react to other giving a like or sharing a post.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5596.107,
    "end": 5596.447,
    "text": " I don't know.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5597.388,
    "end": 5607.093,
    "text": "This idea that we're interacting with friends or we're close people, but we don't know what's happening in between.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5607.693,
    "end": 5607.993,
    "text": "Sasha?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5611.255,
    "end": 5625.423,
    "text": "Yeah, I think that that's a great point to touch on that we don't really understand what's happening, this hidden state between us and the person that we're trying to communicate with and how that's being manipulated.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5625.982,
    "end": 5637.805,
    "text": " And while that's a totally valid critique of social media platforms, we could say the same thing for like telephone communication or even telegram.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5639.366,
    "end": 5645.867,
    "text": "The people who were sending the message didn't necessarily understand what was happening in that process.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5646.407,
    "end": 5651.869,
    "text": "And yet they felt or they would trust that it was...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5653.723,
    "end": 5660.485,
    "text": " the integrity of the message was maintained or that it wasn't, nothing was lost in that process or manipulated.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5660.905,
    "end": 5675.289,
    "text": "But so it's been kind of like a steady, a steady march of technological advances that are more and more removed from what we think we're doing in this process of communication.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5676.051,
    "end": 5676.212,
    "text": " Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5676.372,
    "end": 5680.297,
    "text": "The neutral claim is that context directs attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5680.718,
    "end": 5686.045,
    "text": "So if there's a bunch of arrows pointing to something, even though it's not in the exact object, it will draw your attention to it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5686.165,
    "end": 5690.912,
    "text": "Or something that's placed on top of a pyramid is what your attention is supposed to be drawn towards.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5691.392,
    "end": 5702.116,
    "text": " Well, in the Telegram case, not the app, the Morse code version, the context is that you trust that Western Union or whomever isn't going to be garbling your message.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5702.456,
    "end": 5703.677,
    "text": "And the context is who it's from.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5704.037,
    "end": 5707.058,
    "text": "And so you can actually unpack it as if that person were just telling you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5707.578,
    "end": 5714.185,
    "text": " But when it's a stranger and it's like engaging the gas and the brake on is this an adversary or not?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5714.345,
    "end": 5716.388,
    "text": "And the context is constrained.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5716.828,
    "end": 5721.773,
    "text": "So you can only see their name or a fake Internet name and a picture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5722.354,
    "end": 5729.121,
    "text": "And then is it a surprise that given a picture and what somebody says, somebody is going to unpack it in seconds?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5729.181,
    "end": 5735.842,
    "text": " potentially the least charitable way based upon identity or based upon a typo or based upon some sort.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5736.042,
    "end": 5740.583,
    "text": "Whereas in person, we just look at each other and we can have more of this human sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5740.623,
    "end": 5743.464,
    "text": "We can have the context and that helps us understand.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5743.744,
    "end": 5752.966,
    "text": "And then beyond the context cues, when we can actually feel like we're part of a shared society, then we want to help people who are in need in our local worlds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5753.546,
    "end": 5754.966,
    "text": "And there's only one world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5755.246,
    "end": 5757.507,
    "text": "So it is our local world, Spaceship Earth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5758.027,
    "end": 5778.256,
    "text": " so there's there's so many angles and the question would just be what are those on ramps and then how is it all going to actually play out any final thoughts though because this was an awesome discussion great follow-up and there's we could have talked for longer on just 4.2 345 but next week we'll move to five and so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5782.079,
    "end": 5785.961,
    "text": " If there's no further thoughts, I really appreciate everybody coming together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5786.161,
    "end": 5790.384,
    "text": "Thanks for the attention to those participants and also to our listeners.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5790.964,
    "end": 5798.869,
    "text": "We'll always be, even weeks later, accepting input on what papers, what topics, what questions would be cool to discuss.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5799.829,
    "end": 5801.63,
    "text": "And so, yes, thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5801.67,
    "end": 5802.431,
    "text": "It's been a great stream.",
    "speaker": "SPEAKER_02"
  }
]