[
  {
    "start": 1.983,
    "end": 3.884,
    "text": " Live streaming.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 6.026,
    "end": 7.707,
    "text": "Hello, everyone, and welcome.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7.987,
    "end": 11.99,
    "text": "This is Team Calm Podcast 4.1 on September 15, 2020.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 14.191,
    "end": 15.272,
    "text": "Welcome to everybody.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 15.432,
    "end": 16.853,
    "text": "Hello, all participants.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 18.554,
    "end": 23.177,
    "text": "I'm going to share my screen, and we will jump right in.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 25.259,
    "end": 31.123,
    "text": "This is Team Calm Podcast 4.1, and this is Team Calm.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 32.014,
    "end": 38.075,
    "text": " TeamComm is an experiment in online team communication and learning related to Active Inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 39.275,
    "end": 41.816,
    "text": "You can find us on Twitter at Inference Active.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 42.476,
    "end": 43.456,
    "text": "You can email us.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 44.236,
    "end": 48.637,
    "text": "You can find us on a public Keybase team, as well as at the YouTube channel.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 49.558,
    "end": 57.819,
    "text": "This is a recorded and archived live stream, so please provide us with any feedback, participants as well as viewers, so that we can improve our work.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 58.919,
    "end": 61.68,
    "text": "All backgrounds and perspectives are welcome here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 62.372,
    "end": 75.996,
    "text": " And also just on a note of video etiquette, if people are muted in a noisy background or raising their hands when there's this many participants in the chat, it would be excellent and help us with our turn-taking and reduction of uncertainty about who's to speak next.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 77.617,
    "end": 82.758,
    "text": "So here we are in stream 4.1, and the structure of today is going to go like this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 83.338,
    "end": 87.32,
    "text": "First, we're going to have a few check-in questions and warm-up discussion.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 88.08,
    "end": 91.481,
    "text": "Then we'll get to the paper itself, which is Ramsted et al. 2016.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 93.37,
    "end": 104.499,
    "text": " We'll talk about the big aims of the paper, go through a roadmap of the paper to see how the authors get from A to Z. We'll go through the abstract to understand how the authors represent their own work.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 105.219,
    "end": 108.682,
    "text": "Then we'll go through the box of definitions as well as the figures.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 109.763,
    "end": 114.607,
    "text": "At that point, we'll have time for questions and other insights, and also we've",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 115.054,
    "end": 124.418,
    "text": " implicitly prepared for a podcast 4.2, where we'll be able to have further discussions on some key quotation or anything arising that we don't get to this week.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 125.479,
    "end": 127.4,
    "text": "So thanks for that part.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 127.52,
    "end": 132.522,
    "text": "Here we are in the check-in and everybody can feel free to introduce themselves and their location if they would like.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 133.183,
    "end": 136.744,
    "text": "The first question is pretty broad, but that's what the warmup is about.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 136.884,
    "end": 138.185,
    "text": "So what is culture?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 144.787,
    "end": 145.407,
    "text": " That's a good question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 148.208,
    "end": 156.931,
    "text": "Or in the sense of this paper, in the sense of culture that's being scaffolded within a kind of framework that we might want to build out, what would that kind of culture refer to?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 159.372,
    "end": 161.273,
    "text": "So I'm Maxwell Ramstad.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 161.673,
    "end": 165.334,
    "text": "I'm the first author on this paper, Cultural Affordances.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 167.183,
    "end": 170.805,
    "text": " By the way, I'm really grateful for this podcast.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 170.865,
    "end": 179.088,
    "text": "You all have been so great just in general over the last few weeks, and I'm particularly touched that you're giving the work that we've developed so much attention.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 179.108,
    "end": 182.189,
    "text": "I'm just so full of gratitude.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 182.969,
    "end": 183.63,
    "text": "This is so cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 184.97,
    "end": 192.013,
    "text": "So culture, at least in the sense that we're using the term here, means something like the taken for granted.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 192.887,
    "end": 196.268,
    "text": " I think is sort of the heuristic way that I like to think about it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 196.788,
    "end": 207.592,
    "text": "It's sort of like in a given local frame of reference, in a given environment shared by a group of people living together, what are the things that are taken for granted?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 207.672,
    "end": 214.815,
    "text": "What are the sets of expectations and beliefs and sets of practices and norms",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 216.377,
    "end": 224.388,
    "text": " you know, that are shared and that essentially structure people's intuitive grip on their shared social world.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 229.495,
    "end": 231.177,
    "text": "Any other thoughts on culture there?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 232.215,
    "end": 235.798,
    "text": " In sociology, we define culture as kind of three different dimensions.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 236.378,
    "end": 242.562,
    "text": "You have the symbolic ideal dimension, which is really, I think, equivalent to semantic knowledge.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 242.983,
    "end": 245.764,
    "text": "We break it up in terms of norms, values, and beliefs.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 246.665,
    "end": 253.229,
    "text": "We have a psychobehavioral dimension, which is really about in body culture, how your body moves, the skills that you have.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 254.488,
    "end": 261.81,
    "text": " In terms of psychological kind of terminology, I would really say your skills and habits in kind of that non declarative memory sense.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 262.451,
    "end": 270.093,
    "text": "And then the third dimension is really our material dimensions of the physical things that we create the tools, the buildings, the fashion, which I think",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 270.968,
    "end": 278.233,
    "text": " The degree to which I understand the affordance literature, I think all three of those dimensions definitely have versions of affordances that could connect to that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 279.854,
    "end": 295.705,
    "text": "I think that was one thing I did see in the paper that it did seem to be very much focused on just that semantic kind of symbolic dimension and not really explicitly incorporating the other dimensions that, at least in sociology, we would kind of include in that definition of culture.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 297.467,
    "end": 297.807,
    "text": "Cool.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 298.635,
    "end": 299.236,
    "text": " Yeah, thanks for that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 299.276,
    "end": 301.239,
    "text": "That was very rich, actually.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 301.78,
    "end": 303.924,
    "text": "Very interesting points that you're raising.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 304.304,
    "end": 308.551,
    "text": "Yeah, I should just give maybe some historical background on this paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 308.611,
    "end": 312.357,
    "text": "This was the first in a series of papers that have been developed into",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 314.04,
    "end": 318.201,
    "text": " basically like a variational or free energy approach to culture.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 319.001,
    "end": 329.863,
    "text": "And I think a lot of the elements that you're mentioning were only sketched in this paper and were developed in, I think, further iterations of the model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 330.763,
    "end": 340.445,
    "text": "So everything that you just outlined, Richard, I think are very essential and crucial things that need to be tackled when studying culture.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 340.465,
    "end": 341.965,
    "text": "So it's great that you're raising them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 343.513,
    "end": 355.505,
    "text": " Cool, and I think the question about multiple kinds of culture ranging from the semantic concepts to the externalized production to the artifacts of culture bring us this idea of scaffolding culture.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 355.925,
    "end": 359.428,
    "text": "So what is a way that culture is scaffolded?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 360.65,
    "end": 366.976,
    "text": "Someone can raise their hand, maybe someone new, but something that guides the construction, just like a scaffold.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 372.352,
    "end": 385.115,
    "text": " I'll give one way, which is education, because pedagogy is sort of the guide rails for how individuals learn about those norms, as well as how to use the artifacts and construct new artifacts.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 385.595,
    "end": 390.756,
    "text": "These are ways in which culture is scaffolded because it provides structure for the growth to happen within.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 396.058,
    "end": 397.178,
    "text": "Any other comments on that?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 399.696,
    "end": 403.639,
    "text": " Okay, and then the last warm-up question is, what is shared intentionality?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 404.339,
    "end": 409.303,
    "text": "Or what's a way in which somebody has seen shared intentionality play out in their recent experience?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 413.106,
    "end": 414.667,
    "text": "Well, so there are two parts to that, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 414.707,
    "end": 416.468,
    "text": "There's shared and there's intentionality.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 417.129,
    "end": 427.356,
    "text": "So intentionality, at least in the sense that we're using it in the paper, draws on the philosophical construct of intentionality that we can basically, you know,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 428.997,
    "end": 432.379,
    "text": " You can draw lineage all the way back to Brentano, effectively.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 432.779,
    "end": 436.441,
    "text": "So by intentionality, we mean orientation towards a world.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 437.842,
    "end": 444.666,
    "text": "We don't necessarily mean intentionality in the sense of having the intention to do this or that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 445.186,
    "end": 450.749,
    "text": "It's from the Latin, I think, intensio, which is the word that was used to describe what a...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 452.611,
    "end": 456.613,
    "text": " what an archer is doing with his arrow to hit the target.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 456.794,
    "end": 459.235,
    "text": "It is in tensio with the target.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 459.675,
    "end": 463.197,
    "text": "And so it's this that we're trying to get at.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 463.297,
    "end": 478.907,
    "text": "And one of the things that we're trying to argue here is that part of what makes a shared social world just that, a shared social world, is that there are forms of relating to that world, so forms of intentionality that are also shared.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 480.578,
    "end": 483.783,
    "text": " among the people who live in that world together.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 483.803,
    "end": 487.189,
    "text": "So that's what we were trying to get at ultimately, I think.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 488.349,
    "end": 500.151,
    "text": " I think what's interesting in terms of if you take that definition and you look back at the scaffolding, you know, if you look within the individual, there's this network of semantic and episodic memory and non-declared memory that's organized in the brain.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 500.772,
    "end": 517.215,
    "text": "If you put me into contact with another individual from my culture who shares my language and we begin to construct this we space, if you look at the phenomenology, and then now what happens with this dyad, either we introduce a third person or we then one of us leaves the relationship and we go,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 517.862,
    "end": 544.063,
    "text": " interact with someone else, if you spread that dyadic interaction out to a network, and then you look at the fractal scaling of that network, there's this way to, I think, to very deliberately keep track and build up from organized memory in the brain to an institution of 25,000 people dynamically interacting by following these mechanisms by which you create the shared space and looking at those emergent properties and trying to model them mathematically.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 545.384,
    "end": 546.065,
    "text": "Couldn't agree more.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 546.886,
    "end": 551.669,
    "text": " And there's a quote from the paper, which I'll spare Maxwell from reading is near the end.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 551.709,
    "end": 568.621,
    "text": "It says to address more complex social situations, it is useful to revise current socio cognitive models of joint attention to encompass fundamentally triadic situations in which the third is the socially constituted niche of affordances supported by local ontologies and abilities.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 569.181,
    "end": 570.822,
    "text": "So we're just jumping in today.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 571.062,
    "end": 575.025,
    "text": "But that's sort of where we're wanting to go with this paper and in discussion.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 575.498,
    "end": 580.762,
    "text": " is towards understanding what is that third space and how does the aim or does the intent play in?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 581.203,
    "end": 581.683,
    "text": "Yeah, Stephen.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 582.424,
    "end": 590.59,
    "text": "Yeah, and I think this cultural piece also brings in that intersubjectivity sort of space between.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 590.61,
    "end": 605.022,
    "text": "And I like how this work with Maxwell and the four of us is, and I love this paper as well, that's great, is it gives a way to understand how to approach it beyond education.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 605.811,
    "end": 611.313,
    "text": " beyond sort of the banking of programming people and saying, well, what's in the environment?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 611.333,
    "end": 620.776,
    "text": "Particularly now that we've got situations of cross-cultural understandings where cultures have to try and understand and work together.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 620.896,
    "end": 624.217,
    "text": "Is it all about teaching us how to tolerate each other?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 624.597,
    "end": 628.818,
    "text": "Or is it about understanding how we perform in the environment?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 629.519,
    "end": 631.559,
    "text": "So I think it's got a lot of applications.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 633.24,
    "end": 633.52,
    "text": "Cool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 635.199,
    "end": 637.241,
    "text": " Well, here we are, finally, at the paper.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 638.182,
    "end": 643.689,
    "text": "Cultural affordances scaffolding local worlds through shared intentionality and regimes of attention.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 643.849,
    "end": 649.295,
    "text": "So we'll definitely want to unpack each of these concepts, and it's in Frontiers in Psychology from 2016.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 649.535,
    "end": 654.882,
    "text": "The big aim of the paper, grasped from the abstract and the",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 655.839,
    "end": 664.483,
    "text": " introduction section is to better understand how culture and context interact with human biology to shape human behavior, cognition, and experience.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 664.903,
    "end": 668.124,
    "text": "So kind of all of it, kind of things that Richard was bringing up early on.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 669.085,
    "end": 675.427,
    "text": "And from the introduction, the integrative framework we propose bridges cognitive and social sciences to provide two things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 675.808,
    "end": 682.851,
    "text": "First, an expanded concept of affordance that extends to sociocultural forms of life, which we'll unpack in box one.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 683.511,
    "end": 683.791,
    "text": "And two,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 684.332,
    "end": 693.276,
    "text": " a multi-level account of the socio-culturally scaffolded forms of affordance learning and the transmission of affordances in pattern socio-cultural practices.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 693.956,
    "end": 706.882,
    "text": "So the key piece there is that multi-level account because we're not going to have an individual level account by which collective outcomes arise or a group level account by which individuals are shaped in their behavior uniquely.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 707.202,
    "end": 712.605,
    "text": "Those are sort of two sides of the same coin or some of the sides of a many-sided coin.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 713.103,
    "end": 726.766,
    "text": " that constitute this top-down and bottom-up relationship that we see in a lot of multi-scale systems, like the brain being nested within a body, inside of a niche, inside of these institutions that last beyond the lifespan of the organism.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 727.907,
    "end": 729.947,
    "text": "Any thoughts on the aim here?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 731.047,
    "end": 732.528,
    "text": "Or questions about anything?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 735.468,
    "end": 735.728,
    "text": "Cool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 736.029,
    "end": 737.589,
    "text": "Well, then let's get to the roadmap.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 738.429,
    "end": 741.99,
    "text": "So the roadmap, I just copied out the section headers",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 742.851,
    "end": 749.335,
    "text": " and how that takes us on a journey or on a narrative in our learning odyssey, in a sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 750.096,
    "end": 755.719,
    "text": "In the beginning, there's an introduction and a theoretical framework for affordances is provided.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 756.319,
    "end": 765.525,
    "text": "And that includes, I know the font may be a little small, perspectives, affordances and phenomenology, landscapes and fields, meanings and affordances,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 766.098,
    "end": 776.363,
    "text": " And then we reach figure one, which has a basic cognitive formula for automatic intentionality and figure two that expands on that formula slash comic format.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 776.903,
    "end": 779.204,
    "text": "So that's a theoretical framework for affordances.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 779.685,
    "end": 788.249,
    "text": "Maybe could anyone chime in what, what is an affordance in this context or in the cultural context or in the context of whichever field you're familiar with?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 791.731,
    "end": 791.971,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 792.011,
    "end": 792.511,
    "text": "So I,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 793.251,
    "end": 798.176,
    "text": " I guess just for a simple definition, it's something that invites action or interaction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 798.917,
    "end": 802.14,
    "text": "And the cartoon example is always a chair affords sitting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 803.261,
    "end": 814.172,
    "text": "But in the context of a social interaction, it could be some environment that affords or that elicits our interaction, maybe conversation or music making with another person.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 816.613,
    "end": 816.833,
    "text": " Great.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 817.053,
    "end": 827.679,
    "text": "And it makes sense to start the paper off with this framework for affordances because action opportunities are so fundamental to active inference and to action oriented frameworks.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 827.759,
    "end": 836.284,
    "text": "This is really what defines action oriented frameworks is they focus on actions and the stimuli or the cues that lead to action.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 836.564,
    "end": 838.205,
    "text": "So affordances are opportunities.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 839.295,
    "end": 843.197,
    "text": " The second section here is the neurodynamics of affordances.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 843.297,
    "end": 852.143,
    "text": "So this is the integration of the cognitive and the neurosciences with the more behavioral, ecological concept of an affordance.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 853.804,
    "end": 857.586,
    "text": "Computation, representation, and minimal neural models is addressed.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 857.646,
    "end": 863.23,
    "text": "And also many of these ideas, later papers include other or different depictions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 863.31,
    "end": 864.951,
    "text": "And this is already four years past.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 865.051,
    "end": 868.733,
    "text": "So that equates to about 400 papers in between us and here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 869.528,
    "end": 894.342,
    "text": " yeah i should say um like this is probably the weakest section of the paper as it currently is formulated um i mean yeah as you're pointing out it was published in 2016 and we started really working on this in 2015 and i mean since i did a whole phd focused on the free energy principle and what it what it entails and how it works and so on and i think uh",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 895.485,
    "end": 909.289,
    "text": " I mean, I wouldn't disavow what we say here, but I think that definitely our understanding of the representational implications of the theory have been refined over the years.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 909.689,
    "end": 914.391,
    "text": "But I mean, this is basically in a nutshell what we tried to pursue since 2016.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 914.771,
    "end": 921.553,
    "text": "So as you're saying, like several papers have been published since and the, you know,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 924.452,
    "end": 925.812,
    "text": " the framework has moved a little bit.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 926.973,
    "end": 927.453,
    "text": "Absolutely.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 927.693,
    "end": 927.973,
    "text": "Richard?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 928.593,
    "end": 934.556,
    "text": "Yeah, I think definitely when we look back on our earlier papers, we're always like, oh, I should have said all these different things.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 934.996,
    "end": 947.102,
    "text": "But I actually really appreciate this paper because for me as a complete non-expert in a lot of these fields, the free energy principle is very, very difficult to find an entry point into.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 947.942,
    "end": 963.267,
    "text": " And so to have something that I think was very conceptual and grounded in neuroscience that I think a lot of social sciences could wrap their head around relatively easily, and then to trace this as breadcrumbs to the more advanced free energy principle stuff, I really appreciate it.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 963.287,
    "end": 973.991,
    "text": "I thought it was a great entry point into this literature and kind of gave me a foundation to kind of start to wrap my head around how these concepts are being applied in that more mathematical context.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 975.452,
    "end": 976.532,
    "text": "I really appreciate you saying that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 977.466,
    "end": 986.251,
    "text": " It's one of the reasons why we chose this paper other than Shannon suggesting it is for me, at least when I can see the path in the literature.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 986.271,
    "end": 990.773,
    "text": "OK, here's what they thought in 2016, which means in years leading up to 2016.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 991.354,
    "end": 995.776,
    "text": "And then, yes, it can be refined or presented or enriched in later work.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 996.087,
    "end": 1004.051,
    "text": " But seeing the breadcrumbs for the pheromone trail is how I get a calibration of the derivatives of how the ideas are changing through time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1004.451,
    "end": 1009.473,
    "text": "And I've found that, yeah, one way maybe weaker, but the most growth has happened here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1009.573,
    "end": 1011.934,
    "text": "And this is one of the areas where the most growth can happen.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1012.335,
    "end": 1018.237,
    "text": "So this is why we continue to dip back into the literature even longer than four years in the past.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1018.297,
    "end": 1023.62,
    "text": "I know it feels like forever though, because sometimes there's a uniqueness to that cultural artifact.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1024.005,
    "end": 1034.51,
    "text": " that isn't just about how well it conveys what the relationship is between neuroscience and free energy, but rather how well it conveys what the researchers were working on in that intersection.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1034.73,
    "end": 1036.131,
    "text": "So we're thinking through other minds.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1036.551,
    "end": 1037.992,
    "text": "For some of us, it was us in the past.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1038.052,
    "end": 1040.073,
    "text": "For some of us, it was just another paper.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1041.786,
    "end": 1043.127,
    "text": " I will say this just really quick too.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1043.708,
    "end": 1055.599,
    "text": "A lot of the affordances, that concept of affordance in sociology is very much grounded in a pragmatic process philosophy, white head, the idea that reality reaches out to the other reality.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1056.099,
    "end": 1068.103,
    "text": " And so if that is where our literature is grounded, to be able to have something like this that's very conceptual, to work through those philosophical ramifications and then begin to ask, how would this fit with the free energy principle?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1068.483,
    "end": 1080.767,
    "text": "And I think vice versa as well, having the free energy principle community kind of understanding some of these philosophical concepts and ideas to kind of ground more conceptually, not so much mathematically, what it is that their perspective is offering to other disciplines.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1083.148,
    "end": 1083.528,
    "text": "Well said.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1084.994,
    "end": 1087.235,
    "text": " Then we move to figure three.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1087.615,
    "end": 1101.862,
    "text": "Now I found that figure three, four, and five make a really nice sequence and we'll go through them in sequence because it enriches one level of detail on top of one level of detail of a hierarchical prediction error minimization framework.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1102.362,
    "end": 1109.826,
    "text": "Figure four diagrams it a little bit more clearly from a Bayesian perspective, and then five brings on another level of realism.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1111.144,
    "end": 1121.07,
    "text": " Then we talk a little bit in this section about predictive processing and attention, and that returns our attention to the idea of culture as regimes of attention from the title.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1122.47,
    "end": 1128.774,
    "text": "I should just say at this point, if I had to rewrite this paper, this would be two papers and this would be the split.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1129.615,
    "end": 1140.861,
    "text": "So I really think that the first part of the paper really tells a story about affordances, the affordances that are available in the human landscape,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1142.086,
    "end": 1153.515,
    "text": " in terms of the dependence of certain kinds of affordance on convention, whereas others are more just dependent on the kind of spontaneous action biology of human bodies.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1153.976,
    "end": 1157.239,
    "text": "And then the second half of the paper turns to this concept of attention",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1157.919,
    "end": 1171.306,
    "text": " And with all this in place says, okay, so how is culture acquired in these, what we're calling regimes of attention, which are effectively shared patterns of allocating your attention to this rather than that as being salient.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1171.507,
    "end": 1178.51,
    "text": "So, and this all is, you can read this as kind of computational Goffman for Richard who's done, comes from sociology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1179.551,
    "end": 1182.913,
    "text": "Yet it's an attempt to kind of spell out how,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1183.813,
    "end": 1194.381,
    "text": " What would a mechanistic model of regimes of civic inattention and so on look like effectively when you're trying to bridge these different levels?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1195.242,
    "end": 1201.887,
    "text": "I think there's a lot in this paper, and this is a good kind of split point if you want to see what the paper is doing effectively.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1204.079,
    "end": 1210.602,
    "text": " nice, very helpful for us because it just reads as a Turing tape to those who are reading it line by line.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1210.702,
    "end": 1213.903,
    "text": "But to know that there's a conceptual demarcation is helpful.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1214.603,
    "end": 1219.966,
    "text": "And regimes of attention I just think is a great term to capture it because it's kind of like saying, well, where's the regime?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1220.446,
    "end": 1221.866,
    "text": "It's everywhere and it's nowhere.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1221.986,
    "end": 1225.608,
    "text": "It just is the water that culture is existing within.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1226.668,
    "end": 1232.851,
    "text": "In this section, we have figure six of a diagram of the looping effects or the rolling loops.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1233.652,
    "end": 1235.755,
    "text": " that mediate cultural affordance learning.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1237.056,
    "end": 1245.227,
    "text": "There's a discussion of skilled intentionality and affordance competition with some nice citations to other work about the skilled intentionality framework.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1246.428,
    "end": 1248.651,
    "text": "There's a section on shared expectations",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1249.201,
    "end": 1251.702,
    "text": " local ontologies and cultural affordances.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1252.242,
    "end": 1264.824,
    "text": "And we think a lot about ontologies here and about the words that we use to locally organize our thought and cultures, this kind of multi-scale ontology that helps organize stimuli in a sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1266.105,
    "end": 1270.485,
    "text": "And the section closes with a discussion of shared expectation and implicit learning.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1271.326,
    "end": 1277.827,
    "text": "Then the last section, major section of the paper is the regimes of shared attention and shared intentionality.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1278.755,
    "end": 1288.937,
    "text": " Reflecting gating abilities and affordances and moving the loop regimes of shared attention and skilled intentionality before a conclusion.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1289.257,
    "end": 1291.457,
    "text": "So that is the roadmap.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1291.837,
    "end": 1299.299,
    "text": "That's how you get from discussion of the ecological, psychological or behavioral inactive concept of an affordance.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1300.139,
    "end": 1302.499,
    "text": "Then into the neuroscience of affordances.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1303.019,
    "end": 1307.38,
    "text": "And then, as suggested by Maxwell, there's a bit of a intermission conceptually here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1307.91,
    "end": 1316.952,
    "text": " before turning to a second half of the paper that has to do with the actual ways in which culture is scaffolded through these regimes of expectations and attention.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1317.812,
    "end": 1319.373,
    "text": "Any questions on the roadmap?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1321.933,
    "end": 1322.133,
    "text": "Cool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1323.234,
    "end": 1323.494,
    "text": "All right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1323.874,
    "end": 1333.656,
    "text": "Here we are in the abstract, which I often find helpful to read because I know that authors put a lot of care into the abstract because it represents two",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1334.471,
    "end": 1341.997,
    "text": " in-group, to the field, as well as to the out-group, to the reviewers, to the editor, to the reader, it reflects what the paper is going to be about.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1342.338,
    "end": 1349.043,
    "text": "And people get surprised and even disappointed when the abstract is off-base relative to what the paper actually delivers on.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1350.244,
    "end": 1359.132,
    "text": "They write, in this paper, we outline a framework for the study of mechanisms involved in the engagement of human agents with cultural affordances, which we're going to define soon.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1360.003,
    "end": 1366.348,
    "text": " Our aim is to better understand how culture and context interact with human biology to shape human behavior, cognition, and experience.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1367.349,
    "end": 1377.577,
    "text": "We attempt to integrate several related approaches in the study of the embodied, cognitive, and affective substrates of sociality and culture and the socio-cultural scaffolding of experience.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1378.999,
    "end": 1380.54,
    "text": "That's the first half of the abstract.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1381.26,
    "end": 1388.086,
    "text": "Then they write, the integrative framework we propose bridges cognitive and social sciences to provide",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1388.613,
    "end": 1392.736,
    "text": " One, an expanded concept of affordance that extends to sociocultural forms of life.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1393.077,
    "end": 1404.286,
    "text": "And two, a multi-level account of the socioculturally scaffolded forms of affordance learning and the transmission of affordances in a pattern of sociocultural practices and regimes of shared attention.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1405.367,
    "end": 1414.414,
    "text": "The framework provides an account of how cultural content and normative practices are built on a foundation of contentless basic mental processes, definitely something we'll return to,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1415.145,
    "end": 1422.766,
    "text": " that acquire content through immersive participation of the agent and social practices that regulate joint attention and shared intentionality.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1424.227,
    "end": 1424.527,
    "text": "Okay.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1425.187,
    "end": 1429.448,
    "text": "Any thoughts on the abstract or questions before we turn to the box?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1432.368,
    "end": 1432.568,
    "text": "Cool."
  },
  {
    "start": 1433.728,
    "end": 1441.43,
    "text": "Well, box one, I thought it would be helpful just to list out the terms of the different types of affordances, then go through them.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1441.57,
    "end": 1442.71,
    "text": "What is an example?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1443.228,
    "end": 1447.95,
    "text": " of each of these kinds of affordances, or what are the differences between these types of affordances?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1448.271,
    "end": 1449.451,
    "text": "So maybe we could start there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1449.591,
    "end": 1459.456,
    "text": "If someone could raise their hand and pick one of these types of affordances, natural, cultural, or conventional, and then define what it means to them or an example of it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1465.68,
    "end": 1466.28,
    "text": "Yep, Maxwell.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1468.488,
    "end": 1477.385,
    "text": " Well, essentially what we're suggesting is that, well, cultural affordances, by the way, I just noticed that my camera's frozen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1477.465,
    "end": 1478.868,
    "text": "Is that the case for everyone as well?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1479.773,
    "end": 1480.813,
    "text": " Your screen looks dark.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1481.073,
    "end": 1484.754,
    "text": "You can either toggle the camera on and off or just reload the page.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1486.955,
    "end": 1491.616,
    "text": "After talking, I might try to rejoin just so the camera freezes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1491.636,
    "end": 1507.619,
    "text": "What we're essentially arguing is that in humans, all affordances are at least minimally cultural in the sense that, I don't know about you, but as I was growing up, my mother told me not to slouch while I was at the dinner table.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1509.14,
    "end": 1516.751,
    "text": " And so something as simple and natural as sitting does actually come with a cultural scaffold.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1517.211,
    "end": 1520.496,
    "text": "And what we're saying is that there's basically a spectrum of affordances.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1521.405,
    "end": 1546.073,
    "text": " you can think about the space of affordances with which humans interact as going on a kind of continuum from natural to conventional, where natural affordances depend mainly just on the biophysics of the human body in its interaction with the environment, whereas conventional affordances depend on these implicit or explicit sets of conventions or shared beliefs",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1547.414,
    "end": 1552.837,
    "text": " So, you know, an example of the latter would be a king's throne, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1552.917,
    "end": 1556.9,
    "text": "You don't sit on the king's throne unless you're a very specific agent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1558.001,
    "end": 1566.626,
    "text": "So a king's throne doesn't afford sitting for everyone in the same way that, say, just a chair or a stool might afford sitting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1567.547,
    "end": 1573.571,
    "text": "There are conventions, shared conventions, that kind of structure",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1574.46,
    "end": 1579.164,
    "text": " which affordances are available and which are not for a given agent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1581.426,
    "end": 1581.666,
    "text": "Cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1582.126,
    "end": 1582.426,
    "text": "Richard?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1583.207,
    "end": 1583.767,
    "text": "Yeah, I was just curious.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1583.788,
    "end": 1588.491,
    "text": "I've heard literature in the neuroscience about, like, actually distinguishing that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1588.551,
    "end": 1595.437,
    "text": "So if I see a cup, my mirror neuron system fires, and I begin to kind of enact the act of reaching out and grabbing it.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1595.777,
    "end": 1599.0,
    "text": "But then semantically I know that, you know, as a –",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1599.98,
    "end": 1602.361,
    "text": " a lowly serf, I'm not allowed to touch that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1602.381,
    "end": 1616.105,
    "text": "Is there actually any research showing the conflict between semantic knowledge about, you know, and self-related knowledge that I'm not allowed to do that with the automatic kind of reaching out mirror neuron system simulation of touching the cup?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1617.966,
    "end": 1618.666,
    "text": "That's really interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1618.706,
    "end": 1619.246,
    "text": "I'm not sure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1619.906,
    "end": 1623.548,
    "text": "I don't know if there's any data about this particularly.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1623.748,
    "end": 1625.068,
    "text": "It would be very interesting, though.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1625.962,
    "end": 1633.005,
    "text": " One thought I had was some experiments, I believe by Michael about an elk with hands grasping cups at incorrect ways.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1633.505,
    "end": 1636.907,
    "text": "So it was something when your mirror neurons see, oh, that's not how you're supposed to grab a cup.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1636.927,
    "end": 1637.447,
    "text": "Well, why not?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1637.787,
    "end": 1641.028,
    "text": "Well, because I can't rotate my wrist again to drink it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1641.148,
    "end": 1648.491,
    "text": "So it's the wrong way to hold it because it's not really a cup of water if I can't drink from it in that functional affordance-based sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1648.852,
    "end": 1652.113,
    "text": "But I agree, it would be interesting and we'll follow up on that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1652.433,
    "end": 1654.274,
    "text": "And Stephen, did you have any thoughts?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1655.58,
    "end": 1676.768,
    "text": " Yeah, I actually had a workshop when I was working with a group with a disability who, and I mentioned about affordances as part of it, and partly having done this paper, and one of the participants, she was saying how when she sees a cup, because she can't pick it up, and she doesn't see it as a cup unless it's one that's got a handle that she can reach her hand into and do that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1676.968,
    "end": 1680.609,
    "text": "So that kind of sense of things presenting is quite true.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1680.629,
    "end": 1682.87,
    "text": "And I like this breakdown because",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1684.351,
    "end": 1707.569,
    "text": " i get a sense that the following on from the later work that maxwell did like natural affordances it's like you know if there's a cliff it doesn't afford me to walk any further whereas cultural is a bit more of like this mixing sort of a gothic kind of space where it's conventional is like the throne it's like it's not up for negotiation it's like you don't sit on the chair it's like a fixed rule there's no",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1708.47,
    "end": 1711.512,
    "text": " kind of intersubjective piece going on.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1711.632,
    "end": 1718.376,
    "text": "So in some ways, the cultural piece seems to have some sort of negotiation associated with it, which is quite cool.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1719.197,
    "end": 1732.925,
    "text": "Would it be accurate to say that in a sense of if I had the simulation to reach out and grab the cup, but then my semantic memory says, no, we're not allowed to do that, could that almost be like a prediction error in the sense of like, I'm predicting that I'm going to do this?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1732.985,
    "end": 1734.146,
    "text": "Well, no, we don't do that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1734.166,
    "end": 1734.606,
    "text": "Precisely.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1735.166,
    "end": 1745.313,
    "text": " And the way that you would do that is probably by having a hierarchical model where basically the notion of hierarchy, I mean, it has political implications and we can kind of ditch those.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1746.434,
    "end": 1750.057,
    "text": "So I prefer thinking about it in terms of center and periphery.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1750.577,
    "end": 1750.777,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1750.837,
    "end": 1751.478,
    "text": "Where like the.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1751.977,
    "end": 1756.56,
    "text": " The periphery is the end of it that's closer to the sensory motor interactions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1756.64,
    "end": 1765.325,
    "text": "And the center is something more like what we would think of as the top of a processing hierarchy, where representations are progressively more compressed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1767.529,
    "end": 1779.013,
    "text": " If you look at the hierarchy from periphery to center or from bottom to top, what you have represented there, if you'll allow me the language of representation for a second, we can finesse it later.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1779.053,
    "end": 1788.016,
    "text": "But what's essentially represented there is as you progress towards the center, slower and slower, more and more abstract regularities.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1789.216,
    "end": 1791.637,
    "text": "So you might think that, yeah, as you see the chair,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1792.416,
    "end": 1799.46,
    "text": " at a kind of more automatic kind of sensory motor level, you see it as something that you could sit on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1799.94,
    "end": 1809.126,
    "text": "But as that ascends the processing hierarchy, at some point it registers an error, as in like semantically I'm not allowed to sit on this because it's a king's chair.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1810.106,
    "end": 1811.767,
    "text": "So precisely that's how that would work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1812.127,
    "end": 1817.951,
    "text": "And you can accommodate for this kind of conflict by allowing the system to have a layered or hierarchical structure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1819.371,
    "end": 1820.392,
    "text": "And great.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1820.964,
    "end": 1824.807,
    "text": " point, and this relates to how it's a spectrum of affordances.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1825.308,
    "end": 1833.114,
    "text": "So for example, a violin, when I look at a violin, I have the biophysics to bend my fingers, but I can't play violin.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1833.555,
    "end": 1839.46,
    "text": "So I see an affordance for something I could pick up potentially, and not everybody may see that affordance.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1839.84,
    "end": 1845.605,
    "text": "However, somebody else sees that and culturally they think, oh, I could play this song or I could play that song.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1846.041,
    "end": 1857.645,
    "text": " And so what song they see the device as being able to be used for is going to be part of their enculturation, part of their education, which builds upon the biophysics of the human body.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1858.246,
    "end": 1866.209,
    "text": "And that's why we have different dance styles in different places from different cultures, even though everybody's elbows still move the same way.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1866.529,
    "end": 1866.769,
    "text": "Sasha?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1870.563,
    "end": 1871.344,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1872.124,
    "end": 1878.949,
    "text": "So in trying to understand affordances, I tend to think of it as the space of what is allowed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1879.589,
    "end": 1888.456,
    "text": "But in walking through the different kinds of affordances that we have, it becomes pretty clear that it's not just what is allowed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1888.576,
    "end": 1895.06,
    "text": "It's very strongly gated by the top-down priors of what you think should be allowed in your space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1895.781,
    "end": 1897.522,
    "text": "And it just kind of reminds me of this...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1898.903,
    "end": 1922.755,
    "text": " an anecdotal understanding of how children interact with an environment versus adults and how children would use or sit on objects that adults would never think of sitting on and kind of the different ways that they see and use the world because they don't have these top-down priors of what one should and should not do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1924.71,
    "end": 1936.136,
    "text": " And so that's a nice way of kind of circling back to the point of this paper that everything is embedded in culture and you don't just start from kind of the biophysics of sitting and work your way up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1938.378,
    "end": 1940.098,
    "text": "You're always going back and forth with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1941.139,
    "end": 1942.5,
    "text": "This is such a great point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1942.54,
    "end": 1945.321,
    "text": "Thank you for pointing that out, Sasha.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1945.341,
    "end": 1950.884,
    "text": "Like the agenda here is to pursue this kind of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1952.597,
    "end": 1972.062,
    "text": " excuse me, this kind of cooperative turn in the anthropology literature, which is to say that as Joseph Henrich, who's one of my favorite anthropologists slash psychologists out there, as he puts it, we've crossed the evolutionary Rubicon in a way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1973.242,
    "end": 1978.924,
    "text": "Our survival as humans depends on our ability to reliably access and use",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1980.151,
    "end": 1982.852,
    "text": " stored cultural information effectively.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1983.893,
    "end": 1987.554,
    "text": "And that's had an influence on the way that our biology has evolved.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1987.674,
    "end": 1992.196,
    "text": "So, you know, compared to chimps, for example, we have really weak digestive juices.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1993.317,
    "end": 2000.52,
    "text": "And that's because we've been able to offload the metabolic cost of, you know, having this extremely elaborate digestive system",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2002.007,
    "end": 2027.527,
    "text": " uh to our technology effectively you know so tool use the use of fire cooking technology has allowed us to process food in a way that then co-evolves with our bodies and takes the kind of processing load of the food off the body itself towards these cultural artifacts and practices that have co-evolved with our biology and that's really the the point is that uh all human affordances are cultural affordances",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2028.123,
    "end": 2031.284,
    "text": " which exist on a spectrum from more natural to more conventional.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2031.324,
    "end": 2040.245,
    "text": "But human biology is a cultural biology, and yeah, culture is a biological phenomenon.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2040.485,
    "end": 2044.366,
    "text": "I think that the two are kind of irreconcilably joined in the case of humans.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2045.506,
    "end": 2051.187,
    "text": "And I'll build on that to describe the difference between the field and the landscape of affordances.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2051.387,
    "end": 2056.488,
    "text": "Sorry, I meant insurmountably or irreducibly joined, not irreducibly.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2057.779,
    "end": 2058.239,
    "text": " Yeah, sorry.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2059.059,
    "end": 2059.699,
    "text": "Oh yeah, no worries.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2060.2,
    "end": 2067.381,
    "text": "So the field of affordances are the affordances in the landscape with which the organism can dynamically cope and intelligently adapt.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2067.721,
    "end": 2069.602,
    "text": "So that's at an organismal level.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2069.622,
    "end": 2071.922,
    "text": "The field of affordances is like the field of play.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2072.022,
    "end": 2073.983,
    "text": "It's the field of action for that agent.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2074.623,
    "end": 2081.564,
    "text": "The landscape of affordances, on the other hand, like the landscape exists beyond me, even when I can't interact with it directly.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2081.924,
    "end": 2084.385,
    "text": "And similarly, the landscape of affordances",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2085.222,
    "end": 2090.945,
    "text": " is defined here as the total ensemble of available affordances for a population in a given environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2091.466,
    "end": 2102.952,
    "text": "And so the concept of chair, just as Sasha was bringing up, the landscape of affordances of chairs includes things for little people, for tall people, for people with small hands, for larger hands,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2103.291,
    "end": 2112.514,
    "text": " The landscape of affordances is at the population level, which means it includes all these differences that are biophysical and developmental and cultural as well.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2112.894,
    "end": 2116.876,
    "text": "So the field is what one individual agent is able to interact with.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2117.276,
    "end": 2120.997,
    "text": "And that's sort of where the rubber hits the road of action oriented frameworks.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2121.517,
    "end": 2129.26,
    "text": "And then when we pull back a level to this evolutionary perspective on action oriented frameworks, we get to this landscape of affordances idea.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2130.0,
    "end": 2131.401,
    "text": "Any thoughts on that?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2135.629,
    "end": 2135.889,
    "text": " Yes, Stephen?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2137.349,
    "end": 2156.354,
    "text": "Yeah, I think that that way that things are embedded, it comes back to that piece with the throne as well, is where that chair is, for it to be ascribed as a throne that you don't sit on, is partly processed by what's going on around in that setting at that moment.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2156.554,
    "end": 2162.375,
    "text": "Like if there's no one around and it's an empty room, you may sit on the chair if you don't think anyone's going to see you.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2163.015,
    "end": 2173.798,
    "text": " but when the cultural kind of rules of the game are in play, or if you see, you know, if it was a room where there was only children in there compared to a room where there was an adult watching.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2174.238,
    "end": 2181.24,
    "text": "So there's this kind of negotiation going on, which is quite complex.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2181.54,
    "end": 2190.622,
    "text": "And I think previously without free energy, I don't think there was a way to be able to take that many different parameters and sort of integrate them.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2192.895,
    "end": 2193.155,
    "text": " Richard?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2193.935,
    "end": 2207.778,
    "text": "Yeah, I think what's really fascinating too when we talk about this is that the role of language and the role of imitation and the role of just watching other people where I can walk into a room and know absolutely nothing about the norms, values, and beliefs that constrain it.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2208.178,
    "end": 2213.059,
    "text": "But if somebody just tells me four or five words, they can immediately bring me up to speed.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2213.479,
    "end": 2220.021,
    "text": "And to use the terminology that Sasha was using earlier, those top-down priors, I can gain a lifetime of experience",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2220.642,
    "end": 2226.035,
    "text": " in 2,500 words and watching four or five people seeing who's rewarded, who's punished.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2226.476,
    "end": 2226.957,
    "text": "And I think that",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2228.638,
    "end": 2240.226,
    "text": " I'm curious to see, and we don't have to talk about this now, but just rhetorically, I'm curious to see how can you take in that notion of symbolic communication and quickly affect somebody's prior understanding of the situation?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2240.627,
    "end": 2245.991,
    "text": "How do you fit that into a network of free energy or agents running off this free energy principle?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2246.851,
    "end": 2250.334,
    "text": "Is there a synchronization of oscillators on a network?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2250.394,
    "end": 2253.076,
    "text": "How exactly do you model that process?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2254.318,
    "end": 2264.423,
    "text": " Yeah, I'm just imagining you're walking with somebody to a meeting and right before they open the door to reduce your uncertainty about what's behind the door, they say, hey, it's going to be tense in there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2265.043,
    "end": 2267.724,
    "text": "Or just so you know, it's a non-smoking room.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2268.185,
    "end": 2283.912,
    "text": "And just like you're saying, with four or five words, the way that that person unpacks those words symbolically and the way that that communication channel is utilized to attune the agents on a narrative level, that's what dictates how well",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2284.451,
    "end": 2288.933,
    "text": " the scene is going to go when the room is actually being enacted.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2289.473,
    "end": 2298.197,
    "text": "And so there's so much that we tell each other when we're leading into events that does set the tune and that has to be unpacked within each person's own perspective.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2299.057,
    "end": 2302.778,
    "text": "And also one bonus word that's not here, but umwelt.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2303.059,
    "end": 2305.68,
    "text": "Does anyone have a sense of what that means?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2305.74,
    "end": 2309.041,
    "text": "But I figured I'd just throw it out there as a sort of compliment to affordance.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2310.421,
    "end": 2325.404,
    "text": " Well, if I can just comment on Richard's point before getting to Ungveld, I think the way that you can understand it from a free energy perspective is, I mean, Andy Clark, I think, and Andris Robstorf have called this top-top effect.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2326.221,
    "end": 2339.031,
    "text": " So basically passing information from the top or the center of one's hierarchy to the top of another directly through these kinds of linguistic tokens that we're exchanging.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2339.191,
    "end": 2342.433,
    "text": "I think that's a powerful intuition.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2342.974,
    "end": 2347.497,
    "text": "What we've done in more recent work is extend that to a kind of horizontal top",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2348.174,
    "end": 2360.944,
    "text": " kind of communication where it's literally the shared physical structure of the niche, whether it's in terms of shared artifacts, like stories that we create and share with one another.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2360.964,
    "end": 2374.655,
    "text": "So these, effectively, these parts of models that are offloaded onto the physical structure of the environment can also come and have these kind of top-down structuring effects where we're",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2375.63,
    "end": 2382.754,
    "text": " we're effectively installing shared environmental priors into the top levels of our hierarchy through enculturation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2386.296,
    "end": 2386.536,
    "text": "Nice.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2386.756,
    "end": 2387.977,
    "text": "And how about Maxwell?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2387.997,
    "end": 2389.097,
    "text": "What's your take on Unveiled?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2389.817,
    "end": 2403.685,
    "text": "I mean, I think, you know, so I think those of us, you know, working in more specifically on ecological psychology will have some beef with the way that I kind of just generally put all of this together.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2403.705,
    "end": 2404.285,
    "text": "But I think like,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2405.142,
    "end": 2433.259,
    "text": " affordances, umwelts, phenomenology, and I'm sure many people are not going to agree with me, so feel free to discuss this, but they're all perspectives on the same kind of thing, which is that if we're trying to talk about the meaning-making of organisms, living organisms that share a world, we can't just not talk about the first-person perspective and the way that meaning appears from a specific vantage point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2434.023,
    "end": 2442.266,
    "text": " And that's sort of what the affordances and Umwelt stuff gets at and effectively what we tried to do in this paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2442.286,
    "end": 2451.69,
    "text": "And that's why I think it's a kind of contribution to the broader project of neuro phenomenology is we start from the kind of first person perspective.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2452.15,
    "end": 2454.371,
    "text": "So we were kind of trying to cash out some",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2455.387,
    "end": 2460.049,
    "text": " some subtle social effects like enculturation in terms of learning affordances.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2460.429,
    "end": 2471.793,
    "text": "And then we ask the question, well, what's going on under the hood and as it were around the hood, uh, for that kind of affordance story to be cashed out in mechanistic terms.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2472.873,
    "end": 2477.975,
    "text": "Uh, so umwelt is a term, uh, by a biologist, I think it's pronounced von Ushkul.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2478.995,
    "end": 2479.536,
    "text": "Uh, yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2479.556,
    "end": 2480.796,
    "text": "And he, uh,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2481.67,
    "end": 2492.036,
    "text": " I mean, it's essentially, it's very close to the affordances story, although it's more directly centered on the perspective of the organism.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2492.177,
    "end": 2498.861,
    "text": "I mean, so Gibsonians, I should say, like, you know, the ecological psychology was introduced by, you know, J.J.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2498.901,
    "end": 2506.866,
    "text": "Gibson, the famous psychologist, and a lot of ecological psychologists take issue with our use of affordances here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2508.206,
    "end": 2518.17,
    "text": " I think for interesting reasons, for ecological psychologists, the idea is that perception is the direct perception of a possibility.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2519.23,
    "end": 2524.532,
    "text": "We're directly picking up information about our environment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2524.892,
    "end": 2529.774,
    "text": "They're trying to emphasize that we don't have to go through this elaborate inference process.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2530.216,
    "end": 2538.941,
    "text": " There's a sense in which we just directly read off the regularities in our sensory array, what is possible and what is doable.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2539.021,
    "end": 2544.384,
    "text": "And so in Gibson's original formulation, this is what affordances meant.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2545.265,
    "end": 2556.031,
    "text": "What we're doing is more drawing on Tony Camaro's reinterpretation of this concept as affordances 2.0, he calls it, where an affordance is a relation",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2556.804,
    "end": 2565.629,
    "text": " between some relevant features of the environment and skills ultimately, expectations and skills had by an organism.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2565.729,
    "end": 2570.911,
    "text": "So this is already a more inactive embodied reading of affordances.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2571.552,
    "end": 2579.896,
    "text": "And I mean, we've gotten into some very interesting disagreements with people from ecological psychology precisely about this difference in interpretation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2580.336,
    "end": 2594.525,
    "text": " So I say this because Umwelt is very much focused on this kind of affordances 2.0 perspective, where what we're trying to do is really capture what the world is like for the organism that inhabits it from its perspective.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2595.805,
    "end": 2602.97,
    "text": "This is also where I think it connects with phenomenology, which is also this kind of more systematic attempt to describe things from the first person perspective.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2604.471,
    "end": 2604.751,
    "text": "Great.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2605.811,
    "end": 2609.894,
    "text": "And that, okay, Alex first and then Shannon.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2611.556,
    "end": 2638.712,
    "text": " yeah thanks as usual i'm trying to connect to my domain is the engineering domain and it's more like a question about could we consider affordances from some kind of functionalities view as for example if i need to drive in a nail the hammer provides me affordance",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2640.846,
    "end": 2664.961,
    "text": " use it but if i don't have a hammer i could use even microscope to do the same only one or two times but anyway for my engineering task it could be enough and if i see a chair and it's providing affordance to sit it's like a basic function of the chair to to to sit on it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2666.124,
    "end": 2682.009,
    "text": " So from this perspective, how it could be considered like when agent need to do something and need some kind of functionality and this functionality or maybe service to do it, how it's possible link?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2682.909,
    "end": 2683.589,
    "text": "Oh, absolutely.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2683.729,
    "end": 2685.67,
    "text": "This has been pursued by a lot of work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2685.71,
    "end": 2689.611,
    "text": "There's a really cool group based in the Netherlands.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2691.216,
    "end": 2702.424,
    "text": " Eric Rydveld and Julian Kiverstein in particular work from this perspective where Eric Rydveld's work is in architecture and affordances.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2703.105,
    "end": 2710.05,
    "text": "So he really tries to bring this whole affordances perspective into the design of the spaces that we live in.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2710.851,
    "end": 2719.657,
    "text": "So what you're saying is totally consonant with at least some really interesting uses of the concept of affordances in the literature since the early 2000s.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2722.159,
    "end": 2722.479,
    "text": " Cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2722.559,
    "end": 2726.262,
    "text": "Shannon?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2726.422,
    "end": 2744.153,
    "text": "Yeah, so I'm just thinking of this field landscape difference and umwelt, and it's really helpful considering the perspective of the agent you're investigating, especially so I'm in music neuroscience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2744.673,
    "end": 2751.117,
    "text": "So we can learn a lot about how people or brains interact with music by putting a person in an fMRI scanner and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2751.769,
    "end": 2756.73,
    "text": " playing some music, but that's not exactly how we interact with music in our day-to-day life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2757.31,
    "end": 2769.293,
    "text": "Maybe now more so, because we can turn on our iPod and just, sorry, iPhone, we don't have iPods anymore, and listen to music alone as this solo endeavor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2769.493,
    "end": 2777.195,
    "text": "But in general, for the history of human evolution, music has been this really interactive participatory activity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2777.455,
    "end": 2779.356,
    "text": "And in order to understand",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2781.081,
    "end": 2790.563,
    "text": " from where I am, how we interact with, understand, or process music, it really is also a question of how we understand and interact with other people.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2791.264,
    "end": 2803.987,
    "text": "And so when we bring in these affordances, we can have an affordance for music in a certain field that's, you know, us listening to music alone, but as soon as the landscape is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2805.854,
    "end": 2822.507,
    "text": " is a little bit bigger and maybe our small field incorporates one other person or one more other person, then the perspective that we need to take needs to change to adapt the perspective of each of those individuals or of that musical sort of environment as a whole.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2824.069,
    "end": 2825.41,
    "text": "That's such a great point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2825.53,
    "end": 2830.494,
    "text": "I don't know if you're familiar with this paper that I just linked in the chat.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2830.654,
    "end": 2833.076,
    "text": "It's by Anna Anderson and Tom Zimke.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2834.155,
    "end": 2842.038,
    "text": " called Exploring the Multilayered Affordances of Composing and Performing Interactive Music with Responsive Technologies.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2842.638,
    "end": 2845.959,
    "text": "And it was one of the first papers to pick up our cultural affordances work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2846.58,
    "end": 2857.063,
    "text": "And in precisely the context that you're proposing, Shannon, like what they're saying is our concepts need to be enriched with a kind of intermediate scale concept.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2857.824,
    "end": 2861.325,
    "text": "So their idea is like when you're performing live electronic music,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2861.803,
    "end": 2885.533,
    "text": " there's something intermediary between the field of affordances that each individual is coping with at any moment and this evolutionary level kind of landscape of affordances or this population level landscape of affordances where there are special affordances that open up in this performance context, kind of a mesoscale",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2886.88,
    "end": 2910.978,
    "text": " in between the landscape and the field uh i forget the precise term that they that they introduced but uh yeah the music is definitely one of the cooler domains of application of this uh this stuff nice sorry great shannon and then just saying this is really great thank you cool sasha",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2912.205,
    "end": 2915.187,
    "text": " Yeah, just a brief comment to follow up on what Alex said.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2916.808,
    "end": 2920.59,
    "text": "From the engineering perspective, if you have a hammer, everything's a nail.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2921.11,
    "end": 2934.558,
    "text": "It kind of made me think about crime, where if you need something and you're not inhibited by law or social norms, you can just take it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2936.713,
    "end": 2943.298,
    "text": " And maybe that's an overly simplistic understanding of why people commit crime.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2943.419,
    "end": 2953.186,
    "text": "But in that context, if you're not inhibited by laws, then your affordances are quite different than if you are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2955.648,
    "end": 2956.529,
    "text": "OK, and perfect.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2956.589,
    "end": 2958.771,
    "text": "Richard, your comment?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2959.251,
    "end": 2962.054,
    "text": "Yeah, in terms of the field versus the landscape,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2963.197,
    "end": 2969.461,
    "text": " Would it be accurate to kind of conceptualize the field of forms as kind of the episodic knowledge of the individual?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2969.501,
    "end": 2982.268,
    "text": "So what are their personal learned experiences, their personal body capabilities, kind of this really episodic self form of memory, where landscape of performance is more about the semantic knowledge.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2982.889,
    "end": 2990.053,
    "text": "If there was a way for me to kind of look at the population and ask, what are all the skills and habits that this population has, that would be the landscape.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2990.093,
    "end": 2991.574,
    "text": "If I was to drill down on one person,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2992.094,
    "end": 2994.095,
    "text": " How well do you know how to ride a bike?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2994.316,
    "end": 2995.897,
    "text": "That would be more of your field of affordance.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2996.157,
    "end": 2996.577,
    "text": "Precisely.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2996.717,
    "end": 2997.818,
    "text": "That's precisely the idea.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2997.838,
    "end": 3005.143,
    "text": "And the idea also is that not all affordances are equally salient at a given time, but they're still there in a sense, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3006.544,
    "end": 3010.466,
    "text": "So I don't know.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3010.486,
    "end": 3011.487,
    "text": "24-7 coffee shop.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3011.807,
    "end": 3014.889,
    "text": "There's times a day where it's a salient affordance to some people.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3015.169,
    "end": 3019.852,
    "text": "Well, I was going to precisely give a food and coffee-related example.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3021.018,
    "end": 3027.96,
    "text": " Yeah, I drink coffee in the morning, but I tend to have insomnia if I drink it too late in the evening.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3028.32,
    "end": 3035.342,
    "text": "So there are times in the day when coffee affords drinking more than other times in the day.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3035.822,
    "end": 3042.304,
    "text": "And so it's still the case that at any moment I could go into the kitchen and make myself a coffee, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3043.284,
    "end": 3049.466,
    "text": "So the field of affordances has more to do with those affordances that are soliciting me at a given moment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3050.643,
    "end": 3066.108,
    "text": " you know, it corresponds to more the phenomenology of interacting with affordances, whereas the landscape is more an anthropological or sociological statement, as Richard, you were just saying, about the kinds of things that a population can do in a given space.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3067.197,
    "end": 3073.341,
    "text": " It's interesting that you talk about that idea of salience in the moment, because one thing we talk about a lot in sociology is identity.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3073.541,
    "end": 3084.088,
    "text": "And so if you activate my identity, prime me to think as a professor, I'm going to notice certain things in the environment differently than if you prime me to think of my identity as a husband or a son or a brother.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3085.229,
    "end": 3095.676,
    "text": "So that kind of, but then again, but identity means, you know, my identity as a professor may be different from any one of your identities as a professor based on socialization and culture and disciplines even as well.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3095.716,
    "end": 3095.936,
    "text": "Right.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3096.097,
    "end": 3096.217,
    "text": "So.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3096.957,
    "end": 3097.137,
    "text": " Okay.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3097.237,
    "end": 3097.558,
    "text": "Interesting.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3097.578,
    "end": 3097.898,
    "text": "Thank you.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3097.918,
    "end": 3098.399,
    "text": "Yep.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3098.699,
    "end": 3100.962,
    "text": "And just one paper to tie back.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3101.142,
    "end": 3111.914,
    "text": "They write as Heidegger famously argued, it is only when my smooth coping breaks down, say when I run out of coffee or when the cup breaks, that the objective properties, the cup becomes salient.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3112.321,
    "end": 3141.62,
    "text": " present in perceptual experience at all and depending on if you're at home you run out of coffee maybe you go back to the coffee machine you set up a new brew if you're in a restaurant culturally maybe you raise your hand or maybe you whistle or maybe there's some other thing that's done culturally to signal that somebody else should see that as their affordance to come over and ask you what you need so the landscape of affordances is a very role specific uh it's realized through specific roles but it represents that population level and that's",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3142.122,
    "end": 3143.583,
    "text": " So yeah, lots to say here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3143.623,
    "end": 3145.024,
    "text": "That was an excellent discussion.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3145.104,
    "end": 3152.369,
    "text": "Let's turn to these first two figures that are cartoons about basic cognitive formulas and a little bit more of a full formula.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3152.889,
    "end": 3159.233,
    "text": "So in this first three panel cartoon, I'll read out the captions and then maybe somebody can give an example or a thought.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3159.793,
    "end": 3169.44,
    "text": "The first caption is the person thinking, I think they think, I think the second panel says, what would others expect me to do here?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3170.1,
    "end": 3171.381,
    "text": "And the third panel says,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3171.923,
    "end": 3181.346,
    "text": " I inferred that they intend that I should think, feel, or do X. So what is a thought or an interpretation or a punchline to this cartoon?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3182.967,
    "end": 3186.208,
    "text": "What would mommy want me to do in this context?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3186.828,
    "end": 3194.551,
    "text": "And I think this is, sociality is kind of scaling that up to an anonymous kind of third",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3195.564,
    "end": 3209.493,
    "text": " or other or that is, you know, yeah, this kind of anonymous sociality is kind of scaling that, that kind of, you know, parental expectation thing up a bit.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3210.197,
    "end": 3210.497,
    "text": " Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3210.958,
    "end": 3212.459,
    "text": "It's like peer pressure made me do it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3212.579,
    "end": 3214.64,
    "text": "Well, did they move your joints for you?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3214.7,
    "end": 3216.582,
    "text": "Well, no, but people expected me to do it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3216.882,
    "end": 3220.825,
    "text": "Well, just because they expected you to do it, even if that's true, why did you do it?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3221.245,
    "end": 3222.606,
    "text": "And it comes back to this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3222.706,
    "end": 3230.932,
    "text": "That is an account of what peer pressure is from this perspective, even if the actual biophysics of the joints are not being pushed by other people.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3231.192,
    "end": 3237.417,
    "text": "And the point that we're making here, I mean, it's really developed in our BBS paper, Thinking Through Other Minds, but that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3237.957,
    "end": 3244.54,
    "text": " It's that human thinking really is not just thinking about other humans, but thinking through their own perspective.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3246.12,
    "end": 3258.505,
    "text": "And that much of our social interactions actually are structured by the beliefs that we have about other people's beliefs about our own behavior and beliefs.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3259.545,
    "end": 3264.487,
    "text": "So you get this kind of nicely recursive intentionality structure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3264.507,
    "end": 3265.627,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3267.526,
    "end": 3271.988,
    "text": " So that's like the simple kind of, you know, the basic cognitive formula that we're calling it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3272.028,
    "end": 3276.171,
    "text": "But we think that this really applies to almost all human thinking.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3277.631,
    "end": 3294.16,
    "text": "We're really always kind of trying to understand a situation from the perspective of, you know, shared beliefs about what's appropriate in that situation, which implies the ability to kind of perspective take and to think through the minds of others.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3295.543,
    "end": 3295.723,
    "text": " Yep.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3296.103,
    "end": 3303.346,
    "text": "When someone's talking to hear themselves talk, as we say, it's off the rails because it's not in feedback with other minds.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3303.887,
    "end": 3324.015,
    "text": "But when somebody is attuned to the narrative and the culture of the local world, the local actual interaction, not just the hypothetical, then there's the opportunity for communication to be targeted and direct and actually move towards shared goals and under shared values as well.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3324.525,
    "end": 3330.01,
    "text": " instead of just individuals biophysically running their mouth, which is an affordance that we also have.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3330.47,
    "end": 3340.719,
    "text": "So how do we move our communication patterns towards this higher level instead of just using the opportunities that we know that we can also have?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3342.28,
    "end": 3343.401,
    "text": "Any other thoughts on figure one?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3343.461,
    "end": 3344.462,
    "text": "Figure two is related.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3347.984,
    "end": 3356.833,
    "text": " Yeah, one thing I was going to say as well is that we talk a lot about perspectivism and we go up to higher and higher levels.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3356.853,
    "end": 3363.259,
    "text": "But I think you see a point at which you can only take a perspective on what you think to a certain level.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3363.279,
    "end": 3367.143,
    "text": "It gets too complex, too multisensory, too many inputs.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3367.984,
    "end": 3378.05,
    "text": " And it is that kind of phenomenological embodied feel for what you need to do, which is not something you even have a perspective on, that idea of the flow.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3378.07,
    "end": 3388.095,
    "text": "So there's this inferential kind of approach as well as a perspectival approach, which just comes from just feeling what you should do.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3388.115,
    "end": 3393.058,
    "text": "And I think this kind of shows that because I think you can only go up so far",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3393.758,
    "end": 3398.041,
    "text": " and take perspectives on things when how you act in the moment.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3398.081,
    "end": 3400.742,
    "text": "Sometimes you just have to be there and feel it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3402.143,
    "end": 3406.306,
    "text": "Yeah, and we can't perfectly emulate what somebody else wants.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3406.406,
    "end": 3408.087,
    "text": "And it's just not that simple.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3408.327,
    "end": 3411.789,
    "text": "We're in the bodies that we have with the affordances that we see.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3412.35,
    "end": 3421.115,
    "text": "And so to try to over-engineer what the other person wants or should want or should want to want, it's a good thought experiment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3421.528,
    "end": 3425.231,
    "text": " and it helps in a lot of situations, but it is not the end game of relating.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3425.892,
    "end": 3431.777,
    "text": "Well, it might also explain some of the difficulties that we're having currently in our political landscape.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3432.906,
    "end": 3459.441,
    "text": " uh so i mean as a as a canadian i'm very sold on the idea of multiculturalism and diversity and pluralism but i think these are not intuitive modes of sociality precisely because they oblige us to multiply the different perspectives through which we're trying to you know relate to a shared social world and you know like",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3461.188,
    "end": 3462.709,
    "text": " Things like Dunbar's number.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3462.949,
    "end": 3465.83,
    "text": "I'm sure you're all familiar with Dunbar's number, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3466.17,
    "end": 3473.093,
    "text": "If you basically plot the size of primate brains against the size of their social groups, there's almost a linear relation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3473.513,
    "end": 3477.874,
    "text": "And if you extrapolate that to humans, we would live in groups of about 100, 150-ish.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3477.954,
    "end": 3484.897,
    "text": "And that probably has a lot to do with the kind of sweet spot where it's easy to kind of share",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3491.904,
    "end": 3504.026,
    "text": " a bunch of beliefs and norms and patterns of behavior with the group, and things get more and more complicated as the group expands and diversity is included, which is not to say that diversity is a bad thing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3504.066,
    "end": 3507.647,
    "text": "By all means, I think we should move in that direction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3509.527,
    "end": 3516.448,
    "text": "But I think it speaks to some difficulties that we're seeing politically, that it's not an intuitive mode of sociality.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3519.589,
    "end": 3519.829,
    "text": "Cool.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3520.779,
    "end": 3522.44,
    "text": " We'll return to that when we can.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3523.281,
    "end": 3530.926,
    "text": "And here in figure two, we're almost rephrasing figure one a little bit more from an improvisational perspective.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3531.646,
    "end": 3536.369,
    "text": "So the left panel, the person is thinking, how much can I improvise here?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3537.03,
    "end": 3541.673,
    "text": "The middle panel is, what do I know they know about me right now?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3542.493,
    "end": 3545.055,
    "text": "And how much room to improvise does that give me?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3545.075,
    "end": 3549.118,
    "text": "And the third panel reads, how much can I improvise here",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3549.622,
    "end": 3552.845,
    "text": " given what the local cues tell me about what others expect?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3553.525,
    "end": 3555.927,
    "text": "So a lot to say and think.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3555.967,
    "end": 3559.53,
    "text": "There's probably other ways that these recursive questions could be formulated.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3559.911,
    "end": 3565.135,
    "text": "But is there anything that we haven't addressed in one that people might want to address here?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3568.678,
    "end": 3568.938,
    "text": "Cool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3569.038,
    "end": 3570.92,
    "text": "This just reminded me of fellow Jitser.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3571.3,
    "end": 3571.54,
    "text": "Yes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3577.265,
    "end": 3577.465,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3579.713,
    "end": 3588.555,
    "text": " I was thinking that maybe in the adolescent period, we are kind of rebels.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3588.756,
    "end": 3590.876,
    "text": "We are rebels against society.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3591.396,
    "end": 3602.139,
    "text": "And trying to find our identity, maybe in other words, minimizing our self-prediction errors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3602.639,
    "end": 3607.581,
    "text": "So we are trying to test these norms",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3609.045,
    "end": 3610.687,
    "text": " by being a rebel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3611.047,
    "end": 3624.222,
    "text": "So actually by inferring what others intend that I should think and feel, maybe if I do the contrary, I'm going to learn something about me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3624.863,
    "end": 3629.348,
    "text": "So how can we deal with this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3630.376,
    "end": 3644.483,
    "text": " like landscape affordances and cultural affordances or even what our mom is saying and what we are really trying to find out about ourselves.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3645.663,
    "end": 3645.883,
    "text": "Nice.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3646.023,
    "end": 3648.845,
    "text": "Maxwell.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3650.205,
    "end": 3653.687,
    "text": "Well, yeah, so I thought that was very insightful.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3654.147,
    "end": 3655.568,
    "text": "Thank you very much for that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3655.788,
    "end": 3657.329,
    "text": "Very, very interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3657.969,
    "end": 3659.57,
    "text": "Well, I would have just added that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3659.977,
    "end": 3670.945,
    "text": " So the point here is to kind of say, well, it's not merely just about inferring what others think I should do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3671.245,
    "end": 3674.768,
    "text": "It's really more about the situational coping, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3675.888,
    "end": 3679.271,
    "text": "So it's about learning different contexts.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3680.251,
    "end": 3694.583,
    "text": " and learning about what's allowable in all of these different contexts, and then being able to juggle that and to reactivate the right constellation of, you know, semantic knowledge, for example, or rules and norms that pertain to each context.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3695.524,
    "end": 3707.994,
    "text": "And, and also then, you know, moving from one context to the next and seeing what kind of flexibility that allows for ultimately, uh, because you know, human reality is improvisational.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3708.254,
    "end": 3709.075,
    "text": "Like it's,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3709.802,
    "end": 3719.926,
    "text": " It's about coping with a situation given the constraints of that situation in real time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3719.946,
    "end": 3721.046,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3722.047,
    "end": 3726.328,
    "text": "Yeah, it's a controlled novelty question, like a lot of improvisation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3726.608,
    "end": 3733.591,
    "text": "It's on the edge, the bleeding edge and the trade-off between explore and exploit, where successful systems are at.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3734.071,
    "end": 3738.833,
    "text": "And so the teenage rebellion, if the teenagers just mindlessly",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3739.372,
    "end": 3747.919,
    "text": " fell into the line of whatever was happening before, maybe in some niche that was unchanging, that would be a successful evolutionary strategy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3748.279,
    "end": 3756.586,
    "text": "But the niches are always changing, not for the least of which is ecology, but also improvisation has this always moving dynamic.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3756.946,
    "end": 3765.373,
    "text": "And so the teenage rebelliousness is there's the element of the individual coming to precision about who am I and who am I in this broader sense?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3765.793,
    "end": 3768.796,
    "text": "And then at the higher level, there's this explore, exploit,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3769.244,
    "end": 3783.009,
    "text": " where some element of contrarianism, it comes across like a negative word, but if you'd ever had contrarian models, then you couldn't know if you were just in a very, very local optima or whether there are other realms to explore.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3783.77,
    "end": 3796.574,
    "text": "So there's so much there, and the details are all in actually formulating these specific situations and understanding what are the affordances, what is precision doing here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3796.855,
    "end": 3797.775,
    "text": "So maybe in...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3798.3,
    "end": 3803.244,
    "text": " The next bit, we can pretty briefly look through the figures three, four, and five.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3804.485,
    "end": 3808.768,
    "text": "Maxwell, it will be helpful to have your perspective on these, but let's start with three.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3809.729,
    "end": 3815.474,
    "text": "Figure three is a hierarchical prediction error minimization framework.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3815.854,
    "end": 3819.457,
    "text": "Maxwell, maybe could you give a shot on what was being summarized here?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3819.957,
    "end": 3821.379,
    "text": "Sure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3821.419,
    "end": 3825.602,
    "text": "We're just describing Bayesian predictive coding here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3827.498,
    "end": 3849.565,
    "text": " most predictive coding schemes are hierarchical as we were just discussing above where basically what I mean this is more explained in I think figure four or five but essentially what this figure in particular is supposed to illustrate is the kind of bi-directional message passing that's implicit in all of this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3850.931,
    "end": 3860.954,
    "text": " As we were discussing, you know, the top or the center is where the more kind of abstract or slow regularities are represented.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3861.434,
    "end": 3875.779,
    "text": "And they effectively, the top layers provide context for the bottom layers in the same way that slow regularities provide the context or the embedding against which, you know, faster regularities unfold.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3876.119,
    "end": 3878.56,
    "text": "Well, these slower regularities or priors",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3879.02,
    "end": 3900.329,
    "text": " uh provide context for the the ones below so what you have descending or you know coming from the center to the periphery is effectively predictions about the kind of data that each subsequent lower layer should be receiving and the way these schemes work is i think consonant with the phenomenology",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3902.985,
    "end": 3906.851,
    "text": " Essentially, if the brain doesn't have to process something, then it doesn't.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3908.153,
    "end": 3909.375,
    "text": "The brain is a lazy organ.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3910.056,
    "end": 3914.683,
    "text": "The thing I often say to drive this home is, what was the color of the last door handle you opened?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3916.738,
    "end": 3919.78,
    "text": " there's a high probability that you didn't register that at all.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3919.8,
    "end": 3922.742,
    "text": "Well, because there's no reason to, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3922.862,
    "end": 3925.745,
    "text": "Like you just smoothly coped with the door.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3925.785,
    "end": 3928.767,
    "text": "What you needed to do is open the door to get to the other side of it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3929.447,
    "end": 3933.25,
    "text": "And, you know, there was no reason to even register the color of the door handle.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3933.985,
    "end": 3946.113,
    "text": " So what this kind of framework says is the signal that the brain is processing at any time is the discrepancy between the data that it was expecting to register and the data that it actually does.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3946.173,
    "end": 3948.294,
    "text": "And this difference is called a prediction error.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3949.315,
    "end": 3960.022,
    "text": "And if you can go just back to figure three for one second, I just want to make the point that, well, so this relates to Bayes in the sense that descending messages",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3960.809,
    "end": 3962.47,
    "text": " carry prior probabilities.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3962.93,
    "end": 3969.893,
    "text": "So essentially, you can think of this as the base rate for a given phenomenon independent of the data that I'm collecting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3970.393,
    "end": 3974.535,
    "text": "And then the prediction error kind of combines that knowledge with data.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3974.735,
    "end": 3976.496,
    "text": "So it's something like the likelihood.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3977.416,
    "end": 3989.161,
    "text": "If the prior is just the probability of an event that I'm considering, the likelihood is the probability of that event given some data that I've actually registered effectively.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3990.017,
    "end": 3993.002,
    "text": " So this is why these frameworks are often called Bayesian.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3993.402,
    "end": 4003.538,
    "text": "The ascending messages carry prediction errors, which are likelihoods, and the descending messages carry prior probabilities, which are the predictions that the predictive brain and so on are all about.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4005.245,
    "end": 4005.825,
    "text": " Perfect.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4006.485,
    "end": 4013.767,
    "text": "And then from here, we move on to a specific hypothesis to predictive coding.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4014.327,
    "end": 4018.988,
    "text": "I'm not sure 100% the degree to which we're still committed to this functional distinction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4019.468,
    "end": 4026.029,
    "text": "But the idea is that, at least in the brain, there are going to be two kinds of neural populations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4027.029,
    "end": 4032.01,
    "text": "The ones which encode effectively these generative model units, which",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4032.446,
    "end": 4037.43,
    "text": " are the ones that are encoding the kind of base rates about the phenomena that you're interested in.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4037.83,
    "end": 4049.819,
    "text": "And then another functionally distinct subpopulation of neurons that's responsible for computing the difference between the data you expected given these predictions and the data that you're actually receiving.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4050.72,
    "end": 4060.087,
    "text": "And again, the unexplained signal that the part of the signal that wasn't predicted by the descending messages is passed upstream",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4061.185,
    "end": 4063.666,
    "text": " in the hopes that it will be explained away at some point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4064.886,
    "end": 4070.088,
    "text": "And also one note that can help understand this is this caption.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4070.408,
    "end": 4077.691,
    "text": "In the empirical Bayes framework, the system can then use the posterior obtained from one iteration as the prior in the next iteration.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4078.251,
    "end": 4082.953,
    "text": "And so the empirical Bayes framework is in a way what it cuts the Gordian knot.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4083.453,
    "end": 4086.934,
    "text": "It prevents us from just saying, well, it's just simply priors all the way up.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4087.514,
    "end": 4089.155,
    "text": "And we start somewhere.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4089.568,
    "end": 4098.872,
    "text": " by starting our prior for one level with just empirically what we're getting from the posterior at the lower level at that time point as a starting point.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4099.432,
    "end": 4116.46,
    "text": "And so this can be instantiated in physical, not infinite systems because there's a possibility that empirical Bayes, just as it's used in data analysis in a variety of fields, you can use the data to inform a prior and then have a generative model that starts working from there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4116.82,
    "end": 4117.42,
    "text": "Yeah, precisely.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4117.54,
    "end": 4118.901,
    "text": "And what Bayes does,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4119.454,
    "end": 4128.636,
    "text": " in this context is just provide a way to optimally combine what you knew before sampling any data with what you've learned from that data.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4129.516,
    "end": 4135.037,
    "text": "So as you're saying, what you're essentially doing is multiplying your posterior.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4135.517,
    "end": 4145.819,
    "text": "So you calculate your posterior by multiplying your prior by your likelihood and then normalizing, which can get a bit hairy at times, but that's effectively what you're doing here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4146.823,
    "end": 4148.605,
    "text": " And let's just look at this example.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4148.705,
    "end": 4151.867,
    "text": "So here we have the same architecture as figure four.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4151.967,
    "end": 4152.688,
    "text": "So we're building it out.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4152.788,
    "end": 4155.951,
    "text": "Figure three, it's a graph.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4156.191,
    "end": 4157.292,
    "text": "It's just nodes and edges.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4157.372,
    "end": 4158.893,
    "text": "It's the pure representation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4159.314,
    "end": 4163.257,
    "text": "Now we're thinking about a little bit more of a plausible neural architecture.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4163.597,
    "end": 4165.799,
    "text": "And maybe in some brain regions, it is this way.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4165.919,
    "end": 4167.801,
    "text": "And maybe in other brain regions, it isn't this way.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4167.841,
    "end": 4169.563,
    "text": "But this is a plausible architecture.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4170.103,
    "end": 4171.624,
    "text": "And now we have an example.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4171.764,
    "end": 4173.566,
    "text": "So what is being shown with the dog?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4175.111,
    "end": 4179.912,
    "text": " Well, this is just to re-illustrate the center versus periphery distinction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4181.293,
    "end": 4194.357,
    "text": "So the image of the dog has just undergone a Fourier decomposition, which basically means that you're kind of separating out the different spatial frequencies that are used to generate the image.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4195.266,
    "end": 4203.553,
    "text": " And I mean, the hypothesis is always sort of the same is that the closer you are to the sensory periphery, the more you're dealing with faster changing regularities.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4204.674,
    "end": 4210.439,
    "text": "So high spatial frequency information is represented at the bottom or the periphery of the hierarchy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4211.02,
    "end": 4218.987,
    "text": "And as you ascend the hierarchy, what you see is essentially lower and lower spatial frequency information.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4219.887,
    "end": 4228.594,
    "text": " Uh, so this is the kind of idea here is that like the, the, the fast regularities are represented closer to the sensory periphery, slow ones closer to, uh, the center.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4228.614,
    "end": 4231.936,
    "text": "Uh, yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4233.117,
    "end": 4233.898,
    "text": "I hope I said that right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4234.218,
    "end": 4241.864,
    "text": "And, um, and, and yeah, uh, most sensory modalities are going to be, uh, deconstructed in this way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4242.004,
    "end": 4248.129,
    "text": "I mean, you know, for the visual, uh, brain regions, uh, you start off, you know, detecting, uh,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4249.204,
    "end": 4257.312,
    "text": " essentially lines and, you know, like grading patterns and the more primary visual areas like V1 and everything.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4257.652,
    "end": 4265.059,
    "text": "And then as you ascend the cortical hierarchy, what the neurons become sensitive to are groupings of these patterns.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4265.1,
    "end": 4268.643,
    "text": "So things that change at a slightly slower timescale.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4269.404,
    "end": 4272.667,
    "text": "I mean, if you did one of these Fourier decompositions to an image of the face,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4273.203,
    "end": 4288.193,
    "text": " what you'll see is that the gross morphological features of the face, like where your cheekbones are and where your jawline is, are much coarser than the fast-changing things in your face, like your eyes and your mouth.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4289.313,
    "end": 4294.337,
    "text": "And so again, you might assume that this is represented hierarchically in the brain.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4295.776,
    "end": 4305.024,
    "text": " And let me add one more level to the specific visual example, because it's in the specifics that we can see what we're getting out of this framework.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4305.505,
    "end": 4308.648,
    "text": "So low spatial frequency is like a blur filter.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4309.268,
    "end": 4313.492,
    "text": "It's averaged out over large regions of visual space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4314.17,
    "end": 4317.991,
    "text": " In contrast, the very high spatial frequency, it looks grainy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4318.371,
    "end": 4323.772,
    "text": "And that's kind of like turning the contrast very high up to overemphasize differences between neighboring pixels.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4324.132,
    "end": 4326.572,
    "text": "But when you do that, you lose the global structure.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4326.712,
    "end": 4328.632,
    "text": "So we know that from playing around in Photoshop.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4329.033,
    "end": 4336.274,
    "text": "Well, it would be really cool if we could just see the world in total high resolution and just optimize this with one level.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4336.634,
    "end": 4342.355,
    "text": "But it turns out that in the retina, the cells are activated even before the lines detection.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4342.615,
    "end": 4343.495,
    "text": "It's like light",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4343.934,
    "end": 4348.318,
    "text": " It can only detect whether it's on or off extremely locally.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4348.338,
    "end": 4360.028,
    "text": "And so how does that signal, which is ultimately an extremely local contrast signal, how does that percolate up in the context of deep priors about regularities in nature?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4360.349,
    "end": 4366.154,
    "text": "So look at deep mind, look at the images that are produced from deep dream, these regularities that appear natural.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4366.496,
    "end": 4372.397,
    "text": " They're not just any kind of natural, they're human, visual, niche natural, like grass and clouds.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4373.177,
    "end": 4380.018,
    "text": "These kinds of things have structures that certain other kinds of repeating, like a grid, just doesn't appear in nature.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4380.619,
    "end": 4394.521,
    "text": "And so this is a structure by which the hyperlocal contrasts, literally between pixels in this image, can be passed up and you can end up getting this full spectrum Fourier resolution on the image",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4395.208,
    "end": 4420.58,
    "text": " And then to add one more level of detail, what we experience isn't any single one of these levels because we experience a world in full color, though there's no color receptors at our periphery, and also a world that's at full resolution, though we have very, very different resolution as far as the pixels, the retinal detection units are concerned in this phobia in the center of the eye versus the periphery.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4421.004,
    "end": 4431.052,
    "text": " So that to me is demonstrative that we're experiencing our deep generative model of the world, which is that the world has similar resolution, no matter which way my head is looking and there's color everywhere.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4431.553,
    "end": 4439.639,
    "text": "And then subconsciously or sub personally, our eyes are engaged in an oculomotor informational forging task.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4439.919,
    "end": 4441.28,
    "text": "And where do the eyes secade?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4441.761,
    "end": 4448.146,
    "text": "It turns out that they look where the most informative place to look would be given the structure of this Bayesian algorithm.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4448.632,
    "end": 4467.125,
    "text": " So there's so many things that are suggested with just this architecture, and there's so many aspects of the signal processing cascade, and especially the top-down priors, that aren't reflected by this idea that the eye is a camera, and the brain is a CPU, and it's just doing image classification like a convolutional neural network.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4467.405,
    "end": 4474.77,
    "text": "There are convolutional elements, to be sure, in vision, but they're playing out in this type of a framework, not in a tic-tac-toe framework.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4475.431,
    "end": 4476.051,
    "text": "Yeah, absolutely.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4477.851,
    "end": 4478.932,
    "text": " Couldn't agree more with that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4479.112,
    "end": 4481.234,
    "text": "That's a great point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4481.354,
    "end": 4499.211,
    "text": "I mean, I think an often overlooked element of this picture is that it's not just saying, like, this is a criticism of bottom-up passive, you know, a passive picture of the brain that just kind of bottom-up aggregates, you know, simple properties until you get something like a percept.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4500.087,
    "end": 4503.268,
    "text": " So we're not just saying that this is a top-down approach.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4503.568,
    "end": 4510.109,
    "text": "It's the bidirectional processing cascade that really gets you where you want to go, ultimately.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4510.129,
    "end": 4518.351,
    "text": "And as you were just saying, Dan, the experience that we're having implicates all these different levels.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4518.631,
    "end": 4529.414,
    "text": "And it's precisely because this whole multilevel architecture is implicated at all times that you get this kind of rich, equally multilevel experience.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4531.055,
    "end": 4531.395,
    "text": " Cool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4531.715,
    "end": 4536.257,
    "text": "Maybe we can turn to this last figure for the last section of our discussion.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4536.597,
    "end": 4546.361,
    "text": "So now we've built out this Bayesian framework from the previous images, first from its most austere framing to something that looks a little bit more naturalistic.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4546.821,
    "end": 4554.104,
    "text": "And now we're going to bring it back to our discussion about culture and about expectations, norms, and affordances.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4554.484,
    "end": 4555.565,
    "text": "So here we have the same",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4556.252,
    "end": 4562.617,
    "text": " structure where we have predictions moving down and prediction errors moving up or in or out.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4562.657,
    "end": 4566.6,
    "text": "These are just spatial metaphors and there's only in and out, there isn't top or bottom.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4567.22,
    "end": 4570.983,
    "text": "And then we're adding a few more levels of details to the model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4571.063,
    "end": 4574.546,
    "text": "The first is this blue and that's the precision weighting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4574.566,
    "end": 4581.751,
    "text": "And so that's entering this hierarchy at a few different places and it's tuning the temperature, so to speak,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4582.447,
    "end": 4583.449,
    "text": " on the precision.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4583.769,
    "end": 4586.133,
    "text": "So how much should we value?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4586.233,
    "end": 4590.44,
    "text": "How much stock should we take about this information that's coming up?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4590.961,
    "end": 4592.523,
    "text": "Although there's a lot more nuance there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4592.884,
    "end": 4596.129,
    "text": "And then also there's a top down modulation of attention.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4596.653,
    "end": 4598.915,
    "text": " And that's where this regimes of attention enters.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4599.255,
    "end": 4602.017,
    "text": "So the precision story is really key to all this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4602.198,
    "end": 4612.646,
    "text": "And, you know, honestly, as I was learning this framework, you know, like five years ago, initially, I was hoping that the precision stuff wouldn't be so central to the argument because it's really complicated.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4613.266,
    "end": 4619.652,
    "text": "But it turns out that you get you get some of the most interesting effects from the precision stuff.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4619.672,
    "end": 4624.135,
    "text": "So it's it's it's a little bit it's a little bit difficult sometimes to wrap your head around.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4624.155,
    "end": 4625.616,
    "text": "But I think the effort is worth it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4626.57,
    "end": 4638.058,
    "text": " The idea is just to say, at every level of the hierarchy, the brain doesn't just register a signal, but it evaluates how confident it is in that signal or how reliable the signal is.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4638.098,
    "end": 4642.542,
    "text": "And this is what this precision construct effectively quantifies.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4643.042,
    "end": 4646.024,
    "text": "And Dan, you were relating this to temperature informally.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4646.064,
    "end": 4646.765,
    "text": "That's correct.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4647.645,
    "end": 4651.108,
    "text": "A more intuitive way, perhaps, of framing it is as volume.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4651.707,
    "end": 4661.233,
    "text": " So it's sort of like the brain's volume on each of its different kind of sensory streams, sensory and predictive streams effectively.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4662.854,
    "end": 4672.54,
    "text": "And yeah, so precision weighting is what allows you to, according to this story at least, arbitrate different sources of information.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4672.58,
    "end": 4678.304,
    "text": "So for example, 2018, 2019, I spent a lot of time in London and London was surprisingly foggy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4679.111,
    "end": 4683.453,
    "text": " As a Canadian, I never experienced anything like this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4683.493,
    "end": 4686.334,
    "text": "I think once when I was a child, there was just so much fog.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4686.854,
    "end": 4692.556,
    "text": "There were days when I would come out of my flat in London and I couldn't see two feet ahead of me.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4692.936,
    "end": 4693.896,
    "text": "There was so much fog.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4694.436,
    "end": 4701.559,
    "text": "In circumstances like that, what you learn to do is to rely on your other senses like your hearing, for example.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4701.599,
    "end": 4708.401,
    "text": "There's a story about the way that the brain is kind of dynamically, it's sort of like a dynamic balancing act.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4709.4,
    "end": 4716.312,
    "text": " In a sense, the brain is trying to see which of the signals that it's dealing with are the most reliable.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4717.234,
    "end": 4718.596,
    "text": "So I'll stop now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4718.676,
    "end": 4719.698,
    "text": "Richard has questions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4721.431,
    "end": 4728.7,
    "text": " Yeah, so this is the criticism I get a lot when I present at conferences and even when I publish on ideas related to this.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4729.26,
    "end": 4738.612,
    "text": "In the sense of, you know, if I'm, let's imagine I'm a master burglar and I walk into a neighborhood and I'm looking, I'm casing the neighborhood to find out what I want to break into, which house I want to break into.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4740.205,
    "end": 4744.147,
    "text": " And so I have these priors, I have this sensory information, I'm highly motivated to steal things.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4744.667,
    "end": 4748.788,
    "text": "And then there's always that old guy in the back who raises his hand and says, that's really cool.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4748.848,
    "end": 4750.089,
    "text": "So how do I test any of that?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4750.349,
    "end": 4751.809,
    "text": "How, what do I measure?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4751.909,
    "end": 4753.53,
    "text": "What variables do I need to collect?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4753.87,
    "end": 4758.512,
    "text": "And if at the end of the day, all you're giving me is a more refined version of what I'm already talking about.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4759.312,
    "end": 4759.753,
    "text": " Who cares?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4760.213,
    "end": 4763.094,
    "text": "And my gut tells me that's wrong.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4763.114,
    "end": 4772.44,
    "text": "I mean, as we've been in all these different disciplines, we can go back and forth and translate our concepts back and forth and see that we're all talking about the same thing.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4772.9,
    "end": 4785.027,
    "text": "But if it doesn't lead to something empirical that then we can then start doing critical tests and show this version of the theory is wrong because my particular priors or whatever wouldn't work differently if it had been that way.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4785.647,
    "end": 4804.014,
    "text": " So I guess, to me, that's the thing that I'm always struggling with, and I'm hoping to get some insight from everyone here, is how do we translate this figure six into an empirical test that I can write up for an NSF grant and then gather data and show my theory is right, Parsons from 1950 was wrong, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4804.134,
    "end": 4805.095,
    "text": "Or something along those lines.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4806.095,
    "end": 4807.276,
    "text": "That's a great question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4808.036,
    "end": 4812.758,
    "text": "I think where this has been done the most extensively is in psychiatry.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4814.677,
    "end": 4832.764,
    "text": " where, and this is why, you know, this is what really drove the message home for me that the precision story was so central to this, is that you can understand a lot of psychiatric conditions in terms of, you know, altered precision weighting profiles.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4834.705,
    "end": 4840.067,
    "text": "So like, I think a kind of well understood",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4840.868,
    "end": 4869.342,
    "text": " example has to do with the cycle the course of schizophrenia uh so we think that and phil corlett uh has great work on this uh i mean several people uh have worked on this uh from different kind of perspectives but all kind of relying on uh this construct of precision and backing it then then backing it up with fmri data so the course of schizophrenia for example",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4869.764,
    "end": 4875.668,
    "text": " it's thought to maybe start out as a physiological break in your dopamine signaling.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4875.708,
    "end": 4879.55,
    "text": "So say D2 receptors start to misfire for no reason.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4879.61,
    "end": 4884.333,
    "text": "So they're generating what we would consider to be a spurious prediction error.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4884.373,
    "end": 4887.035,
    "text": "So like a prediction error that isn't really tracking anything.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4887.796,
    "end": 4892.259,
    "text": "And initially this gets resolved perceptually in the lower levels of the hierarchy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4892.299,
    "end": 4894.6,
    "text": "It's kind of contained through hallucination.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4895.08,
    "end": 4897.482,
    "text": "Like the brain's generating a prediction error signal",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4898.004,
    "end": 4907.866,
    "text": " And what it ends up doing is underweighting its priors or overweighting its prediction error because that's essentially what's going on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4907.906,
    "end": 4913.148,
    "text": "Like there's a breakdown and these prediction errors that aren't tracking anything are given too much importance.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4913.708,
    "end": 4918.269,
    "text": "And as the condition worsens, they're given more and more importance because they're consistent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4919.129,
    "end": 4922.01,
    "text": "The brain is just consistently generating this prediction error.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4922.805,
    "end": 4931.229,
    "text": " And at some point it gets so intense in the brain that it starts to be resolved through learning rather than through a hallucination.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4931.269,
    "end": 4948.637,
    "text": "So then, you know, for those of you who do a little bit of research in psychiatry, you'll know that there is a typical course of schizophrenia that starts off as a more kind of hallucination experience where people are still to some degree cognizant of the fact that they're undergoing an abnormal experience and they're hallucinating.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4949.073,
    "end": 4956.095,
    "text": " But late stage schizophrenia has more to do with persistent delusional beliefs.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4956.615,
    "end": 4968.398,
    "text": "And now your actual cognitive structure is adapting to the error signals that you're generating and learning the error, essentially, which is not tracking anything in reality because it's just due to a breakdown.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4969.167,
    "end": 4983.036,
    "text": " So from that point of view, to address the points that you just raised, Richard, I think a lot of the power of the approach in terms of proof of principle comes from psychiatry.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4983.656,
    "end": 4991.041,
    "text": "These predictions and precisions are computed by parts of the brain that you can identify.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4991.061,
    "end": 4998.366,
    "text": "So Phil Corlett, I think in particular, has done some really, really cool work on psychiatry.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4999.176,
    "end": 5008.967,
    "text": " on schizophrenia and effectively the kind of presentation of schizophrenia and the course of schizophrenia.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5009.468,
    "end": 5010.91,
    "text": "Very cool work from that point of view.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5010.99,
    "end": 5013.913,
    "text": "It fills it at Yale for those of you who are interested.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5014.694,
    "end": 5015.295,
    "text": "Cool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5015.335,
    "end": 5018.879,
    "text": "Stephen, and then we'll return to the unique predictions question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5020.839,
    "end": 5038.949,
    "text": " Yeah, I suppose just adding to that, this challenge of things happening over time, like a time series of things happening rather than kind of some snapshot in time, which I think traditionally a lot of research sort of does that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5039.569,
    "end": 5045.112,
    "text": "So even what Maxwell was saying there is what's presenting as a pattern over time,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5045.872,
    "end": 5048.154,
    "text": " If you took one moment, it might not show that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5048.174,
    "end": 5051.696,
    "text": "And I think that's where it's kind of hard to analyse that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5051.736,
    "end": 5059.521,
    "text": "That's why these models that they create show how things pan out over time on a low dimensionality.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5059.541,
    "end": 5061.482,
    "text": "And then you can get something from that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5061.922,
    "end": 5066.485,
    "text": "And I'm kind of... It does present a problem about real-life scenarios.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5066.545,
    "end": 5074.31,
    "text": "And I'm interested in whether maybe approaching it from the direction of affordances and the environment and working backwards...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5075.103,
    "end": 5084.969,
    "text": " to how people attune to an environment might be the way to look at the more macro because it becomes so high dimensional if you take someone at the individual level.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5085.009,
    "end": 5086.93,
    "text": "But I think this is up for grabs.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5087.811,
    "end": 5092.254,
    "text": "Let's bring that back to the question about crime by Richard.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5092.394,
    "end": 5094.815,
    "text": "So let's think about the shared expectations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5095.176,
    "end": 5100.739,
    "text": "So the shared expectations might be people don't walk onto someone else's private property.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5101.314,
    "end": 5110.097,
    "text": " So in that case, even somebody who's highly motivated and has the tools and the affordance to do a burglary, there's still uncertainty about what's inside the house.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5110.457,
    "end": 5117.46,
    "text": "Now, let's imagine changing the norm so that people are at wide windows and you can see exactly which house has which equipment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5117.96,
    "end": 5130.145,
    "text": "Now, somebody who's motivated and with the affordance is enabled by a cultural norm that allows passing close to the window, as well as an architectural affordance to see inside the house, they're reducing their uncertainty",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5130.774,
    "end": 5132.095,
    "text": " about what's inside of the house.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5132.655,
    "end": 5140.821,
    "text": "And that is going to change not just that agent's behavior in their own field of affordances, but also some macro trends.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5141.261,
    "end": 5146.765,
    "text": "And so this is in one sense, this is looking at within the brain, these are different neuronal populations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5147.245,
    "end": 5153.509,
    "text": "And that would be precision could be played by dopamine and by dopaminergic synapses like Maxwell's talking about.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5153.95,
    "end": 5157.312,
    "text": "And personally, I find it fascinating that so many stories about reward",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5157.864,
    "end": 5163.027,
    "text": " Like, oh, well, gambling is about people trying to maximize reward or bank robberies are about people trying to maximize reward.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5163.427,
    "end": 5163.708,
    "text": "Really?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5164.008,
    "end": 5164.428,
    "text": "Is it, though?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5164.628,
    "end": 5172.033,
    "text": "Or is it about people optimizing their precision or perhaps even operating under maladaptive precision regimes?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5172.473,
    "end": 5178.977,
    "text": "So it doesn't have just because it's an optimization and a precision oriented framework doesn't mean that aberrant events don't happen.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5179.617,
    "end": 5182.639,
    "text": "So within the brain level, we can think about that type of precision.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5182.959,
    "end": 5187.002,
    "text": "But then also socially, what is the feedback that somebody receives along the way?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5187.435,
    "end": 5193.097,
    "text": " that has other people give them feedback to keep them on the straight and narrow, as it were.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5193.637,
    "end": 5197.178,
    "text": "And then how do we as cultures define what that path is?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5197.538,
    "end": 5205.0,
    "text": "Are there on ramps from the fringes of society that help onboard people into a healthy and cooperative way of living?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5205.6,
    "end": 5209.541,
    "text": "Or do we push people who even deviate in some way",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5210.08,
    "end": 5216.062,
    "text": " out of the center where they're even more likely to deviate further from the increasingly narrow perspective of the center.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5216.602,
    "end": 5221.323,
    "text": "So there's really so many levels that this can come into play at.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5222.183,
    "end": 5228.485,
    "text": "So I think just because of the time, let's have a few closing thoughts from anybody who would like to share.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5228.925,
    "end": 5238.648,
    "text": "And then also please through text, if you're listening as well as participating, submit us questions or topics or quotes, because we have a bunch of quotes that we've selected",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5239.11,
    "end": 5243.152,
    "text": " and some other things that we felt like we could have spent more time talking about.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5243.492,
    "end": 5252.717,
    "text": "But we'll save that for next week with this first week's podcast being the figures, the definitions, the on-ramps, and the accessibility from a lot of different fields.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5253.057,
    "end": 5255.118,
    "text": "And then next week we'll bridge out even further.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5255.438,
    "end": 5259.2,
    "text": "So any closing thoughts from our participants?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5268.545,
    "end": 5268.785,
    "text": "Shannon?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5270.592,
    "end": 5276.133,
    "text": " I think that's a really good point, that question of how do you study this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5276.734,
    "end": 5289.537,
    "text": "How do you bring this entire story of the free energy principle or predictive processing or active inference and actually study it in a social context, like in a group of people?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5289.557,
    "end": 5297.919,
    "text": "So not just the stationary burglar who's alone in a neighborhood at night, but in the context of a group of people who are interacting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5299.944,
    "end": 5327.417,
    "text": " think that would be a really great topic for part of next week or like when we revisit and just you know a plug from music that's a great uh little model system to study these kind of interactions um and starting from western music just because i grew up here and that's kind of music i've interacted with but if you have an ensemble you know who are the leaders of the ensemble who are the followers",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5328.191,
    "end": 5344.175,
    "text": " And you can kind of manipulate that and really study how you can play with changing the regimes of attention or changing who in the group dictates what the particular field of affordances that this piece of music needs to play.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5345.895,
    "end": 5355.938,
    "text": "And there are a lot of really exciting and fun ways to get creative in the lab to study these kinds of social exchanges and maybe put some of these super complex mathematical models to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5358.194,
    "end": 5361.096,
    "text": " and give it some empirical testing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5362.697,
    "end": 5362.937,
    "text": "Great.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5363.117,
    "end": 5364.978,
    "text": "Richard, anyone else can raise their hand as well.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5365.459,
    "end": 5366.079,
    "text": "Yeah.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5366.319,
    "end": 5369.401,
    "text": "Building off that, I think it's a great idea to talk about people in groups.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5369.701,
    "end": 5385.951,
    "text": "The thing that I've seen coming out with hyperscanning and the ability to have two, three, four, five people all being scanned at the same time while they're socially interacting and then asking, okay, so what is this mathematical model of the free energy principle or active inference or whatever embedded in an individual?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5386.712,
    "end": 5389.716,
    "text": " Does it come down to coupled oscillators?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5389.736,
    "end": 5391.338,
    "text": "That's the thing I keep coming back to.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5391.418,
    "end": 5394.562,
    "text": "Is this just another version of coupled oscillators?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5394.943,
    "end": 5401.792,
    "text": "If that's true, then the notion of how do I empirically deal with this is because these coupled models can deal with 10, 15, 20...",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5403.394,
    "end": 5431.64,
    "text": " a thousand people interacting that our current concepts in sociology we can talk about abstractly but no one can really figure out a way to measure it so i think that'd be really interesting to look at the intersection between the models our current scanning ability to empirical design and the theory and really see where they what are they talking about and what is more unified you know operationalization of these concepts in light of this technology and these models what would that look like in terms of experimental design",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5432.342,
    "end": 5433.282,
    "text": " That's really exciting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5434.523,
    "end": 5446.748,
    "text": "I'll try to rejoin because my camera crashed again after this comment, but I wanted to say to both of you, Shannon and Richard, if these are lines of research that you're interested in exploring, this is definitely something that my group is very keen on exploring.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5447.868,
    "end": 5449.609,
    "text": "I mean, you're talking about hyperscanning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5449.689,
    "end": 5451.55,
    "text": "I really think this is the direction forward.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5452.27,
    "end": 5453.131,
    "text": "We're working with...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5454.252,
    "end": 5455.613,
    "text": " a few people now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5456.994,
    "end": 5469.382,
    "text": "So Robin Murphy, Santiago Castiello, Eda Bilek, and Guillaume Dumas in particular are all people who do EEG and fMRI hyperscanning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5470.042,
    "end": 5479.328,
    "text": "And the new kind of thing that we're trying to do is to combine multi-agent modeling with multi-brain neuroimaging.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5480.349,
    "end": 5483.831,
    "text": "You know, because the problem that I have with social neuroscience is that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5485.125,
    "end": 5490.309,
    "text": " And I'm sure those of you who do social sciences will concur.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5490.569,
    "end": 5497.874,
    "text": "What we're essentially doing is looking at the brain with this really deep level of inquiry.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5500.356,
    "end": 5505.139,
    "text": "We're looking at hundreds of different sensors on the scalp or whatever.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5505.629,
    "end": 5518.275,
    "text": " And so we have all of this brain data that we're looking at, but when we're looking at the kind of social measures that we're using, it's these kind of toy measures like empathy or whatever that are supposed to tell us something broad about culture.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5518.935,
    "end": 5532.402,
    "text": "And the problem with that is that we're effectively flattening all of the causal structure and complexity of the social world onto these kind of toy dummy variables that are supposed to tell us something really deep about social interactions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5534.168,
    "end": 5552.265,
    "text": " By combining this multi-scale perspective opened up by the free energy principle with hyperscanning and other social neuroscience techniques, we're hoping to really be able to talk about and understand and model the social world in all its complexity while also looking at",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5553.265,
    "end": 5554.125,
    "text": " brain dynamics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5554.585,
    "end": 5568.529,
    "text": "So have people, for example, interact in ecologically realistic situations for humans, and then see stuff about, you know, like, so Eda Bilek, for example, if you don't know her, you should absolutely check out her work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5569.709,
    "end": 5572.73,
    "text": "E-D-D-A-B-I-L-E-K, Eda Bilek.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5573.71,
    "end": 5575.451,
    "text": " She's currently Karl Fristen's postdoc.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5576.331,
    "end": 5579.193,
    "text": "And I think she's also at Mannheim in Germany.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5579.613,
    "end": 5588.357,
    "text": "And what she's developed is effectively a measure of brain-to-brain synchrony or real-time brain-to-brain information transfer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5589.037,
    "end": 5602.963,
    "text": "And you can get to this by looking at basically real-time interactions between humans, engaging in some kind of shared participatory task, like aligning gaze direction or whatever.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5603.482,
    "end": 5606.764,
    "text": " and simultaneously recording their brains as they interact.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5607.264,
    "end": 5609.806,
    "text": "And I really think that this is like the golden way forward.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5609.846,
    "end": 5616.209,
    "text": "So if any of you actually are interested in pursuing this, please send me a DM or something and we can get started.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5617.23,
    "end": 5617.63,
    "text": "Perfect.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5617.89,
    "end": 5627.616,
    "text": "And I'll just close, I think with one short note on flattening versus deflationary theory, because it really does come back to what are we doing here?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5627.756,
    "end": 5632.659,
    "text": "Is this another metaphor and it's just pendulums on a table or is there something actually more here?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5633.277,
    "end": 5637.179,
    "text": " And flattening, Maxwell was suggesting, is when we're just projecting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5637.199,
    "end": 5639.64,
    "text": "And that's a psychological as well as a dimensional term.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5639.86,
    "end": 5641.921,
    "text": "We project onto simple constructs.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5642.302,
    "end": 5644.503,
    "text": "We want to have this simple construct of empathy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5644.843,
    "end": 5652.927,
    "text": "And in a sense, by projecting into that representation at a lower dimension, we've created a world that isn't necessarily reflective of the whole system.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5654.908,
    "end": 5656.709,
    "text": "In contrast with a flattening account,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5657.23,
    "end": 5662.094,
    "text": " We can have a deflationary account where what's happening is really communicating brains.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5662.514,
    "end": 5667.859,
    "text": "It's really just those brains communicating and we're deflating away the extra, the second level.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5667.919,
    "end": 5668.759,
    "text": "Where's the empathy?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5668.84,
    "end": 5669.7,
    "text": "Where's the regime?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5669.96,
    "end": 5670.721,
    "text": "Where's the attention?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5671.121,
    "end": 5673.183,
    "text": "The answer is it's the whole system.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5673.503,
    "end": 5675.665,
    "text": "And it's not just the whole system, meaning the person.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5675.965,
    "end": 5677.827,
    "text": "It's the whole system with the niche and the culture.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5678.207,
    "end": 5680.389,
    "text": "And so it's a lot to grasp with.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5680.731,
    "end": 5691.476,
    "text": " because it is a multi-level system and we can design an experiment that isolates a certain component, but we never truly have isolated from the evolutionary context or the developmental context.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5691.976,
    "end": 5708.084,
    "text": "And so the goal to pursue deflationary rich accounts that provide all of these humanistic things that we want to see like inactive embodied and cultured cognition, rather than flattening it onto something and then saying, well, maybe they're the same between different cultures.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5708.384,
    "end": 5709.004,
    "text": "We can actually,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5709.605,
    "end": 5712.767,
    "text": " go into that richness and look at what we actually have.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5713.247,
    "end": 5714.908,
    "text": "And Stephen, with a closing thought.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5716.008,
    "end": 5716.728,
    "text": "Yeah, thanks.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5716.869,
    "end": 5717.629,
    "text": "I totally agree.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5717.669,
    "end": 5724.012,
    "text": "And I like this idea of being able to feel where we look, this idea of feeling texture.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5724.332,
    "end": 5727.394,
    "text": "It's sort of analogous with that because you have empathy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5727.434,
    "end": 5731.856,
    "text": "And someone like, I work a lot in the development field and community work and",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5732.276,
    "end": 5736.117,
    "text": " You get this idea of empathy, but there's no time variation in empathy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5736.137,
    "end": 5737.617,
    "text": "It's just like dumped there.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5738.538,
    "end": 5742.199,
    "text": "And it's like, well, how is that changing moment to moment?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5742.219,
    "end": 5742.839,
    "text": "There's none of that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5743.359,
    "end": 5746.48,
    "text": "No one really thinks about that, how things change over time.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5746.54,
    "end": 5749.221,
    "text": "So I think this is actually really useful.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5749.901,
    "end": 5757.363,
    "text": "It's clarified a lot of stuff in my head, actually, just hearing that discussion about... I think it's a different way of thinking about...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5758.32,
    "end": 5785.707,
    "text": " you know normally all that granularity would be seen as a problem but actually it can be seen as data which is really cool beautiful maxwell first author last thought i just wanted it's less of a thought than a feeling i just wanted to re-express my gratitude to everyone in the conversation um this is really exciting and awesome and uh like yeah i i so",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5786.673,
    "end": 5791.055,
    "text": " If anyone does want to develop these ideas, like I was saying, please get in touch with me.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5791.675,
    "end": 5795.337,
    "text": "And our group is very keen on collaborating.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5796.197,
    "end": 5802.52,
    "text": "We've established a multi-site international network of research called the Nested Minds Network.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5802.9,
    "end": 5806.901,
    "text": "We're going to launch the website pretty soon.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5806.961,
    "end": 5814.525,
    "text": "But for those of you who are looking for international collaboration and so on, please get in touch with me.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5816.28,
    "end": 5819.702,
    "text": " Like what we're trying to do is build a community around this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5820.062,
    "end": 5824.885,
    "text": "And, you know, this podcast is definitely part of the consolidation process.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5826.126,
    "end": 5827.747,
    "text": "And yeah, so thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5828.047,
    "end": 5828.727,
    "text": "Thank you all.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5829.508,
    "end": 5830.428,
    "text": "You're all really cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5830.468,
    "end": 5831.329,
    "text": "And this is really fun.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5832.289,
    "end": 5833.77,
    "text": "Thank you, Maxwell.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5833.91,
    "end": 5840.254,
    "text": "We build the on-ramps together that are bigger than we can build individually and build the on-ramps we want to see.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5840.354,
    "end": 5842.015,
    "text": "We build the culture that we want to see.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5842.035,
    "end": 5844.897,
    "text": "And that's a lot of work to be done.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5845.37,
    "end": 5848.032,
    "text": " but it's empowering to know that together we'll make it happen.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5850.313,
    "end": 5850.653,
    "text": "Okay.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5851.053,
    "end": 5852.414,
    "text": "Thank you all for the live stream.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5852.434,
    "end": 5853.475,
    "text": "Thanks for listening.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5853.755,
    "end": 5855.176,
    "text": "And I will end the live stream.",
    "speaker": "SPEAKER_05"
  }
]