[
  {
    "start": 0.031,
    "end": 28.182,
    "text": " hello it's february 8th 2023 we're in cohort three and we're having our second discussion on chapter one so just a few side notes before we jump to the questions uh first i'll place this in the chat but we can um hey maria are you recording the the meeting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 28.432,
    "end": 55.755,
    "text": " yes i'm recording it with obs like on my local computer okay i'm sorry oh no thank you for checking the icon okay thanks for checking yes it doesn't mention it it's like a yes so last week we talked about neats and scruffies and those terms are due to roger shank and it was actually last week that roger shank had passed away which i have just placed in the chat so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 57.17,
    "end": 84.308,
    "text": " auspicious though tragic and people may find a lot of in this article by harold jarch a lot of interesting um thoughts on learning by doing teaching others to do this is the next step in the education revolution and also there's a student's bill of rights that i had never seen from shank before",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 84.507,
    "end": 104.406,
    "text": " so there's a lot of interesting um pieces here so for those who are interested take a look and maybe see how we can bring some of that back to the textbook group and then also awesome thanks yeah",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 104.774,
    "end": 133.836,
    "text": " and then um i don't see yana here but yesterday yana and i went to the step-by-step active inference paper which i also put in the chat it's one that we reference all the time because it has a step-by-step building of like static perception dynamic perception these are passive inference and then action comes into play and we used the ontology to describe what was happening",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 133.883,
    "end": 153.259,
    "text": " and used LaTeX in Coda to write the equation and then made some tables that allowed us to flip between different ways of talking about what was given and what we're calculating wrote the pseudocode",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 153.458,
    "end": 164.397,
    "text": " made tables for every variable and interpreted every column so this was just for the static example but it was a lot of fun and I'll also put that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 167.228,
    "end": 167.889,
    "text": " Thanks, Jonathan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 167.929,
    "end": 169.031,
    "text": "That sounds cool too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 169.552,
    "end": 171.915,
    "text": "Yeah, so this was a lot of fun that we had.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 171.935,
    "end": 190.003,
    "text": "And there's definitely some walls that we run up against, like doing vector and matrix multiplication in Coda, but it's a fun direction for making really interactive and multimedia systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 190.503,
    "end": 196.172,
    "text": "All right, so let's go to chapter one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 198.346,
    "end": 216.253,
    "text": " does anyone want to give any thought or comment at all on chapter one any thought or or question at all and then we'll jump into the questions that the cohort has had on chapter one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 223.895,
    "end": 252.045,
    "text": " feels like a long while now since reading it could have been last week could have been last year yeah feel free to raise your hand or write in the chat any comment or question that's presenting itself to you today or we will look into the questions that the cohort wrote",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 281.523,
    "end": 307.986,
    "text": " it looks like we may have done this last time what is the relationship between policy and environment maybe anyone can just give a summary or thought on that and then we'll move it up okay yeah very informative comment thread Brock go for it and then anyone else",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 309.434,
    "end": 323.508,
    "text": " Policies are selections on affordances, like latent affordances in the environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 328.953,
    "end": 329.654,
    "text": "Sequences, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 336.521,
    "end": 338.563,
    "text": "Then let's look at the comment thread.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 354.288,
    "end": 381.949,
    "text": " generative process stomach is empty stomach emits a rumble that's a great example because the generative process helps frame it in terms of what it is which is the process that passes observations to the blanket this doesn't have to be outside quote of the organism so the true status of the stomach is an external state",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 382.638,
    "end": 408.865,
    "text": " with respect to the blanket states being interoception and the internal states being cognitive modeling of interoception generative process is just whatever passes observations so it doesn't have to be the niche but in the case of exteroception vision hearing etc packets coming into a server",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 409.891,
    "end": 416.699,
    "text": " then it is outside of the agent, but it doesn't have to be spatially outside of the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 417.139,
    "end": 417.479,
    "text": "Jonathan?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 419.241,
    "end": 423.146,
    "text": "Yeah, we said that the generative process is the thing that passes observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 424.908,
    "end": 427.431,
    "text": "Presumably, it doesn't have to pass an observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 427.471,
    "end": 438.683,
    "text": "There can be things happening in the outside world that we don't have access to, but may still be part of our generative, what is actually the generative process of the real world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 440.317,
    "end": 440.878,
    "text": " Great point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 441.078,
    "end": 447.504,
    "text": "The generative process does pass observations to the blanket, but that is not all it has to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 453.17,
    "end": 458.375,
    "text": "So it could have, the generative process could have 10 variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 459.376,
    "end": 466.003,
    "text": "Like the thunderstorm could have temperature, light, sound,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 466.557,
    "end": 469.2,
    "text": " but then we only have a microphone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 469.22,
    "end": 470.641,
    "text": "So we're only perceiving sound.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 471.542,
    "end": 480.692,
    "text": "So the generative process is passing us sounds, and then that is being used by the agents, but that's not to say that the generative process is only sound.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 482.534,
    "end": 495.248,
    "text": "And that comes back to a slightly more general point, which is that the state space of the generative process doesn't have to be the same as the state space of the cognitive model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 506.213,
    "end": 532.39,
    "text": " and generative processes can be other generative models in the social setting as jonathan is pointing to that's sometimes called thinking through other minds and let's look at this it's cool and we can see a previous question on the notion of surprise is the agent's perception not only affected by the influence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 532.96,
    "end": 558.462,
    "text": " of its environment but also an agent's peers so the agent's peers are updating their beliefs in a collaborative fashion what would be the extent of the update to an agent's GM of perceptions if an agent witnesses the annihilation of one of its peers for example something like this okay it's a wildebeest people can check out the video",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 574.203,
    "end": 574.543,
    "text": " OK.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 577.127,
    "end": 577.948,
    "text": "Michael, please.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 581.713,
    "end": 583.836,
    "text": "I just have a question with respect.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 583.976,
    "end": 590.464,
    "text": "Previously, you wrote, Don, that a policy is a sequence of affordances.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 591.425,
    "end": 596.532,
    "text": "And I was wondering, is it a sequence or is it one affordance?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 596.512,
    "end": 601.124,
    "text": " Is a policy one affordance, or is a policy a sequence?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 601.225,
    "end": 603.089,
    "text": "So can it be more than one affordance?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 603.33,
    "end": 607.601,
    "text": "I was of the understanding that a policy is one affordance.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 608.343,
    "end": 610.369,
    "text": "But maybe I'm confused there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 611.071,
    "end": 612.715,
    "text": "Yeah, good, good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 612.695,
    "end": 629.404,
    "text": " question and policy and affordance are used slightly differently for example in the reinforcement learning setting but we won't necessarily go there so the affordance are the actions that can be taken in a single moment alternative actions that can be taken",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 633.248,
    "end": 661.905,
    "text": " so this could be movement up down left right this could be an eye saccade up down left right policy is going to be a sequence of those for a given time horizon so if the time horizon is one or the temporal depth of the model is one this is the same as affordances but if the the temporal depth",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 663.792,
    "end": 671.521,
    "text": " were two, then it would be all combinations of two affordances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 673.424,
    "end": 677.509,
    "text": "So up-up, up-down, down-down, left-right, right-left.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 679.271,
    "end": 684.857,
    "text": "But how does it then work with epistemic and pragmatic affordances?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 685.598,
    "end": 691.926,
    "text": "At some points in the book, it says that these are two aspects of one affordance.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 693.188,
    "end": 720.158,
    "text": " yes great we we are going to get there and here's what it's going to look like just to peek forward in chapter two so um pi our policy pi for policy g is expected free energy expected free energy is going to be calculated for every single policy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 720.307,
    "end": 726.834,
    "text": " So again, if that is temporal depth of one, it's just equivalent to the actions that can be taken in that moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 727.735,
    "end": 736.103,
    "text": "If this is a temporal depth of five, then it's the expected free energy of up, up, up, up, up, up, up, up, up, down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 737.324,
    "end": 745.993,
    "text": "Now, those different policies are going to be evaluated according to this single imperative, expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 748.15,
    "end": 753.497,
    "text": " that's going to rank different policies based upon their posterior likelihood.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 754.799,
    "end": 760.126,
    "text": "In reward slash reinforcement learning, you would rank policies by their expected reward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 761.227,
    "end": 770.8,
    "text": "In FEP, we're going to rank policies by their expected free energy, which is going to describe their posterior likelihood.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 772.585,
    "end": 801.951,
    "text": " different policies might be seen as likely for different reasons and this equation can be partitioned in different ways to understand that so a policy might be seen as really good let's just say it's good but that means the same thing as saying it's a likely policy if it secures a lot of information gain on the other hand a policy could be seen as good or likely if it secures a lot of pragmatic value",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 804.091,
    "end": 807.136,
    "text": " those both get projected down into the expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 807.316,
    "end": 813.806,
    "text": "Now, conversationally, people will say something like, well, opening the book, that's like an epistemic affordance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 815.209,
    "end": 827.228,
    "text": "That's compatible with what we're talking about here, but the partition here would be like, the affordance is to open the book or not open the book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 827.248,
    "end": 831.955,
    "text": "And then the action selection to open the book",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 832.12,
    "end": 835.424,
    "text": " is selected because it has a high information gain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 836.967,
    "end": 859.697,
    "text": "So the idea, and one that we'll continue to revisit, is that you can get behavior that's able to exhibit pragmatic value-seeking components, and when those are unclear on how to pursue, come into an information-seeking mode through a unified imperative G.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 861.955,
    "end": 886.832,
    "text": " so we still do have epistemic afford epistemic affordances in the conversational sense but to be strict about it there are just affordances which are the capacities for action and then different policies are selected or not and we can partition that differently and that partitioning may reveal that a policy was selected because it reduced information had high epistemic value",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 887.335,
    "end": 895.732,
    "text": " reduced informational uncertainty, should I say, or it was aligning observations with preferences, which is pragmatic value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 902.245,
    "end": 903.608,
    "text": "Can we relate policy with goal?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 904.009,
    "end": 906.694,
    "text": "I'm going to just copy in these answers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 931.582,
    "end": 958.467,
    "text": " page 101 chapter 5 will will come there okay any other comments or questions on this topic okay ali",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 962.193,
    "end": 983.777,
    "text": " Actually, about Miria's question that if we can relate policy with goals, well, maybe, I don't know if I can reiterate that example I pointed out in the last session about picking up a cup.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 984.257,
    "end": 992.166,
    "text": "So yeah, actually, the goal is somehow inherently",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 992.635,
    "end": 1000.43,
    "text": " consolidated into our actions and our policies, or at least at our goal-directed actions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1000.991,
    "end": 1012.534,
    "text": "So I pointed out to an example from Ritsalati and Senigallia's book, Mirrors in the Brain, which says that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1012.7,
    "end": 1029.443,
    "text": " Picking up a cup of coffee can be done in various ways depending on whether we are drinking from it, in that case we would grasp it by the handle, or if we're washing it, in that case we would grasp it by the rim or moving it out of the way.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1029.811,
    "end": 1033.577,
    "text": " In that case, we would grasp it by the body.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1033.677,
    "end": 1049.442,
    "text": "So yeah, actually, in this scenario, selecting the appropriate policy would necessarily require considering the goal of that policy or action.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1049.462,
    "end": 1050.423,
    "text": "Yes, thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1050.463,
    "end": 1054.89,
    "text": "And we can talk about goals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1056.035,
    "end": 1062.044,
    "text": " but the way that it plays out in the generative model, there isn't a variable that's called the goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1062.104,
    "end": 1068.493,
    "text": "So here, Jonathan wrote, the goal is really about minimizing expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1068.573,
    "end": 1076.604,
    "text": "So yes, some kind of meta imperative is to fulfill the minimization of free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1077.285,
    "end": 1083.274,
    "text": "But let's think about like, the goal is to move the coffee cup to the drying rack",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1084.351,
    "end": 1109.38,
    "text": " that is actually going to be embedded in the preference we expect and prefer to see the cup on the drying rack oh i observed it in the sink i'm surprised maybe even anxious what are the affordances well without going too deep into a motor model we could like grab or not grab move arm left move arm right",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1109.545,
    "end": 1124.652,
    "text": " and then some policy like move arm left grab move arm right release the grab that's a four-step policy that has pragmatic value",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1130.69,
    "end": 1157.878,
    "text": " again looking forward but we're going to come to this in the coming weeks that policy has value and it's like a goal-oriented policy because we reduce the divergence between our preferences and observations so goal-oriented or pragmatic behavior is loaded heavily in this pragmatic value section which at its heart has to do with the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1158.01,
    "end": 1181.301,
    "text": " um relationship between preferences and observations that's why we talk about like expect slash prefer like we talk about it as a preference but the way that it plays out is again not by preferred states are the most rewarding but preferred states are the most expected",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1181.888,
    "end": 1210.95,
    "text": " be least surprised when your body temperature is in its preferred value when your body temperature is out of your preferences you'll be surprised how are we going to bound that surprise free energy just as it's done in bayesian statistics how are you going to balance surprise there's two ways you could change the world or you could change your mind changing your mind depending on the time scale is like perception or learning",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1211.369,
    "end": 1213.433,
    "text": " Changing the world happens through action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1214.434,
    "end": 1220.966,
    "text": "So let's just say we're again surprised at seeing the coffee cup in the sink.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1220.986,
    "end": 1228.159,
    "text": "Changing our mind might look like updating our model of where we expect to see coffee cups so that we're not surprised.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1229.241,
    "end": 1232.086,
    "text": "Oh, it's normal that it's in the sink.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1232.106,
    "end": 1233.508,
    "text": "So now I'm not surprised anymore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1234.109,
    "end": 1236.313,
    "text": "So we effectively reduce surprise by learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1238.386,
    "end": 1257.795,
    "text": " or you could reduce your expected free energy by taking sequences of action and whether a generative model learns or how it learns or or whether it acts and how it acts that has to do with the details of how the model are set up",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1271.461,
    "end": 1277.527,
    "text": " Why exploration and exploitation are automatically balanced through policy selection and active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1277.947,
    "end": 1279.629,
    "text": "What does it mean to say both are balanced?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1280.85,
    "end": 1284.694,
    "text": "Any thought or related idea here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1297.087,
    "end": 1298.548,
    "text": "Jonathan and anyone else?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1300.638,
    "end": 1311.175,
    "text": " Yeah, I mean, I think to really understand it, you have to understand the equation that you were just showing us, where the information gain is about exploration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1311.215,
    "end": 1315.282,
    "text": "We can think of it about exploration and the pragmatic is about exploitation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1316.003,
    "end": 1321.532,
    "text": "And so to really understand how that's automatically balanced, you have to understand exactly where that equation comes from, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1323.098,
    "end": 1343.487,
    "text": " awesome totally agree yes it's captured in expected free energy calculation so this equation is not necessarily the solution it's not a strategy to balancing explore exploit like depending on what variables are set",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1343.787,
    "end": 1350.587,
    "text": " you could result in a agent that always goes for the right slot machine or always takes the hint.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1351.069,
    "end": 1357.307,
    "text": "So it's not that just by framing it this way, the problem has been solved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1357.507,
    "end": 1380.73,
    "text": " but this as it turns out creates an incredible flexible framework for fitting parameters and testing different models that include the wide diversity of cognitive phenomena like attention and all of these other complex phenomena so it's like linear regression y equals mx plus b",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1380.929,
    "end": 1408.185,
    "text": " that's not a solution to the regression it's the space in which lines are going to be compared to each other so expected free energy isn't the solution to adaptive policy but it's a space in which policies can be compared with each other how are they going to be compared with each other with expected free energy what are some decompositions of expected free energy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1408.418,
    "end": 1434.898,
    "text": " it turns out to have some very useful decompositions that connect us with on one hand in the top line the semantics of value broadly in terms of informational or epistemic value and pragmatic or utility value so that's one huge connection because we can think about special cases like if there's no information to be gained",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1435.418,
    "end": 1451.048,
    "text": " expected free energy is going to get only pragmatic value if there's no pragmatic value then it is equivalent to a pure information novelty approach and it can do mixes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1451.804,
    "end": 1477.305,
    "text": " there's other decompositions that connect to the middle lines here have to do with decision and control theory and then this bottom line points the way towards connections with physics where we see energy and entropy for example in the gibbs free energy so that's kind of a doorway into physics and thermodynamics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1477.69,
    "end": 1501.183,
    "text": " and it's this these are all just different decompositions of the same functional so it um it's a an advocate's claim that active inference simply balances explore exploit",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1502.176,
    "end": 1524.994,
    "text": " but a slightly more measured angle would be it frames the problem so that generative models can be constructed and parameterized that are able to adaptively navigate explore and exploit any",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1525.683,
    "end": 1532.333,
    "text": " preference for a question to go to next, or anyone, please feel free to just raise any question that's coming to mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1532.574,
    "end": 1533.676,
    "text": "Michael, and then anyone else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1534.958,
    "end": 1539.365,
    "text": "Yeah, I was wondering this distinction between exploration and exploitation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1539.966,
    "end": 1546.977,
    "text": "Does it only apply to the expected values or also to the variational free energy?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1549.0,
    "end": 1551.724,
    "text": "Good question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1553.29,
    "end": 1566.368,
    "text": " we will come to explore the similarities and differences between variational free energy, figure 2.5, F, and expected free energy, G, equation 2.6.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1566.508,
    "end": 1581.289,
    "text": "In short, variational free energy, F, is taking in as arguments Q, our beliefs, the variational distributions that represent our beliefs, and data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1582.197,
    "end": 1587.926,
    "text": " So in variational free energy, we're actually not engaged in policy selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1591.131,
    "end": 1594.596,
    "text": "In expected free energy, we are engaged in policy selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1596.519,
    "end": 1610.5,
    "text": "So variational free energy is a common measure used in machine learning and statistics because of its ability to effectively fit models based on data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1611.56,
    "end": 1632.606,
    "text": " and then to really take the full active turn and talk about not just optimal fitting of data but not overfitting which is like what variational free energy does in the expected free energy case is when we actually get into the consideration of alternate affordances yeah Michael than anyone else",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1634.999,
    "end": 1644.731,
    "text": " Yeah, so you're saying that exploration, exploitation relates to the policy, so somehow to the future, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1644.751,
    "end": 1652.501,
    "text": "But I can also engage right now into an exploration or an exploitation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1653.282,
    "end": 1654.363,
    "text": "Isn't that the case?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1656.706,
    "end": 1661.732,
    "text": "So I mean, it does not only relate to the future, I guess, does it?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1665.273,
    "end": 1667.52,
    "text": " or what I'm misunderstanding there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1667.981,
    "end": 1673.9,
    "text": "So I can explore right now, not only in a plan for the future.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1676.247,
    "end": 1677.19,
    "text": "OK, Jonathan?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1678.773,
    "end": 1683.219,
    "text": " Yeah, I'd say that both exploration and exploitation are sort of active things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1683.84,
    "end": 1694.095,
    "text": "Even if it's in the moment now, it may be some sequence, it may be relatively short, but it's still something about what's happening now and where I want to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1694.896,
    "end": 1705.05,
    "text": "So I think that even if you're thinking about your exploration in this moment, it is really about what's happening in some future time that you're attempting to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1706.718,
    "end": 1707.118,
    "text": " Nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1707.339,
    "end": 1707.739,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1708.22,
    "end": 1710.182,
    "text": "And it's great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1710.222,
    "end": 1710.563,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1710.583,
    "end": 1720.835,
    "text": "And and also like exploration, exploitation are kind of informal terms to describe different behavioral outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1722.257,
    "end": 1724.84,
    "text": "They're not necessarily like formal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1726.902,
    "end": 1731.007,
    "text": "And then also a great comment there in the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1731.708,
    "end": 1733.991,
    "text": "Um, I'll just put it in here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1736.553,
    "end": 1765.041,
    "text": " this is a good reminder that like affordances and policies it's like always come back to map and territory there's the affordances that the person can engage in and that's like the territory if you really want to think about it and wonder about it like what can a body do but as modeled there are modeler degrees of freedom in which affordances are going to be considered for the agent to do so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1765.325,
    "end": 1766.346,
    "text": " go to the vending machine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1766.927,
    "end": 1771.791,
    "text": "Like that could be, you could have the affordance go to the vending machine or go or not go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1771.951,
    "end": 1772.592,
    "text": "It's just binary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1773.092,
    "end": 1779.759,
    "text": "Or you could have raise your quadricep muscle and flex your calf muscle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1779.779,
    "end": 1787.626,
    "text": "So that's going to be a model that can do a lot of other things, but then you're going to have to have all of this parameterization just to be able to get out of the chair.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1788.887,
    "end": 1795.213,
    "text": "So how you coarse grain action is one of the major",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1796.071,
    "end": 1812.763,
    "text": " modeler degrees of freedom and challenges in action modeling we'll come back to this more times any just offhand comment or question that someone has",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1833.331,
    "end": 1836.736,
    "text": " Everything following the question mark is just a tracking device.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1842.323,
    "end": 1845.027,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1845.047,
    "end": 1845.768,
    "text": "It's a Twitter thread.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1848.431,
    "end": 1849.152,
    "text": "We're reading books.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1851.956,
    "end": 1854.199,
    "text": "Why you want to go with a computational approach?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1854.419,
    "end": 1857.984,
    "text": "Why not just go full on Gibson plus dynamical systems?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1859.106,
    "end": 1859.406,
    "text": "Well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1865.275,
    "end": 1869.181,
    "text": " This should be very relevant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1869.221,
    "end": 1870.763,
    "text": "I'll just bring in an update here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1882.22,
    "end": 1885.504,
    "text": "Actually, Maxwell also had a response on that tweet.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1886.586,
    "end": 1889.21,
    "text": "Okay, let's look at that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1889.25,
    "end": 1890.692,
    "text": "What?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1892.309,
    "end": 1896.093,
    "text": " Do you remember, or what was the response?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1897.055,
    "end": 1898.216,
    "text": "Oh, he had a response to this first one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1898.316,
    "end": 1899.117,
    "text": "There's active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1899.718,
    "end": 1899.918,
    "text": "Wow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1901.66,
    "end": 1902.801,
    "text": "Look at that foundational.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1904.163,
    "end": 1905.544,
    "text": "Atlas shrugged.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1910.01,
    "end": 1911.551,
    "text": "Do you remember what his response was, Ali?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1912.753,
    "end": 1916.477,
    "text": "Yeah, he somehow...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1918.01,
    "end": 1933.914,
    "text": " The gist of it was that those two are not necessarily mutually exclusive, but actually he's writing a paper to show the relevance between the two.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1934.736,
    "end": 1942.768,
    "text": "And yeah, they're more compatible than some people might think.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1945.195,
    "end": 1970.899,
    "text": " me find the exact tweet thank you yeah like if it comes to conceptual understanding almost everything is compatible it's like just how flexible are you willing to be but there are things that are incompatible and then the question is like kind of so what or what is the bigger framework that those are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1971.689,
    "end": 2000.818,
    "text": " or the context in which those are or aren't compatible um excitingly though this will be tomorrow um i'll put the paper in the chat this is uh so jay benjamin fallen days will join for a guest stream a potential mechanism for gibsonian resonance behavioral entrainment emerges from local homeostasis in an unsupervised reservoir network so i hope to um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2001.187,
    "end": 2023.026,
    "text": " see a accessible presentation on modern gibsonian modeling and drawing out some similarities and differences that are real or perceived with active inference everett and then anyone else",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2026.398,
    "end": 2041.137,
    "text": " This Gibsonian or computational approach, this also links to the question, is perception inferential or is it more direct perception?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2043.3,
    "end": 2055.696,
    "text": "And I don't really find a good argument that discusses the evidence for inferential approach to perception or ecological direct perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2056.435,
    "end": 2058.719,
    "text": " So I was wondering which way to go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2058.759,
    "end": 2060.341,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2061.103,
    "end": 2063.847,
    "text": "There's so many angles on this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2064.448,
    "end": 2066.671,
    "text": "One of them is maps, not territories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2066.892,
    "end": 2075.085,
    "text": "So whatever it is that perception really is for ants or humans or computers, we're going to model it with Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2075.065,
    "end": 2103.722,
    "text": " so that's a very strong position because then it leaves the other person debating about how maps really are while we're over here using modern computational tools to do statistical modeling and inference so that kind of sidesteps the discussion about the ontology of what is actual perception and puts it into the instrumentalist camp and then in terms of evidence the first thing that comes to mind is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2104.782,
    "end": 2129.895,
    "text": " we're perceiving colors and shapes in our blind spot so no of course it's not direct perception you don't have photoreceptors there is that conclusive so okay this is this is mainly if it's vision visual perception is mainly uh uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2130.5,
    "end": 2141.892,
    "text": " used as a way to discuss the perception, but it gets more difficult if you talk about, for example, pain or olfactory perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2142.492,
    "end": 2153.944,
    "text": "And then the question is, is all perception inferential or does it depend on the kind of perception you're talking about?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2154.064,
    "end": 2155.846,
    "text": "Is it visual or auditory?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2158.869,
    "end": 2159.41,
    "text": "And I'm wondering.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2160.976,
    "end": 2179.845,
    "text": " yeah it's it's um there's definitely a lot of nuance once we step outside of the clear invisible visual setting or the tangible and comprehensible tactile setting those are very immediate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2180.467,
    "end": 2185.374,
    "text": " but analogies certainly apply to other sensory modalities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2186.015,
    "end": 2192.363,
    "text": "And again, whatever the modality is, one can say we're using Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2192.383,
    "end": 2199.994,
    "text": "So let's just say whatever direct perception means, how is it being statistically modeled?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2200.767,
    "end": 2215.063,
    "text": " Yeah, the way I understand the difference is that our priors have a big influence on what we have as a perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2215.364,
    "end": 2220.73,
    "text": "And in the direct perception, our priors don't influence what we perceive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2222.192,
    "end": 2225.155,
    "text": "But maybe I'm too black and white here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2227.109,
    "end": 2242.924,
    "text": " lay it out and see if it's been argued that way elsewhere or what exactly would reduce your uncertainty about that question and if no one has laid it out so simply then it will be making a contribution jonathan",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2244.592,
    "end": 2263.984,
    "text": " I don't know if this answers the question at all, but I think your question there about the priors, it may be that we have very accurate incoming information and therefore, independent of what our priors are, you open a door and you don't know what's behind the door.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2263.964,
    "end": 2270.72,
    "text": " The priors will still have some effect, but they may have much less effect than the incoming information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2271.682,
    "end": 2277.256,
    "text": "So I don't think it's a matter of one form of perception using priors and others not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2277.296,
    "end": 2280.423,
    "text": "I think it's just a balance between how strong those priors are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2281.345,
    "end": 2282.428,
    "text": "That's my take on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2283.995,
    "end": 2284.556,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2284.876,
    "end": 2285.658,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2286.359,
    "end": 2299.32,
    "text": "In the Bayesian inference modeling setting, we could model a case where accurate information is coming in, which is to say that the generative model has high precision",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2299.3,
    "end": 2325.932,
    "text": " on the information coming in it's updating priors a lot it has high attention or salience so it's like whatever the new information is it just updates its prior to that so to the posterior becomes the incoming observation that's the special case of like a time series filter with a depth of one it's like whatever the last data point is just go to that so that is functionally direct perception",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2327.077,
    "end": 2345.945,
    "text": " Whereas if we have ambiguous information coming in, there's low precision on sensory data, priors are not updating a lot, it's low salience, it's low attention, then the belief moving forward is reflecting the a priori stance, the prior stance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2346.546,
    "end": 2354.518,
    "text": "So Bayesian inference is just giving us computational tools and formal methods to describe that possibility",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2355.545,
    "end": 2368.563,
    "text": " So we can go from something that's being updated time point by time point or not, but I've never seen any kind of useful model presented other than just the appeal to direct perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2368.743,
    "end": 2369.664,
    "text": "Not saying it's not there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2370.465,
    "end": 2371.567,
    "text": "Brock, and then anyone else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2374.551,
    "end": 2385.045,
    "text": "I just wanted to bring up something that Ali continues to remind people because I think it's hard",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2385.397,
    "end": 2400.94,
    "text": " it's easy to forget or not or look over here, is that we're using all this language about vision and in the context of us, a human, and the brain and all of this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2401.882,
    "end": 2414.02,
    "text": "And actually, that sort of entails a belief about active inference being physical.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2414.59,
    "end": 2443.197,
    "text": " like that the blanket is physical that the senses and the observations you know actions are always kind of purely physical um or that the epistemic value the pragmatic value well that's epistemic that's information that's you know pragmatic that's always action it's not um so cleanly that is actually an informational state space that we're talking about that the blanket's in right so it doesn't um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2444.898,
    "end": 2447.181,
    "text": " If you remember that, I guess, is what I'm saying.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2447.221,
    "end": 2454.049,
    "text": "And that it is constrained in a physical substrate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2454.99,
    "end": 2456.071,
    "text": "You are in a space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2456.411,
    "end": 2457.192,
    "text": "You are in a time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2459.795,
    "end": 2468.045,
    "text": "There is a generative process outside of you that is constraining your generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2469.366,
    "end": 2474.432,
    "text": "There is a constraint of affordances.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2475.138,
    "end": 2499.103,
    "text": " you you can't be a thing with an attracting characteristic like state space um and like ignore that completely sort of um you always have priors so to ask like yeah what what how is it that we have like direct perception or",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2499.91,
    "end": 2501.873,
    "text": " When are we ignoring our priors?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2502.033,
    "end": 2505.018,
    "text": "That's back to this anthropomorphic, purely physical thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2505.979,
    "end": 2513.43,
    "text": "It's like, when do the beliefs, the statistical beliefs kind of cancel out or something?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2514.031,
    "end": 2518.417,
    "text": "When are they purely reflective of the sense of the blanket?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2521.141,
    "end": 2522.323,
    "text": "That doesn't mean...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2522.641,
    "end": 2551.517,
    "text": " that you're ignoring your priors it just means that like like Daniel was saying is just a you know a well fit you know high resolution high um the expectation and the the blanket States as the Evolver are uh you know low surprise so thanks thanks again just physically constrained that's that's the important part is you can't",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2552.594,
    "end": 2575.75,
    "text": " you have to have beliefs you have to have prayers and so thank you yes it is a double-edged sword with the appeals to physical organisms because on one hand it kind of anchors how we think about these informational spaces and relationships on the other hand it naturally leads to a lot of important and interesting questions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2575.983,
    "end": 2594.042,
    "text": " that very often it's map not territory but if one doesn't know the territory and is just learning the map then it's it's no bad thing to ask questions that bump up against map territory but to be aware that there is a map territory relationship",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2594.697,
    "end": 2623.236,
    "text": " that becomes clearer and clearer as people learn about cartography how the maps are built and why and as people explore territory and then um yes some of the key uh citations in this area one of them would be the emperor's new markov blankets which was from we we had some live streams with yella in 2021",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2623.958,
    "end": 2629.108,
    "text": " And then most recently, The Blanket Trick, which is a whole other story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2629.128,
    "end": 2631.913,
    "text": "We're not going to go into it again, but I'll put the link there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2631.953,
    "end": 2641.731,
    "text": "And it captured a lot of this discourse on the blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2644.934,
    "end": 2671.178,
    "text": " okay in our last um oh then just the last thing um so Jonathan I think wrote imagine seeing something in low light or bright light there's a continuum of how strong the priors will will influence I believe the inference and that has been captured like in psychophysics which is from a long time ago small changes in brightness are more detectable in a dim room",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2672.204,
    "end": 2683.437,
    "text": " So the question is how to bring these kinds of empirical cognitive phenomena into our statistics and inference modeling methods.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2686.019,
    "end": 2694.529,
    "text": "And in the eyes of some, it's a done deal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2697.833,
    "end": 2701.857,
    "text": "So here Maxwell is saying that this was never an issue",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2703.558,
    "end": 2731.489,
    "text": " get information theory in dynamical systems theory naturally so it was never an issue that doesn't mean every single researcher was aware of it but it wasn't an issue and then um the map territory fallacy fallacy which i'll also put in the chat where they i we i think we even brought this up previously but they argue that fep",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2732.127,
    "end": 2749.748,
    "text": " is the ideal model of these kinds of map territory situations but a lot of the frustrations are related to different understandings and framings of map territory so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2751.517,
    "end": 2778.25,
    "text": " anyone please feel free to raise your hand just bring up any comment or thought or question otherwise we'll take a look at one or two more of the chapter one questions that people had ever yes yeah so so as you probably remember i work as a physical therapist and i treat people with maybe chronic pain",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2778.618,
    "end": 2802.583,
    "text": " And it is quite essential to make a stand as to perception being inferential or direct, because if pain is the experience that comes about by integrating priors and likelihoods,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2802.648,
    "end": 2818.854,
    "text": " And you could make a case that the priors are, let's say, maladaptive and are determining the ongoing pain experience instead of the likelihood in this example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2819.956,
    "end": 2821.939,
    "text": "But yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2823.59,
    "end": 2829.098,
    "text": " If that's not the case, then that has quite some implications for the way I treat people.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2829.158,
    "end": 2844.522,
    "text": "So that's why it's also very clinically relevant to have a good reason to say, okay, I'm going for this inferential computational explanation of perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2845.023,
    "end": 2848.568,
    "text": "So just to highlight where this question is coming from.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2849.83,
    "end": 2878.268,
    "text": " thank you yeah that's a great point and so like um we're going to come to this later but with cognitive modeling so let's just say again whether or not it's really direct or inferential in the world we're going to be using bayesian inference as a tool and we find that somebody is engaging in some behavior that we don't prefer it's like a child doing something that we don't prefer or the person has expressed that they don't prefer it or however it is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2878.872,
    "end": 2888.825,
    "text": " With cognitive models, it's possible to ask or differentiate, kind of like a differential diagnosis, and Ryan Smith and others have done a lot of work in this area.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2889.426,
    "end": 2896.855,
    "text": "Like, is the person repeatedly taking this action because they think that it leads to positive outcomes?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2897.776,
    "end": 2902.863,
    "text": "So that it's a learning failure to understand the consequences of action?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2904.104,
    "end": 2906.888,
    "text": "Or do they have a preference for that outcome?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2907.003,
    "end": 2926.378,
    "text": " those are two different clinical situations does this person prefer x outcome and they are taking the approach that makes sense at which point you'd want to be like hey it's really cool to be x and then figure that they'll take the right path",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2926.645,
    "end": 2934.374,
    "text": " Or do they know that they want to be somewhere, but they are not clicking on the consequences of their action in taking them to that goal?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2935.115,
    "end": 2953.076,
    "text": "So that kind of differential diagnosis, and like you said, is it like that the person has a high prior likelihood on, well, people like me have this kind of pain, at which point maybe any stimuli might get interpreted as that type of pain because it's likely, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2953.116,
    "end": 2953.477,
    "text": "Why not?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2954.598,
    "end": 2956.18,
    "text": "Or is it,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2957.729,
    "end": 2980.902,
    "text": " sensory attenuation is it a sensitivity to something it it could be any number of things so we can still use this differential diagnosis paradigm a little bit one step closer to being operationalized it doesn't need to pull back to like direct or inference philosophy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2981.557,
    "end": 3010.652,
    "text": " within the maps that we can make you can still ask about the relative contribution of priors likelihood sensory observations and so on but I think that's these are the exact kinds of application avenues where hearing people's like insights and questions on which parts of this framework are relevant for them as they continue to go deeper into it it's like that's what is great to see",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3015.83,
    "end": 3024.861,
    "text": " okay well let's look at where we're going to be going in the coming weeks and chapters",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3026.208,
    "end": 3029.412,
    "text": " So we're having our second discussion on chapter one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3029.612,
    "end": 3031.214,
    "text": "Chapter one, there was no equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3031.715,
    "end": 3039.124,
    "text": "It was giving some big overviews and laying out a lot of the big picture for active inference as the authors see it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3040.045,
    "end": 3048.796,
    "text": "Then we're gonna have two weeks as we go into a lot of the substance of the book, chapter two, three, four, and five.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3049.557,
    "end": 3051.459,
    "text": "Okay, what are those chapters gonna be about?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3052.521,
    "end": 3055.945,
    "text": "Well, chapter two and three",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3056.06,
    "end": 3081.645,
    "text": " are going to describe the low road and the high road to active inference and we're going to talk probably a ton about low road and high road um the low road and and we can come up with just tables and tables of concordances it'll be really fun the low road is in a way asking how",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3082.52,
    "end": 3082.86,
    "text": " How?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3083.321,
    "end": 3084.563,
    "text": "With Bayesian statistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3085.124,
    "end": 3086.525,
    "text": "This is how we're going to do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3086.586,
    "end": 3088.028,
    "text": "This is how these maps work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3088.048,
    "end": 3090.01,
    "text": "This is how these models work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3090.03,
    "end": 3092.133,
    "text": "Active inferences about cognitive modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3092.854,
    "end": 3094.376,
    "text": "How are those models being implemented?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3094.817,
    "end": 3095.498,
    "text": "Bayes' theorem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3096.259,
    "end": 3101.947,
    "text": "Not every Bayesian statistics equation has to do with cognition and action and perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3102.527,
    "end": 3104.41,
    "text": "You could have a Bayesian statistics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3105.689,
    "end": 3135.325,
    "text": " model of something that wasn't an active agent but we're interested in the generative models that do perception and action and planning as an inference challenge and then in the case of brains that has been called the bayesian brain approach so how bayes theorem chapter two low road kind of the why",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3135.541,
    "end": 3158.832,
    "text": " is coming from the imperative for persistence or for survival or for repeated measurement so treat it lightly when we talk about the imperative for persistence and i know we've had some discussions even last week on what about these kinds of um seemingly self-inflicted injuries and all of this but just from a statistical perspective",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3158.947,
    "end": 3174.66,
    "text": " something has to persist long enough to be measured as being that thing otherwise you won't measure it at that thing like if you're taking measurements every hour and the cloud is dissipating every five seconds you're not going to see that cloud",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3175.248,
    "end": 3186.205,
    "text": " If the cloud is dissipating on the hourly timescale and you're measuring it every five seconds, there's going to be some equations that you can use to model the cloud moving or growing and changing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3186.947,
    "end": 3195.4,
    "text": "So that's coming from the high road, this imperative for persistence, which becomes operationalized",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3196.274,
    "end": 3225.319,
    "text": " in a way that's compatible with bayesian statistics through this concept of self-evidencing and the reduction of surprise about one's own perceptions like if you're unsurprised that you're in homeostasis you're going to be persisting as that kind of thing if you find yourself surprised at your homeostatic parameters it won't be long until you are not that kind of thing chapters two and three low road how",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3226.75,
    "end": 3233.296,
    "text": " High road, Y. Those are importantly the low road to active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3233.897,
    "end": 3235.779,
    "text": "High road to active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3237.501,
    "end": 3243.066,
    "text": "That's going to bring us to chapter four, generative models of active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3243.086,
    "end": 3252.015,
    "text": "That's where we're gonna see the kernel that is situated on one hand using Bayes' theorem as a how",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3253.092,
    "end": 3259.822,
    "text": " and explaining self-organization and persistence in terms of a why.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3259.842,
    "end": 3271.378,
    "text": "Chapter five is then going to talk about the setting where active inference generative models have been studied most extensively to this point, which is the mammalian nervous system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3272.34,
    "end": 3282.795,
    "text": "So that is going to bring up a lot of examples from the central and the peripheral nervous system of mammals and talk about how generative models have been used",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3283.214,
    "end": 3311.938,
    "text": " to study those kinds of phenomena that people are interested in from motor behavior to decision making that's the first half of the book so we've kind of like gone in the skateboarding ramp or like the ski jump or whatever it is that is like chapter one it's kind of like going over the edge and now we're going to have more",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3312.07,
    "end": 3330.079,
    "text": " equations and some technical pieces are going to be introduced along these two roads and just like with everything it's many coats of paint so read through it and and ask questions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3331.932,
    "end": 3334.074,
    "text": " Every question is important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3334.594,
    "end": 3336.856,
    "text": "So even if it's a very big... What does this letter mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3336.916,
    "end": 3338.718,
    "text": "Why is this here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3339.799,
    "end": 3342.361,
    "text": "What would this mean if it didn't have to be this way?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3342.421,
    "end": 3344.884,
    "text": "How does this apply to this setting?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3344.924,
    "end": 3348.927,
    "text": "How does this help us do this or that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3349.668,
    "end": 3357.135,
    "text": "Any structure of question, if each of us can come up with a few, we'll have many.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3357.175,
    "end": 3359.897,
    "text": "And...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3359.962,
    "end": 3387.032,
    "text": " yeah specifically let's just look at what we'll come to in chapter two and then we'll close william james my thinking first and last and always for the sake of my doing this kind of speaks to this essential embedding of action in inference in active inference we start with perception as inference so that's going to cover some of the topics that we talked about today",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3387.164,
    "end": 3392.071,
    "text": " Box 2.1 is going to introduce Bayes' theorem and probabilistic reasoning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3393.693,
    "end": 3398.48,
    "text": "There's going to be an example that comes back a few times with a person holding something in their hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3398.54,
    "end": 3401.845,
    "text": "It could be a frog or an apple, and then it's going to jump or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3402.626,
    "end": 3407.914,
    "text": "And we're going to model our uncertainty about what that object is based upon what we observe it to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3410.358,
    "end": 3416.867,
    "text": "There's going to be some discussion of basic statistical concepts like support and expectation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3418.012,
    "end": 3423.097,
    "text": " That is going to be applied in the setting of the generative process and the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3423.858,
    "end": 3426.861,
    "text": "Process like the niche, model like the cognitive agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3428.343,
    "end": 3429.284,
    "text": "Action as inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3429.384,
    "end": 3431.606,
    "text": "Previously, we were talking about perception as inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3432.247,
    "end": 3437.032,
    "text": "Now, action is gonna be treated as a variable that you can do inference on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3438.654,
    "end": 3446.702,
    "text": "And both perception and action can be used to reduce discrepancies, which will also have a technical definition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3447.728,
    "end": 3471.964,
    "text": " variational free energy is going to be introduced as a statistical measure that helps us bounce surprise and it will be shown what that means and then expected free energy is going to be introduced as a way that is as a way that different policies about the future different sequences of actions can be compared with each other",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3475.032,
    "end": 3497.918,
    "text": " special cases of expected free energy collapse to various other important settings like if there's no information to glean you can pursue pragmatic value if there's no pragmatic value to pursue you can purely pursue informational ends and that's the end of the low road thank you everybody farewell",
    "speaker": "SPEAKER_01"
  }
]