[
  {
    "start": 3.389,
    "end": 3.95,
    "text": " All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3.97,
    "end": 4.73,
    "text": "Hello, everyone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4.77,
    "end": 9.896,
    "text": "Welcome back to the Active Inference Institute's textbook reading group.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 10.917,
    "end": 14.2,
    "text": "Today, this is cohort seven, wrapping up with chapter 10.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 14.961,
    "end": 32.94,
    "text": "It's been quite a journey through the first part of the book, which, as we know, is a bit more focused on formalisms, on theory, on anything from Markov blankets to wrapping our heads around hierarchical variational message passing in microcortical circuits.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 33.443,
    "end": 48.204,
    "text": " as well as looking at sort of a Bayesian framework for doing updating and then linking that to action and perception and action perception loops from the active inference framework perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 48.805,
    "end": 55.594,
    "text": "And then with the second part of the textbook, we saw a lot more in terms of application models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 55.935,
    "end": 60.902,
    "text": "We had a recipe for active inference ranging from defining",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 61.085,
    "end": 74.304,
    "text": " our generative models, our generative processes, considering different kinds of components for models, likelihood and state transition matrices, looking at the discrete case versus the continuous case and all the rest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 74.365,
    "end": 89.607,
    "text": "And then our last chapter for this cohort prior to chapter 10, chapter 9, we were looking at what happens whenever we want to actually fit models to empirical data, whenever we want to do group analysis, and kind of wrapping our heads around the idea of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 89.958,
    "end": 96.506,
    "text": " composing the subjective model for our agents and having our own kind of model of the agent's model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 96.566,
    "end": 100.27,
    "text": "So something like metabasian modeling or analysis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 100.791,
    "end": 114.828,
    "text": "Now in chapter 10, which kind of sticks out a little bit, a bit of an outlier in the second part of the book, it's almost as if they could have written a third part of the book that would have been labeled something like active inference and its connections.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 115.528,
    "end": 118.632,
    "text": "We saw in this chapter that we're actually",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 119.017,
    "end": 129.27,
    "text": " no longer directly talking about kind of the mechanical or sort of engineering aspects of creating or testing or fitting models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 129.37,
    "end": 146.351,
    "text": "Now we're just kind of wrapping up with looking at the interrelationships between active inference in a variety of other fields, both fields from which active inference kind of grew as well as fields to which it can contribute and those which fall within both of those prior categories.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 146.612,
    "end": 148.534,
    "text": "So in the introduction,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 148.767,
    "end": 173.526,
    "text": " to chapter 10 we're uh described uh it's described to us active inference is a complete solution to sentient organisms adaptive problems which attempts to provide a unified perspective on action selection perception attention and even emotion regulation that list could continue on and on actually for those of us who have kept up throughout the book um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 173.928,
    "end": 200.931,
    "text": " And it's kind of reiterating, you know, we know that active inference is essentially a unified, it's a normative framework operating from first principles, brings back the old Neitz and Scruffy's argument or debate from the first chapter of the book where we are in the realm of the Neitz, although we certainly would not deny a Scruffy or two, especially to welcome them into the fold if they so chose.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 201.805,
    "end": 216.404,
    "text": " In section 10.3, there's a pretty interesting quote from Daniel Dennett, the late Daniel Dennett, of course, and his suggestion to kind of model the whole iguana.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 217.685,
    "end": 231.643,
    "text": "With active inference, we do something like that in an attempt to create proxies of reality, whether it be creating a model to simulate in silico or it be to fit a model to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 231.944,
    "end": 245.44,
    "text": " a real-world organism or phenomenon or otherwise, where here free energy minimization acts as a kind of first principle by which we can derive implications about specific cognitive processes and their neuronal underpinnings.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 246.241,
    "end": 255.632,
    "text": "So active inference takes a kind of inactive integrative approach to things like preference realization, self-evidencing, self-preservation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 255.732,
    "end": 256.433,
    "text": "We're reminded of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 256.767,
    "end": 262.295,
    "text": " homeostasis or as well as allostasis or a kind of homeostasis of the future.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 262.315,
    "end": 272.289,
    "text": "The idea that there's bounded rationality that organisms and agents and so on kind of exist within their immediate context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 272.369,
    "end": 282.103,
    "text": "They come with their own histories or memories and beliefs that they're actively kind of updating and also testing through action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 282.744,
    "end": 283.585,
    "text": "And then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 283.902,
    "end": 288.71,
    "text": " We were reminded again of the self-evidencing aspect of action perception.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 289.271,
    "end": 299.569,
    "text": "Both of these are self-evidencing in the sense that they both lead to the agent aligning its expectations given its generative model by either changing the world or changing its mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 299.869,
    "end": 304.116,
    "text": "So memory and attention also are thought to be optimizing the same objective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 304.417,
    "end": 307.362,
    "text": "Long-term memory develops through learning model parameters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 307.612,
    "end": 330.683,
    "text": " remember that learning operates at a somewhat slower time scale than inference itself, which inference is usually seen as kind of a real-time moment-to-moment process, whereas learning could happen, you know, just slowly, or you could imagine, like, it's almost like a mouse in the tea maze, moment by moment, position from position, or to position in the tea maze as they move left or right, or",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 330.663,
    "end": 345.225,
    "text": " visit the informative queue at the speed of real-time inference, you might say, you know, perhaps after the entire trial, you know, they achieved the cheese or unfortunately they didn't and they, you know, obtained a negative stimulus.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 346.086,
    "end": 350.933,
    "text": "In either case, it's kind of like maybe after the whole trial, that's where you kind of take in the whole experience as it were.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 351.2,
    "end": 356.309,
    "text": " And maybe that's where learning happens, or maybe it happens at another time, or maybe it happens during sleep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 356.77,
    "end": 362.62,
    "text": "You know, which, which we certainly, uh, interestingly do, of course, our brains are never fully off.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 362.921,
    "end": 363.121,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 363.602,
    "end": 372.718,
    "text": "So there's a variety of processes that occur during sleep and including, uh, the kind of modeling terms would be both parameter learning as well as structured learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 372.884,
    "end": 379.135,
    "text": " You know, it's interesting to see what a night of sleep does you whenever you are working on a problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 379.295,
    "end": 386.548,
    "text": "And then suddenly the next day, maybe you feel as if you've realized the answer or at least have found some kind of clarity that you didn't have prior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 388.932,
    "end": 393.981,
    "text": "See, we're also reminded of, you know, the deep relationship between.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 394.501,
    "end": 395.342,
    "text": " active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 395.382,
    "end": 409.338,
    "text": "And when we're talking about action, perception, planning, all these kinds of things, they not just look at, you know, neuronal processes in the brain, but it also has heavy overlap with a lot of ideas from, of course, cognitive science, as well as kind of psychology in a broader sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 409.879,
    "end": 414.644,
    "text": "You know, there are interesting papers for those who might be interested in psychology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 414.705,
    "end": 415.986,
    "text": "And, you know, there's a",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 416.843,
    "end": 442.598,
    "text": " um some interesting work that's been done on trying to relate you know the active inference though it is operating first principles that of course I mean the whole point of chapter 10 is not to say oh this is a first principles kind of framework and therefore we reject all else instead it is it is kind of opening doors to interdisciplinary um communication dialogue and so on and so it's",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 442.949,
    "end": 449.64,
    "text": " interesting work that's been done on trying to make the point that sometimes it's more of a matter of ontology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 449.7,
    "end": 464.104,
    "text": "Your terminology you use and your respective ontological take or what words are in your vocabulary for describing different kinds of processes or phenomena, or perhaps even the word process has a different meaning from one field to another, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 465.466,
    "end": 468.231,
    "text": "But nonetheless, they do",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 468.481,
    "end": 486.642,
    "text": " kind of discuss some other things that I always kind of emphasize whenever I describe active inference to others, because with the kinds of work that can be done in active inference, say in psychology or something like precision psychiatry and, you know, the notion that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 486.959,
    "end": 499.793,
    "text": " that a neurotransmitter might be modeled as a kind of precision or attention related or synaptic gain related parameter over a distribution in a model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 500.494,
    "end": 516.932,
    "text": "You know, we're finding, especially today, the relationship between a lot of these kind of cognitive science and kind of psychological sciences, like concepts and notions, but actually being able to find different ways to approximate them or even test them and fit them to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 517.199,
    "end": 528.412,
    "text": " experimental data using modern machine learning, reinforcement learning, active inference in some ways can be interpreted as a kind of variation of reinforcement learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 529.153,
    "end": 545.232,
    "text": "And so it's just kind of leveraging modern tools, technologies, and so on, not just to try and create the next kind of superhuman AI, but to actually find ways where possible to kind of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 545.752,
    "end": 562.335,
    "text": " you know, model the dynamic or causal relationships in living organisms or in broader processes or modeling, you know, potentially entire societies in some way and looking at collective, emergent collective behavior or otherwise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 562.836,
    "end": 575.573,
    "text": "And so it's, I like to emphasize sort of the work of someone who collaborated with Carl Friston at one point in time, Yori Busaki, who's a,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 575.857,
    "end": 577.059,
    "text": " took a lot of influence from.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 577.099,
    "end": 594.824,
    "text": "He's done a lot of work in kind of like rhythmic processes in neuronal activity, looking at things like gamma versus beta and alpha frequency bands as kind of extracted through and engaged in with like spectral analysis when looking at neuroimaging data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 595.424,
    "end": 605.779,
    "text": "And he and many others have been making the point that the cognitive and psychological sciences should perhaps today be a little bit more wary of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 605.759,
    "end": 611.791,
    "text": " of a really brilliant mind that was William James in the 19th century.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 612.232,
    "end": 626.721,
    "text": "But we should maybe be wary of a lot of these inherited Jamesian categories, which, quote, despite their great heuristic value, may be quite arbitrary, or they may not correspond to separate cognitive and neural processes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 626.701,
    "end": 655.358,
    "text": " so the authors here again they reference pisaki as well for example whose work suggests a more critical stance towards using james as the theoretical springboard from which to kind of confine our empirical undertakings though james's work should not be neglected per se bisaki advised an inside out approach to neuroscience and neurobiology such that mechanisms and neural underpinnings are studied at or alongside if not prior to determining the supposed cognitive",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 655.338,
    "end": 676.519,
    "text": " mechanisms mechanisms in play it's you know there's a kind of um you know in an interview he said like oh we'll take any you know college level uh psychology class and look at a lot of the terminology that's being used then and then go to you know some of William James's classic work and have a look at the table of contents and you'll realize there's a lot of the same terms that we're using today right",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 676.499,
    "end": 687.387,
    "text": " But perception and perception is broken into so many different sorts of meanings and is used differently in their debates over what perception is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 687.527,
    "end": 693.462,
    "text": "And active inference kind of inserts itself into that debate to say, well, yeah, there's perception, but we don't just",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 693.442,
    "end": 700.712,
    "text": " passively perceived things, which is kind of a kind of artifact of the 19th century.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 700.952,
    "end": 710.965,
    "text": "And it's its take on on something like what was emerging in a later called psychology, which is, you know, the idea that we're just kind of passively taking in sensory stimuli.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 711.686,
    "end": 714.71,
    "text": "Instead, we're acting in the world, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 714.73,
    "end": 722.2,
    "text": "And we pick up objects, we look at them from different angles, and we sort of test our beliefs, you know, and that's part of the learning and inferential process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 722.568,
    "end": 726.394,
    "text": " And again, that kind of bounded rationality notion, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 726.414,
    "end": 728.457,
    "text": "We're in bodies and we're functioning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 728.497,
    "end": 749.368,
    "text": "So all this is to say, it's interesting, one, to kind of situate active inference within a broader historical context, one that is contending with sort of the history of psychology and the social and behavioral and cognitive sciences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 749.652,
    "end": 766.994,
    "text": " And also looking at it in the context of today, the world of AI, where you could effectively make an active inference agent who does a variety of things that anyone would want them to do as far as something like reinforcement learning goes, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 767.014,
    "end": 773.803,
    "text": "Like they're taking in data or observations, and then they're doing different kinds of inferential processes, and then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 774.239,
    "end": 778.668,
    "text": " emitting some kind of output, depending on what kind of actuators you connect to it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 779.61,
    "end": 786.123,
    "text": "So if you give it arms, then it can maybe move its arms and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 786.263,
    "end": 793.417,
    "text": "So the book, nonetheless, is trying to kind of rally together a lot of these different disciplines.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 793.878,
    "end": 795.842,
    "text": "So we look at",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 796.143,
    "end": 798.889,
    "text": " anything from cybernetics and kind of control theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 799.491,
    "end": 807.469,
    "text": "We look at its relation to more general notions of predictive processing, which is a rather broad category.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 807.549,
    "end": 814.725,
    "text": "Also a relationship to predictive coding is a sort of subset or variation of predictive processing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 815.228,
    "end": 844.763,
    "text": " we're kind of re-re-reintroduced to the Bayesian brain hypothesis, which is heavily related, of course, the notion of the brain does something like, it's still a matter of debate if we're saying it expressly does this or if it does something like, but we could say at minimum for active inference, it does something like updating its beliefs using some kind of prior information in order to infer some sort of updated belief or a posterior belief.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 845.097,
    "end": 860.976,
    "text": " We're looking at action control theory, ideomotor theory, reminded of proprioception and kind of motor commands and movement, utility and decision-making, which then can start to kind of actually look like something like economics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 861.056,
    "end": 869.446,
    "text": "And we know that there are these risk terms that are kind of interpreted from some variations of the expected free energy formula.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 870.307,
    "end": 874.952,
    "text": "Again, behavior-bounded rationality,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 875.978,
    "end": 878.441,
    "text": " Valence, emotion and motivation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 878.502,
    "end": 887.815,
    "text": "I've personally always kind of found that interesting and that touches kind of on psychology again and cognitive science.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 887.835,
    "end": 896.747,
    "text": "But I've repeatedly shared this paper with others just because I think it's kind of enlightening for those who are kind of starting to get more deeply into active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 896.808,
    "end": 902.656,
    "text": "It seems like people commonly come across this one deeply felt affect, which is a few years old now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 903.617,
    "end": 905.58,
    "text": "But it just, you know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 905.746,
    "end": 933.103,
    "text": " lot of these kind of names on the paper are you know some of the kind of the early kind of who have done a lot of the the kind of heavy lifting with developing active inference and sort of finding ways to formalize it advance it uh teach it and uh who are still very active today and this is a nice like you know in some ways it falls in line with with in affective neuroscience uh the work of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 933.421,
    "end": 936.085,
    "text": " Uh, there are some who would not like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 936.105,
    "end": 943.675,
    "text": "I, I say this, but I still see the connection with, uh, with something like socially constructed affect or not affect, but rather emotion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 944.215,
    "end": 946.318,
    "text": "Whenever trying to talk about like, what is emotion?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 946.338,
    "end": 948.08,
    "text": "What is, you know, what, what does that mean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 948.12,
    "end": 949.362,
    "text": "How does it work?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 949.382,
    "end": 961.538,
    "text": "So we have, you know, in some variations we have like, um, and the idea that emotion can be broken into like, you know, seven or so discrete categories and then any kind of emotional.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 961.889,
    "end": 990.31,
    "text": " know expression that you see someone have or they say they're feeling some kind of emotion it's going to be somewhere in the realm of of those seven categories as if they were like clusters that were extracting from a bunch of noisy data or something like that um you know that that would then be linked kind of to to the more archaic area of our of our brains and be related to evolution and we have this and then there are others who you know do this more socially constructed idea of emotion where actually",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 990.29,
    "end": 1004.03,
    "text": " It aligns with active inference as far as my take on it goes, which is that the idea is that actually it's your body and interoception that generate a significant amount of signals that we can then observe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1004.491,
    "end": 1017.85,
    "text": "So it's not that we start with feeling sad and then we feel a tightness in the stomach or some other kind of bodily feeling, a feeling of lowness or exhaustion or something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1017.83,
    "end": 1045.052,
    "text": " instead it's the other way around it's like we start feeling the observations first then we start to infer like oh I must be sad right like that it's actually that kind of direction and and it's quite similar to active inference whenever we think of of state in uh state inference right because the idea is that you're taking in observations and then you infer a kind of hidden state of the world or belief including beliefs about one's own body and then of course we have you know human language is you know a way",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1045.252,
    "end": 1047.655,
    "text": " or attempt to articulate what those feelings are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1047.675,
    "end": 1051.64,
    "text": "And so actually it's saying you're sad is coming after all of that, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1052.762,
    "end": 1053.343,
    "text": "Is one take.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1053.803,
    "end": 1066.72,
    "text": "In any case, it's very interesting to see, like this is one example of kind of how using an active inference sort of framework can actually help us to interpret or reinterpret",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1067.037,
    "end": 1077.814,
    "text": " a broad variety of phenomena, just by kind of relying on or sticking to some of these normative framework, like, you know, perspectives on what is what is hidden state inference?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1078.155,
    "end": 1083.223,
    "text": "And what does that say about about emotion or emotionality and then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1083.693,
    "end": 1088.36,
    "text": " Um, how do we, how do we construct those things and how do we, you know, how do we model them?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1088.74,
    "end": 1097.173,
    "text": "And so I just thought I'd spend an extra minute on this just because it's sort of an example of, you know, the many active inference papers that have been published.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1097.193,
    "end": 1102.14,
    "text": "It's like, well, yes, we can talk about these sort of everyday phenomena, seemingly everyday phenomena.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1102.12,
    "end": 1132.127,
    "text": " uh you know like like emotion or or affect but then what we can do is actually start to sort of formalize different kinds of models consider like okay well if we did have to make a model that was simple as possible but no simpler um what what does that look like in order to properly model emotion beyond just you know at some point the ideal is to fit it to empirical data but even getting you know even prior to that how do we how do we even start imagining this we've had questions in the past",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1132.107,
    "end": 1156.393,
    "text": " from learners who say you know what what if you have bad what if you're modeling something what if your priors are just bad in the sense of like what if what if they don't work appropriately or what if they don't lead to the sort of the optimal or expected outcome that you know that we have um you know isn't that kind of a funny thing to you know include poor priors in the beginning and I mean",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1157.977,
    "end": 1161.642,
    "text": " whenever we're getting started on modeling, we just don't, we don't know, right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1161.722,
    "end": 1174.941,
    "text": "You use prior literature that's been published or developed and ideally, you know, peer reviewed and, and you move in the direction of, you know, you have a hypothesis and you, so you end up having your own hypothesis about the model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1175.682,
    "end": 1180.308,
    "text": "And then, and then you, you kind of try different things and then you try to fit it to empirical data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1181.17,
    "end": 1184.254,
    "text": "And, and that's sort of the interesting aspect of,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1184.521,
    "end": 1209.194,
    "text": " of active inference and other models that kind of work similarly is that, you know, you might start with bad priors, but over time, if the model engages in different kinds of inference and learning, you know, processes, then ideally it gets better in the same way that someone who doesn't know calculus can sit down and start studying calculus.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1209.595,
    "end": 1214.241,
    "text": "They have awful priors, presumably, because they haven't learned anything about it yet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1214.727,
    "end": 1216.529,
    "text": " And over time, they learn it, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1216.549,
    "end": 1216.95,
    "text": "Hopefully.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1217.791,
    "end": 1221.575,
    "text": "So that's kind of the, you know, we find ourselves on the outside here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1221.995,
    "end": 1233.829,
    "text": "We are constructing our own kind of objective model or almost think of it like we're creating an object out of, you know, an agent and then trying to understand them and kind of how they work on the inside, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1235.311,
    "end": 1237.473,
    "text": "So anything else?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1239.936,
    "end": 1241.859,
    "text": "I think I've largely covered a lot of this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1241.879,
    "end": 1243.941,
    "text": "We also talked about",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1244.14,
    "end": 1262.318,
    "text": " attention salience and epistemic dynamics which is uh an interesting piece you know and we didn't cover these terms too strongly in this in this uh particular run of the textbook but uh we know that that attention is related to to something like precision",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1262.669,
    "end": 1276.082,
    "text": " So the idea of like kind of sharpening one's precision in the sense of, you know, how certain are you about your beliefs or how certain are you about the stimuli that you're receiving, what you're observing, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1276.102,
    "end": 1285.571,
    "text": "You imagine someone who's kind of sleepy and so they're not fully taking in what's going on in their visual field is kind of a crude, quick example, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1285.611,
    "end": 1292.338,
    "text": "Versus someone who's, you know, fully taking in sort of the moment, but these very kind of,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1292.538,
    "end": 1295.595,
    "text": " know everyday use of terms here um but but",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1295.913,
    "end": 1303.583,
    "text": " We've already made it through a lot of the kind of mechanical aspects and formula and hurdles in the textbook up to this point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1303.663,
    "end": 1305.925,
    "text": "So I'm just avoiding rehashing them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1307.628,
    "end": 1309.23,
    "text": "Relationships with causal inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1310.351,
    "end": 1312.874,
    "text": "How do you establish causality in these kinds of models?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1313.535,
    "end": 1325.65,
    "text": "The nice thing is that whenever you construct a model like this, like we're constructing, if you can view a model kind of as a graph, and then you can kind of start to look at the flow of it,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1325.967,
    "end": 1332.035,
    "text": " Or whenever you look at hierarchical message message passing like we saw in Chapter five and you can actually see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1332.495,
    "end": 1348.296,
    "text": "You know, we can start to look at these models it's like nodes and edges and with a kind of directedness in the in the edges right so passing matches messages from from one node to another or from one variable to some other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1348.63,
    "end": 1364.944,
    "text": " piece of the model, whether it be, you know, some kind of equation or conditional probability distribution or otherwise that connects them and relates them and allows for inference or reaching kind of the end or a kind of like delta or clamp.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1366.785,
    "end": 1373.191,
    "text": "Essentially, I mean, it's, you know, sometimes modeling is as much an art as it is a science.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1373.211,
    "end": 1376.754,
    "text": "And I think many other people would be quite inclined to agree.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1376.774,
    "end": 1378.215,
    "text": "And then,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1378.516,
    "end": 1379.337,
    "text": " A few more things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1379.938,
    "end": 1382.542,
    "text": "We already know that this is heavily related to machine learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1382.562,
    "end": 1393.7,
    "text": "We saw a lot of examples of other models in chapter four before we got to what eventually we understood to be the POMDP model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1393.78,
    "end": 1399.289,
    "text": "It's like, yeah, you create a machine learning model or a linear regression model or something more simple.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1399.569,
    "end": 1405.198,
    "text": "But the idea of being able to take in values using some kind of transformation in order to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1405.178,
    "end": 1411.105,
    "text": " you know, elicit some kind of output that's a broader theme.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1414.31,
    "end": 1422.78,
    "text": "Robotics, which has been very, you know, very interesting to see, you know, the sort of developments in robotics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1423.882,
    "end": 1432.873,
    "text": "I've spoken with a couple of recent learners who had interest in, excuse me, I'll find a better way to, but there is a,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1435.756,
    "end": 1438.88,
    "text": " And I just, I hope I can find this if I can't.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1438.9,
    "end": 1442.144,
    "text": "And if there's anyone who's interested in it, I'll, I'll share it again in future.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1442.985,
    "end": 1447.53,
    "text": "But, um, this is a few years ago, so there's going to be a lot more by now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1447.971,
    "end": 1449.413,
    "text": "Um, active inference robotics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1450.694,
    "end": 1451.015,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1451.035,
    "end": 1454.799,
    "text": "So, I mean, there, there, you know, last year we did an entire symposium.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1454.819,
    "end": 1459.044,
    "text": "Robotics was a theme, um, you know, with the, with the Institute.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1459.725,
    "end": 1465.392,
    "text": "And then if you just kind of browse around, this is 2019.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1465.827,
    "end": 1483.245,
    "text": " And active inference for robot control and and there's this again 2019 so so it's just because because I think in the theme of Chapter 10 of kind of the breadth of what active inference can touch upon or cover.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1483.529,
    "end": 1498.851,
    "text": " or relate to or inform, this is just like looking at the breadth of, you know, these kinds of principles can be used like in real world settings for those who are interested in like, you know, business or enterprise or productions or something like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1498.871,
    "end": 1507.224,
    "text": "I mean, you can use them to create actual, you know, effective agents who operate within the world, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1507.304,
    "end": 1510.228,
    "text": "Whether it be some kind of, you know, real time,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1510.462,
    "end": 1514.948,
    "text": " online learning, you know, model that's, you know, repeatedly taking in data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1514.968,
    "end": 1516.551,
    "text": "It could be, you know, robotics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1516.591,
    "end": 1539.102,
    "text": "We know that from last year there was an active inference, like a drone that was built and showcased, though sadly there's no, there probably is a public video somewhere, but at the, yeah, yeah, directions of travel and active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1539.436,
    "end": 1550.207,
    "text": " Anyway, I'm jumping around a little bit, but it's just to show that this can relate to a variety of fields.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1550.528,
    "end": 1557.315,
    "text": "And of course, many of the folks who started first in the rest are quite familiar with a lot of these other fields.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1557.435,
    "end": 1561.86,
    "text": "So it's just to say that active inference is more so start.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1561.98,
    "end": 1564.442,
    "text": "It's starting a conversation with other fields.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1565.143,
    "end": 1567.806,
    "text": "It's continuing conversations with other fields.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1568.157,
    "end": 1596.848,
    "text": " And all the while, it's kind of establishing its own normative framework, which, in my opinion, is highly interpretable because we have capacity for relating a variety of functionalities and formula and equations in models to actual terms like habits or planning or what is perception and these other kinds of things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1597.334,
    "end": 1603.266,
    "text": " Is there anyone who would like to touch on anything in particular?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1603.706,
    "end": 1606.091,
    "text": "Yeah, John, please go for it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1607.955,
    "end": 1613.706,
    "text": "Yeah, so I have some concerns about some of the wording in this chapter, and I'd like some clarification.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1615.73,
    "end": 1619.798,
    "text": "Let's see, I'm doing the control F thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1624.182,
    "end": 1624.443,
    "text": " What?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1626.286,
    "end": 1626.847,
    "text": "Oh, let's see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1626.988,
    "end": 1628.911,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1628.931,
    "end": 1629.212,
    "text": "Sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1630.033,
    "end": 1632.057,
    "text": "I thought I had this queued up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1637.007,
    "end": 1637.929,
    "text": "To go through again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1638.069,
    "end": 1641.516,
    "text": "So, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1641.867,
    "end": 1654.887,
    "text": " So one of the things I have concerns about is it says that one benefit of active inference is that it provides a complete solution to the adaptive problems that a sentient organism have to solve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1656.47,
    "end": 1657.492,
    "text": "What do you mean by that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1657.612,
    "end": 1664.162,
    "text": "Because a formal system can't be complete and consistent, among other things, like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1664.564,
    "end": 1672.757,
    "text": " Normally, if I hear someone say they have a complete framework of everything that has to do with thought, it sounds a bit odd.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1672.777,
    "end": 1675.321,
    "text": "So I wonder what you mean by complete.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1677.825,
    "end": 1678.245,
    "text": "No, good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1679.147,
    "end": 1680.288,
    "text": "No, good pointing that out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1680.308,
    "end": 1687.72,
    "text": "And I am also rather suspicious whenever someone, you know, it almost sounds like a sales pitch or something to say that something's, you know, good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1687.987,
    "end": 1690.831,
    "text": " before a complete solution, you know, end all be all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1691.351,
    "end": 1715.023,
    "text": "So here, I mean, I've always interpreted that as it earlier on in the textbook, they, they, they give this explanation, you know, whether it's necessary or not, they give an explanation of what they call the, the needs versus scruffies needs always seek unification beyond the heterogeneity of brain and mind phenomena.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1715.746,
    "end": 1720.494,
    "text": " which usually corresponds to designing top down normative models to start from first principles.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1721.136,
    "end": 1726.746,
    "text": "Meanwhile, just because something's just because something's from first principles doesn't mean it's complete, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1726.806,
    "end": 1728.429,
    "text": "All math is from first principles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1728.449,
    "end": 1729.811,
    "text": "No math can be complete.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1730.873,
    "end": 1731.695,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1731.715,
    "end": 1732.015,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1732.256,
    "end": 1735.341,
    "text": "It's so they're not, they're not necessarily saying,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1735.642,
    "end": 1743.435,
    "text": " they're not necessarily making some broad ontological or epistemological statement, I think, from my understanding of this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1744.276,
    "end": 1747.421,
    "text": "It is kind of a weird thing to say, so I wonder what they mean by that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1748.964,
    "end": 1762.746,
    "text": "Well, what it does do, what I do think they mean by it, or what kind of value there is to take away from that sentence, so I do kind of implicitly agree that maybe it could have been reworded to make it clearer on what they're going for, but",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1763.08,
    "end": 1784.295,
    "text": " I brought up the neats versus scruffies bit because the scruffies idea is that there are a lot of, you know, it's kind of like imagine a lot of researchers who are sort of, you know, going against the grain and they're moving in their own kind of unique direction and they're going after, you know, whatever it is that's driving them or they're working with a team or, you know, have some kind of funding or otherwise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1784.579,
    "end": 1801.474,
    "text": " whatever it is that's kind of drawing them towards wanting to hyper focus or specialize on a particular phenomena, potentially to the detriment of looking at other phenomena, then what happens is you can potentially end up with someone who's so terribly focused on perception.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1801.454,
    "end": 1807.12,
    "text": " that they leave out action or they're so focused on planning that they leave out attention.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1807.621,
    "end": 1817.613,
    "text": "And so my take on this is that it's trying to say a complete solution in the sense that the book is focused on something like sentient organisms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1818.413,
    "end": 1821.777,
    "text": "What is the task that they're trying to solve?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1822.198,
    "end": 1827.664,
    "text": "Active inference as a framework where it's saying they're not trying to model necessarily the entire brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1827.998,
    "end": 1853.82,
    "text": " It's kind of focused on a sort of belief space framework where agents are trying to solve a problem or a task, whether it be as simple as the autonomic system who is breathing and regulating blood oxygen flow to a mouse in a tea maze or an entire society trying to function within an economic system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1853.8,
    "end": 1872.467,
    "text": " and and so with that it's like well now we we have an understand it provides a kind of understanding or or solution for understanding all of these different phenomena right is it ever going to be fully complete i mean i that's you know well no that's mathematically impossible",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1872.751,
    "end": 1882.614,
    "text": " Yeah, if you want to take that hard line assumption that this is about mathematics, but I don't know if this sentence is purely about mathematics is all I mean to say.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1883.055,
    "end": 1888.988,
    "text": "I think it's more about describing a kind of perspective, and that's the issue, right, with theory is that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1888.968,
    "end": 1912.63,
    "text": " we're dealing in words and in sentences and full you know pair things can get kind of meshy for lack of a better word it's it's about as ambiguous as i think this statement could be interpreted as if looked at from particular angles so okay but i have concerns about this other phrase too and it's sort of the same concern because they kind of go together it says",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1912.745,
    "end": 1938.972,
    "text": " uh what does it say it says evolution appears to have discovered increasingly sophisticated design structures for brains and bodies that made organisms able to deal with and shape rich ecological niches fine but then it says modelers can reverse engineer this process and specify brains and bodies of the creature of interest in terms of generative models like really you know how to build a cat",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1940.538,
    "end": 1966.933,
    "text": " it's so with that let's see let me just make sure i understand it in context complex pursuits yeah yeah yeah so i mean i mean in a sense yes to answer your question in a sense yeah i mean in so in chapter seven we look at the teammates example right like that's like a really simple thing though it's not like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1967.2,
    "end": 1975.009,
    "text": " You couldn't build a cat brain in the laboratory using that, or as far as I can tell, any of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1978.313,
    "end": 1987.804,
    "text": "The idea that you're reverse engineering, and that you can specify the designs for brains and bodies, that implies that you could make one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1990.507,
    "end": 1991.228,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1991.248,
    "end": 1993.41,
    "text": "I mean, it's not...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1994.858,
    "end": 2022.013,
    "text": " it's not contradicting like yeah yeah it it is kind of saying that in a sense you're still ultimately modeling it right but you're so you do have to make decisions but it kind of goes back to what i was saying earlier it says you can specify the designs for brains and bodies that that implies that you can design them because if you have a design you can design it right are you are you trying to point out the the the separation between actually modeling uh you know a",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2022.584,
    "end": 2025.487,
    "text": " a cat's brain, for example, versus the reality?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2025.547,
    "end": 2028.85,
    "text": "And are you making an assumption that we'd never be able to do that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2029.071,
    "end": 2032.414,
    "text": "Well, no, it doesn't matter if we'd ever be able to do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2032.434,
    "end": 2035.297,
    "text": "The problem is we can't do it now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2035.377,
    "end": 2045.788,
    "text": "And so say modelers present tense can reverse engineer this process and specify present tense, the designs for brains and bodies, the creatures of interest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2045.868,
    "end": 2047.99,
    "text": "That's it's a weird thing to say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2048.03,
    "end": 2052.034,
    "text": "That's like Victor Frankenstein almost like I don't",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2053.347,
    "end": 2059.597,
    "text": " Sorry, to be honest, I'm not really sure how to address this much further.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2059.617,
    "end": 2065.747,
    "text": "So just to stick to the textbook, Chapter 7, they make a mouse, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2065.887,
    "end": 2067.49,
    "text": "They model a mouse.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2067.51,
    "end": 2068.812,
    "text": "They model it in a T maze.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2069.112,
    "end": 2069.773,
    "text": "None of it's real.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2070.114,
    "end": 2072.978,
    "text": "So the formal technical term for that would be in silico.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2073.679,
    "end": 2075.963,
    "text": "And so that is what they do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2076.23,
    "end": 2079.733,
    "text": " It's not the design of the brain and the body.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2079.794,
    "end": 2086.02,
    "text": "It's just a very simple model of one aspect of something that a mouse can do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2086.26,
    "end": 2092.586,
    "text": "I believe in that model, which is very simple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2092.867,
    "end": 2097.151,
    "text": "The brain of the mouse and the body of the mouse aren't even really in the model at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2097.191,
    "end": 2102.776,
    "text": "They are and they're not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2102.796,
    "end": 2105.359,
    "text": "I agree that in a literal sense, no, they're not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2105.727,
    "end": 2118.066,
    "text": " Uh, what are you trying to, sorry, John, in what we're trying to do with, with active inference is that we're just trying to model the, you know, it is expressly what the textbook states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2118.487,
    "end": 2122.653,
    "text": "It's just trying to model the problem that the brain is trying to solve in that instance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2123.034,
    "end": 2124.416,
    "text": "If you think that the problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2124.977,
    "end": 2129.784,
    "text": "That the organism is facing is much bigger, such as, you know, oh, it's not a mouse in a T maze.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2129.824,
    "end": 2131.026,
    "text": "It's a, it's a mouse.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2131.377,
    "end": 2139.869,
    "text": " you know, in, in the woods or something, you know, and to where, to where you have now, you have to create like a broader environment, maybe create other agents who are in there as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2139.889,
    "end": 2147.118,
    "text": "Maybe there's some kind of, you know, a world design where they, they have movement that goes beyond just moving left or right or moving to a queue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2147.159,
    "end": 2153.587,
    "text": "Instead, it's a much more like a broad, like grid, discrete space, or maybe it's continuous space or, or otherwise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2153.928,
    "end": 2159.275,
    "text": "But I mean, that's a temp, you know, that's in a sense, we are trying to,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2159.761,
    "end": 2165.855,
    "text": " anyone who's modeling something is trying to recreate its dynamics to better understand how it functions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2165.896,
    "end": 2168.582,
    "text": "And so I just kind of quickly Googled like cancer modeling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2168.622,
    "end": 2176.2,
    "text": "It's like this, the majority of research is being done on cancer is involving computational modeling of cancer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2176.433,
    "end": 2188.531,
    "text": " So while I do, I think I do, I kind of sympathize and understand maybe the point that you're making, like, you know, but it's not to say that there's some kind of hubris of saying we're going to model the brain perfectly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2188.571,
    "end": 2193.579,
    "text": "We're going to reverse engineer and we're, you know, just assume that we can just magically do that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2193.939,
    "end": 2197.024,
    "text": "But it is making the point that like, this is, this is what most,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2197.342,
    "end": 2206.937,
    "text": " most people are doing in a sense that, you know, I, maybe it's not worded well, maybe it's a little bit clever to say like, oh, well, if, if, cause, cause they're relating it to other fields, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2206.997,
    "end": 2209.661,
    "text": "So we're looking at, you know, they relate it first to evolution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2209.742,
    "end": 2217.995,
    "text": "It's kind of like saying, well, evolution is what's kind of producing the reality of, of the organisms that we find in the world around us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2218.455,
    "end": 2223.383,
    "text": "But then from the other end, it's like a modeler is attempting to reverse engineer that they're attempting to kind of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2223.835,
    "end": 2228.12,
    "text": " create that or recreate that in kind of like the opposite direction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2229.001,
    "end": 2236.429,
    "text": "I understand what modeling is, but I think my problem is really more with two words here, specify and designs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2236.449,
    "end": 2238.651,
    "text": "Specify implies that it's specific.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2238.731,
    "end": 2247.801,
    "text": "It's not just some general vague thing that simulates some aspect, but the specific design for the brain and the body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2248.118,
    "end": 2252.564,
    "text": " And then designs, of course, implies you can build one, but no one can build a cat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2252.664,
    "end": 2258.092,
    "text": "So I'm just perplexed as to why it's like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2259.814,
    "end": 2261.076,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2261.096,
    "end": 2261.516,
    "text": "Yeah, I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2261.556,
    "end": 2271.41,
    "text": "I think we might have to kind of agree to disagree on this one a little bit because I don't fully, I mean, that is, you know, that is what we do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2271.85,
    "end": 2277.518,
    "text": "If I sit down to kind of model, I don't know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2278.223,
    "end": 2282.277,
    "text": " I don't wanna get too far away from the example we're talking about, but if I wanna model",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2282.965,
    "end": 2291.875,
    "text": " like, I don't know, the end of day stock price from financial data, like I'm gonna have to make some decisions on how to do that, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2291.955,
    "end": 2299.224,
    "text": "I'm gonna have to specify some things and I'm gonna have to design some things in order to make that happen, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2299.244,
    "end": 2300.846,
    "text": "So I think these are rather broad terms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2300.966,
    "end": 2304.83,
    "text": "Yeah, but you would specify the designs for plants, which is easy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2305.251,
    "end": 2308.395,
    "text": "Specifying the design for a brain is not easy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2308.475,
    "end": 2311.318,
    "text": "I don't think anyone can do it and it's,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2311.298,
    "end": 2313.501,
    "text": " not a thing I would say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2319.13,
    "end": 2322.495,
    "text": "There has been some interesting work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2322.575,
    "end": 2326.22,
    "text": "There's been some attempts to do this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2326.441,
    "end": 2328.924,
    "text": "I think there are plenty of people who would still agree with you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2328.944,
    "end": 2336.175,
    "text": "But I mean, there are folks who at least have the aspiration and are even, you know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2336.746,
    "end": 2345.976,
    "text": " I know there's an aspiration, I sort of hear it myself, but to suggest that it's already been achieved is... Yeah, if I can jump in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2346.577,
    "end": 2347.999,
    "text": "Yeah, please do, Steve.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2348.019,
    "end": 2349.64,
    "text": "I take John's part here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2350.141,
    "end": 2353.104,
    "text": "I'm very sympathetic to what you're saying, John.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2353.405,
    "end": 2365.318,
    "text": "I also just assume there is so much not said or rather implied in the textbook",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2365.552,
    "end": 2371.499,
    "text": " that I don't take it to a mathematical precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2371.96,
    "end": 2376.645,
    "text": "The words are an approximation of what is intended.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2377.566,
    "end": 2382.672,
    "text": "And I completely agree that this isn't a closed system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2383.873,
    "end": 2394.546,
    "text": "And if it were a closed system, it could not be completely described without, I mean, consistently completely described.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2395.673,
    "end": 2405.69,
    "text": " And I really think what you're bringing up is worth bearing in mind always that a model is not the system itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2406.271,
    "end": 2407.513,
    "text": "It's a model of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2409.376,
    "end": 2421.917,
    "text": "Designing, saying that the brain can be reverse engineered, I just assume that means",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2422.808,
    "end": 2427.756,
    "text": " an approximation of the architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2427.989,
    "end": 2434.897,
    "text": " can be created based on this framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2436.279,
    "end": 2445.65,
    "text": "I think too many people do have the assumption that, yeah, the brain can be created, can be re-represented.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2446.231,
    "end": 2448.734,
    "text": "And I just don't think that's possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2450.076,
    "end": 2455.742,
    "text": "The complexity is beyond the ability at this point in our technology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2456.603,
    "end": 2457.945,
    "text": "But it's, I think,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2458.972,
    "end": 2463.045,
    "text": " intending to mean an approximation, always.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2463.827,
    "end": 2468.382,
    "text": "That's my take on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2468.402,
    "end": 2469.525,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2469.545,
    "end": 2472.053,
    "text": "Well, yeah, so it would probably... Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2472.556,
    "end": 2475.221,
    "text": " Sorry, I'm just seconding that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2475.241,
    "end": 2482.914,
    "text": "I mean, that is essentially what's going on with the modeling, whether it be an active inference or otherwise, but it is made explicit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2483.354,
    "end": 2485.378,
    "text": "I mean, I agree with you both.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2485.899,
    "end": 2490.126,
    "text": "The complexity of actually modeling the brain, and not only that, but what would be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2490.781,
    "end": 2495.727,
    "text": " You know, another question, a whole nother question that comes up is what would be the purpose of that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2495.827,
    "end": 2505.097,
    "text": "I mean, we, we can maybe intuit like, oh, it would be interesting where we'd find some kind of realization, but it's, I mean, we start to get a little close to sci-fi, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2505.117,
    "end": 2508.922,
    "text": "It's like, well, once you create the brain, it does, it's not really a brain of any particular person.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2508.962,
    "end": 2509.663,
    "text": "It's its own thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2509.683,
    "end": 2512.185,
    "text": "Now it's going to go off on its own trajectory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2512.205,
    "end": 2513.607,
    "text": "So now is it even reflected?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2513.667,
    "end": 2516.59,
    "text": "Is it going to be useful for simulating or studying anything?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2516.691,
    "end": 2519.674,
    "text": "If you, if it's, if that makes any kind of sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2519.789,
    "end": 2528.059,
    "text": " Well, you bring up a good point of why it's really useless to try to create AGI in the way we think of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2528.74,
    "end": 2538.351,
    "text": "I mean, to create artificial intelligence that thinks just like a human, you would have a human intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2540.234,
    "end": 2542.036,
    "text": "So wait, we have that already.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2542.637,
    "end": 2543.738,
    "text": "What's the point of that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2544.494,
    "end": 2545.375,
    "text": " Right, right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2545.395,
    "end": 2545.896,
    "text": "Exactly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2545.916,
    "end": 2549.802,
    "text": "It's like, you know, it's, it's so superhuman immediately.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2550.222,
    "end": 2555.189,
    "text": "Then it wouldn't be what we think of as it would be something else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2555.79,
    "end": 2558.594,
    "text": "That would be wonderful, but it would be something else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2559.496,
    "end": 2562.039,
    "text": "I want to talk about this thing of modeling and approximation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2562.119,
    "end": 2564.663,
    "text": "Cause like sort of everything in science is a model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2565.132,
    "end": 2591.95,
    "text": " there are different kinds of things in science there are models that are precise enough to build stuff with and there are models that aren't really precise enough to build like real world things i'm not talking necessarily about computer programs um there are models that aren't really precise enough to build real world things and by saying that you can specify the design you're suggesting that you have enough precision to build real world things but i i haven't seen uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2592.588,
    "end": 2621.768,
    "text": " i haven't even seen that claim or anything like it made anywhere else in this book uh like i don't know it's odd yeah it's it's a it has a different meaning than what i think you take it as or it has we have to assume it means something different otherwise it wouldn't make any sense just as you're pointing out yeah there is a i'm mostly asking for clarification i want to know what what what that what does that mean why would you write that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2622.895,
    "end": 2631.127,
    "text": " Yeah, it is a strong piece that they, you know, that was quite a choice, I guess, for lack of a better phrase.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2631.207,
    "end": 2639.619,
    "text": "I mean, they expressly say earlier in the textbook, like they are not trying to recreate or even emulate the entire brain piece by piece.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2640.019,
    "end": 2644.466,
    "text": "It's to find a generative model that describes the problem the brain is trying to solve.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2645.046,
    "end": 2651.856,
    "text": "And that might not be, you know, that might not be a particularly satisfying sort of, you know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2652.376,
    "end": 2660.716,
    "text": " TAB, Mark McIntyre, that might not be a very satisfying take for those who are interested in doing something like trying to recreate the entire you know behavior the of the.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2661.358,
    "end": 2662.32,
    "text": "TAB, Mark McIntyre, Sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2662.441,
    "end": 2669.558,
    "text": "TAB, Mark McIntyre, i'm all for it, if you can do it it just saying that you can do it when you can't do is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2671.175,
    "end": 2674.879,
    "text": " Yeah, they, I think it's a, it's a mistake for them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2675.519,
    "end": 2679.363,
    "text": "I think, well, I don't think that sentence should be read so literally.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2679.383,
    "end": 2685.97,
    "text": "Um, but that, that is, that's kind of my final word from myself on my opinion on that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2686.05,
    "end": 2697.621,
    "text": "Cause I think we're, I'd just be belaboring if I tried to describing it more because the whole, I mean, if whenever I see that phrase, for example, complete solution,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2698.327,
    "end": 2706.418,
    "text": " You know, if I think about in terms of mathematics, it looks ignorant or just incorrect.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2706.438,
    "end": 2707.981,
    "text": "Like, why would you say that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2708.361,
    "end": 2720.959,
    "text": "But if I look at it from the perspective of kind of the neat scruffies, but right where I mean, you do have a broad variety of different departments doing very different things who have very strong debates with one another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2722.137,
    "end": 2740.416,
    "text": " if there were a way to model the brain, you know, piece by piece, as we were talking about earlier, I imagine it would at minimum take many more of these departments coming together and agreeing upon a few things in order to even get going with something like that, not to mention the kind of funding that might be necessary to realize something like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2741.117,
    "end": 2747.824,
    "text": "As long as fields stay broadly disparate, including how they use words, their ontologies,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2748.344,
    "end": 2756.635,
    "text": " You know, I think debates are fine, but but I do appreciate, in a sense, the attempt to make kind of a broader framework.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2756.775,
    "end": 2760.6,
    "text": "Is the word complete well used or even relevant here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2760.66,
    "end": 2761.562,
    "text": "Probably not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2761.982,
    "end": 2764.365,
    "text": "But the other thing is they do it twice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2764.726,
    "end": 2768.631,
    "text": "So on page on page.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2768.662,
    "end": 2771.364,
    "text": " On page 196, they do it again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2771.424,
    "end": 2779.452,
    "text": "They say it, that means active inference, starts by providing a complete solution to the problems that organisms have to solve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2780.032,
    "end": 2780.953,
    "text": "So they say it twice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2781.594,
    "end": 2785.717,
    "text": "To the problems that organisms have to, okay, sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2786.598,
    "end": 2787.959,
    "text": "Yeah, I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2787.979,
    "end": 2789.701,
    "text": "I think we're, I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2790.982,
    "end": 2796.247,
    "text": "I mean, they said what they said.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2796.267,
    "end": 2797.588,
    "text": "Sorry, go ahead, Stephen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2797.906,
    "end": 2805.357,
    "text": " I mean just that statement then immediately brings up the question in one's mind, well, in what sense are we talking?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2806.338,
    "end": 2807.16,
    "text": "Complete solution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2808.602,
    "end": 2813.589,
    "text": "That's why I'm mostly asking for clarification because I assume it can't mean what it says.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2813.649,
    "end": 2815.712,
    "text": "Yeah, I agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2816.215,
    "end": 2818.417,
    "text": " Yeah, that's like author's framing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2818.797,
    "end": 2821.18,
    "text": "The book you write gets to have it how you think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2821.62,
    "end": 2828.426,
    "text": "But I'm also thinking, does a wing and an engine provide a complete solution to the problems faced by flight?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2829.127,
    "end": 2829.387,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2829.688,
    "end": 2835.673,
    "text": "Yes, but that doesn't mean that any given plane is going to fly or any given company is going to work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2835.713,
    "end": 2845.142,
    "text": "It's not a guarantee, but it's like, but yes, between lift and thrust, between sensemaking and cognition and action,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2845.122,
    "end": 2867.299,
    "text": " it is like the scheme of a complete solution to the problems of the kind that they do face yes any given inquiry is going to be successful but but it it is like okay the complete meal is the main dish and the side dish doesn't mean you're going to have a successful restaurant but it is a complete approach to cooking dinner if it has those two components yeah",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2869.102,
    "end": 2873.927,
    "text": " It's like the idea of, you know, perception without action, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2874.548,
    "end": 2883.697,
    "text": "So that was my attempt to kind of contextualize some of these things, which, you know, there's an entire subfield known as intellectual history, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2883.737,
    "end": 2896.51,
    "text": "That people try to like do this kind of hermeneutical or exegetical approach to the study of literature, including psychology or otherwise looking at the ontologies, extracting them, relating them to one another, contradictions and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2896.912,
    "end": 2897.653,
    "text": " and all of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2897.813,
    "end": 2902.38,
    "text": "And so it's kind of like active inference is kind of placing itself in a certain part of that trajectory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2902.42,
    "end": 2908.309,
    "text": "And, you know, they have their own take and they're claiming, maybe they should use the phrase more complete.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2908.63,
    "end": 2911.614,
    "text": "I think that would get closer to maybe what they're actually going for.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2912.876,
    "end": 2915.8,
    "text": "You know, more complete than hyper-disparate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2915.96,
    "end": 2917.323,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2917.883,
    "end": 2921.188,
    "text": "But we're not the authors, so.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2921.829,
    "end": 2924.353,
    "text": "Yeah, so it goes, damn it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2924.468,
    "end": 2927.953,
    "text": " Food for thought, but it's still, I mean, it's still a good question, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2927.973,
    "end": 2930.356,
    "text": "Because it does open up onto these bigger questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2930.456,
    "end": 2934.221,
    "text": "And, and, and, and also to Steven's point earlier, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2934.281,
    "end": 2936.363,
    "text": "Like at the end of the day, we're still making proxies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2936.403,
    "end": 2943.793,
    "text": "So if you, if you quote unquote design or specify or design the brain of the mouse and the teammates, it's like, well,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2944.246,
    "end": 2945.327,
    "text": " No, you're not really.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2945.388,
    "end": 2962.971,
    "text": "But in a sense, you you are in this only in the sense of if active inference is making the claim that that the brain does something like perception action as we've described it and looked at state inference and policy inference and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2963.031,
    "end": 2967.857,
    "text": "Then it kind of like you kind of are because the mouse is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2968.242,
    "end": 2997.523,
    "text": " carrying out the the hypothetical in silico mouse is carrying out those processes right we're just kind of running the code that represents that well i thought it would just enter in the last um four minutes could you look at read isabella's question yes up in the chat and just give it first anyone can give the first thought on that and then we'll end in a few minutes yeah absolutely uh no and thanks for your question is about what is the relationship of active inference and autopoetic",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2997.757,
    "end": 3015.462,
    "text": " uh systems it just occurred to me robots can perform active inference while not being autopoietic and there are living systems without central nervous systems like what does it mean about the relationship between active inference and life so let's just um we we do see",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3015.813,
    "end": 3041.145,
    "text": " this term in the textbook but just to like get a quick like autoprocess self-making a system's ability to self-organize self-reproduce and self-maintain through its own internal processes so one interpretation of that is you know to ensure their own reproduction and maintenance well with robots yeah not so sure about the reproduction part maintenance",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3041.682,
    "end": 3066.576,
    "text": " potentially right like like you could have a robot that maybe it doesn't necessarily reproduce but it might have actions that are available to it that it could then use to or or have available to it to take care of itself but i mean that's the that's kind of what separates the the the claim in the textbook about what evolution is led towards such as beings such as us who who who are",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3066.91,
    "end": 3078.346,
    "text": " you know, able of not just reproducing, but also full maintenance versus a robot that, you know, if it doesn't have arms to reach for the power cord to plug itself in or something along those lines, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3078.386,
    "end": 3084.615,
    "text": "It's kind of a silly way of saying that, but in any case, but that is a broader philosophical question as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3085.756,
    "end": 3088.34,
    "text": "You know, what is the relationship between this and life?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3089.802,
    "end": 3095.55,
    "text": "There are, you know, there are many people who have made claims about things like panpsychism,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3095.952,
    "end": 3116.863,
    "text": " uh, things like, you know, well, if you, if really something like sentience or something like, you know, active inference related processes, uh, are just kind of like mathematical formalisms that are playing out before our eyes, thanks to, you know, the Hamiltonian path of least action, uh, or, or other kinds of physical processes, then.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3117.383,
    "end": 3121.446,
    "text": " Is it the case that many things that we didn't think of as sentient before in fact are?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3122.107,
    "end": 3129.693,
    "text": "Is it not the case that like a rock rolling down the hill because of a variety of, is it not doing some kind of state inference?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3132.155,
    "end": 3146.968,
    "text": "These are larger debates that one can engage in, but I personally, I don't really follow that line so much, but there has been some really kind of philosophy of mind, active inference,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3148.13,
    "end": 3174.627,
    "text": " yeah a reference in the chat that is related to that the the handbook of abductive cognition uh kind of gets at this whole epistemological issue of what are what is cognition uh how do we know what we know how why do we call something sentient and not other things uh you know a self",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3175.484,
    "end": 3180.795,
    "text": " regulating system that is not even biological, you know, chemical processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3181.737,
    "end": 3185.606,
    "text": "We don't have to imbue any sentience to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3185.666,
    "end": 3187.209,
    "text": "It's just a natural process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3187.45,
    "end": 3196.108,
    "text": "And just in the same way that biological systems are natural processes, but biological systems interact with the environment in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3196.088,
    "end": 3201.734,
    "text": " adaptive ways, self-generating, self-perpetuating adaptive ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3202.394,
    "end": 3218.311,
    "text": "I think Isabella's question is relevant in that active inference is a way of describing processes in any framework we want to place it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3218.511,
    "end": 3225.218,
    "text": "If it is self-perpetuating or not, you know, evolutionarily,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3225.502,
    "end": 3233.391,
    "text": " versus in this closed timeframe, in this single environment, closed timeframe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3233.411,
    "end": 3236.595,
    "text": "We're still talking about the same natural processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3237.736,
    "end": 3248.488,
    "text": "I think variational free energy is describing a system and we just decide what that system is that we're applying it to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3250.612,
    "end": 3270.156,
    "text": " yeah and it's a great a great connection with the abductive logic and the pragmatism and the open-endedness of evolution because it's like the successive generations intergenerationally or successive beliefs or hypotheses intra-generationally like behavior they aren't just induction deduction",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3270.136,
    "end": 3296.262,
    "text": " elevator rides they're moving laterally and generating new pieces and new compositions in the sort of open-ended reconfiguration and then the niche sweeps it off the table if it doesn't maintain autopoiesis in actuality but that doesn't mean that every map you make of that territory is describing its autopoiesis like in the teammates it's just taken for granted we're talking about a behaviorally alive mouse",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3296.242,
    "end": 3321.608,
    "text": " yes we're not studying the autopoiesis of that mouse but that might be another inquiry yeah yeah it is a classic kind of phrasing that's been used in active inference and elsewhere but the idea of like you know the map is not the territory and that relates back to you know what we were talking about earlier with uh with modeling but anyway we got kind of you know broadened it's you know",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3321.993,
    "end": 3330.631,
    "text": " In reference to that bit about overcoming old categories and 19th century kind of constructions, it's like the notion of sentience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3331.633,
    "end": 3336.643,
    "text": "I'm not sure if going back to read William James or even something from the mid 20th century,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3337.265,
    "end": 3367.272,
    "text": " actually is going to align well with whatever it is that we're discovering in in modern science same thing for any notion of things like consciousness right i mean for some consciousness is literally just like you know you're going to put someone under anesthesia you need to make sure they're unconscious you use you know an eeg you know headset or or otherwise to try and measure quantum consciousness is like a quantitative signal and that's it right it's not even it's not a big broad philosophical category it's literally just a pragmatic",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3367.252,
    "end": 3371.058,
    "text": " practical concept that is useful there in medicine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3371.919,
    "end": 3375.384,
    "text": "Others will say, you know, dramatically different things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3375.404,
    "end": 3379.15,
    "text": "So it's always an interesting conversation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3379.69,
    "end": 3381.012,
    "text": "In any case, we're a few minutes over.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3381.753,
    "end": 3384.758,
    "text": "So thank you all so much for your questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3384.798,
    "end": 3387.522,
    "text": "Sorry, Isabella, for only getting to the question at the end, but I hope that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3388.008,
    "end": 3391.997,
    "text": " that kind of sub conversation was helpful in some kind of way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3392.057,
    "end": 3392.96,
    "text": "Thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3393.04,
    "end": 3396.708,
    "text": "Also just look at this book, $699 for the ebook.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3397.971,
    "end": 3398.452,
    "text": "Let's get it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3398.813,
    "end": 3402.783,
    "text": "It's worth it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3402.803,
    "end": 3404.487,
    "text": "It's hard to get copies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3404.527,
    "end": 3409.358,
    "text": "I have to do library loan, you know, scan chapter at a time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3410.14,
    "end": 3410.4,
    "text": "Wow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3410.862,
    "end": 3411.082,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3411.443,
    "end": 3411.924,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3411.944,
    "end": 3412.445,
    "text": "Thank you all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3412.906,
    "end": 3413.307,
    "text": "Bye.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3413.468,
    "end": 3414.049,
    "text": "Thanks everyone.",
    "speaker": "SPEAKER_02"
  }
]