[
  {
    "start": 23.453,
    "end": 45.158,
    "text": " all right welcome everyone it is april 2nd 2025 and this is active inference stream number 11.1 and i'll begin with a github push looking forward to everyone's updates and ideas and questions in the chat this should be an interesting stream",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 46.437,
    "end": 56.245,
    "text": " So the title is April Agents Bring Maze Simulations, OpenManus, RxInferred.jl, and Agent Laboratory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 56.41,
    "end": 82.266,
    "text": " have a few things prepared a few software implementations we can play around with also some topics to explore not sure how any of the demos will go live however it's the hope that a few things will be pretty interesting and we can fix and explore along the way so april agents bring may simulations or as alexandra just pointed out april agents may bring simulations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 84.524,
    "end": 96.546,
    "text": " There are many exciting developments and advancements in the multi-agent synthetic intelligence systems space right now, in a pretty broad sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 97.268,
    "end": 100.153,
    "text": "Short term, medium term, all the terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 100.133,
    "end": 125.972,
    "text": " let's explore a few articulating complementary interesting kinds of multi-agent frameworks autonomous frameworks look at different ways of looking at what makes agentic what kinds of systems engineering are being done within and among the agents all these kinds of orchestration questions looking where we're at instantaneously in april 2025 and more broadly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 125.952,
    "end": 147.133,
    "text": " so um there will be some jumping around since some of the pieces take different amounts of time to to load or play out so again i'm not sure what exactly will come through that'll be part of the fun though um on all of these branches i've been having some",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 148.362,
    "end": 173.037,
    "text": " interesting times um there are three cursor windows open so starting with the two llm type models right now is running in this terminal the work of samuel schmidgall agent laboratory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 176.712,
    "end": 177.753,
    "text": " I'll read the overview.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 178.615,
    "end": 186.485,
    "text": "Agent Laboratory is an end-to-end autonomous research workflow meant to assist you as the human researcher towards implementing your research ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 187.246,
    "end": 200.104,
    "text": "Agent Laboratory consists of specialized agents driven by large language models to support you through the entire research workflow, from conducting literature reviews and formulating plans to executing experiments and writing comprehensive reports.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 200.405,
    "end": 210.381,
    "text": " This system is not designed to replace your creativity, but to complement it, enabling you to focus on ideation and critical thinking while automating repetitive and time-intensive tasks like coding and documentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 211.163,
    "end": 220.017,
    "text": "By accommodating varying levels of computational resources and human involvement, Agent Laboratory aims to accelerate scientific discovery and optimize your research productivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 223.068,
    "end": 244.587,
    "text": " um this has an associated paper describing more so i got it to work initially output a really awesome 17 page paper images equations i have the pdf around then i started modifying it trying to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 244.567,
    "end": 250.736,
    "text": " get more logging, get more access to it, and kind of went too far.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 250.797,
    "end": 256.746,
    "text": "And now I've just pulled back to the main branch that they've provided.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 257.447,
    "end": 261.293,
    "text": "And just to show this experiment while this one's running, and then we'll see how long it takes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 261.333,
    "end": 262.695,
    "text": "Hopefully it'll finish within the stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 264.397,
    "end": 269.325,
    "text": "This YAML file, which they provide some initial examples of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 271.685,
    "end": 276.911,
    "text": " I made a variant that has the following sections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 279.914,
    "end": 289.005,
    "text": "Copying it over with Control-I, write a new YAML compliant file that has this semantics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 289.025,
    "end": 299.937,
    "text": "The goal is to develop a partially observable Markov decision process, POMDP, implementing active inference that is in a thermal homeostatic setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 299.917,
    "end": 321.081,
    "text": " so kind of the classic air conditioner do nothing heater temperature the API key for OpenAI is put here and the uh model is provided for the LLM back end and the review I guess separately",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 322.073,
    "end": 352.08,
    "text": " language here's different stages so i found that when larger numbers were used there were some interruptions i don't know if that was because of stepping away from the computer so these are relatively low levels of steps but it'd be conceivable and interesting to see what happens when literature review is huge numbers or or what happens there how to use a structured knowledge base for literature review um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 352.06,
    "end": 377.798,
    "text": " it's also possible to run multiple labs in parallel then there's these solver steps I wonder if that will throw an air later we'll see these solver steps which are described in the MLE solver and the paper solver",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 380.073,
    "end": 406.215,
    "text": " load an existing save and to compile all the way on through the latex pdf output and then this copies over the notes format and it's doing a pretty multi-staged effort uh the package setup did have a few other packages that on my computer i needed to set up but it was pretty easy to get through those with help of cursor too",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 406.195,
    "end": 412.523,
    "text": " and get the virtual environment and at least get it along the way using the API key.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 412.543,
    "end": 413.544,
    "text": "So this is pretty cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 414.425,
    "end": 426.38,
    "text": "And again, keeping with this sort of just snapshot, I'm sure with slightly different setups or just different settings, these are all really functional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 426.421,
    "end": 432.388,
    "text": "I'm just showing how they're running for me at this moment and hopefully",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 434.09,
    "end": 440.816,
    "text": " coming across some useful outputs, but big picture, agent laboratory, really cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 441.517,
    "end": 452.967,
    "text": "And partnering it in this sort of multi-agent, autonomous agent, LLM type coordination in the second window, we have OpenManus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 454.468,
    "end": 457.411,
    "text": "So I'll read the description.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 457.431,
    "end": 461.835,
    "text": "Manus is incredible, but OpenManus can achieve any idea without an invite code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 464.043,
    "end": 468.249,
    "text": " It's a simple implementation, so we welcome any suggestions, contributions and feedback.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 468.269,
    "end": 470.292,
    "text": "Enjoy your own agent with OpenManus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 471.735,
    "end": 475.34,
    "text": "So look at the demo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 482.912,
    "end": 488.019,
    "text": "Here's videoing into their setup.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 490.964,
    "end": 491.805,
    "text": "Describing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 493.473,
    "end": 503.243,
    "text": " the task, basically carrying out this task within the repo that it's running from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 504.484,
    "end": 523.463,
    "text": "So here there was, I started with a request, write a research report on Davis, California, and output this after 20 steps, but it popped up a browser and now running an enhanced version",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 523.443,
    "end": 527.008,
    "text": " to see if it's possible to get a longer report.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 529.191,
    "end": 532.977,
    "text": "So it could just be how I'm running it or setting it up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 533.658,
    "end": 541.609,
    "text": "But just sort of conceptually, we'll look at the architecture of how it's set up, even if nothing too impressive comes from it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 542.471,
    "end": 551.003,
    "text": "And those will be the two LLM type processes running.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 552.08,
    "end": 561.55,
    "text": " here we are back in the POMDP research review writing code writing um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 564.398,
    "end": 591.57,
    "text": " we'll see if we if we can tell what the output but there are subtasks to what extent these are explicitly described or to what extent there's an initial plan or hierarchical plan formulation how many steps that's taken in how general the prompting all those kinds of things a lot of degrees of freedom just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 593.17,
    "end": 614.706,
    "text": " seeing how it works here it's just you know interesting and then also again OpenMan is where here let's start this one again with a new but did it even result let's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 617.487,
    "end": 625.599,
    "text": " try to improve the logging on OpenManus, then we'll go to the third window, which is the RxInfer.jl.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 635.493,
    "end": 640.761,
    "text": "Given this type of, quote, successful output,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 643.255,
    "end": 672.621,
    "text": " We ensure we are capturing all outputs of cool use better and enabling running tools more intelligently in order to achieve sequential incrementally improving outputs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 676.685,
    "end": 677.406,
    "text": " general case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 680.872,
    "end": 690.027,
    "text": "All right, and then the third window is going to be the rxinfer.jl examples repo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 690.848,
    "end": 692.211,
    "text": "So here's the OpenManus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 693.372,
    "end": 699.823,
    "text": "Now in the third window will be a para repo for rxinfer",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 699.803,
    "end": 720.343,
    "text": " which is under some very interesting and good open source development as part of this growing interesting RxInfer ecosystem including also recently RxEnvironments not going to be probably covered here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 720.323,
    "end": 724.268,
    "text": " and also this recent RxInfer server.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 725.329,
    "end": 734.3,
    "text": "So opening up the possibility for different languages to use API calls into these RxInfer type pipelines through their server.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 735.442,
    "end": 746.736,
    "text": "And this might connect with some general topics in multi-agent, just depends what people write in the chat and where these tools sort of take us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 750.985,
    "end": 759.214,
    "text": " using cursor 0.48, using for the most part, Claude 3.7 agent mode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 762.097,
    "end": 777.533,
    "text": "All right, started with the GitHub push and let's just check on each of the ongoing language model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 779.656,
    "end": 800.955,
    "text": " uh windows then look to some of these recent examples from rx infer including how they integrate with neural networks and see if we can generalize that or connect that also to these llm type methods um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 802.471,
    "end": 831.938,
    "text": " and yeah see where the different work products from these more llm tool use agents where that gets us and where we get with okay here we go yep mle max steps",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 834.449,
    "end": 841.481,
    "text": " Let's just do one max of everything so that it happens for all the stages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 846.149,
    "end": 848.252,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 848.272,
    "end": 857.588,
    "text": "I'm going to make a new API key to put into this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 873.194,
    "end": 878.623,
    "text": " moving it off screen so I can put in this API key this way and save the file.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 886.795,
    "end": 897.312,
    "text": "So that'd be one way I thought of modifying it, having a environment file or other method for the API.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 898.844,
    "end": 901.486,
    "text": " a lot of flexibility with which LOM and how to call it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 901.506,
    "end": 902.747,
    "text": "So that could just be one thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 902.767,
    "end": 904.709,
    "text": "And then here's, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 904.729,
    "end": 905.99,
    "text": "So let's run that again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 906.01,
    "end": 911.495,
    "text": "AI lab repo is the script.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 911.995,
    "end": 914.617,
    "text": "And then it looks to the location of the YAML file.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 916.019,
    "end": 922.924,
    "text": "So AI lab repo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 922.944,
    "end": 923.225,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 923.825,
    "end": 928.429,
    "text": "Looking at it while it sets up, gives a different language default model, maybe overridden.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 929.624,
    "end": 935.089,
    "text": " The laboratory workflow is a 400-line, 500-line method.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 935.89,
    "end": 936.931,
    "text": "The archive agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 939.294,
    "end": 943.578,
    "text": "Here's the argument parsing for the YAML.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 946.0,
    "end": 946.781,
    "text": "Parsing a YAML.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 947.962,
    "end": 950.084,
    "text": "And then the main.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 950.104,
    "end": 955.75,
    "text": "Or the main logic of this main script that's now playing out here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 957.822,
    "end": 959.845,
    "text": " Sets the LLM backbone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 961.367,
    "end": 963.19,
    "text": "Determines whether it's in human mode or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 963.23,
    "end": 966.474,
    "text": "We can try that, look at the YAML and flip that value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 967.556,
    "end": 969.058,
    "text": "Compile PDF.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 969.078,
    "end": 975.487,
    "text": "Go from the LaTeX plain text all the way through at least trying to compile the PDF.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 975.587,
    "end": 976.769,
    "text": "Load in previous workspace.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 977.45,
    "end": 982.396,
    "text": "If there are parallel labs, what to do in exception failure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 984.119,
    "end": 987.103,
    "text": "Whether there's an archive research agent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 989.513,
    "end": 991.856,
    "text": " and the indices of the lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 992.717,
    "end": 1007.174,
    "text": "Then there's those limits on each of those steps, number of times to iterate through these different steps, and how to parallelize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1007.194,
    "end": 1015.183,
    "text": "Getting the API keys from the YIM, whether the OpenAI key or the DeepSeq key.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1020.479,
    "end": 1045.002,
    "text": " has a logic for if it's in the human interactive type mode asking questions or whether it uses the yaml information but language human in loop mode possibility for different stages to have different human in or on the loop",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1046.348,
    "end": 1051.035,
    "text": " Agent models, which LLM to use for different phases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1052.377,
    "end": 1055.321,
    "text": "Here it looks like this is a set sequence of phases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1055.361,
    "end": 1058.606,
    "text": "It could be specified in a ton of different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1060.749,
    "end": 1062.251,
    "text": "Parallelism instructions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1065.075,
    "end": 1067.378,
    "text": "Some exception clauses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1072.977,
    "end": 1098.765,
    "text": " checklist practical make a better config system yaml advancements make the ability to have agent build on top of the research run agent labs parallel i'm not sure if that's to do or what was done um so this is going to keep running hopefully we will not hit that same error um should be a little faster but still might be a couple minutes on that one all right now to this one",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1102.306,
    "end": 1121.31,
    "text": " So something was happening in the OpenManus, but we asked cursor in the agent mode to enhance our ability to understand because the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1122.573,
    "end": 1125.058,
    "text": " the research report was not very long.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1125.078,
    "end": 1130.049,
    "text": "So maybe it's handled differently with the database and the shared state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1130.109,
    "end": 1141.594,
    "text": "And this is an example of kind of a classic and durable type of trade-off in multi-agent modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1151.277,
    "end": 1170.062,
    "text": " different kinds of information interactions ranging from this just kind of informally implicit multi-agent hub-and-spoke type computational architecture if not Bayes graph",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1170.042,
    "end": 1195.763,
    "text": " where there's a niche that different agents read and write from and this can be in certain digital settings and even probably some physical ones too describe the possible layouts of how to organize shared state",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1196.941,
    "end": 1217.481,
    "text": " in contrast with where there can be direct interactions like interactions among nest mates as well as with the shared environment and in the context of uh doing these computational agents it is like what is being transient what is being remembered and modified how",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1217.461,
    "end": 1224.895,
    "text": " Where's that statistical updating of a probability distribution, like the Rx and Fur side of things?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1226.338,
    "end": 1229.784,
    "text": "Where is it some other kind of model update?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1230.365,
    "end": 1233.952,
    "text": "Where is it context for a language model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1234.393,
    "end": 1240.785,
    "text": "Or to what extent is that update",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1242.048,
    "end": 1257.07,
    "text": " private within that agent carried like sort of like a nestmate level memory to what extent is it accessible by different processes and it kind of just ends up being just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1257.05,
    "end": 1287.006,
    "text": " in some particular way that's very situational so this is just showing a few of the tools and hopefully with people's comments or suggestions let's just see how many minutes it takes to look into a few different functions or at least connect how certain package analyzes this connect that to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1288.792,
    "end": 1292.596,
    "text": " ways we can integrate amongst these different frameworks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1292.616,
    "end": 1301.004,
    "text": "Okay, now we have... Agent Laboratory is running in the first one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1302.806,
    "end": 1303.486,
    "text": "OpenManus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1304.147,
    "end": 1305.548,
    "text": "We asked for these improvements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1310.313,
    "end": 1315.238,
    "text": "Now run the improved OpenManus pipeline.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1318.34,
    "end": 1321.043,
    "text": " So sometimes there's a really obvious way or an entry point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1322.004,
    "end": 1325.247,
    "text": "And I think good code-based design can go a long way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1325.287,
    "end": 1334.997,
    "text": "I know there's a lot of cool work being done with the cursor rules and the MDC files, as well as the MCP server calls.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1335.037,
    "end": 1338.12,
    "text": "Those are all things to look into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1338.16,
    "end": 1343.706,
    "text": "But even a code base of this level,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1343.686,
    "end": 1350.974,
    "text": " Sometimes it's a little bit hard to even know which which script to run or which entry point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1351.915,
    "end": 1368.074,
    "text": "So sometimes it's even useful just to ask in the agents on the right side to even write that as it as it needs to be and also to update that experience like, OK, I don't want to do any terminal extra arguments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1368.815,
    "end": 1371.718,
    "text": "Just make it so that this works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1373.555,
    "end": 1389.471,
    "text": " So let's let Cursor work on that while we look onto the third of the three modeling approaches, the Rx and Fur.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1402.985,
    "end": 1412.3,
    "text": " So the RxInfer examples repo is maintained by the ReactiveBase organization, Lazy Dynamics fellows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1413.722,
    "end": 1422.937,
    "text": "And what I have in the doxology fork is another folder called support.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1424.099,
    "end": 1426.763,
    "text": "And right now it has a few, two scripts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1427.244,
    "end": 1428.486,
    "text": "There's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1428.466,
    "end": 1441.106,
    "text": " setup.jl, which is at least a starting point for setting up the packages and gives a scaffold for adding other packages that you might want to install or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1442.488,
    "end": 1445.833,
    "text": "And then importantly, the notebooks to scripts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1447.518,
    "end": 1475.972,
    "text": " script so this can be run from here with julia notebooks to scripts to file name julia space the file name and takes the documents that are in the original repo the examples folder there's different um folders within examples",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1477.37,
    "end": 1487.415,
    "text": " but this script converts those into a matching scripts folder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1488.979,
    "end": 1493.59,
    "text": "So we will look at two or maybe more of these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1495.392,
    "end": 1500.645,
    "text": " script analogs of some Rx and Fur examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1502.77,
    "end": 1504.956,
    "text": "They're a little bit more flexible to work with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1505.116,
    "end": 1512.996,
    "text": "It's possible to break them out into multiple components and some of them probably run a little smoother in the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1512.976,
    "end": 1514.398,
    "text": " notebook setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1514.438,
    "end": 1526.373,
    "text": "But by and large, they all work to with just a few tweaks or ordering changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1527.194,
    "end": 1537.126,
    "text": "So we'll look at some that are already some variants have been made of and then just drone or some other interesting one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1537.146,
    "end": 1538.307,
    "text": "Let's let's explore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1539.469,
    "end": 1539.709,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1542.423,
    "end": 1570.168,
    "text": " agent laboratory continuing cursor improvement of OpenManus proceeding on this site so it's like their agent orchestration their microservice process orchestration all these really advanced",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1570.402,
    "end": 1590.84,
    "text": " um services and software perplexity etc pretty interesting how they how they do it and and surface it so we'll leave that going and wait for it to complete while looking at the rx infer uh examples",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1596.473,
    "end": 1610.191,
    "text": " So first example will be the recently written Recurrent Switching Linear Dynamical System.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1610.974,
    "end": 1611.816,
    "text": "This one",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1612.201,
    "end": 1636.082,
    "text": " uh where we're getting to with it just to sort of put the um and this is not not to say that this is perfectly statistically optimized just to show some of the expression capacities of where where we can model and then from there figuring out um is rx infer",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1637.26,
    "end": 1665.613,
    "text": " Where might it be at different stages in different projects, ranging from a statistical power type, systems modeling, intuition, skeleton, scaffolds, probabilistic layer, all the way on through complementing and integrating with different machine learning pipelines, like where and how",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1665.593,
    "end": 1680.902,
    "text": " might and what if probabilistic modeling in fusion with some more dynamical systems type time series modeling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1680.882,
    "end": 1702.114,
    "text": " neural networks llms uh all these different architectures of statistical models it's um where how do we compose useful systems for variously more on the recognition direction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1702.094,
    "end": 1711.688,
    "text": " doing latent state inference from noisy data, which is a commonality of the models that will be looked at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1711.768,
    "end": 1723.524,
    "text": "So in this, or using it to recognize latent states from noisy data and or generating predictions from latent state estimates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1723.544,
    "end": 1731.055,
    "text": "So here in this setting, there's a noisy sequence of measurements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1731.035,
    "end": 1758.223,
    "text": " and at a discrete layer there's a switch between two regimes one and two where the second discrete state has this higher amplitude oscillation and so there's a switching between these two modalities and we can explore how hard is it to have a three-state switch model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1759.317,
    "end": 1770.931,
    "text": " So at the sort of faster layer, there's this time series interpolation auto regressive type model, which we can look at with the app model statements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1771.432,
    "end": 1773.194,
    "text": "And then at the slower level, there's this linear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1774.195,
    "end": 1782.625,
    "text": "And then the other example that has a lot to do with this first example is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1784.461,
    "end": 1811.717,
    "text": " a three-dimensional in-time Lorenz attractor with noisy sampling coming from it and in this example integrating neural networks with Flux.jl there's a two-step process that has a lot to do with the continuous time time series interpolation and the slower switching model here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1811.697,
    "end": 1836.237,
    "text": " at the first level there's the learning of a statistical model of the Lorenz attractor state space using a Phlox neural network in Julia then probabilistic parameters according to a at model statement in RxInfer are used to model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1836.706,
    "end": 1842.654,
    "text": " certain distributions of that trained neural network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1842.674,
    "end": 1848.802,
    "text": "So it's like a common theme is so here's now the three dimensions of the Lorenz attractor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1848.862,
    "end": 1864.283,
    "text": "So the blue line is the inferred from the actual Bayesian posteriors reflected by these matrices and their change through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1866.642,
    "end": 1891.418,
    "text": " um in terms of not possibly miscalibrated it's not to say that this makes this an accurate assessment i think there's a lot to um to to look at in there but these are posterior estimates that in certain conditions or situations or data sets can give better estimates and other alternatives",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1891.398,
    "end": 1913.676,
    "text": " that have for example in this situation on this dimension for the Lorenz is a parametric estimate in terms of a mean and a variance of this posterior distribution constrained to the Gaussian family of just mean and variance parametric statistics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1914.196,
    "end": 1922.087,
    "text": " and that can be computationally implemented, typed, simulated, etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1922.107,
    "end": 1933.343,
    "text": "in a number of ways with an explicitly distributional analytical nature, knowing that it's going to be this normal distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1934.365,
    "end": 1939.292,
    "text": "Now, if the underlying state is bimodal,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1939.272,
    "end": 1958.31,
    "text": " then there are all the sorts of attractor states depending on where it goes and how the optimization unfolds like whether it over disperses to capture the mean or whether it sharpens to go onto the median like a local optima so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1958.29,
    "end": 1979.117,
    "text": " but all that being said it gives this parametric estimate in terms of an explicit mean and variance which can be used in any statistical method for what would otherwise be distributed throughout the weights of like the neural network",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1979.097,
    "end": 1992.364,
    "text": " with many parameters needing to be simulated for inference, whereas with these more distilled summary statistics on the posteriors, it can be compressed to a very small",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1993.441,
    "end": 2007.696,
    "text": " scale, even though as more parameters are added, the fit might be better because a neural network might be able to know that there was some more structure than just the two parameters that are allowed to be specifying this distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2008.257,
    "end": 2023.313,
    "text": "So that's kind of the topic that I think in a lot of ways, regardless of what the agent orchestration layer is, which this is giving us some windows into,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2023.293,
    "end": 2044.626,
    "text": " there's sort of this orthogonal analytical or behavioral scientific framing of this information environment using probability distributions to model outputs of other models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2044.606,
    "end": 2065.686,
    "text": " some places and motifs where that could be like parameter on parameter on parameter or it could be LLM on LLM on LLM all these different chains of of interactions between models that are more like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2067.1,
    "end": 2092.652,
    "text": " let's have a ton of parameters and try to interpolate a function and pick the size of the model out of convenience or compute like why 7 billion parameter language model because maybe just in the short term it's easier to fork or use the training methods that are known or whatever it may be but use a certain given",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2092.632,
    "end": 2106.068,
    "text": " large number of parameters choose your own or some other common number and then hope that there's enough degrees of freedom and in the curriculum of the training that it's uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2108.427,
    "end": 2130.992,
    "text": " that it interpolates and learns the space and does the good function approximation and and you don't have to do an analytical description of like the information space yet it can learn a lot of the important structural features um whereas for example uh explicit",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2131.327,
    "end": 2155.95,
    "text": " probability distribution over words which is kind of has a functional encoding in the the larger um many parameter type like llm type learn all the statistical associations including higher order ones among different textual inputs",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2157.736,
    "end": 2163.186,
    "text": " and then learn the specifics of that from the training data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2166.994,
    "end": 2178.816,
    "text": "But letting those weights and coefficients amongst all of the billions of parameters become fit through the training.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2181.901,
    "end": 2211.199,
    "text": " in this app model type rx infer setting and then also in in the textbook group there was one person was interested in posture so we modified it so maybe we can modify another of gray is the proprioception noisy signaling coming from the body then there's the perceived and the actual",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2212.698,
    "end": 2233.778,
    "text": " posture embodying the the uh switching and constraints chaotic uh dynamical underlying system with the Lorenz being like the transition between two different modes this could be like seated biomechanics and standing biomechanics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2235.513,
    "end": 2263.512,
    "text": " um or different uh the the Lorenz or other attractor systems could be sampled from or or mixtures of systems could be a model multiple ways of modeling the generative process that's giving rise to these noisy observations doesn't have to be just fit with Lorenz um but similar theme with um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2269.229,
    "end": 2274.658,
    "text": " Let's look at the app model that defines the probabilistic part of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2278.565,
    "end": 2286.698,
    "text": "Here's the state space model, which can be in certain places and ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2288.804,
    "end": 2306.442,
    "text": " run in situations where the larger neural network might not necessarily be able to operate like all the variables that have to be stored within a semantics of this being the arguments passed to this SSM",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2306.422,
    "end": 2330.033,
    "text": " these can be interpretable true variance posterior estimates explicit composition of different statistical distributions there's more to it for logging and for coordinating the calls and the orchestration",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2330.013,
    "end": 2338.429,
    "text": " of how these app models get used in the rhythms of other API calls and program logics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2339.271,
    "end": 2345.102,
    "text": "But the app model is kind of this statistical kernel that is the one that gets",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2345.082,
    "end": 2367.613,
    "text": " parsed and rendered and used as the underlying declarative base graph for the RxInfer model that then gets a certain scheduling of either the standard sort of pass over all of the nodes and update them in this order",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2367.593,
    "end": 2382.868,
    "text": " imperative style update this and then do this and then do this and then do that and then to what extent that scheduling of updating strategies on that base graph",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2382.848,
    "end": 2406.443,
    "text": " that is what reactive message passing in principle kind of opens the degrees of freedom around so it's like well this can be under this timing this one can be triggered by this or react to this rather than the whole graph being either updated sort of in a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2406.423,
    "end": 2434.911,
    "text": " sweep or just in any given fixed for loop type computational execution approach to that distribution so this is the joint generative model of the state space model inferred from the neural network so the of the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2436.342,
    "end": 2458.671,
    "text": " from the noisy Lorenz data so let's check the other okay agent laboratory still writing cursor finished",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2465.249,
    "end": 2476.096,
    "text": " What commands to run to run and log the demos written?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2476.116,
    "end": 2476.778,
    "text": "Hello, Zig.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2489.077,
    "end": 2493.082,
    "text": " train the neural network on the Lorenz noisy data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2494.464,
    "end": 2501.272,
    "text": "So using just a ton of parameters, throwing it out the problem, training the neural network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2509.702,
    "end": 2509.802,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2528.412,
    "end": 2529.734,
    "text": " test sequential tools.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2542.798,
    "end": 2544.862,
    "text": "This is what we get.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2546.745,
    "end": 2551.213,
    "text": "There should be at full function",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2552.695,
    "end": 2576.003,
    "text": " logging of the vast sequentially improved actual plans, documents, research outputs, et cetera, logged and enacted by this system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2581.872,
    "end": 2587.06,
    "text": " Agent laboratory still going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2587.08,
    "end": 2589.083,
    "text": "OK, that was the neural network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2589.744,
    "end": 2600.6,
    "text": "Learning the neural network and then describing parameters of a specific app model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2603.144,
    "end": 2608.572,
    "text": "So those were two of the, but let's look at a new one like drone dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2617.208,
    "end": 2623.298,
    "text": " All right, so having done this one, let's see what it results in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2623.318,
    "end": 2625.18,
    "text": "Let's see what it looks like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2626.583,
    "end": 2642.828,
    "text": "So this is in advanced examples, drone dynamics, notebook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2647.972,
    "end": 2666.301,
    "text": " drone.gif all right awesome drone.gif 2d drone drone 3d multi",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2668.897,
    "end": 2694.938,
    "text": " looks awesome so if we can recapitulate this and start extending it a little bit and understand the app model add in some logging look at some other visualizations um adapt it to foraging and the honeybee or something like that like there's there's so many um so this is just as as we watch these three processes play out which again under under total no",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2696.875,
    "end": 2699.781,
    "text": " Make it happen and do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2702.107,
    "end": 2705.232,
    "text": " comprehensively now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2705.372,
    "end": 2717.751,
    "text": "Two weeks later, the level of function could be, I guess, somehow deteriorated in some way, but considering just for the most part, largely improved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2718.272,
    "end": 2728.468,
    "text": "A lot of the things that I'm doing, certainly someone with different or more development experience and or another more advanced version of Cursor",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2730.406,
    "end": 2735.331,
    "text": " that could just iterate a few more times or a little bit better with coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2736.252,
    "end": 2738.134,
    "text": "So it's pretty wild.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2739.015,
    "end": 2743.539,
    "text": "And I'm excited to see like what people do with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2743.599,
    "end": 2745.041,
    "text": "It's not just vibe coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2745.982,
    "end": 2748.004,
    "text": "It's more and different than that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2749.065,
    "end": 2751.728,
    "text": "I think in ways, or at least it can be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2752.969,
    "end": 2753.93,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2753.95,
    "end": 2755.992,
    "text": "Quick scan over the drone example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2757.237,
    "end": 2760.292,
    "text": " These examples demonstrate the use of RxInfer for motion planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2760.774,
    "end": 2765.779,
    "text": "The animations show the inferred trajectories from probabilistic inference rather than simulated executions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2768.273,
    "end": 2779.106,
    "text": " For more realistic simulations, especially in the 3D drone example, the model would need to be extended with reactive environment, hashtag RX environments, that responds to the drone's actions during plan execution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2779.887,
    "end": 2785.334,
    "text": "If you're interested in collaborating on a more realistic implementation, please open a discussion and let's work on it together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2785.374,
    "end": 2791.041,
    "text": "And that links to a discussion on reactive base.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2796.117,
    "end": 2823.492,
    "text": " okay let's quickly look through it import packages environmental features like gravity physics of the mass inertia radius and force limit properties of the drone aerial properties of the drone state of the drone vector of these variables model specification",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2826.374,
    "end": 2852.854,
    "text": " location state transition based upon this declarative statistical style graphical model specification for the drone model that's going to get rendered up and done all these ways with the rx infer using the app model macro",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2857.778,
    "end": 2886.469,
    "text": " planning loop included inside of the app model macro for the time horizon involving something like rolling out the prior on consequences of action physics related with the state transitions but how does it select action",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2888.862,
    "end": 2911.849,
    "text": " then probabilistic inference not sure what unscented means here but some kind of state transition approximator this is an interesting function i think it'll be like is it really this easy to make a wrapper function called move to target",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2913.668,
    "end": 2934.518,
    "text": " If so, that feels like a really high level function, even for a 3D nav system to be able just to be like, move the target and have it have this, um, deafness that that's, that'll be interesting to look at how that happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2935.94,
    "end": 2943.27,
    "text": "Uh, initial conditions, specification, plotting of a drone, animation of the drone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2945.275,
    "end": 2960.616,
    "text": " So hopefully getting the script running will get us to understand all these different visualizations and maybe make a few new visualizations just using the script and generalizing it from there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2961.757,
    "end": 2963.82,
    "text": "Let's check on the LLMs and continue with the drone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2963.84,
    "end": 2964.1,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2964.861,
    "end": 2973.713,
    "text": "Agent laboratory continues to use this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2973.845,
    "end": 2977.849,
    "text": " We had some really fun, interesting discussions in the Discord.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2978.29,
    "end": 2980.152,
    "text": "So, like, just taking a little snippet here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2980.612,
    "end": 2983.515,
    "text": "These are LLM costs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2983.975,
    "end": 2984.496,
    "text": "Postdoc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2985.777,
    "end": 2996.068,
    "text": "Let's take a fresh perspective in developing our POMDP model for thermal homeostasis, focusing on agile design that prioritizes user-centric features while maintaining strong mathematical integrity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2996.629,
    "end": 3001.894,
    "text": "Here's a newly formulated plan that emphasizes practical user engagement and theoretical robustness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3004.388,
    "end": 3008.514,
    "text": " three action states of the POMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3008.534,
    "end": 3018.648,
    "text": "Five continuous band on a continuum making a discrete state space five option latent space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3022.573,
    "end": 3025.097,
    "text": "So it's laying out different aspects",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3027.845,
    "end": 3030.268,
    "text": " Certain parts of it are repeating things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3030.368,
    "end": 3031.649,
    "text": "It could just be logging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3031.729,
    "end": 3034.913,
    "text": "It could be other ways to do the prompt engineering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3034.953,
    "end": 3037.976,
    "text": "Like this just looks like it's repeating things right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3046.966,
    "end": 3049.629,
    "text": "Maybe it's actually asking if we're ready or something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3051.231,
    "end": 3053.753,
    "text": "But yeah, I think that'll interrupt.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3053.954,
    "end": 3054.995,
    "text": "Let's see, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3055.876,
    "end": 3056.957,
    "text": "Something is happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3057.832,
    "end": 3079.401,
    "text": " let's leave that highlighted return to it here looks like the cursor agent make the updates and run it and fun it okay um back to the drum um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3080.697,
    "end": 3084.201,
    "text": " So we looked at the readme for the drone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3084.221,
    "end": 3095.252,
    "text": "This is in the scripts folder, which basically takes the notebook that we looked at with the interspersed comments and pulls out just the Julia code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3096.233,
    "end": 3100.457,
    "text": "So right click on the code, open an integrated terminal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3104.661,
    "end": 3110.367,
    "text": "Pretty cool that Cursor enables even one computer to do this stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3114.194,
    "end": 3116.457,
    "text": " and a lot of externalities on the compute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3116.517,
    "end": 3134.843,
    "text": "So local, there's a lot of cool ways to do this, but using multiple different cloud resources like this, hope that it's all useful and relevant in the broader service of living and computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3137.507,
    "end": 3141.012,
    "text": "Start out with just running it as it first converts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3143.033,
    "end": 3171.083,
    "text": " julia drone dynamics it may need a slight reordering or it could just be like my environment or we'll see um one feature that comes up a lot in the um rx infer group and and in in learning about it is just like this very",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3174.59,
    "end": 3183.368,
    "text": " Julia-esque usage of statistical variables very close to as they are analytically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3185.508,
    "end": 3188.753,
    "text": " isomorphically, I mean, ideally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3188.793,
    "end": 3214.03,
    "text": "And learning the syntax of what is allowed sort of in plausibility, where is it speculative realism, distributional specification, where and how does the current ability to make different kinds of nodes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3214.01,
    "end": 3240.507,
    "text": " and implement different kinds of edges in rx infer which could be more uh general or robust in the future i'd expect so just from an open source software development side like what kinds of app models will what kinds of statistical behavior arise from what kinds of logics and functions like go to target are being um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3242.782,
    "end": 3267.692,
    "text": " put within the app model what's in the logic of updating and calling different nodes there's just a lot of interesting areas and spaces for for taking these functional examples and if and being clear about where where are we having problems in implementing these examples like I don't expect it to run the first one",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3272.482,
    "end": 3279.049,
    "text": " because it was a notebook, but then it hopefully is just one or a few prompts away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3279.729,
    "end": 3287.217,
    "text": "And then we can start taking these things apart, looking at and making more logging, testing different variants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3287.958,
    "end": 3289.519,
    "text": "Please update this to run.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3289.539,
    "end": 3291.541,
    "text": "It just hangs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3292.082,
    "end": 3299.129,
    "text": "It was converted from notebook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3299.149,
    "end": 3302.252,
    "text": "Break it up out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3304.477,
    "end": 3314.778,
    "text": " into any separable modules properly invoked if you think it best.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3322.735,
    "end": 3324.358,
    "text": "Okay, looks possibly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3335.273,
    "end": 3337.256,
    "text": " Let's just see what happens if we say move ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3337.296,
    "end": 3350.535,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3356.063,
    "end": 3358.446,
    "text": "This one seems to be hanging again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3360.772,
    "end": 3366.078,
    "text": " So here one affordance that they sort of point to is new chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3370.003,
    "end": 3371.685,
    "text": "So this is back to OpenManus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3377.452,
    "end": 3380.456,
    "text": "Here is what we get.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3380.516,
    "end": 3387.184,
    "text": "Now use a chain of OpenManus calls and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3388.565,
    "end": 3409.695,
    "text": " tool use on incrementally writing reports and doing dispatch of document writing, then stitching together as editor at the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3418.282,
    "end": 3441.859,
    "text": " okay this is still happening so that took 1800 seconds okay it's loading some information this is like this is getting into the um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3442.936,
    "end": 3465.383,
    "text": " yeah stuff is coming out but this is a one of the big open questions that hopefully we won't get too off the rails with in this with the tools but even with the um and perhaps even especially with the haphazard and just open source grabbing these tools",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3465.363,
    "end": 3492.754,
    "text": " but even if it were a much more well orchestrated documented approach even that would be being especially important like what is really being empowered in the environment that i'm running this in um where are different kinds of real consequences possible it's just um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3494.185,
    "end": 3519.957,
    "text": " it's pretty interesting and and how does that relate to the actual technical basis of what the model is and does and how it's interpreted okay move some drone core we can use perplexity to make a drone core image",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3537.571,
    "end": 3539.474,
    "text": " See if we can get the Studio Ghibli.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3553.396,
    "end": 3553.497,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3557.183,
    "end": 3562.431,
    "text": "Yeah, so in the time when it wrote the 17-page PDF...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3562.816,
    "end": 3569.983,
    "text": " So it didn't output the other discourses, but a lot of more stuff was happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3570.003,
    "end": 3576.849,
    "text": "But it just saved, in the time that I previously ran this, just a 17-page PDF on this thermal POMDP model and concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3577.69,
    "end": 3592.063,
    "text": "But it really did have files like this file, partially haphazardly outside of its lane, but not...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3594.035,
    "end": 3615.705,
    "text": " not few files were made hugging face data sets really may be coming here there really were python scripts that did have some outputs and some source code was written so we'll see where that goes and i think that's another sort of general topic is this file structure handling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3616.546,
    "end": 3636.9,
    "text": " To what extent should more relational databases and general high performance databases, and maybe they're already being used in different ways, to make some of the handling of the reference of these different system components more facilitated?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3636.88,
    "end": 3666.364,
    "text": " doing it locally like all of these examples has a lot of interpretability it's like very hands-on but for high reliability there's some other methods but those have their own sort of trade-offs so okay so we got OpenManus being improved by cursor to make more sequential incremental state sharing amongst runs",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3668.116,
    "end": 3670.501,
    "text": " Um, let's just run the main.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3670.561,
    "end": 3681.325,
    "text": "This is um.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3681.345,
    "end": 3682.868,
    "text": "Let's let's run.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3698.845,
    "end": 3700.589,
    "text": " This is the initialized script.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3706.321,
    "end": 3707.965,
    "text": "Activate the virtual environment, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3711.031,
    "end": 3712.494,
    "text": "Run OpenMan is yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3717.205,
    "end": 3718.447,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3718.467,
    "end": 3718.828,
    "text": "Oh.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3731.752,
    "end": 3736.738,
    "text": " Okay, drone example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3740.842,
    "end": 3741.523,
    "text": "Marches on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3744.867,
    "end": 3745.788,
    "text": "Pop out terminal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3748.571,
    "end": 3749.812,
    "text": "So it is happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3751.534,
    "end": 3753.757,
    "text": "Could be hanging in a really useless place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3755.719,
    "end": 3759.143,
    "text": "Okay, code execution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3760.473,
    "end": 3782.7,
    "text": " in the agent laboratory test train split loading some data from hugging face lab number two is the index of that lab so it's like where i don't know where this is happening in the in a dot cache so where do different files get stored where does that get stored in databases etc",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3783.828,
    "end": 3790.378,
    "text": " OK, looks like some kind of error, but what was very interesting to see is this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3790.439,
    "end": 3793.332,
    "text": "So this is a.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3796.467,
    "end": 3817.885,
    "text": " just wasn't sure what level of code this even was in terms of errors happening in certain tasks blurring with written scripts because the scripts for the tasks are in this repo which also has edit access to these tools and to cursor",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3817.865,
    "end": 3846.049,
    "text": " so it's just it's probably not the um most crystallized high reliability setting but it has this sort of open-ended evolution element with the agent laboratory especially um okay open manners common cursor pathology let's let's let's do something totally different",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3849.64,
    "end": 3874.838,
    "text": " view the open let's just start a new chat fix this so that main.py works fully functionally as it should okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3880.842,
    "end": 3881.164,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3884.743,
    "end": 3887.055,
    "text": "RxInfer drone model is running.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3909.732,
    "end": 3911.595,
    "text": " Postdocs just being postdocs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3911.615,
    "end": 3920.932,
    "text": "2D.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3926.562,
    "end": 3930.809,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3930.829,
    "end": 3931.791,
    "text": "While that's running.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3942.436,
    "end": 3972.291,
    "text": " add more logging to the outputting so we better with emoji structuring understand and can report on the timing and resource oh just timing of different stages okay so rx infer at least is doing some logging here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3977.131,
    "end": 4004.708,
    "text": " of running the drone dynamics simulation break out the core program spec and logic flow",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4007.168,
    "end": 4021.887,
    "text": " from the statistical description of the GMAT model statements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4031.8,
    "end": 4031.86,
    "text": "OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4035.89,
    "end": 4057.155,
    "text": " errors from julia so now with the errors from the logging from it fix this and add more there open nanus",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4063.784,
    "end": 4065.608,
    "text": " Okay, now main is working.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4066.249,
    "end": 4071.078,
    "text": "All right, so here's what the open main is functionality, just running the main.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4071.84,
    "end": 4072.702,
    "text": "Enter your prompt.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4076.128,
    "end": 4083.042,
    "text": "I am in a live stream on multi-agent dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4088.708,
    "end": 4118.395,
    "text": " research and report on with five paragraph essays and code stories about what kinds of state of the art methods it would make sense to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4120.653,
    "end": 4125.379,
    "text": " comprehensively understand in April, 2025.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4125.42,
    "end": 4132.589,
    "text": "Oh, already.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4135.613,
    "end": 4136.675,
    "text": "Let's see what time it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4143.424,
    "end": 4147.69,
    "text": "Okay, let the OpenManus repair.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4150.387,
    "end": 4177.609,
    "text": " still writing phd dialogue now it's into the storying of the um paper all right back to the drone working on drone dynamics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4183.124,
    "end": 4199.694,
    "text": " So hopefully that even though I'll do about 10 or 15 more minutes, these are all right in the zone of just hit and miss right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4199.974,
    "end": 4203.36,
    "text": "That's why I'm showing from a more reset state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4204.589,
    "end": 4223.965,
    "text": " um but i think people can report back and and obviously we will see um what is really possible with making these systems a lot more high reliability in in multiple key ways",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4243.402,
    "end": 4268.548,
    "text": " so okay so yeah this is coming from openmanus this is with the browser so let's pop this out yeah incredible okay it popped up this window with these analysis boxes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4273.979,
    "end": 4280.554,
    "text": " Brought here is going to be the terminal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4284.684,
    "end": 4287.33,
    "text": "This is Manas selecting these tools.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4288.897,
    "end": 4304.56,
    "text": " is it the uh you know is it the best possible way to look at this action selection or you know how to interact best with sites with so many degrees of freedom but that's a pretty cool outcome so let's let that browse",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4305.468,
    "end": 4313.477,
    "text": " and consider the watershed moment while Agent Laboratory is writing the thermal POMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4314.699,
    "end": 4327.253,
    "text": "And now we have the improved logging RxInferDrone form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4327.273,
    "end": 4335.002,
    "text": "Let's do another drone script.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4336.366,
    "end": 4348.644,
    "text": " Same total functionality with fewer time steps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4348.664,
    "end": 4362.103,
    "text": "Well, let's reduce the number of time steps in our simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4365.998,
    "end": 4392.31,
    "text": " Add to chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4394.483,
    "end": 4396.36,
    "text": " and fix this error",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4414.058,
    "end": 4438.834,
    "text": " so here's the step 11. so that's what that was the chain of of tool use that was leading to that website the news website okay all right it has popped up familycenter.meta.com looks like possibly slash Brazil in Portuguese unexpected but okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4443.438,
    "end": 4451.711,
    "text": " Okay, grab the tension again with that paper continuing on in the OpenAI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4458.943,
    "end": 4470.542,
    "text": "Variably successful modification using LLMs of Rx and Fur code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4472.024,
    "end": 4474.588,
    "text": " So that's one reason it's fun to do this script.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4474.628,
    "end": 4482.679,
    "text": "First off, it allows a lot more articulation and separation between different parts of the code and better logging for when things are not working.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4482.8,
    "end": 4486.525,
    "text": "It can break things too, but that's the helper script.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4487.006,
    "end": 4498.302,
    "text": "So as long as they keep the main Rx infer examples notebook functional or similar reference models of code,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4498.282,
    "end": 4505.512,
    "text": " then it's a lot easier to regenerate functional scripts and start modifying from there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4516.987,
    "end": 4519.19,
    "text": "Yeah, I'm going to do about 10 minutes more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4520.852,
    "end": 4527.681,
    "text": "So if anyone has any comments or questions they want to have mentioned in the last 10 minutes, write them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4531.154,
    "end": 4538.422,
    "text": " Okay, let's look at how tool use really output.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4557.585,
    "end": 4557.685,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4568.195,
    "end": 4570.413,
    "text": " running just 2D quick.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4570.433,
    "end": 4573.075,
    "text": "So let's see if this will successfully save an output.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4577.678,
    "end": 4600.632,
    "text": " it was working a little more earlier on with the the numbers and the outputs so let's see if we can at least recover that if not save into but once we have the scripts and the ability to to modularly break it out in pretty simple steps then there can be different logging and saving it can be okay we'll now just deposit that vector",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4600.612,
    "end": 4630.416,
    "text": " into this matrix form and then just keep on working from there so there's a lot of ways to use even just the state space clarity that making these probabilistic models can provide that's kind of the systems modeling part that's that's always really interesting so 15 steps deep possibly just what did we even ask for what time is it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4632.185,
    "end": 4661.213,
    "text": " overkill right but general so open man is probably not even pretending to be otherwise than such seems like a little bit like less of a functional version but it's a great direction to at least",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4663.268,
    "end": 4686.863,
    "text": " point in that direction agent laboratory has the associated paper let's hope that it will finish in the last and things are happening with open mana so it has that sort of tool architecture paper's still writing over there 16 of 20 open minutes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4692.867,
    "end": 4707.122,
    "text": " Drone error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4707.142,
    "end": 4715.031,
    "text": "Yeah, and also it's helpful to have the notebook form available in the code base.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4716.652,
    "end": 4720.917,
    "text": "So then it can be referenced, say, okay, this was working, especially early on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4725.436,
    "end": 4750.836,
    "text": " yeah I feel that this will not finish and render PDF but the the PDF that it did render previously was keeps on going to this website let's see what one it opens next the the the PDF was stymied probably one or two times but then generally was rendering totally fine",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4756.351,
    "end": 4759.256,
    "text": " So they've used a bunch of different methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4762.44,
    "end": 4766.066,
    "text": "It's really cool work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4766.186,
    "end": 4781.43,
    "text": "Yeah, multi-agents, active block friends, where we've for a few years sort of with ebbs and flows, talked a lot about these topics, about approaches for cognitive modeling,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4781.41,
    "end": 4807.603,
    "text": " ways to take procedural approaches ontologically driven approaches to modeling connecting that with data integrity stuff like from block science and other requirements engineering p3if these kinds of modeling layers oh it detected that the browser window is closed maybe that shouldn't be done next time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4813.473,
    "end": 4818.681,
    "text": " Let's see if it can fix the drone example in the next seven minutes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4819.583,
    "end": 4823.669,
    "text": "But if anyone has any last comments, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4825.292,
    "end": 4826.374,
    "text": "Okay, we'll close that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4826.394,
    "end": 4827.495,
    "text": "Oh, yeah, the drone core.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4828.878,
    "end": 4829.799,
    "text": "Images and perplexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4829.839,
    "end": 4831.522,
    "text": "Not sure why they kind of broke it out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4831.582,
    "end": 4833.625,
    "text": "It was nice when it was on that side tab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4838.633,
    "end": 4840.476,
    "text": "Gave a talk earlier today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4842.143,
    "end": 4864.303,
    "text": " and this was a one of the themes was the two sides of this coin natural foraging systems and engineering forging systems and algorithms and this sort of bi-directional relation this perspective swap systems as they are and the empirical data the inspiration they provide and then also these computer scientific more engineered",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4864.283,
    "end": 4886.697,
    "text": " or more mathematical uh models of multi-agent settings and the ways that those are kind of coming together giving all these different optionalities for modeling okay see stunning sites only accessible by rail",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4888.094,
    "end": 4888.394,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4889.216,
    "end": 4890.938,
    "text": "Drone at least has started up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4892.36,
    "end": 4911.787,
    "text": "This one always looks like it's halting, but I think at these stages, maybe when it runs the paper solver, even just one time, this could be a lot faster probably with the parallelized labs and with not just this older laptop that I'm running this from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4911.847,
    "end": 4917.595,
    "text": "This seems like there's a lot of back-end...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4917.575,
    "end": 4945.0,
    "text": " um possibilities and from the requirements installation like there are some packages and so like oh i wonder why they're doing that and so it seems like there's some pretty um advanced methods that are being used sequentially and that was what i sort of broke it trying to get at and and but what i know will will be part of it in in the bigger picture",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4944.98,
    "end": 4965.807,
    "text": " is that kind of expressivity graphical user interface from no to low to very medium and high code high touch ways of working with these informations these are all just sort of again haphazard archetypes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4968.284,
    "end": 4995.22,
    "text": " and they will already in their own description of frictions and just looking at functions here as randomly assembled on a given afternoon and pointed to by these repos and peers and sort of adjacents from this sort of concept there's just a lot of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4995.2,
    "end": 5023.654,
    "text": " space to think about how to get this to all work and whether this is the best agent orchestration framework or as several times I've just built it from scratch with just a few prompts or whether using some other agent orchestration frameworks in any given moment that's a super important question and I hope that we continue to develop down those lines and stay multiple there",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5023.634,
    "end": 5034.1,
    "text": " There's just sort of overlapping and complementary functions that different modeling approaches can yield.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5035.835,
    "end": 5054.873,
    "text": " And having the modeling capabilities connected with like requirements, engineering, pattern languages, those kinds of features so that there can be formal and natural language effective descriptions of systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5059.763,
    "end": 5089.146,
    "text": " connecting that to the compositionality of multi-agent LLM browser type code writing and reviewing improving the code which at least the first time that I got it to work it totally did do sequential code improvement and running I don't know with what resourcing it was running the code or how it was getting to the outputs of the code um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5090.442,
    "end": 5103.962,
    "text": " in terms of its workspace and all of that but but but those are just the questions um 20 steps or what what's the right number of what compositions content empty",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5107.857,
    "end": 5121.934,
    "text": " So even though while the outputs are in many ways less impressive than just one perplexity search might get you, it's about these functionalities",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5123.213,
    "end": 5153.22,
    "text": " and different compositionalities being more and more accessible, more multimodal, part of larger orchestration frameworks, more open to calling and receiving API calls and different information measures on the input and the output and the cognitive nature of different systems, that sort of low road, high road,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5153.2,
    "end": 5170.483,
    "text": " whether it's as systems must be for a given observer all these different ways that people talk about the different relational modeling stance and pragmatism",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5170.463,
    "end": 5198.985,
    "text": " how that's all connecting with just the ability to vibe code and make documentation tests logging functions a lot of different things that okay this this finished did it even save a file maybe but it did do some browser opening so okay goodbye open minutes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5202.357,
    "end": 5205.35,
    "text": " So now we have just in this last minute, let's see what happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5205.41,
    "end": 5208.503,
    "text": "We have the agent lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5209.951,
    "end": 5232.617,
    "text": " which does the and and and prior did get some artifacts being built of just multi-agent coordination and the rx infer giving some issues for the drone example but was much easier to move over to the script form for the neural network and the recurrent uh switching",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5233.93,
    "end": 5235.573,
    "text": " linear dynamical systems model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5235.693,
    "end": 5237.216,
    "text": "So, thank you all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5237.416,
    "end": 5240.442,
    "text": "Hope that was interesting and or useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5241.804,
    "end": 5245.471,
    "text": "Not as much baseball and so on as it could have been, but c'est la vie.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5245.491,
    "end": 5246.253,
    "text": "So, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5246.353,
    "end": 5247.054,
    "text": "Till next time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5247.275,
    "end": 5247.535,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  }
]