[
  {
    "start": 1.158,
    "end": 27.51,
    "text": " all right greetings thanks for joining all it's march 29th 2023 we're in cohort 2 in our first discussion on chapter 10. so let's head over to chapter 10 and um begin with any comments really about anything within the active",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 29.019,
    "end": 41.765,
    "text": " area um several were voiced before we begun so perhaps terry feel free to begin with um what you wanted to point towards and let's just see where that goes thank you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 49.781,
    "end": 70.211,
    "text": " In essence, my question is about the concept of a system of volitional consciousness that sits behind the nodal active inference model, creating",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 74.74,
    "end": 82.725,
    "text": " I suppose, making decisions about the strategic direction of the organism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 82.965,
    "end": 95.495,
    "text": "And I find, just repeatedly within this chapter, there seems to be this reference to a conscious entity behind the algorithm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 96.055,
    "end": 98.377,
    "text": "And my sense from...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 100.307,
    "end": 125.768,
    "text": " trying to understand this material is that it's almost like in meditation where, you know, the experience is the experience, that almost there is no I behind the experience and that it just jars with me when we're presented with a...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 127.688,
    "end": 144.476,
    "text": " almost complete active inference model where our actions in the world are actually experiments to gain information about the external state to ultimately update the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 146.741,
    "end": 175.261,
    "text": " What consciousness is, as you said at the start, is a difficult concept, but it seems strange to me within the context of this model that we refer back to some sort of underpinning, strategic, conscious, experiential driver of action when that seems outwith this model or unnecessary for this model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 177.998,
    "end": 191.416,
    "text": " um uh michael or ali want to give any first thoughts on this yeah ali go for it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 194.548,
    "end": 210.823,
    "text": " Yeah, well, actually, I don't think they necessarily somehow, I mean, the active inference framework doesn't require any",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 212.486,
    "end": 231.635,
    "text": " conscious entity in the sense of our anthropic sense of this word consciousness because what FEP actually tries to model is a kind of quote-unquote as-if epistemology",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 232.595,
    "end": 253.585,
    "text": " So, by as-if epistemology, it doesn't mean that everything that can be modeled with FPP formulation necessarily has this sense of anthropic consciousness, but",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 254.961,
    "end": 265.844,
    "text": " It's a kind of self-referential way of talking about the perspective of being modeled.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 266.044,
    "end": 276.368,
    "text": "So I'm sure you've encountered this word self-evidencing throughout this book, which refers to the same concept of as-if epistemology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 276.408,
    "end": 279.109,
    "text": "So it's one of,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 281.258,
    "end": 307.941,
    "text": " I'm sure Daniel's favorite figures in the book, figure 9.1, also captures this sense of perspectival view of kind of the nature of this modeling is not that we have this sense of understanding",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 308.919,
    "end": 320.128,
    "text": " omniscience that can be applied to the environment or that can be reasoned through",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 327.897,
    "end": 342.084,
    "text": " And that can also be applied to our sensorium or perceptorium, but it's like we have this model inside a kind of,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 343.898,
    "end": 356.772,
    "text": " apparatus that can see its behavior as if following through a kind of trajectory in the probability density space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 357.433,
    "end": 358.914,
    "text": "So by volition,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 360.936,
    "end": 362.257,
    "text": " That you're referring to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 363.158,
    "end": 364.319,
    "text": "It's my understanding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 364.379,
    "end": 366.66,
    "text": "That it's also.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 366.68,
    "end": 368.121,
    "text": "Another term.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 368.181,
    "end": 369.422,
    "text": "That they've also used.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 370.242,
    "end": 371.323,
    "text": "That's related to this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 371.783,
    "end": 372.684,
    "text": "Self-evidencing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 372.904,
    "end": 376.346,
    "text": "Is the object.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 376.546,
    "end": 377.447,
    "text": "Or the agent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 378.027,
    "end": 379.949,
    "text": "Tries to infer its environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 382.17,
    "end": 382.61,
    "text": "Through.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 382.63,
    "end": 383.871,
    "text": "A kind of.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 385.812,
    "end": 386.973,
    "text": "What was this term?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 387.974,
    "end": 388.854,
    "text": "It was.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 389.015,
    "end": 389.595,
    "text": "Something like.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 390.259,
    "end": 391.16,
    "text": " indirect person?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 391.22,
    "end": 392.42,
    "text": "No, it wasn't.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 393.381,
    "end": 406.228,
    "text": "A demo, can you help me find the term for the indirect perception of the specific term that's used in the literature to refer to indirect perception?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 408.85,
    "end": 410.231,
    "text": "Sorry, just a second.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 410.291,
    "end": 411.211,
    "text": "I don't exactly remember.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 411.231,
    "end": 416.134,
    "text": "Okay, I'll find it and I'll get back to you in just one second.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 418.948,
    "end": 420.49,
    "text": " Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 421.852,
    "end": 427.158,
    "text": "Stop me if I'm going down some unnecessary rabbit hole.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 428.44,
    "end": 430.623,
    "text": "But it's almost as if this...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 433.348,
    "end": 462.488,
    "text": " system active inference represents a model by which one could create a psychological zombie in that by active inference without any sense of internal self one could behave in the world by minimizing variational free energy at",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 463.537,
    "end": 466.159,
    "text": " in the way that we behave in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 466.399,
    "end": 484.512,
    "text": "And, um, Daniel Dennett seemed to, in one of his books sort of talk about that, um, uh, the, our, our, our, you know, that we have active won't rather than active, um, uh, than rather than free will, you know?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 484.772,
    "end": 491.537,
    "text": "And, um, I, I suppose the, the, the implication of that is that we, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 493.696,
    "end": 500.418,
    "text": " that our conscious reality is like a story we tell ourselves almost shortly after the event.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 501.418,
    "end": 520.644,
    "text": "And yet in this book, there is this reference to a conscious will within the framework, certainly within that last chapter, chapter five that we're, isn't it chapter five we're on today?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 521.531,
    "end": 530.233,
    "text": " So I mean, I don't have this worked out of my head, but I'm just interested.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 530.814,
    "end": 538.075,
    "text": "It's entirely possible that one could say active inference isn't about what it doesn't speak to consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 538.116,
    "end": 539.416,
    "text": "Consciousness is another thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 539.796,
    "end": 546.558,
    "text": "Active inference just gives another is a potential model that drives",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 547.878,
    "end": 551.2,
    "text": " decision-making within the organism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 551.341,
    "end": 555.483,
    "text": "And that's okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 556.724,
    "end": 563.708,
    "text": "But I'm just interested in other people's thoughts on this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 563.969,
    "end": 566.07,
    "text": "It's great topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 566.13,
    "end": 568.011,
    "text": "So just a few notes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 571.553,
    "end": 571.954,
    "text": "Broadly,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 573.151,
    "end": 575.333,
    "text": " there are perspectives on consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 575.393,
    "end": 578.616,
    "text": "Well, first I'll just note, consciousness appears to be only used once in the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 579.417,
    "end": 598.955,
    "text": "So while it is true that it's an area of interest and was the live stream with Vanja Visa this morning, I mean, and the authors all explore elsewhere, but any interpretation of consciousness, I don't even think it's within the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 600.274,
    "end": 623.94,
    "text": " not a pillar of the framework it's something that is like inferred towards so i think that will always leave a fundamental um uncertainty and pluralism and then we can think about at least a gradient of um accounts of consciousness in some accounts consciousness is um after the fact in some way that it could still be anticipatory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 624.983,
    "end": 629.445,
    "text": " from a predictive processing sense, but it does not have a causal power.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 630.225,
    "end": 639.328,
    "text": "It's a narrative told to, let's say, minimize variational free energy to make sense of memories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 640.628,
    "end": 647.671,
    "text": "And so that kind of narrative expositional self as epiphenomena and experience without causal impact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 648.871,
    "end": 653.253,
    "text": "And then that is of course contrasted with causal accounts of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 654.384,
    "end": 678.645,
    "text": " that's where whether you come from some philosophical tradition or certain folk psychological traditions um which both can arise during scientific writing as well things like emotions or awareness or even attention are actually described as causally upstream of other phenomena and that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 680.131,
    "end": 697.516,
    "text": " puts one of course squarely in the kind of cartesian dualism area of philosophy like how does something that is not physical influence something that is physical um so the the the the dominant",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 698.715,
    "end": 714.976,
    "text": " mode to me on that question is consciousness is something we can model about and around with active inference but no perspective on consciousness seems fundamental to using statistics in this way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 716.314,
    "end": 743.664,
    "text": " and so i expect and already find confirmatory evidence that some people take a more epiphenomenal approach to consciousness and some people taking a more causal approach for example treating it like a hidden latent factor that does have a causal impact in a causal bayesian sense and then also just recognizing yeah we don't know exactly what it is but that's how we do active modeling we propose latent causes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 745.262,
    "end": 767.866,
    "text": " and those become our generative model so in some ways there may be more similarities between these two than their hyperbolic forms suggest and in either case I feel like it's a continuum that's accommodated methodologically by what Ali referred to as the as if epistemology",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 769.218,
    "end": 772.099,
    "text": " And that, I think, connects to Daniel Dennett's intentional stance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 772.579,
    "end": 776.219,
    "text": "Like, I'm going to play this chess computer like it's trying to beat me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 777.119,
    "end": 780.82,
    "text": "If it's not, then I want to win.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 781.84,
    "end": 785.141,
    "text": "So if it wants me to win too, then that's going to be great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 786.141,
    "end": 789.021,
    "text": "But I'm going to hedge my bets and play like it's trying to win.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 790.162,
    "end": 797.603,
    "text": "And I think that kind of intentional stance is not just warranted, it's actually supported",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 798.88,
    "end": 821.258,
    "text": " by these methodological tools terry or michael well in in some ways and we're getting way off topic and then i will be quiet oh no this is we're technically in chapter 10 so we're we're totally on just recap and meme status",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 823.962,
    "end": 828.588,
    "text": " OK, but it's like, but you would say that, wouldn't you?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 829.268,
    "end": 840.642,
    "text": "You know, if consciousness is an after the fact story we tell ourselves, you know, it's at the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 841.563,
    "end": 856.916,
    "text": " if the world is probably more likely that one finds oneself in front of a computer play playing chess because of the, you know, all of the previous events that have occurred during your, your life and that you are now playing chess.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 857.256,
    "end": 865.803,
    "text": "So the story you tell yourself is that I'm going to play to win, but actually that it wasn't the, it wasn't the conscious decision that got you there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 866.243,
    "end": 868.385,
    "text": "If consciousness is an after the fact.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 868.405,
    "end": 869.686,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 872.291,
    "end": 888.983,
    "text": " you know, a hallucination or story that we create to justify the things that are happening in the external, in the unknown external state, you know, because the computer is in the unknown external state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 889.123,
    "end": 899.39,
    "text": "It's something that we have internally created as our model based on the information we're getting across our Markov blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 900.17,
    "end": 901.812,
    "text": " Am I getting too mad?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 901.912,
    "end": 904.393,
    "text": "No, I'll give a short note and then Ali.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 905.054,
    "end": 919.484,
    "text": "So one answer from a biological perspective is, especially over evolutionary time, but also within a generation, you will only repeatedly observe things that are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 920.811,
    "end": 925.854,
    "text": " fighting to live and persisting amidst challenging and adversarial settings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 926.374,
    "end": 932.698,
    "text": "So if we just say, oh, well, just the person in front of the computer, what would be subconsciously leading them to want to win?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 933.339,
    "end": 947.227,
    "text": "But if we say we're in a chess tournament series and only people who have won previous chess tournaments defined by winning in this arbitrary way, only they are persisting in this tournament.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 948.248,
    "end": 948.628,
    "text": "Well, then why,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 949.921,
    "end": 956.143,
    "text": " Over time, you will come to find that those agents are acting as if they want to win at chess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 957.723,
    "end": 959.444,
    "text": "Now, then there's the debate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 960.144,
    "end": 964.665,
    "text": "Well, what if they're just acting like they want to win at chess, but they don't really want to win?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 965.425,
    "end": 966.786,
    "text": "They're chess zombies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 967.646,
    "end": 968.806,
    "text": "They're just acting like it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 969.547,
    "end": 970.787,
    "text": "And then that's the pluralism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 972.048,
    "end": 981.476,
    "text": " Some people look at that chess tournament sequence and they go, yeah, I actually have like reasons to think that people don't have experience or intentions or that consciousness is just a narrative told after the fact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 981.976,
    "end": 983.798,
    "text": "And so they're just acting like they want to win.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 984.578,
    "end": 994.306,
    "text": "And the other person tells us extremely intimate causal story about how the motivation of the person drives their action selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 996.107,
    "end": 1001.452,
    "text": "But in the end, they're unified by this as if epistemology, which is to say the intentional stance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1003.416,
    "end": 1003.636,
    "text": " Ali?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1007.158,
    "end": 1018.724,
    "text": "Yeah, also this kind of as if epistemology comes from, at least partially comes from Kantian transcendental idealism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1018.764,
    "end": 1027.828,
    "text": "So for Kant, concepts do not apply to reality in the form in which we can only think them, but",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1030.449,
    "end": 1047.585,
    "text": " it is also urgently required for any theoretical practice to think and investigate objects with the help of the concepts as if they were given or determined in a specific way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1048.045,
    "end": 1050.888,
    "text": "So this kind of as-if epistemology",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1056.131,
    "end": 1067.82,
    "text": " You see, concepts have to acknowledge that a reality is presupposed independently of the choice of its semantics or its meanings.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1068.341,
    "end": 1077.348,
    "text": "On the other hand, in their self-reference and self-similarity, they work with this heuristic of as if,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1079.46,
    "end": 1087.569,
    "text": " so that it can be constructed in this way as if reality and concept would actually coincide with each other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1087.589,
    "end": 1092.434,
    "text": "But some recent philosophers, such as Karen Broad,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1092.99,
    "end": 1117.251,
    "text": " attempts to overcome this kind of as if epistemology uh for example in her agent realism agential realism um by means of construction of interactive uh discursive in which uh both epistemology and ontology can be seen as the very same thing and uh we wouldn't be required to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1118.602,
    "end": 1136.258,
    "text": " draw a boundary between the perception on the one hand and the thing that we're trying to percept or model on the other hand so through this uh intra action not interaction but intra action or constructive interaction",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1138.335,
    "end": 1141.017,
    "text": " they constitute each other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1141.578,
    "end": 1146.262,
    "text": "So they give rise to their very existence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1146.962,
    "end": 1150.505,
    "text": "And also, I think in some view,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1151.989,
    "end": 1167.677,
    "text": " FEP is perfectly compatible with this more loose sense of onto epistemology because one of the requirements of the FEP is if things exist,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1168.732,
    "end": 1171.735,
    "text": " how they should behave, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1172.356,
    "end": 1189.533,
    "text": "So it somehow presupposes this kind of interactive discourse by basically eliminating the boundary between the thing that we're trying to model and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1191.944,
    "end": 1195.186,
    "text": " I mean, the model or the map.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1195.567,
    "end": 1200.29,
    "text": "So that's basically the argument behind that map territory fallacy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1201.031,
    "end": 1218.143,
    "text": "So, yeah, this is a bit more complicated in this sense that if we want to get to the bottom of this kind of epistemology, we will hit a dead end if we just...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1221.329,
    "end": 1237.092,
    "text": " If we just go through this more traditional Western epistemology of distinguishing between the thing that we're trying to perceive and the perception itself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1238.172,
    "end": 1245.353,
    "text": "But as I said, FEP somehow tries to overcome this problem in the first place.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1251.007,
    "end": 1251.91,
    "text": " That's beautifully described.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1262.214,
    "end": 1264.855,
    "text": " and nicely closed down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1267.257,
    "end": 1283.084,
    "text": "The thing that I was thinking initially was the assumption that in the external state there's actually a chess competition happening is assuming almost this, you know, that our...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1286.346,
    "end": 1303.642,
    "text": " internal state representation is an accurate or a true likeness of what the external state is which i think ali was kind of saying but um i my my sense is that it clearly can't be because all of our",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1304.683,
    "end": 1333.895,
    "text": " um all of our all of our qualia are um uh endeavors that the the the the central nervous system makes to interpret um signals that are generated without the qualia that we apply to them yeah no these are these are great one short thought then michael um yeah the internal state",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1335.504,
    "end": 1352.18,
    "text": " does not in the model does not have to have the same structure as the external state so like often we'll talk about well the external state in the model could be a continuous temperature and the internal state could just be maybe too hot just right or too cold so they can have different structure",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1353.368,
    "end": 1361.332,
    "text": " And that reflects that they don't even have to be of the same type, even within the model, let alone the territory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1362.193,
    "end": 1380.522,
    "text": "However, by the cybernetic principles, like good regulator theorem, again, eventually, you can always just create an edge case where the agent has no mapping between their internal cognitive dynamics and the external regularities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1381.311,
    "end": 1385.452,
    "text": " Like it's just playing the game randomly with respect to the environmental variability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1386.292,
    "end": 1389.853,
    "text": "And in a research or an education setting, that may be pedagogical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1390.573,
    "end": 1400.996,
    "text": "But when we're talking about real measurements that we made, even of like the pen on my desk, it is resisting dissipation over some spatial temporal timescale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1402.456,
    "end": 1409.478,
    "text": "And that is actually the surprising implication of if things exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1410.882,
    "end": 1415.545,
    "text": " how they should behave is like, well, I am repeatedly measuring this pen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1417.266,
    "end": 1418.787,
    "text": "So now what can I say about that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1419.227,
    "end": 1429.473,
    "text": "And it turns out you can actually say a lot if you bake into your understanding that you are observing something repeatedly existing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1430.454,
    "end": 1432.275,
    "text": "And that's exactly what we see in figure 9.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1432.395,
    "end": 1436.538,
    "text": "And so we have a unity of the scenario",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1441.883,
    "end": 1468.731,
    "text": " in our model via articulating the partitions on a base graph so that means they're still totally up in the air mapping territory and all of that but within our model we're we're approaching that in a way that sets the stage for people to then take further perspectives about deeper questions michael",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1472.028,
    "end": 1482.851,
    "text": " Yeah, I think these questions maybe somehow relate to this tale of two density papers you mentioned last time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1483.551,
    "end": 1495.735,
    "text": "And my understanding of this paper is that they try to argue that there is no representation in the mind, but the mind is a controlled system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1496.355,
    "end": 1501.7,
    "text": " And then they talk about two different distributions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1502.661,
    "end": 1511.529,
    "text": "So one distribution is the recognition distribution, and the other one is the generative system, if I understood correctly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1512.169,
    "end": 1525.333,
    "text": " But I didn't really understand how this distribution comes into being through the generative system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1525.373,
    "end": 1530.094,
    "text": "So they equal one with an enacted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1530.635,
    "end": 1538.517,
    "text": "So the recognition system is the embodied system, and the generative system is the enacted system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1540.353,
    "end": 1544.754,
    "text": " And my understanding is that this is all that there is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1545.355,
    "end": 1558.479,
    "text": "So for instance, they say here on page 235, the generative model manifests as a control system that uses exploitable structural similarities",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1559.299,
    "end": 1562.642,
    "text": " encoded in the internal states of the organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1563.483,
    "end": 1569.868,
    "text": "So instead of having representations, they talk about control states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1570.829,
    "end": 1573.951,
    "text": "And do I understand this correct?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1573.971,
    "end": 1577.895,
    "text": "So how can that be a distribution?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1583.664,
    "end": 1589.792,
    "text": " I didn't really understand where these two distributions are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1590.593,
    "end": 1590.854,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1592.496,
    "end": 1593.638,
    "text": "All great questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1593.718,
    "end": 1595.44,
    "text": "So I'll try to address some.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1595.5,
    "end": 1599.606,
    "text": "So this question of exploitable similarity,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1600.879,
    "end": 1604.181,
    "text": " is very much like the good regulator theorem in cybernetics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1605.042,
    "end": 1610.345,
    "text": "So it doesn't mean that the temperature in the room, let's just say that it's physiologically relevant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1611.206,
    "end": 1625.715,
    "text": "So there have to be some sensors and some processing apparatus and also action apparatus, but at the very least just for cognition, a sensory and processing apparatus that is able to like measure temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1626.852,
    "end": 1647.887,
    "text": " can be a proxy of it doesn't need to be strict isomorphism they say it's weaker than a strict isomorphism but it actually has to have some sort of causal relevance now if you're like well i'm in a simulation where the temperature is fluctuating but it has no survival value then it's like okay that's like saying you know cosmic rays are going through us they don't have survival value and so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1649.189,
    "end": 1651.491,
    "text": " They're not part of the cognitive model in this setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1653.573,
    "end": 1665.282,
    "text": "But this points to this idea that there is information in the sensory apparatus about action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1665.483,
    "end": 1668.945,
    "text": "It's actionable intelligence with respect to persistence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1669.566,
    "end": 1670.387,
    "text": "Why persistence?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1671.187,
    "end": 1676.011,
    "text": "Well, we could say in pursuit of reward, but then we would need to ask how systems persist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1676.892,
    "end": 1677.572,
    "text": " Why persistence?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1678.052,
    "end": 1681.453,
    "text": "Because we're at least repeatedly measuring the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1682.274,
    "end": 1704.441,
    "text": "So again, with the as-if epistemology, it's as if in order to persist amidst dissipative and adversarial settings, it's as if there's an exploitable information content in the perceptual umwelt that enables that kind of thing to persist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1705.933,
    "end": 1708.895,
    "text": " That's like the tautology that also goes beyond a tautology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1709.496,
    "end": 1712.918,
    "text": "Now to the specifics of the tail of two densities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1715.44,
    "end": 1719.103,
    "text": "This also might've been the first dot zero in six, I'm not sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1721.905,
    "end": 1729.571,
    "text": "In Bayesian statistical analysis, models can be run in two different directions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1730.404,
    "end": 1737.527,
    "text": " This could be like a hyperprior and here's the hyperpriors on the right and the data are on the left.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1738.788,
    "end": 1745.691,
    "text": "So it's like you can specify the hyperprior or the hidden state distribution and you can emit pseudo data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1746.591,
    "end": 1747.671,
    "text": "That's called generative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1748.872,
    "end": 1753.134,
    "text": "Or you can have data and then parameterize hidden states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1754.008,
    "end": 1755.388,
    "text": " That's the recognition model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1755.868,
    "end": 1758.809,
    "text": "So this could be the actual measurements of children's height in the classroom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1759.509,
    "end": 1764.63,
    "text": "Here's our generative statistical model, Gaussian family, mean and variance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1765.47,
    "end": 1773.772,
    "text": "So given a mean and a variance estimator, two numbers, metaphysical, statistical, we can generate infinite class size of synthetic height data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1774.692,
    "end": 1780.614,
    "text": "Or from one height observation or more, we can update our generative model of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1781.134,
    "end": 1781.314,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1782.274,
    "end": 1782.414,
    "text": "Then,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1784.682,
    "end": 1804.857,
    "text": " more broadly we're interested in this relationship between the world and the agent agent in the niche so perception and how that updates the agent's learning and uh and perception and then how the agent acts on the world and what they argue in this paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1808.951,
    "end": 1816.437,
    "text": " is that the recognition model in a Bayesian statistical setting, so going from measurements, which might be noisy,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1817.782,
    "end": 1821.423,
    "text": " And the height in centimeters isn't like the real height of the person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1821.523,
    "end": 1823.244,
    "text": "The number on the scale isn't the weight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1823.904,
    "end": 1825.804,
    "text": "The number on the thermometer is not the temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1827.225,
    "end": 1827.725,
    "text": "It's data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1828.305,
    "end": 1831.666,
    "text": "This is why the empirical perspective on behavioral modeling is so essential.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1832.406,
    "end": 1841.189,
    "text": "Because when we go on this Bayesian side, it's really easy to talk about how data are recognized and update hyperparameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1842.301,
    "end": 1847.583,
    "text": " And then hyperparameters can be in the business of continually generating unfolding predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1850.004,
    "end": 1852.085,
    "text": "We have a noisy camera with a blind spot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1853.606,
    "end": 1860.969,
    "text": "We're updating our generative model of vision, and then we're going to be, in this case, just creating more synthetic vision data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1863.47,
    "end": 1870.793,
    "text": "In inactivism and all of the associated ease, embodiment, et cetera, et cetera, et cetera, et cetera, they are focused on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1871.761,
    "end": 1876.283,
    "text": " the materiality of the engagement of the agent with the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1878.543,
    "end": 1899.431,
    "text": "In this paper, Tale of Two Densities, they draw these two together to argue in the context of what we'll just point to in figure 4.3 with the A matrix here, two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1901.707,
    "end": 1906.55,
    "text": " There's a generative production of synthetic observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1906.97,
    "end": 1907.891,
    "text": "You could use it that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1909.112,
    "end": 1916.536,
    "text": "That's the generative direction of A. Or you could use A in its recognition capacity to update hidden states from observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1917.837,
    "end": 1927.023,
    "text": "So even without getting into the generativity of action, which is what in the inactivist's setting, what they're most interested in,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1928.496,
    "end": 1957.126,
    "text": " is the actual causal consequences of action, just within a figure, point three, hidden state inference, we can think about a tail of two densities and about how Bayesian statistics helps reconcile this tail of two densities because the same generative model, which is just what we call whatever Bayes graph you construct, the generative model, can be used",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1958.522,
    "end": 1962.725,
    "text": " equally flexibly to do inference about any part of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1963.505,
    "end": 1968.249,
    "text": "Like maybe you know the hidden states, but you're trying to determine the prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1970.49,
    "end": 1975.153,
    "text": "So these graphs are agnostic as to what you know and what you want to infer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1976.294,
    "end": 1983.619,
    "text": "Now it turns out that for real settings that we find in the behavioral lab and out in the fields, we get observations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1985.785,
    "end": 1990.286,
    "text": " We don't have access to hidden states, but we want to infer them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1991.646,
    "end": 1995.307,
    "text": "We don't even think A or B matrices or D matrices exist in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1995.427,
    "end": 1998.368,
    "text": "We purely want to infer them as statistical parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2000.088,
    "end": 2002.409,
    "text": "And then we want to know about action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2004.809,
    "end": 2015.192,
    "text": "And in some settings, we have the organism's trace of actions, and we're trying to infer their cognitive parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2016.607,
    "end": 2018.787,
    "text": " That's the figure 9.1 setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2021.168,
    "end": 2022.408,
    "text": "We saw their actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2023.448,
    "end": 2024.428,
    "text": "It was data for us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2025.609,
    "end": 2028.549,
    "text": "And we're looking to parameterize a cognitive model for them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2030.75,
    "end": 2038.711,
    "text": "Another setting is we don't know what action will be taken because we're the ones taking it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2040.071,
    "end": 2043.832,
    "text": "And that is like a prospective application of these types of models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2045.083,
    "end": 2051.768,
    "text": " to take ongoing streams of observations and then perform action selection in the moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2053.609,
    "end": 2066.218,
    "text": "But these frameworks are enormously general with whether they're used for online or offline inference and like what you actually have access to measuring and how.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2069.26,
    "end": 2072.182,
    "text": "So little long, but the tale of two densities,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2073.539,
    "end": 2099.489,
    "text": " is about how the bayesian epistemology and structuring of the relationship between observations and inferences about observations maps in the inactivist setting to some aspects of how we think about perception cognition and action in the niche and their paper positions that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2101.095,
    "end": 2121.205,
    "text": " within the debates around representation because representation are although there's different perspectives etc postulated to be like the on agent aspects that have semantics about the world",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2127.392,
    "end": 2134.436,
    "text": " Yeah, and they say the agent just controls the world through their own actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2135.456,
    "end": 2136.697,
    "text": "That's my understanding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2138.498,
    "end": 2138.858,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2140.419,
    "end": 2140.619,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2140.639,
    "end": 2146.942,
    "text": "So then the two densities are on the incoming side and in the outcoming side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2149.123,
    "end": 2149.423,
    "text": "OK.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2150.364,
    "end": 2151.164,
    "text": "That's the idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2151.204,
    "end": 2152.305,
    "text": "We may be stretching.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2153.955,
    "end": 2162.937,
    "text": " The density is not the constitution of the states, of the internal states, but the observable actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2166.698,
    "end": 2177.041,
    "text": "We may be stretching the tale of two densities, making more of a set of novels around densities, because it's just ultimately a cultural reference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2179.322,
    "end": 2180.182,
    "text": "The technical point",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2181.101,
    "end": 2209.727,
    "text": " is that these variables are statistical distributions and hence they are densities they're statistical densities over some support so the two densities that we might be interested in or amongst two of the ones that we're interested in making a unified account of are the perceptual density which is about how data map on to hidden states like given retinal data",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2210.894,
    "end": 2237.777,
    "text": " is that a car that's a recognition model and then there's kind of like two kinds of generative densities you could run that car recognition model backwards say given the label of a car generate me cars stable diffusion generative ai but then there's also this action as a generative step",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2239.119,
    "end": 2262.616,
    "text": " that brings in the actionable and cybernetic constraints which is why they focus on the exploitable similarity but in general Bayesian models you can do this kind of observable hidden state inference about anything",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2265.342,
    "end": 2273.686,
    "text": " The organism, Bayesian brain, or if we choose to use Bayesian statistics, it's going to be doing something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2274.786,
    "end": 2278.948,
    "text": "The world has a real temperature, which is like molecules moving at different speeds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2281.129,
    "end": 2289.533,
    "text": "Perception occurs through sensors, which transform whatever it is the molecules are doing into something totally, totally different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2290.52,
    "end": 2296.467,
    "text": " Can I just make a little point about that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2296.927,
    "end": 2309.661,
    "text": "I remember watching Richard Feynman, just a short video, where he was describing temperature as actually infrared radiation, which is part of the electromagnetic spectrum.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2310.522,
    "end": 2316.987,
    "text": " On one part of that spectrum, we see light, and on the other, we experience temperature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2317.367,
    "end": 2322.931,
    "text": "So temperature is actually a proxy for something else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2324.592,
    "end": 2333.739,
    "text": "The mechanism that we have to perceive temperature is then a proxy for the amount of energy within that, for example, room.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2334.279,
    "end": 2336.081,
    "text": "So it's not...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2336.842,
    "end": 2340.714,
    "text": " Our response to the infrared information",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2343.431,
    "end": 2349.497,
    "text": " is a response that's not based on necessarily that infrared is going to damage us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2349.717,
    "end": 2352.079,
    "text": "It's that there's too much energy in this room.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2352.379,
    "end": 2365.089,
    "text": "And the tool that I have to assess that energy in the room is actually monitoring the infrared radiation, which I can't see, but I can feel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2366.05,
    "end": 2366.771,
    "text": "Any comment on that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2367.981,
    "end": 2372.504,
    "text": " Yeah, like by analogy, how about tasting different foods?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2373.304,
    "end": 2394.117,
    "text": "And there might be a toxin, like we can't directly tell that something is gonna be contaminated, but over time, successful entities in an unchanging niche, now that's not every case, but just with that simple case at first, successful entities in an unchanging niche will come to exploit similarities",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2395.595,
    "end": 2401.559,
    "text": " which is to say mutual informations between the recognition model and the actionability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2404.241,
    "end": 2415.149,
    "text": "And so they don't need to be directly measuring or even internally representing this is going to make me sick or this is the wavelength of light.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2415.43,
    "end": 2421.974,
    "text": "Any and all informative cues of sensors are going to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2423.351,
    "end": 2426.012,
    "text": " aligned towards adaptive action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2427.513,
    "end": 2432.795,
    "text": "That's the synthesis of signal processing and control theory in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2434.996,
    "end": 2451.284,
    "text": "And it turns out that by taking a first principled approach to the synthesis of those two fields, again, just coarsely, we have new insights on the question of representation in cognitive science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2460.315,
    "end": 2475.267,
    "text": " Yes, but taste is a very interesting phenomenon in that we have sweet, salt, sour, bitter, and yet I think there are trillions of different tastes that we can actually create or...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2481.191,
    "end": 2495.226,
    "text": " or i think smell is probably associated with taste as well so you know from a limited amount of sensory information we can create a vast array of um experience",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2496.601,
    "end": 2496.841,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2497.401,
    "end": 2504.603,
    "text": "I mean, with the Jolly Ranchers, I don't know, just a candy I had in childhood, like they literally taste the same if you don't see the color.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2505.103,
    "end": 2509.524,
    "text": "But if you do see the color, even if you try to forget, they will taste different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2510.384,
    "end": 2511.924,
    "text": "So, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2512.184,
    "end": 2515.925,
    "text": "So different, that's like referred to a sensor fusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2516.866,
    "end": 2520.146,
    "text": "Different sensors come together in the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2521.327,
    "end": 2523.327,
    "text": "And it really speaks to the predictions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2526.159,
    "end": 2529.694,
    "text": " It really speaks to what are our priors, you know?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2531.285,
    "end": 2555.176,
    "text": " another kind of mind bender on this is like the visual example there's so much abundant um on ramps to predictive processing like we don't notice our blind spot we don't have any blur when we do the isocate several times per second because of sensory attenuation you know color vision and precision in the periphery okay i'm on board with a generative model of vision",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2556.336,
    "end": 2562.339,
    "text": " I've kind of dispelled this sort of incoming information camera processing model of vision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2562.839,
    "end": 2566.381,
    "text": "I really believe in the visual generative model getting updated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2566.401,
    "end": 2568.422,
    "text": "And it's like, but taste?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2570.863,
    "end": 2573.725,
    "text": "It's like, yeah, by extension.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2574.105,
    "end": 2577.286,
    "text": "What does that really mean that we're generating our taste experience?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2578.267,
    "end": 2581.268,
    "text": "Well, then why wouldn't I just generate tastes that taste amazing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2581.288,
    "end": 2581.889,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2582.602,
    "end": 2587.583,
    "text": " well, why wouldn't your generative model of vision just generate what you like to see?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2589.323,
    "end": 2598.085,
    "text": "And that's where the real organismal constraints and where appeals to our development, ecology, and evolution do come into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2598.625,
    "end": 2606.126,
    "text": "So again, contrived Gedanken can be proposed absent these super obvious constraints for real systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2607.446,
    "end": 2611.027,
    "text": "However, in the context of empirical behavioral modeling,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2612.173,
    "end": 2624.154,
    "text": " it's usually sufficient to say the prior distribution on this or the trade-off between these two different drives is inherited from history and development or even from intergenerational processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2628.942,
    "end": 2644.831,
    "text": " But isn't it that we generate a good taste going to a baker where we like to go and going towards those areas where we get those kinds of rewards that we prefer?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2646.516,
    "end": 2648.297,
    "text": " I mean, doesn't that make sense also?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2649.157,
    "end": 2650.497,
    "text": "Always coming back to the baker.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2651.558,
    "end": 2653.138,
    "text": "Yes, I don't know why.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2655.899,
    "end": 2657.16,
    "text": "Yes, okay, okay, here we were.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2657.54,
    "end": 2658.88,
    "text": "Okay, chapter seven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2660.221,
    "end": 2663.282,
    "text": "We were engaged in a policy vacillation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2664.062,
    "end": 2667.343,
    "text": "We were not sure if we were wanting to get bread or if we wanted to go to the barber.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2667.944,
    "end": 2672.705,
    "text": "So now the question of the taste.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2672.825,
    "end": 2674.186,
    "text": "Yes, if we...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2675.419,
    "end": 2678.721,
    "text": " Expect and prefer a given taste, like sweet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2679.542,
    "end": 2683.605,
    "text": "And I think this holds true for sugar, but it can hold true for other things too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2684.986,
    "end": 2702.258,
    "text": "Then in the free energy evaluation of different policies with expected free energy, expecting observations that align with your preferences will be associated with pragmatic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2705.942,
    "end": 2728.546,
    "text": " So that is how preference for sweeter tastes puts its thumb on the scale of policy selection, biases policy selection towards tasting sugar as a pragmatic reward, but that happens amidst a relationship with epistemic value as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2731.386,
    "end": 2735.047,
    "text": "So it's like epistemic value could be pursued",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2736.357,
    "end": 2738.138,
    "text": " Like we need to find out how to get to the baker.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2742.24,
    "end": 2750.623,
    "text": "I mean, there's many ways to go, but yes, you would parameterize a generative model with a preference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2752.304,
    "end": 2757.126,
    "text": "Let's think about this case with sugar and the baker in those two settings that we described.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2757.626,
    "end": 2763.889,
    "text": "So in one case, we're in figure 9.1 and we're observing people's behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2765.037,
    "end": 2766.518,
    "text": " So we have their credit card history.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2766.978,
    "end": 2767.238,
    "text": "Whoops.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2768.359,
    "end": 2774.742,
    "text": "And we're observing who is going to the baker or what they're ordering or what they're clicking on online.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2775.803,
    "end": 2779.284,
    "text": "And now we're going to do inference on a generative model for them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2779.444,
    "end": 2781.445,
    "text": "It's the as if generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2782.586,
    "end": 2788.649,
    "text": "And it's like, wow, this person has a very strong C vector, very strong preference vector for sugar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2789.99,
    "end": 2793.612,
    "text": "Like given alternatives, they're always going for the sweeter one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2794.636,
    "end": 2797.338,
    "text": " And this person has a neutral preference for sugar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2797.358,
    "end": 2805.763,
    "text": "And this person actually like moves away from sugar as represented by our parameterization of the C vector.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2807.685,
    "end": 2808.865,
    "text": "So that's one setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2809.005,
    "end": 2815.189,
    "text": "We have data on a bunch of different entities on what they chose in different sugar concentrations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2817.371,
    "end": 2823.215,
    "text": "And then the other setting would be, now step into the trajectory of one of those cognitive models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2824.915,
    "end": 2827.136,
    "text": " and now ask what your next action should be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2829.418,
    "end": 2834.021,
    "text": "And that's the as if a gentle or intentional stance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2835.221,
    "end": 2837.883,
    "text": "So this is the behavioral scientist's view from the outside.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2839.724,
    "end": 2846.849,
    "text": "And then that is going to be flexible with allowing us also to take views as if from the inside.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2849.57,
    "end": 2852.192,
    "text": "And just because we can take an as if view from the inside",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2854.125,
    "end": 2855.826,
    "text": " doesn't mean that that's the territory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2856.347,
    "end": 2858.248,
    "text": "That's literally the map territory fallacy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2861.491,
    "end": 2868.096,
    "text": "But it means that within the limits of our cognitive model, we do have that opportunity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2874.34,
    "end": 2877.102,
    "text": "One of the things that strikes me as you talk about this is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2880.445,
    "end": 2896.698,
    "text": " One of the interviews Carl Friston has done online, he talks about our actions during the day that we get up and we have our breakfast and then we go to the bus and we go to work and we do our work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2896.879,
    "end": 2902.343,
    "text": "And actually, most of our life is little routines.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2902.483,
    "end": 2907.968,
    "text": "We think that we have these independent lives where we are constantly making...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2909.209,
    "end": 2913.472,
    "text": " decisions about what do I want to eat today?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2913.872,
    "end": 2914.473,
    "text": "Where will I go?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2914.753,
    "end": 2928.644,
    "text": "But actually, the person who ends up going to the baker will find that on their walk to the bus stop, they pass the bakery and they get a trigger from the smell of the bakery to do the thing that, you know, to predict that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2929.765,
    "end": 2933.968,
    "text": "It's just interesting that we don't exist anymore.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2934.762,
    "end": 2952.76,
    "text": " As these completely independent, no matter where you live, no matter who you are, there are so many aspects of your life that are just so, so repeatable that we actually live within a very constricted box, apart from odd times when we step outside that box.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2953.881,
    "end": 2957.044,
    "text": "I don't know if that's relevant to that picture, but...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2957.364,
    "end": 2957.985,
    "text": " Oh, it's awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2958.326,
    "end": 2961.37,
    "text": "I mean, very interesting to point to the state of exception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2962.212,
    "end": 2967.46,
    "text": "In Livestream 10 with Mao and Ramstad et al., who are the other authors?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2967.86,
    "end": 2969.983,
    "text": "Mao, Axel, Karl, and Maxwell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2971.955,
    "end": 2974.176,
    "text": " they talk about like strong and weak scripts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2974.976,
    "end": 2983.299,
    "text": "A strong script in a social setting would be like if we were literally reading from a screenplay or if we were doing some sort of highly ritualized behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2984.079,
    "end": 2994.302,
    "text": "Whereas the weaker script concept refers to like norms, normativity, expectations, X kind of person should act like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2994.642,
    "end": 2995.803,
    "text": "I'm X kind of person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2997.122,
    "end": 3000.463,
    "text": " I would be unsurprised by doing X. Oh, what do you know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3000.803,
    "end": 3017.37,
    "text": "I'm doing X. And that kind of progressive identity capture and development of understanding what kind of thing one is, and then what are the two ways you can reduce your discrepancy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3017.97,
    "end": 3022.732,
    "text": "You can learn, change what you think that kind of thing is, and you can act.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3024.059,
    "end": 3027.161,
    "text": " So undergrad should act this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3027.221,
    "end": 3028.541,
    "text": "Here's the distribution of undergrads.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3029.242,
    "end": 3041.648,
    "text": "If one's understanding of what an undergrad was, was totally flat with respect to everything, there's nothing that characterizes an undergrad versus anything else, just from one person's perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3042.088,
    "end": 3045.73,
    "text": "Well, then that aspect of their identity wouldn't shape their policy selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3047.511,
    "end": 3052.374,
    "text": "Whereas if someone says, well, as a X, I should be doing Y.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3054.711,
    "end": 3078.841,
    "text": " can be approached from a purely statistical deflationary perspective like i just expect myself to be doing this like or it can go even beyond that too so these are these are all very relevant and learning about the the fundamentals of this kind of statistical modeling help us",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3081.124,
    "end": 3095.838,
    "text": " I hope, I prefer also that it helps us actually respect the complexity and the richness of these phenomena, which just simply cannot be expressed in words or math, which is why we talk about the map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3099.62,
    "end": 3110.609,
    "text": " One of my wonderings about all this, because I do find the maths and the pictures and the diagrams all very difficult to grasp.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3110.789,
    "end": 3126.802,
    "text": "In some way, is there a potential that if we really understood the model, we could start to use that as a system to inform our understanding of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3129.048,
    "end": 3130.155,
    "text": " individual behaviours.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3131.243,
    "end": 3151.539,
    "text": " I mean, I'm a pain doctor, so my interest in all this is this truth that we can alter our... If you're in pain, if you have back pain, you can alter your prediction about your back pain and actually alter your back pain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3151.859,
    "end": 3160.065,
    "text": "And I'm just wondering if this kind of modelling could in some way give us a tool to help us to...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3161.446,
    "end": 3169.074,
    "text": " support other humans in understanding their ability, that they can update their priors, you know?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3170.396,
    "end": 3172.298,
    "text": "Yeah, it's a great vision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3172.438,
    "end": 3177.583,
    "text": "I think the closest that we've explored that is with the help of Ian Tennant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3178.473,
    "end": 3198.448,
    "text": " who has a interoception focus and this therapeutic alliance concept where a lot of these kind of avenues and like, it's not as simple as just wish it away any more than the generative model of vision would be like, I want to see, you know, a unicorn in front of me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3199.469,
    "end": 3207.415,
    "text": "So how do we reconcile that agential realism that Ali mentioned earlier?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3207.515,
    "end": 3207.635,
    "text": "Like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3208.53,
    "end": 3230.245,
    "text": " this active co-construction and negotiation and sense-making from our sensorium and the ways that our narratives and the scripts and the expectations shape our inference and action and choose to have a preference and to act to push things in a certain way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3231.245,
    "end": 3231.425,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3233.046,
    "end": 3233.507,
    "text": "Absolutely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3235.768,
    "end": 3236.088,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3237.069,
    "end": 3237.75,
    "text": "But, but, but,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3239.552,
    "end": 3254.649,
    "text": " I suppose what I'm kind of thinking is, could you have a Sam Altman created model where you run the model and that can inform the understanding of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3261.056,
    "end": 3268.379,
    "text": " and individuals how they got there and potentially offer some insights into what to do about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3268.819,
    "end": 3284.266,
    "text": "You know, could this speak to a model that could be run where we could kind of do the experiment and then that supports an individual on actually going on the course of action",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3285.31,
    "end": 3288.412,
    "text": " to change their experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3289.213,
    "end": 3294.617,
    "text": "That's kind of what really blows my mind about this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3294.717,
    "end": 3304.424,
    "text": "And that in the current world that has only come into existence in the past month or so, this actually seems almost plausible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3306.529,
    "end": 3315.355,
    "text": " Because of the similar layered nodal systems that the likes of ChatGPT are using to protect language?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3318.297,
    "end": 3320.898,
    "text": "Yes, it's a great... It's not active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3321.118,
    "end": 3322.419,
    "text": "You know, it's not active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3322.719,
    "end": 3328.503,
    "text": "You could model it around a notion of active inference in the training of the system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3330.171,
    "end": 3356.802,
    "text": " there's there's so many avenues to explore there let's in our discussion next week let's look at um that again but absolutely with respect to figure 9.1s about us the data exists the means motive opportunity anyone who wants to can do things",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3359.011,
    "end": 3367.181,
    "text": " that's a big question so for next week thank you though i'll stop the recording so",
    "speaker": "SPEAKER_00"
  }
]