[
  {
    "start": 7.034,
    "end": 33.615,
    "text": " hello and welcome it's december 17th 2024 we're here with josephine pizam and colleagues discussing free energy projective simulation there will be a presentation followed by a discussion so thank you to all the authors for joining looking forward to it take it away thank you um hi and thanks for uh having us",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 34.22,
    "end": 40.686,
    "text": " Today, I wanted to present the paper that we have recently made public on the archive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 40.746,
    "end": 48.853,
    "text": "You can have the number here, which treats the free energy projective simulation, active inference with interpretability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 49.494,
    "end": 63.366,
    "text": "And our goal there was to combine an existing framework for agency called projective simulation with the free energy principle and active inference, where we have an agent that is able to learn",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 63.802,
    "end": 83.11,
    "text": " from its experience in the world gathering precepts and remembering a history of actions to learn a representation of its environment and behave adaptively in its environment by performing active inference to determine its behaviours.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 88.574,
    "end": 92.998,
    "text": " I have structured my presentation in three main points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 93.359,
    "end": 98.884,
    "text": "First, I want to introduce projective simulation to the community.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 100.166,
    "end": 111.497,
    "text": "Then I want to introduce the formulation and the aspects of active inference that I have used in these works, especially the notation will be important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 112.758,
    "end": 118.564,
    "text": "And then the main body of the presentation will deal with the free energy projective simulation,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 119.101,
    "end": 120.403,
    "text": " What is it architecture?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 120.503,
    "end": 121.244,
    "text": "How does it work?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 122.206,
    "end": 123.207,
    "text": "How do we train it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 123.748,
    "end": 127.874,
    "text": "And then some numerical analysis about it before I conclude.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 129.797,
    "end": 132.882,
    "text": "So first, what is projective simulation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 135.025,
    "end": 142.717,
    "text": "The goal of projective simulation is to model intelligent agents with a framework that is rooted in embodied cognitive science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 142.997,
    "end": 148.045,
    "text": "So now what I want to do is to look at the keywords of this sentence and understand what we mean",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 148.531,
    "end": 169.34,
    "text": " behind those words, starting with the notion of intelligence for an agent, where what we really mean here is that the agents we consider are able to perceive their environment and are able to influence and change their environment by acting on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 169.921,
    "end": 174.708,
    "text": "And in doing so, they are settling matters in the environment in a flexible way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 176.17,
    "end": 178.453,
    "text": "And then the agent,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 179.463,
    "end": 206.837,
    "text": " broad definition for it or um its support would be a system that has a memory as i said i want my agent to be able to remember its experience in the environment and it's also able to interact with this environment and that leads us then to embody cognitive science where instead of having the agent learning from a set of predefined rules that we as designers",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 207.121,
    "end": 211.652,
    "text": " would give to the agent such that it learns high-order concepts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 212.393,
    "end": 225.805,
    "text": "The agent has to learn from the information it has gathered from its interaction history with the environment, that is how it has perceived the environment and the action it has taken on this environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 226.612,
    "end": 233.339,
    "text": " And now I have spoken about memory earlier, and I want to make a precision for this intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 234.641,
    "end": 256.585,
    "text": "The agent should also be able to adapt to situations that it hasn't experienced yet by comparing it to its existing moments in memory, and to be able to compare them, see which elements of its past history are useful to adapt to unprecedented situations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 259.028,
    "end": 265.758,
    "text": " Now I want to dive into the way we are modeling the agent to implement projective simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 267.32,
    "end": 276.454,
    "text": "The agent is engaged in a preset action loop with the environment in that it has two types of subsystems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 276.894,
    "end": 284.125,
    "text": "A sensor system is able to perceive presets and stimuli from the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 284.78,
    "end": 291.145,
    "text": " and it's able to act on the environment and change its states through its actuators.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 291.58,
    "end": 320.895,
    "text": " And the key of projective simulation, the place where projective simulation will be important is the memory of the agent that is decoupled from its physical interface with the environment and that should allow the agent to reflect such that it can display some more complex behaviours in the environment going beyond stimuli response behaviours.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 321.803,
    "end": 337.409,
    "text": " The idea here is that the agent is able to simulate possible scenarios using its memories in order to plan or deliberate for its next action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 337.589,
    "end": 343.98,
    "text": "So this diagram should already be reminiscent of the free energy principle and active inference in general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 344.635,
    "end": 352.654,
    "text": " Now, projective simulation is a specific process that runs on the memory to deliberate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 355.013,
    "end": 363.785,
    "text": " For this, the memory is depicted as a network that connects different clips.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 363.945,
    "end": 384.953,
    "text": "If an event were a movie, a clip would be a snippet of that movie, just a few seconds of it, where the agent would recall the sensations it has had, the percepts it has had during this mini movie and the actions it has taken.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 386.654,
    "end": 398.723,
    "text": " Then the agent, the different clips are connected in a directed network so that the different events are connected with one another following the experience of the agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 400.492,
    "end": 417.028,
    "text": " Upon receiving a percept from the environment on its sensor system, a clip in the memory of the agent, in the episodic and compositional memory of the agent, you will hear me saying ECM very often.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 417.909,
    "end": 421.153,
    "text": "So a clip is excited by a percept from the sensors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 422.454,
    "end": 429.621,
    "text": "And then the deliberation of the agent will take place by hopping on those edges to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 430.124,
    "end": 441.459,
    "text": " go from one clip to the next and simulate forward the possible events that can unravel from this excited clip.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 441.479,
    "end": 453.415,
    "text": "So the agent does a random work on that network until it reaches a specific type of clip that will then decouple from the memory in this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 454.711,
    "end": 465.282,
    "text": " yeah, fictitious random walk such that an action comment will be sent to the actuator and the action will actually be implemented in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 466.523,
    "end": 470.888,
    "text": "So here I want to emphasize two types of states that can happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 472.67,
    "end": 482.76,
    "text": "Any state that is, any clip that is visited in the memory is either a remembered clip",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 483.263,
    "end": 488.99,
    "text": " a remembered event from the past or something that has been created that is fictitious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 490.012,
    "end": 502.588,
    "text": "And all the surrounding events, so the percepts and the actions are real and interface with the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 503.783,
    "end": 507.048,
    "text": " There are two specific types of clips that I want to emphasize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 508.23,
    "end": 514.661,
    "text": "The clips that couple with the percept from the sensors are called percept clips.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 514.681,
    "end": 520.29,
    "text": "And the clips that decouple from the memory towards the actuators are the action clips.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 525.772,
    "end": 534.302,
    "text": " Now, how do we train this memory, and how does the agent adapt and learn something using this memory?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 535.203,
    "end": 537.205,
    "text": "There are two ways that this can happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 538.066,
    "end": 553.163,
    "text": "Either the agent is creating new clips in its network, either because it has received a new percept on its sensors, or because it has created new clips from existing clips in its network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 554.037,
    "end": 572.154,
    "text": " And another mechanism that is more important for the present work is an update rule where each of the edges in the network is weighted with what we call an age value that can increase and decrease as the agent interacts with the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 572.935,
    "end": 580.062,
    "text": "And in particular, at each time step, the updated weight",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 580.463,
    "end": 585.571,
    "text": " decreases compared to the previous weight with a certain forgetting rate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 586.973,
    "end": 591.62,
    "text": "And it's brought back to its initial value with the same rate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 592.962,
    "end": 606.403,
    "text": "And every time an edge was traversed to make a deliberation that received a reward, it is reinforced with a certain reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 607.109,
    "end": 621.27,
    "text": " And from those edge value, then we can define a probability distribution that the agent will use to sample edges during its random walk to walk from one clip to the next and deliberate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 623.967,
    "end": 632.598,
    "text": " This is it for the mechanics of projective simulation and its conceptual meaning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 633.079,
    "end": 636.463,
    "text": "There were a few applications already in the literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 636.884,
    "end": 650.481,
    "text": "For example, it has been applied in robotics and reinforcement learning where a group in Innsbruck had a robot learn new skills from existing skills by preparing new",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 650.765,
    "end": 655.83,
    "text": " configuration of the environment that would enable the agent to extend its previous skills.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 657.072,
    "end": 666.021,
    "text": "It has also been used to simulate biological agents, especially the behaviors of honey bees when they are trying to defend themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 666.541,
    "end": 677.633,
    "text": "So it's a multi-agent scenario where each of the individual agents are coordinating their decisions to be efficient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 678.457,
    "end": 686.731,
    "text": " And there have been a number of evolutions that have been proposed on this standard projective simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 687.553,
    "end": 697.41,
    "text": "Multi-excitation projective simulation proposes that the clips are truly compositional and an edge is not only between two clips, but rather between groups of clips.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 697.911,
    "end": 699.874,
    "text": "That would represent the current situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 701.44,
    "end": 714.979,
    "text": " And there have been also quantization of projective simulation in this seminal paper, but also this has already been implemented experimentally on a small problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 717.283,
    "end": 724.613,
    "text": "So this brings me now to the second part of this presentation, where I want to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 725.588,
    "end": 738.541,
    "text": " give an overview of the free energy principle and active inference so that we are all agreeing on what we mean by our notations and active inference here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 742.845,
    "end": 754.397,
    "text": "So the claim of the free energy principle is that any adaptive system can be modeled as performing an approximate form of Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 755.474,
    "end": 759.479,
    "text": " So let's do as we did for projective simulation and look at keywords here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 760.059,
    "end": 762.182,
    "text": "What do we mean by an adaptive system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 763.083,
    "end": 778.661,
    "text": "It means that we have a system that is able to persist in its environment and to do so, it has to exhibit some form of flexible behavior and it has to be able to act on its environment so that it can change it if needed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 780.463,
    "end": 785.008,
    "text": "And the main keyword is Bayesian inference here, which",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 785.528,
    "end": 802.626,
    "text": " means that we can describe an agent as building an internal model, that it is using data from this environment in order to update this model, and that the update takes the form of an optimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 804.192,
    "end": 810.799,
    "text": " And another keyword I want to emphasize here is that it's modeled as performing Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 811.239,
    "end": 833.963,
    "text": "That is, it looks as if, so here we want to distinguish between the internal mechanics of an agent, learning from stimuli it receives from the environment and its actions, and the mathematical description that we can give of that agent as updating a model in a Bayesian way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 835.917,
    "end": 840.522,
    "text": " and hopefully these two would be reconciled at some point in the presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 844.066,
    "end": 864.507,
    "text": "First, to introduce active inference, before we introduce active inference, I would like to introduce perceptual inference, which is describing the process in which the agent is constructing its representation of the environment using the observations it receives from it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 865.938,
    "end": 883.727,
    "text": " The environment can be described as having hidden states and the agent acting on these hidden states will result in a change in that hidden state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 884.416,
    "end": 898.557,
    "text": " However, the environment is not fully accessible to the agent, it's only partially observable, so the agent will not see these hidden states, but instead only a small part of them will show the observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 900.059,
    "end": 906.829,
    "text": "And in order to understand the dynamics on those observations and being able to predict those observations,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 907.231,
    "end": 926.202,
    "text": " The agent will construct a world model in the form of a partially observable Markov decision problem, a PONDP, using what we call belief states, where here I use capital letters for the random variable and lowercase letters for the value that those random variables can take.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 926.924,
    "end": 939.099,
    "text": " And the idea of those belief states here is that they mirror the role of the hidden states such that the agent can use them then to make prediction about its observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 939.982,
    "end": 942.148,
    "text": "So similar to, I'm sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 942.787,
    "end": 957.471,
    "text": " Similar to the actions in the environment, taking an action will also result in a transition in the belief states, and those belief states have to be connected to the observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 958.683,
    "end": 970.218,
    "text": " The transition between belief states is usually qualified as a transition function and the association of belief states with observations as the emission function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 970.859,
    "end": 975.585,
    "text": "And those two functions can be modeled as probability distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 976.687,
    "end": 980.712,
    "text": "Here, the probability of the next belief state given the current belief state in its action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 981.754,
    "end": 987.441,
    "text": "And the likelihood is the probability of an observation given the current belief state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 988.265,
    "end": 1000.47,
    "text": " which means that then we obtain a world model that factorizes nicely into two functions, the likelihood on the one hand and the transition function on the other hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1002.975,
    "end": 1009.969,
    "text": "Now, we have said that the agent learns by performing Bayesian inference, which means that we need",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1010.236,
    "end": 1020.932,
    "text": " to bring another component to the table for the agent to update its model, and that is distinguishing between a prior and a posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1021.913,
    "end": 1032.769,
    "text": "The prior is the previous state of knowledge of the agent, what it believed was true for the transition function before updating its model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1034.171,
    "end": 1040.04,
    "text": "And the posterior is a distribution function that is part of a variational family,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1040.358,
    "end": 1043.802,
    "text": " and that can be parameterized with here a parameter phi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1044.663,
    "end": 1056.037,
    "text": "And this phi will then be tuned such that we land on a distribution here that enables the agent to make better predictions in the future using its current observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1056.898,
    "end": 1066.99,
    "text": "And the way this parameter is tuned is by minimizing a quantity called the variation of free energy that then gives its name to the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1068.758,
    "end": 1078.031,
    "text": " The free energy, or variation of energy to be precise, has the following form, where I want to first look at the second term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1079.593,
    "end": 1095.475,
    "text": "This term here is called the surprise, and that's the surprise of the agent getting observation as the environment here, given it was currently in the belief state PT.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1095.927,
    "end": 1111.207,
    "text": " and we are averaging this over the variational, over the posterior, such that this term becomes minimal when the current belief state is able to predict the current observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1113.51,
    "end": 1124.584,
    "text": "This also means that the best way to minimize this term is to forget everything we knew in the past and to only update the variational",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1125.307,
    "end": 1131.656,
    "text": " distribution here, such that it ticks only at the belief state that is able to predict this observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1132.417,
    "end": 1143.593,
    "text": "And to prevent that, we add an inertia term to the variation of free energy that is zero only when those two distributions remain the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1143.633,
    "end": 1149.401,
    "text": "And that is that having a new observation does not do anything to the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1149.922,
    "end": 1150.943,
    "text": "So this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1150.923,
    "end": 1165.152,
    "text": " motivates the agent to remember its previous model and to make a sort of compromise between updating its model and generalizing also to its past observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1169.671,
    "end": 1191.223,
    "text": " okay so in this whole scheme so far the actions were externally given i didn't say anything about how the actions are actually um chosen in this whole model and how they impact the ability of the agent to predict its observations and to um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1192.486,
    "end": 1200.646,
    "text": " include actions in this framework, Active Inference gives us a recipe to plan for actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1201.748,
    "end": 1210.309,
    "text": "Namely, the agent will try to choose actions that are expected to minimize the surprise about future observations in the long run.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1211.926,
    "end": 1225.006,
    "text": " To do that, the agent is endowed with a form of intrinsic motivation that guides it towards states of the environment that are beneficial for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1226.709,
    "end": 1235.122,
    "text": "For example, that are helpful in persisting in an environment or in doing homeostasis, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1236.364,
    "end": 1239.469,
    "text": "The way this is modeled in this whole framework is by",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1239.803,
    "end": 1244.093,
    "text": " giving another distribution to the agent that we call the preference distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1245.176,
    "end": 1250.91,
    "text": "That is a probability distribution over the future belief states and the future observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1251.869,
    "end": 1264.138,
    "text": " And as for a perceptual inference, now the optimal actions will be those that minimize a quantity derived from the free energy, which is the expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1264.399,
    "end": 1269.912,
    "text": "So a sort of estimation of the surprise about future observations in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1272.322,
    "end": 1288.062,
    "text": " The form that this takes is often qualified as a trade-off between an exploration and exploitation, where this first term, just let me remind you that we are trying to minimize this expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1288.783,
    "end": 1292.048,
    "text": "So here we are trying to make this term as negative as possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1293.249,
    "end": 1300.759,
    "text": "And what this is, is the entropy of the belief states given the current world model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1301.6,
    "end": 1317.105,
    "text": " So the agent will select an action that leads to the most uncertain transition in the world model, such that this uncertainty is resolved by taking the action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1317.526,
    "end": 1319.128,
    "text": "So this is an exploration term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1320.35,
    "end": 1324.457,
    "text": "It fosters discovery in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1324.978,
    "end": 1327.101,
    "text": "It wants to resolve uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1327.773,
    "end": 1335.241,
    "text": " Whereas the second term is derived from the surprise calculated from the preference distribution that I introduced earlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1335.261,
    "end": 1344.651,
    "text": "And it is a utility term because this term becomes minimal when the surprise over the preference distribution is minimal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1344.691,
    "end": 1351.998,
    "text": "That is when the chances that we do not fulfill our preferences are as low as possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1353.42,
    "end": 1356.463,
    "text": "And now from this expected free energy,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1356.798,
    "end": 1360.503,
    "text": " There are multiple ways that one can choose and plan for actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1360.784,
    "end": 1367.093,
    "text": "A very popular one is to do a tree search or using Monte Carlo methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1367.894,
    "end": 1377.388,
    "text": "And the method we want to use here is to define a policy from this expected free energy by feeding it into a softmax function, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1378.212,
    "end": 1391.165,
    "text": " And having a scaling parameter in front of it that could be negative, such that we ensure that actions with the lowest expected free energy are more probable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1393.847,
    "end": 1394.188,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1395.409,
    "end": 1399.633,
    "text": "So this is the end for the little summary for active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1399.673,
    "end": 1406.7,
    "text": "And now I want to move on to the model we are proposing, the free energy projective simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1408.418,
    "end": 1432.401,
    "text": " Some key features of our model is that inheriting from active inference, the agent is endowed with internal motivations and also internal rewards in the form of prediction accuracy that we model using a concept we call confidence, which will become clear shortly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1432.853,
    "end": 1441.264,
    "text": " It's also, it counts among the implementations of model-based reinforcement learning using projective simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1442.685,
    "end": 1454.44,
    "text": "And it becomes a hybrid model between a form of associative learning between different percepts conditioned on actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1454.825,
    "end": 1461.015,
    "text": " that will benefit from the reinforcements and the rewards the agent got from its predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1461.836,
    "end": 1469.989,
    "text": "And the behavior of the agent is completely independent of any reinforcement and is fully determined with active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1471.231,
    "end": 1481.608,
    "text": "And one of the main benefits also of using projective simulation here is that the model the agent learns and the update rule it learns with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1482.112,
    "end": 1487.099,
    "text": " or interpretable as a legacy from projective simulation here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1490.765,
    "end": 1507.229,
    "text": "Okay, so let's start with the architecture of the agent where we are trying to gather all the ingredients necessary for the agent to learn a world model and perform Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1508.251,
    "end": 1511.055,
    "text": "So what we propose here is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1512.52,
    "end": 1526.412,
    "text": " for the belief states to be encoded in the memory of the agent because we want them to be decoupled from the environment just as those belief states in the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1527.421,
    "end": 1557.276,
    "text": " And in order to avoid having to learn the likelihood at the same time as learning the transition function here, we give this memory-specific graph structure inherited from the clone-structured hidden Markov models that have been first proposed in this paper here and successfully implemented in this paper here to build cognitive maps and in another following paper, I think in 2023.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1557.695,
    "end": 1581.542,
    "text": " um for navigation tasks in this one um the way this works is that it postulates that an observation is actually only sort of the tip of the iceberg of um the full random variable the agent would need to be able to understand completely a model completely its environment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1581.742,
    "end": 1606.298,
    "text": " and therefore it gives each observation a clone that, as we train, will acquire more meaning, and it gives this likelihood a deterministic form, such that each clone is linked to a single observation at a time, that is, the probability is either 1 or 0 in this case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1609.045,
    "end": 1624.607,
    "text": " To each observation, we give a fixed number of clones and the edges that are required to deliberate in the memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1624.942,
    "end": 1627.646,
    "text": " will be split into two sets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1629.269,
    "end": 1639.605,
    "text": "One, I mean here two sets or n sets, one for each action that the agent can choose, such that we can learn this prior and posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1640.687,
    "end": 1651.303,
    "text": "In particular here, the parameters that we can update are the weights associated to each edge in this ECM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1653.123,
    "end": 1660.572,
    "text": " Now, we call cloneClip any clip in the ECM, and we are going to call the belief state an excited cloneClip.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1660.733,
    "end": 1667.942,
    "text": "That is where the agent is currently sitting in its deliberation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1668.943,
    "end": 1680.598,
    "text": "Once the agent has excited a cloneClip in its ECM, this will define the belief state the agent has to deliberate over in order to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1680.713,
    "end": 1695.516,
    "text": " uh sample its action and what we do here is um each belief state is connected to all the actions and each edge is weighted with the corresponding expected free energy and then these um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1696.643,
    "end": 1712.584,
    "text": " These expected free energies will define a probability distribution that the agent was sampled from in order to determine which action to implement in the environment and to make predictions using its memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1713.766,
    "end": 1722.077,
    "text": "And the prediction will be the observation that is linked to the current belief state the agent believes it is in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1725.82,
    "end": 1735.03,
    "text": " Now I want to introduce the concept of confidence in this model that is crucial in order to update the one model of the agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1735.971,
    "end": 1751.167,
    "text": "We call confidence the... We use confidence to track the number of correct predictions sampling an edge enabled in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1751.608,
    "end": 1754.511,
    "text": "That is, if I sample this edge to start with,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1755.25,
    "end": 1765.612,
    "text": " At the end of a trajectory, it would count how many correct predictions it enabled in a trajectory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1766.214,
    "end": 1775.554,
    "text": "And what I call here a trajectory is a sequence of consecutive correct predictions for the observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1776.361,
    "end": 1788.818,
    "text": " Now I want to move on in the next slide to show you how it works exactly going step by step in an interaction loop with the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1796.78,
    "end": 1807.496,
    "text": " So the environment starts in a certain hidden state and emits an observation that the agent is able to receive through its sensors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1809.299,
    "end": 1823.04,
    "text": "Then following this, one of the clones corresponding to that observation will be excited in the ECM, here Bt-4, and the agent will sample an action from this state",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1823.375,
    "end": 1833.257,
    "text": " here A2 and predict the next belief state it believes will be useful in order to make a prediction about its observation in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1833.298,
    "end": 1838.329,
    "text": "Its prediction is then S2 because that's the observation that is linked to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1840.182,
    "end": 1851.774,
    "text": " Simultaneously, this action is implemented into the environment and a transition occurs in the environment that then emits a new observation that is again received from the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1851.954,
    "end": 1869.852,
    "text": "And in this case, it confirms the prediction made by the environment and therefore the confidence of the edge that was just traversed is set to one because it enabled a single prediction in the future for now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1870.068,
    "end": 1883.281,
    "text": " Now, every time the agent samples a new action and implements it into the environment, the observations are compared with the predictions until the agent makes a false, a wrong prediction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1884.502,
    "end": 1890.027,
    "text": "So here the agent predicted S2 instead of S4, and that's where the trajectory ends.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1891.048,
    "end": 1896.413,
    "text": "And the network, the weights in the ECM,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1897.642,
    "end": 1903.737,
    "text": " will be updated following the ps update rule so here you will recall",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1904.172,
    "end": 1915.991,
    "text": " Remember the standard update rule where we decrease what we believed before, going back to the initial state of the distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1917.052,
    "end": 1923.503,
    "text": "And here the reinforcement happens proportionally to the confidence of an edge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1923.523,
    "end": 1932.036,
    "text": "That is, this edge will receive three times the reward scale because it enabled three correct predictions in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1936.403,
    "end": 1946.673,
    "text": " Now, I want to explain how we define the policy and how we define the preferences especially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1948.094,
    "end": 1949.335,
    "text": "We have two propositions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1950.456,
    "end": 1965.55,
    "text": "The first one is trying to understand what happens if we give the agent the objective of actually trying to minimize its prediction error directly embedded in its preference distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1966.373,
    "end": 1977.043,
    "text": " So to do this, we modeled the preference distribution to be the marginal of the world model here over its actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1978.725,
    "end": 1995.621,
    "text": "And after a little bit fitting this into the expected free energy and a little bit of reorganization of the terms, what one finds is that the expected free energy borrows down to be the information gain about the next belief state,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1996.681,
    "end": 1999.485,
    "text": " from taking action A in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2000.707,
    "end": 2009.099,
    "text": "Now, you will recognize very quickly that this is problematic because we are trying to minimize the information about the next belief state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2009.119,
    "end": 2014.487,
    "text": "And this is a well-known problem, which is called the darkroom problem, where the agent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2015.429,
    "end": 2042.736,
    "text": " post it in a in a dark room and without any incentive to go outside of it that is a preference for a state that is not in the dark room would stay there because it's fully predictable however there is an easy way out using our model where instead of minimizing here the information gain what we can do is maximizing it by simply",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2043.02,
    "end": 2045.585,
    "text": " making the scaling parameter here positive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2046.927,
    "end": 2052.497,
    "text": "And we will call an agent that uses this preference distribution a wandering agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2053.559,
    "end": 2060.732,
    "text": "And then the magnitude of the zeta will tell how greedy an agent is for information gain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2061.393,
    "end": 2062.615,
    "text": "It will",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2063.0,
    "end": 2077.239,
    "text": " A bit like in epsilon greedy algorithms, it will define with which probability the action is actually targeting regions of information gain or of uncertainty to improve the work model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2079.662,
    "end": 2090.577,
    "text": "The second option is more directed towards encouraging the agent towards completing a task in that environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2095.872,
    "end": 2115.133,
    "text": " And to do this, we first took a modeling assumption that if we are to give a task that is externally given to the agent, it can only be modeled at the interface between the agent and the environment that is on its observations or its actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2116.155,
    "end": 2119.298,
    "text": "And here we decided to embed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2119.7,
    "end": 2128.412,
    "text": " the targets in the environment into the observations only and to call this part of the preference distribution the absolute preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2130.014,
    "end": 2148.458,
    "text": "And the task of the agent then is to be able to use its world model to propagate these preferences onto the belief state such that any state that can be useful in reaching the target in the observations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2148.877,
    "end": 2151.321,
    "text": " get a higher preference overall.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2152.943,
    "end": 2155.327,
    "text": "To do this, we define two quantities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2156.229,
    "end": 2164.742,
    "text": "First, we ask how useful is a belief state in order how easy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2166.325,
    "end": 2171.032,
    "text": " is it from the current belief state to reach the next belief state?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2171.052,
    "end": 2176.179,
    "text": "So sort of cost of reaching an action from the current belief state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2176.86,
    "end": 2187.495,
    "text": "And the second quantity that is useful is how valuable is the current belief state to achieve the task in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2189.117,
    "end": 2194.965,
    "text": "Looking at the first quantity, we define the reachability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2196.346,
    "end": 2202.875,
    "text": " as the transition function marginalized over action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2203.656,
    "end": 2206.439,
    "text": "So for example, imagine you are in this state B2 here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2206.499,
    "end": 2219.276,
    "text": "Here you have two actions going to B2 for the darker observation compared to one with the same probability for those two states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2219.436,
    "end": 2225.965,
    "text": "So the reachability of state B2 dark orange will be higher than B3 dark orange, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2229.472,
    "end": 2243.194,
    "text": " A second quantity is the value of a belief state, which is connected to the value of the preference over the observation it is connected to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2244.17,
    "end": 2255.127,
    "text": " We initialize the value with exactly that, actually, the absolute preference of the state it is connected to because we are using this clone structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2255.848,
    "end": 2270.11,
    "text": "So this means that if S4 is our target, then the preference for those three states, the value for those three states will be the highest, and for all the other states, it will be the lowest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2270.242,
    "end": 2284.926,
    "text": " Now what we want is to propagate this preference to the other states in the ECM by using an iterative algorithm over a number of steps that will define a prediction horizon for our agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2285.227,
    "end": 2314.896,
    "text": " And either the belief state keeps the same value as before, so those states will never have their value decreasing as the algorithm progresses, or the belief states inherit from the value of the belief states they can transition to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2315.163,
    "end": 2319.057,
    "text": " as defined with this term here with the reachability and the value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2319.599,
    "end": 2326.303,
    "text": "So, for example, those two states here being able to transition to these here will inherit their value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2327.667,
    "end": 2346.008,
    "text": " And now to define the look-ahead preference distribution, we combine those two quantities, define children of a belief state as the states that can be reached from the current belief states, and combine this to define this look-ahead preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2346.929,
    "end": 2357.1,
    "text": "And from there, we are going to fit this into the expected free energy and define a new policy that hopefully guides the agent towards the target in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2358.548,
    "end": 2364.017,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2364.037,
    "end": 2367.462,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2367.482,
    "end": 2374.093,
    "text": "So far, we have tackled only two problems that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2374.681,
    "end": 2378.806,
    "text": " could get in the way of an agent performing a task optimally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2378.926,
    "end": 2386.594,
    "text": "We have solved the first problem of trying to learn the best world model possible to make good predictions about observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2387.375,
    "end": 2393.001,
    "text": "The second one is being able to plan actions efficiently for the future using the world model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2393.682,
    "end": 2400.79,
    "text": "And another problem that arises when we use FEPS is the estimation of belief states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2401.09,
    "end": 2418.07,
    "text": " and for this we propose to estimate them in superposition what this means is that every time at the beginning of an interaction with the environment the agent will receive an observation but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2418.472,
    "end": 2434.776,
    "text": " won't be able to distinguish between the clones to start with, so it will build a hypothesis that contains all three clones here, and connected to that observation, and each of those clones will be a candidate belief state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2436.038,
    "end": 2448.633,
    "text": " From there, the agent will use a rule to select its actions, stimulate its transition for each of the candidate belief states, and propose a candidate future belief state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2449.834,
    "end": 2457.984,
    "text": "And while the action is implemented in the environment, the agent will receive an observation from the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2458.645,
    "end": 2465.353,
    "text": "And from there, the hypothesis will be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2466.785,
    "end": 2478.776,
    "text": " reduced by eliminating any belief state that is not compatible with the observation the agent received from the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2480.177,
    "end": 2496.792,
    "text": "And continuing this cycle of hypothesis predictions and confirmation from the environment, the agent will slowly reduce the size of its hypothesis to a single belief state that the agent is not certain it is in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2498.83,
    "end": 2502.513,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2502.533,
    "end": 2513.143,
    "text": "This then solves the three main obstacles we solve for an agent to perform optimally in an environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2513.283,
    "end": 2525.715,
    "text": "And now I want to show you how this actually works in practice and in the code in some environment that we use for demonstration purposes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2526.269,
    "end": 2534.823,
    "text": " The task we tried to simulate was a navigation task in a partially observable grid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2539.551,
    "end": 2544.058,
    "text": "This grid, imagine, has food in its upper right corner that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2544.342,
    "end": 2548.247,
    "text": " let's say, has some smell that propagates through the grid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2549.008,
    "end": 2561.543,
    "text": "So the closer the agent is to the food and the more intense the smell is on a scale from zero to three, the task of the agent would be to then reach the food in there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2562.264,
    "end": 2567.43,
    "text": "But compared to other application, for example, GridWorld,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2568.068,
    "end": 2578.805,
    "text": " the agent only has access to the smell intensity to orient itself in the grid and determine its behavior and never has access to the coordinates in the grid, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2580.467,
    "end": 2590.363,
    "text": "And what I want to show you first is that even though the agent does not see the coordinates, it's able to learn only from",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2591.002,
    "end": 2601.298,
    "text": " its percepts and it's what I call embodied experience that is receiving percepts from the environment and using its actions to predict",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2603.084,
    "end": 2609.578,
    "text": " What I show here is a figure of merits for the status of learning for the agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2610.199,
    "end": 2622.645,
    "text": "And I compared the two types of preference distribution that I introduced earlier, the task-oriented agent first with the look-ahead preferences and the wandering agent here in reddish colors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2624.836,
    "end": 2636.934,
    "text": " And we see that it seems that at the end of the training, given a fixed number of episodes, it seems that those two models converge to the same length for their trajectories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2637.054,
    "end": 2646.928,
    "text": "That is just to remind you the number of consecutive transitions that led to correct predictions in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2647.752,
    "end": 2663.534,
    "text": " It seems that at the end of the training, the optimal agents with either preference distribution perform the same, with a slight advantage, it seems, for task-oriented agents that seem to converge faster towards this optimal status.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2664.855,
    "end": 2672.646,
    "text": "And here, there are two maybe interesting features too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2673.014,
    "end": 2680.706,
    "text": " We set the scaling parameter to a value that is too positive, that is, we make the agent very greedy for information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2682.288,
    "end": 2698.633,
    "text": "The agent does not learn as optimally as the other agent, and in fact, it learns worse than an agent that would just be given a uniform policy, so would act completely at random.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2699.93,
    "end": 2719.553,
    "text": " And this happens, my explanation for it is that the agent then trying to seek transitions that are the most uncertain will never revisit the same, and therefore this won't be enough in our scheme to reinforce the edges such that they are no longer uncertain and that they actually stick.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2720.694,
    "end": 2729.785,
    "text": "So it would be a subtle balance between forgetting and reinforcing that is difficult to implement when the agent becomes too greedy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2729.765,
    "end": 2756.515,
    "text": " and the second scenario is here one that we already know when we set the scaling parameter to plus three uh for a task oriented agent we are now maximizing the expected energy and as we would have expected the agent stays um does not learn well in these cases because it doesn't target uncertainty and it's not even trying to fulfill preferences in the environment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2758.047,
    "end": 2768.918,
    "text": " Now, a second point I want to make is insisting on this look as if in the claim we made for the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2770.739,
    "end": 2783.532,
    "text": "What we have trained the agent on was only using the confidence to reinforce edges and never did we do anything with the variation of free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2783.917,
    "end": 2795.609,
    "text": " However, it seems that if we track the variation of free energy, it is actually a good figure of merit to describe the agent and its learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2795.729,
    "end": 2803.097,
    "text": "And as you see here, these are average agents and their variation of free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2803.197,
    "end": 2809.924,
    "text": "And you see that as before, wandering agent and task-oriented agent converge to a very small value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2810.242,
    "end": 2814.909,
    "text": " at the end of the training that the tasks for the agent go a bit faster.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2816.151,
    "end": 2836.62,
    "text": "And here, an interesting feature, if you look at the individual trajectories here of the agents, you will see little steps in the learning curves, which if you actually open the black box and look at what happens at these different stages of learning for the agents, it's actually corresponding to the agent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2836.921,
    "end": 2853.679,
    "text": " adopting conventions in its clones to properly contextualize its clone clips in the grid here to describe its observations and its geographical location in the grid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2853.699,
    "end": 2865.932,
    "text": "The third claim I want to make is trying to understand this difference between these task-oriented agents and the wandering agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2866.081,
    "end": 2892.004,
    "text": " Even though it seems that when the agent is able to choose its actions by minimizing the expected free energy, that the task-oriented agents learn better than the wandering agents, it seems that when we compare their performance and set their policy to a uniform one, that is, the agent no longer are able to seek transitions of maximum certainty,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2892.355,
    "end": 2908.272,
    "text": " It seems that wandering agent equipped with a bear estimated estimation mechanism are able to perform in general, a bit better or more uniformly better than the task oriented agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2909.332,
    "end": 2928.505,
    "text": " and that if we use this belief state estimation in superposition with the candidate belief states in a hypothesis that we are progressively eliminating, that for both types of training, this will double the length of the trajectories for the agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2928.525,
    "end": 2932.572,
    "text": "So it seems to be rather efficient, at least in this environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2934.543,
    "end": 2948.905,
    "text": " Now, I want to emphasize this slide here, which relates to the interpretability of the model the agent is learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2949.627,
    "end": 2961.445,
    "text": "And what you see here is a trained model for an agent that we train in the grid here, and the transition functions for all the actions the agent can perform in the grid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2961.779,
    "end": 2984.766,
    "text": " And if you look closely and try to understand how those transitions happen, you realize that actually each of the clones in the one model that was initially only associated, the only information they had initially was the smell intensity that the agent could perceive in the grid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2985.269,
    "end": 2996.341,
    "text": " you find that those took on some contextual meaning on top of it that differentiates them and that maps them to a unique location on the grid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2996.542,
    "end": 3001.767,
    "text": "That is, in the end, they are able to represent a geographical location.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3005.291,
    "end": 3008.255,
    "text": "So in this sense, it's fully interpretable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3008.775,
    "end": 3011.158,
    "text": "The final model is fully interpretable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3013.282,
    "end": 3026.293,
    "text": " And one final claim here is that the policy that the agent learns as a result of this look ahead preferences that I described earlier is optimal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3026.954,
    "end": 3043.288,
    "text": "And what you can see here is we've trained the agent to either reach the target here, that is reach the food, or escape the food here by reaching the lower left corner instead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3043.268,
    "end": 3047.661,
    "text": " And so this has happened without intermediate training.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3047.681,
    "end": 3051.211,
    "text": "We just changed the absolute preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3051.231,
    "end": 3053.818,
    "text": "So this is a very flexible behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3053.917,
    "end": 3061.089,
    "text": " And we've compared the trained agent to a random agent, and we see that it's very clear, nearly optimal behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3061.49,
    "end": 3076.515,
    "text": "And the restrictions on this optimality is not due to the policy itself that is optimal, but rather to the belief state estimation mechanism that we are using.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3076.495,
    "end": 3090.736,
    "text": " that would require one additional step to be able to fully identify the single really steady agent is, and therefore the agent takes this additional action to understand where it is in the grid exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3091.737,
    "end": 3096.664,
    "text": "So that's the slight overhead you might find in these plots.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3096.684,
    "end": 3099.368,
    "text": "But otherwise, fully flexible and optimal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3099.668,
    "end": 3104.916,
    "text": "And we expect that in a larger environment with a similar structure, we would become optimal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3106.533,
    "end": 3136.118,
    "text": " Okay, and this brings me to the conclusion for this presentation, where we have presented a model for agency that combines projective simulation together with a free energy principle framework, where we have introduced the concept of confidence in order to reinforce edges on the memory that corresponds to associative learning between percepts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3136.553,
    "end": 3150.388,
    "text": " using these reinforcements, and that allows the agent to plan for its actions flexibly and to discover optimal policies using these look-ahead preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3152.25,
    "end": 3162.021,
    "text": "And I want to emphasise again, the agent and its model are interpretable, both because we can trace back the deliberation path",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3162.203,
    "end": 3172.163,
    "text": " of the agent on its memory, and also because at the end product, the world model at the end of the training is interpretable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3172.925,
    "end": 3179.959,
    "text": "We can map it onto hidden states of the environment so far, the way we would understand the grid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3180.496,
    "end": 3193.915,
    "text": " And I think a nice follow-up work or nice connections we see with other fields is that this model comes with aspects that are plausible from a cognitive science perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3194.516,
    "end": 3207.094,
    "text": "Namely, well, active inference has been already connected in order to endorse predictive coding and the Bayesian brain hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3207.445,
    "end": 3222.119,
    "text": " The clone-structured hidden Markov models have been proposed as a way to model cognitive maps to determine behaviors in memory, and in particular here, especially for navigation tasks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3222.36,
    "end": 3225.808,
    "text": "It has been proposed that the clone clips",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3226.345,
    "end": 3230.851,
    "text": " can play a similar role as the play cells in the hippocampus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3231.752,
    "end": 3254.58,
    "text": "And also the look-ahead preference scheme that we propose here is reminiscent of successor representation that a few years ago was also associated with the role of dopamine in kind of, how should I say, combining model-free",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3254.847,
    "end": 3266.019,
    "text": " reasoning with model based behavior such that the an agent or a biological agent can have optimal behavior and flexible behavior in a changing environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3268.061,
    "end": 3268.281,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3268.522,
    "end": 3271.445,
    "text": "And with this, I thank you for your attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3271.505,
    "end": 3273.006,
    "text": "And again, for having us here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3273.527,
    "end": 3276.09,
    "text": "And feel free to ask any question that comes to mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3278.652,
    "end": 3278.973,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3279.453,
    "end": 3279.874,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3282.677,
    "end": 3283.858,
    "text": "Would any of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3284.243,
    "end": 3311.803,
    "text": " authors like to just give any reflection or or share a little bit about the paper while people in the chat are writing questions or i can read some questions from the live chat okay first um is the code available",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3313.319,
    "end": 3316.343,
    "text": " Not yet, but it will be available soon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3317.244,
    "end": 3318.466,
    "text": "Yes, I'm working on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3319.367,
    "end": 3319.628,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3320.409,
    "end": 3324.134,
    "text": "From Leo Delion wrote, great work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3324.354,
    "end": 3328.099,
    "text": "Would it be possible to make this using continuous inputs and outputs?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3329.561,
    "end": 3331.364,
    "text": "We are also working on it, actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3332.485,
    "end": 3335.449,
    "text": "So hopefully, yes, it might be a bit harder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3336.331,
    "end": 3339.275,
    "text": "But hopefully, yes, in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3340.637,
    "end": 3341.638,
    "text": "Which would be harder?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3344.116,
    "end": 3348.981,
    "text": " It takes a little change of perspective on how we train the weight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3349.262,
    "end": 3352.505,
    "text": "And we're currently trained to model exactly that actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3352.966,
    "end": 3355.308,
    "text": "So yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3355.328,
    "end": 3355.649,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3358.712,
    "end": 3367.542,
    "text": "Okay, reconfigurability trainer wrote, How would task orientation limit outcome expectations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3369.563,
    "end": 3388.635,
    "text": " maybe a little bit more more generally there how do how do you configure task this is a navigation task but but how would for other kinds of tasks cognitive task performance how would you bring that into the structure of the model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3390.303,
    "end": 3404.381,
    "text": " Okay, so at the moment, one of the limitations that we have with the way we modeled everything is that we can only encode the task as an observation, a target observation in an environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3405.162,
    "end": 3412.711,
    "text": "So it doesn't have to be, imagine the agent is able to perceive, I am hungry, I am full.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3413.372,
    "end": 3415.214,
    "text": "It could also be observation, I am full.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3415.234,
    "end": 3419.82,
    "text": "So it's not necessarily bound to a navigation task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3420.307,
    "end": 3425.093,
    "text": " go to any, it can transfer to many other types of tasks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3425.854,
    "end": 3441.252,
    "text": "Now, for sure, there is a limitation and it was already visible in the grid world that I couldn't tell the agent go to the lower left corner directly, I could only reach one of the three cells that had observation zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3441.974,
    "end": 3457.84,
    "text": " And what I have in mind or what could be possible is to give the agent a few rounds of interaction with the environment and combine this look-ahead reference theme with some reinforcement or some rewards that the agent would get from the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3458.613,
    "end": 3475.976,
    "text": " And then this way, the agent could be able to identify which belief state is actually corresponding, which unique belief state is corresponding to the successful state in the environment on top of the observation that corresponds to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3478.8,
    "end": 3479.121,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3479.782,
    "end": 3480.823,
    "text": "Just on the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3481.799,
    "end": 3505.502,
    "text": " projective side, how do you parameterize the topology and the bumping and the splitting of these clones clips, since it seems like having an appropriate granularity and transitions amongst these clips is sort of at the heart of how effective the method would be?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3507.504,
    "end": 3507.745,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3508.105,
    "end": 3511.148,
    "text": "So what I'm doing at the moment,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3511.651,
    "end": 3512.934,
    "text": " is helping the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3513.294,
    "end": 3524.838,
    "text": "I'm giving as many clones as necessary to model the hidden states in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3524.858,
    "end": 3531.111,
    "text": "That is, if I have, for example, it's coming, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3531.428,
    "end": 3543.028,
    "text": " Here you see that the maximum number of hidden states that would send the same observation is three, so I give three clones to the model for each observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3544.31,
    "end": 3548.998,
    "text": "The way I initialize the ECM",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3549.164,
    "end": 3554.552,
    "text": " is at the beginning of the training, the ECM is fully connected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3554.952,
    "end": 3562.543,
    "text": "So I'm not saying anything about the structure of the environment in the ECM to start with, except in the number of clones that I'm giving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3563.385,
    "end": 3576.083,
    "text": "And then we have been discussing also techniques that could have the agent have an adaptive way of defining the number of clips.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3576.603,
    "end": 3586.984,
    "text": " for a number of clones for each observation where, for example, if the agent realizes it needs more clones, we could add some and then add a specific rule to connect them to the following one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3587.47,
    "end": 3603.87,
    "text": " And also what is also very nice is if we give too many to start with, and then we are able to reduce to the minimal amount of clones that would be required to represent each observation, we could actually learn something called a minimal representation of the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3603.91,
    "end": 3608.095,
    "text": "And that is something that is very valuable from a theoretical perspective as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3611.804,
    "end": 3613.125,
    "text": " Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3613.145,
    "end": 3636.63,
    "text": "Do those clips directly provide the interpretability or what kinds of statements in a grid world or just more generically, what kinds of interpretability expressions can you derive here that using some other kind of knowledge graph or graphical cognitive model couldn't yield?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3638.433,
    "end": 3643.279,
    "text": " Okay, so I can only talk about the things that I know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3644.02,
    "end": 3656.094,
    "text": "So here, what I want to say is that in general, clips in projective simulation are understood as a part of the experience of the agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3656.695,
    "end": 3666.567,
    "text": "So by construction at the beginning, they have semantics associated to them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3667.357,
    "end": 3677.767,
    "text": " And here, the way we followed this is by saying at the beginning, any clip is something in the environment that emits the same observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3677.807,
    "end": 3681.871,
    "text": "And in that sense, it has some interpretability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3682.511,
    "end": 3693.702,
    "text": "Then this mapping that we can do at the end of the training allows us to map the clones",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3693.968,
    "end": 3723.418,
    "text": " onto actual hidden states in the environment and in that sense because we can kind of open the world model and take it apart and still understand what's happening in that sense it's interpretable and also one way that this model is interpretable and compared to others is that at any time the agent is able to deliberate we can trace the deliberation path that the agent is taking in its memory so we know exactly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3723.398,
    "end": 3746.773,
    "text": " why an agent is taking that decision and not another one and that's also how we reinforce the model so we understand how it went there how it came to learn this model in the first place do any other authors want to add any comments or ideas",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3750.787,
    "end": 3759.501,
    "text": " Maybe I can just add or try to respond to your question in what sense, where is the interpretability?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3760.101,
    "end": 3767.513,
    "text": "I mean, these clips that Josephine was introducing and talking about,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3767.493,
    "end": 3775.504,
    "text": " These are internal representations of actions the agent did and perceptions it had.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3776.005,
    "end": 3786.079,
    "text": "So the semantics derives from the description of its environment, how it can act on an environment, what it can perceive from the environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3786.099,
    "end": 3795.812,
    "text": "This is the basic semantics that it is and it inherits the semantics onto this CLIP network in its ECM.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3796.197,
    "end": 3812.393,
    "text": " And so if what Josephine said, if you want to understand why did you do this action giving this percept, you can trace the sequence of hoppings in these elementary clips, which are stored percepts and actions it has done in the past.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3813.074,
    "end": 3822.843,
    "text": "So there is a basic interpretability there, how it came about to take a certain action, what considerations it went through as it were.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3823.764,
    "end": 3825.546,
    "text": "Now, the clip.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3826.319,
    "end": 3830.969,
    "text": " network can grow and change over time dynamically, then it gets more complicated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3831.09,
    "end": 3836.903,
    "text": "When there are new clips are created, how do you transfer the semantics to them?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3836.923,
    "end": 3843.197,
    "text": "As long as you can trace how the clip creation processes took place, you can connect",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3843.177,
    "end": 3867.548,
    "text": " the semantics of the new clips to the previous clips where it was made from but then it gets more complicated but the statement is that the basic ps comes with a basic structure of interpretability that is inherited from the task environment which is often an md mark of decision process thank you on marius",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3868.827,
    "end": 3871.79,
    "text": " Perhaps to that I might add a few things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3873.652,
    "end": 3881.599,
    "text": "So first of all, I think there's some additional interpretability in the way the updates are actually done.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3882.42,
    "end": 3885.823,
    "text": "For example, this confidence mechanism and the update rule.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3887.084,
    "end": 3895.172,
    "text": "Perhaps the more obvious machine learning approach to take here would be to use the variation of free energy",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3895.557,
    "end": 3910.647,
    "text": " as a loss to do a gradient descent on but this can become quite messy because there are all these different terms competing with each other and it's not really so clear what one actually gets from that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3911.285,
    "end": 3932.871,
    "text": " and we now on the other hand have this update pool that very specifically says that the probabilities are reinforced exactly dependent on the number of white predictions that they enabled during the training and right now we are taking here and",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3934.285,
    "end": 3964.022,
    "text": " like in parts it's a tabular approach one could say and there is some strength on it because in principle one can write down everything as a matrix and really inspect it what's the best transition to take what is the best action to take and what is the best state to predict and you know there are some papers in the variation of free energy literature and active influence literature that directly throw artificial neural networks at everything",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3964.559,
    "end": 3969.707,
    "text": " And as long as one wants performance, it's probably the best thing to do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3970.168,
    "end": 3973.914,
    "text": "But of course, they come with all the interpretability disadvantages.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3974.435,
    "end": 3987.597,
    "text": "So currently, we are looking on purpose on environments and agents that are complex enough to be interesting and difficult, but small enough to enable a manual inspection.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3987.965,
    "end": 3993.673,
    "text": " In the context of this project, the idea is really to see how does the agent evolve?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3993.733,
    "end": 3994.574,
    "text": "How does it learn?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3994.914,
    "end": 4002.644,
    "text": "How do all our principles that we have, variation of the energy and PS, actually manifest itself?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4002.745,
    "end": 4004.347,
    "text": "What do they do in the agent?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4005.708,
    "end": 4015.221,
    "text": "And for the clone state, something that one... I think there are some important intuitions that one can give on those.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4015.91,
    "end": 4036.686,
    "text": " um one can for example see the clone index as providing a context but one can also think of it as dividing the decrease of freedom into the observable ones these go into the actual observation and the unobservable ones which go into the clone index",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4039.636,
    "end": 4058.622,
    "text": " Yes, so like here, we actually see in this figure here how the clone indices of the agent directly relate to the actual true world model or the true states of the environment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4059.102,
    "end": 4064.209,
    "text": "So we can literally say, OK, this clone state is this environment state.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4064.189,
    "end": 4065.311,
    "text": " And so on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4066.373,
    "end": 4074.969,
    "text": "And we can directly investigate how the world model of the agent actually relates to the true environment model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4075.349,
    "end": 4085.488,
    "text": "And if you just used some artificial neural network, you could not really draw a map like this or a graph like this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4088.152,
    "end": 4105.418,
    "text": " um if you don't mind i would also have some additional comments on questions that were raised earlier yeah go for it um so there was the question about the applicability to um to continuous domains",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4106.765,
    "end": 4123.844,
    "text": " And one thing that's typically done in neural symbolic AI approaches, for example, is to only use the tabular methods essentially as one part of the workflow.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4125.626,
    "end": 4135.337,
    "text": "For example, something that one sees quite commonly in the neural symbolic AI literature is that one has artificial neural networks that act as feature extractors.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4135.79,
    "end": 4162.489,
    "text": " and then the most symbolic methods get applied to the outputs of those feature extractors which is something that could be also applied here but as josephine already mentioned we are working on a generalization to the continuous domain that's much more faithful to the methods that were presented here so",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4163.785,
    "end": 4172.461,
    "text": " Yeah, so I just want to emphasize that it is possible to generalize this to the continuous domain and we are actively working on it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4172.821,
    "end": 4178.271,
    "text": "And we have a very specific vision in how we want to make it happen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4182.9,
    "end": 4185.945,
    "text": "So just to clarify this image here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4186.499,
    "end": 4214.38,
    "text": " the location of the grid like the number of each cell or the x or y location is not being revealed to the agent but they are being able to perceive this ranked score like pheromone intensity or like temperature or something like that and they're learning through their embodied activity the transitions amongst that categorical variable",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4215.76,
    "end": 4226.672,
    "text": " And it's sort of recapitulating the actual spatial distribution, even though they aren't coming to an explicit spatial reconstruction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4228.254,
    "end": 4228.674,
    "text": "Exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4228.754,
    "end": 4228.975,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4229.475,
    "end": 4229.555,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4229.575,
    "end": 4230.637,
    "text": "That's a good summary of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4232.899,
    "end": 4233.159,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4233.179,
    "end": 4241.649,
    "text": "And so then in the fullest case, there could be a clip memorizing every single location.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4241.709,
    "end": 4245.413,
    "text": "And then in the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4246.473,
    "end": 4268.65,
    "text": " and then a minimal representation would start to cluster coarse grain repetitive transitions between like maybe if there was a vertical border some of those could be coarse grains or just sort of simplified because the same action would result in the same change",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4270.216,
    "end": 4273.042,
    "text": " Yes, that's quite correct, actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4273.062,
    "end": 4281.639,
    "text": "If you look at some observations, actually only have two hidden states, so we would only need two clones to represent those.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4282.16,
    "end": 4288.613,
    "text": "And what happens is that since each clone is relating exactly to a single location in the grid,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4289.2,
    "end": 4299.353,
    "text": " Um, the two clones are representing exactly the same location and we could design a rule such that those two clones collapse and here those three clones collapse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4299.773,
    "end": 4314.051,
    "text": "And then we would have exactly, uh, the minimum number of clones we would have in the, in the ECM would correspond exactly to the number of hidden states we need to model in the environment to be able to predict observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4317.355,
    "end": 4317.435,
    "text": "Hmm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4318.141,
    "end": 4320.964,
    "text": " Okay, I'll read another question from the live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4320.984,
    "end": 4329.735,
    "text": "And then if any other authors have thoughts or anything, okay, Leo wrote, how long did it take for it to train to solve the grid task?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4330.155,
    "end": 4334.18,
    "text": "And how scalable is this network with the amount of beliefs and actions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4339.286,
    "end": 4344.672,
    "text": "I think it took a few hours for the navigation tasks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4345.36,
    "end": 4348.223,
    "text": " maybe at the order of four hours, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4350.284,
    "end": 4364.277,
    "text": "So it's a trade-off at the moment between typically interpretability, being able to understand everything that's happening in the model, and the scale of the models we are tackling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4365.998,
    "end": 4369.802,
    "text": "So this is work in progress at the moment, being able to scale up this approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4370.322,
    "end": 4374.726,
    "text": "Maybe we can consider that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4375.583,
    "end": 4384.352,
    "text": " As Marius was saying, this feature extractor could be helpful in scaling up to larger environments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4384.592,
    "end": 4389.657,
    "text": "This idea of adaptive number of clones is also interesting for this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4391.74,
    "end": 4396.985,
    "text": "And yes, maybe using a hierarchical scheme could also be useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4397.025,
    "end": 4402.03,
    "text": "We don't know yet, but this is something that we are actually thinking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4402.229,
    "end": 4405.712,
    "text": " that we would like to try to handle, but we don't have a solution for it yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4408.415,
    "end": 4417.124,
    "text": "What kinds of settings have these graphs, absent the free energy principle angle, been applied towards?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4418.245,
    "end": 4428.895,
    "text": "And would those be the kinds of settings that then you'd adapt this method towards or do you see this as tackling a different set of functions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4430.495,
    "end": 4434.842,
    "text": " When you say this kind of graphs, do you mean the clone-structured graphs?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4435.003,
    "end": 4435.443,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4436.585,
    "end": 4436.866,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4437.507,
    "end": 4441.534,
    "text": "So to my knowledge, this has been applied to navigation tasks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4443.417,
    "end": 4444.94,
    "text": "There was another paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4446.082,
    "end": 4448.105,
    "text": "I don't remember exactly what kind of tasks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4448.165,
    "end": 4455.017,
    "text": "That was the more recent paper where they learned schemes using this clone-structured graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4455.588,
    "end": 4466.026,
    "text": " I don't remember which kind of tasks they used it on, but I do expect that they transfer to most of the tasks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4466.927,
    "end": 4476.985,
    "text": "What is interesting is to have some ambiguity in the environment, some partially observable environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4477.666,
    "end": 4479.469,
    "text": "I think that's where they're interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4480.782,
    "end": 4484.808,
    "text": " Yeah, I am not fully certain about the answer probably to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4485.009,
    "end": 4492.32,
    "text": "Maybe a degree of macrobianity also might be necessary since we are only modeling hopping from one step to the next at the moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4493.782,
    "end": 4495.605,
    "text": "This is something to look into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4495.625,
    "end": 4503.297,
    "text": "Yeah, it's an interesting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4503.732,
    "end": 4532.203,
    "text": " challenge with wanting a situation that's simple enough to understand but not totally baked in so that it's obvious and these kinds of almost meta modeling considerations come up all the time like if the agent doesn't understand the efficacy of their actions what are they even doing inference on but if they entirely know the efficacy of actions then it's solve it then it's kind of like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4532.69,
    "end": 4535.035,
    "text": " all loaded up for them to know what to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4535.116,
    "end": 4538.905,
    "text": "And then how many layers or what ways do you pull back?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4538.925,
    "end": 4543.736,
    "text": "Oh, well, it will learn the efficacy of the action, but that might also not be realistic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4544.397,
    "end": 4549.77,
    "text": "And so just figuring out what expressivity of the modeling situation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4550.24,
    "end": 4565.288,
    "text": " Do we even want to set up because setting up what cognitive functions for the agent to perform is kind of like just the compliment of the tasks that it was not set up to perform and sometimes that can be a bigger components.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4566.891,
    "end": 4573.564,
    "text": "So i'm just curious, I guess, as we sort of come to the end like your broader lab and group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4574.253,
    "end": 4580.519,
    "text": " What kinds of questions and applications are you seeking to bring these methods towards?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4581.801,
    "end": 4586.906,
    "text": "And how do you see this work on the path of your broader directions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4591.431,
    "end": 4603.703,
    "text": "Okay, so for myself, there are two directions that I'm currently interested in and I'm still at the beginning of my career, I would say, so it's up to evolutions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4604.543,
    "end": 4627.362,
    "text": " I am interested in the ability of those models to coincide with actual cognitive processes that happen in biological agents to be able to model that to maybe provide a tool that can help us understand this kind of deliberation and then to see how we can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4628.843,
    "end": 4656.184,
    "text": " bring this understanding onto artificial intelligence models and machine learning models in general this is the first aspect i'm interested in the second one would be um how do we discover or from these very basic experience the agent has with the world how do we discover how does such a an agent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4656.485,
    "end": 4672.364,
    "text": " build abstractions and use them in ways that are efficient in coping with the environment and performing, yeah, fulfilling some preferences in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4672.404,
    "end": 4676.109,
    "text": "I think that's so far the two things I am thinking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4676.129,
    "end": 4685.901,
    "text": "I think that projective simulation has been used on many problems as a reinforcement learning methods",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4686.1,
    "end": 4698.093,
    "text": " You know, it has been benchmarked on those traditional problems for reinforcement learning, the mountain car problem, grid world also, it works very well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4699.174,
    "end": 4709.385,
    "text": "Also on some, yes, I guess modeling is usually the main application.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4709.405,
    "end": 4714.47,
    "text": "Does anybody have other application in mind?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4715.497,
    "end": 4716.838,
    "text": " Yeah, I can jump in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4717.239,
    "end": 4719.34,
    "text": "Oh, Hans, do you want to go ahead?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4719.441,
    "end": 4730.29,
    "text": "I can jump in a little bit because I think one of the things that really interests me and I know some of the other folks in this group is modeling in particular animal behavior and foraging.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4731.331,
    "end": 4743.462,
    "text": "And so one of the big questions that I think of driving some of this work is how animals forage for resources that are sparsely but predictably concentrated in space and time",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4743.762,
    "end": 4747.968,
    "text": " And in particular, when those resources are depletable and dynamic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4748.709,
    "end": 4758.102,
    "text": "And so this poses a problem where one scheme is not sufficient for the animal to come up with forging decisions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4758.602,
    "end": 4762.648,
    "text": "So in this framework, we might see this graph that we have up on the screen as",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4762.865,
    "end": 4766.69,
    "text": " as one scheme that allows an agent to solve a task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4766.75,
    "end": 4778.424,
    "text": "And so this work has helped us think about how the free energy principle can be used to help learn this scheme and a reinforcement learning paradigm through this process of reinforcing derivative pathways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4779.385,
    "end": 4787.235,
    "text": "But then what the projective simulation model can do for us is start to help us think about how an agent can build up different schemes",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4787.57,
    "end": 4789.893,
    "text": " from a set of episodic memories.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4790.674,
    "end": 4812.325,
    "text": "And so I think that this work is kind of serving as a foundation to help us move in that direction of how we can use projective simulation to get to a set of schemes and think about a deliberative pathway that's helping agents build simple schemes of their current world from a more complex and rich set of memories that give them a full scheme of the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4813.487,
    "end": 4815.67,
    "text": "And hopefully this can help us to start modeling",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4815.802,
    "end": 4830.503,
    "text": " some of the complex foraging tasks that animals face that may be kind of the filter system for natural selection that has acted on the evolution of intelligence in humans and in other animals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4835.309,
    "end": 4835.75,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4836.451,
    "end": 4836.912,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4837.312,
    "end": 4842.24,
    "text": "To bring that back to like, what is the task that the agent is set up to solve or not?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4842.781,
    "end": 4859.848,
    "text": "Like in grid world forging examples, often the location is given to the agent and then the agent is doing like this navigation as if it was doing GPS and that is set up as the challenges and trade-offs are derived from that setup.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4859.828,
    "end": 4874.293,
    "text": " Whereas using this projective interpretability heuristic scheme configuration, it could just be the learnt relationships between like shadow and light or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4875.472,
    "end": 4902.745,
    "text": " other kinds of sensory cues that might be pretty coarse grains and so it's not to say that there isn't an x and a y location it's just that when that's what's given to the agent or the the id of each cell number is given to the agent then it's kind of like way going down this road that animal foraging may not even resemble and so this can i think helpfully bring it to a space of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4903.45,
    "end": 4914.945,
    "text": " having the different experiences or clips like the honeybees going on these orienting flights and they go out and they come back before they start to go for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4916.09,
    "end": 4918.152,
    "text": " foraging trips and bring back food.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4918.833,
    "end": 4924.919,
    "text": "And so those kinds of heuristics and then what curriculum would support those transitions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4925.88,
    "end": 4930.786,
    "text": "And then each edge can also be seen as a node connecting to other nodes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4931.706,
    "end": 4933.809,
    "text": "So what should the structure of that graph be?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4933.869,
    "end": 4942.558,
    "text": "And those are some very flexible ways to talk about context switching and all of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4942.578,
    "end": 4943.599,
    "text": "Yeah, I think you're on the nose there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4946.836,
    "end": 4965.672,
    "text": " any other authors want to add any thoughts or what will they work on next year um i mean hans wanted to say something um because um like of course uh so maybe",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4966.006,
    "end": 4988.672,
    "text": " like the answers given so far don't really cover everything that we are doing in the group yet because most of us actually have a background in quantum computation so we are physicists who have mostly worked on quantum computation at some of the points of our careers and",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4989.142,
    "end": 4999.27,
    "text": " I don't know, Hans, do you want to give a comprehensive summary of why we care about explainable AI and world model building, or should I?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5000.11,
    "end": 5003.315,
    "text": " No, maybe I can just say something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5003.375,
    "end": 5020.859,
    "text": "I think Alexander gave a very nice outlook and also embedding of all this paper and this research into the foraging and behavioral biology projects that we are following.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5021.5,
    "end": 5022.642,
    "text": "And I don't want to add",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5022.622,
    "end": 5036.817,
    "text": " much more to it i see the still larger scope of this is that for several years we have now been really trying to understand agency and how to to model agency um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5037.421,
    "end": 5067.428,
    "text": " it really in a in a in a physical in a physical model so a notion of agency that is you know accounts for certain philosophical aspects as you know planning having an intention and and being situated in environment trying to get around being adaptive flexible things like there's a non-computational understanding of agency this is what we want to model and this is another step forward",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5067.408,
    "end": 5078.602,
    "text": " It connects to some branch that we are also following in the group, and this is what Marius hinted at, and that has to do with the modeling of artificial agency.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5079.803,
    "end": 5095.423,
    "text": "To what extent can one understand or even build artifacts that can also learn but act in a meaningful way on an environment, have a certain notion of memory",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5095.842,
    "end": 5100.249,
    "text": " that helps them to build model and understand their environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5100.63,
    "end": 5109.704,
    "text": "And that's of course something in physics and in the ongoing development of AI and its use in science that is quite relevant.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5109.844,
    "end": 5112.248,
    "text": "So what we want to understand is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5112.228,
    "end": 5132.532,
    "text": " or to develop a perspective on ai that one could call artificial agency now in the future we envision there will be devices that can themselves learn and interact with an environment that do you know that perform experiments people are now speaking of self-driving laboratories and stuff like that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5132.512,
    "end": 5137.299,
    "text": " And that is all within a certain paradigm and framework that's being developed at the moment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5137.359,
    "end": 5151.06,
    "text": "But I think what we need to understand is really to which extent can one call these or future artifacts agents to get really a relation to what they do and compared to what we do and how we are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5151.479,
    "end": 5153.382,
    "text": " And that's the broader scope.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5153.523,
    "end": 5167.747,
    "text": "And of course, to understand agency, we should also be able to model biological agency, to have a clear, to put what we would call artificial agency into context to what exists already, that is biological agency.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5168.168,
    "end": 5176.322,
    "text": "These are different directions and dimensions of the research we are following, but that's, I would say, the bigger picture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5180.842,
    "end": 5182.531,
    "text": " Thank you for adding that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5184.562,
    "end": 5188.0,
    "text": "Anyone else want to add any comments?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5194.19,
    "end": 5217.328,
    "text": " last piece just makes me think about observing the animal in the grid world and that's but you don't see inside with the construction of artificial or synthetic agencies then it opens up kinds of interpretability that aren't available like to the bird watcher",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5217.983,
    "end": 5239.992,
    "text": " and so there's some systems that were just watching the bird and then there's other systems where people are talking about designing it and so being able to have a shared understanding and formalisms that connect between those interpretability settings",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5240.258,
    "end": 5265.0,
    "text": " And even though there might be things that are interpretable from the outside, but not from the inside, or at least even just the possibility of those kinds of questions and understanding where they always sometimes never happen is important research on the path towards this sort of more agentic niche that you're pointing towards, Hans.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5269.52,
    "end": 5270.041,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5270.061,
    "end": 5275.531,
    "text": "Well, thank you again for the presentation and keep us posted on the work and good luck.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5280.4,
    "end": 5281.102,
    "text": "Thank you for having us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5281.783,
    "end": 5282.905,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  }
]