[
  {
    "start": 7.435,
    "end": 8.156,
    "text": " Hello, everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8.856,
    "end": 9.877,
    "text": "It's September 29th, 2023.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10.518,
    "end": 15.382,
    "text": "We're here in the Active Inference Institute's quarterly roundtable number three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 15.682,
    "end": 21.247,
    "text": "So this is our third of the quarterly updates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 22.708,
    "end": 23.428,
    "text": "We have guests.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 24.609,
    "end": 31.896,
    "text": "I'm Daniel, one of the officers of the Institute, and... I'm Blue Knight, also another officer of the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 33.357,
    "end": 33.597,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 35.523,
    "end": 41.107,
    "text": " We are a participatory online institute that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 41.427,
    "end": 45.45,
    "text": "You can find us at activeinference.institute or the .org address.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 45.79,
    "end": 49.373,
    "text": "We'll be moving things over more to the .institute address, though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 50.194,
    "end": 54.597,
    "text": "We're inferenceactive on Twitter or X. And here's more information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 55.217,
    "end": 61.342,
    "text": "This is recorded in an archived livestream, so please provide us with feedback so we can improve on all aspects of our work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 62.529,
    "end": 89.73,
    "text": " backgrounds and perspectives are welcome and will follow video etiquette for live streams so today in this quarterly update we will first cover some big developments and updates at the institute and ecosystem scale then go over some educational and research updates from our eduactive and reinference organizational units respectively and then have some fun and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 91.604,
    "end": 99.471,
    "text": " entertaining musings on where we're going for the last months of 2023, where we can all go in 2024.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 100.052,
    "end": 104.476,
    "text": "And if you're watching live, please feel free to add any questions in the live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 104.576,
    "end": 110.602,
    "text": "And then in the last section, we'll be able to scan over that and look at your questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 112.303,
    "end": 117.348,
    "text": "All right, first updates from the Institute at the Organizational Scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 119.372,
    "end": 124.676,
    "text": " one of the big highlights of the last months and really of the year and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 125.925,
    "end": 137.67,
    "text": " of really all of our work together was the accomplishment of this collaborative paper that we released in August of this year, the Active Inference Institute and Active Inference Ecosystem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 138.411,
    "end": 151.537,
    "text": "We had a great team of co-authors and to give a visual abstract and just a teaser for those who might want to learn more about this paper, we went through a great collaborative process to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 153.888,
    "end": 171.668,
    "text": " document and align on various aspects of what had been was and will be happening and on the right side is figure one this is an overview of the Institute's structure itself in engagement with the ecosystem",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 173.482,
    "end": 181.309,
    "text": " on the left side are a representation of our open source products and some of the functions that they provide in the ecosystem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 181.709,
    "end": 186.253,
    "text": "There's a lot more to say, but Blue, what do you want to comment on or what was it like for you?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 189.102,
    "end": 190.103,
    "text": " It was super intense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 190.803,
    "end": 197.608,
    "text": "I think that we applied for a phase two grant, which I think we should talk about maybe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 197.768,
    "end": 205.072,
    "text": "And in doing that phase two POSE grant, this was the preparation that they kind of give you in the phase one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 205.232,
    "end": 210.576,
    "text": "And it really is about becoming like a big business.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 211.255,
    "end": 214.376,
    "text": " or a big corporation or a big organization, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 214.456,
    "end": 223.438,
    "text": "And like what it takes to really get organized and anchor and manage a large community of people, which I think that was really good for us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 223.698,
    "end": 227.119,
    "text": "So like we are already kind of, I don't know how much managing we do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 227.159,
    "end": 233.461,
    "text": "We're a very distributed system, but we do already oversee or engage with a large community of people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 233.801,
    "end": 236.622,
    "text": "And like, what does that look like when, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 237.555,
    "end": 243.999,
    "text": " Maybe we have conflicting factions or things get dropped, like the ball gets dropped in one court or another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 244.119,
    "end": 251.404,
    "text": "So I think that that really kind of brought to light a lot of the things we need to work on and also the things that we're doing a good job at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 252.925,
    "end": 253.185,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 253.225,
    "end": 259.97,
    "text": "Yeah, we'll come to the grant in a few slides, but just to verbally describe the image on the right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 261.707,
    "end": 289.721,
    "text": " we have the circle a golden ring that alludes to the cover of the par pazulo and friston 2022 textbook and that ring symbolizes the active inference ecosystem and also the boundary between the institute as an entity and the ecosystem as niche in the institute itself starting on the top of within the ring we have several official bodies or organs",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 290.902,
    "end": 301.106,
    "text": " We have the Board of Directors, who select officers, as well as Scientific Advisory Board, which is an informal guidance and insight group, which we'll come to later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 301.726,
    "end": 316.832,
    "text": "And the Institute provides Institute-level functionality and support for the two organizational units, which are Eduactive, which is focused on educational outcomes, and ReInference, which is focused on research work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 317.592,
    "end": 318.733,
    "text": "The organizational units",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 319.912,
    "end": 347.983,
    "text": " host through facilitation other processes different projects that are all sorts of within on and out there in the ecosystem and then out in the ecosystem we have all different types of activities and products and organizations and players and if you're listening to this we encourage you to get involved if it's something that you want to learn more about then the paper is a great place to start",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 349.042,
    "end": 360.195,
    "text": " best starting place that we've made so far and the next step is to take the active step and actually get involved anything else to say on this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 361.109,
    "end": 372.277,
    "text": " Just we should probably highlight the fact that our research unit, which hasn't been formally like we've formally renamed our research unit to re-inference, which we haven't announced yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 372.417,
    "end": 379.622,
    "text": "So I think like as we are talking about the re-inference unit, we did that kind of in the construction of this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 379.822,
    "end": 385.046,
    "text": "And because we were we've been edgy, active and research, and we just decided that re-inference was more fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 386.167,
    "end": 400.358,
    "text": " kind of um you know shouting out to active inference the whole thing not just the active part fun yeah so thanks again to all the authors here and also people who contributed their their insights and just didn't want to be co-authors",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 402.062,
    "end": 404.005,
    "text": " All right, carrying on with Institute level updates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 404.806,
    "end": 411.014,
    "text": "On August 22nd of this year, we had a really amazing Applied Active Inference Symposium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 411.114,
    "end": 412.876,
    "text": "This was our third such symposium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 412.937,
    "end": 417.923,
    "text": "The first was in 2021 with Carl Fristen as a kind of one person symposium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 418.624,
    "end": 425.208,
    "text": " Last year in the second symposium, we highlighted robotics and a variety of theoretical applied work in robotics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 425.328,
    "end": 432.513,
    "text": "This year we built off of the December 2022 framing of Frist and et al.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 432.833,
    "end": 437.676,
    "text": "designing ecosystems of shared intelligence, and we wanted to put it into play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 438.276,
    "end": 438.677,
    "text": "And so we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 439.656,
    "end": 460.414,
    "text": " co-organized with a really great team enacting ecosystems of shared intelligence and here are the presenters and discussants who joined and enacted the symposium and there's two intervals it was an awesome symposium super exciting to hear the breadth and the depth",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 461.295,
    "end": 481.493,
    "text": " of the work happening in the ecosystem so for here all i'll say is check out the program and recordings and transcripts if you want to learn more about that it was an epic symposium though and thanks again to the co-organizer team anything you want to add blue okay",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 484.833,
    "end": 495.983,
    "text": " As Blue alluded to earlier, we applied for a Phase 2 grant within the NSF program Pathways to Enable Open Source Ecosystems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 496.503,
    "end": 503.85,
    "text": "So here's just two visualizations that are provided by the NSF to describe a little bit of what they mean by an open source ecosystem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 504.41,
    "end": 506.912,
    "text": "On the right side, there's an open source product.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 507.893,
    "end": 511.816,
    "text": "And then through a pathway to sustainability,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 512.697,
    "end": 529.427,
    "text": " an open source ecosystem can exist, which includes here, not just scientist, open source product and external user, but governance documents, scientists, onboarding support, external users, the product, developer community, distributed defect management, development and integration and security.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 530.368,
    "end": 535.05,
    "text": "And it was super fun to think about our work in this broader sense of open source products.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 535.531,
    "end": 537.812,
    "text": "Open source doesn't only refer to code.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 538.252,
    "end": 539.913,
    "text": "So thinking about what is a really rich,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 541.374,
    "end": 562.708,
    "text": " multimodal open source product look like and what what is it and you want to add anything there blue or i can add more yeah i i just that our um so the paper that we wrote was kind of the scoping document for the grant and it's what the people do in in phase one",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 564.065,
    "end": 576.816,
    "text": " And in terms of open source, I think we have done everything open source at the Institute, like all of the things that we've done from the beginning of our formulation until now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 577.577,
    "end": 584.103,
    "text": "So it was kind of good to have that acknowledged that you can have an ecosystem around education or around",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 586.305,
    "end": 596.51,
    "text": " like just live stream videos or information sharing, information management, like we've really built up the active inference community.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 596.61,
    "end": 610.118,
    "text": "I think we've been a value add because somebody has to kind of organize and give meaning to kind of the random contributions or not random, but I think like it's helpful in a way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 610.896,
    "end": 616.778,
    "text": " a field that's so new and it moves so quickly in terms of research developments and everything else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 618.858,
    "end": 619.078,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 619.758,
    "end": 619.978,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 619.998,
    "end": 636.563,
    "text": "Just to give a little more detail, the primary submitter on this grant was the University of Washington Applied Physics Lab via co-PI Scott David at the IRS IRI, as well as Blue and I. And",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 637.603,
    "end": 653.536,
    "text": " As Blue mentioned, it was really fun to see who was ready for what, who wanted to throw a value into the arena, who wanted to put a comment on a Google Doc, who is ready to state their hourly,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 654.795,
    "end": 660.159,
    "text": " rate and scope of work and get involved if there's pragmatic value of that kind on the line.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 660.82,
    "end": 664.183,
    "text": "Who's ready to work in the meanwhile?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 664.363,
    "end": 668.086,
    "text": "And so it was just many discussions and negotiations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 668.867,
    "end": 676.573,
    "text": "And as we can smile and laugh at now, a lot of curveballs and things happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 676.633,
    "end": 677.914,
    "text": "So it was great times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 678.715,
    "end": 680.096,
    "text": "Okay, moving on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 682.472,
    "end": 704.775,
    "text": " just within the last weeks we have submitted our form 1023 to the IRS and so we soon expect and prefer ourselves to be a 501c3 tax exempt organization which means that donations that people provide to us of which we have received none so far will be tax exempt",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 706.116,
    "end": 728.508,
    "text": " once that status and all associated infrastructure is ready we'll begin philanthropic campaigning with blue especially we are working on policies and procedures proactively so that we can have compliance ahead of time and just stay right and relevant",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 729.907,
    "end": 756.629,
    "text": " it would be extremely helpful and much appreciated if anybody was interested in contributing their experience networks or resources to what it could be for a philanthropy or fundraising program at the institute we're open to how that might develop and so if you see a high leverage opportunity for what you know or who you know or however then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 760.097,
    "end": 780.536,
    "text": " some truly amazing things could happen and if you know you know and if you know then help anything you want to add on this i do want to add that um it was really interesting in developing like ecosystem infrastructure in the pose grant and in the ecosystem paper it was really interesting to see like what",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 781.337,
    "end": 810.837,
    "text": " what it takes to be a sustainable ecosystem like to really evaluate that um at the level of the institute and the ecosystem and i do think that uh i mean what makes a organization dissolve like people either like you know it's like time and people and money right it's like time and money time and money as long as people have time and people have money and interest level so so we um have a great like interest level as we'll talk about i think in the coming few slides we'll demonstrate that but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 811.297,
    "end": 816.518,
    "text": " But how do we get people to keep having time to commit to the Institute and the organization?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 816.558,
    "end": 821.019,
    "text": "So I think that one of the key things that we need to do is fundraise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 821.299,
    "end": 824.839,
    "text": "So like philanthropy also, but also grant writing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 825.299,
    "end": 834.201,
    "text": "So these two things will be, I think, central to keeping the Institute, like being the glue that keeps the Institute together in the coming years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 834.701,
    "end": 840.442,
    "text": "So I just want to just highlight that for anybody who wants to come be some glue, come provide some adhesion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 841.222,
    "end": 859.564,
    "text": " um in the niche that'd be great yeah it kind of goes without saying but it's easy to skip everything that has happened so far has been a purely volunteer effort including this very little little live stream and the last few months have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 860.541,
    "end": 879.655,
    "text": " signaled and anticipated and readied for literally the first paid people to do anything for the institute which is a big game changer and would scaffold our time and so that will be quite a transition point",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 881.147,
    "end": 881.828,
    "text": " Let's continue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 882.888,
    "end": 886.951,
    "text": "Also at the Institute level, we continue with our volunteer program.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 887.631,
    "end": 894.896,
    "text": "As always, I can do nothing but encourage and exhort you to volunteer and get involved at the Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 896.157,
    "end": 901.261,
    "text": "Being a volunteer supports your engagement with projects and learning groups, whichever ones you're interested.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 902.469,
    "end": 911.196,
    "text": " It gives you repeatedly affordances provided to get involved with Active Inference and your contributions will matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 911.437,
    "end": 914.94,
    "text": "The questions you ask on a live stream will be published by the Active Inference Journal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 915.68,
    "end": 920.865,
    "text": "The questions that you write in the textbook group coda, those do become part of a shared knowledge niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 921.485,
    "end": 940.804,
    "text": " code developments that you provide something that makes it more accessible or applicable those are huge in the setting that we are and will be in so please volunteer and encourage other people who could be looking for technical or philosophical education community mentorship all these different things",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 941.485,
    "end": 942.205,
    "text": " This is a great way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 943.086,
    "end": 952.248,
    "text": "And for those who would like a little bit more structured of an approach to getting involved, we continue to have the internship program.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 952.428,
    "end": 959.991,
    "text": "There's about 20 active interns from around the world who are engaging with different research and education affordances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 960.811,
    "end": 965.893,
    "text": "And we are up to now five successfully completed internships",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 966.733,
    "end": 981.472,
    "text": " so to those who completed it's been honor and an epic time there's so much more i could say but it's really exciting what interns come in with because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 983.396,
    "end": 996.385,
    "text": " we ourselves or from what we hear, people are excited to apply active inference and to improve their own education and understanding of what active inference is and how they might use it or grasp or handle it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 997.286,
    "end": 1004.271,
    "text": "And then to have this lightweight internship program that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1005.791,
    "end": 1022.821,
    "text": " makes a connection between the institute and the person, gives a container and a name and a timeline and an asynchronous document for people's engagement, whether they're in a traditional educational program, like an undergraduate student or a graduate student,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1024.199,
    "end": 1045.795,
    "text": " or probably the majority of which are outside of a traditional educational program and just lifelong learners and lifelong cool people and they just come to work and hone what they do so it continues to be very inspiring and I encourage people to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1047.369,
    "end": 1047.91,
    "text": " be interns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1048.05,
    "end": 1058.98,
    "text": "And also for those who would like to facilitate or mentor, we would like to start that discussion about how that might work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1061.021,
    "end": 1061.722,
    "text": "Anything else you want to add?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1064.224,
    "end": 1065.946,
    "text": "The active inference matchmaking service.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1072.947,
    "end": 1074.728,
    "text": " There's so many funny ways to take that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1074.788,
    "end": 1076.569,
    "text": "But yeah, what do you expect and prefer?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1076.589,
    "end": 1080.23,
    "text": "I meant like matching mentors and interns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1081.031,
    "end": 1082.671,
    "text": "Yeah, of course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1083.572,
    "end": 1091.115,
    "text": "And then just a little summary update across our different platforms and platforms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1092.543,
    "end": 1120.616,
    "text": " public interfaces we see continued growth and and activity just one um plot this is our channel youtube channel growth through time just kind of interesting slow and steady wins the race but it's also always good to see that first and potentially second and third order derivatives increasing anything else you want to add",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1123.101,
    "end": 1144.55,
    "text": " no i think like the youtube channel has really blown up like in the last quarter and i think a lot of that um we just have to shout out uh to the chris fields course because the views are astronomical in those videos it's like really um it's really blowing up so thanks chris if you're watching and to everybody who's viewing those videos and taking those courses which the it's truly awesome actually",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1145.342,
    "end": 1147.504,
    "text": " Yeah, we'll return to that, but good point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1147.564,
    "end": 1167.783,
    "text": "And also, for people who are interested in even social media management, video production, podcast editing, Discord moderation and governance, meta governance, there's a lot of things that don't require some technical fluidity with the Active Inference kernel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1168.479,
    "end": 1187.243,
    "text": " there's a lot of ways that people can help so don't don't let it provide too much friction or freeze you out if you feel like you want to be involved but you wonder if you don't know enough about some technical area or philosophical framing it's totally not required and there's a million ways that we can work with wherever people are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1188.982,
    "end": 1198.527,
    "text": " And actually, that's one of the key areas that we've identified in our ecosystem oversight is social media management.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1198.567,
    "end": 1203.009,
    "text": "So it's not all about the math.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1203.109,
    "end": 1206.53,
    "text": "So many people come to us like, I'm so curious, except I can't do math.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1207.651,
    "end": 1208.951,
    "text": "And it's okay, actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1209.312,
    "end": 1210.272,
    "text": "Can you do Twitter?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1211.893,
    "end": 1216.455,
    "text": "Because really, there's a lot of opportunities for involvement with the Institute that aren't math heavy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1216.475,
    "end": 1216.575,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1219.0,
    "end": 1224.625,
    "text": " Before we head into the organizational units, here's the big picture on which activities are happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1225.205,
    "end": 1231.711,
    "text": "This website, which you'll find heartily linked from basically anywhere you are,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1233.16,
    "end": 1255.068,
    "text": " always summarizes the up-to-date representation of what activities are happening and what you can do to get involved so i'll just go over this and we'll talk about a few of these projects in the coming slides so in the space of publishing different medias we have the live stream project where we organize and prepare for different live streams",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1255.908,
    "end": 1272.843,
    "text": " Following live streams, transcripts are created and published through the Active Inference Journal, which through the work of Alex, Holly, Dave, others, is always improving, and it's an exciting time for all of these natural language processing analyses as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1273.323,
    "end": 1281.31,
    "text": "This is all being pushed to the GitHub that allows you to clone off the current state of the art in all the transcripts and translations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1282.475,
    "end": 1286.178,
    "text": " In the learning groups area, we have the Parr et al.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1286.218,
    "end": 1305.152,
    "text": "textbook group, cohorts four and five, continuing through the textbook group, Fundamentals of Active Inference, Sanjeev Nanjoshi's book, In Progress, and two courses which we'll come to later, Physics as Information Processing by Chris Fields and Constructing Cultural Landscapes, Active Inference for the Social Sciences by Avel et al.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1306.193,
    "end": 1308.835,
    "text": "In the software space and activity,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1309.415,
    "end": 1337.38,
    "text": " we continue on active blockference where we work from both ends to make cognitive modeling more accessible and applicable we work from the technical capacity side to develop the active blockference project itself as a package utilizing cad cad to apply active generative models and we also work from the system or domain of interest side working with people wherever they're at in their analytical or programming abilities and just starting to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1337.74,
    "end": 1350.207,
    "text": " get the inklings of the recipe for generative modeling together robotics and embodied jf continues to develop his work with lego robots and societies of mind",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1351.525,
    "end": 1361.596,
    "text": " Active Inference Ontology also continues maintaining and slightly improving as well as extending the Active Inference Ontology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1361.816,
    "end": 1371.527,
    "text": "And we have two weekly discussion sessions, one more on the educational theme, one more on the research theme, but ultimately they're both just how it goes in the moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1372.107,
    "end": 1372.628,
    "text": "Anything to add?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1375.663,
    "end": 1386.83,
    "text": " All right, in Eduactive, our educational organizational unit, one of the most exciting continued activities is the Active Inference Textbook Group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1387.745,
    "end": 1391.188,
    "text": " Cohort three, just within the last weeks, finished their journey.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1391.228,
    "end": 1394.07,
    "text": "So congrats to those who stuck it through cohort three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1394.83,
    "end": 1399.974,
    "text": "Cohort four is now in chapter six, Recipe for Generative Modeling, continuing on with the book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1400.535,
    "end": 1403.277,
    "text": "And cohort five is starting off there in chapter one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1404.017,
    "end": 1411.142,
    "text": "Everyone's welcome to join either or both of these cohorts, which are staggered so that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1412.283,
    "end": 1431.217,
    "text": " you can attend the same time zone and get sampling across the book or you can stay on one trail at a time and switch time zones everything's recorded everything is collaborative in our shared workspace it's always possible to register and get involved all backgrounds are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1431.917,
    "end": 1460.25,
    "text": " totally welcome and encouraged so if you've seen this textbook and or you want to learn more about what the only active inference textbook in the play right now says and also connect a ton of dots and bring in a ton of other resources and more then the active inference textbook group is a great place and you'll meet many people who are also interested in similar topics anything else blue",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1462.15,
    "end": 1462.45,
    "text": " It's fun.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1464.513,
    "end": 1464.773,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1465.834,
    "end": 1471.241,
    "text": "The course that began in May, 2023 is now about five sixths completed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1471.441,
    "end": 1473.784,
    "text": "That's Physics as Information Processing by Chris Fields.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1474.084,
    "end": 1481.733,
    "text": "It's been a journey and can't wait for the fifth discussion section, which is tomorrow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1482.731,
    "end": 1492.698,
    "text": " and then the sixth lecture and discussion and that will have locked in the completion of the first course at the institute",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1494.073,
    "end": 1503.716,
    "text": " We'll be able to publish the proceedings of the lectures and discussions, as well as the asynchronous question and answer, which Chris Fields is very graciously answering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1504.817,
    "end": 1517.941,
    "text": "Then we'll be able to explore cohort or individual-based learning structures around this really first principles and groundbreaking content that Chris is sharing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1519.442,
    "end": 1520.642,
    "text": "Want to add anything on this one?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1523.769,
    "end": 1524.595,
    "text": " Just wow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1525.139,
    "end": 1525.542,
    "text": "That's all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1526.791,
    "end": 1526.972,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1529.099,
    "end": 1541.209,
    "text": " Also in the courses space, we continue on with the Constructing Cultural Landscapes, Active Inference for the Social Sciences course with Avelle, Ben, Mau, Lorena, and myself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1541.929,
    "end": 1554.279,
    "text": "So Ben, Mau, myself, and Lorena have completed their sections with a lecture and a discussion, although I guess Mau's discussion is coming up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1555.78,
    "end": 1580.712,
    "text": " we look forward to also the continued activity in this course as we remarked on in our last quarterly roundtable second one this year has and will see us go from zero courses to two completed courses so both the physics and the social sciences which",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1582.239,
    "end": 1610.184,
    "text": " under some understandings run the gamut of multi-scale systems to have both of those at such high quality volunteered and catalyzed by real unique expertise and also broad and diverse participation is incredible anything you want to add blue",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1612.13,
    "end": 1622.694,
    "text": " Just that as we are starting to have courses hosted by the Institute and completed, anybody interested in having a course hosted by us should reach out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1623.355,
    "end": 1630.458,
    "text": "And anyone familiar with or interested in accreditation is also something like we've been thinking about how do you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1632.658,
    "end": 1635.901,
    "text": " What would certification in active inference look like?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1635.941,
    "end": 1638.244,
    "text": "What are the key build-up skills?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1638.624,
    "end": 1642.948,
    "text": "And how could we develop a program to say someone is certified in active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1643.048,
    "end": 1645.311,
    "text": "It's something that we've been thinking about at the institute scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1645.871,
    "end": 1648.193,
    "text": "So if you have ideas, we would love to hear about them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1649.014,
    "end": 1651.877,
    "text": "And if you have experience, we would love to get your input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1652.538,
    "end": 1652.738,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1654.264,
    "end": 1667.735,
    "text": " It's not covered in this round table, but the qualification certification, something that we're thinking about, and the pedagogy and developing and hosting courses, these are all things that we will work on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1669.582,
    "end": 1672.903,
    "text": " in the education space of live streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1673.683,
    "end": 1677.825,
    "text": "We continue to have exciting and unique live streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1677.885,
    "end": 1680.266,
    "text": "Here's just kind of a slice of life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1681.046,
    "end": 1684.227,
    "text": "Here's the upcoming live streams for the coming 30 days.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1684.787,
    "end": 1689.389,
    "text": "We have the round table that we're in right now, strangely looping.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1690.369,
    "end": 1693.23,
    "text": "We have Chris Fields' discussion tomorrow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1694.171,
    "end": 1697.732,
    "text": "We have social sciences discussion next week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1698.959,
    "end": 1726.352,
    "text": " lecture six and discussion six for physics active inference for the social sciences avel's lecture and discussion and a guest stream on conviction narrative theory and a new live stream paper-based series kicking off on message passing so it's kind of like a flavor of sometimes the work to prepare for this live stream is just to coordinate with a guest",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1727.236,
    "end": 1734.662,
    "text": " and it doesn't require any kind of expertise in their topic, actually just a curiosity in it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1735.543,
    "end": 1743.068,
    "text": "Other times we are operationally or logistically supporting the course teachers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1743.849,
    "end": 1768.668,
    "text": " and also just showing up and then there's also work like the dot zero preparation where for weeks to months ahead of the live stream we're studying through a paper and leveraging the questions that we have by asking early and asking often and precisely or at least legibly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1769.773,
    "end": 1792.283,
    "text": " that enables the questions that are asked before the live stream by the dot zero preparers to then actually realize the addressing of those questions instead of a thousand scattered notebooks after the fact or there being no fact in just a thousand scattered notebooks the dot zero i'm very passionate about because it is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1793.695,
    "end": 1822.865,
    "text": " a way to do the homework early and by doing so change how things actually happen so if you're interested in having any kind of impact or learning with the live stream organizing and preparation process whether you have this or that familiarity with the video and the media and the communication side or with any topics in and of themselves",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1824.065,
    "end": 1834.61,
    "text": " It's super fun to invite people and have broad invitations, curations, and facilitations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1834.65,
    "end": 1838.052,
    "text": "There's a lot of exciting things that people can get involved with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1838.092,
    "end": 1839.352,
    "text": "So please do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1839.813,
    "end": 1847.016,
    "text": "And other than that, it's been a true highlight of the quarter and the year to have all these live streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1850.58,
    "end": 1869.49,
    "text": " And as mentioned earlier, following each live stream, we go on to publish the proceedings and publish them on GitHub where they're all versions and collaboratively edited and also publish them to Zenodo to get the DOI and the URL.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1873.252,
    "end": 1875.013,
    "text": "Briefly from re-inference,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1876.263,
    "end": 1882.368,
    "text": " We continue work on the active inference ontology, active block inference, robotics and embodied.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1883.228,
    "end": 1892.836,
    "text": "And we have several of the Institute seed projects related to graphical interfaces for active inference and cognitive agent modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1893.716,
    "end": 1899.621,
    "text": "And then there's the plethora of individual projects that people are working on on their own.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1900.942,
    "end": 1903.043,
    "text": "Anything you want to add on any of those projects?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1904.424,
    "end": 1905.085,
    "text": "No, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1905.604,
    "end": 1905.825,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1907.254,
    "end": 1907.416,
    "text": "Well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1909.441,
    "end": 1938.29,
    "text": " as we head into the last months of our activity in 2020-23 and plan to have a quiet December so really only two more months of activity this year and then we'll be in next year so as usual while scrambling to prepare for the presentation and trying to convey what we could and should I developed this small meme",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1939.23,
    "end": 1955.66,
    "text": " so here on the bottom is the timeline quote timeline we're here in september 2020-23 soon it will be classical new years and we'll be in 2020-24 so here's us thinking wow 2020-24 should be really exciting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1961.53,
    "end": 1982.104,
    "text": " but also we remember feeling that way in 2022 and feeling that way in 2021 but this entire concept is a nested thought from the future what do you think about that blue or what are you excited about in the past present or future",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1987.731,
    "end": 1991.314,
    "text": " I mean, we don't get a treasure map, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1991.975,
    "end": 1995.358,
    "text": "So that's not something that comes with the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1996.118,
    "end": 2009.35,
    "text": "So it's always, I think, exciting to think about what the future holds and looking back how we've come so far and the leaps and what has caused exponential growth and all those things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2009.43,
    "end": 2010.691,
    "text": "I mean, it's always just exciting, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2011.832,
    "end": 2013.294,
    "text": "So some future thought...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2015.486,
    "end": 2036.389,
    "text": " maybe we'll be thinking about you know how we did make those big transitions every year and we kept making them and kept making them and kept making them cool yeah one more specific call to action other than the earlier",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2038.001,
    "end": 2057.817,
    "text": " communications to actual or plausible participants, volunteers, interns, we'd like to really make a special call for those who are interested in joining the Scientific Advisory Board or recommending or introducing somebody who you think could be helpful on the SAB.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2057.837,
    "end": 2061.44,
    "text": "SAB is an informal body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2061.64,
    "end": 2064.683,
    "text": "We have office hours with them and share documents with them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2064.743,
    "end": 2066.605,
    "text": "It's very opt-in and flexible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2067.887,
    "end": 2071.408,
    "text": " other sap members like chris fields went on to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2073.035,
    "end": 2073.595,
    "text": " do the course.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2074.055,
    "end": 2079.296,
    "text": "And just recently Sarah Hamburg started facilitating the Morphstream series.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2079.336,
    "end": 2087.157,
    "text": "So it's a way to get more involved and have a even more structured contribution or differently structured contribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2088.138,
    "end": 2100.82,
    "text": "And it would be amazing to have the SAB participants as liaisons and advocates and co-learners and co-creators",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2102.287,
    "end": 2131.108,
    "text": " in the coming year because we select the sab on a yearly time scale it would be great it's always open to apply however again in the coming several weeks if we could reach out to people who might have a positive synergistic relationship with being on the sab it would be very special and appreciated for us",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2133.854,
    "end": 2138.437,
    "text": " Well, that's it for this short round table.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2138.517,
    "end": 2143.279,
    "text": "So let's just give any thoughts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2143.759,
    "end": 2149.443,
    "text": "Meanwhile, I will wait for anyone in the live chat who might have questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2150.103,
    "end": 2155.466,
    "text": "If they write them in the next few minutes, then we can address them or just talk about them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2155.566,
    "end": 2159.508,
    "text": "But other than that, what's on your mind, Blue?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2159.528,
    "end": 2160.909,
    "text": "Or what are you excited for?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2165.639,
    "end": 2167.182,
    "text": " I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2167.422,
    "end": 2170.106,
    "text": "I'm excited for what's going to come up in 2024.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2170.726,
    "end": 2173.59,
    "text": "I think will be a big year for us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2173.871,
    "end": 2176.594,
    "text": "I'm excited to see if we get funded or don't get funded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2176.675,
    "end": 2180.52,
    "text": "But I think regardless, we've learned a lot about where we are and where we're going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2181.121,
    "end": 2187.746,
    "text": " We've gained a lot of certainty about our existence in the niche and about our niche also, which is great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2188.006,
    "end": 2203.097,
    "text": "Like at any time that you reduce uncertainty, you're able to, I think, you know, help validate or solidify your existence as an organization or a human or whatever in the active inference way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2203.457,
    "end": 2209.482,
    "text": "So I'm excited to kind of see how that plays out in our future unfolding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2211.189,
    "end": 2212.809,
    "text": " What about you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2212.849,
    "end": 2233.415,
    "text": "Yeah, that reminds me of the book stream series that you facilitated with Tyler and on Bijan Kesri's work about kind of using active inference to highlight the organizational generative model, nested generative models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2234.375,
    "end": 2240.397,
    "text": "And rather than talking about uncertainty being out there in terms of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2244.002,
    "end": 2256.903,
    "text": " aspects that are not known about what's out there it's kind of like a glass half full glass half empty starting with the certainties and uncertainties of the generative model as enacted through policy selection and so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2260.211,
    "end": 2285.423,
    "text": " even from the very most informal beginnings like the strange loop and the excitement was around applying active inference to and by and with and for active inference in the multi-scale setting and through the book stream but also through a million other vectors 2023 has come through hugely on that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2291.641,
    "end": 2300.847,
    "text": " And yet it remains a fledgling and nascent volunteer work as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2301.287,
    "end": 2302.888,
    "text": "So it's epic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2304.229,
    "end": 2307.471,
    "text": "Do you have any last thoughts or we can conclude?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2311.694,
    "end": 2312.814,
    "text": "We can conclude, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2313.115,
    "end": 2313.375,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2314.335,
    "end": 2314.856,
    "text": "Thank you, Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2315.116,
    "end": 2315.836,
    "text": "Thank you, everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2317.077,
    "end": 2320.099,
    "text": "Hope this was a useful roundtable and see you next time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2327.614,
    "end": 2327.834,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2329.977,
    "end": 2330.458,
    "text": "Okay, nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2330.478,
    "end": 2330.799,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2332.681,
    "end": 2334.103,
    "text": "We will see you later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2334.143,
    "end": 2334.724,
    "text": "Maybe tomorrow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2334.744,
    "end": 2335.505,
    "text": "Maybe if I can make it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2336.046,
    "end": 2336.527,
    "text": "I'm going to try.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2337.288,
    "end": 2339.331,
    "text": "To the discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2339.771,
    "end": 2340.532,
    "text": "Yeah, to the discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2340.552,
    "end": 2340.913,
    "text": "Oh, really?",
    "speaker": "SPEAKER_01"
  }
]