[
  {
    "start": 0.862,
    "end": 3.343,
    "text": " Hello, it's June 8th, 2023.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3.783,
    "end": 8.625,
    "text": "This is an update from the Active Inference Ontology project at the Active Inference Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9.305,
    "end": 15.507,
    "text": "This video is going to cover what the Active Inference Ontology is now and a few of the ways that we're using it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 16.272,
    "end": 43.35,
    "text": " little bit about the roadmap and plans for the ontology and especially areas you can contribute if you're interested to learn and apply active inference and also to leverage your learning and contributions so first what is the active inference ontology well at the public website you'll find currently that for the set of terms which constitute the active inference ontology we have definitions translations and correct and incorrect examples",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 44.13,
    "end": 52.038,
    "text": " There's often a lot of unnecessary or excessive uncertainty about what different terms mean in the active inference field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 52.619,
    "end": 66.133,
    "text": "And so what the active inference does, ontology does, is first create a curated list of core terms, currently 64 of them, most of which have an absolutely everyday natural language definition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 67.114,
    "end": 95.512,
    "text": " also we have several hundred extra supplemental and entailed terms that give us more comprehensive coverage of the literature these terms and their definitions help people speak the active inference ontology and thus build your fluency we also have translations into many languages so if you see a language here that you know and you want to build bridges between that language community and the primarily english active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 96.553,
    "end": 122.602,
    "text": " literature whether in education or research that's a super important way that we can improve the accessibility and the impact of the active inference research and also we have correct and incorrect examples for human and for ai learners to be able to use the terms correctly so that's what the active inference ontology looks like and there's a few cool ways that we can just briefly cover that we use the ontology every day so one",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 123.422,
    "end": 151.281,
    "text": " is in the active inference textbook group where if you come across an equation like this you might be really familiar with what variational free energy is or you might not be but what's really helpful is to have those equations written out using the active inference ontology so that you can mouse over to get more definitions and really just read it out and so this can also be translated across those different languages and supports for example differences in notation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 151.821,
    "end": 159.104,
    "text": " amongst different papers that might be talking about the same ontology term, but using different letters or symbols to represent it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 159.624,
    "end": 171.368,
    "text": "So that's one way that we use the ontology when we're adding value to publications and textbooks to connect ideas across different citations, read between the lines, and just understand active inference better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 172.428,
    "end": 189.738,
    "text": " we also do a lot of philosophy in ontology project not just is ontology an area of philosophy but we have explored along with many others over the last months ways in which we can use the ontology to take a procedural",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 190.538,
    "end": 209.063,
    "text": " approach towards addressing philosophical questions, like asking about how different topics are related to each other, or whether one author's perspective on one term is equivalent or dissonant from another author's perspective on a given term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 209.643,
    "end": 215.985,
    "text": "So these are the kinds of things that we often find ourselves wondering about, that we often hear beginners asking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 216.665,
    "end": 223.486,
    "text": " and the ontology helps us give a deflationary and really action-oriented way to address these kinds of topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 227.307,
    "end": 233.968,
    "text": "Lastly in this video, before everyone else is here can add any other thoughts or comments, are the areas of contribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 234.508,
    "end": 241.349,
    "text": "So here's just some of the ways that people can contribute to this open source resource and really make a big difference in the Active Inference ecosystem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 242.049,
    "end": 244.51,
    "text": "First, with respect to translations,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 245.407,
    "end": 248.609,
    "text": " you could add a language that you're familiar with if it hasn't been added.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 249.43,
    "end": 257.796,
    "text": "And if you know a language that has been added, but it's not complete or perfect, you're always welcome to check over those languages and try to improve them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 258.276,
    "end": 261.839,
    "text": "So currently again, the languages that we have are shown here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 264.192,
    "end": 279.242,
    "text": " With respect to the definitions, examples, and connections amongst different ontology terms, everyone would always be welcome to contribute their attention and care to reviewing definitions for accuracy and completeness, adding examples and counter examples,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 280.467,
    "end": 285.132,
    "text": " and also adding connections with any words that one might like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 285.293,
    "end": 296.986,
    "text": "Just like in the dictionary, where it gives a definition in terms of other words and then provides an example that helps provide context, we can add different connections like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 298.251,
    "end": 306.013,
    "text": " For those who are interested in some of the formal computational aspects of ontology, we're working with the suggested upper merged ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 306.373,
    "end": 318.115,
    "text": "So if you're curious or familiar with SUMO or SUO-KIF, the knowledge interchange format, then there is some later work down the road that would be awesome to collaborate on already.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 319.836,
    "end": 324.377,
    "text": "In terms of the ontology composition,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 325.404,
    "end": 329.085,
    "text": " we're always interested to be able to review and revise the core terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 329.185,
    "end": 333.586,
    "text": "Are there any terms that we have in the core set that might not be so important?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 334.087,
    "end": 342.389,
    "text": "And are there any terms that you think are really important for understanding active inference, speaking about it fluently, but are not being included in the core right now?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 342.469,
    "end": 344.249,
    "text": "Well, that is a great way to help.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 345.21,
    "end": 352.672,
    "text": "And you're always welcome to add different citations or references to where the ontology is being used in the wild.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 354.068,
    "end": 354.848,
    "text": " Using ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 355.229,
    "end": 359.651,
    "text": "There's a ton of different use cases that people have proposed and some are following through on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 360.491,
    "end": 374.758,
    "text": "Analyzing textbooks and other papers, whether written in English or other language, can really make clear the value of the ontology for those who might see this as just like a hypertrophied word list or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 375.845,
    "end": 402.332,
    "text": " and there's a special focus on the active inference researcher as well as the learner and the beginner so what are the questions and guides and how can we think about this in terms of the educational productions and what makes learning active inference as a language really fun and accessible currently we publish through coda as well as through github however this is not necessarily the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 404.008,
    "end": 407.73,
    "text": " best possible publication approach for an ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 407.99,
    "end": 417.553,
    "text": "So we would look to those who have expertise in ontology in this project in a variety of places, but also to help think about how to publish this in a cool open science way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 418.634,
    "end": 424.336,
    "text": "And then there's a ton of discussion topics that we're always looking to develop the status of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 425.116,
    "end": 431.019,
    "text": "Communicating the active inference ontology, not unlike this video, but how it can be used is honestly super exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 431.539,
    "end": 438.206,
    "text": " And there's a lot to learn and there's a lot to do for people who even have a little bit of familiarity with active inference and even a little bit of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 438.507,
    "end": 440.288,
    "text": "So hopefully that's you or more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 440.749,
    "end": 443.292,
    "text": "So hopefully you do participate in the ontology project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 445.54,
    "end": 451.341,
    "text": " People have discussed sharing the Active Inference Ontology in the wild with people who are using the terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 451.421,
    "end": 469.904,
    "text": "For example, if a term is being misused or being used in one way or another, then following up on that thread or sending a communication to that speaker and letting them know about the terms usage in the Active Inference Ontology, maybe even inviting them to continue the collaboration in the project just could be something cool, something someone's brought up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 471.105,
    "end": 472.585,
    "text": "Integration with knowledge engineering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 473.393,
    "end": 479.677,
    "text": " We've performed literature meta analysis and use the ontology to guide term and topic analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 479.978,
    "end": 491.646,
    "text": "And there's a lot more work that could be done with curating across the literature and across the transcripts of live streams and understanding where and how the academic ontology makes a difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 493.391,
    "end": 518.737,
    "text": " would be a lot of awesome work to explore with education with learning groups and projects but also with development of curriculum materials for active inference and the last one listed here is going beyond the examples and the counter examples but stories and anti-stories and really just connecting this work of the active inference ontology to the topics and the systems of interest that we discuss every day",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 519.716,
    "end": 522.958,
    "text": " So there's also more things you might want to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 523.518,
    "end": 529.661,
    "text": "We just tried to give a really quick overview of the project itself and a few of the places where we're going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 530.621,
    "end": 538.705,
    "text": "Dave or Paolo, would you have any comments or what else would you like to add or anything that was sort of just glossed over before?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 543.807,
    "end": 544.088,
    "text": "Dave?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 547.429,
    "end": 548.43,
    "text": "No, that's clear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 548.49,
    "end": 548.79,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 549.4,
    "end": 549.64,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 550.041,
    "end": 550.261,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 550.421,
    "end": 555.809,
    "text": "We hope that you get in touch with ActiveInference at gmail.com or find us elsewhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 556.55,
    "end": 558.272,
    "text": "And we'll see you in the ontology project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 558.312,
    "end": 558.632,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  }
]