[
  {
    "start": 1.398,
    "end": 28.401,
    "text": " hello thanks everyone for joining it's March 29th 2023 we're in cohort 3 having our first discussion on chapter 5. so before we go into any questions or look at the text does anyone want to just provide any general reflection or thought on chapter 5 or just the first half of the book up till now",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.043,
    "end": 33.504,
    "text": " just unmute and go for it if you want to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 56.588,
    "end": 56.888,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 57.028,
    "end": 60.632,
    "text": "Let's look to chapter five and then, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 62.536,
    "end": 88.51,
    "text": " i'm sure people have many thoughts as we get going any general thoughts on five or on this opening quotation about plants and animals",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 88.962,
    "end": 118.378,
    "text": " Well, there are plants that move and there does seem to be some thought that there are interconnections between plants, that they have something that, while it is not an animal central nervous system, there are patterns within the architecture that have",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 118.358,
    "end": 144.754,
    "text": " similar functions and it's the timeline over which they operate is much longer I very much agree with that here's my PhD advisor Deborah and a paper from 1989 describing the plant behavior idea and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 149.543,
    "end": 160.117,
    "text": " I believe a more closer to our area is this 2017 paper on plant predictive processing with Friston.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 161.979,
    "end": 162.861,
    "text": "So agreed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 162.981,
    "end": 168.088,
    "text": "This quote, it's a little bit of like timescale dependent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 168.108,
    "end": 175.197,
    "text": "It's just kind of like a, it's a fun first pass, but isn't that interesting that it's like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 175.565,
    "end": 200.374,
    "text": " actually not so stark or the plants that do respond like the venus fly catchers and everything but here in this chapter we're going to be focused on the mammalian nervous system and body not the morphology of the nervous system or like morphological development",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 208.555,
    "end": 237.516,
    "text": " okay yeah anyone please just raise your hand or or write something otherwise let's just go through chapter five and just look at some potentially interesting pieces this is an interesting concept that not every variable depends on every other variable and that's sparsity and so there's sparsity in the brain",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 238.964,
    "end": 266.507,
    "text": " are many connections but of the space of the possible it's quite sparse and similarly in statistical models the sparser they are the easier they are to fit doesn't mean that it's going to be better and a lot of modeling is about finding the trade-off point between like model complexity and model accuracy because if you enable every edge it's going to be a really laborious calculation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 267.55,
    "end": 294.942,
    "text": " if you restrict edges that are actually important you might have a very rapidly fit model however it might not reflect some of the important true causal relationships amongst variables so that comes up in different ways let us take a step back from the technical material of chapter four everyone breathes a sigh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 295.9,
    "end": 322.887,
    "text": " turn our attention to the process theories accompanying active inference here they point to the difference between a principle free energy principle which is that systems are described by their dynamics on free energy landscapes and that persistence is associated with reduction of free energy to the extent that agency is exerted",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 323.44,
    "end": 351.912,
    "text": " and a process theory about how any given system may actually implement those kinds of dynamics so a principle cannot be falsified and this is at the root of a lot of questions and commentary around like the falsification capacity for the free energy principle and the simplest thing as far as i've seen is neither can a linear regression be falsified",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 352.6,
    "end": 359.55,
    "text": " It's just not within the space of being confirmed or rejected or falsified by anything at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 359.57,
    "end": 363.215,
    "text": "It's just a proposed model framework as a principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 364.396,
    "end": 381.78,
    "text": "Now, any given linear regression, which is a specific hypothesis about how that principle of linear regression or the principle of the L2 norm might be implemented, that given linear model might be adequate or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 382.064,
    "end": 388.915,
    "text": " more adequate or totally inadequate or however, but it is more subject and answerable to empirical data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 390.037,
    "end": 401.896,
    "text": "So free energy principle is not really in the space or the game of falsification or not, nor does it even engage with empirical data directly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 403.218,
    "end": 407.785,
    "text": "Whereas proposed and manifest models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 409.267,
    "end": 433.671,
    "text": " are directly addressing empirical data and empirical data speak to their validity so none of the above chapters that we've read could be falsified by any observation in the world or they're just kind of theoretical whereas the models that are going to start to be shown in chapter 5",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 433.938,
    "end": 443.751,
    "text": " are going to be structural and computational hypotheses about models of the nervous system, and thus they're more addressable and answerable to real data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 444.012,
    "end": 444.332,
    "text": "Jonathan?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 446.435,
    "end": 457.65,
    "text": "Would it be reasonable to say that it may or may not be true that the free energy principle is applicable to certain real world systems, but not that the principle itself is wrong, just that it's not applicable?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 462.035,
    "end": 463.818,
    "text": " What does anyone want to add on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 468.745,
    "end": 469.406,
    "text": "Ali, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 472.991,
    "end": 490.877,
    "text": "Actually, I came across a situation that kind of contradicts some of the claims of Active Imprints or FEP about their scope of applicability recently.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 491.245,
    "end": 513.038,
    "text": " I'm not sure if you're familiar with Stephan Ferner's, some of Stephan Ferner's recent work, but basically he claims that complex systems include a set of systems that are only non-Markovian and non-ergotic systems.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 513.88,
    "end": 519.328,
    "text": "But on the other hand, we have this notion, we have this requirement for",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 519.562,
    "end": 528.643,
    "text": " any system that is to be modeled in active inference framework to be ergodic and Markovian systems.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 529.214,
    "end": 535.883,
    "text": " Although in some recent literature, they have dropped this requirement for the system to be ergodic.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 535.984,
    "end": 551.726,
    "text": "But again, I believe a kind of local ergodicity needs to be present in order for the system to be modeled in FEP or active inference framework.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 551.746,
    "end": 556.993,
    "text": "So as far as I know,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 556.973,
    "end": 561.111,
    "text": " The scope of applicability is",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 561.31,
    "end": 580.229,
    "text": " at least so far, not strictly defined or, let's say, it's not something that can be restricted in a definitional way, but there are degrees of applicabilities.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 580.59,
    "end": 590.76,
    "text": "So, for instance, in Dalton Sack-DeVadevel's weak blankets paper,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 591.905,
    "end": 614.824,
    "text": " He has this notion of degrees of blanketedness that helps us to distinguish between the systems that have effective markup blankets and the otherwise linear systems that doesn't contain any kind of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 615.158,
    "end": 618.083,
    "text": " effective blanketedness.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 619.145,
    "end": 636.373,
    "text": "So briefly, he claims that for higher dimensional and complex systems, we can apply these Bayesian mechanical framework, but for",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 636.353,
    "end": 664.065,
    "text": " linear systems although theoretically it is applicable for those systems as well but it wouldn't result in an interesting an interesting behavior because it would basically be a kind of trivial thing to apply these frameworks for a simple or simple in in the sense of being linear systems",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 666.695,
    "end": 670.379,
    "text": " Thank you, Olli, very deep answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 670.599,
    "end": 670.879,
    "text": "Michael?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 675.985,
    "end": 695.706,
    "text": "Yeah, I also read in some context that this would explain how a system can come into the steady state, but it cannot explain how it comes out, what triggers the system to go out of that steady state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 695.686,
    "end": 698.97,
    "text": " But this is constantly observed, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 699.03,
    "end": 704.377,
    "text": "I mean, we are not always in a steady state, but also jump into other states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 705.358,
    "end": 710.645,
    "text": "So I don't know whether this is an implication exactly from what Ali said.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 710.765,
    "end": 718.875,
    "text": "But I said that's why this free energy principle could not be applied to living systems even, I think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 722.348,
    "end": 747.259,
    "text": " yes thank you well a lot of perspectives let's like focus that kind of question on on the material of chapter five which is the mammalian nervous system and behavior so with copious citations and empirical evidence they're going to be talking about places where the fep and active have been applied",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 748.235,
    "end": 757.365,
    "text": " And so this is going to be much more empirical and tangible and anatomical than previous chapters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 758.647,
    "end": 777.128,
    "text": "So whereas the generative model proposed in chapter four and the high and the low road by which that generative model is reached in chapters three and two were kind of in principle, here we're going to see a lot more about what it looks like in practice",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 778.154,
    "end": 798.964,
    "text": " that's going to mean that it's in reference to a specific kind of system like specific brain regions and it's also going to mean that it's answerable to empirical data and that it's been published according to professional communication channels signifying that it had unique explanation or predictive power",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 799.855,
    "end": 809.466,
    "text": " So a lot of these are like fascinating questions about the hard and soft limits of applicability of different methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 811.549,
    "end": 813.891,
    "text": "And we'll see in chapter five, how that plays out in practice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 817.355,
    "end": 821.52,
    "text": "So again, just write anything or raise your hand if you'd like to explore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 821.941,
    "end": 826.386,
    "text": "So this chapter is not intended as the final word on process theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 827.294,
    "end": 835.447,
    "text": " It's simply the interpretation that seems most consistent with the currently available evidence and length constraints on the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 837.65,
    "end": 844.881,
    "text": "Nor is our aim to endorse a specific process theory, but to illustrate how the ideas in the previous chapters may be put to work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 845.08,
    "end": 872.877,
    "text": " so if we were reading an anatomy textbook or a psychology textbook it would be like this is how it is the elbow is connected to this and this concept does this but the way that we're going to be looking at the coming examples are like representative of how models are constructed that do describe real systems of interest um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 874.662,
    "end": 890.02,
    "text": " Jana, I'll bring your question into here and feel free to continue this or add any more information on what type of generalist tools might help.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 890.741,
    "end": 894.125,
    "text": "Coda is certainly one generalist tool that helps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 897.87,
    "end": 904.618,
    "text": "And then there's many statistical approaches that are more technical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 905.476,
    "end": 917.651,
    "text": " So right now we're going to be approaching this just from the kind of like learning side, but the way that these models are implemented, the code is generally available.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 918.151,
    "end": 920.033,
    "text": "And so those also provide some specific tools.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 920.814,
    "end": 930.966,
    "text": "And there may be other tools also, but at least tools that we use for learning help us with Bayesian mechanics in our engagement with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 931.127,
    "end": 934.791,
    "text": "And then the tools that actually implement those statistical models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 934.94,
    "end": 961.673,
    "text": " then there may also be other tools as well which would be interesting to explore they describe the layout of the chapter which is going to be first focusing on one of the most well-studied neural systems which is the mammalian cortex architecture they're then going to expand into the um reflex arc",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 961.788,
    "end": 990.698,
    "text": " the spinal cord and that will help us look at the continuous time models of perception and action and then in section 5.4 talking about decision making all right so in the end of chapter four there were some representations that looked like this and this is showing two",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 991.454,
    "end": 996.001,
    "text": " related views on a generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 996.682,
    "end": 1009.082,
    "text": "On the left is a hierarchical predictive processing model where there are, just as a graphical convention, top-down predictions and bottom-up sensory data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1009.783,
    "end": 1015.432,
    "text": "And so this is represented as kind of like a skyscraper, just without reference to time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1015.733,
    "end": 1017.175,
    "text": "The tilde means through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1019.095,
    "end": 1046.79,
    "text": " this in practice becomes unrolled through these message passing architectures and we talked a little bit about that last week here they're going to return to that idea so the skyscraper the kinds of ways in which hierarchical predictive processing architectures can be visualized or represented with a base graph",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1047.901,
    "end": 1070.753,
    "text": " those schemes are going to be associated with stereotyped circuitry and there's like also coming from a long history of taking pictures of the brain and understanding of what the circuitry is in terms of synoptic connectivity and so on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1071.745,
    "end": 1094.614,
    "text": " they're going to describe a little bit about this cortical column and as an insect neuroscientist it's fun to read all this because i just think well this is one way it could be but certainly all of these anatomical details they don't even necessarily have to be that way for mammals but they definitely don't have to be that way outside of mammals",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1096.18,
    "end": 1115.86,
    "text": " connecting it to the reality of what is empirically measured helps ground the theory and so figure 5.1 is going to be a side by side of the anatomy of the cortical layers",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1117.645,
    "end": 1119.528,
    "text": " Has this mapping been done for the C. elegans?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1120.43,
    "end": 1130.847,
    "text": "The synaptic connectivity of the whatever it is, 302 neurons in the C. elegans for the most part has been completed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1132.509,
    "end": 1135.975,
    "text": "So synaptic connectivity maps do exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1136.663,
    "end": 1149.941,
    "text": " I mean the relationship between that map and the message passing that we see here, the mapping between what we're seeing on the left and what we're seeing in the middle on the right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1152.445,
    "end": 1153.286,
    "text": "It would be awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1154.528,
    "end": 1157.592,
    "text": "As far as I know, there's not an explicit...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1158.871,
    "end": 1185.57,
    "text": " nematode or even fruit fly or any other type of mapping but I think that's very exciting work because there's like a whole nematode simulation and there are with brain and body and biomechanics and there are similar projects for the drosophila fly so the bulk of the work",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1186.259,
    "end": 1215.591,
    "text": " of these authors friston at all and and building on the legacy of spm most of the work has been done in human neuroanatomy and so not many people were considering beyond like the human neuroimaging case until more recently so these six layers of the cortex are defined histologically",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1215.79,
    "end": 1224.683,
    "text": " So just from a tissue definition, they have some morphological differences and they also have like some gene expression and protein expression differences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1226.106,
    "end": 1235.059,
    "text": "And these edges represent physical structural connections amongst different regions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1237.423,
    "end": 1242.27,
    "text": "It's juxtaposed and these are kind of the outputs, inputs and outputs",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1243.077,
    "end": 1262.359,
    "text": " with these, the thalamus and so on, sending inputs into layer four, and then this kind of resonance processing happening within a columnar unit, and then the outputs of this layer five cell going on to the decision-making areas that are going to be discussed in section 5.4.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1264.181,
    "end": 1268.646,
    "text": "And it's juxtaposed in kind of a visual rhetorical style",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1270.145,
    "end": 1297.452,
    "text": " with statistical representations about what these populations of cells might be doing so that is helping connect the semantics of these variables like this one is an error on this and this one's a variance estimator on that and this one's getting inputs about this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1297.803,
    "end": 1309.298,
    "text": " All those kinds of things that we want to talk about what a statistical variable is doing and mapping that onto empirically observed patterns of neuroanatomy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1315.026,
    "end": 1317.69,
    "text": "Now, this is going to be kind of coarse grained.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1319.032,
    "end": 1327.523,
    "text": "This columnar unit, which is repeated thousands of times in the mammalian cortex, is going to be abstracted",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1328.684,
    "end": 1355.08,
    "text": " the deep to the superficial so this is that layer um one two three four five six superficial towards the surface of the brain and then the deeper regions of the cortex so that is going to be like one unit in this figure 5.2 they have simplified what's happening within a cortical region",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1356.089,
    "end": 1378.114,
    "text": " highlight what is happening amongst cortical regions and so there's processing happening within a column and also columns can serve as bottom up and top down for each other so they're interacting laterally from an anatomical perspective",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1380.085,
    "end": 1387.676,
    "text": " However, in this representation, the one on the right is like sending top-down predictions to the one on the left.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1389.258,
    "end": 1395.948,
    "text": "And then bottom-up prediction errors or sensory inputs are coming up to the one on the right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1398.031,
    "end": 1408.506,
    "text": "So this is showing that predictive processing architectures can be implemented laterally across cortical columns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1409.903,
    "end": 1427.727,
    "text": " and this is at the root of a lot of current computational modeling efforts just we'll leave it there and we'll return to it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1428.415,
    "end": 1434.684,
    "text": " Can I ask, are they the Taylor series?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1435.024,
    "end": 1439.771,
    "text": "Is that what that is, the ascending prediction error?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1440.672,
    "end": 1450.065,
    "text": "I was trying to understand this Taylor series, and it seemed to be like a way of creating a set of predictions from a function.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1451.908,
    "end": 1456.414,
    "text": "So whenever I looked at this, I thought,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1456.394,
    "end": 1485.304,
    "text": " that's the taylor series am i wrong in that it it's a great insight and i think uh as with with many of these things it's like if you if you needed and want it to be you can connect those locations so for example here's figure 4.3 and um in the discrete time case we were making explicit predictions about the past present and future",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1486.128,
    "end": 1512.962,
    "text": " the continuous time case rather than making explicit predictions about the past present and future we have the x hidden state variable first derivative second derivative and so on on x so that is like the taylor series coefficients now one could propose what if what this cortical column was doing was x",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1515.372,
    "end": 1517.215,
    "text": " So it is getting sensory input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1517.235,
    "end": 1520.641,
    "text": "This is going to be raw sensory input coming in or just from some other location.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1521.342,
    "end": 1539.574,
    "text": "And it is going to be doing the role of inference about X. And then it is going to be constrained and constraining the rate of change in X. So let's assign the computational function of this middle unit to like the derivative of X and this one to the second derivative of X.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1540.921,
    "end": 1547.388,
    "text": " So this architecture could implement something like a Taylor series approximation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1549.05,
    "end": 1552.314,
    "text": "You can make it that way in Silico, and then you'll know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1553.475,
    "end": 1566.169,
    "text": "Or if you're talking about real brains, of course, they're not actually doing a Taylor series approximation on the coefficients, but computationally, they might be doing something akin to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1571.009,
    "end": 1593.743,
    "text": " so thank you for that yeah thank you so figure 5.1 highlighted how layer 5 of the cortex is going to be projecting out here's layer 5 projecting out to some of these motor and decision-making regions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1598.566,
    "end": 1602.992,
    "text": " So now we're going to treat the descending prediction from that cortical region.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1604.534,
    "end": 1610.942,
    "text": "We're just going to have it up here, starting from the BET cells in layer five of the motor cortex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1610.962,
    "end": 1611.844,
    "text": "So here's the BET cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1612.224,
    "end": 1613.586,
    "text": "Here's the motor cortex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1613.606,
    "end": 1618.753,
    "text": "Here's like the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1618.773,
    "end": 1625.822,
    "text": "Is sending a descending prediction to, in this case, a cross section of the spinal cord.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1628.873,
    "end": 1634.259,
    "text": " Sensory data is incoming to the spinal cord through proprioception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1636.062,
    "end": 1639.906,
    "text": "Afferent means away from the sensor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1640.647,
    "end": 1642.83,
    "text": "Efferent means to the sensor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1643.911,
    "end": 1658.188,
    "text": "So proprioceptive data are coming away from the sensor and in the actual histology of the spinal cord, descending predictions about proprioception",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1658.692,
    "end": 1669.747,
    "text": " how one is expected to feel, and then the incoming proprioceptive information are being juxtaposed in this discrepancy variable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1675.174,
    "end": 1687.551,
    "text": "Subtracting the predictions from the incoming data, so just a simple differencing, results in an error that says how much muscle contraction would be required to meet the prediction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1688.83,
    "end": 1699.52,
    "text": " So if the prediction is exactly what the incoming data are, the discrepancy is zero and no motor action is instigated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1702.222,
    "end": 1706.046,
    "text": "If it's non-zero, motor action would be instigated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1708.248,
    "end": 1715.935,
    "text": "Lower motor neurons then cause this muscle contraction or relaxation, ensuring that the resulting proprioceptive data match descending predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1718.227,
    "end": 1746.867,
    "text": " so we can have continuous this is a an opportunity and where continuous time models have been studied a lot because the incoming sensory data are continuous for example perceived weight or just different tactile sensations and then the outgoing behavior can also be framed in a continuous setting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1747.623,
    "end": 1768.18,
    "text": " like the elbow angle and so this is like a simple statistical architecture that situates motor action as resolving the discrepancy between predictions incoming and data incoming",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1779.398,
    "end": 1783.863,
    "text": " They move on to another region of the mammalian nervous system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1786.345,
    "end": 1791.931,
    "text": "Cortical layer five targets several other structures beyond the spinal cord.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1791.951,
    "end": 1796.856,
    "text": "Amongst these is the striatum with these regions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1798.098,
    "end": 1805.085,
    "text": "And a lot is known about that region in terms of gene expression and protein expression and neurophysiology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1806.297,
    "end": 1833.891,
    "text": " they're describing some of the empirical neurophysiology neuroanatomy talking about figure 5.4 it's going to come up several pages later though so just keep that in mind they're going to be talking about policy selection in the context of expected free energy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1835.204,
    "end": 1864.401,
    "text": " so here we didn't need to talk about planning at all and continuous time models are very adept at describing these situations where no explicit planning is required but still adaptive action can occur and we revisit that in chapter 8 on continuous time models but now we're going to look at like decision making kind of classical psychologist type categorical decision making",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1865.107,
    "end": 1894.236,
    "text": " especially thinking about explicit planning and then they're going to talk about how the architecture works but we'll talk about that when we see it dopamine tone is going to modulate the balance of the two sides of the figure and perturbations of dopamine are going to have some behavioral and cognitive consequences that are completely compatible with this model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1897.861,
    "end": 1925.86,
    "text": " just in general the anatomy of figure 5-4 is endorsed by evidence from both clinical pathology and cellular morphology so it's not the only map you can draw of the territory it isn't the territory itself but the map shown here is compatible with the complexity of the territory okay so now we're going to take those um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1927.325,
    "end": 1929.107,
    "text": " just like they started the section off on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1931.51,
    "end": 1936.536,
    "text": "Outputs of cortical layer five are going to target other areas, not just the spinal cord.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1941.181,
    "end": 1954.176,
    "text": "So we are going to have one of those cortical outputs sending into this brain region.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1957.463,
    "end": 1960.247,
    "text": " there are going to be two pathways illustrated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1960.708,
    "end": 1974.009,
    "text": "So one might be in effect or the other, and dopamine with this gamma variable is modulating the balance between the two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1975.691,
    "end": 1977.514,
    "text": "So it's kind of like a rudder",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1978.861,
    "end": 2008.648,
    "text": " computational role of dopamine is acting like a rudder with which one of these pathways is being deployed at a given time here are what those two pathways are and again this is going to be like a behavioral computational account but it's also consistent with the anatomy and with the clinical findings what's called the indirect pathway",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2010.468,
    "end": 2030.728,
    "text": " is one where the E vector, which is our habit, the affordances are encoded in E. So different opportunities for action are enumerated in E and the numbers in each of those cells refer to their prior probability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2031.849,
    "end": 2037.454,
    "text": "So if there's up, down, left, right, there's gonna be four elements in E.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2038.075,
    "end": 2042.682,
    "text": " And if it was 1, 1, 1, 1, it means all things are being equal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2044.304,
    "end": 2048.11,
    "text": "There's no prior bias towards the direction to take.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2049.372,
    "end": 2053.338,
    "text": "Conversely, in that up, down, left, right case, what if it were 100, 1, 1, 1?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2054.259,
    "end": 2059.107,
    "text": "That would be equivalent to saying the prior probability on going up is much higher.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2060.909,
    "end": 2065.416,
    "text": "And so in this indirect pathway, the E affordance vector",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2066.206,
    "end": 2095.133,
    "text": " is basically being passed on through to policy selection and so policy posterior pi is basically reflecting the policy prior so actions are being selected proportional to how they have been selected in the past the distributions of actions being selected in the indirect pathway",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2096.463,
    "end": 2121.846,
    "text": " is being drawn from the same distribution as habit we can contrast that with what's called by the neurophysiologist the direct pathway here we see that same kind of input coming in but rather than passing e on to pi we have g so g",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2129.403,
    "end": 2153.706,
    "text": " um is expected free energy functional so it's equation 2.6 and there's other representations and what g is doing is taking in the e which is like not shown but it does come into play so this is not exhaustively showing every variable just trying to only highlight the differences between them really",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2153.787,
    "end": 2180.976,
    "text": " g sharpens the action prior into an action posterior so that is updating the policy prior into the posterior through expected free energy how does expected free energy sharpen or modify the action prior into the action posterior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2181.175,
    "end": 2185.962,
    "text": " it reweights policies according to their expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2188.446,
    "end": 2189.728,
    "text": "What is expected free energy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2195.316,
    "end": 2196.137,
    "text": "It's equation 2.6.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2196.157,
    "end": 2208.195,
    "text": "So there's different decompositions, no one of which is simply like how it is, but policies are going to be updated",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2208.884,
    "end": 2228.175,
    "text": " in becoming to their posterior likelihood from which actions are actually sampled from and they're going to be sharpened or updated according to according to this top line the pragmatic value and the information gain of different policies michael",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2229.556,
    "end": 2230.597,
    "text": " Yeah, one question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2230.657,
    "end": 2242.968,
    "text": "So this posterior is still an expected posterior, and we also have in the variational free energy another kind of posterior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2243.309,
    "end": 2244.47,
    "text": "Is that true?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2246.171,
    "end": 2258.803,
    "text": "Every variable in Bayesian statistics that's undergoing updating can be described as having a prior, and then data comes in, and then there's the posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2259.526,
    "end": 2270.959,
    "text": " So here in particular, we're talking about the prior and the posterior on action policies, but also we talk about priors and posteriors for other kinds of variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2272.541,
    "end": 2285.095,
    "text": "Here, the focus is how descending information from the cerebral cortex shapes policy selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2286.458,
    "end": 2304.479,
    "text": " with a kind of neurophysiological hypothesis, not total expert, that habit is encoded or represented within this brain region, but cortical inputs shift the balance towards the direct pathway.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2305.24,
    "end": 2315.352,
    "text": "So this is where we see like deliberative decision-making because we end up sharpening policies according to their,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2315.72,
    "end": 2316.581,
    "text": " expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2317.002,
    "end": 2325.454,
    "text": "So let's think about like the famous marshmallow example, where marshmallow is placed on the table and someone can be taking it or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2326.296,
    "end": 2328.619,
    "text": "And they're told about what it is or isn't or anything like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2329.44,
    "end": 2336.611,
    "text": "So if somebody had a habit of not taking the marshmallow, then this pathway would lead them to not take it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2336.631,
    "end": 2338.995,
    "text": "If they had a habit of taking it, it would lead them to taking it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2341.118,
    "end": 2343.381,
    "text": "In this case, in the direct pathway,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2344.407,
    "end": 2349.192,
    "text": " policies would be evaluated according to their epistemic and pragmatic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2350.233,
    "end": 2361.465,
    "text": "So in a model where pragmatic value was sugar and there was a preference for sugar, then policy selection would lead to the taking of the marshmallow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2361.485,
    "end": 2373.638,
    "text": "If pragmatic value in that model were being defined as like conformity to the rules, then that conformity would be realized by not taking the marshmallow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2375.744,
    "end": 2393.365,
    "text": " i know it's kind of like hard because we're talking on one hand about actual neurophysiology and behavioral patterns but on the other hand about these variables but they're um being juxtaposed here to to show how it really does come into play in empirical modeling yes michael",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2395.893,
    "end": 2397.975,
    "text": " But all this is a planning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2397.995,
    "end": 2401.82,
    "text": "This is not based on an observation at that moment, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2402.26,
    "end": 2406.886,
    "text": "And how does surprise come in there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2406.906,
    "end": 2416.997,
    "text": "So surprise, how can we also expect surprise and take this into account in this expected free energy?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2421.382,
    "end": 2424.786,
    "text": "So this is showing just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2425.998,
    "end": 2446.352,
    "text": " a few distilled aspects of this graph this is not the full model observations are coming in and so in that sense surprise being about observations it could be understood to be happening here it's just not being like diagrammed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2451.293,
    "end": 2455.037,
    "text": " Yana, what happens when there are more options than a no-nutrient stimulant?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2455.077,
    "end": 2462.063,
    "text": "Yes, it always... That's where we get into the figure 9.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2462.204,
    "end": 2468.47,
    "text": "Not to look ahead, but depending on how the context is set up for the experiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2469.07,
    "end": 2470.311,
    "text": "Was it a two-choice experiment?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2470.371,
    "end": 2471.633,
    "text": "Was it a three-choice experiment?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2472.814,
    "end": 2477.098,
    "text": "And then that is the ethologist's challenge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2478.158,
    "end": 2493.012,
    "text": " to develop the as if view from the inside the cognitive model of the subject parameterized by their objective behavior in this setting not the only way to use these models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2502.982,
    "end": 2527.639,
    "text": " here they uh point to how certain dopamine signals that famously incredibly famously look like reward prediction errors so one model of dopamine was like dopamine is the reward molecule and this schultz 1997 paper was like wait a minute",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2527.805,
    "end": 2532.41,
    "text": " Yes, when more is received than expected, there's a dopamine spike.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2532.77,
    "end": 2537.095,
    "text": "And that was the pattern that people were associating with reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2537.656,
    "end": 2541.8,
    "text": "But if it's the exact amount that was expected, there's no dopamine spike.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2542.581,
    "end": 2546.365,
    "text": "And if it's less than expected, but still a reward, there's like another spike.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2547.746,
    "end": 2549.068,
    "text": "And so that was like, wait a minute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2549.088,
    "end": 2552.091,
    "text": "So it's not just like a thermometer for reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2552.611,
    "end": 2557.737,
    "text": " maybe dopamine is doing something like tracking prediction errors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2559.419,
    "end": 2574.157,
    "text": "So this is kind of like a proto Bayesian brain, proto predictive coding, empirical find it from the dopamine neurophysiology that we now have like much, much more resolution on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2575.418,
    "end": 2579.563,
    "text": "And so active inference provides a specific alternative explanation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2582.075,
    "end": 2588.022,
    "text": " to these phenomena where we don't need to make all these exceptions to a reward-based model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2588.683,
    "end": 2591.206,
    "text": "Well, it's dopamine signaling reward, but then also it does that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2591.326,
    "end": 2592.608,
    "text": "And also, I don't know why it does this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2595.271,
    "end": 2602.339,
    "text": "We can have a unified perspective with active inference on empirical data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2603.801,
    "end": 2609.668,
    "text": "Here, they're going to point to the idea that specific hypotheses can be formed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2616.044,
    "end": 2643.267,
    "text": " another reason to use active inference modeling for these kinds of cognitive or i mean ultimately neurophysiological settings is that there can be non-invasive measurement of precision parameters and that's called computational phenotyping and ryan smith and others have done a lot of work on that table 5.1 is going to list some of the important neurotransmitters",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2644.208,
    "end": 2656.257,
    "text": " And then even though neurotransmitters do different things in different settings and they're not saying otherwise, they're going to kind of broadly associate it with a given computational function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2658.061,
    "end": 2662.572,
    "text": "So they interact and there's neuropeptides and there's all this other stuff happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2662.872,
    "end": 2688.323,
    "text": " but broadly here are a bunch of lines of evidence that support an understanding of that neurotransmitter associated with precision acting on these things thanks for um sharing those yana it reminds me of this um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2692.083,
    "end": 2718.816,
    "text": " 2016 paper they gave ants a choice between um sugar water and um some dopamine drug maybe morphine yeah morphine and they like showed that they could taper down the sugar and the morphine and change a few different things so that um there was like a persistent choice to go to the morphine",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2721.58,
    "end": 2724.884,
    "text": " So, I mean, yes, many, many interesting things to explore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2729.089,
    "end": 2743.086,
    "text": "But just to conclude on this part from above, computational phenotyping basically means probing a generative model, reducing our uncertainty about a generative model through peripheral measurements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2744.107,
    "end": 2749.393,
    "text": "So for example, pupil diameter and eye movements",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2750.234,
    "end": 2775.533,
    "text": " contain a lot of information on somebody's arousal and attention and so you don't need to have like an implantable neurotech per se you could use these non-invasive measurements and previously understood relationships like between pupil size and noradrenaline so that you could actually reduce your uncertainty about noradrenaline levels just by looking at the pupil",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2781.638,
    "end": 2809.637,
    "text": " they talk about Hebbian plasticity and different statistical models 5.6 continuous and discrete hierarchies this is also um a topic that's um treated a lot more extensively in live stream 46. active inference models do not contradict folks psychology",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2811.743,
    "end": 2830.375,
    "text": " but they highlight a move from continuous representations at low levels of a neural hierarchy, for example, continuous sensory input, to categorical variables at higher levels, especially associated with semantics, identification, and decision-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2833.74,
    "end": 2837.667,
    "text": "So we're able to hold categorical beliefs",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2837.832,
    "end": 2863.367,
    "text": " and interface with continuously varying sensory receptors and effectors like muscle length or visual features that is just kind of brought up in these two short paragraphs in 5.6 and then in figure 8.6 this is an example of what the generative model looks like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2864.512,
    "end": 2874.544,
    "text": " So at the higher level, there's a missing line here, but at the higher level, we have a discrete time generative model, partially observable Markov decision process, POMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2874.564,
    "end": 2874.985,
    "text": "How do we know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2875.565,
    "end": 2878.809,
    "text": "Because it has the tau minus one, tau, tau plus one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2879.791,
    "end": 2883.956,
    "text": "So this is making explicit predictions about the past, present, and future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2884.757,
    "end": 2889.102,
    "text": "And in this case, it's also making categorical inferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2889.554,
    "end": 2895.679,
    "text": " So is it A or B or A and B, because those letters are also used here, but is it raining or is it sunny?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2896.72,
    "end": 2902.846,
    "text": "And we're just going to have a categorical difference between those two and have that estimate happening past, present and future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2903.786,
    "end": 2908.531,
    "text": "But then at each time step, there's a continuous time model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2909.611,
    "end": 2915.597,
    "text": "And so here we can recognize the continuous time model because we see that X, X prime, X double prime.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2917.398,
    "end": 2919.46,
    "text": "And so we have like this big rake,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2920.267,
    "end": 2947.86,
    "text": " big E pointing down and then here's a smaller one so it's kind of like figure 4.3 here's discrete time model E pointing down continuous time model E pointing down and then those are going to be grafted together so we have a higher order slower discrete time model and then a faster continuous time model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2949.393,
    "end": 2973.122,
    "text": " this could reflect and this is what they discuss in um livestream 46 with um alex keifer ryan smith and maxwell ramsted they discuss how decision making like should i go to the baker or to the barber is occurring in a discreet like way in this decision making model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2973.473,
    "end": 2982.324,
    "text": " but then the implementation of the decision-making model is happening in a continuous time model, which they call motor active inference, MAI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2986.309,
    "end": 2995.38,
    "text": "So the good thing about figure 4.3 is these are enormously flexible methods",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2996.39,
    "end": 2999.916,
    "text": " This is not like the one and only way an active inference model looks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3000.497,
    "end": 3004.624,
    "text": "It's really almost bewilderingly the opposite of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3005.906,
    "end": 3008.05,
    "text": "This isn't like the zoo of what's out there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3008.891,
    "end": 3014.08,
    "text": "These are showing some of the structural possibilities for cognitive modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3016.324,
    "end": 3021.773,
    "text": "And there are many possibilities and there's many ways to model the same phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3025.516,
    "end": 3046.242,
    "text": " um yana asked how is the continuous hierarchy applied well you could add more information but one could make a hierarchical model where like the higher level was continuous and the output of a given like the y here we could graft another continuous time model right here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3049.512,
    "end": 3074.068,
    "text": " so these are like our our Lego kits these are a few Lego constructions that people have made that typify minimal skeletons of cognitive models but what's really important is that the cognitive models that we build are going to have tractable ways to do inference on them because of message passing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3077.693,
    "end": 3105.861,
    "text": " then they closed the chapter with this summary visualization so it's the three systems that we learned about in the chapter which is that cortical column the balance between the indirect and the direct pathways of policy selection in the basal ganglia midbrain and the action selection in that continuous time model happening via the spinal cord discrepancy detection",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3107.309,
    "end": 3115.297,
    "text": " And so this is kind of reflective and compatible with the actual anatomical connectivity of the body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3115.738,
    "end": 3122.965,
    "text": "So it's not like proposing a telepathic link between some cell in the brain and like the motor unit in the arm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3124.126,
    "end": 3128.191,
    "text": "So it's compatible with the constraints that exist in the body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3130.073,
    "end": 3135.358,
    "text": "It explains and predicts different phenomena that are observed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3136.958,
    "end": 3166.797,
    "text": " and those explanations come not from just trivial well if two things that are touching are influenced then one influences the other but rather with actually these statistical models that even help us understand the progression or different kinds of interventions in different conditions which is where these models have been used most so that's the end of that chapter five but they kind of close with um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3167.89,
    "end": 3194.522,
    "text": " a reminder that like neuroscience is a work in progress and um there are so many open questions from the super cellular level like where are the glia where's the immuno aspect to different kinds of everything they're just picking three examples",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3194.738,
    "end": 3216.072,
    "text": " have been studied in previous papers by these authors and showing how alone and in combination we can use these kinds of models so yana asked so this is how sensory experiences can be modeled broadly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3217.587,
    "end": 3222.233,
    "text": " This could help us make sense of sensory experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3222.774,
    "end": 3227.981,
    "text": "This isn't like the one and only way to model sensory experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3228.001,
    "end": 3242.7,
    "text": "This is like one circuit board statistical model that can help with understanding how incoming proprioception results in outgoing action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3246.528,
    "end": 3272.417,
    "text": " so it can be used in service of understanding sensory experience but this is not the the final model on sensory experience I hope that that's clear there can be other compositions yes so any other",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3273.882,
    "end": 3277.127,
    "text": " Thoughts or comments on this first pass through five?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3277.427,
    "end": 3277.647,
    "text": "Michael?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3280.712,
    "end": 3289.925,
    "text": "Yeah, but in this figure 5.5 that you just showed, still the observation, the sensation is actually missing there, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3290.766,
    "end": 3293.129,
    "text": "So we have action, but not the observation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3294.371,
    "end": 3301.982,
    "text": "Here, Y is the proprioceptive input, but other kinds like visual input is not shown here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3304.612,
    "end": 3315.228,
    "text": " But that speaks to the composability of these models is like we could have an auditory stream and a visual stream and a proprioceptive stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3316.009,
    "end": 3321.096,
    "text": "And we can do model comparison and we can develop models that use any mixtures of those.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3322.518,
    "end": 3331.952,
    "text": "And on given computational hardware for a given dataset, for a given setting, for a given client, one of those models might be more useful than the other for you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3339.88,
    "end": 3364.116,
    "text": " okay thank you yeah it's a fun chapter and i it's definitely a context switch because chapter four just goes so hard with the technical details and then 5.3 is really like about our bodies but in that contrast there's been a lot of great discussion so um next week we'll return for the second discussion on five",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3365.328,
    "end": 3368.83,
    "text": " please feel free to ask your questions in the meanwhile.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3369.192,
    "end": 3370.662,
    "text": "So thank you, everybody.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3371.205,
    "end": 3372.03,
    "text": "See you next time.",
    "speaker": "SPEAKER_00"
  }
]