[
  {
    "start": 8.066,
    "end": 9.288,
    "text": " Hello and welcome everyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 10.27,
    "end": 18.986,
    "text": "It's December 8th, 2023, and we're here in 2023 quarterly roundtable number four at the Active Inference Institute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 20.325,
    "end": 20.866,
    "text": " Let us do it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 21.947,
    "end": 23.328,
    "text": "Welcome to the ACT-INF Institute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 23.828,
    "end": 29.393,
    "text": "We're a participatory online institute that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 29.894,
    "end": 31.515,
    "text": "You can find us at links on this slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 32.536,
    "end": 37.641,
    "text": "This is a recorded and an archived livestream, so please provide us with feedback so we can improve our work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 38.422,
    "end": 42.445,
    "text": "All backgrounds and perspectives are welcome, and we'll follow video etiquette for livestream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 44.082,
    "end": 72.283,
    "text": " today in the quarterly roundtable that closes 23 we'll go over first the institute scale then the organizational unit scale with eduactive and reinference and finally close with some thoughts on 24. so before we go any further alex and blue do either of you want to say hi or share anything or just give any overall thoughts that you don't see coming up later on",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 74.662,
    "end": 80.744,
    "text": " Yeah, I mean, just that the year was just so epic and really like we're still climbing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 80.944,
    "end": 84.726,
    "text": "We're still in the exponential growth phase of our colony.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 85.386,
    "end": 93.869,
    "text": "So it's been amazing and awesome to work with you guys and the Institute and just watch it grow and develop and all the new things that have bubbled up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 93.909,
    "end": 94.469,
    "text": "It's been awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 95.93,
    "end": 96.45,
    "text": "Thank you, Lou.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 96.71,
    "end": 96.89,
    "text": "Alex?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 99.488,
    "end": 118.539,
    "text": " Yeah, maybe some idea that from current position we are seeing and considering like another scale of ecosystem scale and like more broad field, more and more people, educational institutions and startups.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 118.879,
    "end": 124.362,
    "text": "Actually last time everything is developing, evolving and we are in a good place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 125.765,
    "end": 126.145,
    "text": " Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 126.666,
    "end": 126.906,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 127.087,
    "end": 132.973,
    "text": "So either of you, please just raise your hand if you want to add anything on a slide or we'll move on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 134.075,
    "end": 137.939,
    "text": "So first to some updates at the organizational scale.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 139.153,
    "end": 157.158,
    "text": " it was just in august of this year when with many co-authors we brought together this document on the active inference institute and the ecosystem and figure one is still operative and totally in effect we'll be talking more about that as we go",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 158.103,
    "end": 167.647,
    "text": " But during this year, we did reach this milestone or this checkpoint of being able to even assemble the team and the work this way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 168.228,
    "end": 175.531,
    "text": "So this was a big milestone for us and also gives us something like a map for the next phase.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 177.165,
    "end": 188.254,
    "text": " I'd like to thank our first cohort of the board of directors, Ralph Kaufman, John Klippinger, myself, Dean Tickles, Blue, Knight, and Mike Smith.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 189.134,
    "end": 190.095,
    "text": "Great work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 190.776,
    "end": 201.003,
    "text": "As well as to the first cohort of officers, us here, and the second cohort of the scientific advisory board listed here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 201.824,
    "end": 220.974,
    "text": " also just a broader and grander and more diffusive thanks to everybody who's engaging if you're listening to it you are so it wouldn't be the way it is without everything being the way it is so it's been a great year and we're really excited for what's to come",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 223.188,
    "end": 230.273,
    "text": " If you're interested, up until December 15th, we will be accepting applications for the Scientific Advisory Board.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 230.774,
    "end": 232.175,
    "text": "It's not an active inference test.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 232.735,
    "end": 243.003,
    "text": "It's about people who are beginner to expert in active inference, who are looking to make a contribution to the Institute in this scientific and advisory capacity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 243.743,
    "end": 260.81,
    "text": " it would be awesome to see an engaged diverse and global group as during 2024 we expect to bring the sab through on from where it was to how it will be next and that's going to be very exciting",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 261.61,
    "end": 281.546,
    "text": " differentiating different channels of participating an sab member is not just somebody who is joining a textbook group or not just somebody who's facilitating a project so what is it that differentiates that that's what we want to explore if you want to be part of that work in this phase then go to the website here and check for more information",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 283.103,
    "end": 295.951,
    "text": " about our non-profit status well last roundtable we updated that we had submitted our form 1023 to the usa irs so our tax exempt status as a 501c3 is pending",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 298.817,
    "end": 327.613,
    "text": " the last few weeks we've set up a bank account so we now can actually receive fiat financial donations if you're interested in just spontaneously feeling like you'd like to donate right now reach out otherwise we'll be developing and releasing more information on our philanthropic development during the year and this is a special call for anybody who has experience or networks or desire or feels like they have capacity",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 328.473,
    "end": 333.757,
    "text": " to contribute to a kind of fundraising program in some way, get in touch.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 333.777,
    "end": 335.238,
    "text": "This is the right time to do it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 337.039,
    "end": 342.564,
    "text": "About institute scale affordances, we continued with our volunteering and internship programs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 343.304,
    "end": 348.588,
    "text": "Volunteering and engaging with projects is going to be well developed in 2024.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 348.648,
    "end": 349.789,
    "text": "We'll come back to that later.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 350.95,
    "end": 351.87,
    "text": "About the internship,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 352.659,
    "end": 366.963,
    "text": " We had overall during 2023, about 30 interns who were active to different extents and six that have successfully completed and a handful that are continuing on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 367.623,
    "end": 370.044,
    "text": "The internship's been truly amazing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 370.104,
    "end": 376.986,
    "text": "I could say many, many things about the wonderful and unique work that people did.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 378.743,
    "end": 405.352,
    "text": " it's been some of the finest and most fun work about the broader information environment and our footprints and pheromone distribution there here's just some numbers from different social media platforms and different channels any more institute scale updates from either of you or we'll go on to the organizational units",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 409.784,
    "end": 415.102,
    "text": " Okay, on EduActive, the organizational unit with a focus on education.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 416.329,
    "end": 445.569,
    "text": " continued activity in the active textbook group we completed cohort four so great work to everybody who stuck on through and joined in throughout all the videos are available for all the completed cohorts cohort five again a very creative and inspiring and ambitious group of participants who got through chapters one through five over the previous months",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 446.529,
    "end": 454.055,
    "text": " They'll be heading into part two in 2024, and in 2024, we'll release more information on this soon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 454.555,
    "end": 472.248,
    "text": "It'll be really exciting to continue the types of value-adding epistemic services that we've templated over the previous one and a half years in the textbook group related to the integration with ontology and math learning, generative AI, and so on, and also broach out into the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 473.573,
    "end": 478.702,
    "text": " more groups different artifacts and also non-english languages blue",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 482.293,
    "end": 508.326,
    "text": " yeah i just wanted to add um that this is also an open invitation for people who have experience would like to learn more would like to scaffold various educational components related to active inference or any of the foundational skills like please get in touch with us or if you have ideas of a course you would like to see how can we make it happen together um i really would just like to hear from the broader community with what what they want and need so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 509.855,
    "end": 510.455,
    "text": " Thank you, Blue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 511.596,
    "end": 516.761,
    "text": "As with active inference, two ways to resolve the differential, change your mind or change the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 517.321,
    "end": 531.072,
    "text": "If you want a translation of this into that or a more accessible introduction to this or that, changing the mind is just coming to terms with the fact it doesn't exist and resolving the differential that way or taking the action to do it if it's within your capacities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 531.673,
    "end": 534.736,
    "text": "And so hopefully we have a setting where both those can happen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 535.076,
    "end": 535.236,
    "text": "Blue?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 537.088,
    "end": 538.749,
    "text": " Oh, still raised on my side, but great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 541.67,
    "end": 544.771,
    "text": "This year we completed two courses.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 545.491,
    "end": 548.732,
    "text": "We had zero completed at the end of last year.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 549.132,
    "end": 552.574,
    "text": "And so that was a major component of our year in works.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 552.614,
    "end": 561.177,
    "text": "And just in the previous months, there was the completion of the course led by Chris Fields, Physics as Information Processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 562.975,
    "end": 569.216,
    "text": " It was a truly unique and very groundbreaking course and body of work presented.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 570.016,
    "end": 588.38,
    "text": "Some of the next steps here are to curate and publish the 2023 proceedings as an open source artifact, and then consider where we're at with future learning cohorts and project-based work in quantum active inference, free energy principle, and a lot of other areas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 590.154,
    "end": 593.456,
    "text": " Anyone want to add anything more on the physics course?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 597.078,
    "end": 607.763,
    "text": "And the second course that was completed over the last few months was Constructing Cultural Landscapes, Active Inference for the Social Sciences with Avel, Ben, Mal, Lorena, and myself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 608.523,
    "end": 611.625,
    "text": "This was another fun journey.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 614.106,
    "end": 641.768,
    "text": " similar next steps in terms of publishing the transcripts and the proceedings and similarly considering what people are interested in doing and engaging with about active inference in the social sciences setting a topic that many people would i think love to continue working in so don't be shy if you want to continue that work outside of the courses",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 643.032,
    "end": 649.276,
    "text": " Here's the live streams that we had since round table three on September 29th, 2023.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 650.597,
    "end": 653.719,
    "text": "We completed the physics and social sciences courses as mentioned.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 654.46,
    "end": 656.881,
    "text": "We had an org stream with Anna Marie Swan.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 657.722,
    "end": 665.727,
    "text": "We had two paper-based live stream series with a dot zero background and context and a dot one and a dot two with authors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 666.348,
    "end": 672.512,
    "text": "And that was live stream 55 with Magnus Kudal on the realizing synthetic active inference agents,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 673.092,
    "end": 691.065,
    "text": " message passing work and live stream 56 with blue and with alexander arurbia on the cognitive modeling and mortal computation both were just incredible rich epistemic resources and we had 10 guest streams over that time",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 691.986,
    "end": 708.683,
    "text": " covering topics ranging from ai safety and security thermodynamic ai world models neuro linguistics philosophy symbology architecture really fun panel of guest streams and we",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 710.936,
    "end": 724.374,
    "text": " plan to do an end of december review stream possibly formatted as a comedy so whether you think that you'd like to joke or just laugh let us know if you're interested in that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 725.768,
    "end": 739.499,
    "text": " Also, we introduced a new series, which was the Active Inference Insights podcast series that was led by Darius Parvizi-Wayne and with Blue facilitating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 740.18,
    "end": 747.206,
    "text": "This was an informal, insightful, and inspirational conversational setting, at least as I saw it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 748.107,
    "end": 750.449,
    "text": "The four that have already been introduced",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 751.169,
    "end": 773.302,
    "text": " lined up or delivered were number one with carl friston two with mal abarasin insights three with john verveke just premiered yesterday and next week in s hippolito in insights four and many many more to come so not not to roast darius here but i think the insights are loading as carl is speaking blue",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 776.136,
    "end": 783.639,
    "text": " Yeah, this has been awesome, and just a big shout-out to Darius, who is super motivated and really pushing hard on this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 784.42,
    "end": 790.783,
    "text": "Right now, this is up on YouTube, and our episodes are coming out biweekly as just an audio podcast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 791.283,
    "end": 801.867,
    "text": "Right now on Spotify, Amazon Music, we're hoping to load up on Google and Apple Podcasts soon, so it just takes a little time for the stamp of approval to come through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 802.688,
    "end": 802.888,
    "text": "Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 804.139,
    "end": 825.553,
    "text": " And following all audiovisual production, we pass off the work to the journal, where we are with the work of Alex, Holly, Dave, and others are working on the continuous deployment and development of livestream and AV transcription, curation, and publication.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 826.794,
    "end": 830.096,
    "text": "This is a great infrastructural project, and so...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 831.678,
    "end": 838.341,
    "text": " it continues to release curated transcripts which promote the accessibility of these streams.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 838.501,
    "end": 843.604,
    "text": "Otherwise, it can feel very ephemeral with the audio content or hard to search through or hard to parse.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 843.684,
    "end": 854.089,
    "text": "But by getting things into a plain text format, we're going to be able to do incredible things with translations, captions, accessibility, language models, and more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 856.35,
    "end": 858.751,
    "text": "Those are the main pieces from EduActive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 860.166,
    "end": 863.328,
    "text": " In re-inference, we have a little bit less to say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 863.388,
    "end": 866.551,
    "text": "We have the continuation of the works that have been happening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 867.331,
    "end": 875.257,
    "text": "And there was a blizzard of research papers coming out all over the place, including with many institute participants.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 876.038,
    "end": 882.723,
    "text": "And one of our projects in 24 on knowledge engineering will be how to effectively curate",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 884.008,
    "end": 901.756,
    "text": " the research that is coming out as well as hosting research at the Institute so that we can have a summary and be able to come back to you for a future round table and just have a nice grid or a list of what works came out across different fields, across different topics, different languages, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 902.797,
    "end": 903.077,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 904.197,
    "end": 906.979,
    "text": "Onto the fun of where we go in 24.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 909.102,
    "end": 931.233,
    "text": " so Alex and blue I'll look forward to your thoughts as we continue here so first just speaking to the Institute scale of where we're going in 2024. here we have the figure one from our ecosystem paper and some versions and continuations are shown here",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 933.214,
    "end": 941.825,
    "text": " In 2024, we are going to have the second cohorts of our board of directors, second cohorts of our officers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 941.925,
    "end": 943.987,
    "text": "These will be all the same people continuing on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 944.988,
    "end": 952.017,
    "text": "We will have the third cohort of our scientific advisory board, as discussed a little bit earlier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 952.958,
    "end": 954.722,
    "text": " And we'll have two 1.0s.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 955.263,
    "end": 964.581,
    "text": "That's going to be the organizational unit lead, who's the blanket or the interface between the institute scale and the project scale.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 966.545,
    "end": 994.125,
    "text": " in the eduactive education unit and in the re-inference research unit and we're also due to the recently mentioned capacities be engaging in a philanthropic and grants application and hopefully receipt 1.0 so these are some of the upstairs changes at the Institute anything blue or Alex you want to add or just like that's exciting or",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 995.894,
    "end": 1021.731,
    "text": " anything here cool carrying on then to the project scale projects are where the work is these are where the rubbers are hitting the roads on the left is an image from chris fields's quantum active inference work and briefly we have a classical screen",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1023.294,
    "end": 1030.758,
    "text": " with two systems that are communicating across the holographic screen with a class of classically inscribed information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1030.998,
    "end": 1035.1,
    "text": "So we have Quantum Alice and Quantum Bob communicating through this interface.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1036.001,
    "end": 1036.101,
    "text": "So,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1037.153,
    "end": 1055.345,
    "text": " Aligned with our roots in active inference, system engineering, open science, and cognitive security, we will be implementing a multi-scale temporal architecture for project lifecycle management, bringing out pieces that we didn't have in 23 and 24, as we will hopefully for years and years to come.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1056.446,
    "end": 1061.97,
    "text": "We'll be considering projects as active or inactive at the quarterly scale.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1062.59,
    "end": 1066.633,
    "text": "Not unlike a class, but also not like a class, but also like a class.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1068.033,
    "end": 1075.996,
    "text": " Projects will be proposed for activity status by a facilitator who takes that responsibility and accountability before the quarter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1076.756,
    "end": 1078.697,
    "text": "This corresponds to preparation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1079.137,
    "end": 1081.258,
    "text": "So quantum measurement preparation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1082.998,
    "end": 1089.46,
    "text": " We'll provide a form that will ask about the structure, function, and impacts of the project.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1089.821,
    "end": 1092.822,
    "text": "How does this project contribute to the accessibility of active inference?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1093.342,
    "end": 1095.783,
    "text": "How does this project contribute to the rigor of active inference?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1096.403,
    "end": 1099.524,
    "text": "How does this project contribute to the applicability of active inference?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1100.004,
    "end": 1100.465,
    "text": "And so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1100.885,
    "end": 1102.885,
    "text": "Just some questions for people to start thinking about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1104.346,
    "end": 1111.889,
    "text": "We will review those proposals to determine if they're prepared to make that measurement at the Institute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1112.915,
    "end": 1121.305,
    "text": " Projects will convene and be carried out through the quarter based upon what resources they do or don't need from the Institute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1121.885,
    "end": 1125.57,
    "text": "Maybe a synchronous meeting link, maybe a Discord channel, maybe something else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1126.61,
    "end": 1129.792,
    "text": " And at the end of the quarter, there will be the measurement phase.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1130.312,
    "end": 1132.534,
    "text": "Prepare, measure, prepare, measure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1133.454,
    "end": 1141.279,
    "text": "And in that measurement, we'll be looking to hear back from the projects, asking something like the shadow of what we asked them to prepare for.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1141.759,
    "end": 1145.441,
    "text": "How did your work contribute to accessibility and so on?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1146.422,
    "end": 1147.863,
    "text": "That will constitute the measurement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1149.065,
    "end": 1162.667,
    "text": " Then we will curate those measurements for you all and present them at the round table and discuss them with the scientific advisory board where we'll then make assessments and reallocations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1164.048,
    "end": 1176.93,
    "text": "We hope to continue to scaffold the efficacy and efficiency of faster timescales of inference, attention, and learning on through slower lifelong and intergenerational scales.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1178.134,
    "end": 1180.895,
    "text": " This is just about the timing of the projects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1180.955,
    "end": 1188.539,
    "text": "So let's go into what those project types are or will be in 24, and then Blue or Alex, please feel free to make some comments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1189.379,
    "end": 1195.042,
    "text": "So we'll be separating things out into broadly three categories of projects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1195.983,
    "end": 1199.784,
    "text": "First category of project are gonna be institute core projects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1200.385,
    "end": 1206.288,
    "text": "These are infrastructural and open science ecosystem type services such as.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1207.208,
    "end": 1210.31,
    "text": " The Active Inference Ontology, translations and applications.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1211.27,
    "end": 1215.473,
    "text": "Production, audiovisual production with the live streams and podcasts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1216.493,
    "end": 1220.856,
    "text": "Active Inference Journal, re-production, transcriptions and translations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1221.952,
    "end": 1237.161,
    "text": " Digests, this will be grappling with a volume of publications and different formats in Active Inference and also developing some communications channels that people can opt into at, for example, different levels of technical depth and different languages.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1238.177,
    "end": 1256.352,
    "text": " active block inference, active inference generative modeling using CAD-CAD, knowledge engineering, supporting the digest work, educational activities, qualifications, course development groups, and so on, service and governance activities, and communication activities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1256.372,
    "end": 1258.374,
    "text": "So these are core institute projects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1259.155,
    "end": 1261.136,
    "text": "And by separating out those projects,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1262.017,
    "end": 1273.531,
    "text": " be able to have a little bit more clarity about this middle category which just tentatively are considered as institute hosted projects so it's a project hosted at the institute",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1275.171,
    "end": 1284.535,
    "text": " These projects are nested under either eduactive or re-inference, whether they are more of an educational project or research project.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1285.035,
    "end": 1288.377,
    "text": "And there's gonna be a few different categories or types within here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1289.097,
    "end": 1292.579,
    "text": "There'll be some topical and working group projects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1293.219,
    "end": 1294.92,
    "text": "So these are really the system of interest",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1295.86,
    "end": 1309.472,
    "text": " or disciplinary or subject matter type groups such as health robotics linguistics spatial web meta governance philosophy entomology and so on so if you're super excited about active inference and x",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1311.053,
    "end": 1335.035,
    "text": " this is that group join it if it's there and have fun and if it's not there again come to terms with the fact that it's not there or be the one who makes that preparation here also we'll have projects like Sanjeev Namjose's textbook in progress and reviewing as an educational hosted project as well as research projects so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1336.371,
    "end": 1343.635,
    "text": " If somebody wants to have their research project hosted at the Institute, then that's the space for that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1344.456,
    "end": 1355.722,
    "text": "And apart from the subject matter and system of interest type projects, we will open up an orthogonal dimension of projects for skills and practices.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1355.802,
    "end": 1364.407,
    "text": "So this might include, again, depending on who prepares for what, this could include computational modeling and programming",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1365.834,
    "end": 1368.557,
    "text": " beginners, experts, mixed levels, all the above.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1369.418,
    "end": 1385.936,
    "text": "Reproducibility, this was a really fun conversation with Andrew P where we talked about a reproducibility working group where a paper comes out, we investigate that paper, we really analyze it, understand it, run the code, replicate the figures,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1387.099,
    "end": 1390.381,
    "text": " That would help us understand how is active inference being applied?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1390.461,
    "end": 1393.503,
    "text": "What does it really look like to get to that paper being written?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1394.184,
    "end": 1397.506,
    "text": "And then we've basically de facto done a dot zero.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1397.766,
    "end": 1405.252,
    "text": "So at that point we could then contact the authors if we hadn't already have them for conversations on live streams or podcasts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1406.172,
    "end": 1410.715,
    "text": "Also skill and practice groups like Math Beginners and Math Advanced.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1411.736,
    "end": 1416.819,
    "text": " math, art, and creativity, and attention management, various other skills.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1418.02,
    "end": 1427.046,
    "text": "We will be sharing information through our newsletter channels and maybe with a short video and so on about how you can propose to lead a hosted project.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1428.697,
    "end": 1438.443,
    "text": " Following that, we will be providing information on how you could join those projects that will be either active in the core of the Institute or hosted in the Institute in 24.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1439.044,
    "end": 1440.365,
    "text": "And again, it's quarter by quarter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1440.925,
    "end": 1445.408,
    "text": "So if it's not the right quarter for you to begin in first quarter of 2024,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1446.969,
    "end": 1468.0,
    "text": " prepare for the second quarter if that's not right prepare for the third quarter but everyone can be involved in these projects whether or not they've proposed to lead them and hopefully this structure with a quarterly time frame will help make it clear who's leading a project what's the project about what is in or out and then there are the ecosystem projects",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1468.846,
    "end": 1474.792,
    "text": " everything happening in the Active Inference ecosystem, which goes way, way, way beyond the Institute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1475.473,
    "end": 1482.66,
    "text": "Here are all of the things that people are doing that aren't included in the core projects or hosted projects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1483.48,
    "end": 1488.765,
    "text": "And for projects in this space, whether it's your startup or your open science initiative,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1489.426,
    "end": 1501.718,
    "text": " we can support through hosting your participation and engagement in learning groups or with other resources that can be provided and exploring partnerships and collaborations and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1502.498,
    "end": 1509.946,
    "text": "So this structure for the projects in 2024 has been arising over the last several days.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1510.026,
    "end": 1513.189,
    "text": "It's just presented as a sketch and a direction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1514.54,
    "end": 1528.447,
    "text": " If you're watching this video in real-ish time, semi-sync time, then consider it and maybe you're interested to lead a project or maybe just see where this all goes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1529.328,
    "end": 1531.549,
    "text": "Blue or Alex, want to add anything on the projects?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1536.109,
    "end": 1560.898,
    "text": " Possibly yes, I want to add about that for now we have that basic nested structure and it's aligned with active inference approach, systems approach and using it we are ready for scaling activities and support them as organization",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1562.238,
    "end": 1571.5,
    "text": " And this kind of hosting projects for now all projects was initiated from Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1571.6,
    "end": 1582.102,
    "text": "Possibly next year we'll see more projects which are born in some other communities or somewhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1583.042,
    "end": 1591.284,
    "text": "But finally supported and hosted in Institute as some kind of platform and service for ecosystem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1593.615,
    "end": 1594.055,
    "text": " Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1594.075,
    "end": 1599.219,
    "text": "I think that those life cycles and those life histories will be really exciting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1600.1,
    "end": 1609.527,
    "text": "Like, started in a conversation, hosted and incubated in the Institute for these two quarters and then out and beyond.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1610.167,
    "end": 1615.491,
    "text": "Or part of it moved into a core infrastructural service functionality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1616.472,
    "end": 1618.834,
    "text": "Or any and all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1619.734,
    "end": 1622.917,
    "text": "Blue, any other thoughts on the projects?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1623.792,
    "end": 1624.832,
    "text": " It's all so exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1624.852,
    "end": 1626.072,
    "text": "Like, when can we start?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1626.092,
    "end": 1628.633,
    "text": "Where do I sign up?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1629.373,
    "end": 1629.633,
    "text": "I know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1629.733,
    "end": 1630.393,
    "text": "How do I sign up?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1630.733,
    "end": 1631.553,
    "text": "How can I get involved?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1636.334,
    "end": 1637.034,
    "text": "Just good stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1637.254,
    "end": 1637.634,
    "text": "Good stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1638.595,
    "end": 1639.155,
    "text": "Thank you, Blue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1639.475,
    "end": 1640.335,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1641.515,
    "end": 1651.917,
    "text": "We're just trying to summarize and have some concise fun here and recap and wish everyone a very restful end to this year and beginning to the next.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1654.099,
    "end": 1660.222,
    "text": " If anyone's watching live, please feel free to write any questions into the chat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1661.803,
    "end": 1666.165,
    "text": "The rest of this stream, I will give a brief closing address.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1667.165,
    "end": 1670.106,
    "text": "Then we'll look at any comments in the live chat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1670.547,
    "end": 1673.248,
    "text": "Then Alex and Blue, any other comments that you want to have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1674.033,
    "end": 1683.996,
    "text": " So to make a brief closing presidential address, to give the takeaway first, thank you for your attention and upcoming action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1684.636,
    "end": 1686.817,
    "text": "Let's be who and how we are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1687.717,
    "end": 1688.697,
    "text": "Can't do it any other way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1688.997,
    "end": 1690.258,
    "text": "Wouldn't want it any other way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1691.567,
    "end": 1701.051,
    "text": " This is just to give a little bit of some timeline as now we are completing our third year of activities in the Institute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1701.552,
    "end": 1715.338,
    "text": "And I just wanted to share a little bit about that timeline, not in an overly personal fashion, but in a way that hopefully provides some information to the kind of person who's 28 minutes and 35 seconds into this video.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1719.176,
    "end": 1724.719,
    "text": " 2020 was like the dot zero for the work that we're exploring here, the background and context.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1724.859,
    "end": 1727.38,
    "text": "This is when Alex and I met.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1727.52,
    "end": 1729.161,
    "text": "I had already known Blue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1729.962,
    "end": 1736.965,
    "text": "And in work with RJ and CogSec, we explored and researched the preset.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1737.165,
    "end": 1742.788,
    "text": "What does it mean to preset, especially in the context of remote teams and operational art?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1743.919,
    "end": 1747.98,
    "text": " We started Act-InfLab as it was then known in 2021.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1748.82,
    "end": 1767.565,
    "text": "We formed, stormed, normed, and performed a lab, and we saw the incipient structuring like an imaginal disc of EduActive and ReInference in their manifestations as .edu and .tools, more like subdomains of Act-InfLab.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1768.285,
    "end": 1771.566,
    "text": "And in CogSec, we worked on narrative information ecosystems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1772.668,
    "end": 1780.355,
    "text": " In 2022.22222222, we had the lab in a nutshell, in the sense of Hamlet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1781.116,
    "end": 1784.779,
    "text": "Like I could be bound in a lab and count myself a king of infinite space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1785.86,
    "end": 1792.306,
    "text": "And we left that nutshell, that acorn, and the lab transformed into an institute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1794.056,
    "end": 1808.564,
    "text": " We also had some structural morphological organizational development as our first scientific advisory board came into existence as an informal, informal, unconventional advisory board.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1809.464,
    "end": 1815.327,
    "text": "And in cognitive security, we worked on structuring the information comments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1815.347,
    "end": 1818.949,
    "text": "2023, our year is now coming towards a conclusion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1820.583,
    "end": 1831.629,
    "text": " Having become an institute during 2022, 2023 was something like addressing the question, now that we're an institute, what next?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1832.23,
    "end": 1841.815,
    "text": "Well, we had our first board of directors and officer cohorts that dove into BOLTS, business, operating, legal, technical, and social.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1842.896,
    "end": 1847.739,
    "text": "And we developed out the Eduactive and the BOLTS.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1849.15,
    "end": 1857.562,
    "text": " re-inference aspects of our work with a special focus on the EduActive, as this earlier presentation speaks to as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1858.544,
    "end": 1881.221,
    "text": " and on a more technological note we left behind active inference at gmail.com we still have the logins don't worry about it but we've moved things to the at active inference dot institute workspace so that's where we now have personal emails and so on so that's really a nice niche and information environment to build in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1882.85,
    "end": 1894.679,
    "text": " there were many unities as plural and minimum two as well as unities as plural and minimum four this year in the minimum two domain i would place",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1895.894,
    "end": 1902.937,
    "text": " one of our key artifacts, which was the institute and ecosystem as this agent niche enclosure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1903.837,
    "end": 1912.121,
    "text": "And we explored that in the third Applied Active Inference Symposium on enacting ecosystems of shared intelligence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1912.761,
    "end": 1917.323,
    "text": "That was a really fun participatory organizing experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1918.063,
    "end": 1924.066,
    "text": "And the panel and the conversations and the presentations were just incredible too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1925.731,
    "end": 1932.675,
    "text": " There were other Min2s and Min4s ranging from different topics and how they were brought together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1933.236,
    "end": 1941.241,
    "text": "For example, Dean's classic tetrad, active inference, abduction, category theory, and dissemination as identity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1942.282,
    "end": 1948.486,
    "text": "And there were some other Min2s and Min4s that anyone who wants to speak more about them can...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1949.306,
    "end": 1976.48,
    "text": " talk another day but i'll just leave them posted here and in our cog sec work we pursued and yesterday published the atlas specification for utilizing dynamic knowledge bases of pattern languages that are navigated through questions which brings us to 2024 who what why where when how from here at the end of 23 and into through beyond 24",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1979.994,
    "end": 1981.715,
    "text": " Where will you and we go from here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1988.039,
    "end": 1995.483,
    "text": "So any general comments or any other thoughts from Alex or Blue?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1995.603,
    "end": 1997.664,
    "text": "And then I'll look at any questions in the live chat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2000.025,
    "end": 2005.729,
    "text": "You know, as we learned somewhere in some stream or some course that the future is just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2006.77,
    "end": 2029.507,
    "text": " an echo of a memory so where will we go from here we really already went do you remember where you went or where you will go from here i can't say i do but i know what you're saying okay i'll ask alex please first and then i'll look to the live chat",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2031.826,
    "end": 2051.54,
    "text": " Yeah, maybe it wasn't so highlighted during this roundtable, but very important achievements on educational side and actually possibly the main change from the lab into institute that now we have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2053.762,
    "end": 2080.017,
    "text": " hundreds of people which are somehow learned something about active inference in different formats and now in physics that's actually great and that people definitely will share information share like epistemic status for active inference for hours and that's really great thank you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2081.837,
    "end": 2082.597,
    "text": " Thank you, Alex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2084.418,
    "end": 2085.639,
    "text": "Thank you, I agree with this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2087.139,
    "end": 2092.481,
    "text": "Okay, we'll have time for as many questions are in the live chat as people ask.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2093.022,
    "end": 2099.444,
    "text": "So first, Andrew, is the Active Inference Institute pursuing grants or funding?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2099.885,
    "end": 2104.426,
    "text": "If so, how is it prioritizing where it wants to apply monetary resources?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2105.667,
    "end": 2108.448,
    "text": "To the first question, are we pursuing grants or funding?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2109.128,
    "end": 2109.849,
    "text": "Yes, for both.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2110.874,
    "end": 2125.182,
    "text": " Our first major grant that we applied for was submitted in September of this year for the NSF POSE program, which was about pathways to sustainability for open source ecosystems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2126.36,
    "end": 2128.401,
    "text": " We don't know how that plays out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2128.942,
    "end": 2137.307,
    "text": "We close the year in a quantum uncertainty there, but yes, we do plan to continue pursuing grants of various kinds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2137.607,
    "end": 2142.531,
    "text": "We've also already been a collaborator in providing letters of support to other people",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2143.391,
    "end": 2171.473,
    "text": " in their grants and so we can have conversations with people who are wanting in their own country or in their own location to apply for a grant to them and for their broader impacts maybe they want to commit to organizing a project or to hosting some other kind of activity at the institute to make a win-win proposition for us all so yes about the funding and the private philanthropy angle we were not able to do that in 2023",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2173.373,
    "end": 2180.96,
    "text": " We will be doing that in 2024 now that we are set up with a bank account and submitted our form 1023 and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2181.42,
    "end": 2187.626,
    "text": "So yes, we hope to have any and all channels for monetary inflows.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2188.803,
    "end": 2210.537,
    "text": " grants and private philanthropy and then to the second question how are we prioritizing where we want to apply monetary resources that's a bigger question of course i can't give a complete answer but all of us are super active in diligence on the financial and all bolts processes so i hope we'll have an effective and efficient",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2211.337,
    "end": 2226.549,
    "text": " way to allocate our attention and other kinds of resources and we're gonna do it right blue um so just uh one of the major scaffolding infrastructure",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2227.412,
    "end": 2249.74,
    "text": " things that we're building in 24 flushing out in 24 is like our financial policies procedures investment procurement all of these things um and so that will be made clear as we go forward through this year um and then also prioritizing like where do you spend the money frequently when you're applying for grants like you're applying to spend the money in a certain way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2250.68,
    "end": 2258.987,
    "text": " And so, like, there are lots of projects that are, as we just saw on the list, that are scaffolded partly through or hosted by the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2259.087,
    "end": 2267.333,
    "text": "And, like, we are happy to also facilitate and scaffold the seeking of funding for these projects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2268.154,
    "end": 2271.857,
    "text": "So as we go through, like, we will prioritize the projects that have funding because they have funding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2272.297,
    "end": 2275.139,
    "text": "And we will help people get the funding if they want to do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2275.199,
    "end": 2279.683,
    "text": "Or we will scaffold that endeavor to be funded to the best of our ability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2281.391,
    "end": 2282.011,
    "text": " Thank you, Blue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2282.312,
    "end": 2283.172,
    "text": "Yes, indeed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2283.473,
    "end": 2294.001,
    "text": "If after some successful quarters of operation, a project wants to lead a grant application and it goes to them and they just need the letter of support, that's one kind of archetype.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2294.581,
    "end": 2305.029,
    "text": "Another method might be we identify a grant opportunity at the institute scale and then pass that down and say, which of these projects can we include at X amount?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2305.83,
    "end": 2310.553,
    "text": "And there will be stepways into active inference professionalism",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2311.454,
    "end": 2331.256,
    "text": " with and through the institute and with and through the ecosystem so many paths just be on the journey okay susan asks can you say more about developing the pattern language library which is atlas sure i'll just speak briefly to how it connects to active inference",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2332.372,
    "end": 2341.36,
    "text": " ATLAS is a flexible pattern language knowledge database structure that humans and other synthetic intelligences can navigate with questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2341.52,
    "end": 2346.104,
    "text": "It allows some really interesting ways to work with different kinds of information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2346.845,
    "end": 2359.495,
    "text": "Patterns, potentially all, but at the very least some, for example, cognitive patterns will have active inference implications and active inference specifications or representations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2360.461,
    "end": 2372.231,
    "text": " In that way, the composability of active inference models and the composability of patterns will be finding a new integrity between each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2372.632,
    "end": 2375.314,
    "text": "We'll have patterns about generative models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2375.474,
    "end": 2376.575,
    "text": "Oh, this is a nested model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2376.715,
    "end": 2378.036,
    "text": "This is a deep temporal model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2378.336,
    "end": 2380.078,
    "text": "This is sophisticated active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2380.398,
    "end": 2381.699,
    "text": "This is, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2382.3,
    "end": 2387.925,
    "text": "And then we'll use active inference for patterns that aren't necessarily active inference patterns.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2389.241,
    "end": 2397.773,
    "text": " overconfidence bias, and so on, and be able to develop motifs that will lead to some pretty new and exciting ways to work with information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2399.455,
    "end": 2400.397,
    "text": "Upcycle Club writes,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2402.0,
    "end": 2410.284,
    "text": " Is it possible to collaborate with other authors on joint research papers that arise and are related to the AI course taught by Chris Fields?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2411.024,
    "end": 2412.124,
    "text": "Yeah, great question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2412.324,
    "end": 2419.247,
    "text": "So first, just to address it generally, is it possible to collaborate with other authors on joint research papers?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2420.068,
    "end": 2424.77,
    "text": "Yes, within the limits of plausibility and consent and all of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2426.05,
    "end": 2427.491,
    "text": "Great, absolutely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2428.559,
    "end": 2451.575,
    "text": " about the physics as information course by chris fields yeah that is like absolutely what we would love to see happen and just to give an example of where that could go first off anyone who wants to continue their work in the active inference ecosystem leveraging what they learned in the physics information processing course please",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2452.987,
    "end": 2474.61,
    "text": " continue now if you'd like to potentially host that at the institute then when we have the form for proposing a project then it can be filled out i'd like to lead an exploratory research working group on this and this here's how i see some possibilities of how it might apply",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2475.461,
    "end": 2478.483,
    "text": " and how it might help active inference ecosystem in this way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2479.244,
    "end": 2482.446,
    "text": "It's going to be open science along these ways of thinking about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2483.027,
    "end": 2489.532,
    "text": "And here's what I'll need, a weekly video link, a Discord channel, or whatever it happens to be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2490.092,
    "end": 2495.076,
    "text": "And then, yes, we would love to have somebody lead the charge on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2497.057,
    "end": 2519.984,
    "text": " submit that form and then create that attractor so that people who want to participate in that research can then go there that group could then decide yeah we're gonna um summarize our notes and publish a pre-print at the end of every quarter so if you join along for 10 weeks of activity then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2521.431,
    "end": 2550.224,
    "text": " your co-author at the end of the quarter or the groups can do whatever they want they can choose to to structure things how they want and then just report on it in the measurements we'll talk about it with future use and other use on the round table return to it with a more comedic lens at the end of the year and hopefully this will be like a really productive and inclusive way to do science and have fun in our ecosystem",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2553.246,
    "end": 2557.227,
    "text": " If anyone else has a comment in live chat, just a few more seconds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2557.407,
    "end": 2561.049,
    "text": "Otherwise, Alex or Blue, what are your closing comments?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2574.753,
    "end": 2581.676,
    "text": "Just thanks everyone for your attention and work and continued persistence and study of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2582.87,
    "end": 2605.374,
    "text": " good it's a good field to operate within and beyond and the nice scaffold to have alex anything in closing as usual we are in the beginning of infinity so let's keep walking",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2607.742,
    "end": 2608.162,
    "text": " Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2608.623,
    "end": 2609.143,
    "text": "Great times.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2609.644,
    "end": 2613.668,
    "text": "Thank you also, everyone, for the comments in the live chat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2614.129,
    "end": 2616.331,
    "text": "Hope to see everybody in the Discord.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2616.451,
    "end": 2617.793,
    "text": "Just join the voice chat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2617.833,
    "end": 2621.837,
    "text": "Be the first one and scaffold it for somebody else to join in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2622.457,
    "end": 2624.46,
    "text": "Reach out on the edges.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2625.481,
    "end": 2626.962,
    "text": "Stay tuned for where we go in 24.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2627.122,
    "end": 2629.645,
    "text": "Acting for a surf.",
    "speaker": "SPEAKER_02"
  }
]