[
  {
    "start": 9.667,
    "end": 10.107,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10.608,
    "end": 10.928,
    "text": "Hello.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 11.709,
    "end": 12.41,
    "text": "Welcome everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 13.351,
    "end": 15.253,
    "text": "It's May 15th, 2025.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 15.514,
    "end": 17.716,
    "text": "This is ActiveInfoAnt Stream 14.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 17.876,
    "end": 22.501,
    "text": "And we're going to begin it as we do with a GitHub push.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 25.385,
    "end": 26.326,
    "text": "And we're going to go from there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.128,
    "end": 28.448,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.989,
    "end": 33.814,
    "text": "This stream is called generalized notation notation from plain text to triple play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 34.595,
    "end": 39.1,
    "text": "And before jumping into the background, want to give a little bit of the payload up front.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 39.62,
    "end": 42.965,
    "text": " Here's the simple structure of the repo and where we're headed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 43.606,
    "end": 51.377,
    "text": "All the source code is in SRC, all the documentation is in doc, and all the output from running main goes to output.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 51.397,
    "end": 53.039,
    "text": "So what is the output going to look like?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 53.64,
    "end": 55.603,
    "text": "Well, first, where does it start from and where is it going?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 56.144,
    "end": 65.277,
    "text": "What it starts from is looking like a markdown file with a controlled vocabulary describing state spaces for a given generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 65.758,
    "end": 67.18,
    "text": "And here's where we take that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 69.05,
    "end": 77.922,
    "text": " First, for each of those provided source files, GNN files, we get a bunch of visualizations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 77.942,
    "end": 88.357,
    "text": "So anyone who's worked with PyMDP or active inference models knows that figuring out state spaces and doing all kinds of work and transformations with state spaces can be challenging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 88.798,
    "end": 96.829,
    "text": "So one thing this does is it takes that generative model distinction as specified and visualizes it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 98.699,
    "end": 111.278,
    "text": " It exports the model into a variety of formats, JSON, text, XML, graphical, all these different kinds of outputs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 113.221,
    "end": 119.991,
    "text": "There's a initial processing report, essentially summarizing what kinds of files are being detected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 121.293,
    "end": 123.176,
    "text": "There are rendered simulations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 123.877,
    "end": 127.963,
    "text": "So here is a PyMDP script,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 128.973,
    "end": 145.118,
    "text": " that fills in, not perfectly functionally at this point, but I think more than enough to get the picture, a PyMDP script parameterized by the details of the state space of the source file.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 146.42,
    "end": 152.89,
    "text": "And where this is all going is to be able to cross-render into multiple implementation strategies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 153.471,
    "end": 156.516,
    "text": "So a stub method for going into RxInfer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 158.217,
    "end": 160.04,
    "text": " type checking is performed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 161.041,
    "end": 169.593,
    "text": "So that is checking the validity of the code and making sure that the source files are valid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 170.374,
    "end": 183.432,
    "text": "And this allows us to bring in not just security features, but also something that is often much desired for those running active inference models, which is the computational resource estimation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 183.732,
    "end": 208.98,
    "text": " So here we can look at the state space sizes and the different kinds of operations that are entailed for a given generative model and then get different kinds of assessments like what is the relative computational cost going to be or what is going to be the size for a given number of variables of storing that specific model on the RAM or on the hard drive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 213.044,
    "end": 220.652,
    "text": " LLMs are used at the end to, in this case, summarize a set of questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 221.893,
    "end": 230.641,
    "text": "So here are reports written with LLMs summarizing the states-based model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 235.807,
    "end": 240.351,
    "text": "The logs for improved tracking and coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 242.086,
    "end": 257.603,
    "text": " MCP is the Model Context Protocol, and we'll get into this a little bit more, but this is a very large file which concatenates all of the MCP methods which we're exposing, like Visualize GNN File.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 258.424,
    "end": 269.055,
    "text": "So this is something that you can run locally, or we can stand up, and we will stand up, MCP servers so that these kinds of services can be provided.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 270.773,
    "end": 272.075,
    "text": " Ontology processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 272.956,
    "end": 279.506,
    "text": "These are summaries of the ontology terms used and how they map onto different state spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 280.106,
    "end": 294.627,
    "text": "And this is really one of the key pieces of GNN, which is putting a little bit of space between, putting a flexible interface and gap between a given variable and its ontological annotation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 294.647,
    "end": 300.696,
    "text": "So commonly in looking at these generative models and cognitive modeling type scripts,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 300.862,
    "end": 313.74,
    "text": " you'll see the name of a variable like observation modality one or latency or whatever it happens to be some english language name of a variable",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 313.838,
    "end": 325.33,
    "text": " However, that can get into some issues because what if it's modality three, but then one of the other ones comes and goes, or how do you add modality four?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 326.031,
    "end": 333.619,
    "text": "Or it's the sense variable for one agent, but it's the action output from another agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 333.639,
    "end": 342.748,
    "text": "So in other words, you don't want to have the variable always welded to its ontological assertion because there can be multiple",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 343.42,
    "end": 372.567,
    "text": " english terms or roles for a given state space variable we're going to come back to that with cerebrum and also there can be different languages for localization and accessibility so there's a space between the variable state space and the assertion and what that looks like inside of the gnn file is a specific section that makes assertions about ontological meaning in that exact generative model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 372.665,
    "end": 381.519,
    "text": " So gone already, long, long, long gone are the days where debating whether the letter B means transition matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 382.24,
    "end": 388.93,
    "text": "Well, no, it's just a symbol that in a given generative model might be asserted to mean transition matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 391.454,
    "end": 394.639,
    "text": "Then those rendered scripts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 395.53,
    "end": 403.242,
    "text": " So we had the program synthesis of the PyMDP agent parameterized from the GNN file, and then we can actually execute those.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 404.484,
    "end": 414.859,
    "text": "And this one hit an error that you'd hit running PyMDP, and so did this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 415.941,
    "end": 420.087,
    "text": "But in previous versions, I've had it running, so it's just in and out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 420.235,
    "end": 435.973,
    "text": " all presented as open source work in progress and inserting the correct values into the stem and stub of a PyMDP script is totally doable and it will be coming when the time is right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 437.355,
    "end": 438.716,
    "text": "Then there are test reports.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 438.937,
    "end": 445.264,
    "text": "So this is just a test information from a test module.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 449.547,
    "end": 470.695,
    "text": " and overall a processing summary which has been improved and disimproved and all of that okay so that's where we get with the outputs how is this all gonna be happening let's pull back a second if anyone has any comments or questions please write them in the live chat um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 470.793,
    "end": 479.902,
    "text": " All this is open source at the GitHub repo, Active Inference Institute slash generalized notation, notation, no spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 481.683,
    "end": 500.361,
    "text": "I'm using the updated version of Cursor, 0.50.4, and the large language model for most of the augmented coding, five coding happening here is Gemini 2.5 Pro, the preview 0.5, 0.6, so just from a few days ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 500.712,
    "end": 511.942,
    "text": " Okay, we will briefly look at the source structure, get a first pass, pull back a little bit to the history of GNN, then re-enter into the source with people's comments and questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 512.544,
    "end": 515.953,
    "text": "So here's how source folder looks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 523.156,
    "end": 527.861,
    "text": " Okay, source folder has a main script.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 527.881,
    "end": 534.908,
    "text": "So when you want to replicate the entire process, you just go to SRC and run Python 3 main.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 535.909,
    "end": 539.712,
    "text": "So there's a single entry point that is going to look like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 540.974,
    "end": 551.644,
    "text": "It's gonna start, go through one, which is just confirming that it has the GNN payload, go into two,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 553.683,
    "end": 559.673,
    "text": " which is the setup phase that's gonna install the requirements, any other packages that you add into requirements.txt.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 562.398,
    "end": 566.525,
    "text": "It is going to go into three, which is the test suite.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 566.545,
    "end": 568.949,
    "text": "There's just a few tests right now, but you can add more tests.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 569.851,
    "end": 579.167,
    "text": "Four goes into the type checker suite, which has the type checking as well as the resource estimation methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 580.16,
    "end": 584.605,
    "text": " After four, it will head into five, the export module.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 584.825,
    "end": 592.934,
    "text": "And so the folders are not numbered, but the scripts are just to really confirm, here's the order that we're running these different modules in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 593.895,
    "end": 598.02,
    "text": "Five goes into the export, so you can flag different export modalities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 598.901,
    "end": 601.324,
    "text": "Six into the visualization methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 603.446,
    "end": 606.91,
    "text": "Seven is the MCP, the Model Context Protocol,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 607.818,
    "end": 609.96,
    "text": " section, which we'll go into more detail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 611.922,
    "end": 615.685,
    "text": "Eight, ontology terms, ontology analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 615.886,
    "end": 617.627,
    "text": "Nine is the rendering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 618.148,
    "end": 620.43,
    "text": "So that's like the setup of the simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 620.51,
    "end": 633.942,
    "text": "That's the transformation from the generic GNN form and parsed output into a rendered but not executed EG, PyMDP, RxInfer, NGC Learn, et cetera, et cetera, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 634.403,
    "end": 636.745,
    "text": "We'll build those adapters and they'll be really robust.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 638.53,
    "end": 642.176,
    "text": " Step 10 is running the simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 642.436,
    "end": 645.921,
    "text": "So actually this one, let's see if it came through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 645.962,
    "end": 654.555,
    "text": "This is looking like it actually did do the PyMDP simulations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 657.86,
    "end": 658.621,
    "text": "So let us see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 658.661,
    "end": 661.506,
    "text": "Slow computer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 661.926,
    "end": 662.407,
    "text": "There we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 663.949,
    "end": 666.934,
    "text": "So not exactly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 668.247,
    "end": 693.495,
    "text": " fully functional, but this is demonstrating that we can do program synthesis, controlled vocabulary program synthesis in an implementation agnostic fashion with static checking, render it into a given target implementation style like PyMDP, and then run that PyMDP method.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 694.724,
    "end": 706.134,
    "text": " and it looks like there still could be some errors in the simulation, but it is breaking on through to the other side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 706.835,
    "end": 707.356,
    "text": "That's 10.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 708.276,
    "end": 722.149,
    "text": "Then 11 runs the LLM section, which you can customize, and it's gonna go into this LLM processing, and that's where it's gonna do things like summarize",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 722.99,
    "end": 735.505,
    "text": " the GNN file or do a set of questions that are responded to by the LLM and give an executive summary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 736.326,
    "end": 741.191,
    "text": "Then it's gonna finish the 11th one and give you some summaries on the whole pipeline.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 741.912,
    "end": 751.123,
    "text": "So again, just while we're overviewing the source folder structure and then heading into the context and the history of GNN,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 751.424,
    "end": 780.317,
    "text": " main is going to call the 11 scripts and you could just start up another prompt make me a 12th script and a folder for doing dot dot dot like if somebody writes a question or a comment in the live chat i very may well add another module or do some other method then each of these scripts which are run by main are going to look into the folder of their own name so for example the type checking is going to look into gn type checker",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 780.432,
    "end": 786.441,
    "text": " and it's going to find different files, like the resource estimator methods, all of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 787.082,
    "end": 795.355,
    "text": "And so you can choose in this sort of main first shell layer of dispatch, which tools you want to bring into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 795.415,
    "end": 799.702,
    "text": "And then we can advance out the tech tree in a really modular way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 799.822,
    "end": 807.334,
    "text": "Like, okay, we have type checking on models with planning, but we don't have PyMDP for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 807.314,
    "end": 837.253,
    "text": " and then we'll just go to the script where it's working and then reverse engineer what is the state space specification we need to do so that we can generate that script that did work and if we can make that connect we're going to be able to have a ton of flexibility and a lot of reproducibility and integrity for the models that we run another feature that's going to come into play in the mcp module is that each module has an mcp.py script and these are going to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 838.162,
    "end": 862.819,
    "text": " methods that become available to the mcp module so the mcp module when it is run is going to look in the src folder and say okay go into all the folders and find the mcp.py and then pull all the methods from the mcp py and that will get reported on in the mcp processing step",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 862.917,
    "end": 874.673,
    "text": " which is where we get these very, very information dense, super informative, very information rich files about which methods we're exposing in this implementation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 875.173,
    "end": 885.567,
    "text": "So then if you're running a version and you don't have the execute, or you have a certain version of one of these or a different folder,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 886.255,
    "end": 897.902,
    "text": " As long as you have that MCP.py, it's going to control which services you're giving model context protocol availability to locally or remotely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 898.473,
    "end": 905.64,
    "text": " And so there's some super fun ways to think about that from like a business slash institution perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 906.24,
    "end": 924.818,
    "text": "Like if it's worth one cent to verify a generative model or to render it into PyMDP or to execute it, then maybe with micropayments, those kinds of things will become easier to do like X402, which Holly shared in a meeting yesterday.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 926.131,
    "end": 951.514,
    "text": " um and big picture on the mcp this is an example of a neurosymbolic architecture because there can be generalist agents multimodal agents whether they're probabilistic models like neural networks transformers llms etc or it's a person with a pen and paper index card by opening up this gnn stack as an mcp nexus",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 951.747,
    "end": 962.281,
    "text": " We're in a new space where the LLM can do program synthesis and execution on generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 963.082,
    "end": 971.052,
    "text": "So it can be using its own weights, its own inference methods to do certain things, including tool switching.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 971.753,
    "end": 977.08,
    "text": "And then if there's a given situation where explicit planning is needed,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 977.38,
    "end": 986.547,
    "text": " It's not that we need the LLM or the neural network to do explicit planning, but it could spin up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 987.387,
    "end": 1007.978,
    "text": " a simulation and dispatch the execution that does do explicit planning so like if you go to an llm and you say hey what's the expected free energy of me doing this on this day it might give you a number or it might give you some relative variable and that might be directionally accurate it might be valid might be good enough so it's not to say that it's not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1008.363,
    "end": 1022.929,
    "text": " But what it's not doing is doing program synthesis on a generative model and then using free energy minimization to actually work on that model and leaving a full type-checked trace all along the way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1023.922,
    "end": 1031.772,
    "text": " So that's the sort of neuro-symbolic programming aspect that is going to be super interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1032.572,
    "end": 1045.588,
    "text": "I always think of this like a chocolate chip cookie, where the soft cookie part is like the generalist probabilistic agent, and then the chocolate chips are like the GNN or the tools that it can call through MCP or through other techniques.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1046.309,
    "end": 1053.658,
    "text": "So we now have really good dough, better and better, and really good chocolate fragments, better and better too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1054.111,
    "end": 1074.113,
    "text": " So there's a lot of opportunities for this kind of crystal embedded in a more liquid or gelatin-like interface that is going to enable models, again, that don't have explicit planning or other features like that to drop in and deploy these actual simulations with really strong reproducibility and tracing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1074.994,
    "end": 1077.377,
    "text": "Okay, so where did this GNN concept come from?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1077.918,
    "end": 1081.722,
    "text": "Meanwhile, of course, anyone can write a comment or a question",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1082.191,
    "end": 1088.525,
    "text": " and I'll hope to bring some new features into the package like by the end of the stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1088.545,
    "end": 1100.892,
    "text": "So this work was during 2022 and 2023, working with Jakub Smeckel, who's currently a graduate student at Stanford.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1101.597,
    "end": 1109.604,
    "text": " We were doing various things with multi-agent systems and having a lot of fun talking about active inference and AI and whatnot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1110.385,
    "end": 1123.317,
    "text": "And we started to explore this idea of making notation systems that were implementation agnostic for active inference and using that for our own epistemic and pragmatic ends.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1123.777,
    "end": 1131.604,
    "text": "So for example, in the step-by-step active inference paper of Smith, Friston, and White from 2022,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1132.107,
    "end": 1137.357,
    "text": " This is like a common step up in terms of learning about generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1138.018,
    "end": 1151.382,
    "text": "So like in the top left, there's D, which is a prior on latent states, S, the latent state itself, like the temperature in the room, O, the observation on the thermometer, and then A, the mapping between the real temperature in the room and the thermometer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1151.75,
    "end": 1154.393,
    "text": " So it's a static one time step perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1154.453,
    "end": 1164.626,
    "text": "You got a prior on temperature, a thermometer reading coming in, and then through the ambiguity matrix A, you come to some posterior on latent state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1164.646,
    "end": 1169.692,
    "text": "Then you can add one more motif in with a B transition matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1169.712,
    "end": 1176.581,
    "text": "Then you can have temperature changing through time, emitting observations with thermometer readings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1177.542,
    "end": 1179.124,
    "text": "This is a passive inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1180.572,
    "end": 1183.377,
    "text": " It's a partially observable Markov process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1184.259,
    "end": 1188.547,
    "text": "Then that can get bumped up to a partially observable Markov decision process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1189.168,
    "end": 1203.576,
    "text": "In this case, where the decisioning is represented by this pi policy vector of affordances, which are operated on by an expected free energy functional, which intakes a C preference vector.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1203.792,
    "end": 1212.666,
    "text": " And then that can even be extended further to have this E habit vector and then this precision temperature kind of shaky hand on action stuff happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1212.686,
    "end": 1227.049,
    "text": "So it's like, okay, how do we really look at that though and understand ideally in an open source plain text way, really get down to what are the specific similarities and differences between these models?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1227.147,
    "end": 1244.923,
    "text": " And so that led to us, which we jokingly called land gauge because of gauge theory, where these are plain text and you can take a given column from like the coda and you can just paste it into a notepad and it'll come out like a markdown and it has different sections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1245.464,
    "end": 1254.792,
    "text": "And it's a pretty similar structure today to two years later, looking in the GNN examples, looking here,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1254.89,
    "end": 1280.875,
    "text": " we see some of those similar fields and a similar state space notation as to what it was, where you declare the state space, you declare the connections, give initial parameterization, add any other equations, how is time treated, what is the annotation of the ontology, and then we could have other sections like what's a footer, or we could have a cryptographic signature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1281.656,
    "end": 1284.238,
    "text": "So that was version one of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1284.91,
    "end": 1303.321,
    "text": " in the earlier days of Active Inference Institute fun, where we wanted to highlight that we could bring together all these different ways of thinking about program synthesis, and we could express it in what is also the title of the stream, which is the triple play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1304.082,
    "end": 1310.513,
    "text": "So the triple play is the high fidelity rendering of a GNN expression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1310.999,
    "end": 1324.637,
    "text": " whether it's a small motif, or whether it's a whole ecosystem scale multi-agent generative model, a hybrid synthetic intelligence, etc., etc., etc., across, and here's the triple play, plain text,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1325.107,
    "end": 1328.214,
    "text": " graphical, and executable computational forms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1328.936,
    "end": 1333.727,
    "text": "Moving in and out of these forms, and that's the triple play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1333.747,
    "end": 1338.418,
    "text": "So then we talk a little bit about those three aspects of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1338.879,
    "end": 1342.508,
    "text": "The text-based model, plain text, benefits of plain text,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1342.589,
    "end": 1369.221,
    "text": " graphical models here of course playing on the double play of graphical itself being like a graphical relational model but also being visual diagrammatical graphical and then the executable cognitive models so sometimes you just want to like dream a big dream about a recipe but there's recipes you can specify that you can't cook at home you just don't have the ingredients or no kitchen could possibly do this or that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1369.201,
    "end": 1378.495,
    "text": " So separating out, where are we just writing creative, speculative, semi-fiction, generative model play?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1379.757,
    "end": 1383.062,
    "text": "When are we visualizing the aforementioned?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1383.723,
    "end": 1385.646,
    "text": "And then when do we really want to execute it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1385.806,
    "end": 1398.465,
    "text": "And when it gets down to executing it, just like software can be implemented on different operating systems, we want to be able, for flexibility and reproducibility, to execute cognitive models in different settings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1398.884,
    "end": 1400.105,
    "text": " So that was our paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1401.787,
    "end": 1403.73,
    "text": "We summarized that shortly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1403.77,
    "end": 1413.802,
    "text": "And then we provided a quick assessment on how this GNN is actually not just useful and pragmatic, it's also very epistemic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1414.602,
    "end": 1418.988,
    "text": "So we dive a little bit into the realism and instrumentalism topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1419.869,
    "end": 1424.654,
    "text": "And then we talk about how we will be able to implement this triple play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1425.275,
    "end": 1428.739,
    "text": "And here we are in that ballpark, the very same,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1428.77,
    "end": 1437.425,
    "text": " implementing the triple play, and even planting some seeds that bloomed many, many April showers and May flowers later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1437.686,
    "end": 1446.18,
    "text": "Like, from a linguistics perspective, it would be interesting to explore possible grammatical case systems, morphology, and dialects associated with GNN.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1447.242,
    "end": 1449.246,
    "text": "It's not just a throwaway line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1449.987,
    "end": 1451.79,
    "text": "That's what cerebrum is about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1452.479,
    "end": 1454.241,
    "text": " case systems for generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1454.982,
    "end": 1459.988,
    "text": "So now we can say, well, we want the locative version of that GNN.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1460.529,
    "end": 1463.793,
    "text": "And so for those who are wondering, where does cerebrum come into play?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1464.334,
    "end": 1469.921,
    "text": "How can I use what I've learned from Sanskrit and Russian and Latin and is invisible in English?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1470.682,
    "end": 1475.308,
    "text": "How can I use that kind of morphological, morphosyntactic understanding of language?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1475.488,
    "end": 1479.473,
    "text": "How can I bring that to high reproducibility generative modeling?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1479.854,
    "end": 1481.035,
    "text": "Here is how.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1481.588,
    "end": 1510.33,
    "text": " and that was the paper in 2023 with Jakob and put it on the back burner for a little bit but now the repo is back with a fury but not an angry one and hopefully this is going to be a really key tool and platform for people who want to use",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1511.592,
    "end": 1515.739,
    "text": " generative models for education and for research, and it can be under the hood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1515.779,
    "end": 1530.985,
    "text": "It's not that every single person may be in this exact repo, but as we start to think through these things as a community, it becomes a lot clearer and clearer how having these methods for setting up workspaces",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1531.184,
    "end": 1543.506,
    "text": " testing our environment, type checking and resource estimation, exporting and confirmation, visualizing generative models, making methods available for LLMs and other agents,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1544.363,
    "end": 1556.777,
    "text": " understanding the ontological annotations of state spaces, preparing simulations through rendering, executing the simulations, and using LLMs to give interpretability in natural language and do other kinds of operations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1557.177,
    "end": 1562.663,
    "text": "These are some of the core activities that we need for our own research work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1563.484,
    "end": 1571.012,
    "text": "So it's cool that we can develop this and make this an open science space",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1570.992,
    "end": 1589.355,
    "text": " um and welcome participation from from people who see opportunities and challenges here so let's do a few let's check out the agenda and see where we might want to do something and then again if somebody's watching live they can write a comment or an idea in the chat",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1590.162,
    "end": 1593.128,
    "text": " So, what is GNN and why is it important?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1593.729,
    "end": 1608.998,
    "text": "GNN is a plain text notational style and tradition that focuses on states-based definition of generative models, for example, statistical models or cognitive models of agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1609.67,
    "end": 1626.902,
    "text": " Why it's important is that with that kind of a controlled structural vocabulary for generative models, it's possible to reproducibly and at high throughput engage with a whole sequence of different kinds of functionalities ranging from",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1627.439,
    "end": 1640.069,
    "text": " reproducible environment setup and testing, type checking, resource estimation, exporting, visualization, accessibility to MCP, ontological analysis, rendering execution, LLMs, and beyond and more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1640.952,
    "end": 1643.237,
    "text": "So that's pretty cool and important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1643.757,
    "end": 1659.961,
    "text": " Core concepts are woven throughout, and the goals are for us, as always on these kinds of streams and at the Institute, where everyone's welcome to find out more and participate, is to increase the accessibility, rigor, and applicability of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1660.061,
    "end": 1663.146,
    "text": "And so this is a triple play on that triple play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1664.688,
    "end": 1669.495,
    "text": "How does GNN allow for clear textual specification of complex models?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1669.593,
    "end": 1685.533,
    "text": " So we can look at what it looks like now, but with more advanced automated code generation, for example, the auto gen lib, maybe one library to look into as well as kit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1687.155,
    "end": 1689.998,
    "text": "So kit is a,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1690.872,
    "end": 1692.854,
    "text": " code synthesis library.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1693.274,
    "end": 1701.162,
    "text": "So right now this is like a v0.1 or a v1 version of the GNN spec.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1701.182,
    "end": 1704.746,
    "text": "It isn't that it has to be written this way with this section title.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1704.966,
    "end": 1720.542,
    "text": "It's just to give an idea and then we can use more advanced code templating methods to generate these from possibly even a more distilled condensed version that renders into a GNN that then gets used",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1720.792,
    "end": 1723.736,
    "text": " But that's kind of like the assembly code question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1725.198,
    "end": 1730.165,
    "text": "So how does GNN allow for clear textual specification of complex models?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1730.947,
    "end": 1734.772,
    "text": "Well, by separating out a few key steps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1735.834,
    "end": 1745.247,
    "text": "Separating out first, in the state space block, the sheer declaration of the size and type of different variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1746.155,
    "end": 1749.579,
    "text": " C is going to be length three vector float.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1750.2,
    "end": 1755.146,
    "text": "Or you could say, well, I'm going to be able to do my C vector with integers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1756.167,
    "end": 1758.35,
    "text": "Then you could say it's an int.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1758.851,
    "end": 1763.236,
    "text": "And then in the resource and checking, you could know that you could work with integer calculations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1763.456,
    "end": 1765.719,
    "text": "So that's the state space block.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1765.739,
    "end": 1769.284,
    "text": "Then connections, which is a little bit generic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1769.544,
    "end": 1774.39,
    "text": "Of course, these need to be nuanced a lot to be really used as a base graph, but the information is there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1775.247,
    "end": 1779.993,
    "text": " After the state space block and the structural specification is the initial parameterization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1780.734,
    "end": 1788.764,
    "text": "So here, it could be done in a more Pythonic fashion or it can be just fully specified out what is the initial state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1789.224,
    "end": 1791.927,
    "text": "Or a given kind of renderer could have a default.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1792.188,
    "end": 1797.734,
    "text": "Like if something is not provided with initial state, it's defaulted to uniform or to the identity matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1797.754,
    "end": 1799.837,
    "text": "So whatever kind of rendering rules you want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1801.049,
    "end": 1805.074,
    "text": " And then you separate out the ontology annotation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1805.855,
    "end": 1812.443,
    "text": "So you've already basically initialized the space of the model and initialized the values.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1813.224,
    "end": 1820.373,
    "text": "And now you have this annotation layer, which could easily be swapped out with a different language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1820.393,
    "end": 1826.601,
    "text": "Okay, so that's kind of 2023 brought into current year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1827.222,
    "end": 1846.767,
    "text": " plain text version of what a minimal GNN looks like, which is just a focus on some free-form contextual information about the generative model, state space for initialization with initial parameterization, and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1846.865,
    "end": 1876.804,
    "text": " the ontology annotation and we've been having some great convos in the multi-agent meetings about well what space does that leave open then for the orchestration and the message passing and the communication all these kinds of logistics and operations of generative models but that's where actually again cerebrum in the case system comes into play because if the generative model let's just say is the ingredients",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1876.784,
    "end": 1881.875,
    "text": " Like we have lentils, mustard, and vinegar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1883.018,
    "end": 1896.447,
    "text": "And then there's a sentence in the recipe, which is like the orchestration specification, like with the mustard in the kitchen, put the sauce on the lentils.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1896.899,
    "end": 1903.367,
    "text": " and then being able to look at all those prepositions and understand which of the cases are each of the models being used in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1903.467,
    "end": 1907.131,
    "text": "Oh, it's with the mustard, but it's on the lentils.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1908.212,
    "end": 1924.071,
    "text": "But then if lentil has multiple methods or multiple different characteristics, and it turns out like with the lentils is really hard on the GPUs because they're heavy, but putting something on the lentils doesn't mean that we need GPUs at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1924.169,
    "end": 1931.18,
    "text": " So that's where we get case-specific resource estimation through this kind of metalinguistic intelligence layer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1934.305,
    "end": 1936.368,
    "text": "Key syntax and structural elements just went through them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1936.588,
    "end": 1938.831,
    "text": "Okay, triple play with GNN.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1939.713,
    "end": 1945.722,
    "text": "And no, I'm not just talking about the ever-present GNN.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1946.714,
    "end": 1960.41,
    "text": " comprehensive who's on first style dialogue between Professor Phineas Cogswell and Pip Squeaky Wheeler as they discuss the GNN format.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1960.43,
    "end": 1962.433,
    "text": "I'm not just talking about that triple play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1963.374,
    "end": 1976.67,
    "text": "I'm talking about the representation triple play, which the LLM invented another triple play of understanding conversion execution, but it works well too, so c'est la vie.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1976.819,
    "end": 1981.064,
    "text": " Okay, showcasing GNN action, practical examples of the triple play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1981.084,
    "end": 1992.176,
    "text": "So let us do that and also see a little bit about how Cursor does this kind of low key, high throughput, high efficacy program synthesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1992.677,
    "end": 1998.743,
    "text": "So let's make a new example and work within the framework we already have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1999.704,
    "end": 2001.607,
    "text": "And then we can explore some more far out things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2002.027,
    "end": 2006.472,
    "text": "So write a new example, GNN file,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2009.101,
    "end": 2037.724,
    "text": " fully compliant like these two for a POMDP where the ontology assertions are in Spanish terms there are more sub-matrices for each variable but still",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2038.868,
    "end": 2067.205,
    "text": " compatible with just just these are just kind of reminder notes but in a in a better world which we may already be in these don't even matter but still compatible with visualization methods and the situation is that it is a trading algorithm being run on an airplane",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2067.944,
    "end": 2074.634,
    "text": " where if it loses money, then the plane runs out of gas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2077.759,
    "end": 2092.821,
    "text": "Okay, so with all this kind of documentation and context, and especially templates and examples in the niche, then Gemini or whomever you call will be able to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2093.51,
    "end": 2117.998,
    "text": " make a new example so let us see we're seeing into that that chain of thought that inner dialogue that gemini is having with itself and it's starting to think through okay so here's what we have to do this kind of pseudo thought that's happening and then it's writing out all these details so it'll pop up a file soon okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2119.97,
    "end": 2122.794,
    "text": " Meanwhile, so welcome Andrew.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2123.014,
    "end": 2130.945,
    "text": "I'm going to copy in your question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2130.965,
    "end": 2132.327,
    "text": "So now we're in the game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2132.367,
    "end": 2139.177,
    "text": "Let's just get a few interesting things done during the rest of the stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2141.3,
    "end": 2141.64,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2144.877,
    "end": 2155.571,
    "text": " Andrew wrote, could a 12 involve putting together some dashboard of the visualizations and or metric reporting or some synthesis between LLM stage and visualization?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2156.832,
    "end": 2157.113,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2160.957,
    "end": 2167.746,
    "text": "Let's do, let's make one new folder called site.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2171.59,
    "end": 2178.236,
    "text": " This, I'm sure, could be done automatedly too, but I'm just gonna manually make an MCP.py.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2181.899,
    "end": 2183.34,
    "text": "Manually bring in the init.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2189.846,
    "end": 2195.471,
    "text": "Then... Okay, stop thinking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2198.274,
    "end": 2198.734,
    "text": "Continue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2199.495,
    "end": 2200.956,
    "text": "Most used command, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2201.105,
    "end": 2205.313,
    "text": " Okay, started up a new chat agent in cursor over here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2205.333,
    "end": 2219.919,
    "text": "And so I'm gonna drag in main read me and site and say, write a 12 underscore file in SRC.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2223.285,
    "end": 2225.509,
    "text": "Again, just dragging it in for explicit reference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2234.281,
    "end": 2247.601,
    "text": " For 12site.py, which will call on all the methods in site folder, make them all comprehensively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2249.424,
    "end": 2261.402,
    "text": "For making a website, single HTML file with different sections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2263.677,
    "end": 2272.569,
    "text": " which reflects the output folder, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2273.351,
    "end": 2278.838,
    "text": "embedding all the digitalizations and LLM outputs and etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2285.127,
    "end": 2285.408,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2286.589,
    "end": 2288.492,
    "text": "We're still deep in the thought chain?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2288.532,
    "end": 2289.313,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2289.766,
    "end": 2294.815,
    "text": " We're in the Spanish-speaking airplane trading POMDP example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2296.097,
    "end": 2311.403,
    "text": "So it's kind of funny and I guess apt, but for those who have looked at the 2022 Active Inference textbook, this is kind of like the Chapter 6 approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2311.687,
    "end": 2318.163,
    "text": " And it's also the same thing that for years we've been working on in terms of just like, what is the recipe for cognitive modeling?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2318.263,
    "end": 2325.662,
    "text": "Like, wow, it sounds really cool about doing all this active inference work, but how do we really go from there being a situation of interest",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2325.743,
    "end": 2341.779,
    "text": " And then whether for whimsy and fun, or just delight, or something more professional like systems engineering, or doing something like an analyst would, how do you really go from just a system of interest to having a cognitive model in hand?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2342.64,
    "end": 2353.371,
    "text": "And chapter six from the 2022 textbook took that part of the way, and it gave like a sort of proto-recipe, but this is bringing it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2353.975,
    "end": 2378.937,
    "text": " into another level of structural possibilities and not to constrain either more like a playground where there's all kinds of fun jumps and pull-ups and swings you can do because your expressivity is higher with these kinds of structures and tools if you know what's up so airplane trading on the palm dp",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2379.102,
    "end": 2393.977,
    "text": " So as per requested, we have the Spanish language ontological assertions, but the whole point is it doesn't change anything with what the state space block or any of the initial parameterization is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2394.918,
    "end": 2395.798,
    "text": "So let's accept that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2397.66,
    "end": 2399.162,
    "text": "Let it clear the terminal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2400.643,
    "end": 2404.587,
    "text": "Delete the output folder just to be sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2404.668,
    "end": 2431.654,
    "text": " then rerun python 3 main so in an ideal setting which we do not know yet if we are in or not we will have a seamless well-longed step through of the new gn trading airplane trading palm dp it should just work so we'll see if we get there but bigger picture we know that we can get there",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2432.174,
    "end": 2435.278,
    "text": " We're gonna see, will it make the visualizations that we want?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2436.881,
    "end": 2444.992,
    "text": "So here comes, this is, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2446.775,
    "end": 2447.836,
    "text": "Here's the airplane trading.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2449.879,
    "end": 2457.27,
    "text": "Yeah, so now we have the variables from the airplane",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2459.697,
    "end": 2488.641,
    "text": " with their spanish ontological assertions being rendered so it's like single prompt you don't need to know about the details you can go in there and you can do the engineering and set the specific state spaces oh no no we wanted it to be six not three or whatever it happens to be but again big picture we can render simulations for all of these generative models to our hearts delight",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2489.431,
    "end": 2491.153,
    "text": " So will this script run?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2491.253,
    "end": 2493.316,
    "text": "Well, I mean, again, we can sort of find out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2493.596,
    "end": 2494.057,
    "text": "Did it run?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2494.437,
    "end": 2494.898,
    "text": "What happens?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2500.725,
    "end": 2510.116,
    "text": "Yeah, not sure if the run script worked perfectly, but again, it's just a question of, okay, what model class is rendered what way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2511.077,
    "end": 2512.9,
    "text": "And then expanding that out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2512.92,
    "end": 2518.206,
    "text": "So that's one key feature to demonstrate, which is just purely within Cursor,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2518.54,
    "end": 2545.223,
    "text": " let alone using more sophisticated methods, we can do one-shot program synthesis or really like meta notation synthesis and use that to just play into the same well-typed pathways so that we can make a Spanish localized simulation about doing trading on an airplane",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2546.249,
    "end": 2546.85,
    "text": " right off the bat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2547.531,
    "end": 2551.876,
    "text": "So that might take a while if you're gonna manually write all those state spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2551.936,
    "end": 2553.838,
    "text": "So I'll just drop that one into archive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2557.202,
    "end": 2559.165,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2559.185,
    "end": 2559.365,
    "text": "So.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2568.356,
    "end": 2568.456,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2569.838,
    "end": 2575.885,
    "text": "So that was an example of making a new generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2576.928,
    "end": 2583.277,
    "text": " So we are again, like update your priors if you're not here and seeing this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2583.957,
    "end": 2591.648,
    "text": "We have single shot chat mediated capacity to write certain structures of generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2592.529,
    "end": 2598.497,
    "text": "And then there's a lot of work to be done so that increasingly general styles",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2598.933,
    "end": 2611.137,
    "text": " of GNN can be parsed and rendered and so on, but that's actually why the whole suite is structured as it is, because I suspect",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2611.235,
    "end": 2631.835,
    "text": " that if we confirm which version of GNN we're working in, set up our workspace, run the tests, do the static checking, export and confirm that the export was successful, visualize it, and then execute and large language model it, we're gonna be in a great spot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2635.818,
    "end": 2635.918,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2635.939,
    "end": 2639.622,
    "text": "So, Tatia Zot, I'm gonna read your comment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2644.124,
    "end": 2645.986,
    "text": " You wrote, my best friend, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2646.727,
    "end": 2649.39,
    "text": "Can you prepare group Discord page, your YouTube channel?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2649.65,
    "end": 2650.511,
    "text": "I want to join you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2651.552,
    "end": 2661.262,
    "text": "Yes, please go to discord.activeinference.institute and you'll find the Discord link.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2662.283,
    "end": 2669.491,
    "text": "So for those who are in the live chat now, I just went to welcome.activeinference.institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2669.611,
    "end": 2671.834,
    "text": "That's like the landing page if you want to get involved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2671.934,
    "end": 2673.135,
    "text": "We do have a Discord.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2673.47,
    "end": 2675.373,
    "text": " And you're totally welcome to join in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2675.413,
    "end": 2679.219,
    "text": "And I'll paste the link just directly into the YouTube live chat as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2679.259,
    "end": 2684.608,
    "text": "And that's one place activity happens, but it happens wherever you are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2684.868,
    "end": 2685.409,
    "text": "There you are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2686.491,
    "end": 2690.517,
    "text": "So here we go with the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2690.783,
    "end": 2700.58,
    "text": " demonstrating a sort of package level flexibility in terms of being able to bring in a new functionality into the GNN space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2701.382,
    "end": 2707.392,
    "text": "So here we have the site folder coming together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2708.03,
    "end": 2712.797,
    "text": " And then it will make a 12 underscore site dot py.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2712.837,
    "end": 2729.222,
    "text": "And then it will add that into main so that it runs 12 underscore site so that when we add a new example in and we run it all with main, that will have it all pop up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2729.242,
    "end": 2731.405,
    "text": "So let's do another example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2735.755,
    "end": 2739.86,
    "text": " So here I've created SRC site MCP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2740.661,
    "end": 2750.654,
    "text": "So this is like a way to confirm, yeah, these are the methods related to the website, like generate pipeline summary site.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2751.676,
    "end": 2753.858,
    "text": "That's gonna be exposed through MCP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2754.419,
    "end": 2765.053,
    "text": "It's not fully functional yet, but it's all there so that people could call sequential MCP calls",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2765.911,
    "end": 2780.852,
    "text": " And then say like here's the recipe you blend up a then you add be take to see and combine them with D, then do all this and do that, and then that so that level of programmatic synthesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2781.953,
    "end": 2793.589,
    "text": "is something that is very excitingly on offer from ds pi, which is a programming structure it'll look a little cleaner in the repo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2799.222,
    "end": 2809.597,
    "text": " for doing program synthesis at the level of LLMs, which is where we're gonna have the MCP at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2809.617,
    "end": 2816.487,
    "text": "So DSPy is gonna be useful for programming sequences of MCP type calls.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2818.51,
    "end": 2826.782,
    "text": "Kit or something similar is going to allow program synthesis and code-based level intelligence",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2829.023,
    "end": 2858.625,
    "text": " mcp whether it's fast mcp or another method is going to support making these tools available even if somebody doesn't have the whole repo because we can offer an endpoint um as earlier mentioned cerebrum and this sort of lexical intelligence paradigm is going to help us make case-specific renderings of generative model so that when we understand from the beginning what different roles",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2859.027,
    "end": 2867.356,
    "text": " a given object or generative model is going to serve, we're going to be able to understand what kinds of rendering pipeline are needed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2867.376,
    "end": 2872.241,
    "text": "So again, if we're talking about a table, are we talking about placing something on the table?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2873.162,
    "end": 2876.345,
    "text": "Or are we talking about hitting a nail with the table?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2876.826,
    "end": 2882.752,
    "text": "Because if we're just going to place something on the table, we only need enough RAM to pick up the object that we're putting on the table.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2883.073,
    "end": 2885.355,
    "text": "We're going to put the pen on the table.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2885.842,
    "end": 2891.689,
    "text": " But if we're going to put the table on the pen, then we need something like a GPU that can pick up a table.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2892.33,
    "end": 2895.113,
    "text": "So that's how prepositions are and what they signal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2895.774,
    "end": 2902.882,
    "text": "And then there's just, again, these folders can have more documents and more different frameworks brought in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2903.102,
    "end": 2913.334,
    "text": "X402, which we were talking about yesterday, is just thinking, okay, how could we do micropayments so that if somebody thinks, I'm going to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2913.415,
    "end": 2917.741,
    "text": " ring up the Institute and ask for a textbook written in this language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2917.921,
    "end": 2919.503,
    "text": "And then we do that on the backend.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2919.583,
    "end": 2922.487,
    "text": "I'm gonna have a generative model written up like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2923.788,
    "end": 2931.759,
    "text": "Then there can be small charges or just kind of authentication, different kinds of methods to offer these up as services.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2932.74,
    "end": 2935.083,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2935.103,
    "end": 2937.366,
    "text": "The pipeline 12 is integrated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2937.386,
    "end": 2942.292,
    "text": "So let's see if the main can handle this running.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2947.773,
    "end": 2952.821,
    "text": " So just clear, I'm gonna delete the output folder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2953.502,
    "end": 2963.477,
    "text": "That's why the output folder is standalone because how satisfying to have SRC and doc, that's it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2964.539,
    "end": 2967.583,
    "text": "And this is like the minimal dual channel strategy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2968.445,
    "end": 2974.033,
    "text": "Basically doc is suggestive that it's going to be more natural language like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2974.148,
    "end": 2993.271,
    "text": " src is suggestive that it's going to host all of the code and it is that way and then we have a few top level scripts so we have the citation if uh anyone sees relevance in the work partially filled I'll change the release date to today",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3000.541,
    "end": 3029.991,
    "text": " version 0.1.0 code of conduct auto written but we can tweak that to contributions already even those just listening or watching or reviewing summaries thereof it's people and agents like you that make GNN such a great tool it's so true license MIT license for now",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3030.427,
    "end": 3037.897,
    "text": " those with more insight into how we can have more advanced and multi-channel licenses get in touch, et cetera, but that's where it's at for now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3039.139,
    "end": 3047.19,
    "text": "And as far as I understand, it's the first program synthesis-based generative model creation assistance tooling framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3047.851,
    "end": 3055.241,
    "text": "So I hope that people who find value in that can get in touch, maybe support the Institute, maybe support the project, maybe use the framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3056.262,
    "end": 3058.425,
    "text": "The README is an overview of summary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3059.418,
    "end": 3064.724,
    "text": " We have a cyber physical and cognitive security policy in this GNN project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3065.324,
    "end": 3067.427,
    "text": "So inquire within for more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3068.307,
    "end": 3071.05,
    "text": "And we do want to try to be supportive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3071.151,
    "end": 3081.141,
    "text": "So whether it's during this live chat and you have questions you want to ask, or whether you have GitHub issues that you want to open up or other questions about like, what can we do with this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3081.201,
    "end": 3082.843,
    "text": "How can I, et cetera, then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3083.06,
    "end": 3084.202,
    "text": " we're there for support.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3084.222,
    "end": 3099.047,
    "text": "But these are kind of the top level files and all of the operational stuff is in source, all of the extraneous documentation, as well as different other ideas, like how could this be useful for multi-agent simulations?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3099.488,
    "end": 3107.802,
    "text": "Like, well, maybe we expand the GNN structure to include an agent block.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3108.119,
    "end": 3113.364,
    "text": " And then we have a GNN file that is the notation for a multi-agent simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3113.545,
    "end": 3123.715,
    "text": "And it says, you're going to use one instance of, you know, five instances of this GNN and one instance of that GNN.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3125.017,
    "end": 3133.285,
    "text": "And so we can make structured notational fields for doing all that kind of simulation level reproducibility and communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3134.086,
    "end": 3137.89,
    "text": "So that, and then we can have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3138.68,
    "end": 3161.093,
    "text": " either kind of state spaces that are wired up again separate from their english name so we can flip in and out of using that state space representation where the variables could be known like by their cryptographic hash uh all the way on through just okay now you want to turn it into this language lens",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3161.917,
    "end": 3178.181,
    "text": " So just ideas about how we could use GNN and structured fields for the communication questions and keeping with this spirit and inspiration that it's implementation agnostic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3178.481,
    "end": 3181.546,
    "text": "GNN isn't the rendered version that's executable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3182.227,
    "end": 3186.113,
    "text": "GNN is the notation notation generalization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3187.034,
    "end": 3187.755,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3188.393,
    "end": 3211.299,
    "text": " If a given kind of simulation level or agent level description is written in GNN, like DNA, like source code, then you may have a rendering element that is able to render and transform the contents into the format you want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3211.319,
    "end": 3211.819,
    "text": "That's docs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3212.32,
    "end": 3213.321,
    "text": "Okay, pipeline has finished.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3214.668,
    "end": 3218.136,
    "text": " It says successful 11, one success with a warning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3218.176,
    "end": 3220.401,
    "text": "So let's see what the site.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3224.19,
    "end": 3227.618,
    "text": "Okay, looks like 12 thinks that the site was created.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3227.718,
    "end": 3228.5,
    "text": "So let's find out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3229.683,
    "end": 3230.886,
    "text": "Okay, here's the summary site.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3231.146,
    "end": 3231.968,
    "text": "Moment of truth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3244.233,
    "end": 3252.161,
    "text": " Wouldn't say it's the most advanced site that I've ever seen, but it does the job.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3256.485,
    "end": 3261.951,
    "text": "It has all the information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3261.971,
    "end": 3264.593,
    "text": "And then that's how you develop modules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3265.314,
    "end": 3269.498,
    "text": "Just like, okay, now develop site to be like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3271.604,
    "end": 3274.168,
    "text": " So here, I'll just remind it of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3275.891,
    "end": 3282.981,
    "text": "Ensure the README includes site and the 12th script.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3283.803,
    "end": 3295.941,
    "text": "Make any improvements within the site folder, ensuring you use",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3296.562,
    "end": 3304.673,
    "text": " Separate scripts within site if it is getting like long modular methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3308.137,
    "end": 3310.941,
    "text": "OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3310.961,
    "end": 3319.732,
    "text": "Clear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3319.752,
    "end": 3321.895,
    "text": "So it will take some.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3324.052,
    "end": 3333.512,
    "text": " some work, some collaboration from hopefully all to many of us that will make it more rigorous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3333.872,
    "end": 3336.137,
    "text": "For example, having a strict template",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3337.18,
    "end": 3361.045,
    "text": " of a certain kind like hey if you want to do discrete time discrete state spaces and get it to land the plane in py mdp here is the standard example or here's the code template the code generation template the kind of stuff we can do with code generation libraries here's the code generation library format schema",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3361.666,
    "end": 3369.68,
    "text": " for if you want to make sure that it's gonna go into PyMDP well, like this should be like this and you need this, you can't have that, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3373.787,
    "end": 3377.914,
    "text": "Let's add a little functionality with RxInfer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3382.562,
    "end": 3385.547,
    "text": "So while the website stuff is happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3388.025,
    "end": 3404.266,
    "text": " Assess and use at web search to understand how RxInfer at model statements are used, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3404.327,
    "end": 3413.779,
    "text": "the generative model joint distributions in format where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3415.143,
    "end": 3427.843,
    "text": " it can be parsed by RxInfer into a executable model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3436.797,
    "end": 3440.863,
    "text": "Then make those improvements to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3447.07,
    "end": 3475.66,
    "text": " so that here's the rendering so that rendered outputs are accurately conveying all the information make and rx infer dot or utils dot py",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3477.395,
    "end": 3504.938,
    "text": " or our action for utils dot jl if needed yeah the gemini 2.5 sometimes stalls out kind of randomly uh we'll we'll just say all right i'm gonna make this edit and then just hangs there uh but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3506.285,
    "end": 3508.849,
    "text": " Generally speaking, it has been great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3510.311,
    "end": 3512.594,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3512.614,
    "end": 3525.053,
    "text": "Let's add another example, see if we can get into some other kind of model that we... Okay, so we have website, chugging away here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3527.597,
    "end": 3530.08,
    "text": "RxInfer improvement here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3532.644,
    "end": 3535.228,
    "text": "Now we're gonna write another example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3540.929,
    "end": 3569.518,
    "text": " According to these compliant examples, write another kind of generative model, not a POMDP that will creatively and functionally demonstrate important features and capacities of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3575.692,
    "end": 3601.952,
    "text": " make the situation something esoteric yet tangible semicolon available though ineffable make it best best best possible",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3606.708,
    "end": 3620.209,
    "text": " It's been one hour.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3620.269,
    "end": 3625.837,
    "text": "If some super awesome funny stuff happens, I might stay on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3625.957,
    "end": 3627.54,
    "text": "But otherwise, just a few more minutes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3628.301,
    "end": 3632.327,
    "text": "Because I think I have pretty much conveyed where it's at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3632.898,
    "end": 3648.544,
    "text": " some of the core features so in the last section here like if anyone has an idea for an example or another function that they want to see or they have a specific question that they would like addressed in this stream please write it in the next few minutes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3674.579,
    "end": 3691.322,
    "text": " okay okay greetings andres oh now that could be a fun a fun plot twist to include some of your work into this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3709.173,
    "end": 3726.832,
    "text": " Okay, I'll make just a sort of starter pack, NTQR, and a NTQR, GNN, NTQR-MD.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3731.738,
    "end": 3735.822,
    "text": "Just leave that there for now, but I'm sure that you and others",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3736.966,
    "end": 3742.032,
    "text": " could imagine a few different ways that NTQR comes into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3744.275,
    "end": 3751.684,
    "text": "It could be like a module offered in a multi-agent simulation setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3751.984,
    "end": 3760.234,
    "text": "Just as another module, you could run on top or after the multi-agent, then you can run it with this NTQR layer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3762.897,
    "end": 3765.42,
    "text": "Just trying to delete this, but it's a slow computer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3774.817,
    "end": 3799.103,
    "text": " okay so this is what the uh the esoteric oh goodbye cursor it was good to know you pull quit okay we're back okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3800.315,
    "end": 3806.633,
    "text": " Alright, so it's a GNN, Bayesian network that stochastically generates a verse concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3807.536,
    "end": 3814.155,
    "text": "It aims to model the flow of poetic inspiration from emotional and elemental inputs to concrete poetic characteristics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3814.793,
    "end": 3823.785,
    "text": " So pretty cool, this is getting us into the space of explicit active inference language models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3824.466,
    "end": 3837.464,
    "text": "So not just using the inputs and outputs of language models and treating those or conditioning those with active inference, but this is actually getting into what we can now do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3837.784,
    "end": 3843.552,
    "text": "Now make another example, absolutely comprehensive",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3844.932,
    "end": 3856.486,
    "text": " and fast called an active inference language model that has state spaces for e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3857.287,
    "end": 3874.028,
    "text": "sound, phoneme, syntax, morphosyntax, semantics, situational narrative, all the nested and interacting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3876.488,
    "end": 3895.576,
    "text": " levels so we can really, truly, actually, finally, seriously, safely, and beneficially have a full GNN based model of language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3899.682,
    "end": 3905.23,
    "text": "No training data sets here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3905.952,
    "end": 3934.153,
    "text": " Just one-shotting the triple play based upon the GNN launchpad for making the world's first actual active inference linguistic intelligence agent toolbox.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3943.887,
    "end": 3951.985,
    "text": " Okay, have it continue with rx infer because it got quit on and looks like the website one did too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3956.274,
    "end": 3960.343,
    "text": "We'll just say continue and then we'll run it again in a few seconds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3964.12,
    "end": 3967.907,
    "text": " Yeah, also the new version of Cursor, 0.50.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3968.509,
    "end": 3970.132,
    "text": "It has some background.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3970.332,
    "end": 3974.961,
    "text": "Well, one important thing, indexing was broken out into its own separate tab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3975.703,
    "end": 3983.197,
    "text": "If you've watched a bunch of InforAnt streams, you know that I was always going into like features and then scrolling down to the code base and doing the resync.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3984.8,
    "end": 3986.263,
    "text": "There's MCP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3986.682,
    "end": 3998.544,
    "text": " But this is exactly how easy it's going to be to then have all this GNN stuff tucked away and then point the MCP server at it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3999.305,
    "end": 4003.433,
    "text": "So then other people or agents will be using cursor or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4003.493,
    "end": 4007.661,
    "text": "And then it'll be like, plan, make a plan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4008.772,
    "end": 4020.469,
    "text": " And then that could invoke this program synthesis, rendering, type checking, visualization, simulation execution, multiple environments, logging, et cetera, et cetera, et cetera, website generation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4021.731,
    "end": 4029.001,
    "text": "And also there's the background agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4030.463,
    "end": 4033.828,
    "text": "I don't know where it is in the settings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4033.888,
    "end": 4038.154,
    "text": "I haven't looked at it, but there's a background agent that you can...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4040.311,
    "end": 4041.833,
    "text": " So that could be very useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4041.933,
    "end": 4053.671,
    "text": "For example, a background agent could say, always absolutely vigilantly be assessing if everything is totally good and up to mega standards for everything we're doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4054.472,
    "end": 4057.116,
    "text": "And just let us know if not, but don't make changes by yourself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4058.859,
    "end": 4061.663,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4061.783,
    "end": 4062.424,
    "text": "AILM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4067.271,
    "end": 4067.972,
    "text": "Phonetic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4068.863,
    "end": 4095.124,
    "text": " target and articulation let's see what this looks like so again if this were using motifs and the structure that we knew was gonna work then like we would know it would work okay let's close that shot see if the website is done all right here we go",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4096.302,
    "end": 4102.119,
    "text": " We're going to throw caution to the wind and see if this active inference language model will run in PyMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4102.66,
    "end": 4103.362,
    "text": "It's not going to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4103.462,
    "end": 4106.03,
    "text": "Well, let's delete the output just to confirm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4107.594,
    "end": 4108.557,
    "text": "Delete the output folder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4111.473,
    "end": 4113.535,
    "text": " Okay, so let's just see how it broke it up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4113.975,
    "end": 4117.379,
    "text": "See how the LLM broke up this structured analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4117.519,
    "end": 4136.838,
    "text": "And this is just a total, total early hint of the power of using language models and general purpose agents to write structured texts, which we then can bring into this explicit program execution framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4136.858,
    "end": 4140.822,
    "text": "Okay, so hidden state factors, phonetic target and articulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4143.097,
    "end": 4145.76,
    "text": " Then there's a lexical morphosyntactic level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4146.481,
    "end": 4151.227,
    "text": "So lexical concept ID, that would be like the table chair.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4151.247,
    "end": 4152.989,
    "text": "Then there's the current syntactic role.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4153.069,
    "end": 4156.573,
    "text": "This takes us right back to cerebrum and the different grammatical cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4157.134,
    "end": 4159.917,
    "text": "Like is the table acting?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4161.198,
    "end": 4163.021,
    "text": "Is the table the recipient of action?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4163.221,
    "end": 4165.203,
    "text": "Is something being placed on the table?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4165.323,
    "end": 4166.905,
    "text": "Is something being placed near the table?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4167.746,
    "end": 4170.91,
    "text": "And then there's tense, number, gender, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4172.965,
    "end": 4193.134,
    "text": " that brings us from the sort of lexical into the more properly fragments of semantics which here let's see semantic proposition so propositional availanced propositional assertion based semantic representation not the only one but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4194.042,
    "end": 4196.868,
    "text": " That's why we can make multiple kinds of GNN files.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4196.908,
    "end": 4204.285,
    "text": "We could say, make a new GNN file that explores a really, really different and radically contrasting semantic concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4206.57,
    "end": 4209.917,
    "text": "Narrative context, internal goals and predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4211.2,
    "end": 4212.523,
    "text": "Observation modalities,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4214.275,
    "end": 4234.933,
    "text": " can make no no we only want it to observe auditory we want to have confirmation that the observations are only coming in through sound and that all the semantics is being endogenously generated or we want the policy output to be red yellow green",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4235.723,
    "end": 4240.349,
    "text": " just three states, or we want the policy output to be words in the dictionary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4240.91,
    "end": 4249.801,
    "text": "Then we would have literally next token prediction, policy prediction in this kind of AI LM would be just like it is in transformers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4251.684,
    "end": 4254.127,
    "text": "So this state space block is obviously massive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4258.573,
    "end": 4264.38,
    "text": "The connections, let's see if the visualization went through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4265.812,
    "end": 4293.76,
    "text": " here's the poetic muse model interesting here's the poetry model ontology assertions in the state space that one was one-shotted and then let's look at the language model okay looks like it has some differences that um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4294.482,
    "end": 4307.602,
    "text": " so that we could get to this state space representation, but that the, but like, it could be a breaking change, but the kind of suggestion would be, drag this in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4307.642,
    "end": 4311.468,
    "text": "Hey, we didn't get all the visualizations that we thought of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4312.49,
    "end": 4317.478,
    "text": "Ensure that visualizations are generated properly for this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4319.481,
    "end": 4322.886,
    "text": "And then it would be off to the races again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4325.633,
    "end": 4332.221,
    "text": " Exports, here's its attempt to export it in JSON style.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4333.342,
    "end": 4346.798,
    "text": "So maybe you only need to use, maybe when you're calling MCP or you're using this for your own research, maybe all you want to do is specify it, type check it, and then export it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4348.027,
    "end": 4349.689,
    "text": " you don't even want to visualize it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4349.709,
    "end": 4353.733,
    "text": "Or maybe you don't care if it's type checked, you just want to visualize it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4353.753,
    "end": 4356.637,
    "text": "So that's why these methods are written out separately.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4362.283,
    "end": 4369.411,
    "text": "This is the language model failing to be put into PyMDP format.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4369.712,
    "end": 4371.834,
    "text": "Let's see if it gets a little bit better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4371.854,
    "end": 4375.418,
    "text": "And similarly, RxInfer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4376.208,
    "end": 4378.251,
    "text": " didn't continue through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4383.46,
    "end": 4398.365,
    "text": "Comprehensively ensure that at model blocks really are output to there given the GNN input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4400.548,
    "end": 4402.131,
    "text": "So maybe I'll run one more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4407.173,
    "end": 4407.533,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4411.717,
    "end": 4411.998,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4412.739,
    "end": 4413.739,
    "text": "Refactor the website.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4416.722,
    "end": 4420.226,
    "text": "All right, so we'll let this RxInfer update come through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4420.246,
    "end": 4424.19,
    "text": "And the LLM one, I just interrupted it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4426.512,
    "end": 4436.522,
    "text": "That would be... So here we get that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4437.008,
    "end": 4454.827,
    "text": " LLM interpretation generated from an OpenAI call at this point to describe the model and to answer different questions about the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4456.168,
    "end": 4462.054,
    "text": "So you can have a default question kit, QKit, ask these different questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4465.021,
    "end": 4467.043,
    "text": " Let's see what happened when it was tried to execute it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4467.063,
    "end": 4471.328,
    "text": "Yep, A matrix must be a numpy array.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4472.61,
    "end": 4473.611,
    "text": "At least it's a real error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4476.614,
    "end": 4485.785,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4487.206,
    "end": 4492.092,
    "text": "So where to go is going to depend on where you're at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4492.763,
    "end": 4495.186,
    "text": " what time it is, all that kind of stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4497.348,
    "end": 4502.174,
    "text": "I hope that people look through, contribute, improve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4503.435,
    "end": 4522.737,
    "text": "I think one of the most high yield payoffs, if somebody is familiar with structured code generation methods or type checking or program synthesis techniques would be to develop a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4523.02,
    "end": 4549.99,
    "text": " template not to fix it as the one and only template to use but just here's a template that we can reference all of the other methods against and also know which degrees of freedom we're going to be able to move with and break because right now",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4550.358,
    "end": 4561.093,
    "text": " maybe we'll say, oh, well, you know, the visualization wanted there to be a hyphen here, and then you add the hyphen here, and the visualization works, but then the other, you know, something else doesn't work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4562.235,
    "end": 4574.352,
    "text": "So that is where I believe that using this order of operations is going to be helpful, or something similar to it, of course, pending everyone's input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4574.812,
    "end": 4576.635,
    "text": "But basically, like, first...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4577.881,
    "end": 4590.978,
    "text": " verify that the GNN module is loaded up and use this file structure and punctuation to confirm like, yeah, this is the version of GNN we're working with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4591.218,
    "end": 4594.483,
    "text": "This is what the symbols mean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4594.503,
    "end": 4601.151,
    "text": "Then, but that should just output the documentation and the version.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4601.652,
    "end": 4604.856,
    "text": "It shouldn't need any requirements to be installed in the workspace.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4605.877,
    "end": 4606.318,
    "text": "Then,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4607.345,
    "end": 4631.057,
    "text": " setup also it's kind of standalone and simple but it should install the requirements that are needed then an extremely comprehensive test suite can be run including tests about later modules so maybe there's more maybe there's a module that's not used in your flow but still it is type checked and tested with a template",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4632.59,
    "end": 4638.038,
    "text": " The type checking is basically the first of the real ingress steps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4639.039,
    "end": 4643.526,
    "text": "And this is where I know that there are better methods that people can bring to the table.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4648.433,
    "end": 4656.505,
    "text": "Okay, let's run main one more time just to see if it can get this Rx and Fur plane landed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4658.898,
    "end": 4676.465,
    "text": " Okay, so GNN type checker, maybe the resource estimator could be broken out to its own script or folder even, but the resource estimation is not costly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4676.966,
    "end": 4685.479,
    "text": "So I figured it probably can stay with the type checking because it is based upon the inferences made by the static type checker engine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4686.995,
    "end": 4706.893,
    "text": " export that that could go slightly earlier uh because you don't need to type check but type checking tells you yeah this is you're going to have an issue with with this variable it's not stated properly or like you won't and then export kind of confirms that that you can read in and out so if everything is green light up on through export",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4707.397,
    "end": 4713.224,
    "text": " The goal is like, you should be in the clear because we've already done static testing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4713.624,
    "end": 4718.329,
    "text": "We've already demonstrated that we can read in and then read out a given file.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4718.91,
    "end": 4734.788,
    "text": "So like downstream of five, I think it may even use the re-exported form after having already been checked to be the same as the input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4734.852,
    "end": 4746.823,
    "text": " So it's like if we can regenerate the original GNN file 100%, then we may want to work with that air-gapped version purely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4747.584,
    "end": 4749.586,
    "text": "Because on one hand, it's like it'd be the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4749.786,
    "end": 4752.168,
    "text": "But on the other hand, it's a version that we know that we wrote.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4753.649,
    "end": 4759.675,
    "text": "Visualization, there could be generic and specific visualization methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4760.536,
    "end": 4763.138,
    "text": "And so that would require a lot of flagging",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4763.219,
    "end": 4766.263,
    "text": " Like, where are we doing heat maps?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4767.385,
    "end": 4769.608,
    "text": "Where are we doing other kinds of visualizations?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4771.09,
    "end": 4782.865,
    "text": "MCP, again, that could be moved to a different order, but it should expose these methods and the neurosymbolic possibilities for MCP use.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4782.886,
    "end": 4791.437,
    "text": "Like, imagine the so-called language models, the transformer LLMs, calling the real language model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4793.155,
    "end": 4794.758,
    "text": " as program synthesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4795.88,
    "end": 4818.437,
    "text": "And then that active inference probabilistic language model could have a GNN dialect, so it could do program synthesis on GNN within a linguistic GNN representation inside of a cookie of just probabilistic general inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4820.037,
    "end": 4825.064,
    "text": " Ontology, that one could just be more of an archival ladder note.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4825.324,
    "end": 4829.29,
    "text": "It doesn't have to be eight, but it's pretty interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4829.55,
    "end": 4843.269,
    "text": "Like if we wanted to say, hey, this undergraduate course or this micro certification or training, you are going to fully understand this drone forest simulation example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4843.79,
    "end": 4846.314,
    "text": "It's a multi-agent simulation with drones in a forest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4846.994,
    "end": 4849.538,
    "text": "Here's the file that we're going to be looking at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4849.855,
    "end": 4852.878,
    "text": " And everything is going to be about those ontology terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4853.379,
    "end": 4862.189,
    "text": "So every single thing we say is going to be semantically laser eye on your education related to drones in the forest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4863.05,
    "end": 4870.278,
    "text": "And we can have one foot in that content and still pivot out and associate and talk about other topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4870.858,
    "end": 4876.324,
    "text": "But let's be clear with which ontology terms we're using in a controlled fashion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4878.346,
    "end": 4878.867,
    "text": "Render.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4879.808,
    "end": 4886.777,
    "text": " Maybe another word is slightly preferable, but this is just preparing the simulation for execution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4887.698,
    "end": 4901.596,
    "text": "So having a render, like a prepare, and then the execution phase may just be as simple, provably, as Python and then the Python script name.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4902.137,
    "end": 4902.778,
    "text": "That would be ideal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4903.579,
    "end": 4905.221,
    "text": "Doesn't do any other stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4906.262,
    "end": 4906.963,
    "text": "It just...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4907.787,
    "end": 4911.071,
    "text": " pulls the trigger on what render loaded up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4912.894,
    "end": 4918.601,
    "text": "LLM again, here you can just say, make it so that LLM does this other kind of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4920.063,
    "end": 4921.825,
    "text": "That's just more general LLM tools.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4921.906,
    "end": 4928.234,
    "text": "And then today on the stream, we made this site to generate it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4928.274,
    "end": 4930.777,
    "text": "So let's in the closing bit, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4931.859,
    "end": 4935.263,
    "text": "Let us look at the RxInfer",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4937.099,
    "end": 4942.288,
    "text": " to see if we got a better RxInfer simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4948.137,
    "end": 4948.999,
    "text": "Okay, that one didn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4951.122,
    "end": 4951.863,
    "text": "That one didn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4951.883,
    "end": 4963.883,
    "text": "Okay, so program synthesis for RxInfer waits till another day, but one thing that's gonna be awesome with RxInfer specifically is another degree of freedom where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4964.032,
    "end": 4975.788,
    "text": " we will be able to specify RxInfer models and then we could either run that locally or dispatch that to the RxInfer server API.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4976.89,
    "end": 4984.881,
    "text": "So then that's like earlier I said you can write recipes that you can't cook, but this is like separating out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4985.221,
    "end": 4988.065,
    "text": "Now it's like you can write a recipe that you know you can order.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4988.888,
    "end": 5004.328,
    "text": " because you can fully specify it and then send it to another endpoint that's just an Rx and first server that will run your app model with your conditions, but you've already done the type checking and the verification.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5004.408,
    "end": 5009.795,
    "text": "You know that you're working off of a generic implementation agnostic representation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5011.657,
    "end": 5015.762,
    "text": "Okay, and the LLM is still processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5016.563,
    "end": 5018.085,
    "text": "So let us...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5019.449,
    "end": 5021.492,
    "text": " Let that finish, then pull in the site.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5022.554,
    "end": 5034.772,
    "text": "But in terms of the last content here, we will read a little bit from the plain text to triple play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5036.534,
    "end": 5046.469,
    "text": "So we're going to improve this with one prompt and then see if anybody has any comments or questions after reading it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5047.31,
    "end": 5049.592,
    "text": " We'll write a new Who's On First dialogue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5052.895,
    "end": 5054.176,
    "text": "Triple play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5062.984,
    "end": 5065.547,
    "text": "Write a new novel dialogue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5066.788,
    "end": 5068.55,
    "text": "Who's On First style.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5070.531,
    "end": 5072.253,
    "text": "Whimsical and deadly serious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5074.295,
    "end": 5076.557,
    "text": "Total Americana deep lore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5078.967,
    "end": 5107.607,
    "text": " absolutely conveying all the topics with, quote, triple play puns related to, dragging the doc folder in, such that through the reading of such, the SRC code becomes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5110.608,
    "end": 5138.269,
    "text": " strangely obvious to those who pay attention again this must be like absurd speculative realism for a variety of reasons delivered in PhD dissertation length",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5139.177,
    "end": 5166.214,
    "text": " who's on first dialogue style or it could be three conversants if that will make the triple play pun play all the better thank you Andrew P",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5185.702,
    "end": 5210.562,
    "text": " okay we could have like a we could do a benchmark on how much do each of these llms know about 1920s baseball more okay while that chain of thought proceeds let's just see the llm stuff",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5211.74,
    "end": 5213.102,
    "text": " So it's written four of the five.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5213.563,
    "end": 5221.394,
    "text": "So each currently in the GNN folder examples is the target input directory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5222.916,
    "end": 5235.455,
    "text": "We might wanna have another directory called input or something so that it's just obvious which files are gonna be iterated through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5236.516,
    "end": 5239.08,
    "text": "But obviously that's one of the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5240.933,
    "end": 5251.586,
    "text": " ways to work faster if you only have one file in here, like it's gonna happen way faster.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5252.547,
    "end": 5259.876,
    "text": "But right now it has to do all the iterating and looping for all five of these examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5259.956,
    "end": 5269.708,
    "text": "So I think I'll move, I'll move three of them into archive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5272.844,
    "end": 5275.908,
    "text": " just so that people can get started and get it running faster.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5278.252,
    "end": 5284.541,
    "text": "But the language, they all could be developed in versions in really fun ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5291.791,
    "end": 5299.162,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5299.182,
    "end": 5299.442,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5309.851,
    "end": 5318.443,
    "text": " okay we'll generate this dialogue and then if there's any uh last comments",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5342.993,
    "end": 5346.957,
    "text": " Let's just see what else is in the docs folder about GNN.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5347.698,
    "end": 5350.14,
    "text": "This just summarizes that's a starting place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5351.081,
    "end": 5356.607,
    "text": "Here's a domain specific language DSL spec sheet for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5359.51,
    "end": 5367.178,
    "text": "More human legible examples, breaking down the different examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5370.938,
    "end": 5379.467,
    "text": " File structure, these kinds of markdown representations, mermaid plots, super useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5382.009,
    "end": 5383.491,
    "text": "How does it get implemented?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5383.551,
    "end": 5394.982,
    "text": "Again, the goal and the whole vision is like specifying generative models at a level above implementation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5395.163,
    "end": 5399.427,
    "text": "So if you're on a Intel versus an AMD processor,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5400.098,
    "end": 5402.441,
    "text": " the program is still going to work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5402.461,
    "end": 5414.477,
    "text": "So similarly, like if you're gonna be, there might be some features that are easier or only available within one of these computer languages or within one of these implementation environments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5415.398,
    "end": 5420.365,
    "text": "But in principle, we're talking about specifying something at a more semantic level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5422.588,
    "end": 5427.034,
    "text": "As mentioned and alluded to a little bit,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5427.132,
    "end": 5437.446,
    "text": " I think that this kind of executable program synthesis is going to have a lot of relevance for neurosymbolic synthetic hybrid intelligence architectures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5439.929,
    "end": 5449.242,
    "text": "There's a whole world of multi-agent specification and ways that we can work at this layer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5454.773,
    "end": 5458.136,
    "text": " Okay, Gemini, one more chance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5463.361,
    "end": 5474.03,
    "text": "Really fully write out this conversation, which we need.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5476.072,
    "end": 5484.139,
    "text": "Here's the plain text or a summary of it, of the paper itself, but it's linked in the repo with Jakob.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5486.515,
    "end": 5497.025,
    "text": " some information on the syntax, but this could be reflected probably better using this type of kit concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5507.315,
    "end": 5507.675,
    "text": "No.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5511.058,
    "end": 5514.261,
    "text": "This is the repo paste slash kit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5516.063,
    "end": 5521.853,
    "text": " Code-based mapping, symbol extraction, code search, building LLM-powered developer tools, agents, and workflow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5521.873,
    "end": 5523.817,
    "text": "When I saw that, I was like, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5525.179,
    "end": 5528.064,
    "text": "And making MCP servers access to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5532.312,
    "end": 5538.763,
    "text": "That's basically the docs, just to review what's there now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5540.144,
    "end": 5551.72,
    "text": " X4 to microservices, RxInfer, we can make a PyMDP folder just to be leaving a stub there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5556.427,
    "end": 5561.975,
    "text": "And that could have more generic documentation information on doing GNN PyMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5563.016,
    "end": 5569.425,
    "text": "But it'll just be to be... All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5571.97,
    "end": 5572.471,
    "text": " Here we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5579.102,
    "end": 5579.302,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5579.322,
    "end": 5580.404,
    "text": "I'm going to push it on GitHub.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5581.425,
    "end": 5584.53,
    "text": "Read this one-shotted dialogue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5588.677,
    "end": 5592.303,
    "text": "Oh, the LLM is still working for some reason.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5595.088,
    "end": 5595.208,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5595.228,
    "end": 5595.328,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5597.333,
    "end": 5613.37,
    "text": " Read the dialogue, and then either it will end on an extremely dramatic funny note, we haven't looked at it yet, or maybe somebody will have an appropriate comment or question in the next minute or two, at which point I will then read that one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5615.452,
    "end": 5618.655,
    "text": "So here we are in other triple play dialogue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5618.795,
    "end": 5619.776,
    "text": "Okay, here we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5624.802,
    "end": 5626.243,
    "text": "The GNN triple play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5628.535,
    "end": 5631.9,
    "text": " A dialogue in three fits and many errors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5632.1,
    "end": 5633.042,
    "text": "Abner Doubleday.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5633.062,
    "end": 5635.425,
    "text": "Earnest, precise, a true believer in the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5635.946,
    "end": 5636.447,
    "text": "Capitalized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5637.047,
    "end": 5640.292,
    "text": "He's trying to explain the rules of Generalized Notation Notation .",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5641.534,
    "end": 5650.527,
    "text": "He often clutches a heavily annotated copy of what looks like a rulebook but is in fact doc.md.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5650.507,
    "end": 5659.183,
    "text": " Casey Spex Stumble, an old-time baseball manager, weathered, full of cracker-barrel philosophy and prone to spectacular misunderstandings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5660.648,
    "end": 5669.62,
    "text": " He's always looking for the angle or the specs on the new talent and how this all plays out on the diamond, which he sometimes confuses with the GNN connections graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5669.64,
    "end": 5672.644,
    "text": "He squints at everything through thick, smudged spectacles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5673.546,
    "end": 5683.399,
    "text": "Branch, Ricky Wright, a shadowy, almost spectral figure, perhaps a long disenfranchised league commissioner, a rogue statistician, oh brother,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5683.379,
    "end": 5706.012,
    "text": " or a philosopher of the great american pastime now haunting the ontological back alleys of model specification he speaks in iraq oracular often unsettling pronouncements his voice like the creek of an old stadium gate setting the deepest dustiest back office of the national generative model league ngml",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5707.055,
    "end": 5707.576,
    "text": " Headquarters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5708.116,
    "end": 5721.295,
    "text": "A forgotten annex that smells of old leather, stale cigars, linament, and the faint, sharp tang of ozone from ancient calculating machines that were rumored to predict not just game outcomes, but the very fabric of fan belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5722.837,
    "end": 5736.235,
    "text": "Yellowed schematics of factor graphs and base nets are pinned to the peeling wallpaper, interspersed with faded daguerreotypes of stern-faced men in bowler hats who might have been pioneering statisticians, spiritualists, or perhaps both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5737.16,
    "end": 5746.553,
    "text": " A single, fly-specked gas lamp sputters erratically, casting long dancing shadows that make the GNN diagrams on the wall seem to shift and writhe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5747.975,
    "end": 5753.323,
    "text": "A ticker tape machine in the corner occasionally coughs out cryptic, decontextualized messages, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5753.443,
    "end": 5757.329,
    "text": "model name not found, state space undefined, policy does not converge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5758.591,
    "end": 5763.117,
    "text": "The curtain rises, or rather the dust moats swirl expectantly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5763.232,
    "end": 5766.096,
    "text": " Abner is pacing, occasionally tapping his rulebook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5766.697,
    "end": 5773.026,
    "text": "Spex is trying to whittle a piece of what might be a broken bat or a very large pencil with a penknife.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5773.046,
    "end": 5778.513,
    "text": "Rickety is half hidden in the shadows, only a glint of an eye and the occasional wisp of pipe smoke visible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5779.595,
    "end": 5781.377,
    "text": "Bit the first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5781.397,
    "end": 5782.379,
    "text": "Who's our model name?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5783.941,
    "end": 5784.221,
    "text": "Abner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5784.842,
    "end": 5787.045,
    "text": "Clearing his throat, adjusting his spectacles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5787.599,
    "end": 5791.949,
    "text": " Gentlemen, welcome, or rather welcome back to the eternal deliberation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5792.611,
    "end": 5798.244,
    "text": "Today, we must rigorously define the parameters of our understanding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5799.046,
    "end": 5801.592,
    "text": "It all begins, as it musts, with the model name.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5802.374,
    "end": 5803.557,
    "text": "Clarity here is paramount.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5804.539,
    "end": 5805.642,
    "text": "Specs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5805.74,
    "end": 5806.641,
    "text": " Model name, eh?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5807.282,
    "end": 5807.963,
    "text": "Is he a new kid?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5808.364,
    "end": 5808.905,
    "text": "What's he bat?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5809.405,
    "end": 5809.786,
    "text": "Lefty?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5810.006,
    "end": 5810.307,
    "text": "Righty?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5810.907,
    "end": 5812.189,
    "text": "Got any pop?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5812.209,
    "end": 5812.77,
    "text": "We need pop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5813.611,
    "end": 5814.092,
    "text": "The fans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5814.633,
    "end": 5815.594,
    "text": "They scream for pop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5816.195,
    "end": 5816.876,
    "text": "And where's he from?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5817.717,
    "end": 5822.985,
    "text": "Don't tell me he's another one of them fancy college boys who can't hit a curveball in the state space block.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5824.147,
    "end": 5824.447,
    "text": "Abner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5825.048,
    "end": 5825.388,
    "text": "Sighs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5825.609,
    "end": 5828.132,
    "text": "A small puff of dust rises from his waistcoat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5829.014,
    "end": 5829.534,
    "text": "No specs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5830.496,
    "end": 5832.118,
    "text": "Model name isn't a player.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5832.706,
    "end": 5840.287,
    "text": " It's the designation, the unique identifier for the entire conceptual architecture we are attempting to instantiate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5841.15,
    "end": 5847.407,
    "text": "Think of it as the banner under which the whole enterprise marches, the grand title on the spine of the almanac.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5848.552,
    "end": 5875.234,
    "text": " so like the team name the generative giants the notation nationals the markov chain marauders i had a team once the mudville nine good bunch of fellas terrible fielders lost 17 straight in the time horizon 17 each discrete time step of fresh agony rickety voice rasps from the shadows like dry leaves skittering across an abandoned home plate the name",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5876.058,
    "end": 5878.981,
    "text": " Yes, before the word there is the naming.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5880.022,
    "end": 5883.746,
    "text": "Before the connections are drawn, the model name is whispered into the void.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5884.667,
    "end": 5889.953,
    "text": "It is the first casting of the die, the initial prior block from which all subsequent beliefs unfold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5890.714,
    "end": 5899.163,
    "text": "Does the name sing to the Acton Phantology annotation, or does it merely echo in the empty grandstands of failed hypotheses?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5900.425,
    "end": 5901.467,
    "text": " Precisely, Mr. Wright.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5901.887,
    "end": 5903.009,
    "text": "Well, almost.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5903.71,
    "end": 5908.017,
    "text": "It's less about singing and more about unambiguous referencing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5909.519,
    "end": 5917.231,
    "text": "As stipulated in doc slash file structure doc.md section 2, it's a descriptor, a label.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5917.512,
    "end": 5919.915,
    "text": "For example, GNN PyMDP agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5920.356,
    "end": 5920.837,
    "text": "Concise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5921.458,
    "end": 5923.761,
    "text": "Informative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5923.781,
    "end": 5924.803,
    "text": "PyMDP agent?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5925.484,
    "end": 5926.686,
    "text": "Sounds foreign.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5926.733,
    "end": 5928.596,
    "text": " Is he one of them international league fellas?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5929.156,
    "end": 5929.817,
    "text": "Got a good arm?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5930.298,
    "end": 5930.879,
    "text": "This agent?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5931.72,
    "end": 5933.002,
    "text": "Can he play multiple positions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5933.763,
    "end": 5938.47,
    "text": "Like, can he cover hidden state and also fill in at observation if we're in a pinch?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5939.952,
    "end": 5940.613,
    "text": "Versatility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5941.254,
    "end": 5942.455,
    "text": "That's the ticket in this league.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5943.096,
    "end": 5945.279,
    "text": "A real triple play threat, if you catch my drift.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5947.763,
    "end": 5949.265,
    "text": "Abner, massaging his temples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5949.766,
    "end": 5955.053,
    "text": "It's... PyMDP refers to the Python library for Markov decision processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5955.522,
    "end": 5957.344,
    "text": " The agent is the model itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5958.306,
    "end": 5962.592,
    "text": "It's not about positions on a field specs, but about variables in a system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5964.154,
    "end": 5964.835,
    "text": "Variables, eh?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5965.516,
    "end": 5967.038,
    "text": "So like guys who are inconsistent?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5967.598,
    "end": 5969.341,
    "text": "Hot one day, cold the next?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5969.361,
    "end": 5971.344,
    "text": "We got a whole roster full of variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5972.445,
    "end": 5977.752,
    "text": "S underscore F0 couldn't hit water if he fell out of a boat last Tuesday, and O underscore M1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5978.734,
    "end": 5981.918,
    "text": "Don't get me started on O underscore M1's fielding errors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5982.252,
    "end": 5983.473,
    "text": " Cost us the pennant, that one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5984.094,
    "end": 5986.116,
    "text": "Initial parameterization was all wrong for him.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5988.218,
    "end": 5988.539,
    "text": "Rickety.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5989.159,
    "end": 5990.36,
    "text": "The initial parameterization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5990.961,
    "end": 5991.962,
    "text": "The primordial soup.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5992.583,
    "end": 5994.405,
    "text": "The conditions at the dawn of the simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5995.125,
    "end": 5996.627,
    "text": "Was the bat corked from the start?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5997.268,
    "end": 5999.31,
    "text": "Were the dice loaded in the state space block?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5999.99,
    "end": 6007.298,
    "text": "Or was it merely a D underscore F zero set to uniform ignorance awaiting the harsh lessons of observation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6009.067,
    "end": 6009.388,
    "text": " Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6010.569,
    "end": 6012.332,
    "text": "The D underscore F zero vector.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6012.953,
    "end": 6015.858,
    "text": "The prior belief over initial states for the factor zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6016.539,
    "end": 6017.22,
    "text": "You see, specs?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6017.741,
    "end": 6018.943,
    "text": "Model name sets the stage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6019.364,
    "end": 6020.786,
    "text": "Then comes the model annotation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6022.489,
    "end": 6023.31,
    "text": "Model annotation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6024.191,
    "end": 6026.495,
    "text": "Is that the fella who writes down what model name does?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6027.036,
    "end": 6027.957,
    "text": "Like a scorekeeper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6028.899,
    "end": 6030.822,
    "text": "Or one of them newspaper scribblers?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6031.703,
    "end": 6033.927,
    "text": "Always looking for a model name to tear down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6034.683,
    "end": 6040.812,
    "text": " We had a guy, Scoop McMurphy, used to say my policy vector was more like a meandering suggestion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6041.733,
    "end": 6042.414,
    "text": "The nerve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6044.116,
    "end": 6044.397,
    "text": "Abner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6045.198,
    "end": 6048.403,
    "text": "The model annotation is a free text caption, Spex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6049.224,
    "end": 6053.089,
    "text": "It explains the model's purpose, its context, its raison d'etre.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6054.091,
    "end": 6058.116,
    "text": "It's the color commentary, if you will, to the model name's play-by-play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6058.136,
    "end": 6060.64,
    "text": "It's where you describe the triple play of GNN.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6060.704,
    "end": 6066.37,
    "text": " the text-based specification, the graphical model intuition, and the executable cognitive model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6067.711,
    "end": 6068.392,
    "text": "Triple play?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6069.353,
    "end": 6070.274,
    "text": "Now you're talking, Abner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6071.315,
    "end": 6078.862,
    "text": "So model name is the batter, model annotation is the guy on first, and who's on second?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6079.122,
    "end": 6080.164,
    "text": "Is it state space block?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6080.744,
    "end": 6082.446,
    "text": "He sounds like a big fella, a slugger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6084.408,
    "end": 6086.61,
    "text": "This is going to be a long time horizon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6086.708,
    "end": 6089.312,
    "text": " State space block isn't a who, it's a what.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6089.753,
    "end": 6090.454,
    "text": "It's the where.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6091.135,
    "end": 6093.779,
    "text": "It's the definition of all possible states the system can be in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6094.28,
    "end": 6098.025,
    "text": "The dimensions of a diamond itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6098.045,
    "end": 6104.175,
    "text": "I'm going to skip on, since there's many sections, to the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6105.277,
    "end": 6107.54,
    "text": "But let's skip.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6107.841,
    "end": 6108.101,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6109.383,
    "end": 6110.184,
    "text": "Last section.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6111.667,
    "end": 6111.787,
    "text": "Abner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6111.807,
    "end": 6112.007,
    "text": "Abner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6113.371,
    "end": 6140.273,
    "text": " looks from specs to rickety a dawning realization or perhaps just fatigue in his eyes so src main.py that orchestrates the one gnn parsing the two setup environment configuration the three export transformations the four gn type checker validation and the five render execution that's just the empire calling the game ensuring the rules of generalized notation notation are followed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6141.181,
    "end": 6141.762,
    "text": " The umpire.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6142.263,
    "end": 6142.683,
    "text": "Of course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6143.104,
    "end": 6144.206,
    "text": "That's main.py.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6144.847,
    "end": 6150.316,
    "text": "Always sticking his nose in, checking the GNN version and flags, and making sure the footer and the signature are in order.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6151.017,
    "end": 6154.182,
    "text": "Thinks he's God or G or some other fancy letter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6154.763,
    "end": 6160.773,
    "text": "But without him, it's all just output slash log slash chaos dot txt.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6160.793,
    "end": 6161.094,
    "text": "Rickety.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6161.755,
    "end": 6163.077,
    "text": "The main.py.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6163.858,
    "end": 6165.501,
    "text": "The silent orchestrator.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6165.818,
    "end": 6168.602,
    "text": " the loom upon which the GNN tapestry is woven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6169.343,
    "end": 6174.411,
    "text": "It does not judge the model annotation's poetry, nor the equation's elegance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6174.431,
    "end": 6178.437,
    "text": "It merely ensures the pipeline flows, from text to graph to code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6179.779,
    "end": 6181.501,
    "text": "A humble servant of the triple play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6182.282,
    "end": 6189.793,
    "text": "The true mystery, gentlemen, is not who's on first or what's on second, or even I don't know on third.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6190.594,
    "end": 6193.699,
    "text": "It's why we play the game at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6194.405,
    "end": 6202.105,
    "text": " And for that answer, you'll need to consult a model name far grander than any found in SRC slash GNN slash examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6204.231,
    "end": 6205.976,
    "text": "Rickety fades further into the shadows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6206.998,
    "end": 6210.608,
    "text": "Specs starts idly checking model parameters on an imaginary bat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6211.465,
    "end": 6218.034,
    "text": " Abner stares at his GNN rulebook, a single bead of sweat tracing a path through the dust on his forehead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6218.755,
    "end": 6221.639,
    "text": "The ticker tape machine clatters one last time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6222.58,
    "end": 6223.642,
    "text": "Simulation complete.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6224.723,
    "end": 6227.748,
    "text": "Observed outcome unlikely under current priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6228.509,
    "end": 6230.491,
    "text": "Suggest revising world models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6231.693,
    "end": 6234.517,
    "text": "Or perhaps the rules of the game itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6235.598,
    "end": 6240.325,
    "text": "The gas lamp sputters and dies, plunging the room into near darkness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6240.558,
    "end": 6246.214,
    "text": " illuminated only by the faint residual glow of unvalidated hypotheses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6283.167,
    "end": 6283.528,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6284.672,
    "end": 6285.294,
    "text": "Thanks, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6285.956,
    "end": 6288.746,
    "text": "Hope this was pragmatic and epistemic for you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6289.408,
    "end": 6292.177,
    "text": "Looking forward to people's feedback and collaborations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6292.819,
    "end": 6293.582,
    "text": "Acting for Surf.",
    "speaker": "SPEAKER_00"
  }
]