[
  {
    "start": 8.72,
    "end": 36.24,
    "text": " all right i think we're live hello everyone welcome to the active inference live stream my name is daniel friedman it is december 2nd 2020 and i'm looking forward to this discussion welcome to teamcom teamcom is an experiment in online team communication learning and practice related to active inference you can find out about us at our website activeinference.org",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 37.515,
    "end": 66.149,
    "text": " on twitter at our gmail account our youtube channel or our public keybase team and username this is a recorded and an archived live stream so please provide us with feedback so that we can improve on our work all backgrounds and perspectives are welcome here and as far as video etiquette for live streams goes remember to mute if there's noise in your background raise your hand so that we can hear from everybody and use respectful speech behavior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 67.068,
    "end": 87.929,
    "text": " also just as far as schedules go for the rest of 2020 we're going to have four meetings they are going to be on december 8th and 15th discussing this paper that i'm going to talk about right now a variational approach to scripts and then on december 22nd and december 29th we will be in act imp stream 11.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 89.534,
    "end": 112.195,
    "text": " and we will read a more mathematical paper called sophisticated effective inference simulating anticipatory effective dynamics of the imagining future so this is going to be the last four meetings of active stream for 2020 in december two on this paper two on the next paper we have a lot planned for 2021 so if you're interested in participating in 2021 in any way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 113.937,
    "end": 116.1,
    "text": " definitely contact us if you want to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 116.82,
    "end": 120.565,
    "text": "And we also look forward to doing a few new kinds of events.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 121.125,
    "end": 126.431,
    "text": "So if you have an idea for an event or for a collaboration that we could do with ActiveStream, that'd be pretty cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 127.913,
    "end": 133.119,
    "text": "Today in ActiveStream number 10.0, finally getting up there in the double digits,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 134.585,
    "end": 142.393,
    "text": " The goal will be to set the context for the next two weeks of discussion with everybody who wants to, which is going to be 10.1 and 10.2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 143.514,
    "end": 150.461,
    "text": "The paper we're going to be discussing is called A Variational Approach to Scripts by Alboracin et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 150.481,
    "end": 151.402,
    "text": "on 6-29-2020 on SciArchive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 154.602,
    "end": 160.506,
    "text": " This video, as all the dot zeros are, is just an introduction or a context for some of these ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 160.986,
    "end": 164.049,
    "text": "It isn't a review or a meta-analysis or a final word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 165.029,
    "end": 170.593,
    "text": "And I'll really just be trying to contextualize some of the ideas and vocabulary of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 170.793,
    "end": 179.099,
    "text": "So the goal would be, if you're in the free energy principle or active inference research community, this is going to be maybe a chance to learn something new about scripts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 179.319,
    "end": 180.14,
    "text": "Certainly it was for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 180.66,
    "end": 209.45,
    "text": " and then maybe you're more familiar with script or social script theory at which point this hopefully would be an inter interesting introduction into thinking about active inference so it is always going to be bi-directional like that and the punchline of this paper if i could summarize it as such would be active inference can unify different conceptions of this script concept leading to new avenues and approaches for research in fields such as social behavior criminology and sexology",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 209.81,
    "end": 235.848,
    "text": " yep all of those are fields in section 9.0 first we're going to go through the keywords of the paper then go through the aims and claims abstract and roadmap of the paper which are going to tell us a lot about how the authors lay out their argument as well as structure what it is that they're trying to do in section c we will go to types and uses of scripts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 237.202,
    "end": 261.281,
    "text": " and draw on some quotations from the authors and then just look at the two figures briefly to understand what they might be representing or doing in the paper and in 10.1 and 10.2 which are the up to up to coming weeks we will be discussing this paper so save and submit your questions get in touch if you want to participate and anyone is welcome to join",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 262.588,
    "end": 264.169,
    "text": " First, we're gonna talk about keywords.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 264.809,
    "end": 266.951,
    "text": "The keywords of this paper are as follows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 267.091,
    "end": 269.312,
    "text": "First is active inference, which is great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 269.393,
    "end": 272.955,
    "text": "We always like to see that as a keyword, as well as the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 273.575,
    "end": 277.658,
    "text": "So active inference is about the fusion of action and inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 277.938,
    "end": 286.864,
    "text": "It brings together fields like cybernetics, ecological control theory, all these different things that we've been talking about, but maybe this is someone's first active stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 287.284,
    "end": 292.488,
    "text": "Free energy principle is a broader physics-based or mathematics-based framework,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 293.629,
    "end": 298.271,
    "text": " for understanding how multi-scale systems exist and what it is that they do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 298.772,
    "end": 301.513,
    "text": "Active inference is a process theory under the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 301.753,
    "end": 303.834,
    "text": "We're not going to have slides for those in this talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 305.195,
    "end": 320.084,
    "text": "What we are going to talk about to contextualize the paper philosophically and from a conceptual perspective is internalism and externalism, as well as the center topic of the paper, which is scripts, script theory, and specifically social scripts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 321.613,
    "end": 326.424,
    "text": " We'll hear about two different deployments or two different senses of the script.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 327.005,
    "end": 329.611,
    "text": "One is an internal psychological schema.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 329.971,
    "end": 331.775,
    "text": "So that's like something happening in your head.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 332.717,
    "end": 337.261,
    "text": " Maybe that would be amenable to a psychological or a neuropsychiatric intervention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 338.242,
    "end": 342.767,
    "text": "And then another sense of scripts are in terms of constitutive behavioral categories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 343.227,
    "end": 353.457,
    "text": "So these are sort of classifications of people or of action sequences, and they are things that are enacted, but they may or may not hinge upon these internal psychological schema.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 353.977,
    "end": 371.067,
    "text": " in fact we're going to go into a fair amount of detail how the authors lay out the differences amongst different uses of the script concept but that's just to prime it for now let's get to this first philosophy point but it's pretty broad it applies to a lot of areas and that's internalism and externalism",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 371.932,
    "end": 381.738,
    "text": " So in ACT-InfStream 5, that's 5.0, 5.1, and 5.2, we specifically talked about internalism and externalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 382.058,
    "end": 387.081,
    "text": "We talked about the paper Multiscale Integration Beyond Internalism and Externalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 387.561,
    "end": 411.437,
    "text": " so we talked a lot about how active inference specifically is able to reframe this debate or dichotomy between internalism and externalism or internalism versus externalism potentially can recast our understanding of how these systems work in a way that's going to be amenable to better understanding control design predict etc that's what we talked about in actin act in five so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 411.997,
    "end": 425.102,
    "text": " But without going into too many details of active inference now, let's think about three big ways that we're going to use active inference to transcend this internalism and externalism debate slash debacle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 426.169,
    "end": 434.651,
    "text": " And the three that we're going to talk about right now are one, the fact that real evolutionary adaptive systems are multi-scale and nested.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 435.251,
    "end": 439.352,
    "text": "So multi-scale nested systems as a way that we can escape internalism and externalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 439.932,
    "end": 444.813,
    "text": "A second way that we can escape internalism and externalism is with local causal closure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 445.473,
    "end": 450.194,
    "text": "And a third route is with this relationship between action and inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 450.794,
    "end": 458.902,
    "text": " So these are three different talking points that you can think about are countering the internalism versus externalism dialectic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 459.944,
    "end": 466.971,
    "text": "So the first thing is this idea that real systems, especially the ones that we care about, are multi-scale and nested.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 466.991,
    "end": 469.613,
    "text": "They're hierarchically embedded or they're heterarchical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 469.673,
    "end": 470.935,
    "text": "There's a lot of ways to talk about them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 471.015,
    "end": 472.436,
    "text": "They're complex, adaptive systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 473.428,
    "end": 487.865,
    "text": " and the paper that we drew on in act m5 and i'll return to here is this paper in 2012 by dennis noble called a theory of biological relativity no privileged level of causation so his focus is on first",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 488.405,
    "end": 502.189,
    "text": " clarifying the so-called upward causation pathway, which is sort of a default understanding for many people, which is that smaller things, quote, cause bigger things to happen in the sense that they compose them, ergo they must cause them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 502.529,
    "end": 508.271,
    "text": "And we can look at how genes are related to proteins and RNA through a somewhat special connection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 508.891,
    "end": 521.875,
    "text": " and then how physical entities, nesting-wise, compose each other into bigger and bigger organizations through organs, organisms, social organizations, and then ecosystems, technological, government schemes, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 522.875,
    "end": 536.219,
    "text": "And where Noble critiques this simple upward causative model, which lends itself to reductionism, because why wouldn't you study the most basal aspect of the system if that's where the most causal potential were relied upon?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 538.553,
    "end": 555.67,
    "text": " he highlights this role of so-called top-down forces, which are structuring forces from slower timescales as well as broader scales of spatial analysis about how states of organisms can influence downward, in some sense, smaller things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 557.6,
    "end": 571.32,
    "text": " And there's the larger versus smaller continuum that we can still think about and to which extent we privilege or prioritize bottom-up or emergent phenomena versus top-down, which could also be considered emergent control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 571.6,
    "end": 573.523,
    "text": "So really emergence is on both sides of the coin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 574.304,
    "end": 578.386,
    "text": " But at a given level of analysis, the larger scale can be considered external.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 578.747,
    "end": 586.451,
    "text": "So when the organism's epithelia is the boundary condition, then society is external and proteins and cellular features are internal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 586.811,
    "end": 591.034,
    "text": "And if you were to go into a cell, internal would be even smaller than the cell, almost by definition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 591.994,
    "end": 594.776,
    "text": "And so we can think about how",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 596.204,
    "end": 613.982,
    "text": " as there is no privileged level of causation in the sense that the interactions within and among levels of analysis are what results uniquely in the system's function and there's no way to tune one aspect without necessarily impinging upon another, we can say, well, yes, you could characterize things as being just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 615.062,
    "end": 638.211,
    "text": " simply outside of another thing you could say here's inside the house and this is outside the house so you can still have internal and externalized terms but this idea of internalism and externalism that the relevant causal features are internal to an organism versus are external to an organism versus the interaction it kind of is reframed in this very fractal hierarchical framework that the uh uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 640.225,
    "end": 643.246,
    "text": " no privilege level of causation argument is taking us towards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 643.266,
    "end": 644.566,
    "text": "So that's a systems biology approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 644.846,
    "end": 648.287,
    "text": "We're moving beyond internalism and externalism because real world systems are nested.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 649.107,
    "end": 657.809,
    "text": "A second type of argument that evades the internalism, externalism discussion is the idea of local causal closure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 658.649,
    "end": 665.53,
    "text": "And this is figure four from the paper that we discussed in Active Stream 5, and it is showing an autocatalytic network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 665.89,
    "end": 669.251,
    "text": "And so here you have different types of reactions and products.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 670.131,
    "end": 680.278,
    "text": " It's a metabolic network that involves an autocatalytic mechanism in the metabolic domain, but there's also autocatalytic closure that might be imagined semantically or culturally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 680.979,
    "end": 693.707,
    "text": "So what this is showing is that because the interactions of specific types and the integration of ecological resources, as well as multiple types of agents and processes internal to the process,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 694.668,
    "end": 722.696,
    "text": " as many different features are perhaps necessary and not alone are sufficient to generate the outcome of the system which is auto catalysis you take away one of these inputs it's just not going to work it's like taking away a vitamin from a human so you take away a vitamin and they might die but does that mean that the vitamin is the one and only thing that makes them live of course not but it does make us move beyond this internalism and externalism dichotomy because we understand that all real systems are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 723.616,
    "end": 736.284,
    "text": " at the interface between these two and that's related to phrasings like it is the nature of nurture to be natured or vice versa sort of just blurring the line between them because there's such causal dependence for example with our microbiome",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 737.588,
    "end": 749.543,
    "text": " The relevance for the scripts concept here is that whether something like a feature is internal or external to one perspective or another, it's part of an integrated causal story about the world as well as a perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 749.703,
    "end": 754.029,
    "text": "For example, telling a story from a third person's perspective versus second versus first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 755.137,
    "end": 762.019,
    "text": " And another area that we might return to is that the scripts require actors and communities of practice to enact them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 762.179,
    "end": 763.62,
    "text": "Otherwise, they're not real.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 764.02,
    "end": 766.561,
    "text": "So it's kind of like a tree falling in a forest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 766.601,
    "end": 767.241,
    "text": "Does anyone hear it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 767.301,
    "end": 770.662,
    "text": "Well, if there's a script in a file drawer, is it ever enacted?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 771.542,
    "end": 773.943,
    "text": "Maybe that's how it enacts what it is, but...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 775.134,
    "end": 776.815,
    "text": " In the social sense, it is not implemented.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 777.795,
    "end": 787.379,
    "text": "And this is going to bring us to some other drama-related dramaturgical concepts and this idea about set and setting and the context and the performer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 787.74,
    "end": 794.863,
    "text": "And then just the last way that we can move beyond internalism and externalism is this fundamental relationship between action and inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 795.143,
    "end": 797.624,
    "text": "So yeah, it's playing out in nested systems like point one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 798.204,
    "end": 801.526,
    "text": "And yes, it's also related to causal closure in a sense,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 802.586,
    "end": 829.455,
    "text": " uh point two but this one is actually unique in that it's saying no just fundamentally wherever the causal relations may be and whether this is a one level system or multi-level system it's actually the fact that action and perception are happening as an integrated coupling that we can debate about what is external or what is internal but we find that there's actually uh somewhat of a reframing of this issue of whether something that's actually happening is outside versus inside",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 830.575,
    "end": 840.688,
    "text": " Okay, so those are just a few internalism and externalism questions that are more general that are going to be returned to when we're talking about scripts and whether they are internal or external to an agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 842.486,
    "end": 846.309,
    "text": " The main topic of today is this script theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 846.59,
    "end": 847.771,
    "text": "So what is a script?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 848.531,
    "end": 852.595,
    "text": "Broadly, a script is a pattern of action and or thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 853.195,
    "end": 855.697,
    "text": "And it turns out there's a lot of ways that people have thought about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 855.797,
    "end": 862.363,
    "text": "And there's also a lot of related topics, which is one of the reasons why a unifying effort is being made.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 862.603,
    "end": 867.864,
    "text": " performed here because apparently there's a lot of disagreement about scripts and what they mean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 868.224,
    "end": 885.849,
    "text": "So terms that I thought could be relevant to call them besides for scripts because they include, for example, nonverbal behavior, something like an archetype or a situation or scenario, a storyline or a narrative, a creode to use Waddington's term from epigenetics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 886.669,
    "end": 889.55,
    "text": "So it's kind of like a pattern of action and or thought",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 890.655,
    "end": 892.916,
    "text": " in one way or another depending on the situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 893.476,
    "end": 901.038,
    "text": "And the paper is going to go on to explore two specific axes of variation you can think about in the scripts concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 903.999,
    "end": 906.639,
    "text": "Scripts are happening in various contexts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 906.96,
    "end": 917.883,
    "text": "So first with no citations, I'll just provide a quote from them and then a few examples of areas where it could be interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 918.283,
    "end": 918.743,
    "text": "So they write,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 919.423,
    "end": 922.585,
    "text": " The Scripps construct has a long history spanning several disciplines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 923.145,
    "end": 942.636,
    "text": "Scripps have been applied fruitfully to study human behavior in different fields, from disciplines centered on individual human minds and their interactions such as psychology, neuroscience, and artificial intelligence, to the social sciences, where it has been used influentially in fields like sociology, criminology, anthropology, and sexology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 943.236,
    "end": 946.398,
    "text": "Different definitions of Scripps abound with different focuses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 947.398,
    "end": 951.17,
    "text": " The concept sometimes is used under different names such as action schemas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 952.558,
    "end": 977.85,
    "text": " idea that motivates the use of the script construct in these scientific approaches are is at its core dramaturgical that means it's related to performance according to its proponents what enables social agents to act in situationally appropriate ways is a shared set of instructions or normative prescriptions for situationally appropriate behavior that's why it's called a script just like the script guides an actor it's sort of a loose",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 978.45,
    "end": 1002.069,
    "text": " version of a script that's going to not dictate exactly what we say for example i'm not reading from a script and most people aren't when they're on a video call but it's going to be a little bit broader than that but of course not so broad as to explain everything the implication of this view is that in order to act as a cohesive social group in which every agent knows and enacts their role agents must share a common body of knowledge i.e a script",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1003.305,
    "end": 1006.046,
    "text": " that prescribe situationally appropriate modes of being.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1006.486,
    "end": 1011.148,
    "text": "This is metaphorically akin to actors sharing a dramaturgical script, hence the name of the construct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1011.849,
    "end": 1027.376,
    "text": "Scripts are used in scientific theories to shed light on how internalized psychological models are integrated with externalized social models by drawing on a pool of common styles of performance and cognition through contextualized acts, such as speech acts, and their ensured actions driven by goals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1027.956,
    "end": 1032.418,
    "text": "So it's like all the worlds this age, but then they made a research field about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1033.564,
    "end": 1048.676,
    "text": " we see it playing out on the actual stage because there's raised platforms where people perform and then there's non-raised platforms where people perform, but there's scripts for many of these situations, sometimes literally written out, other times more broadly,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1050.802,
    "end": 1052.784,
    "text": " These kinds of scripts happen on the sidewalk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1053.124,
    "end": 1072.663,
    "text": "For example, it's interesting to think about how just the ways that people have viewed each other's bodies, their peripersonal space, and whether they step out of the way on the sidewalk, depending on what someone is or isn't wearing, these are all things that have changed over 2020, and so we're seeing the script update or change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1073.863,
    "end": 1082.731,
    "text": " Scripts happen in the courtroom, whether it's the judge and the priority that this person has by virtue of their training and position in the room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1083.092,
    "end": 1091.199,
    "text": "But these types of formal acts are places where scripts have been applied because in some senses, the script is defined like a religious service.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1091.94,
    "end": 1116.58,
    "text": " and ritual spaces in general are places where scripts can play out and so here one can literalize what is happening and talk about well the angle of this object is at this angle and the repetition of this happens this many times or there's an experiential element so scripts also reaches into this area of experience and what makes something important to somebody and all that behavioral work",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1117.958,
    "end": 1121.784,
    "text": " One area that we'll talk about in just a few minutes is the crime scene.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1122.184,
    "end": 1133.581,
    "text": "So scripts have been applied to really break down crimes in some ways into their sub-components to understand the patterns and the flow charts by which certain crimes are happening or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1134.585,
    "end": 1140.59,
    "text": " And also another example might be computer scripts, which isn't really talked about much here specifically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1141.11,
    "end": 1155.1,
    "text": "The entire framework is computationalist in that, like active inference, it holds us a high value to at least be able to state things in pseudocode or algorithmically or as a process rather than just an endpoint that's achieved, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1156.481,
    "end": 1183.332,
    "text": " uh but we can also think about these scripts especially when they involve our extended niche our shared uh niche of attention and technology and platforms computer scripts are playing into human scripts it's almost like one of them is programming the other let's return to that crime scene version of a script this is going to be some figures from a book from 2018 chapter called crime script analysis",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1185.29,
    "end": 1194.597,
    "text": " So this is first just a structural way of looking at how quantitative data are used in the academic psychology model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1195.257,
    "end": 1203.263,
    "text": "So we see behavior on the right and the arrows are like the hypothesized or empirically tested correlations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1203.823,
    "end": 1218.917,
    "text": " This is basically like a structural equation model, but it's just saying there's all these features that are related, for example, to the person's personality on the top, to things like their behavior, and that can have many levels of detail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1218.957,
    "end": 1226.023,
    "text": "But this is just at the most broad level, the way that different features of the person and the context are statistically brought together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1226.744,
    "end": 1245.031,
    "text": " people developed a little bit beyond this simple put all their features into a database and run a regression type model to this idea of a state transition diagram, which is drawing, interestingly, on concepts like Markov chains and Markov fields.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1245.091,
    "end": 1247.712,
    "text": "These are things that come back in Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1248.212,
    "end": 1260.066,
    "text": " but they're used in this crime script community and this one i believe sows the behaviors leading up to drinking and driving which is a crime and so this bottom",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1261.656,
    "end": 1284.31,
    "text": " here it says this is the drive's vehicle all these arrows all these routes by which they're led there so maybe they were at home and um then went out somewhere or they were somewhere else and they came home there's different funnels different flow charts and the question that we're going to ask here is could we simplify and integrate this with active inference so if we go with no",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1285.231,
    "end": 1299.586,
    "text": " map and we just say let's survey 500 people and then let's do some expert analysis crowdsourcing some natural language processing let's just figure out all the attributes that led to these people uh doing this crime",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1300.547,
    "end": 1329.525,
    "text": " then we might be able to pull out a bunch of these nodes maybe we could even make a flow chart like this but could we have a more broad theory other than just interviewing hundreds of people always knowing that there's going to be types of crimes being committed that are going to be outside of our scope and just maybe have a more integrated framework for talking about how certain norms are violated to take into account a lot more features and a lot more richness in the kinds of ways that agents actually interface with the world",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1330.464,
    "end": 1347.631,
    "text": " So that would be the goal with script theory would be in all these different fields that we would be able to simplify from just this web of correlations on the left and this network of flow of all these probabilistic attributes probably averaged out over important subgroups",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1348.171,
    "end": 1357.822,
    "text": " Could we just take a step back and ask about action in general and thinking about these specific actions that violate formal or informal rules or norms?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1358.323,
    "end": 1360.806,
    "text": "Could we use active inference in that situation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1362.912,
    "end": 1367.093,
    "text": " Here was just a social script paper that I thought was pretty interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1367.553,
    "end": 1371.934,
    "text": "So it's called Social Scripts and the Three Theoretical Approaches to Culture by Robert St.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1371.954,
    "end": 1373.095,
    "text": "Clair in Louisville.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1373.675,
    "end": 1383.017,
    "text": "It says, abstract, in attempting to investigate the cultural sciences, researchers have developed frameworks of which Ratner's three categories are most informative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1383.598,
    "end": 1388.339,
    "text": "The three categories are symbolic, activity theory, and individualistic approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1389.437,
    "end": 1394.639,
    "text": " Also, social script theory is a promising path in the integration of symbolic and activity theory models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1395.339,
    "end": 1396.78,
    "text": "So that's pretty cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1397.16,
    "end": 1407.304,
    "text": "This is coming from a non-active inference community, and it's a synthesis of some of the major threads in cultural research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1408.104,
    "end": 1415.147,
    "text": "And again, those three categories are the symbolic, the activity theory, and the individualistic approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1418.108,
    "end": 1420.489,
    "text": " This activity theory is kind of an interesting thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1421.429,
    "end": 1435.391,
    "text": "It's a strange idea to read about that people had to make a area of theory that was about action, but it actually does touch on things like action research today, activity theory, and there's a deep thread of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1435.831,
    "end": 1439.972,
    "text": "And sometimes highlighting this thread of activity theory is quite useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1440.632,
    "end": 1444.993,
    "text": "So here is what is written in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1446.829,
    "end": 1458.778,
    "text": " Okay, so first there's a discussion of the early activity theory and about how this activity theory was getting integrated with the neuroscientists, the philosophers, computer scientists, and cognitive scientists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1459.679,
    "end": 1461.5,
    "text": "And then there's a quoting from the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1461.92,
    "end": 1468.906,
    "text": "What is significant about the work of these early cognitive scientists is that they argued for a deeper understanding of language in artificial intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1470.168,
    "end": 1484.091,
    "text": " Schenck and Abelson, in 1977, for example, noted that scripts, protocols, and vocabularies were about language, so they naturally asked not only about how computers code human behavior, but also about how languages are used to negotiate social reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1484.311,
    "end": 1495.134,
    "text": "Minsky, in 1985, noted that in addition to using language to structure frames, scripts, metaphors, and the society of mind, one needs to look at the mind as a parallel processor,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1495.854,
    "end": 1515.675,
    "text": " one capable of handling several scripts simultaneously a situation comparable to how human languages function within social contexts understandably linguistics became one of the central disciplines within the cognitive sciences so that's about linguistics and computer science and cognitive science and artificial intelligence and then this is a closing quote from the paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1516.976,
    "end": 1537.817,
    "text": " can the personal approach to culture even be considered a viable model for the cultural sciences so that's the individualistic model which is basically saying that the priority of culture is just operating individuals nest mates it appears that the personal approach to culture espoused by postmodernists is not a viable model of culture who would have supposed that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1538.658,
    "end": 1548.282,
    "text": " When this model is articulated by social philosophers such as Foucault, Baudrillard, and Debord, the theory still lacks explanatory power as it is not able to account for activity theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1548.782,
    "end": 1554.885,
    "text": "What constitutes activity in this model is a passive embodiment of the signs and symbols of mass media and mass culture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1555.425,
    "end": 1559.927,
    "text": "The most promising path consists in this integration of symbolic models with activity theory models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1560.327,
    "end": 1562.528,
    "text": "This is exactly what social script theory has done.\"",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1563.209,
    "end": 1565.83,
    "text": "So very cool that in the social sphere,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1566.57,
    "end": 1574.754,
    "text": " the social script theory was perceived of as integrating the semiotics, the meaning and the communication of symbols with the action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1575.374,
    "end": 1580.837,
    "text": "And so there's actually a action inference or an action communication, action information nexus",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1582.458,
    "end": 1607.279,
    "text": " that was integrated in their vocabulary perhaps as social scripts because it has a computational bent you know run that script and you can even back 50 years ago people were talking about running multiple scripts and the ecological dependency so these are kind of classical ideas that potentially under active inference we could uh learn more about and then just the last point here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1608.24,
    "end": 1614.194,
    "text": " on this paper uh according to activity theory psychological phenomena are formed as people engaged in socially organized activity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1615.6,
    "end": 1620.103,
    "text": " Since these activities are socially formed, they provide a social and cultural influence on cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1620.544,
    "end": 1629.37,
    "text": "It should be noted that this concept of praxis has a long intellectual tradition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1630.07,
    "end": 1637.796,
    "text": "The focus on praxis in this essay is not about that long tradition of pragmatism in practice, but on activity theory which is connected with Vygotsky.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1638.916,
    "end": 1649.806,
    "text": " And so it goes back to marks and angles and some other interesting directions, but pretty cool to see that there's actually the pragmatism and then there's an action threat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1650.266,
    "end": 1655.431,
    "text": "So activity research wasn't merely about getting it done or being most effective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1655.891,
    "end": 1661.276,
    "text": "It was related to that bodily concept, body in motion, developmental component.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1661.756,
    "end": 1665.74,
    "text": " by Vygotsky and that led to ecological psychology and so many other areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1666.221,
    "end": 1672.928,
    "text": "So these are kind of cool threads that are combinations that are re-emerging within the context of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1673.789,
    "end": 1682.718,
    "text": "It's because what the free energy principle and active inference are searching for is something to say about the relationship between the world and agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1683.198,
    "end": 1706.263,
    "text": " so here we're kind of mutating this common slide yet again and we're thinking about agents who are interacting in a world and the world is a niche that is shared by the agents it's an ecological niche and that means that it's a niche of ecological resources as well as shared attention norms practice tools software video conferencing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1706.983,
    "end": 1711.765,
    "text": " This is where this script concept is going to come into play because we want something that's computable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1711.845,
    "end": 1717.547,
    "text": "We want something that is ecologically responsive, adaptive, can take on all these interesting traits that we want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1718.808,
    "end": 1724.09,
    "text": "And yep, the joint world niche is related to their shared affordances of agents in a niche, what they can do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1724.61,
    "end": 1732.034,
    "text": "It's related to their umwelt, what they can perceive, as well as their culture, memes, norms, all these other things, attention especially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1732.614,
    "end": 1735.095,
    "text": "And now we're going to bring this script topic in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1736.397,
    "end": 1747.442,
    "text": " All right, so the paper that we're going to be discussing in 10.1 and 10.2 is called A Variational Approach to Scripts, and the authors are on the right side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1748.442,
    "end": 1751.903,
    "text": "The aims and claims of the paper are as follows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1752.704,
    "end": 1760.647,
    "text": "They write, the aim of this paper is to formalize the notion of script using the modeling resources of the active inference framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1761.718,
    "end": 1772.68,
    "text": " The hope, I like that, that it's not just a claim, there's a hope as well, is to shed light on the multifarious uses of the construct of script as it is used in the sciences that study human behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1773.86,
    "end": 1780.163,
    "text": " Active inference is relevant here because it may provide the key to formulating an integrative script construct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1780.623,
    "end": 1784.985,
    "text": "So that's in their own words how they wanted to frame what they did in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1785.826,
    "end": 1797.331,
    "text": "And then I would write in non-active inference terms, how can we apply active inference to unify the study of scripts in the social, neurobehavioral, cultural, and computational dimensions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1801.215,
    "end": 1818.281,
    "text": " abstract is written here it is this paper proposes a formal reconstruction of the script construct by leveraging the active inference framework a behavioral modeling framework that casts action perception emotion and attention as processes of bayesian or variational inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1819.704,
    "end": 1825.87,
    "text": " We propose a first principles account of the script construct that integrates its different uses in the behavioral and social sciences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1826.59,
    "end": 1830.234,
    "text": "We begin by reviewing the recent literature that uses the script construct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1830.714,
    "end": 1835.218,
    "text": "We then examine the main mathematical and computational features of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1836.021,
    "end": 1841.644,
    "text": " Finally, we leverage the resources of active inference to offer a formal model of scripts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1842.444,
    "end": 1863.095,
    "text": "Our integrative model accounts for the dual nature of scripts as internal psychological schema used by agents to make sense of event types and as constitutive behavioral categories that make up social order, close parenthesis, and also for the stronger and weaker conceptions of the construct, which do and do not relate to explicit action sequences, respectively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1863.375,
    "end": 1865.536,
    "text": "We're going to get back to that binary soon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1867.281,
    "end": 1869.944,
    "text": " So the roadmap of the paper is as follows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1870.184,
    "end": 1878.352,
    "text": "They begin with an introduction and talking about the background of script theory, which was something that was a new area relatively for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1879.465,
    "end": 1881.886,
    "text": " They talk then about internalist approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1882.346,
    "end": 1887.067,
    "text": "So remember the broader discussion of internalism and externalism in multi-scale systems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1887.627,
    "end": 1890.928,
    "text": "Well, here we're going to be focusing on script theory, social script theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1891.068,
    "end": 1899.831,
    "text": "So the internalists are those who are taking approaches like psychology and neuroscience, as well as other reductionist facing approaches like artificial intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1901.621,
    "end": 1911.844,
    "text": " Then there'll be a section on externalism, which talks about the social sciences, which by their nature are interested in studying these higher level forces, larger scales of analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1912.344,
    "end": 1920.146,
    "text": "So fields like sociology, anthropology, criminology, and sexology often focus on the society looking in on the individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1920.666,
    "end": 1924.407,
    "text": "And so that is that pressure, kind of like a balloon, there's pressure out, pressure in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1924.847,
    "end": 1927.748,
    "text": "It's actually like internalism and externalism, and there's a membrane.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1928.168,
    "end": 1929.329,
    "text": "Could it be a Markov blanket?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1929.649,
    "end": 1930.029,
    "text": "Who knows?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1931.271,
    "end": 1940.876,
    "text": " We'll then move to the other axis beyond internalism and externalism is a strong versus weak conception of scripts, which we'll go through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1941.977,
    "end": 1944.338,
    "text": "They talk about the two extreme perspectives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1945.603,
    "end": 1970.389,
    "text": " then they talk about variations on scripts which are kind of what you would expect the performance components that relate to spontaneity and ecology and mutational variations all these types of things that cause scripts to vary after introducing script theory they move to the abcs of active inference by providing first a introduction to active inference which is perhaps great for us all to check out",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1971.471,
    "end": 1982.733,
    "text": " and then talk about how shared generative models can be thought of and how sociocultural dynamics can be thought about in the culture generating way as shared models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1983.633,
    "end": 1990.355,
    "text": "Figure one then has a simple generative model for policy selection, which is a figure that we'll get to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1991.095,
    "end": 1996.216,
    "text": "And then figure two is a heuristic description of the generative model of the niche and of the agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1997.935,
    "end": 2004.301,
    "text": " Section four is where they come together and talk about an active inference account of scripts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2004.561,
    "end": 2013.049,
    "text": "So as usual, introduction, area A, then active inference, then we bring those two areas together in section four or five or so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2013.81,
    "end": 2021.136,
    "text": "And in the active inference account of scripts, there's a discussion of scripts as shared conceptual niches about types of events.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2021.957,
    "end": 2037.351,
    "text": " as well as scripts as representations of typified sequences of events so blurring the idea of types and events in a way that we'll get to and then there's a discussion and a conclusion cool so that's the roadmap",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2037.972,
    "end": 2062.987,
    "text": " I think that in this contextualizing video, what would be helpful is to characterize not just the breadth of where scripts can apply or have applied or were useful, weren't useful, but zoom in on these two dimensions of variabilities and the specific problems that they cause in that field, and then how what Active Inference does will end up alleviating perhaps some of these tensions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2064.226,
    "end": 2066.847,
    "text": " This is about scripts and their discontents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2067.447,
    "end": 2068.447,
    "text": "So here's what they write.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2070.128,
    "end": 2074.769,
    "text": "There are some issues that stand in the way of an integrated model of scripts across fields.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2075.269,
    "end": 2086.392,
    "text": "The first is that the concept gets implemented differently in different theories and disciplines, which throws doubt on our ability to provide a unique definition that can do justice to all the use cases of the term in the literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2087.481,
    "end": 2097.788,
    "text": " Similarly, different terms can be used to describe very similar phenomena across domains of study, like script or schema, prepended with terms like sociocultural or cognitive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2098.348,
    "end": 2100.67,
    "text": "Some authors have attempted to unify the concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2101.371,
    "end": 2105.914,
    "text": "In our view, these attempts have had rather limited success, as the varied senses of the term suggest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2106.314,
    "end": 2107.094,
    "text": "So what's the issue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2107.495,
    "end": 2111.918,
    "text": "The issue is that scripts doesn't have a coherent implementation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2113.124,
    "end": 2115.245,
    "text": " and it also doesn't have a coherent definition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2115.666,
    "end": 2121.729,
    "text": "Now, whether there is one chicken and the egg or egg and the chicken, that's another question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2122.569,
    "end": 2140.98,
    "text": "And remembering that what we wanna do is explain, predict, design, control scripts, just like any other system, we would want to have the best and the most flexible understanding of scripts that would capture all of the diverse situations where scripts are being deployed in, but also,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2141.96,
    "end": 2155.902,
    "text": " integrated with more general theories so maybe socio-physics maybe some other quantitative frameworks and they're going to focus on two primary dimensions of variation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2157.014,
    "end": 2158.155,
    "text": " I'll read the quote first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2159.236,
    "end": 2165.181,
    "text": "In this paper, we focus on two orthogonal distinctions that we suggest structure discussion on scripts in the literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2165.962,
    "end": 2170.746,
    "text": "The first is a split between internalist and externalist readings of the construct of the script.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2171.706,
    "end": 2177.792,
    "text": "On the internalist conception, a script is defined as a cognitive structure that is typically internal to an agent, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2178.212,
    "end": 2185.178,
    "text": "encoded in their brain, and that harnesses information about typified behavioral patterns that are appropriate in specific social situations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2185.859,
    "end": 2192.61,
    "text": " On the other, externalist conception, scripts are cast as the basic fabric from which social institutions are crafted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2194.212,
    "end": 2198.179,
    "text": "On this conception, a script is a set of highly codified practices and rules",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2200.416,
    "end": 2205.902,
    "text": " practices, norms, standards, beliefs, and linguistic practices and rules that make up an institution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2206.703,
    "end": 2216.993,
    "text": "Some conceptions are not easy to split between internalist and externalist, but the way in which an agent interacts and reproduces a script does seem to bear elements of the duality nonetheless.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2217.794,
    "end": 2225.52,
    "text": " And so that's where we return to these two extreme cases that were presented earlier, which is the ultimate internalist versus externalist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2225.88,
    "end": 2234.127,
    "text": "The internal psychological schema is the internalist perspective, and it ultimately is going to tend towards neural reductionist perspectives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2234.901,
    "end": 2245.085,
    "text": " The constitutive behavioral categories perspective is the externalist perspective, bigger systems, society influencing the individual, and that tends towards holism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2246.085,
    "end": 2249.246,
    "text": "These are the two tensions, the two poles of the script theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2249.707,
    "end": 2261.171,
    "text": "And just as we've seen before, we want to use active inference to reframe this variation along this axis from systems where it really does just plainly appear that it's a small thing that's bubbling up to cause a larger change,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2261.531,
    "end": 2262.251,
    "text": " or vice versa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2262.672,
    "end": 2270.815,
    "text": "We want to take a new perspective on this question about the localization of scripts so that we can be better and act better in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2271.575,
    "end": 2276.797,
    "text": "And the second dimension is a split between the weak and the strong readings of this term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2277.377,
    "end": 2285.52,
    "text": "And the readings differ on how to explicitly think about the way that a script prescribes specific courses of action for the agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2286.901,
    "end": 2288.822,
    "text": "So in the strong concept of the script,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2289.999,
    "end": 2301.943,
    "text": " A script is a list of explicit instructions for situationally appropriate behavior, either neurally encoded under the internalist reading or implicit in conventions maintained by the institution in the externalist reading.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2302.623,
    "end": 2315.327,
    "text": "The strong reading of scripts dovetails with work in motor control that casts the process of motor control as the execution of a motor representation, which is cast as a list of explicit instructions for action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2315.807,
    "end": 2316.908,
    "text": "So kind of like robotics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2318.058,
    "end": 2325.543,
    "text": " The weak reading of the script construct relaxes the assumption that a script prescribes the precise order of events that it entails.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2326.204,
    "end": 2333.029,
    "text": "A weak script just encodes or harnesses information about the kinds of factors that an agent might encounter in a given situation type.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2333.849,
    "end": 2354.745,
    "text": " so let's graphically lay out these different variants of the script theory so on the x-axis is from weak to strong so weak is it's a tendency it's kind of related to information little quantitative amounts of reduction of uncertainty or preferences that are guiding bias implicit bias whatever it happens to be and then on the strong side",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2355.285,
    "end": 2377.775,
    "text": " it has to do with the certainty which a certain action is carried out so maybe some events are over on that end of the spectrum like a dramatic performance and then the y-axis is this internalist to externalist debate or tension where internalist things are smaller more inside of the epithelium more reductionist perspective externalist tends to be outside of the epithelium bigger things more holist",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2379.744,
    "end": 2396.11,
    "text": " So a strong externalist perspective would be like a marionette show or a puppet show, because the behavior of these individuals is going to be driven by external forces to them, and it's going to be very structured and deterministic in some way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2396.49,
    "end": 2400.192,
    "text": "It could even be done by a machine holding the wires, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2401.294,
    "end": 2426.681,
    "text": " whereas a weak externalist situation might be something like people who are in a meeting and the body language or the ways in which certain people fit into socially prescribed or different cultural perceptions on a certain presentation that someone provides all of these different soft features could end up playing into the behavior of individuals that would be a very externally uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2427.701,
    "end": 2452.994,
    "text": " oriented thing but also there's the collective behavior in the ecology of the group so that's still externalist but it ends up being more probabilistic the strong internalist beliefs relate to highly computational ways of thinking about the brain and about the ways that certain action patterns are encoded based upon representation as was stated in the earlier quote",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2454.52,
    "end": 2466.948,
    "text": " And then the weak internalist perspective might see the mind as a chaotic dynamical system or something that's never returning to steady states or has a strange loop feature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2467.488,
    "end": 2483.018,
    "text": "All these different aspects that make, even though it is a focus on the psychology, so it could lean towards reductionism, there's also a broader understanding about the potentially emergent components of even internal features.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2483.698,
    "end": 2495.862,
    "text": " all these different ways that we can think about scripts, and then here's Fristin, the origin here, and going to integrate across these quadrants with the Active Inference Framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2496.803,
    "end": 2499.064,
    "text": "Let's just look at one of the quotes in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2499.784,
    "end": 2500.104,
    "text": "They write,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2501.792,
    "end": 2508.355,
    "text": " Our proposed formalization of the script construct via active inference allows for interesting avenues in social computing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2508.935,
    "end": 2513.137,
    "text": "Specifically, we can begin to make predictions about how humans react to scripts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2514.017,
    "end": 2530.785,
    "text": "By clearly identifying the formal role of internal and external script elements, as well as what weak scripts and strong scripts entail in a cognitive and ecological structure, we can begin to leverage the model to identify the moment-to-moment dynamics of interactions between social agents in a given context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2531.405,
    "end": 2536.449,
    "text": " we can identify how narratives influence expected behavioral and contextual framing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2537.209,
    "end": 2537.489,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2539.131,
    "end": 2549.478,
    "text": "With our formal model of scripts, we can map the direct interaction of an individual with social categories and events, as well as its con-committance in the shared niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2550.539,
    "end": 2555.703,
    "text": "Those dynamic... Those dynamics could not only",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2557.125,
    "end": 2572.357,
    "text": " could allow not only to model how scripts come to be widespread by simulating sensitivity to deontic cues and social coordination with interlocutors, but also how scripts may come to change when an agent is faced with a script violation and its different ramifications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2572.997,
    "end": 2580.924,
    "text": "These violations may be met with social punishment or be embraced when they tap into the previously invisible valuable social reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2581.604,
    "end": 2584.526,
    "text": "I'd love to hear more from the authors about that part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2585.367,
    "end": 2593.995,
    "text": " This formalism may be scaled up to simulate agents as the niche and see how certain patterns of interaction and co-option may emerge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2594.396,
    "end": 2595.417,
    "text": "Also a really cool idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2595.977,
    "end": 2606.427,
    "text": "Finally, the model and the predicted patterns may be measured against real empirical data and falsified or confirmed to test psychological hypotheses about adherence to scripts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2610.103,
    "end": 2626.669,
    "text": " So all the areas that we care about, especially in the social areas, anywhere you can cast broadly a strong versus weak or an internalism versus externalism something, you're basically talking about the spatial and the temporal scales and the systems that humans care about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2626.969,
    "end": 2637.673,
    "text": "So if you're here and you're from script theory and this is active inference, then maybe ask questions about what would make it useful for your communities or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2638.698,
    "end": 2665.843,
    "text": " the specific situations the script construct is something that also has to be enacted by a mental health worker or by a social worker by a government or by a startup so what tools exist um from the script community to help us structure those kinds of flows so let's try to think about just bridging between our different communities and about these different approaches to research and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2666.966,
    "end": 2689.753,
    "text": " learning from each other, because I know that the scripts community probably has so much to share about how these tools and models that they've used have worked, how it has not worked, how can we use Active Inference to confirm what they know, and then also have an understanding about why things that they thought would work but didn't work didn't work, or why things they didn't expect to work",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2690.313,
    "end": 2702.729,
    "text": " did work can we frame it in a way that's based upon their surprise in the world as actors with deep generative models and then also zoom out and think about the social context as being something that responds perhaps non-linearly to interventions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2703.894,
    "end": 2706.337,
    "text": " So these would be kind of fun things to talk about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2707.258,
    "end": 2712.564,
    "text": "We've had a lot of social sciences people on the Actim stream before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2712.664,
    "end": 2722.514,
    "text": "So if that's something that anyone knows about script theory or any of these different areas of anthropology, then it'd be awesome to hear from them because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2723.922,
    "end": 2734.148,
    "text": " Like I said, a lot that we could learn as an active inference community about how these theories have taken hold in different areas and come to make impact in people's life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2734.628,
    "end": 2741.192,
    "text": "So this is a real interesting bridge between people's lived experience and the mental health",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2741.892,
    "end": 2764.95,
    "text": " uses of scripts the crime Dynamics and the way that governance is tied in with it so really interesting stuff um I hope that people can read the paper and attend one of the upcoming discussions or if they are seeing this video after we had the discussion then just leave your comments because you know the discussion just doesn't stop so just to go through the figures",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2767.014,
    "end": 2773.96,
    "text": " This is Figure 1, and I added colors to clarify a few of the different things that are happening here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2774.32,
    "end": 2776.802,
    "text": "So the figure's caption reads as follows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2776.842,
    "end": 2780.605,
    "text": "It reads as, A simple generative model for policy selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2781.145,
    "end": 2784.147,
    "text": "This schematic depicts a generative model for policy selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2784.668,
    "end": 2789.611,
    "text": "It represents probabilistic beliefs about how observations are related to the states that cause them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2789.952,
    "end": 2791.273,
    "text": "That's the likelihood matrix A.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2793.22,
    "end": 2801.877,
    "text": " There's also in this probabilistic model, there are beliefs about the manner in which states of the world evolve over time, which is the state transition matrix B,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2803.322,
    "end": 2822.954,
    "text": " And then there's beliefs about states prior to sampling the world, which are green and they're in D. And then preference over outcomes, C is not depicted here, but as written on the top, the calculation of G is related to the calculation of C, the outcome preference matrix, and also things like affordances, what the agent can do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2823.655,
    "end": 2827.377,
    "text": "And then this G is what modifies policy selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2828.638,
    "end": 2836.161,
    "text": " Perhaps someone coming from the social sciences wouldn't have expected this kind of a technical diagram to be in a paper about scripts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2836.681,
    "end": 2845.605,
    "text": "So let's just think about what everything is doing in this figure and what all the edges and nodes represent, because we've talked about this figure in more technical",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2846.585,
    "end": 2850.626,
    "text": " active streams, for example, like number eight or like the upcoming number 11.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2851.366,
    "end": 2854.706,
    "text": "But here, let's think about what this does for script theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2855.227,
    "end": 2858.687,
    "text": "So each of these letters are like a kind of node.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2858.847,
    "end": 2860.407,
    "text": "So the two blue nodes are similar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2860.988,
    "end": 2862.808,
    "text": "The kinds of red nodes are similar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2862.968,
    "end": 2864.728,
    "text": "And the D is an initial condition node.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2865.148,
    "end": 2868.429,
    "text": "So everything that has a similar shape or coloration is like one type of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2869.029,
    "end": 2873.07,
    "text": "And this figure reads from left to right from the initial conditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2873.33,
    "end": 2874.47,
    "text": "That's like time equals zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2875.55,
    "end": 2876.851,
    "text": " through different time steps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2877.371,
    "end": 2880.834,
    "text": "And at each time step, there are several things that are happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2881.675,
    "end": 2893.763,
    "text": "One thing that's not shown here, many things are not shown here, this is a pretty reduced format of the formalism, but what's happening is that the agent is maintaining a state estimate through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2894.404,
    "end": 2895.625,
    "text": "And so that could be like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2896.565,
    "end": 2913.598,
    "text": " uh what kind of relationship am i in or what kind of social situation am i in is this a friendly conversation or is this a fight that could be a zero or a one or the state estimate could be a lot more high dimensional a lot more nuanced and the state estimate is being carried out through time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2914.699,
    "end": 2940.736,
    "text": " well what else is tied to the state estimate at each moment one thing it's tied to is oh observations so that could be any kind of observation it could be the person's tone of voice or their facial expression or the content of their speech or it could be an observation in a text message that says hey this person is not honest or something like that so many kinds of observations again this is just a big broad sketch but at each time step",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2941.656,
    "end": 2960.888,
    "text": " the state estimate which is am i in this type of conversation or that type of conversation again whatever it happens to be the state estimate is being mapped to the observation we're not going to worry about the mathematical details now but it turns out that what connects the state estimate to the observation is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2962.469,
    "end": 2966.274,
    "text": " a belief about how the observations are related to the states that cause them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2966.695,
    "end": 2977.709,
    "text": "So there's some sort of internal mapping, let's just say, again, sidestepping this debate that we had a little bit earlier, that smiles mean the person is happy and frowns mean they don't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2978.149,
    "end": 2983.293,
    "text": " But then you think a little deeper and you realize, well, if someone's trying to deceive you, then they might smile.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2983.713,
    "end": 2991.579,
    "text": "So that might trigger your subconscious receptors, your subconscious priors, but maybe you look beyond those types of physiological responses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2991.98,
    "end": 2995.542,
    "text": "So again, there's layers and nuance that aren't going to be in this figure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2995.983,
    "end": 3004.029,
    "text": "But just broadly, the state estimate is updating through time as a function mapped to the observations that you're expecting and estimating to get.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3005.359,
    "end": 3011.926,
    "text": " The blue B is the beliefs about the manner in which states of the world evolve over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3011.986,
    "end": 3014.929,
    "text": "So here's like the person's happy, they're smiling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3015.349,
    "end": 3024.459,
    "text": "My policy, my action selection is that I, if I say something nice, then I estimate that they'll continue to be happy and then they'll continue to emit this like happy sound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3024.899,
    "end": 3029.322,
    "text": " And then here, if I continue this policy, so this is at time zero, one, two, three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3029.663,
    "end": 3031.624,
    "text": "So this is like the first three moves of chess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3031.984,
    "end": 3034.946,
    "text": "So you get starting state and then observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3035.027,
    "end": 3038.189,
    "text": "First round, a movement guided by a policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3038.909,
    "end": 3042.932,
    "text": "This is also framed as a belief about how the world is expected to change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3043.333,
    "end": 3046.195,
    "text": "So under certain estimates about how the world is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3046.855,
    "end": 3052.356,
    "text": " how will my trades today in cryptocurrency manifest as future observations?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3052.957,
    "end": 3064.98,
    "text": "Or given everything I know about the person, all these norms and the social components, how will my policy on a certain type of conversation end up changing future observations I have?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3065.74,
    "end": 3080.877,
    "text": " and then it turns out that in the free energy principle active inference framework the policy that's the whole control theory cybernetics elements to the theory that is guided by g which is framed a few different ways and it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3081.317,
    "end": 3094.185,
    "text": " kind of situational how exactly it's deployed, but there's a lot of mathematical work in other live streams and in other talks, other papers to go into this, what is G and what do all of its calculations mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3094.525,
    "end": 3098.508,
    "text": "But basically it's a heuristic that helps the organism select good policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3099.108,
    "end": 3104.91,
    "text": " And good policy is not absolute because there's scripts for social failure and there's scripts for success.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3105.391,
    "end": 3123.658,
    "text": "And so instead of getting into this realm of, well, what if the person consciously wants to succeed and all this sort of stuff, we're going to take a statistical approach and we're going to have this G formalism that turns out to map onto the way that policy is selected, even if it's in a distorted way or even a pathological way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3124.591,
    "end": 3127.434,
    "text": " Okay, here is a quote from the authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3127.474,
    "end": 3132.139,
    "text": "They write, with this in place, it becomes possible to implement weak scripts in a generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3132.579,
    "end": 3140.427,
    "text": "We submit that weak scripts can be implemented via the likelihood mappings, A, prior beliefs, D, and sensory preferences, C, of the agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3140.967,
    "end": 3147.774,
    "text": "Thus weak scripts harness beliefs about how the expected salient social categories for figures in specific situations, that's D,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3148.815,
    "end": 3169.217,
    "text": " and beliefs about how they generate sensory behavior a so when people are feeling this way socially then they respond this way from an observations way this is what you'll see you can imagine where that becomes pathological or whether there's challenges with intercultural or intergenerational communication in social situations the relevant social categories of role",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3170.563,
    "end": 3175.069,
    "text": " And appropriate behavior can only be inferred, which requires the agent to mobilize the right kind of knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3175.79,
    "end": 3176.812,
    "text": "So it's not just enough to know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3176.912,
    "end": 3178.754,
    "text": "You can't just know the thousand and one phrases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3178.794,
    "end": 3184.222,
    "text": "There's also an element of optimal experimentation in the space and being an improvisational partner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3184.402,
    "end": 3187.146,
    "text": "You can't just go off of a hard-coded script.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3188.55,
    "end": 3201.045,
    "text": " An agent must infer the proper categories, the proper associations, and the proper mapping onto observations in order to navigate a social context adequately and to maximize her returns by the niche, social capital.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3202.423,
    "end": 3207.524,
    "text": " This mapping changes in function of the context, changes as a function of the context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3208.305,
    "end": 3212.346,
    "text": "Hence, the weak script also feeds one understanding of the context per se.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3212.786,
    "end": 3223.129,
    "text": "So that's many ideas we've talked about with the environment influencing the individual and the individual influencing the environment, often in a way that changes the probability of other things happening later, that stigmergy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3224.149,
    "end": 3226.59,
    "text": "This also brings up this multi-scale idea",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3227.27,
    "end": 3235.741,
    "text": " where within an agent, statistical changes can be happening and those can be resulting in changes in behavior, all these different things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3237.625,
    "end": 3244.93,
    "text": " I just thought it might be interesting because these kinds of figures are not usually found in the scripts papers that I looked through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3246.031,
    "end": 3259.541,
    "text": "One other figure that we'll just be kind of quickly go through not reading the caption is just to look at this agents in the world model and just how different types of things are categorized on here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3259.601,
    "end": 3264.805,
    "text": "So on the bottom of the image, laser.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3265.876,
    "end": 3270.358,
    "text": " On the bottom of the image is the world, and then the top of the image, this box, is the person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3270.818,
    "end": 3275.14,
    "text": "And so perhaps there's some type of blanket or some mediating interface happening here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3276.16,
    "end": 3277.421,
    "text": "And there's several types of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3277.841,
    "end": 3279.421,
    "text": "There are strong and weak components.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3281.022,
    "end": 3297.65,
    "text": " using the previous dichotomy of some things that are sort of objectively a specific way and then other things are more probabilistic in nature so perhaps this is reflecting the observations coming in with a strong component here maybe that's just your visual reception",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3298.45,
    "end": 3300.791,
    "text": " Could be debated whether that's a strong component or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3301.612,
    "end": 3308.496,
    "text": "And then it's getting passed off to these weaker components, maybe conditional ones or ones that are related to stochastic processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3309.156,
    "end": 3317.722,
    "text": "And then there's a mapping from action back onto the world and a causal process of the world, which might be a strong component or a weak component.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3318.402,
    "end": 3322.423,
    "text": " And the point is, it shouldn't even have to be a binary per se.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3322.884,
    "end": 3325.905,
    "text": "It should be about our inference of those latent links in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3326.325,
    "end": 3340.33,
    "text": "Maybe for a certain thing, you have enough information, or you have the right side information, or you have the right prediction in a given scenario, or you can confirm it post hoc, where you can perform optimally as if you knew the actual strong causes of an event.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3341.09,
    "end": 3364.323,
    "text": " other times it might be possible to uh find a pareto front with respect to policy where even if there's a long tail distribution of uh randomly distributed events it could still be possible to have incredible performance in real world settings for example companies that are high reliability organizations errors do happen they just don't cascade in these organizations so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3365.123,
    "end": 3380.665,
    "text": " How could we construct a niche where different parts of this system and the actual unique interfaces that are numbered here and described a little bit more in the caption, how could we design, do systems engineering in this kind of an environment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3381.446,
    "end": 3391.152,
    "text": " and potentially do things like reduce error rates or increase the accessibility or onboarding onto research communities, you know, just the kinds of things that we might want to care about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3391.813,
    "end": 3399.878,
    "text": "All the social scripts, all the reasons why people have been talking in pages and pages and pages of social sciences, talking about different categories, well,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3400.538,
    "end": 3417.705,
    "text": " here might be the opportunity to actually specify these categories we could debate whether specifying them is a good or a bad thing i would say if we all work together on it then it's a good thing to formalize it maybe there's people who disagree so for those who don't want to formalize script theory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3418.698,
    "end": 3433.915,
    "text": " not sure would be interesting to talk to them here but we're going to be talking about how active inference could lead to some type of integration here and then what that might allow so let's just think about a few general questions in closing here on the hour",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3435.285,
    "end": 3438.088,
    "text": " First, what might a framework for scripts be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3438.749,
    "end": 3451.043,
    "text": "So two axes of variations were laid out, but there's other axes of variation and it was acknowledged that even sometimes it was hard to differentiate a theory as being somewhere on the internalist, externalist spectrum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3451.564,
    "end": 3455.368,
    "text": "And so what will a framework for scripts be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3456.189,
    "end": 3457.871,
    "text": " How will we know it when we see it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3458.292,
    "end": 3459.633,
    "text": "Will it look like an equation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3459.733,
    "end": 3461.795,
    "text": "Will it look like four equations that can't be reduced?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3461.836,
    "end": 3462.396,
    "text": "Will it look like 11?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3462.957,
    "end": 3465.079,
    "text": "Will we believe that later on it will be reduced?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3465.119,
    "end": 3467.222,
    "text": "Or will we believe that later on it won't be reduced?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3467.802,
    "end": 3470.826,
    "text": "So what are we really going for here with this Scripps theory?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3471.827,
    "end": 3473.969,
    "text": "What might we be able to do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3474.77,
    "end": 3476.351,
    "text": " with a good script framework?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3476.751,
    "end": 3495.202,
    "text": "For example, in online teams or in located situations, could we do design in a way that was transparent for online behaviors so that people knew that they were signing up for a service that was using such and such in its decision-making for its algorithm?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3495.842,
    "end": 3502.246,
    "text": "Would people want to be interfaced that way in API for a person, as one of my friends puts it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3503.738,
    "end": 3530.698,
    "text": " it be possible for humans and computers to co-program how formal should the scripts concept be if it turns out to explain a tremendous amount of behavioral variation then it might be possible to design another level of control for people it's kind of like surveillance capitalism did a lot with just linear models and did a lot with machine learning and is the next level just the next level of that is that really what we're working towards i don't think so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3532.904,
    "end": 3536.125,
    "text": " One might wanna ask, what are the unique predictions and experiments?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3536.526,
    "end": 3547.731,
    "text": "So given that you think about scripts now from an active inference perspective, what are the ways in which we can look at the previous literature on scripts, reinterpret it, and then think,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3548.251,
    "end": 3557.956,
    "text": " Well, knowing what they knew and the way that they phrased it and building on it, and then knowing what we know from other areas, what would be the most informative experiment to run?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3558.396,
    "end": 3562.959,
    "text": "So what predictions would we have that haven't been analyzed yet, but already we can do it with the data we have?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3563.539,
    "end": 3589.85,
    "text": " like we could predict that there's more conformity in certain types of interactions than others and we could have an a priori way of pre-registering a hypothesis and then doing a deep dive into a social data set coming up with these answers that would be not predicted by someone else's scripts theory or impossible to predict with someone else's scripts theory and showing that it could predict well with active inference but also then there's the experimental design and so that's about what um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3590.41,
    "end": 3615.618,
    "text": " experiment is going to optimally reduce your uncertainty about something specific so it's always going to be experiments not just open-ended but about learning something specific and so i would be curious just in the active inference community or the social side what are people curious to reduce their uncertainty about what do we want to test this on do we want to have this tested um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3617.495,
    "end": 3626.628,
    "text": " in which field can it be done with data that already exists or could exist, which is related to the question, what are the next steps for active inference here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3627.109,
    "end": 3633.218,
    "text": "So there's two figures and there's maybe an appendix in the paper and it lays out,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3634.346,
    "end": 3649.374,
    "text": " qualitatively mostly an agenda for formalizing and integrating the scripts concept and so i just wondered what are the next steps is it actually to pick a canonical type of interaction ordering food or something like that and uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3650.214,
    "end": 3673.47,
    "text": " chatbot it or do something with robots or is this going to be something that we can infer from video data is it going to be on online teams or located is it going to be more mathematical how can we make active inference better account for not just sort of robot foraging behavior but human behavior we've talked about in the last couple of weeks people who are implementing things like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3674.15,
    "end": 3698.952,
    "text": " daydreaming access and memory and historiosity and risk averse optimization how can we start bringing some of these topics into play and then thinking about real social issues and how we might be using active inference to act in those situations and then lastly just as always we want to consider the goals of this research and uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3700.305,
    "end": 3704.888,
    "text": " I'd be curious to hear what the author's goals or interests are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3706.148,
    "end": 3709.43,
    "text": "I think it's kind of a cool area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3709.951,
    "end": 3711.852,
    "text": "They're making interesting progress.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3712.692,
    "end": 3716.875,
    "text": "Sounds really cool to integrate across big areas of research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3717.835,
    "end": 3719.616,
    "text": "And that's it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3720.016,
    "end": 3722.238,
    "text": "Kind of an interesting paper to read.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3722.518,
    "end": 3725.96,
    "text": "So I hope everyone can check it out and join a discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3727.346,
    "end": 3728.587,
    "text": " Thanks for participating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3729.088,
    "end": 3731.69,
    "text": "There will be follow-up forms for the live participants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3732.731,
    "end": 3736.155,
    "text": "And any feedback, suggestions, questions, always welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3737.096,
    "end": 3739.178,
    "text": "Stay in communication with us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3739.498,
    "end": 3742.741,
    "text": "But other than that, thanks for listening to 10.0.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3745.08,
    "end": 3758.13,
    "text": " You're always welcome to come on the live discussion or plan some other type of event and leave us a comment or let us know if you have any questions, anything we could address in another show.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3758.671,
    "end": 3760.933,
    "text": "So have a good day, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3761.213,
    "end": 3762.394,
    "text": "And I'll talk to you later.",
    "speaker": "SPEAKER_00"
  }
]