[
  {
    "start": 7.264,
    "end": 7.964,
    "text": " Hello everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8.545,
    "end": 11.286,
    "text": "Welcome to the Active Inference Livestream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 11.646,
    "end": 13.867,
    "text": "This is Active Inference Livestream 10.2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 15.427,
    "end": 23.391,
    "text": "It is December 15th, 2020, and we are really excited to be having this discussion with all of you today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 24.673,
    "end": 27.354,
    "text": " Welcome to the Active Inference Lab, everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 28.095,
    "end": 34.138,
    "text": "We are an experiment in online team communication, learning, and practice related to Active Inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 34.738,
    "end": 43.182,
    "text": "You can find us at our website, on Twitter, at email, our YouTube channel, or our public Cubase team and username.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 44.183,
    "end": 49.826,
    "text": "This is a recorded and an archived live stream, so please provide us with feedback so that we can improve on our work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 50.888,
    "end": 53.249,
    "text": " All backgrounds and perspectives are welcome here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 53.869,
    "end": 64.114,
    "text": "And as far as video etiquette for live streams, remember to mute if there's noise in your background, raise your hand so that we can hear from everyone on the stack and use respectful speech behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 65.458,
    "end": 73.024,
    "text": " Just as a quick little announcement slash point of process, all the rest of the meetings for the rest of 2020 are at 7.30 to 9 a.m.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 73.264,
    "end": 73.725,
    "text": "PST.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 74.626,
    "end": 80.851,
    "text": "Last week, we had 10.1 on the script paper, and today we're having a follow-up discussion on the script paper 10.2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 82.816,
    "end": 89.102,
    "text": " And then for the final two weeks of December, we're going to be reading the paper, Sophisticated Affective Inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 89.462,
    "end": 100.712,
    "text": "So check out the dates and contact us if you want to participate in these final discussions or in 2021, or if you have an idea for an event that we could do on the ACT-IMP stream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 101.312,
    "end": 103.454,
    "text": "We have a lot to announce coming up soon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 104.415,
    "end": 131.536,
    "text": " and one good place to stay apprised of that would be on our website where you can find this call for a collaboration link so if you go to active inference.org and check out this aweber link you'll see some information about collaborating in 2021 on the live stream and on other really cool projects great so today in actinf 10.2 we are going to start with introductions and warm-ups and then we're going to go through 10.2 we're",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 132.793,
    "end": 138.256,
    "text": " We're going to be talking about the variational approach to scripts paper that we've been talking about for the last week as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 139.077,
    "end": 145.461,
    "text": "And check out 10.0 if you want some context and check out 10.1 for last week's awesome discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 146.461,
    "end": 149.523,
    "text": "We'll go through the aims, claims, abstract, and roadmap today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 150.004,
    "end": 155.887,
    "text": "And then there's some new sets of questions about types of scripts and how do scripts look and other questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 156.167,
    "end": 160.11,
    "text": "And then we'll look through the figures, which is something that we brought up last time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 161.215,
    "end": 163.095,
    "text": " And next week there's going to be a different paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 163.215,
    "end": 164.896,
    "text": "So get in touch if you want to participate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 164.916,
    "end": 165.696,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 166.256,
    "end": 166.736,
    "text": "Thanks for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 167.056,
    "end": 168.937,
    "text": "Now onto the intros and warmups.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 169.197,
    "end": 178.859,
    "text": "So for the introductions and warmups, let's introduce ourself by giving a short introduction or check-in and then passing it to somebody who hasn't spoken.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 179.559,
    "end": 180.299,
    "text": "I'm Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 180.719,
    "end": 185.2,
    "text": "I'm a postdoc in California and I will pass it to Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 189.392,
    "end": 190.292,
    "text": " I am Blue Knight.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 190.412,
    "end": 196.575,
    "text": "I am an independent research consultant based out of New Mexico, and I will pass it to RJ.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 199.356,
    "end": 200.717,
    "text": "My name is RJ Corday.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 201.097,
    "end": 206.98,
    "text": "I'm on the east coast of the United States, and I'm mostly doing research in organizational dynamics, intelligence analysis, and narrative warfare.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 207.28,
    "end": 210.121,
    "text": "And I'll pass it to Shannon, if Shannon's here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 213.122,
    "end": 214.383,
    "text": "We'll come back to Shannon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 214.403,
    "end": 215.003,
    "text": "We'll come back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 215.764,
    "end": 216.164,
    "text": "Alex, then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 220.242,
    "end": 220.582,
    "text": " Thanks.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 221.002,
    "end": 221.502,
    "text": "I'm Alex.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 221.803,
    "end": 223.744,
    "text": "I'm located in Moscow, Russia.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 224.524,
    "end": 227.906,
    "text": "And I'm a researcher in Systems Management School.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 228.867,
    "end": 230.148,
    "text": "And I pass it to Sasha.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 232.749,
    "end": 234.29,
    "text": "Hi, I'm Sasha.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 234.931,
    "end": 238.273,
    "text": "I'm a graduate student also in California.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 238.933,
    "end": 241.134,
    "text": "And I study neuroscience and development.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 242.195,
    "end": 243.876,
    "text": "And I will pass it to Stephen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 245.783,
    "end": 246.764,
    "text": " Hello, I'm Steven.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 246.824,
    "end": 248.665,
    "text": "I'm based in Toronto in Canada.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 248.945,
    "end": 259.953,
    "text": "I do a lot of work with participatory theatre and sort of participatory development workshops and I'm doing a practice-based PhD at the moment and I'm going to pass it to Ivan.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 262.635,
    "end": 264.016,
    "text": "Hello, my name is Ivan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 264.756,
    "end": 265.877,
    "text": "I'm based in Moscow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 266.117,
    "end": 274.102,
    "text": "I'm interested in in case of system thinking and I passed it to Shannon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 274.343,
    "end": 274.823,
    "text": "Shannon,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 278.951,
    "end": 279.191,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 279.391,
    "end": 282.954,
    "text": "Well, I think Shannon will come back online whenever she's ready.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 283.454,
    "end": 286.636,
    "text": "So for now, we can just continue on to the warm-up questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 287.437,
    "end": 289.918,
    "text": "For these questions, feel free just to raise your hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 290.138,
    "end": 291.7,
    "text": "We're happy to hear from anyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 292.56,
    "end": 302.287,
    "text": "So one question, since many of you were here last week, is what is something that you thought about differently after our conversation last week?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 303.223,
    "end": 321.35,
    "text": " And so while people are raising their hand, I just really like this way of thinking about scripts and genres for our encounters and at the life trajectory level and at the sort of sub scene level, what genre are we drawing our scripts from?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 321.891,
    "end": 322.151,
    "text": "RJ?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 325.212,
    "end": 332.715,
    "text": "So after last week's conversation, what I ended up really thinking about is what happens when we lose our scripts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 334.269,
    "end": 344.512,
    "text": " So it seems like scripts are a framework for representing how we move through these complex social interactions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 345.773,
    "end": 360.557,
    "text": "So what happens when, say, in the Spanish Inquisition, where it was a process by which they were actively trying to remove scripts that people had, what happens in the absence of them when we tear them away?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 360.677,
    "end": 362.878,
    "text": "So I've been thinking about that a lot last week.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 364.693,
    "end": 365.694,
    "text": " Interesting question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 365.814,
    "end": 366.034,
    "text": "Blue?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 369.597,
    "end": 379.365,
    "text": "I've been thinking really a lot about the transparency of active inference versus other types of deep learning and how they're kind of a black box.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 379.445,
    "end": 387.052,
    "text": "And really what RJ had said last week about how active inference is more like a blanket of black boxes, I thought that that was pretty cool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 387.092,
    "end": 391.556,
    "text": "And I've been kind of twirling that around in my head for the last week.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 393.592,
    "end": 393.872,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 393.992,
    "end": 396.854,
    "text": "And it's almost like, if the sentence... oh, go ahead, Sasha.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 401.717,
    "end": 406.0,
    "text": "Kind of the opposite of RJ, for the last week I've been thinking, what's not a script?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 407.821,
    "end": 412.064,
    "text": "And can there be an absence of a script because...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 414.295,
    "end": 421.058,
    "text": " we're just as apt to follow another set of directions as we are the cultural set of directions that we get for interactions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 421.578,
    "end": 434.903,
    "text": "So that's been kind of vexing because it's similar to the problem with thinking about free energy and active inference that once you see it, then you wonder like, what's not in that category and",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 437.403,
    "end": 442.434,
    "text": " how do we kind of draw the correct boundaries around the definitions of these terms?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 442.815,
    "end": 447.645,
    "text": "Because yeah, once you see scripts, you really see it around you in every situation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 448.632,
    "end": 471.803,
    "text": " Yeah, to your point there, Sasha, it's like if a first time ever social experience or a very ritualized one, if the scripts concept can include both of those, as well as the internalist and externalist concept, it's kind of like how many grains of sand in a heap, like how reproducible or how strong does the pattern of a social encounter have to be before we're going to deem it scripts of a certain kind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 472.083,
    "end": 472.243,
    "text": "Blue?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 474.326,
    "end": 498.989,
    "text": " so to kind of to piggyback on what you and sasha were both saying like i've been thinking about like is maybe everything is a script like is a chair a script really like i mean a chair has like a set role and like a thing we do with it or it can you know take on a new like script so like what what about all of these like objects in our everyday society really like once you once you see a script like what is not a script like i i have a hard time like you know unfolding that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 499.878,
    "end": 502.019,
    "text": " Well, it's like the wood is chairing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 502.599,
    "end": 508.162,
    "text": "The chair is a noun, but it's a process and it was built and it will eventually not be a chair.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 508.582,
    "end": 517.627,
    "text": "And so while it's chairing, we can draw a blanket, put a seat cover on it and use it in the functional interface of being a chair.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 518.167,
    "end": 527.992,
    "text": "And so, especially when things become sufficiently compartmentalizable or interfaceable so that they have a functional way of dealing with them,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 528.672,
    "end": 537.96,
    "text": " instead of just getting lost in the becoming and unbecoming of chairs, we can start to think, all right, well, yes, that is happening, but also there's this stable pattern that I can sit on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 538.18,
    "end": 539.481,
    "text": "That's why we're calling it a chair.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 540.042,
    "end": 547.068,
    "text": "And so it's like this emergence of reproducible function and pattern out of continual becoming and unbecoming.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 547.508,
    "end": 548.089,
    "text": "And so that is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 549.622,
    "end": 573.375,
    "text": " the point with a lot of discussions about the markov blanket or the friston blanket whatever it ends up being and these questions about ergodicity as well like does everything by virtue of having inputs and outputs is everything going to be under this umbrella or is this kind of umbrella only going to be over things that have um input output relationships of some type over some spatial or temporal scale stephen",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 575.643,
    "end": 600.989,
    "text": " think this also made me think about where sense making comes in and how this approach to scripts it kind of it helps extend the active inference work with deontic cues you know they talk about the traffic lights and a lot of other things in the models and this starts to extend these sort of top-down cues into narratives and stuff like that but there's still the the more existential kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 602.029,
    "end": 626.549,
    "text": " participatory sense-making and the kind of existential sense-making processes which are maybe um they're still open to sort of somehow integrate with this more scripted kind of way of making sense of the world so i think that's that's something that i'm interested in in where do they start to sort of mesh or override each other in different ways",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 628.578,
    "end": 628.879,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 629.14,
    "end": 631.105,
    "text": "All right, let's go to the next warmup question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 632.349,
    "end": 634.515,
    "text": "How could a different idea of scripts",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 635.495,
    "end": 639.197,
    "text": " relate to how we regulate the behavior of ourselves and others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 639.738,
    "end": 647.463,
    "text": "So depending on how somebody thinks about scripts, how might they be likely to treat their own behavior differently?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 647.503,
    "end": 653.606,
    "text": "And how might they be likely or willing to engage in different kinds of regulations of other people's behavior?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 654.207,
    "end": 657.129,
    "text": "So let's just say that there's some prop in a script.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 657.489,
    "end": 660.311,
    "text": "So something like a artifact or an object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 660.871,
    "end": 664.653,
    "text": " So just like to RJ's example about wanting to uproot a script.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 665.133,
    "end": 673.217,
    "text": "So then you could say, well, you can't use this symbol or you can't use this combination of words, or we're not allowing anything from this genre of script.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 673.578,
    "end": 675.358,
    "text": "And we're going to know it because it's going to have this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 676.784,
    "end": 698.551,
    "text": " style and um so depending on how we formalize these scripts maybe in order to regulate other people's deployment of scripts we might take very specific um sub components like a certain set of words or an artifact and then say well this is or isn't ruled in rj uh yeah so so on this um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 700.012,
    "end": 710.657,
    "text": " One thing, going back to the last question, just when you kind of stole the words out of my mouth, what I wanted to say, which is a cherished script for Wood.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 711.657,
    "end": 719.201,
    "text": "But I also want to note on this is I got to have a conversation yesterday with Eric Sapp from Public Democracy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 720.021,
    "end": 731.191,
    "text": " And a lot of the stuff they've been doing, as I mentioned to you before, Dan, is like using like traditionally what would be used for advertising for like public good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 731.633,
    "end": 755.426,
    "text": " So, uh, what they've done in one case was, was be able to, uh, use the same tools that they would use to target advertising, to, um, uh, target recent people who have very recently picked up a heroin addiction, um, looking at their, their behaviors online, be able to figure out that, that they're, that they've recently picked up this addiction or, or that they've very likely had, and then give them on ramps toward treatment at the time when they are most likely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 757.148,
    "end": 759.489,
    "text": " able to move toward accepting those types of treatments.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 760.07,
    "end": 762.131,
    "text": "They're not very deep into the addiction yet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 762.531,
    "end": 767.193,
    "text": "So I brought up scripts to him and we talked a little bit about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 767.593,
    "end": 784.34,
    "text": "And it seems like their look at it is like, it's almost like one, if you can give people the idea that they're using these scripts and that they can change them and that they're creating them in real time or adapting to them in real time, then you kind of have the self-awareness that can kind of help you",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 786.528,
    "end": 789.472,
    "text": " Moving down, we talked about radicalization last week.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 789.512,
    "end": 795.179,
    "text": "If you're aware of the scripts that are in the space, maybe you can be self-aware when you're using them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 795.9,
    "end": 796.781,
    "text": "So I think that's one thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 796.981,
    "end": 805.992,
    "text": "And then in addition, recognizing when you're about to hit a threshold where you're about to start using a script rather than just some behavior, which kind of ties to what Sasha was saying is like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 806.607,
    "end": 808.469,
    "text": " At what point do we call something a script?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 808.749,
    "end": 810.731,
    "text": "So I'm not sure, but anyway.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 810.991,
    "end": 812.032,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 812.492,
    "end": 819.238,
    "text": "It reminds me of the gateway idea, like gateway drug or gateway website or gateway meme, whatever it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 819.398,
    "end": 820.839,
    "text": "It's like using that metaphor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 820.94,
    "end": 825.243,
    "text": "It's like, whoa, if you go through the gateway, if you pass through, you're not coming back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 825.303,
    "end": 826.664,
    "text": "It's all downhill from there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 827.105,
    "end": 828.266,
    "text": "Well, that's one script.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 828.306,
    "end": 831.669,
    "text": "It's a narrative for how you could proceed through different types of experiences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 832.089,
    "end": 835.191,
    "text": " but could there be a sort of like visitation metaphor?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 835.231,
    "end": 844.418,
    "text": "It's like, hey, you're gonna visit this landia and then your family's still gonna be waiting for you and they all want you to become safe and come home, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 844.778,
    "end": 849.122,
    "text": "And then that could be a tractor that takes some of the same setup.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 849.282,
    "end": 853.485,
    "text": "It's a similar genre, at least in the beginning of the movie, but then it goes a different way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 853.985,
    "end": 856.867,
    "text": "And so that definitely is a nice point there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 857.147,
    "end": 858.929,
    "text": "Okay, and then our last warmup question is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 860.131,
    "end": 866.935,
    "text": " What's something that you're still wondering about or something that you'd like to have resolved by the end of today's discussion?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 867.615,
    "end": 873.678,
    "text": "I really like this question also about the what's not a script or defining by defining what isn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 874.218,
    "end": 874.479,
    "text": "Another...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 875.219,
    "end": 900.875,
    "text": " thing that wrote i wrote down to ask about is the the transparency of the concept is something that we'll probably return to many times and is it really more transparent to sub compartmentalize it into a lot of smaller black boxes or are we doing something quite distinct from that what else does anyone think like what could be a fun area to take this script's concept in or what could be somewhere where we could go in the discussion",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 902.995,
    "end": 908.98,
    "text": " But if no thoughts here, then no worries because there's a bunch of questions that will be asked in the later stages.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 909.34,
    "end": 910.1,
    "text": "So good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 910.541,
    "end": 914.003,
    "text": "Okay, Shannon, I hope that you can hear us or rejoin when you can.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 915.465,
    "end": 916.946,
    "text": "But let's get into it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 916.986,
    "end": 921.269,
    "text": "And then anyone just raise your hand when things come to you and we'll go from there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 922.11,
    "end": 922.31,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 922.87,
    "end": 928.635,
    "text": "So the paper that we are discussing this week, as with last week, is a variational approach to scripts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 929.175,
    "end": 932.558,
    "text": "And we had Mao last week on the panel, which was great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 933.53,
    "end": 935.691,
    "text": " the aims and claims of the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 936.071,
    "end": 941.672,
    "text": "We went through those in 10.0 and heard it from the authors themselves last week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 942.293,
    "end": 953.356,
    "text": "But the big question here is about unifying the study of scripts using the Active Inference Framework in all of these different dimensions, the strong and the weak and the internal and the external",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 953.996,
    "end": 957.637,
    "text": " the social and the neurobehavioral, all these different aspects of scripts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 958.077,
    "end": 961.779,
    "text": "How are we going to reframe it within the active inference framework?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 961.919,
    "end": 963.319,
    "text": "And then what would that do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 963.459,
    "end": 967.621,
    "text": "What would that give us in terms of understanding or unique predictions or explanations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 969.315,
    "end": 993.327,
    "text": " In the abstract, they also run through this notion that they're going to be leveraging the resources of Active Inference to offer up a formal model of scripts that's not just a flow chart or a mind map or prose, but is actually a relationship amongst variables that specifies how some of these script variations, like weak versus strong, internal versus external, can be considered.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 993.547,
    "end": 995.448,
    "text": "So we'll return to that in the figures especially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 996.67,
    "end": 1006.695,
    "text": " And then in the roadmap, we saw that classic formula with an introduction and then theory X, in this case, script theory, and then active inference in section three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1007.136,
    "end": 1012.278,
    "text": "And then in the following section, a summation of theory X with active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1012.679,
    "end": 1015.1,
    "text": "So that's the active inference account of scripts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1015.78,
    "end": 1017.681,
    "text": "And this was an introductory work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1018.142,
    "end": 1025.025,
    "text": "So there's probably many ways to follow down the rabbit hole for a specific subtype of script or other dimensions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1027.281,
    "end": 1038.047,
    "text": " The main dimensions of variability in the scripts concept that were highlighted by the authors were this strong versus weak and internalist versus externalist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1039.136,
    "end": 1050.683,
    "text": " So the strong scripts concept reflects event sequences that are extremely stereotyped or extremely reproducible or kind of like that Grand Canyon in the landscape.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1051.004,
    "end": 1055.646,
    "text": "It's like you're being channeled along very strongly by a specific script.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1056.107,
    "end": 1067.154,
    "text": "Whereas on the weak side, we see things that are more probabilistic or potentially a preference or bias or more likely to go one way than another, but it isn't exactly pre-specified.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1067.634,
    "end": 1071.395,
    "text": " And then on the y-axis, we have this internalist versus externalist axis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1071.855,
    "end": 1088.819,
    "text": "So the internalist perspective is going to look towards smaller things, things that are inside of the person, like the brain or the cells or computational things the cells are doing, or something that the neurons are doing in terms of secretion or firing or electromagnetic rhythms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1089.519,
    "end": 1092.84,
    "text": "Whereas the externalist perspective, as it just would sound like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1093.28,
    "end": 1117.243,
    "text": " is thinking about things that are external to the focal agents so that would be the relationships in the social network as well as quote society and even broader things like the ecosystem cool so those were all things that we talked about in the previous weeks and now i want to raise some new questions about scripts relationships and active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1118.126,
    "end": 1131.231,
    "text": " So the first question is how might scripts of different kinds, whether the strong, weak, internal, external, or some other feature that people are wondering about, how might they conceptualize of social relationships?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1131.631,
    "end": 1134.872,
    "text": "And in this case, just for reference, I'm thinking of this social network on the right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1135.232,
    "end": 1136.612,
    "text": "There's two blue nodes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1136.832,
    "end": 1139.453,
    "text": "Let's just think of them as our focus relationship.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1139.954,
    "end": 1143.095,
    "text": "So now we're moving beyond the individual as the focal system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1143.435,
    "end": 1146.576,
    "text": "Let's think about the edge and the relationship as the focal system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1147.276,
    "end": 1151.238,
    "text": " and then seeing that edge in context of a broader network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1151.779,
    "end": 1158.823,
    "text": "So what might anybody think about how would scripts conceptualize of social relationships?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1158.863,
    "end": 1168.569,
    "text": "And then I'll just throw up the second question too, which is how could active inference add depths and tools or context to the social scripts concept?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1172.887,
    "end": 1174.728,
    "text": " Any thoughts from any domain are good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1174.808,
    "end": 1183.034,
    "text": "Stephen, I might be curious to hear about from a practice side, how do we bring these ideas and then make them tangible and experienced?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1183.875,
    "end": 1187.958,
    "text": "Yeah, I mean, I think this is actually where this scale question becomes kind of...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1188.956,
    "end": 1211.044,
    "text": " kind of it becomes a challenge right because as we try to map things out um with social networks so there's a lot of social network or participatory inference mapping is one process which is quite useful for looking at and trying to understand how we relate to each other's stories and experiences in our network but the question becomes is um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1212.21,
    "end": 1234.28,
    "text": " how do we relate this kind of perspective we try to take on stuff with the scripts we use and then come back to how much of those scripts are just manifestations of embodied inactive ecological behavior and we've kind of reified them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1234.86,
    "end": 1241.143,
    "text": "So I suppose it becomes this, it's very much I think there's a kind of a,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1242.97,
    "end": 1252.235,
    "text": " a situated way that we kind of reenact or recapitulate this whole thing, depending on the discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1252.275,
    "end": 1258.319,
    "text": "So like if you're all sitting around a table, like in that board meeting where people are putting together pictures of a puzzle,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1259.244,
    "end": 1266.047,
    "text": " they might be working with the scripts of how they should assemble their perspectives.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1266.487,
    "end": 1275.471,
    "text": "And then you've got someone who's performing in a ritual and it might be much more about how they need to hold themselves as a person.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1275.511,
    "end": 1277.152,
    "text": "So I think there's something quite interesting",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1277.572,
    "end": 1283.036,
    "text": " that this whole scripts thing raises in terms of the scale question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1283.057,
    "end": 1293.405,
    "text": "And I suppose that's partly why, you know, Maxwell sort of ended up working a lot in here as well, because I think it ties back to the question of, well, what scale is the script happening at?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1293.585,
    "end": 1303.372,
    "text": "And that has a big impact when you try to then talk to people in a practice context, because if you're working with a community or an organisation or strategic projects,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1304.353,
    "end": 1317.428,
    "text": " strategy levels doing strategic foresight, they may be having their own kind of scripts that shape their social practices in that kind of domain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1317.508,
    "end": 1319.911,
    "text": "So I think this is kind of interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1321.061,
    "end": 1326.809,
    "text": " What you just said there reminds me of two people like looking at a river and they're seeing different things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1326.829,
    "end": 1328.571,
    "text": "They're seeing different scripts for the river.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1328.611,
    "end": 1333.818,
    "text": "There's no disagreement about what the river is doing, but one person looks at it and says, yep, at the fork, it goes left.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1334.259,
    "end": 1337.383,
    "text": "And the other person says it goes with the flow and today it's going left.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1338.044,
    "end": 1344.046,
    "text": " And so in that sense, they're seeing different scripts, but they're not disagreeing about what actually is happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1344.606,
    "end": 1349.908,
    "text": "And so it's like there's multiple concepts that are being projected onto the observables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1350.569,
    "end": 1356.13,
    "text": "And then there's the story about those two people and how they reconcile their perspectives by the riverbank.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1356.631,
    "end": 1356.891,
    "text": "And so...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1357.631,
    "end": 1374.399,
    "text": " Yes, the scripts concept does seem to apply everywhere, but maybe to begin to chisel away at what isn't a script, I would say a chair could be a prop, but I don't think a chair has a model where it is actually an agent, doesn't have agency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1374.959,
    "end": 1385.565,
    "text": "It's not an active entity in the script, though it can be mobilized by actors in a way that a prop can become enlivened, but it isn't with a generative model of that situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1386.045,
    "end": 1386.125,
    "text": "RJ?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1387.492,
    "end": 1398.441,
    "text": " Yeah, I was going to say the chair is an object that can be a part of a script, but I don't think it can, it's not a script itself and it can't act out any scripts, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1398.461,
    "end": 1399.702,
    "text": "Because it's not an actor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1402.804,
    "end": 1403.885,
    "text": "Unless maybe, you know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1404.246,
    "end": 1418.503,
    "text": " going out there it's like maybe if it were a mechanical chair of some kind like a massage chair then it has a script that has been encoded by by some other actor um but yeah i don't know sasha and then stephen",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1420.549,
    "end": 1422.93,
    "text": " Okay, that was a plot twist with the massage chair.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1424.45,
    "end": 1436.194,
    "text": "But perhaps the ability to participate in a script, does that imply that you're able to respond differently in different situations?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1436.334,
    "end": 1448.758,
    "text": "Because a chair will always be chairing, but an individual or a participator in a script, they can change",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1451.325,
    "end": 1454.586,
    "text": " based on the context and the kind of script that they're participating in.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1454.906,
    "end": 1459.109,
    "text": "So maybe that's a key aspect of being a participator in a script.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1460.61,
    "end": 1460.89,
    "text": "Stephen?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1462.451,
    "end": 1466.153,
    "text": "Yeah, I think this chair is quite an interesting example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1466.553,
    "end": 1476.979,
    "text": "Like in theatre, they often work with masks, and the mask, I think they might be sort of bringing this back to the bodies, like there's something about the mask and identity and taking off a mask, and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1478.001,
    "end": 1484.923,
    "text": " I haven't really thought about this before, but I don't know, say a throne compared to another chair, could the throne almost be coated with a mask?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1484.943,
    "end": 1485.663,
    "text": "You know what I mean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1485.683,
    "end": 1492.905,
    "text": "It starts to have an identity and it's like, you know, so I mean, a red nose is basically the smallest mask you can wear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1493.125,
    "end": 1502.187,
    "text": "It's basically become a clown, but all this work, and we don't tend to do much with masks, but if you go back to sort of indigenous cultures, everyone was working with masks, you know?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1502.207,
    "end": 1503.848,
    "text": "So something interesting in,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1506.048,
    "end": 1512.613,
    "text": " Is there something about the script which is about how we broadcast and receive through this part of the body?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1513.995,
    "end": 1514.255,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1514.635,
    "end": 1514.895,
    "text": "RJ?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1516.677,
    "end": 1517.537,
    "text": "Yeah, no, no, no.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1517.557,
    "end": 1530.568,
    "text": "So bouncing off what Stephen's saying, so one of the things when I first read the paper, I talked to you about this, Dan, like immediately after reading the paper, I think, was that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1531.636,
    "end": 1551.261,
    "text": " Uh, if you look at, uh, there there's a common rituals between North American Indians, Nordic cultures, African, like all over the place where, where, um, uh, what happens is there's, there's, uh, it's either dances, something along those lines where you use animal masks and act out the scripts that those animals use.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1551.281,
    "end": 1557.383,
    "text": "And it's really important, especially for, you know, like, uh, so I brought up to you Dan at one point, the bear, uh, in particular.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1557.813,
    "end": 1562.376,
    "text": " because a bear is an animal that has a set of scripts that you can identify that it's using.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1563.757,
    "end": 1576.104,
    "text": "And if you don't have experience, you know, knowing like reading their behavior, then you're more than likely going to get hurt or put yourself in a really dangerous situation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1576.164,
    "end": 1586.73,
    "text": "So like park services in North America routinely make the point that almost all negative bear encounters happen because people don't know how to interact with the bear.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1586.991,
    "end": 1587.411,
    "text": "They run.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1588.111,
    "end": 1589.952,
    "text": " Um, they, they're, they're not doing the right behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1589.972,
    "end": 1595.173,
    "text": "So even with like a, like a black bear, they play dead and it's like, don't play, don't play dead with a black bear because they're going to investigate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1595.193,
    "end": 1597.974,
    "text": "They want to figure out like, okay, easy, you know, easy meal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1597.994,
    "end": 1600.315,
    "text": "They're, they're, they're, they're curious and they're going to go mess with you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1600.895,
    "end": 1609.518,
    "text": "Um, so what, what these rituals did was they gave young people who hadn't had the experience yet an opportunity to see those scripts in action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1610.018,
    "end": 1614.96,
    "text": "Then before they may have ever interacted with the animal, they may be asked to play out that script.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1615.342,
    "end": 1617.965,
    "text": " take the place of the bear, wear the mask.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1618.826,
    "end": 1627.354,
    "text": "So acting out the script of the other person gives you a better sense of, or in this case, the animal, gives you a better sense of what it's like to be that animal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1627.694,
    "end": 1638.465,
    "text": "So in that case, acting out those scripts that other people may be using or other actors would be using actually is an advantage in the environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1639.933,
    "end": 1641.674,
    "text": " on you brought up the throne though.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1641.854,
    "end": 1655.584,
    "text": "And it's like, yeah, I like the presentation of it as a mask for a chair, but it's really important in denoting the person who sits in this chair should be acting a certain way, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1655.844,
    "end": 1658.486,
    "text": "And when they don't, it's a joke, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1658.526,
    "end": 1659.267,
    "text": "So I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1659.447,
    "end": 1662.029,
    "text": "I was just thinking about like a few things there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1662.469,
    "end": 1668.013,
    "text": "It's almost like there's a real advantage to understanding and then acting out the scripts of others.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1669.341,
    "end": 1691.965,
    "text": " nice rj the hero with a thousand chairs as it were um i also didn't bring up wolves and i wasn't praised for that so exactly oh wait blue so just kind of thinking about like the chair itself is actually like supposed to act a certain way like you're supposed to do certain things with the chair right and and i mean i i'm always telling my kids like",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1692.651,
    "end": 1693.512,
    "text": " That's for sitting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1693.732,
    "end": 1695.433,
    "text": "You've got the wrong end of you on the chair.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1695.554,
    "end": 1697.755,
    "text": "Like, so people get creative, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1697.815,
    "end": 1699.697,
    "text": "Like with the different roles that a chair can play.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1699.717,
    "end": 1703.64,
    "text": "It can be like a step stool or it can be, you know, some piece of gymnastic equipment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1703.66,
    "end": 1709.865,
    "text": "And it's just, it's just interesting to think about changing the scripts, even for a chair, let alone the person that's sitting in a chair.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1710.777,
    "end": 1734.998,
    "text": " yeah it's like the setup for an improv scene and yeah the different kinds of chairs are going to lend themselves to different scenes maybe with a throne maybe they could enact a classical monarchy script or maybe it's a monty python it's a satire or with certain kinds of chairs or in certain contexts you can enact a chivalry script and you can pull the chair out for your colleague so there's all kinds of ways that um different props",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1735.518,
    "end": 1763.869,
    "text": " facilitate or enable different scripts to play out and you can always do a mime like you can sort of act out a uh digging or you can act out playing baseball but you do need the props our extended cognition to actually do some of these scripts that involve our extended niche sasha um i just wanted to touch on something stephen said uh that you said today we don't do much with masks",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1767.613,
    "end": 1783.165,
    "text": " I guess I would disagree because it seems like a lot of us are doing a lot with masks and it's just, yeah, kind of obvious to think that that's a prop that is going to change our behavior in ways we might not even recognize.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1783.666,
    "end": 1793.714,
    "text": "And yeah, just important to think about how this new prop is changing human interaction and scripts and",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1795.511,
    "end": 1800.993,
    "text": " behavior in ways that we don't want or really expect a mask to change.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1802.874,
    "end": 1803.134,
    "text": "Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1805.855,
    "end": 1811.778,
    "text": "So Sasha didn't come right out and say it, but I'm gonna like maybe point it at what you're saying.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1811.878,
    "end": 1817.1,
    "text": "Maybe not, maybe I took it out of context, but I think that we do do a lot with masks.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1817.16,
    "end": 1820.781,
    "text": "Like we are right now using the biggest mask ever.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1820.861,
    "end": 1822.362,
    "text": "Like people are totally different.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1822.842,
    "end": 1824.364,
    "text": " in like their online persona.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1824.424,
    "end": 1830.751,
    "text": "Like some people will hide behind a computer screen and act in ways that they would never ever behave in real life, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1830.771,
    "end": 1836.317,
    "text": "So they have this like mask up, they can create this new persona and go forward in the world with that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1838.226,
    "end": 1839.587,
    "text": " Yep, very true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1839.787,
    "end": 1842.729,
    "text": "And with new props, there's new scripts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1842.929,
    "end": 1846.092,
    "text": "There's the one person's wearing a mask, but the other one isn't script.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1846.512,
    "end": 1849.834,
    "text": "There's the, is that person wearing an N95 script?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1849.854,
    "end": 1853.217,
    "text": "There's all these things that wouldn't have even made sense in 2019.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1853.717,
    "end": 1858.621,
    "text": "So that's the sense-making and the cultural sense-making and the tension and the friction",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1859.341,
    "end": 1881.35,
    "text": " when there's differences on opinion or differences in behavior and it's about um not just estimates of state but actually uncertainty and estimates about other people's uncertainty that's this whole like recursive and embedded element of active inference and it's about navigating the uncertainty of a situation not just maximizing the state itself and that's something we'll return to for sure stephen",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1883.288,
    "end": 1885.909,
    "text": " Yeah, I think this is interesting when you start to put the mask.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1886.289,
    "end": 1891.292,
    "text": "So I suppose I was talking about playing with the mask physically within the proximity of your face.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1891.332,
    "end": 1893.913,
    "text": "But yeah, there's this kind of mask out there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1893.953,
    "end": 1896.294,
    "text": "But in some ways, it's become abstracted.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1898.564,
    "end": 1901.846,
    "text": " Like it's almost like you put it on and put it off.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1902.386,
    "end": 1912.432,
    "text": "It's sort of almost part of the ecosystem that we've kind of created, which is maybe a little bit unhealthy because we don't, there's actually one really interesting activity I did once.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1912.452,
    "end": 1921.678,
    "text": "There was a chap from Rwanda who does healing work and he would get you to put a mask on in front of your face and read a poem that was really personal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1922.318,
    "end": 1928.142,
    "text": "And then you had to lower the mask, but it was like you were lowering the whole of your sort of,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1929.705,
    "end": 1950.515,
    "text": " masking identity and it left you feeling this incredible rawness which is really interesting so i suppose um yeah there is this tendency now that and i think even maybe more since the 1980s if i look back at videos of people in the 80s on tv and that they're often a lot more nervous in front of the camera now people are used to putting up a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1951.832,
    "end": 1955.096,
    "text": " some sort of smiley face type of thing and presenting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1955.116,
    "end": 1961.143,
    "text": "And I think there's something quite interesting in that that might relate to this paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1962.068,
    "end": 1984.34,
    "text": " Yeah, I've been thinking about that too, like with the selfie, new affordance of being able to add an arm's length, look back, not just with a disposable camera and snap the pic and have the perspectival imagination of being at your arm's end, but actually seeing it in real time and then video chatting or live streaming where you can see your own face during an interaction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1984.9,
    "end": 1986.261,
    "text": "So it's like you're seeing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1986.921,
    "end": 1988.482,
    "text": " the mask in real time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1988.902,
    "end": 1993.084,
    "text": "And then that's sort of like, I think it's a Campbell quote or it could be someone else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1993.124,
    "end": 1999.307,
    "text": "But like, if you think that you're rejecting the mask that society gives you, you're just wearing the mask of rejection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1999.347,
    "end": 2000.127,
    "text": "Everybody can see that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2000.347,
    "end": 2004.829,
    "text": "It's not exactly the quote, but basically it's like, you can't not play the mask game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2004.929,
    "end": 2006.37,
    "text": "There has to be an epithelium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2006.45,
    "end": 2007.59,
    "text": "There has to be a facade.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2007.95,
    "end": 2008.931,
    "text": "There has to be an interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2009.611,
    "end": 2017.098,
    "text": " And so we're talking about designing that interface because somebody who goes around saying, no, this is me, this is me, I have no mask, this is just what I am.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2017.138,
    "end": 2020.561,
    "text": "It's like, right, but there still is an external layer that's being presented, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2021.002,
    "end": 2024.925,
    "text": "And if someone says, no, I'm all me, there's no external level, it's like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2025.819,
    "end": 2031.943,
    "text": " Whoa, big if true, of course, but then it's not a helpful viewpoint for the world because we do need to interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2032.223,
    "end": 2035.905,
    "text": "We need to send emotions reliably and receive emotions reliably.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2035.965,
    "end": 2038.066,
    "text": "And so a lot there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2038.146,
    "end": 2040.107,
    "text": "Let's continue with some of these fun questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2041.528,
    "end": 2050.175,
    "text": " The third question is how do the network relationships, the red nodes influence potentially indirectly the focal edges in the network blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2050.716,
    "end": 2054.078,
    "text": "And then the fourth question would be like a little bit more of a wild card.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2054.379,
    "end": 2060.283,
    "text": "What could be a fun or interesting social experiment related to active inference, whether it's something that we do",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2061.044,
    "end": 2072.117,
    "text": " like a little experiment or just daily routine tweak, or whether this is something that could be carried out with a larger scale laboratory online or in a social setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2073.239,
    "end": 2076.803,
    "text": "So either of these questions people could raise their hand on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2076.923,
    "end": 2078.906,
    "text": "I would start with that third one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2080.988,
    "end": 2098.962,
    "text": " highlight that that edge it's a relation but it's like an atom in the world of relational thinking the edge is like the atom and so now we're in this network of edges which is what makes it kind of a tapestry and a social fabric and so if we want to understand the relationship between person a and b",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2099.762,
    "end": 2121.605,
    "text": " then we're always invoking all the other edges that stabilize them whether it's the who brings the food to these different people or how do they get their internet because they're not going to be able to connect if they're not going to get their internet and what are the norms that they're getting the other 23 hours of the day and that's what shapes and in some ways can even define",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2122.446,
    "end": 2130.491,
    "text": " the focal relationship is again, the other 95% of the person's life or day that they're not in that relationship.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2131.511,
    "end": 2132.592,
    "text": "Um, during RJ.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2132.632,
    "end": 2135.093,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2135.234,
    "end": 2138.195,
    "text": "So, um, uh, I'm just turning hand off.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2138.255,
    "end": 2138.576,
    "text": "There we go.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2139.136,
    "end": 2146.98,
    "text": "Uh, so on the last question, I think I have, um, something I've been thinking about that may relate to the prior one on network relationships.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2147.0,
    "end": 2147.741,
    "text": "so, uh,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2150.823,
    "end": 2158.509,
    "text": " Uh, my dog Achilles, uh, he usually wakes me up in the morning, uh, for, for like the last year or so.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2158.529,
    "end": 2161.351,
    "text": "Uh, we, we go on a walk at like 5 AM.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2162.131,
    "end": 2165.013,
    "text": "Um, and he is usually raring ready to go on that walk.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2165.073,
    "end": 2167.555,
    "text": "So I never really had to worry about an alarm clock.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2167.815,
    "end": 2169.617,
    "text": "He always, you know, he would always pawn me awake.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2170.257,
    "end": 2176.262,
    "text": "Um, and if I like, there's no snooze button on a dog, it is, you know, he he's there until I wake up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2176.982,
    "end": 2179.484,
    "text": "Um, but recently after Thanksgiving, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2180.461,
    "end": 2185.343,
    "text": " So I have Achilles and my parents have his brother, Socrates, and Socrates has been staying with us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2186.263,
    "end": 2190.324,
    "text": "So now Socrates plays with him during the day, wears him the hell out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2191.025,
    "end": 2195.846,
    "text": "And ever since Thanksgiving, he doesn't wake up in the morning anymore.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2195.866,
    "end": 2196.587,
    "text": "He doesn't want to wake up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2196.667,
    "end": 2197.427,
    "text": "He wants to sleep in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2198.047,
    "end": 2200.588,
    "text": "So he had a script that was present in the morning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2201.354,
    "end": 2202.915,
    "text": " that he now no longer has.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2203.275,
    "end": 2211.977,
    "text": "And this has led to me oversleeping almost every day because I don't have any script for interacting with an alarm clock in the morning anymore.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2212.878,
    "end": 2225.742,
    "text": "So I think that going right back to the beginning of what is not a script and where's the transparency on being able to look at what these things actually look like, I think our wake up",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2226.842,
    "end": 2238.326,
    "text": " scripts are probably some of the most transparent because they're the most consistent and they're the most, you know, kind of there's not a lot of outside interaction with those scripts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2238.506,
    "end": 2242.448,
    "text": "It's very much like at the moment when you're waking up, becoming conscious in the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2242.748,
    "end": 2244.929,
    "text": "So there's not a lot of priors of them, maybe your dreams, et cetera.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2245.929,
    "end": 2253.912,
    "text": "So I think it would be kind of a fun experiment to have people try to identify what it is their morning script actually is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2255.012,
    "end": 2260.214,
    "text": " identify where their first network relationship is in that script, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2260.254,
    "end": 2276.04,
    "text": "Because maybe it's, I know some people who wake up and immediately go on their phone or, you know, like, so then try to see if they can't pick out one part of that script that's not good for them, that they don't like, that's not healthy, et cetera.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2276.08,
    "end": 2281.422,
    "text": "And then like, you know, bringing back to my question, which I wanted to resolve last week,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2282.142,
    "end": 2285.869,
    "text": " was how do you identify the threshold events where you're able to change scripts?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2286.069,
    "end": 2293.162,
    "text": "I think it would be a fun experiment to try to figure out what are the best methods for changing your morning scripts, which are definitely some of the most difficult to change.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2294.025,
    "end": 2295.386,
    "text": " Good questions, RJ.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2295.426,
    "end": 2295.846,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2296.226,
    "end": 2300.128,
    "text": "That reminds me of somebody being asked, what is your morning routine?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2300.148,
    "end": 2301.228,
    "text": "What's your bedtime routine?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2301.368,
    "end": 2305.65,
    "text": "And I'm just projecting, but a common response could be, I don't have a morning routine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2306.011,
    "end": 2313.354,
    "text": "It's like, well, surely you do have a probabilistic distribution of places you wake up and how often you brush your teeth, even if it's 0%.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2313.494,
    "end": 2317.556,
    "text": "But there's some distribution of routines.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2318.036,
    "end": 2318.697,
    "text": "That's the script.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2318.877,
    "end": 2319.677,
    "text": "It could be a weak script.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2319.737,
    "end": 2320.597,
    "text": "It could be a strong script.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2320.858,
    "end": 2322.578,
    "text": "But some people just brush off the question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2322.598,
    "end": 2323.339,
    "text": "No, no, I don't have a mask.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2323.999,
    "end": 2324.739,
    "text": " I don't have a routine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2325.32,
    "end": 2327.28,
    "text": "It's like a way of not engaging with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2327.6,
    "end": 2335.203,
    "text": "But once you recognize that it's about the interface and it can be a probabilistic interface, just to say a morning routine, it doesn't need to be regimented.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2335.264,
    "end": 2336.784,
    "text": "It doesn't need to be externalist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2337.284,
    "end": 2338.765,
    "text": "It also doesn't need to be internalist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2339.245,
    "end": 2347.267,
    "text": " We're moving beyond internalism and externalism, as well as beyond restrictive, strong, or loose, weak.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2347.667,
    "end": 2349.788,
    "text": "We're taking all of those possibilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2350.268,
    "end": 2353.029,
    "text": "And now we're just thinking, yeah, so what is your morning script set?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2353.089,
    "end": 2355.009,
    "text": "Or maybe what genre are your mornings?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2355.849,
    "end": 2357.05,
    "text": "Is it an emergency movie?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2357.97,
    "end": 2358.59,
    "text": " Is it a comedy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2358.97,
    "end": 2367.954,
    "text": "And then also this question about the dependencies and to take it back to the social network and the scripts, it's like we often don't know all the dependencies until we do a perturbation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2368.394,
    "end": 2378.399,
    "text": "So like RJ, you didn't know about your lack of an alarm clock, you know, stimuli or script until there was another script that changed in a non-human animal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2378.999,
    "end": 2383.121,
    "text": " And then that had a cascading failure in this network of dependent scripts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2383.441,
    "end": 2387.363,
    "text": "So it revealed new relationships and dependencies because of a manipulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2387.803,
    "end": 2404.751,
    "text": "And so that's very related to active inference on a few levels, just to provide one is we're always interested, not just in coming to clarity on world states, but actually coming to clarity on which interventions or which experiments or perturbations would maximally inform us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2405.191,
    "end": 2408.792,
    "text": " while also remaining functional about those dependencies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2409.332,
    "end": 2422.295,
    "text": "So then you could be, even when the dog was still waking up early, you could have been experimenting with earlier or later wake-ups and maybe by bumping things by half an hour this way or another, you would have discovered, oh wait, without the dog, I don't have a way to wake up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2422.755,
    "end": 2428.577,
    "text": "Or if the dog is tired, then there's this other relationship and nobody would connect the dog being tired to waking up early",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2428.877,
    "end": 2430.799,
    "text": " for most people, especially if they don't have a dog.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2430.859,
    "end": 2436.143,
    "text": "But in this case, it could have been explored or actively inferred with rightful experimentation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2436.483,
    "end": 2436.804,
    "text": "Sasha?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2441.227,
    "end": 2444.81,
    "text": "Yeah, that's really kind of funny about the morning routine because",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2446.86,
    "end": 2453.202,
    "text": " Yeah, we, we of course all have one, but maybe it's not, not very glamorous or effective.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2453.663,
    "end": 2466.028,
    "text": "And it just reminds me of these sort of glamorized morning routines of celebrities where like they spend, you know, all this time putting stuff on their face essentially.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2466.528,
    "end": 2474.451,
    "text": "And it kind of signals like I have the kind of morning routine that I'm proud to tell other people about, or should be, uh,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2475.799,
    "end": 2479.064,
    "text": " you know, a sensational YouTube video that other people envy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2479.905,
    "end": 2485.893,
    "text": "And so kind of changing, yeah, what a morning routine is or should be.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2485.913,
    "end": 2489.839,
    "text": "And then also part of that whole like kind of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2491.564,
    "end": 2505.355,
    "text": " thinking about your morning routine is that it's very solitary when, in fact, of course, we wake up for other people or other creatures and that we kind of get sucked into someone else's script even before we know that we're part of it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2506.796,
    "end": 2514.262,
    "text": "Like people who wake up to take care of their kids, like maybe they don't want to be waking up, but, you know, and then how to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2515.163,
    "end": 2521.557,
    "text": " use Active Inference in a way that helps people modify their morning script",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2523.911,
    "end": 2532.675,
    "text": " in a way that I guess it just kind of reminds me of biohacking and being very focused on every metric that you have.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2533.095,
    "end": 2541.359,
    "text": "So do you have to have all those metrics in order then to change your morning script or to optimize that?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2541.779,
    "end": 2544.941,
    "text": "Or is there a way where Active Inference can help us get around that?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2546.321,
    "end": 2559.649,
    "text": " kind of self-measurement obsession that biohacking can veer off into when it can be more focused on just the performance and the human script that we're participating in.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2560.916,
    "end": 2562.357,
    "text": " Good question there, Sasha.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2562.597,
    "end": 2571.703,
    "text": "And it reminds me of just the imperatives in active inference being to reduce uncertainty and to design optimal experimentation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2572.203,
    "end": 2578.547,
    "text": "And so instead of in this reward framework, thinking we're gonna have the most rewarding morning",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2579.267,
    "end": 2582.45,
    "text": " It's going to set you up for the most productive day, or it's going to feel the best.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2582.79,
    "end": 2583.951,
    "text": "It's all about optimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2584.012,
    "end": 2584.852,
    "text": "Most, most, most.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2585.333,
    "end": 2587.995,
    "text": "And here we're actually saying, yeah, maybe we'll get there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2588.035,
    "end": 2588.676,
    "text": "That'd be great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2588.876,
    "end": 2591.819,
    "text": "But just where we are, how could we reduce our uncertainty?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2591.919,
    "end": 2603.85,
    "text": "Like maybe every morning you wake up and you're not sure whether you're going to take mechanism A of commute or B. So how could we start by reducing uncertainty and decreasing anxiety about the coming day, increasing clarity,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2604.41,
    "end": 2617.042,
    "text": " and then asking not what is the optimal state, but what's the optimal experiment and policy that's within our scope of affordances, not like waking up and instantly going to the strange attractor of thinking that something could be a different way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2618.043,
    "end": 2619.545,
    "text": "We can focus on our policies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2619.645,
    "end": 2629.134,
    "text": "And then this beyond internalism and externalism, it's just so critical because it's sort of the false dialectic of like worrying about oneself only",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2629.534,
    "end": 2638.318,
    "text": " and then disregarding systemic issues versus getting extremely obsessed with systemic issues and then losing the sight of the affordances that we do have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2639.059,
    "end": 2645.322,
    "text": "And in the middle is the compromised language, but we're gonna not just be in the middle, we're gonna be all over the map.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2645.802,
    "end": 2651.745,
    "text": "And we're gonna be able to dive into the internalist thinking when we need it, we're gonna be diving into the externalist thinking when we need it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2652.265,
    "end": 2659.292,
    "text": " but we're always going to be able to return to the fullness of the niche and what's possible and getting other people's perspectives on the issue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2659.632,
    "end": 2663.035,
    "text": "So that's, I think, a market difference in active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2664.937,
    "end": 2667.119,
    "text": "Let's go on to the next slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2668.04,
    "end": 2671.543,
    "text": "So this one's just kind of a little fun single question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2672.063,
    "end": 2674.526,
    "text": "I was just wondering, what does a script look like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2675.006,
    "end": 2675.286,
    "text": "And so...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2676.311,
    "end": 2682.493,
    "text": " The movie script, this is the Lethal Weapon 4 autographed edition script, one of a kind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2683.674,
    "end": 2684.614,
    "text": "That's a movie script.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2684.934,
    "end": 2694.238,
    "text": "So the words are syntactically encoded and maybe the semantics are suggested or it gives stage directions like a dramatic script.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2694.958,
    "end": 2697.84,
    "text": " And then in the middle is this like peer pressure script.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2697.94,
    "end": 2704.625,
    "text": "Like what's the script that keeps people driving on the right side of the road in America and on the left side of the road in the UK?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2705.165,
    "end": 2711.989,
    "text": "That is something that's enforced by semiotic cues like signs and counterfactuals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2712.03,
    "end": 2718.694,
    "text": "Like if I were to drive on the other side of the road, I would be in the felony script or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2719.134,
    "end": 2721.876,
    "text": "But how does peer pressure play out and how do we visualize it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2721.996,
    "end": 2722.577,
    "text": "And then just...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2723.337,
    "end": 2727.22,
    "text": " a big unknown is what do these active inference scripts look like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2727.68,
    "end": 2730.142,
    "text": "How would we communicate the scripts?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2730.862,
    "end": 2745.092,
    "text": "And so instead of using a movie dialogue to convey some of these probabilistic things or the peer pressure narrative to talk about some of these things, is there another visualization or representation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2745.873,
    "end": 2747.434,
    "text": "Just, I'm not sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2747.454,
    "end": 2749.956,
    "text": "If anyone has thoughts, yeah, RJ, or then anyone else, go ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2751.634,
    "end": 2768.663,
    "text": " Well, I think I don't know if I'm pretty sure I'm pretty sure the graphic was in was in the was in the slides last time was like kind of, you know, just just, you know, 2D representation of the axes of like strong script to weak script and internalist externalist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2769.267,
    "end": 2777.437,
    "text": " And the paper itself tried to show that it's like, look, these don't have to be divergent views.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2777.637,
    "end": 2779.099,
    "text": "They're just different perspectives.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2779.139,
    "end": 2779.62,
    "text": "Yeah, that's it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2779.68,
    "end": 2779.82,
    "text": "Yep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2780.621,
    "end": 2784.185,
    "text": "And I feel like the actor's script is just",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2785.506,
    "end": 2788.369,
    "text": " it's a continuum, it's a very strong externalist script.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2788.629,
    "end": 2792.932,
    "text": "You're either performing the script exactly or it's not being performed, it's not happening.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2793.773,
    "end": 2795.895,
    "text": "Then you have like, I brought up Always Sunny last time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2795.935,
    "end": 2798.377,
    "text": "It's like to show that allows for a lot more improvisation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2798.717,
    "end": 2804.381,
    "text": "So the scripts they use while strong and externalist aren't as strong as say Lethal Weapon, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2804.922,
    "end": 2806.043,
    "text": "But then peer pressure,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2806.603,
    "end": 2809.265,
    "text": " is something that's far more internalist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2809.425,
    "end": 2816.749,
    "text": "So your interpretation of what you think the script is and maybe talking with people about what you think the script is and trying to work that out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2817.009,
    "end": 2830.157,
    "text": "And it's a weak script where it's like, you can even see there that like in the picture that it's like, not everybody is acting out the same exact script and like, you know, like not the same exact movements.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2830.217,
    "end": 2834.74,
    "text": "Whereas you look at something like, you know, opposite end of the script",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2835.573,
    "end": 2854.322,
    "text": " um, the, the political representation may be represented as like, you know, um, uh, or, or I'm trying to think like historically, uh, like, like, um, uh, you know, um, during, during the third Reich, it's like, these were mixes of, um, of internalist scripts of what you think you're supposed to be acting out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2854.362,
    "end": 2859.484,
    "text": "But then there's also these strong scripts involved where it's like, you are supposed to make exactly these motions, et cetera.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2860.455,
    "end": 2861.777,
    "text": " Great points there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2861.997,
    "end": 2869.366,
    "text": "And yes, the peer pressure, I put it up there partially because it so directly calls us to move beyond internalism and externalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2869.527,
    "end": 2872.611,
    "text": "I mean, what could be more external than other people?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2873.151,
    "end": 2875.574,
    "text": "Yet at the same time, what could be more internal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2876.255,
    "end": 2881.039,
    "text": " psychologically or neurophysiologically than your interpretation of peer pressure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2881.559,
    "end": 2890.026,
    "text": "And then on the strong versus weak, just like you brought up, what could be weaker than an invisible and lightly guiding force in some cases?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2890.126,
    "end": 2895.851,
    "text": "Like, hey, peer pressure is like, you should wear shoes that have tied laces, but no one's going to like freak out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2896.411,
    "end": 2898.772,
    "text": " But there's other peer pressure things that people will freak out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2898.872,
    "end": 2899.853,
    "text": "And that's a strong script.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2900.233,
    "end": 2911.379,
    "text": "If 100% of the time that something happens socially enacted, another thing happens, it's quite strong because 100% of the time from state A, it moves to state B mediated by an external force.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2911.699,
    "end": 2912.86,
    "text": "So that's strong and external.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2913.18,
    "end": 2917.422,
    "text": "But there's other cases where it's weak and internal, at least in how it appears.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2917.983,
    "end": 2923.646,
    "text": "And again, the goal of active inference isn't to be like, yep, we judge strong versus weak and it's strong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2924.306,
    "end": 2945.515,
    "text": " It's rather to see this continuum as an area of theoretical dispute, yes, but now just a parameter in our way of thinking about the world so that there can be subcomponents or different people in the same crowd who are experiencing very different realities or having very different experiences",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2946.135,
    "end": 2967.55,
    "text": " sort of generative statistics for their decision making based upon some of these features we're discussing but yeah very interesting any other thoughts on the visualization otherwise there's um there's more we'll talk to because um it'll be good to have time for these two figures is that good all right let's go to these um two figures in the last half hour and just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2969.082,
    "end": 2971.803,
    "text": " Start out with just what are they showing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2972.163,
    "end": 2984.746,
    "text": "Because especially for those on the social sciences side, it might be like, whoa, interesting conversation about the scripts and the chair and the being and the becoming, but what are these variables and circles and lines?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2984.786,
    "end": 2997.03,
    "text": "So let's think about making that bridge between the qualitative things and the experiential and the social that we've been discussing with a more mathematical way that we're gonna be returning to in all these different conversations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2997.39,
    "end": 3003.877,
    "text": " So, and as always, people could just raise their hand, but we're going to do maybe 10 to 15 minutes on each of these two figures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3004.418,
    "end": 3009.203,
    "text": "So figure one in this paper is a simple generative model for policy selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3009.764,
    "end": 3013.728,
    "text": "And in ACT-INF, policy is always pi, p for policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3014.369,
    "end": 3015.991,
    "text": " So this is what is being estimated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3016.472,
    "end": 3019.696,
    "text": "The schematic depicts a generative model for policy selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3020.157,
    "end": 3025.203,
    "text": "It represents probabilistic beliefs about, and then all of this is color coded.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3025.684,
    "end": 3030.67,
    "text": "So the first thing is A. A is a probabilistic belief",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3031.351,
    "end": 3034.013,
    "text": " about how observations are related to the states that cause them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3034.273,
    "end": 3035.274,
    "text": "So here's observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3035.374,
    "end": 3037.816,
    "text": "This is like red photon on my retina.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3038.337,
    "end": 3041.639,
    "text": "And this state is like, I'm wearing a red shirt, okay?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3041.72,
    "end": 3042.7,
    "text": "So then there's this mapping.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3042.82,
    "end": 3049.246,
    "text": "In this case, it's pretty simple, where if there's a red shirt and the lights are on, then I'm gonna get red photons on my retina.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3049.606,
    "end": 3055.431,
    "text": "But one could imagine that there's state estimates that are social, like this person is unhappy with me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3055.851,
    "end": 3060.295,
    "text": "And there's some probability mapping onto different observations of body language,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3060.675,
    "end": 3062.757,
    "text": " or of words, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3063.157,
    "end": 3064.518,
    "text": "So that's the A matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3064.718,
    "end": 3067.42,
    "text": "It links the state estimates of the world to observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3067.92,
    "end": 3070.282,
    "text": "And A happens instantaneously in time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3071.022,
    "end": 3073.644,
    "text": "Now B is where we start taking lateral moves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3074.225,
    "end": 3079.028,
    "text": "And this diagram goes from the left, initial conditions, to the right through the time steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3079.208,
    "end": 3080.089,
    "text": "One, two, three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3080.369,
    "end": 3081.33,
    "text": "This is discrete time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3082.03,
    "end": 3087.913,
    "text": " And B, moving us from left to the right, is mapping states onto each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3088.313,
    "end": 3095.176,
    "text": "So if we were talking about the red shirt, well, if you're wearing a red shirt at one moment, basically 100% of the time, you're wearing a red shirt at the next moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3095.256,
    "end": 3096.656,
    "text": "So that's one simple format.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3097.237,
    "end": 3098.677,
    "text": "Or it could be, again, social.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3098.897,
    "end": 3104.28,
    "text": "Like given my estimates of this person, what do I estimate the transition matrix is?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3104.76,
    "end": 3109.942,
    "text": "So knowing this person, they get unhappy really fast, but it's really easy to bring them back to being happy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3110.462,
    "end": 3114.466,
    "text": " Or they're always happy, but once they get unhappy, they're going to stay in that state for a while.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3114.786,
    "end": 3119.811,
    "text": "So you can imagine like a matrix where the on and the off diagonals are different values.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3120.412,
    "end": 3125.997,
    "text": "And that captures whether once somebody is in a certain state, is it an attractor state or a dwell state?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3126.418,
    "end": 3130.422,
    "text": "Is it a state that they evacuate very rapidly, like balancing on one foot?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3130.822,
    "end": 3134.065,
    "text": "So that's what's captured in this B matrix is how things change through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3135.627,
    "end": 3137.509,
    "text": " D is the initial conditions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3137.609,
    "end": 3139.811,
    "text": "So those are states prior to sampling the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3140.251,
    "end": 3147.979,
    "text": "So that's like when we start having a conversation, I am estimating your initial conditions for that conversation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3148.74,
    "end": 3150.021,
    "text": "It's not that I know nothing about you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3150.062,
    "end": 3155.988,
    "text": "I'm bringing in my estimate of before the conversation, before I started sampling in this epoch, where were you at?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3157.096,
    "end": 3165.063,
    "text": " And then in the top, we have G, which includes C, which is the preferences and the outcome matrices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3165.604,
    "end": 3172.29,
    "text": "And so G, that's definitely unpacking equations for another day, for 11, as well as for other discussions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3172.811,
    "end": 3175.053,
    "text": "But let's just clarify this upper half.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3175.713,
    "end": 3177.956,
    "text": "G bears on the selection of policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3178.536,
    "end": 3185.942,
    "text": " That's why in active inference, we're so obsessed with free energy and how it relates to control theory, cybernetics, policy selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3186.403,
    "end": 3192.207,
    "text": "Because all of the coolness of free energy is that it's a different way of thinking about how policy selection occurs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3193.028,
    "end": 3195.79,
    "text": "So that's why G has an arrow pointing down to pi.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3196.191,
    "end": 3198.873,
    "text": "Now pi is influencing only Bs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3200.174,
    "end": 3206.759,
    "text": " So this is what's pretty interesting is what is being estimated by the agent is like this whole graph, okay?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3207.44,
    "end": 3212.463,
    "text": "But the connections within the model that are relevant are not from policy to state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3213.164,
    "end": 3223.912,
    "text": "So it's not saying how will states be different as a function of me with this investing strategy or of me with this social strategy or me with this navigation strategy, how will the states be different?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3224.653,
    "end": 3228.436,
    "text": "Actually, it's policy to state transition matrices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3229.176,
    "end": 3241.149,
    "text": " So this is like saying, if I undertake a policy where I exercise every day, then I believe that the state transition matrix from being unhealthy to being healthy will be modified.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3241.77,
    "end": 3244.013,
    "text": "Not that I will move from unhealthy to healthy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3244.193,
    "end": 3245.434,
    "text": "That's the state estimator.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3245.554,
    "end": 3246.715,
    "text": "That'd be policy to state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3247.276,
    "end": 3261.993,
    "text": " And it does result in the same conclusion functionally, but it's actually very, very different from a mathematical and from a programmatic standpoint to say that the policy estimate bears on how states transition into each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3262.654,
    "end": 3265.155,
    "text": " not just at the first level of what the states will be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3265.635,
    "end": 3273.818,
    "text": "So again, I can do policy one, two, three, four, five, and instead of saying, well, if I do policy one, then I would estimate that this state is most likely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3274.078,
    "end": 3276.559,
    "text": "And if I do policy two, this state is most likely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3277.019,
    "end": 3278.379,
    "text": "That's the old way of thinking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3278.8,
    "end": 3286.222,
    "text": "The B matrix way of thinking is under policy one, the world is apt to change in this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3286.842,
    "end": 3290.244,
    "text": "Under policy two, the world is apt to change in this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3290.824,
    "end": 3291.204,
    "text": "And then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3292.004,
    "end": 3304.613,
    "text": " that is related back to affordances and preferences in the C matrix, as well as other components of G that include for like the curiosity and the maintenance of rewarding states and all these other features.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3305.233,
    "end": 3309.096,
    "text": "So what this graph is showing again, just to sort of close out this little section",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3309.776,
    "end": 3313.359,
    "text": " is we're unpacking this idea of policy selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3313.619,
    "end": 3322.086,
    "text": "So just like if we were picking out how to drive from point A to point B, we're unpacking this policy selection with an eye towards social interactions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3322.346,
    "end": 3330.032,
    "text": "So where the state estimates are like whether the person is happy or unhappy with me, what are the observations I'm gonna see and how do those get mapped to each other?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3330.632,
    "end": 3332.914,
    "text": "What is their state through time or my state through time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3333.415,
    "end": 3334.596,
    "text": "And then how does that change?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3335.196,
    "end": 3338.479,
    "text": "What were the initial conditions that set up the first observation we got?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3339.119,
    "end": 3355.007,
    "text": " And then as a function of a lot of cool stuff, the sort of bulk of the iceberg in G, how can policies be selected to shape the way that states transition to each other in a way that's most aligned with how I want the world to be?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3356.298,
    "end": 3380.96,
    "text": " then agents that succeed in that succeed and those that don't don't so i hope that that sort of conveyed some of the attributes of this graph any thoughts or questions or what's another context where this graph could be sort of lifted up and placed down upon yeah so while people are thinking and raising their hand",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3383.126,
    "end": 3394.903,
    "text": " Again, I would just try to give one more bridge to the onboarding to Active Inference side, because for those who are familiar with the formalism, this is not even the full formalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3395.144,
    "end": 3398.208,
    "text": "They've probably already seen more expanded versions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3398.769,
    "end": 3416.121,
    "text": " But for those for whom this type of diagram is relatively novel in a social sciences setting, just always keep in mind that no matter how many letters, how many edges, superscript, subscript, Greek letters, Cyrillic letters, whatever there is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3416.721,
    "end": 3427.946,
    "text": " we're trying to just be specific about what we're talking about and find a generalization or structure that allows us to map structurally analogies from different social settings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3428.566,
    "end": 3439.391,
    "text": "So this could be so many different systems will fit under this type of model, as well as, and importantly, that strong versus weak, internal versus external,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3440.271,
    "end": 3464.334,
    "text": " idea that we were talking about earlier so we can have the initial conditions be me going outside with no shoes and here's somebody else estimating um things about me or me estimating things about other people or this could be um the initial conditions of hamlet in a given production or this could be the initial conditions of 2020 and so how in all of those different areas that qualitatively we were talking about how scripts could be used",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3464.935,
    "end": 3480.767,
    "text": " how are we going to find a sort of skeleton scaffold that all these other situations will be able to kind of hang on in a way that respects the specifics about their situation, as well as might even provide us with new knowledge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3481.708,
    "end": 3486.852,
    "text": "So for some of you that might be hearing it twice the same way in a row, for some of you, it might be zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3487.452,
    "end": 3489.114,
    "text": "And maybe for others, it's in the middle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3490.72,
    "end": 3495.401,
    "text": " Any thoughts though, before we go to the next figure, which is probably a bit richer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3496.821,
    "end": 3498.842,
    "text": "All right, let's look at the next figure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3499.242,
    "end": 3502.642,
    "text": "So anyways, this was the skeleton generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3502.882,
    "end": 3514.205,
    "text": "So hopefully we just familiarized ourself with the idea that things about social situations could be abstracted and represented with vectors and matrices and policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3514.605,
    "end": 3519.726,
    "text": "Now we're gonna take that to, and here's in the paper where they write about how that could map.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3520.666,
    "end": 3524.248,
    "text": " Now let's look at a little bit more expanded of an example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3524.868,
    "end": 3534.773,
    "text": "Okay, so now we're looking at not just the agent, but also the agent and the world, or what are called here the internal realizer and the external realizer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3534.913,
    "end": 3536.314,
    "text": "Because in figure one,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3537.014,
    "end": 3540.976,
    "text": " we were just looking at basically the internalist perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3541.356,
    "end": 3547.299,
    "text": "We were just looking at, you know, you could imagine that a brain were doing that or a computer were doing that, but there's nothing about the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3547.339,
    "end": 3553.482,
    "text": "There's no, there's an estimate of the world state, but there isn't an actual world state in this model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3553.943,
    "end": 3556.044,
    "text": "So this is purely internal to the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3556.684,
    "end": 3558.065,
    "text": " Now, let's look at figure two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3558.646,
    "end": 3567.273,
    "text": "Figure two is where we're going to start to bring in the world, and we're going to bring it in at a very specific position, and that is generating the observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3567.793,
    "end": 3568.814,
    "text": "That's really crucial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3569.194,
    "end": 3573.057,
    "text": "The world doesn't intervene by jumping into the internal model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3573.538,
    "end": 3578.202,
    "text": "Now, it might, in reality, this is the instrumentationalism of active inferences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3578.282,
    "end": 3583.086,
    "text": "We're going to model it as if the only interface that the world could have is with observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3583.686,
    "end": 3591.832,
    "text": " And so in this figure one, the only inputs to the model were basically the initial conditions and then the observables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3592.253,
    "end": 3597.017,
    "text": "And now we're picking right up here at the bottom of the figure, and we're going to graft the world in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3597.987,
    "end": 3599.308,
    "text": " So here's those observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3599.848,
    "end": 3603.691,
    "text": "And those observations are being generated by world states, which are 11.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3604.411,
    "end": 3606.453,
    "text": "So here, reading from the caption.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3606.993,
    "end": 3616.679,
    "text": "On the side of the external world, there's only one process in play, which is the likelihood of observation states the world, 11, and the transitions between these states in nine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3616.98,
    "end": 3617.7,
    "text": "That's down here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3618.301,
    "end": 3622.824,
    "text": "Okay, so this, from the point of view of the agent,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3623.8,
    "end": 3627.222,
    "text": " is the generative process that's creating the observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3627.722,
    "end": 3633.626,
    "text": "So like there's a shirt that's generating the red photons that is hitting my retina, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3634.286,
    "end": 3649.956,
    "text": "But here's what's really interesting is this model of hidden state mapping observation, transition matrix, change in state, emittance matrix observation again, that is what we just saw in figure one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3651.578,
    "end": 3656.2,
    "text": " flipped 180 degrees, state estimate and transition matrix, and then leading to observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3657.14,
    "end": 3664.283,
    "text": "That is this deep and fundamental symmetry that has been explored by Axel Constant, Yelle, Brunnenberg, and others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3664.823,
    "end": 3670.725,
    "text": "It's this idea that we're going to do this mathematical phrasing where like, we know which side we're on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3671.105,
    "end": 3675.607,
    "text": "We know which side is the internal side and which side is enclosed by the epithelium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3676.127,
    "end": 3678.208,
    "text": "But mathematically, look at 7, 5, 8, 5, 7.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3681.429,
    "end": 3703.075,
    "text": " and similarly 11 10 9 10 11. here you just have observation in the middle it's on the interface that's like the retina being hit by the photon and then there's a mapping on the internal side from the agent through some type of likelihood matrix to the observations so the agent is like reading",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3703.695,
    "end": 3707.918,
    "text": " It's trying to say, what is the hidden state five given observation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3708.238,
    "end": 3711.441,
    "text": "So what is the best seven to estimate five given the observation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3712.001,
    "end": 3713.422,
    "text": "And then what is eight?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3714.002,
    "end": 3716.484,
    "text": "What's the transition matrix from five to five?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3717.025,
    "end": 3718.926,
    "text": "And then similarly for the next time step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3719.686,
    "end": 3726.531,
    "text": "And then on the other side, it's the exact same, except the key difference is that in the case of the internal agents, we have six.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3727.662,
    "end": 3729.343,
    "text": " And so in six, we have policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3729.824,
    "end": 3738.231,
    "text": "Here it's a flirting policy, but in the world, there are things that change state to state in the world, but we don't have policy control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3738.271,
    "end": 3740.192,
    "text": "We don't have agency over those states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3741.033,
    "end": 3748.999,
    "text": "And so then in order to select policy, we have that G and that's kind of where we see the similarity to figure one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3750.31,
    "end": 3754.131,
    "text": " So it's just a very interesting formulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3754.271,
    "end": 3768.976,
    "text": "I'm sure each person's gonna see their own thing in it and let's have some conversation or questions about what's unclear here, but we're setting up the world and the agent, the heuristic description of the generative model of the niche and of the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3769.436,
    "end": 3776.419,
    "text": "We're setting them up in this intertwined and inextricable, but also deeply symmetrical way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3777.099,
    "end": 3783.001,
    "text": " where if it was an agent who's like an organism and the niche is the forest, so the forest doesn't enact any strategy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3783.021,
    "end": 3786.322,
    "text": "It has a certain layout of acorns, but that's not a strategy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3786.382,
    "end": 3787.902,
    "text": "That's like a chair for the squirrel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3788.522,
    "end": 3792.583,
    "text": "And then the squirrel is the active inferring agent that's gonna be doing things in this forest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3792.903,
    "end": 3794.064,
    "text": "So we can capture that here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3794.744,
    "end": 3809.134,
    "text": " But also if it was squirrel versus squirrel combat and each squirrel was going to be having a generative model of the other squirrel having a generative model of it, these are higher order theory of mind, recursive theory of mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3809.634,
    "end": 3815.038,
    "text": "It would be embedded in recursive because it'd be like about other active inference agents in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3815.578,
    "end": 3816.699,
    "text": "And it could be deep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3817.139,
    "end": 3818.34,
    "text": "It could be temporally deep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3818.76,
    "end": 3820.301,
    "text": "It could include counterfactuals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3820.521,
    "end": 3822.603,
    "text": "It could include affect or valence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3822.963,
    "end": 3824.204,
    "text": "That's what we'll be talking about in 11.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3825.264,
    "end": 3840.557,
    "text": " But it's set up in this way that's very parsimonious because in the limit, it allows for a true symmetry across the interface, across the blanket in the niche, where the niche can be learning and making a model of the agent and vice versa.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3841.177,
    "end": 3850.185,
    "text": "So in the extreme, it allows for that type of richness of agent-agent dynamics, or this could be reduced to two inanimate objects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3850.725,
    "end": 3853.727,
    "text": "So if there's two rocks that are just two bumps on a log,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3854.548,
    "end": 3865.296,
    "text": " and they're not doing free energy minimization or recursive estimation of anything, they're just doing what they're doing with a certain state transition matrix, that can be captured within a reduced version of this framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3866.097,
    "end": 3871.101,
    "text": "So yeah, not trying to rant on it, but I just think that's kind of an interesting piece of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3871.581,
    "end": 3874.703,
    "text": "And we often come back to this idea of niche construction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3874.763,
    "end": 3878.086,
    "text": "And it's like, wait, isn't control theory about what's the best strategy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3878.506,
    "end": 3880.668,
    "text": "Where's niche construction coming into play?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3881.308,
    "end": 3882.649,
    "text": "Internalism, externalism?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3883.49,
    "end": 3888.84,
    "text": " It's like, we're moving beyond internalism and externalism because we're saying you always need both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3889.667,
    "end": 3890.908,
    "text": " You're always gonna need both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3891.228,
    "end": 3893.79,
    "text": "And there's gonna be many types of interfaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3894.551,
    "end": 3906.241,
    "text": "One important interface is seven and observations, which is like the sensory states, the sensory capacities of the organism, the umwelt, and the actual observations themselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3906.701,
    "end": 3911.345,
    "text": "That's like the handshake or the API call that actually crosses the interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3911.666,
    "end": 3914.068,
    "text": "Those are critical, but almost by definition,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3914.608,
    "end": 3928.521,
    "text": " Because if there's something that doesn't cross the interface on the inbound side, like a sense data that doesn't hit a neuron, or on the outbound side, like an action that doesn't act, if it doesn't cross the interface and make the connection, it's almost like it didn't happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3929.262,
    "end": 3934.126,
    "text": "And so we define the interface in terms of the connections that do happen",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3934.907,
    "end": 3945.796,
    "text": " And then we can always be sure to be talking about relevant features of the world and always in a way that moves beyond simple conceptions of internalist versus externalist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3946.216,
    "end": 3955.464,
    "text": "We'll have the ability to find situations where the internal features, given a certain blanket of analysis, dominate the dynamics of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3956.064,
    "end": 3962.33,
    "text": "Or where given the inclusion of certain parameters or in a certain timescale of analysis, the external features dominate it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3962.69,
    "end": 3962.77,
    "text": "But",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3962.95,
    "end": 3967.013,
    "text": " But no one can say that's really a win for externalism or a win for internalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3967.473,
    "end": 3969.054,
    "text": "It's just a description of a situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3969.574,
    "end": 3985.165,
    "text": "So I think it's an example about how we move beyond some of these theoretical and literature grounded abstractions with a more abstract and general framework that actually lets us be more specific",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3986.005,
    "end": 3986.806,
    "text": " in the projects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3987.346,
    "end": 3992.772,
    "text": "So we kind of escape this uncanny valley of whose team is better, internalism or externalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3993.272,
    "end": 4004.182,
    "text": "We're going to escape that valley by taking one step towards abstraction by like, whoa, what if we thought about the agent in the world as acting across an interface in the most general possible way?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4005.003,
    "end": 4016.269,
    "text": " But it turns out that by framing it as an interface, we're gonna be able to be very, very specific about the narratives of radicalization or the kinds of cues that are exchanged in a flirting relationship.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4016.77,
    "end": 4022.153,
    "text": "Whereas if you're in the debate of internalism, externalism, you could have whole academic conferences on,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4023.143,
    "end": 4052.823,
    "text": " narratives of radicalization or behaviors of flirting and potentially the people would leave that meeting still feeling like their side had won so there wouldn't be a true conceptual synthesis so again a little bit another spiral away another tangent but that's why these kinds of formalizations and specifically graphical and computable ways of thinking about them can bring clarity to some of these long-standing qualitative questions and also necessitate the collaboration of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4053.463,
    "end": 4056.305,
    "text": " basically quantitative and qualitative expertises.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4056.545,
    "end": 4056.785,
    "text": "RJ?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4058.947,
    "end": 4073.036,
    "text": "So I've seen, like, not exactly this graphic, but throughout each of the papers, especially the ones Fristin's involved with, there's always some iteration of it and some iteration of explanation of active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4073.076,
    "end": 4079.62,
    "text": "And one thing that I've seen alluded to in the words, but not in the graphic,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4080.536,
    "end": 4084.379,
    "text": " is this updating of the observation itself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4085.6,
    "end": 4087.982,
    "text": "And maybe this is being represented here, and I'm not seeing it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4089.263,
    "end": 4095.769,
    "text": "But what I find is like, and I'll get to why this is fairly important to me in a second.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4095.789,
    "end": 4099.852,
    "text": "But it seems like, well, in any process of sense making, we have this induction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4100.572,
    "end": 4109.139,
    "text": "And at the state of induction, you're actually like, before you're getting to trying to parse meaning, you're trying to check",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4110.149,
    "end": 4114.134,
    "text": " whether or not what you've observed is even the correct observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4114.214,
    "end": 4115.095,
    "text": "So it's the double take.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4115.976,
    "end": 4121.103,
    "text": "And this is one of the reasons in intelligence analysis that collection is separated",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4121.63,
    "end": 4133.334,
    "text": " from, from, from your, your all other elements of the production cycle, because what they're trying to do is they're trying to make sure that there's not this like constant seduction of going back and checking again, checking again, checking again, they're trying to make it so that there's pipeline.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4133.614,
    "end": 4135.355,
    "text": "So when something comes in, it's going up the pipe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4135.415,
    "end": 4142.658,
    "text": "It's not your job to look any further into whether or not what you saw with meant something or whether or not it was correct, or it's just report what you saw, push it through.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4142.978,
    "end": 4144.198,
    "text": "And now it's not your problem anymore.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4144.218,
    "end": 4144.438,
    "text": "It's up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4144.539,
    "end": 4145.779,
    "text": "It's up somebody else's problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4146.119,
    "end": 4146.299,
    "text": " Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4147.06,
    "end": 4155.589,
    "text": "So like now at the at the scale of the individual, though, we're constantly double checking ourselves whether or not we saw we thought we saw.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4155.649,
    "end": 4161.856,
    "text": "So like if I'm if I'm reading a paper and I find, you know, something cited and I kind of.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4162.416,
    "end": 4163.817,
    "text": " know where that's coming from.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4163.957,
    "end": 4170.201,
    "text": "So this happened when a few people on this call, we were working together on a paper for active inference and behavioral engineering.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4170.802,
    "end": 4172.583,
    "text": "And I was looking into a spirit decor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4172.983,
    "end": 4178.807,
    "text": "And while I was doing that, there was a big problem because there were so many different interpretations of what a spirit decor meant.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4179.648,
    "end": 4186.292,
    "text": "So what ended up happening is every time I saw the words, I'm checking myself and going, wait, am I actually observing what I think I'm observing?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4186.332,
    "end": 4189.174,
    "text": "I'm checking against priors and I'm updating my observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4190.095,
    "end": 4192.036,
    "text": "So what I'm kind of wondering is like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4193.077,
    "end": 4196.138,
    "text": " One, is this represented in this graphic and I'm not seeing it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4196.939,
    "end": 4217.792,
    "text": "And then two, I know that over time we're starting to see actual computational models using active inference, are those models, if they were applied in an agent-based model or applied in machine learning, are those models trying to act that process out of checking back on the observation and making sure that it's actually observing what it thinks it's observing?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4218.492,
    "end": 4219.693,
    "text": " rather than just taking data in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4219.713,
    "end": 4220.573,
    "text": "Does that make sense?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4220.953,
    "end": 4221.153,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4221.433,
    "end": 4223.054,
    "text": "Thanks for the question, RJ.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4223.994,
    "end": 4230.256,
    "text": "It is lightly indicated in this figure, as with the other figure, there's a movement from left to right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4231.217,
    "end": 4234.198,
    "text": "The nodes are numbered by the kind of things that they are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4234.958,
    "end": 4238.76,
    "text": " And so it's lightly indicated where the direction of time is going with these dotted arrows.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4238.8,
    "end": 4243.482,
    "text": "So like, for example, the first 10 on the bottom left, that's like a hidden state of the world, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4243.642,
    "end": 4247.264,
    "text": "And through an 11, it emits an observation at time point one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4247.884,
    "end": 4250.546,
    "text": "Then there's a transition matrix nine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4251.206,
    "end": 4257.609,
    "text": "And so if you did hourly checkpoints, the nine matrix that you calculate is going to be the hourly transition matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4257.929,
    "end": 4259.57,
    "text": "If you do one minute",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4259.95,
    "end": 4264.111,
    "text": " checkpoints, like a discrete time with an interval of one, nine is going to be a different matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4264.371,
    "end": 4270.333,
    "text": "So it's kind of like how the candle chart of a stock or a crypto looks different depending on what time length the candle is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4270.393,
    "end": 4273.054,
    "text": "So it's not the same matrix for all time intervals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4273.114,
    "end": 4274.994,
    "text": "It's always model interval dependent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4275.514,
    "end": 4278.935,
    "text": "But nine moves us from the left 10 to the right 10.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4279.475,
    "end": 4288.038,
    "text": "And then at that 10, again, it's the type 10, not like node number 10, it emits through the same or a different 11, another observation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4288.678,
    "end": 4292.241,
    "text": " Now, the early models, all the 11s were fixed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4292.642,
    "end": 4296.806,
    "text": "So like the hidden state could go from daytime to nighttime, but like the 11 was fixed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4297.406,
    "end": 4305.874,
    "text": "And then you could imagine that a more advanced version of the model would be like, yeah, actually the hidden state through time, it changes in how it emits 11.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4305.914,
    "end": 4308.636,
    "text": "Okay, now flip the interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4309.637,
    "end": 4313.019,
    "text": " Seven is perceiving the observation, the left seven.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4313.499,
    "end": 4319.282,
    "text": "And then it's doing estimation of the hidden state S. So that, or five, it just looks like an S and it is S in the models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4319.682,
    "end": 4325.425,
    "text": "So it's kind of like at each time point, we have this like 10 hidden state of the world emits through 11 in observation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4325.545,
    "end": 4326.586,
    "text": "That's on the interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4326.626,
    "end": 4330.508,
    "text": "That's that holographic boundary that Chris Fields is going to help us understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4331.168,
    "end": 4337.113,
    "text": " Then on the organism side, the internalist side, seven does a state estimate five.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4337.613,
    "end": 4339.014,
    "text": "Then we move through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4339.654,
    "end": 4347.08,
    "text": "The organism updates its estimate through time with eight and the world updates its actual state with nine, its hidden state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4347.72,
    "end": 4350.262,
    "text": "And then there's another time point, another stack of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4350.843,
    "end": 4354.705,
    "text": "And so in the example that you gave with like going back and double checking information,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4355.626,
    "end": 4364.694,
    "text": " It's like you get an observation at one moment and then whether or not it's concordant with something, at least you're instantaneously sure of what it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4365.354,
    "end": 4375.702,
    "text": "But then here's another dimension that the computational models are going into, which is at each time point, it calculates an integral through time of policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4376.483,
    "end": 4380.604,
    "text": " So that's the part where we're gonna talk about it in 11 and a few other ones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4381.224,
    "end": 4385.885,
    "text": "But the simplest model would be like, again, red shirt or black shirt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4386.245,
    "end": 4389.766,
    "text": "And then it's like the photon is the observation and the state estimates pretty straightforward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4389.786,
    "end": 4391.046,
    "text": "It's like a two by two matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4391.426,
    "end": 4396.327,
    "text": "There's an unchanging characters in the matrix because the red shirt always emits red and there's no ambiguity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4396.347,
    "end": 4402.108,
    "text": "Okay, now we can start to relax those assumptions and we can think about, okay, maybe there's more ambiguity in the signal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4402.768,
    "end": 4405.751,
    "text": " Maybe there's a non-stationary 11 matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4406.332,
    "end": 4407.913,
    "text": "Maybe we can learn seven.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4408.274,
    "end": 4412.038,
    "text": "We can learn better about how observations are related to world states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4412.298,
    "end": 4416.863,
    "text": "Maybe we can learn eight better, which is sort of like trying to reflect nine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4417.263,
    "end": 4420.286,
    "text": "We can learn about how states in the world transition better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4421.047,
    "end": 4434.5,
    "text": " And we can learn better policies too, better sixes, but that what we've just been focused on is really just the loop with the 10, 9, 10, 9 in the world, 5, 8, 5, 8 in the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4434.941,
    "end": 4440.526,
    "text": "And then this interface that has a symmetry of the sevens and the 11s around the observation itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4441.207,
    "end": 4464.547,
    "text": " so yes they're the kinds of things that people are starting to roll out but i think that especially if you watch 11 coming up you'll get a sense at how rudimentary these rollouts are really it's at like the uh ibm chess 1995 status where like many many branches of counterfactuals are being processed and then evaluated",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4465.328,
    "end": 4491.888,
    "text": " and more modern chess computers don't use this branch rollout evaluation strategy in the same way so we're still in a very early stage that's basically um defining what that rollout would be through time and then there will be other ways of heuristically approximating very good rollouts sasha",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4495.287,
    "end": 4495.787,
    "text": " Yeah, nice.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4495.848,
    "end": 4499.691,
    "text": "Thanks for walking through that on the diagram with all the numbers.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4499.711,
    "end": 4507.899,
    "text": "Yeah, just some things that RJ reminded me of is in thinking about data collection.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4509.739,
    "end": 4515.422,
    "text": " it would be great if we could separate the data collection from the data interpretation and acting on it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4515.582,
    "end": 4520.664,
    "text": "And, you know, in formalized kind of scientific approaches, we can do that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4520.744,
    "end": 4533.811,
    "text": "Like, I'm just thinking about my own work when I do microscopy and I'm looking at some cells under a microscope and I might have like an emotional reaction to how they look, which is like,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4534.431,
    "end": 4542.556,
    "text": " They look really good and I want to analyze them or something went terribly wrong and they look like not even cells at this point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4542.697,
    "end": 4550.662,
    "text": "So I think part of going through this process is being able to separate the individual steps.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4550.862,
    "end": 4553.964,
    "text": "So I have to actively prevent myself from... Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4558.197,
    "end": 4574.743,
    "text": " kind of throwing in the towel preemptively when I don't, when the data doesn't meet my expectations until I go to the next step of like randomizing and analyzing it such that I can remove my expectations and just try to collect what is there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4575.583,
    "end": 4576.183,
    "text": "And I think that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4578.004,
    "end": 4587.03,
    "text": " Yeah, that's something that's nearly impossible to do in the human experience, that we can't really separate the data collection from the data interpretation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4587.53,
    "end": 4590.252,
    "text": "And yeah, it just moves too fast.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4590.652,
    "end": 4604.462,
    "text": "And then in the realm of uncertainty and what does this word mean in different contexts, as RJ was saying, that is the kind of thing that in teaching, we try to think",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4605.356,
    "end": 4611.943,
    "text": " You know, if you don't know every single word in what we're learning today, it's going to be really hard to build on any next level concepts.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4612.363,
    "end": 4616.848,
    "text": "So and students will often say, like, well, I don't really know this word, so I don't know.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4617.209,
    "end": 4626.418,
    "text": "But the first thing to do is to, like, just look up what the word means so that you can move past that uncertainty and move on to move on to the next layers of things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4628.24,
    "end": 4643.827,
    "text": " And so that really, to me, makes me think of like social anxiety and people not being able to interpret social cues appropriately and that creating uncertainty, which is just like it kind of snowballs once you're uncertain about one aspect of an interaction or a script.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4645.087,
    "end": 4650.27,
    "text": "You kind of are prevented from participating in the next levels or carrying out the script.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4650.75,
    "end": 4657.393,
    "text": "And so that perhaps is something interesting to discuss in next week's interactions, discussions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4659.104,
    "end": 4659.384,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4659.885,
    "end": 4660.205,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4660.465,
    "end": 4665.349,
    "text": "I think that question especially, Sasha, really makes me think about script design.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4666.169,
    "end": 4673.474,
    "text": "And we're talking about the analysis and the descriptive ways of talking about systems, but also about designing the scene and the stage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4674.335,
    "end": 4686.484,
    "text": "I think Steven dropped off, but is somebody with drama experience, performance experience, social performance, performing our roles, a lot of these terms are starting to blend together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4686.824,
    "end": 4709.883,
    "text": " with the mask and previously that would be seen as dramatic or ritualized now it's seen as a matter of public safety so many of these things are actually coming together in a way where we can um certainly within our own life if not at a higher level ask about what kind of scripts we want to design for moving forward especially about the uncertainty from all these different issues so um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4711.021,
    "end": 4712.962,
    "text": " Here's just a couple of questions I wanted to throw up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4713.142,
    "end": 4714.362,
    "text": "We only have, you know, three minutes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4714.642,
    "end": 4729.708,
    "text": "So really just for the listeners live or in replay to add comments or start a discussion in whatever platform we're using, just questions like thinking about how this could be a unifying topic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4730.148,
    "end": 4731.949,
    "text": "How could this be a valuable model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4732.449,
    "end": 4734.469,
    "text": "What unique insights are we looking for?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4735.05,
    "end": 4737.27,
    "text": "How could we rethink our experiences?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4737.851,
    "end": 4738.271,
    "text": "What would be,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4738.971,
    "end": 4743.863,
    "text": " explanations or predictions and what would be next steps for the research and um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4745.026,
    "end": 4746.007,
    "text": " Thanks for participating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4746.247,
    "end": 4753.333,
    "text": "I'm going to just pause it on this final slide as we hear our last thoughts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4753.394,
    "end": 4756.176,
    "text": "So everyone prepare a little last thought if you'd like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4756.957,
    "end": 4759.159,
    "text": "And to listeners, thanks for listening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4759.559,
    "end": 4762.402,
    "text": "We will have follow-up forums for the live participants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4762.482,
    "end": 4763.843,
    "text": "It's in the calendar invite.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4764.644,
    "end": 4768.887,
    "text": "And anyone is welcome to provide us with feedback and stay in touch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4769.588,
    "end": 4773.67,
    "text": " But for the last three minutes, let's just hear from our panelists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4773.811,
    "end": 4776.332,
    "text": "Anybody who would like to, what is a last thought?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4776.792,
    "end": 4778.393,
    "text": "What's something you're still wondering about?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4778.694,
    "end": 4782.136,
    "text": "Or now that we're done with 10, where does that leave us?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4782.936,
    "end": 4783.977,
    "text": "What are some last thoughts?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4784.237,
    "end": 4785.458,
    "text": "RJ and then Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4787.239,
    "end": 4795.864,
    "text": "So I think we did find some conclusion on what can't use a script.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4797.032,
    "end": 4801.914,
    "text": " Um, but, uh, I still don't feel like we have a good conclusion on what a script isn't.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4802.014,
    "end": 4802.794,
    "text": "What is that line?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4803.014,
    "end": 4808.156,
    "text": "So, um, I'm going to be thinking about that the next week and I hope we touch on that next discussion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4809.757,
    "end": 4810.357,
    "text": "Awesome bloop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4812.085,
    "end": 4826.459,
    "text": " So I'm just wondering, left really wondering, where can we use this to engineer social behavior or to change scripts that are perhaps unnecessary or unwanted in society, like radicalization scripts or things like that?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4826.539,
    "end": 4827.32,
    "text": "So that's where I'm left.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4827.34,
    "end": 4830.603,
    "text": "How do we then go out and apply what we've learned?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4832.825,
    "end": 4833.125,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4834.266,
    "end": 4835.868,
    "text": "Either of the Sashas or Avant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4840.939,
    "end": 4847.301,
    "text": " Yeah, similar to Blue, I'm left thinking about what is the application of active inference in scripts.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4847.861,
    "end": 4854.383,
    "text": "And I guess instead of feeling unsatisfied, I feel excited about it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4855.363,
    "end": 4856.204,
    "text": "That's my perspective.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4857.024,
    "end": 4865.806,
    "text": "But it seems that maybe at the end of the last conversation, I felt ambivalent or confused about scripts.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4865.946,
    "end": 4866.747,
    "text": "And now I'm a bit more...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4868.174,
    "end": 4870.698,
    "text": " directed in their use or their possibilities.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4871.019,
    "end": 4878.051,
    "text": "So I'm really happy to kind of have talked through this and find a way out.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4880.071,
    "end": 4891.095,
    "text": " That makes me feel excited about scripts that hold space specifically for things like freedom of expression or speech or improvisation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4891.475,
    "end": 4894.716,
    "text": "It's like a protection within the script.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4894.816,
    "end": 4896.937,
    "text": "This is the part of the song where there's a drum solo.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4897.257,
    "end": 4899.238,
    "text": "So for this part, you get to play in time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4899.258,
    "end": 4901.519,
    "text": "And then for this part, it gets to be wacky.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4902.139,
    "end": 4925.241,
    "text": " And so in that way we can, and like Blue is saying as well with the design, we could be able to converge on scripts that protect certain freedoms as intrinsic to the structure of the script and being able to have a discussion about that that is nuanced, like we hopefully are representing and learning how to represent here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4925.942,
    "end": 4941.101,
    "text": " that could be a really productive discussion instead of just about rights versus all these other things that can get tangled down in so everybody thanks so much for participating and for the great discussion as always this is it for 10.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4942.082,
    "end": 4948.324,
    "text": " We will have 11 in the final two weeks of December 2020, the 11th hour, the 11th Act-Inf stream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4948.864,
    "end": 4950.204,
    "text": "And then we will have 12.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4950.324,
    "end": 4956.246,
    "text": "The clock will strike midnight on Act-Inf 2020, and we will be heading into a very exciting 2021.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4957.627,
    "end": 4962.528,
    "text": "So thanks again for listening and for participating, and see you later.",
    "speaker": "SPEAKER_01"
  }
]