[
  {
    "start": 3.929,
    "end": 5.33,
    "text": " All right, welcome back everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6.031,
    "end": 8.293,
    "text": "We're in the first discussion for Chapter 8.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9.895,
    "end": 16.722,
    "text": "So, does anyone want to begin with like just any thought or question on 8?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 16.962,
    "end": 22.447,
    "text": "Any quote or part?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 24.629,
    "end": 25.71,
    "text": "And we'll just see where it goes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 30.175,
    "end": 30.375,
    "text": "All right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 33.258,
    "end": 36.262,
    "text": " Hal Hallstein, yeah I was curious about the role of attractors.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 37.343,
    "end": 39.045,
    "text": "Hal Hallstein, In the.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 40.407,
    "end": 41.147,
    "text": "Hal Hallstein, yeah how.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 41.168,
    "end": 43.671,
    "text": "Hal Hallstein, The role of attractors in the.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 43.811,
    "end": 47.515,
    "text": "Hal Hallstein, General let me, let me try to find the exact.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 49.918,
    "end": 51.74,
    "text": "Hal Hallstein, world section.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 58.769,
    "end": 63.214,
    "text": "Hal Hallstein, yeah just basically the role of fixed point attractors in the in the generative process.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 70.383,
    "end": 72.807,
    "text": " Anyone with a thought on that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 85.988,
    "end": 94.922,
    "text": "All right, there's a lot to say about attractor behavior in dynamical systems overall, and that's kind of where we're at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 96.134,
    "end": 111.189,
    "text": " One way to think about it is if there wasn't some kind of attractor point or set or limit cycle or something like that, that variable would like never converge to a legible stationarity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 112.13,
    "end": 118.297,
    "text": "So if something's oscillatory, it could be thought of as like converging to a cyclic attractor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 118.437,
    "end": 121.72,
    "text": "If something is kind of like dampening, like a spring,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 122.223,
    "end": 129.872,
    "text": " that's like a fixed point attractor plus dampening, or it could be like just oscillating around a fixed point attractor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 130.472,
    "end": 140.724,
    "text": "So it's like dynamical systems are of certain types analytically, and they can be converging and dampening, converging and oscillating, limit cycles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 140.764,
    "end": 144.388,
    "text": "All these are like different outcomes or possibilities for dynamical systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 145.149,
    "end": 147.792,
    "text": "But to kind of pull back a step,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 149.915,
    "end": 155.282,
    "text": " So chapter 8 follows on chapter 7, which shows the discrete time formalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 155.983,
    "end": 161.41,
    "text": "So in chapter 7, discrete time steps in the simulation are explicitly modeled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 161.651,
    "end": 165.516,
    "text": "Like we have time 67, time 68, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 166.938,
    "end": 173.647,
    "text": "Chapter 8 is going to show a totally different complementary treatment of time for generative models, which is the continuous time formalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 173.687,
    "end": 177.492,
    "text": "And this chapter is about like unpacking a lot of the differences from the discrete time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 178.096,
    "end": 187.85,
    "text": " And one of the key differences is like a different take on the relationship between observations and hidden states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 188.551,
    "end": 199.446,
    "text": "So in the discrete time setting, and figure 4.3 is like the Rosetta Stone with the top discrete time model and the bottom continuous time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 199.713,
    "end": 210.227,
    "text": " So in the partially observable Markov process setting, the A matrix is kind of going both ways between the hidden state and the observation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 211.429,
    "end": 226.549,
    "text": "Here, kind of in line with the continuous time formulation being closer to some physics-based formula, there's two core equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 226.569,
    "end": 228.792,
    "text": "There's observations, y,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 230.459,
    "end": 232.122,
    "text": " the same as observations here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 233.243,
    "end": 239.613,
    "text": "And then x dot, so the derivative on hidden states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 240.374,
    "end": 241.957,
    "text": "So derivative on hidden states here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 242.958,
    "end": 244.601,
    "text": "And basically each of these are mapped out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 244.621,
    "end": 250.51,
    "text": "So there's like a kind of regularity of observations or a function of observations and a noise function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 250.878,
    "end": 252.84,
    "text": " And then there's also an underlying generator.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 253.381,
    "end": 255.723,
    "text": "And this is kind of coming from Friston et al.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 255.683,
    "end": 264.171,
    "text": "'s earlier work with SPM, where Y are like all of the sensor data for the neuroimaging, like fMRI or EEG.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 264.932,
    "end": 273.621,
    "text": "And then X dot is the rates of change of the underlying neural activity that's related to the observations that are coming in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 277.164,
    "end": 279.687,
    "text": "So that's kind of, that could describe any,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 280.291,
    "end": 306.332,
    "text": " g and any f so then they by 8.3 get to a kind of simple generative model where there's a fixed point attractor so here's the what it looks like to have a fixed point attractor so this is basically when x is less than v the set point",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 307.308,
    "end": 316.247,
    "text": " The rate of change is positive, so it goes up and then when X is higher than the set point the rate of change is negative, so it goes down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 316.267,
    "end": 324.905,
    "text": "So it's kind of like a first order thermostat with a set point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 324.925,
    "end": 327.51,
    "text": "encoded in the underlying dynamics like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 333.464,
    "end": 338.296,
    "text": " Any thoughts on that or does anyone like want to add more pieces to this about attractors or anything?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 342.688,
    "end": 343.349,
    "text": "Yeah, I think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 345.034,
    "end": 347.119,
    "text": "The the attractors become.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 347.909,
    "end": 362.852,
    "text": " like significantly more interesting whenever we move into the next sections with like the luck of Volterra dynamics and the Lorenz system, just like trying to map them to like other phenomena.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 363.272,
    "end": 366.858,
    "text": "Like I really like the bird song example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 367.138,
    "end": 373.528,
    "text": "I guess this is around page 163 where",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 374.487,
    "end": 377.791,
    "text": " we're introduced to the concept of generalized synchrony.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 378.472,
    "end": 393.129,
    "text": "And so the birds are basically like their internal states are starting to synchronize as they're like trading off singing with one another and trying to kind of match or continue the same song, so to speak.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 393.81,
    "end": 397.474,
    "text": "And here we end up with this kind of like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 397.64,
    "end": 420.137,
    "text": " the states are orbiting around in that lower left figure two different i suppose attracting points so it's like the state is like orbiting between the two um but then my my next question is i'm i'm not sure exactly what those two orbits kind of represent if they represent something like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 421.214,
    "end": 443.827,
    "text": " One bird versus another, or if this is like the state that one of the birds as a single agent is like its beliefs are moving around, you know, its own, um, actions or, or beliefs, uh, versus like whenever it's not singing and that's the next thought.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 443.847,
    "end": 444.268,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 445.565,
    "end": 446.487,
    "text": " That's a good question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 447.028,
    "end": 452.938,
    "text": "I mean, again, like progression, how first we have a simple fixed point attractor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 452.978,
    "end": 457.485,
    "text": "So this is not even a moving fixed point, just a set fixed point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 458.227,
    "end": 461.953,
    "text": "Then kind of calling back to chapter five.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 462.288,
    "end": 491.35,
    "text": " there's a descending settable fixed point so that was in the the cross section of the spinal cord where there's the descending motor prediction and then the proprioceptive data coming in and then so it's kind of it's the same exact mechanic as the um set point it's just with the additional piece that the set point is a descending prediction then um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 492.477,
    "end": 500.446,
    "text": " have another bump up in what the attractor can be going to from stable fixed point, moving fixed point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 502.468,
    "end": 509.836,
    "text": "Now this gets into the kind of like winnerless competition or like generalized dynamical, the generalized sequential dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 510.417,
    "end": 512.359,
    "text": "These are like iterative processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 513.42,
    "end": 521.91,
    "text": "And then first there's the, this is kind of like a non-chaotic winnerless competition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 522.565,
    "end": 552.471,
    "text": " with an ecological fluctuation so lockable terror arose from the ecological predator prey modeling which is kind of what is referenced here plant herbivore carnivore but also those have been applied extensively to like activity patterns of brain regions so if you have or gene regulatory networks like if you have multiple components that have um some features such that when they're low they can ramp up but then when they're high they're like self-limiting directly or indirectly then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 553.143,
    "end": 555.347,
    "text": " They go up when they're low, and then they go down when they're high.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 555.447,
    "end": 557.23,
    "text": "And so they stay within like a bounded interval.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 557.791,
    "end": 564.081,
    "text": "But this is still has a kind of a very regular movement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 564.101,
    "end": 571.153,
    "text": "So it's three variables that are linked in a dynamical equation, P, H, and C, in this case, plant interval or carnivore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 571.654,
    "end": 576.282,
    "text": "And then here are like two projections onto a side of the cube.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 577.105,
    "end": 601.594,
    "text": " and then that gets taken into like one more level to go from the non-chaotic dynamical into the deterministic chaos which is just kind of alluded to and explored more in the citation but then that takes us to the turn-taking susan so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 603.177,
    "end": 614.71,
    "text": " So I'm wrestling with the attractor states in complexity science and chaos theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 614.89,
    "end": 621.999,
    "text": "And so I'm kind of wondering if that's the steady state is the bounds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 625.422,
    "end": 627.545,
    "text": "In other words, you're going to move.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 628.606,
    "end": 632.931,
    "text": "It's about how you're calculating the movement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 633.755,
    "end": 635.858,
    "text": " Barbara Kirby- And, although I don't want to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 636.94,
    "end": 640.485,
    "text": "Barbara Kirby- might be better to put this conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 641.246,
    "end": 645.512,
    "text": "Barbara Kirby- In the next after the next chapter, but, but in terms of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 647.135,
    "end": 654.666,
    "text": "Barbara Kirby- You calculating yeah it may be that it's just a different nested model of what is the current state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 656.131,
    "end": 684.315,
    "text": " in other words yeah in other words are is this this state is going to look different if it's if it's over capacity it's out of a state of resilience so i'm assuming that that's actually another nested model you know i don't so i don't want to try to combine the two or am i thinking about it incorrectly yeah it's interesting like explore it for a specific system and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 684.481,
    "end": 712.345,
    "text": " maybe it'll be clear like which aspects of resilience are accommodated in the model like as written like even the fixed point attractor i mean in a sense that's a rudimentary form of resilience because when it's pushed away from the fixed point it comes back to it but there's multiple resilience concepts like one of them being that it returns to where it was before another resilience concept is that it stays where it's adapted to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 712.662,
    "end": 740.678,
    "text": " those are kind of not even compatible definitions of resilience which is like why when you build a specific model then you okay for this variable when we say resilience we're talking about the adaptivity like definition versus like the resistance to change version and then it's sometimes really interesting how even some of the simplest formalisms can capture aspects of those dynamics but then like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 741.856,
    "end": 769.939,
    "text": " you can't use the model to show something outside of the model so this if this is the only one you have you'll be able to have that kind of like first order um fixed point behavior but then it wouldn't be adequate to describe some other kind of behavior like this one this kind of model will never show a moving set point but this model would but it wouldn't show",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 771.117,
    "end": 789.632,
    "text": " chaotic Dynamics but then this one would so hence trying all these different kinds of models and just like in the textbook which is being shown here just showing all these different features okay then from the chaotic to the chaotic with learning so just all of these different",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 790.895,
    "end": 791.476,
    "text": " William Collins, M.D.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 791.456,
    "end": 801.771,
    "text": ": patterns and then it's kind of like well for the phenomena for the system that you're looking at which one of those like levels or types of dynamics feel appropriate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 805.076,
    "end": 805.817,
    "text": "Janet Callahan, Ph.D.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 805.797,
    "end": 817.734,
    "text": ": yeah and then just to put context around this, this is just trying to give us the basics, you know, in other words, not to throw in too much more complexity, I mean once we understand the basics, then we can.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 818.655,
    "end": 819.096,
    "text": "Janet Callahan, Ph.D.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 819.076,
    "end": 819.957,
    "text": ": begin adding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 821.911,
    "end": 823.633,
    "text": " more degrees of complexity, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 829.2,
    "end": 845.64,
    "text": "Thomas Parr in his book stream gave a really good kind of timeline talking about how the earliest implementations were the continuous state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 847.848,
    "end": 872.387,
    "text": " then people started thinking about getting sequential dynamics this is exactly what we just saw with the lock of volterra then people wanted to look into like planning and sequential dynamics with like counterfactuals so then that motivated more of the discrete space discrete state space discrete time models to to get that kind of decision making and planning",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 873.532,
    "end": 892.924,
    "text": " um then there were hierarchical models that were able to nest either discrete or continuous or hybrid models um eventually by being reintroduced introducing the continuous state space as the kind of lower sensory motor",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 893.444,
    "end": 914.49,
    "text": " Matthew Shollin- model and then having like a kind of higher order discrete model and then that was kind of explored in the folks psychology work we have continuous time and state spaces, like for sensory and motor and then you have discrete state spaces and time for more sequential decision making and planning Susan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 918.166,
    "end": 919.708,
    "text": " I think you just answered it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 919.808,
    "end": 927.179,
    "text": "I was wanting a little more definition around discrete space and continuous space, but anything else?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 929.783,
    "end": 930.064,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 931.286,
    "end": 935.652,
    "text": "Discrete state space is where the options are finite and discrete.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 936.577,
    "end": 950.818,
    "text": " like one or two or three or four or 0.1 or 0.2 or 0.3, but discrete clickable values versus the continuous state space is when there's a continuum that's like differentiable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 951.419,
    "end": 955.665,
    "text": "Like at all points, you could put a ruler and determine the slope.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 955.645,
    "end": 956.046,
    "text": " J Lenz, D.B.A.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 956.006,
    "end": 958.271,
    "text": ": Whereas if you only have one, two, three, four.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 959.173,
    "end": 961.078,
    "text": "You can't really like J Lenz, D.B.A.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 961.038,
    "end": 964.226,
    "text": ": take a ruler and find the derivative at each time step like you can't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 964.246,
    "end": 967.714,
    "text": "You can't really have the derivative in the same sense for a staircase.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 967.981,
    "end": 968.883,
    "text": " it's like a step function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 968.903,
    "end": 972.749,
    "text": "So that's true of the continuous and the discrete state spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 974.252,
    "end": 979.461,
    "text": "We could be talking about temperature, like temperature is a continuous variable, temperature is a discrete variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 980.183,
    "end": 988.217,
    "text": "And then one special variable for dynamical modeling is how time is addressed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 988.197,
    "end": 998.818,
    "text": " And so time, as Chapter 7 and 8 explore, time can be explored as a discrete state space, Chapter 7, or time can be explored as a continuous state space like Chapter 8.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 999.419,
    "end": 999.82,
    "text": "Andrew?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1002.946,
    "end": 1008.417,
    "text": "Yeah, just like the way I kind of think about...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1009.51,
    "end": 1017.391,
    "text": " the whole like discrete space model on the higher level of a hierarchical model and then continuous at the lower.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1017.411,
    "end": 1021.562,
    "text": "And I don't know if this stands up to anyone else,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1022.47,
    "end": 1045.339,
    "text": " something like um i'm sitting here i'm trying to figure out if my heartbeat is too fast like yes or no two discrete options i have to like pay attention to my heart rate for some time but of course like i can't just go with a single time step i have to see like you only know the rate by you know taking a second or a few seconds to figure out what the rate is and so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1045.319,
    "end": 1051.949,
    "text": " Robert Alverson, Over you know, however many seconds that I need to measure that which is multiple time steps, or a faster time scale.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1052.25,
    "end": 1056.777,
    "text": "I can then make the discrete decision if it's too fast or not, if that makes any kind of sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1056.797,
    "end": 1061.284,
    "text": "So thus yeah, and that's perfect figure eight point six.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1061.384,
    "end": 1062.906,
    "text": "The",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1062.886,
    "end": 1073.05,
    "text": " Daniel pointed to is like we see how there are multiple time steps in that continuous level at the lower level for every single time step at the higher one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1073.852,
    "end": 1080.388,
    "text": "And so, yeah, I think when thinking about modeling like say an agent and trying to include things like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1080.368,
    "end": 1081.831,
    "text": " Dr. J. Corey Williams, M.D.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1081.73,
    "end": 1096.296,
    "text": ": physiological some signals like heart rate and other things like that there's this kind of faster timescale going on and then the agent at a higher level, maybe a cognitive level or some such thing is making like more discreet decisions or inferences based on what's going on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1098.3,
    "end": 1100.263,
    "text": "Dr. J. Corey Williams, M.D.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1100.243,
    "end": 1100.444,
    "text": ": setting."
  },
  {
    "start": 1100.464,
    "end": 1101.025,
    "text": "Dr. J. Corey Williams, M.D.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1101.005,
    "end": 1101.145,
    "text": ": yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1108.263,
    "end": 1113.97,
    "text": " Anyone else have just any thought or question on eight?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1114.33,
    "end": 1115.712,
    "text": "We can look at some questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1116.032,
    "end": 1117.034,
    "text": "We can continue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1119.056,
    "end": 1121.559,
    "text": "But the chapter's very compact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1123.261,
    "end": 1126.185,
    "text": "It just moves through those sequence of examples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1128.187,
    "end": 1134.895,
    "text": "Fixed point attractor, moving point attractor, dynamical attractor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1135.955,
    "end": 1162.789,
    "text": " chaotic attractor with learning then it just says and you could put that continuous model at the lower level of a discrete time model and here's an example of what that looks like like at the higher level is which location to fixate upon and then the continuous lower levels like the Cicada movements and then there's a few settings where that's been studied and that's the whole chapter George",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1164.457,
    "end": 1173.589,
    "text": " I have a little question about the small question about this bird system with the chaotic attractors.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1174.193,
    "end": 1201.686,
    "text": " uh chaotic behavior so if i remember right then chaotic behavior uh the by definition it means that you can't that you only have a limited horizon where you can predict what is going to happen still these birds seem to be able to synchronize and is it if i look at figure 8.5 does it mean that they",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1202.425,
    "end": 1228.618,
    "text": " do not synchronize their down to the right that they even after learning they don't synchronize perfectly they sometimes lose each other but then they uh but they stay quite close like they're because if you can't predict what is going to happen you probably can never because you don't know the initial conditions you know you never know exactly where the other",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1229.341,
    "end": 1231.847,
    "text": " the other individual is, I guess.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1231.988,
    "end": 1233.612,
    "text": "But is that correct?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1233.692,
    "end": 1236.199,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1237.282,
    "end": 1244.059,
    "text": "So one thing to note, as I think it'll probably say,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1245.254,
    "end": 1267.836,
    "text": " singing from the same hymn sheet so just to be clear this model has presented it's not like this is like a generalized model of semantic communication and term taking in conversation this is like two birds with a fixed innate song that they can kind of in the second part of it do some local tweaking but in the first part they can't at all",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1268.305,
    "end": 1271.27,
    "text": " But they have the same song template.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1271.871,
    "end": 1277.622,
    "text": "So they're not engaging in more open-ended semantic transmission.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1277.662,
    "end": 1281.549,
    "text": "It's kind of like a chant that's supposed to be ongoing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1282.29,
    "end": 1290.465,
    "text": "And so the only options that they have are either listen and understand that the other one is singing it or notice that that has stopped",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1290.445,
    "end": 1309.973,
    "text": " and then take action to to bring that song like back into play that's kind of like the situation that the bird song is modeling um but then they show like in the paper that when you have one bird with a precise song and one with a very like imprecise song",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1310.155,
    "end": 1336.23,
    "text": " that that the like that younger imprecise one can like learn and converge to the the other song then you can kind of fix that bird's precision and bring in a new plastic one and then converge that one to it and so that got into like the kind of intergenerational transfer again of like a templated song with a little bit of drift but yeah what's happening here is like between bouts of singing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1336.48,
    "end": 1363.753,
    "text": " there's this kind of tightening of the joint dynamics so this could be like if this was like two people and they're pointing at each other pointing and they're trying to they're doing an improv game where they're like trying to keep their fingers as close to each other as possible um so um if it the movements were perfectly correlated then they would be on like a one-to-one line",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1364.932,
    "end": 1369.196,
    "text": " like the X value of one would be matched exact, tracked perfectly by the X value of the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1369.596,
    "end": 1377.684,
    "text": "And then if they were totally uncorrelated, it'd be like a perfect circle, which is to say as wide as it is tall.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1378.244,
    "end": 1380.206,
    "text": "So like the correlation would be zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1380.266,
    "end": 1383.629,
    "text": "There wouldn't be a significant regression through that cloud of points.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1384.81,
    "end": 1392.137,
    "text": "So they start in the same ballpark because they have a template and then there's some fine tuning,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1392.893,
    "end": 1403.325,
    "text": " in the learning process so that their expectations tighten up it's like and then the turn taking part and then so then about the chaos",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1404.52,
    "end": 1430.292,
    "text": " predictability so that's where the um lyopinib exponent comes into play which is kind of like this variable that describes how chaotic a system is ranging from a system that's not chaotic and the kind of metaphor there is like a laminar flow so you have two planks of wood on a laminar parallel flowing river those two planks will stay near each other at the same distance",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1430.373,
    "end": 1454.878,
    "text": " then there's other rivers where um planks that are placed near each other converge and then there's systems where planks that are near each other diverge and that's chaotic because you can't necessarily know it's like you're coming in on this one and then if you come in just on this side you take another attractor to the right but if you came in a little bit more left then it spins out",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1455.702,
    "end": 1469.34,
    "text": " And so then, as that exponent gets more and more chaotic, it gets harder and harder to predict points, trajectories of points that start initially next to each other, so the horizon of predictability drops.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1469.54,
    "end": 1497.775,
    "text": " and so this is kind of like it's like this one is saying like we're on we're on the right side of the turn taking and then it's like the precision is dropping and that's kind of spiraling it out and then eventually it spirals out and then it flips to the other attractor spins in spins out and then eventually it flips out there just showing that those kinds of of switching time Dynamics can be modeled even with deterministic equations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1499.189,
    "end": 1503.176,
    "text": " So there aren't even like, this isn't necessarily even stochastic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1504.719,
    "end": 1524.353,
    "text": "This is just the deterministic chaos, which was kind of like, what's one of the most interesting and exciting parts from complexity theory and chaos is like single pendulum is deterministic and non-chaotic, but then the double pendulum is deterministic still, because it's just two single pendulum, but then it has the chaotic dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1527.387,
    "end": 1541.066,
    "text": " Daniel Passamaneck- Also connected to wall from some computational irreducibility and about how like there's things where, even if they're deterministic that it still can't be determined, like if the program is going to do a certain thing or finish at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1552.382,
    "end": 1553.023,
    "text": "Daniel Passamaneck- yeah Susan.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1556.412,
    "end": 1568.968,
    "text": " Karen Hollweg, So I guess that would have a lot to do with the policy selection and is policy selection with that would that be the same as you know what model, you chose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1571.171,
    "end": 1572.873,
    "text": "Karen Hollweg, To.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1572.893,
    "end": 1574.495,
    "text": "Karen Hollweg, To.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1574.515,
    "end": 1575.957,
    "text": "Karen Hollweg, assess the situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1578.518,
    "end": 1591.775,
    "text": " Yeah, like the singing behavior, just on the first level, the singing behavior can be understood as the policy, the motor policy of the bird, whether it sings or not, like in that binary system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1592.916,
    "end": 1602.869,
    "text": "But then a little bit more cognitively, the choice of which framework to apply or which interpretation to apply is like a mental policy decision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1604.932,
    "end": 1607.395,
    "text": "So where would affordances come in?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1612.15,
    "end": 1614.013,
    "text": " That's a good question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1614.273,
    "end": 1622.847,
    "text": "In the OFT reference, Livestream 28, with Lars Sanved-Smith.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1625.171,
    "end": 1628.296,
    "text": "So this is kind of a different, this is another step-by-step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1629.097,
    "end": 1630.619,
    "text": "So here's static perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1631.681,
    "end": 1636.048,
    "text": "Hidden state, sensory ambiguity to the observations indeed prior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1637.716,
    "end": 1643.702,
    "text": " Now, in the textbook, they went from that kind of static perception and then went into the dynamic perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1644.964,
    "end": 1667.368,
    "text": "But here, there's kind of this intervening step with a precision variable on A. So this is like changing the temperature or the precision on A, which is to say from sharpening it so that it looks more like just ones and zeros, and there's a less ambiguous mapping between hidden states and observations,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1667.602,
    "end": 1677.271,
    "text": " All the way in the low precision extreme a is just kind of like blurred out so that observations have no information on hidden state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1678.573,
    "end": 1682.396,
    "text": "So they're going the attention as precision here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1683.878,
    "end": 1695.229,
    "text": "So now we have kind of the discrete time figure 4.3 figure 8.3, whatever it happens to be with these little precision guys on the bottom, but otherwise it's the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1696.677,
    "end": 1702.374,
    "text": " And then let's say that this blue is the sensory motor layer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1703.096,
    "end": 1709.877,
    "text": "So that could be the spinal cross section, or that could be the kind of gross motor behavior, like singing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1711.173,
    "end": 1718.262,
    "text": " Here's where the mental action or the internal affordances, the covert action is coming into play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1719.003,
    "end": 1727.855,
    "text": "Where that affordances in that nested level are modeled as basically shifting the precision on the lower level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1729.838,
    "end": 1735.225,
    "text": "And then they had a third level of policy about that second level policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1735.846,
    "end": 1740.572,
    "text": "But everything past the blue sensory motor layer are just higher mental affordances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1742.881,
    "end": 1744.003,
    "text": " Oh, very cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1745.946,
    "end": 1762.611,
    "text": "Yeah, that was kind of a big moment when the same or similar kind of formalism that was used for sensory motor control and affordances externally got brought in to this kind of internal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1763.165,
    "end": 1786.084,
    "text": " attention as action setting by by Lars and and the others in 2021 and then they still like even in the previous days continue to like make this more comprehensive and like just bringing in more pieces and bringing in like world knowledge traditions in really interesting ways too mm-hmm",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1788.545,
    "end": 1793.834,
    "text": " Gareth J. Thank you yeah industry time I don't know if there's any continuous time versions of this, but that would be cool to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1793.894,
    "end": 1796.479,
    "text": "Gareth J. yeah Christoph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1798.021,
    "end": 1802.73,
    "text": "Christoph Strobeli- yeah just want to make a comment that I think it's interesting that this formalism can actually describe both.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1802.95,
    "end": 1809.962,
    "text": "Christoph Strobeli- You know, continuous time models and discrete models, because as we as we move in the hierarchy of concepts, then.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1810.398,
    "end": 1825.239,
    "text": " we finally arrive at things that are discrete, but discrete phenomena in some sense are not, you know, there's always this sort of problem, of course, graining from underlying processes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1825.299,
    "end": 1828.423,
    "text": "So there's the generative process that gives rise to the phenomena.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1828.504,
    "end": 1834.792,
    "text": "We are sampling that in some way and we're computationally bound, so we can't have perfect model of the other system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1834.832,
    "end": 1835.654,
    "text": "So we have to sample.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1835.714,
    "end": 1838.818,
    "text": "So that gives rise to some kind of discretization of,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1839.085,
    "end": 1840.247,
    "text": " of the phenomena.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1840.888,
    "end": 1856.318,
    "text": "And temperature, I think it's an interesting example where we can model it as a continuous variable, but it's not actually useful to our... For us, temperature always has some kind of discretization because we don't care about, I don't know, six, seven, eight decimal places.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1856.298,
    "end": 1856.619,
    "text": " Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1857.139,
    "end": 1864.973,
    "text": "So the fact that you can build this hierarchy and this discretization just kind of naturally fits on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1864.993,
    "end": 1866.636,
    "text": "You can fit it on top of continuous models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1867.057,
    "end": 1881.242,
    "text": "It's actually very reassuring that this is a this is a really good paradigm that these two things can be connected kind of directly without without bringing in some some other theory to to say how these how these systems would interact.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1881.796,
    "end": 1885.723,
    "text": " because that's just kind of what naturally happens in more complex systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1885.823,
    "end": 1890.632,
    "text": "At the top level, things do look more and more binary when the decision making is made.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1890.952,
    "end": 1892.094,
    "text": "Do I go left or right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1893.637,
    "end": 1895.3,
    "text": "In the real world, there is no really left or right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1895.32,
    "end": 1902.433,
    "text": "There's some kind of sense of direction, but at my mental level, that might be a binary choice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1905.879,
    "end": 1906.42,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1907.328,
    "end": 1908.131,
    "text": " Very interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1908.151,
    "end": 1908.553,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1909.436,
    "end": 1915.178,
    "text": "Your hand was still raised on my computer, but Prakash, did you raise your hand?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1915.63,
    "end": 1920.175,
    "text": " Yes, actually, Christoph actually said what I was trying to say.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1920.195,
    "end": 1932.97,
    "text": "I was thinking any kind of complex system will have a lot of continuous items in the downstream, but as you go up, there's a decision-making happening and finally it's more binary.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1933.871,
    "end": 1937.976,
    "text": "The key learning which I'm getting over here is that",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1937.956,
    "end": 1965.094,
    "text": " uh like there are various possibilities in which you can mix and match this kind of systems that you want to have but there is a possibility in which you can there's a flow and we can use that for our own purposes yeah that's very interesting another kind of topic to connect this to like non-active um psychophysics is the just noticeable difference concept",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1965.428,
    "end": 1971.895,
    "text": " So it's like the classic examples like we have two objects that are going to get put in one in each of our hands.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1972.456,
    "end": 1974.558,
    "text": "And then the task is which one is heavier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1975.279,
    "end": 1978.943,
    "text": "So the objects have a continuous value in reality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1978.983,
    "end": 1987.753,
    "text": "Or you can think of it as your muscles are exerting a continuous amount of tension to propriocept and like evaluate the mass of the object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1988.454,
    "end": 1990.997,
    "text": "But it's a binary decision which one is heavier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1991.416,
    "end": 2017.626,
    "text": " um so if the stimuli are exactly matched like if they're the same weight but there's no option for the same weight you have to say which one you think is heavier but you'd expect that 50 of the time like that it would be guessed which one is heavier and then it turns out that there's like this kind of sigmoidal curve where there's a high sensitivity when things are very close to each other",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2018.315,
    "end": 2033.337,
    "text": " to differentiate them but then if if it's like five pounds versus 15 pounds changing the 15 to a 16 it's not like it increases the decision-making accuracy by 10 because it's already at like 99.9 percent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2034.177,
    "end": 2050.566,
    "text": " Gareth J. So that's kind of an interesting thing is like connecting this the stimuli intensity to like potentially the binary eyes decision making sigmoidal describe decision making around that just noticeable difference on point Christoph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2052.031,
    "end": 2059.461,
    "text": " Yeah, there's also very interesting research on that subject called quantum qualia.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2059.541,
    "end": 2065.73,
    "text": "They're essentially testing a hypothesis that the quality of experience depends on the history of experience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2065.87,
    "end": 2076.064,
    "text": "So it's not that when you perform this kind of experiment, say, asking people which colors are more similar and more different,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2076.297,
    "end": 2087.073,
    "text": " Mateusz Piorkowski- Depending on what the sequence of colors is that they've seen already their responses are likely to be different, so there are some people trying to test theories that essentially bring in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2087.814,
    "end": 2101.495,
    "text": "Mateusz Piorkowski- You know some kind of mathematics that the kind of mathematics that's previously been used in quantum theory to model model phenomena, almost like a evolution of a you know quantum wave function, so that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2101.812,
    "end": 2106.778,
    "text": " when you're performing an experiment, it really matters what your context was.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2107.459,
    "end": 2110.823,
    "text": "And there's some really interesting results in that space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2110.843,
    "end": 2124.16,
    "text": "So there might be, you know, it might be that there's sort of like a reset time that's required, but it might be that simply that we really perceive deltas and that's what really matters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2124.18,
    "end": 2131.009,
    "text": "So if you give someone two very heavy things and then ask them to compare two light things, their brain might be used to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2131.242,
    "end": 2141.235,
    "text": " Gareth J. feeling the feeling of something being heavy and not having enough precision not resetting and i'm not having the precision to perceive the difference between the lighter things so it's really, really interesting how.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2142.176,
    "end": 2143.418,
    "text": "Gareth J. How that works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2146.081,
    "end": 2146.421,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2148.184,
    "end": 2148.464,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2149.926,
    "end": 2153.25,
    "text": "And definitely like about detecting change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2154.901,
    "end": 2178.934,
    "text": " like the eye is expecting a certain intensity of light and then it's brighter than expected that induces like a dilation or a constriction however it goes and then that recalibrates to a new expected set point and then from there again it's just about the direction of like whether this is less or more that's kind of the predictive processing paradigm",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2179.319,
    "end": 2183.844,
    "text": " which is like, you don't have to always be carrying through like the temperature of the room.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2183.904,
    "end": 2194.836,
    "text": "If it just happened to be that your implicit set point was room temperature, and then you had that fixed point attractor, all you'd have to carry through would be like plus or minus within, within reason.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2194.896,
    "end": 2205.208,
    "text": "And it wouldn't need to be like 72.04 and do some sort of computation and then store that, you know, you just have a binary decision about which is action dependent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2205.847,
    "end": 2213.602,
    "text": " Yeah, so it seems to be that the bias seems, we always continuously adjust the bias to really see just the differences that make the difference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2214.042,
    "end": 2218.471,
    "text": "And I think there's a really fantastic example of this from antiquity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2218.531,
    "end": 2227.568,
    "text": "One of the Greek philosophers, I forgot what it was, but he was staring at the river and seeing people just trying to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2228.054,
    "end": 2231.437,
    "text": " I think rescue some animal that just went into the river and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2231.738,
    "end": 2235.602,
    "text": "And then he looked at the ground after and he saw the ground flowing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2236.122,
    "end": 2248.515,
    "text": "So even if it's not like a physical phenomenon, like expansion of the veins to pump more blood or whatever, even just at the level of the brain, there is some kind of processing that you can very easily see yourself if you do it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2248.535,
    "end": 2253.96,
    "text": "If you look at something that flows like a water flowing downwards on a TV and you look at the wall, you will see the wall flowing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2253.94,
    "end": 2261.632,
    "text": " because the brain adjusts to that flow so that you could pick up the differences within the flow, not the flow itself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2261.732,
    "end": 2262.934,
    "text": "You just become oblivious to it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2263.675,
    "end": 2269.064,
    "text": "I wonder, is there any work in active inference that will try to model something like this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2269.084,
    "end": 2270.987,
    "text": "Because that seems like a really interesting project.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2272.773,
    "end": 2274.318,
    "text": " I don't know specifically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2274.338,
    "end": 2284.453,
    "text": "It reminds me though also of like going on a long walk or hiking and looking at the ground a lot and then stopping and then looking far away and they're kind of like being like zooming.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2285.159,
    "end": 2309.26,
    "text": " because there was even like a calibration to the um the amount of visual flow or just like an expectation that like objects come closer or go further or something like that and like um another fun example like the Exploratorium in San Francisco it's like fun like hands-on science it was like a pipe that had a colder a hotter and a room temperature component",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2309.527,
    "end": 2331.619,
    "text": " and then you put like one hand on the colder and the hotter part not burning or freezing but just noticeably and then you put both on the same section and then like one of the hands fell the one that had been on the hot fell it was cold and vice versa but of course you're looking at it and your hands are on the same piece of metal but each hand was only able to kind of like report",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2331.97,
    "end": 2335.715,
    "text": " that it was getting contrasting opinions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2336.276,
    "end": 2341.002,
    "text": "So it felt like as if you had flipped the hands, but they were both on the same temperature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2344.666,
    "end": 2352.797,
    "text": "And after images, visually, some of these phenomena are more at the cellular level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2353.182,
    "end": 2381.417,
    "text": " like some visual after images and effects those are like it's like some you know retinal cells are exhausted and then like they so it's like that phenomena I mean inquiry finds that that phenomena can be explained by cell level findings whereas something else like a ballerina that rotates or a cube that's collapsed one way or the other like those are not going to arise at the level of like the single retinal firing rate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2382.815,
    "end": 2398.26,
    "text": " but they might arise at some attentional level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2398.28,
    "end": 2398.581,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2401.405,
    "end": 2404.791,
    "text": "Andrew or anyone, what is this quote?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2406.914,
    "end": 2409.278,
    "text": "What does the quote mean or how does it start off the chapter?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2410.928,
    "end": 2414.879,
    "text": " I just threw that in there in reference to what Christoph was referencing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2415.22,
    "end": 2419.993,
    "text": "I'm not sure if it's Heraclitus who saw the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2420.513,
    "end": 2431.367,
    "text": " yeah so the animals go into a river, but I know that this is a famous quote referencing like yeah there's another line like no one steps in the same river twice like you're you're observing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2432.449,
    "end": 2449.812,
    "text": "Like you're observing behavior and so everything is continuous but I don't want to pull us too far away from from the chapter with just saying that, but I mean I clearly to me it seems to just be representing like continuous dynamics right continuous change over time so.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2451.04,
    "end": 2477.858,
    "text": " yeah totally prakash now i was just uh trying to say a little bit about the code i think like uh as far as i remember it's like you cannot step on the same river twice because uh after a moment the river has changed you know like it is not the same river it's like the concept like works like it's like everything is changing and it is not the same so yeah",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2479.677,
    "end": 2506.95,
    "text": " just just to find it yeah like so when there's like a rock in the river and then there's like a flow over it but then the flow is kind of like kept at a certain like there's a stable point for the flow that's kind of like non-equilibrium steady state because there's still some past passing through a material dissipation of a gradient but then if you were just studying like the elevation of the river at that point it would be a stable or it would have like a little Ebbing around a small point",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2514.136,
    "end": 2524.476,
    "text": " Just on the kind of like practical note, PyMDP, the main Python package for active inference generative models is discrete time only.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2524.516,
    "end": 2528.584,
    "text": "Hence, the PyMDP tutorials are like all discrete time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2529.998,
    "end": 2545.294,
    "text": " Whereas Sanjeev's work in Python accommodates continuous time models as do the MATLAB earlier SPM work and Rx and Fur and Julia.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2546.616,
    "end": 2550.56,
    "text": "But maybe someone has brought some continuous time models in the PyMDP.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2550.6,
    "end": 2559.87,
    "text": "I just don't think it's on like the main branch or I'm not sure if it's on any branch, but it's definitely in Sanjeev's code SPM and in Rx and Fur.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2564.153,
    "end": 2580.874,
    "text": " The papers that are cited, like at the ends, we can double check, but just looking at the authorship and the years, these papers are probably almost all in MATLAB.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2583.196,
    "end": 2586.821,
    "text": "We can double check them, but very probably.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2589.664,
    "end": 2592.608,
    "text": "Continuous time Python, Prakash.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2594.68,
    "end": 2597.904,
    "text": " Ask Sanjeev, just in Discord, just tag Sanjeev.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2599.687,
    "end": 2601.509,
    "text": "Is this, wait, Andrew, is that a continuous time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2601.549,
    "end": 2609.32,
    "text": "Well, I just sent for the general documentation, but yeah, I mean, all the examples are there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2610.681,
    "end": 2612.123,
    "text": "Yeah, yeah, this one's a discrete time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2612.163,
    "end": 2614.366,
    "text": "Discrete time and discrete state spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2618.372,
    "end": 2620.114,
    "text": "Actually, the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2621.225,
    "end": 2625.769,
    "text": " This one has discrete and continuous state spaces, but it is all in discrete time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2627.311,
    "end": 2637.2,
    "text": "But if you in Discord maybe ask Sanjeev and or like tag Magnus Kudal and Sanjeev and you'll get two good answers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2638.181,
    "end": 2638.782,
    "text": "Okay, thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2639.142,
    "end": 2639.482,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2640.583,
    "end": 2640.864,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2643.086,
    "end": 2650.573,
    "text": "Or like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2651.887,
    "end": 2656.273,
    "text": " This could be fun collaborative annotating for whoever wants to do so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2656.333,
    "end": 2678.704,
    "text": "With all of these examples and more that we can find, we could annotate time, discrete, continuous, either, or hierarchical, and then understand which one of the code examples, as we also continue to add them,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2679.933,
    "end": 2702.346,
    "text": " has these different features if anyone wants to explore that we can definitely do that but right now just like the links but but maybe look through them and see which um which ones have which features yeah christoph",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2703.693,
    "end": 2720.564,
    "text": " Mateusz Piorkowski- yeah I just I just checked my sources and the story I was referring to was about Aristotle so apparently he saw a horse stuck in a flowing river and he fixedly watched the rescue operation and he finally looked away and everything else appeared to flow, so he was it was the first.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2720.925,
    "end": 2724.672,
    "text": "Mateusz Piorkowski- recorded visual illusion in history.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2729.09,
    "end": 2748.634,
    "text": " horses kind of play a key role in the visual perception because like the first high-speed photograph was about the debate whether the horses pick up all of their feet when they run and then like they took a photo and it was resolved like yes when they sprint all four of the feet are off the ground but that was it was not known until that happened",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2749.694,
    "end": 2757.724,
    "text": " Well, you know, in the first Polish encyclopedia written in the Polish language, there was a very interesting note about the horse.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2758.125,
    "end": 2759.927,
    "text": "It just simply said horse.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2760.368,
    "end": 2762.07,
    "text": "Well, the horse is everybody can see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2762.13,
    "end": 2766.376,
    "text": "Don't ask if you don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2768.038,
    "end": 2771.602,
    "text": "But, you know, it tells you something about the, you know, about the times.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2776.769,
    "end": 2777.49,
    "text": "Definitely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2780.525,
    "end": 2810.143,
    "text": " there's been a lot of recent work on the time perception and the flow of time like Darius and and others and some upcoming live streams too have kind of explored that that's definitely a challenging topic because it's dealing with something experiential but people are pursuing it um whereas these examples like the eye movement that's more empirical um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2810.41,
    "end": 2815.663,
    "text": " arguably this is information like pupil arousal and isocating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2815.703,
    "end": 2821.618,
    "text": "This is information that potentially every smartphone and webcam collects all the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2834.93,
    "end": 2855.47,
    "text": " I think this is one of the interesting differences between machine and human or machine and biological vision is that in biological creatures, we do have these mechanisms of adjusting precision, adjusting resolution of picking up salient features, whereas machine usually",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2855.686,
    "end": 2862.463,
    "text": " And we have another sort of at the low level, at the level of the eye that a lot of this processing happens.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2862.483,
    "end": 2870.843,
    "text": "Whereas in machine, you just get a big array of pixels and the neural network is supposed to figure it out on its own.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2871.481,
    "end": 2881.719,
    "text": " Radek Machan- From that input and you know i've been wondering for quite a long time, whether you know things think things are the way they are, for reasons, and we may not understand reasons.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2882.28,
    "end": 2893.32,
    "text": "Radek Machan- Why things are the way they are, but evolution is not it's not stupid it produces things for for really for really good reasons, so I think that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2893.52,
    "end": 2906.091,
    "text": " it might be that the fact that we have to saccade to really look at something, that we have all these limitations, that actually, in my view, leads to more robust representations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2906.971,
    "end": 2923.105,
    "text": "I don't know how to test this hypothesis in a digital neural network yet, but it strikes me as highly implausible that this limitation is necessary to build robust representations, because robust representations would be the only thing that survives this kind of sampling process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2924.452,
    "end": 2926.976,
    "text": " If you get too much detail, you just get too much.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2927.957,
    "end": 2931.642,
    "text": "It's harder to extract information, say, like information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2933.885,
    "end": 2941.676,
    "text": "That's very interesting whether there's like more fundamental like computational limitations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2941.716,
    "end": 2942.658,
    "text": "That's highly possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2942.738,
    "end": 2945.802,
    "text": "But like just when it comes down to the fovea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2945.849,
    "end": 2975.755,
    "text": " the center high resolution area on the eye it's like there are trade-offs just with the density and the energy costs of having high resolution in the center of the eye and so like here's a visual Cicade model and then it's possible for this like eye Cicade um agents to to differentiate these different um visual patterns like is it just line is it like parallel lines with this diagonal thing or you know",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2976.157,
    "end": 2979.689,
    "text": " vertical lines, those can be quickly differentiated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2979.729,
    "end": 2984.766,
    "text": "Like, am I looking at a Dorian or Ionian pillar that could be differentiated with like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2985.488,
    "end": 3008.408,
    "text": " one to three skillful isocades it's like am i reading a scientific paper it's like well is the lcaver logo in the top left no okay cicade over here is there something there no okay last check okay it's not a paper that's whereas if um this were going to be taken into like a sort of classical machine learning pipeline then let's just say this is like 20 by 20",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3009.907,
    "end": 3039.12,
    "text": " that's 400 pixels coming in so you need like at the very least the memory capacity for like that many pixels to be coming in versus only nine pixels with a three by three high resolution and then that's like the kind of truth drop on our visual experience being the generated not the processed like no blind spot color in the periphery resolution in the periphery suppression of the skates like all those features",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3040.872,
    "end": 3058.24,
    "text": " are the information that does like give evidence in the moment to moment that we're experiencing what we generate visually and then probably by extension other senses too not like taking in a whole scene and then distilling the scene",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3058.709,
    "end": 3081.747,
    "text": " but having an underlying generative model of the picture even if it's our first time seeing that specific one and then doing isocating to fill in the detail and then doing um all kinds of other cognitive phenomena like attentional modulation and kind of like instantaneous overriding to just like make it normal make it feel normal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3088.19,
    "end": 3101.625,
    "text": " yeah this this is uh I guess this will be in one month but this has to do with the time perception affect temporality intention",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3114.802,
    "end": 3120.512,
    "text": " Michael Mann- retained past the sedimented retained embodied trace.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3122.936,
    "end": 3124.118,
    "text": "Michael Mann- And then the.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3124.719,
    "end": 3129.287,
    "text": "Michael Mann- unfolding kind of time cone counterfactual possibility.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3129.308,
    "end": 3134.717,
    "text": "Michael Mann- prospective potential space kind of just blurring off.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3144.147,
    "end": 3147.032,
    "text": " In the last minutes, any other thoughts on 8?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3153.101,
    "end": 3155.445,
    "text": "Otherwise, yeah, it goes fast, basically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3155.465,
    "end": 3156.066,
    "text": "That's 8.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3156.987,
    "end": 3163.337,
    "text": "Then next week, earlier, for cohort 5, we'll continue to talk about 8.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3163.587,
    "end": 3164.208,
    "text": " James Heiting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3164.228,
    "end": 3178.43,
    "text": "Maybe um, Andrew, if you want to before then, um, or anyone else like maybe we could look at one of the papers in more detail, like the ice arcade paper with Thomas Parr, just because I mean we've kind of covered the chapter James Heiting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3178.45,
    "end": 3183.317,
    "text": "in these conversations, and we can look at the bird song or or um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3183.989,
    "end": 3209.642,
    "text": " some other work with uh that's side of the chapter then chapter nine that gets into the empirical data basically up until this point um all the discussion on building a generative model discrete time and continuous time has been like building it by Fiat and then simulating or making synthetic data but then if you want to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3210.28,
    "end": 3221.318,
    "text": " Christopher Lustrii, run it in the other direction and take in empirical data and then parameterize your model for like determining within or between group differences or doing any other kind of testing like that's where chapter nine comes into play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3222.1,
    "end": 3224.403,
    "text": "Christopher Lustrii, And then chapter ten just summarizes it up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3226.647,
    "end": 3231.495,
    "text": "Christopher Lustrii, So it's so funny the books like an accordion like sometimes it seems like there's a ton.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3232.454,
    "end": 3262.461,
    "text": " Thomas Greene, Other times it's just like barely it just like just quickly like flipping through index cards of all these different models, because there's so much detail to go into with with even the simpler models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3262.93,
    "end": 3276.477,
    "text": " We've talked about the time parameters, and I'm trying to envision how do you set the spatial parameters?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3276.718,
    "end": 3278.762,
    "text": "That's what Nan's going to cover?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3280.868,
    "end": 3282.17,
    "text": " Good question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3282.47,
    "end": 3288.798,
    "text": "Parameters could refer to spatial or temporal or like cognitive, any kind of parameter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3288.818,
    "end": 3304.277,
    "text": "But if we're going to be talking about data coming from a spatialized system, like a room that has sensors in locations, then part of making a model to deal with that data would be how do we incorporate the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3310.535,
    "end": 3320.328,
    "text": " So if our data have a spatial component, I mean, if we don't take that into account, at the very least, we've left important information out about our system that we know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3322.371,
    "end": 3329.902,
    "text": "Worst case scenario, we've come to a misleading conclusion because we just kind of like averaged out all the sensors, but they were in different locations on the roof.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3331.123,
    "end": 3333.487,
    "text": "So then there's like a really, you know, the roof is like a triangle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3333.727,
    "end": 3338.854,
    "text": "And then it was like, there's a temperature pattern that makes sense when you know that some are on one side and some are on another side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3342.614,
    "end": 3344.096,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3344.116,
    "end": 3352.826,
    "text": "The reason why time gets like such a special treatment, whereas like space, we could model it continuously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3353.166,
    "end": 3363.978,
    "text": "Like we could have a continuous GPS coordinate with just like as many levels of precision as we wanted, or we could discretize GPS and just say, okay, we're only going to like the first decimal point and then it's a grid.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3364.839,
    "end": 3372.368,
    "text": "So the reason why that's less of a big deal is that the, the time concept",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3374.423,
    "end": 3401.612,
    "text": " gets taken into account every single time we iterate the model forward so how the model changes in time is like obviously one of the key aspects it is what makes it dynamical so that's just a huge decision that's why like in chapter six one of the big decisions that's brought up is like how is like should it be handled",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3405.997,
    "end": 3408.04,
    "text": " should it be discrete or continuous?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3410.883,
    "end": 3412.546,
    "text": "Because it's a huge difference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3414.969,
    "end": 3423.84,
    "text": "Whereas it's a smaller difference if we have like temperature as a continuous or a discrete value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3424.922,
    "end": 3432.612,
    "text": "Temperature could be modeled continuous or discrete, whether we were thinking about time discrete or continuous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3433.385,
    "end": 3447.521,
    "text": " So it's kind of like, even just with a thermometer in the room, like no action, no, nothing like this, you have a two by two discrete temperature, discrete time, continuous temperature, continuous time off diagonals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3449.924,
    "end": 3458.413,
    "text": "Like, and it's kind of like simple examples like that, that give good grounding as to why multiple models are constructed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3460.672,
    "end": 3467.628,
    "text": " Because even if it was just an air conditioner in a room, you'd have at least those four models, at least in principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3472.259,
    "end": 3479.676,
    "text": "And then you could explore like which ones have different, which ones explain different proportions of the variance of the data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3481.343,
    "end": 3483.205,
    "text": " Which ones have different computational resources?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3483.366,
    "end": 3483.606,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3483.646,
    "end": 3486.87,
    "text": "Well, this one's more accurate, but it's more computational resources.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3487.731,
    "end": 3488.052,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3488.092,
    "end": 3493.018,
    "text": "We'll run that on the special one or we'll run the cheaper analysis first.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3493.038,
    "end": 3498.785,
    "text": "And then if we need to, we'll rerun it for the final version with the more expensive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3498.806,
    "end": 3499.687,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3499.707,
    "end": 3504.833,
    "text": "Those are just like practical considerations that come into play when you're working with real data and systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3508.238,
    "end": 3508.498,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3509.761,
    "end": 3510.192,
    "text": " Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3510.294,
    "end": 3511.402,
    "text": "See you all next time.",
    "speaker": "SPEAKER_01"
  }
]