[
  {
    "start": 4.047,
    "end": 4.387,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4.808,
    "end": 5.429,
    "text": "Hello, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5.569,
    "end": 11.655,
    "text": "This is the first meeting of cohort five of the textbook group on September 19th, 2023.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 13.117,
    "end": 18.683,
    "text": "And thanks everybody for saying hi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 19.163,
    "end": 30.696,
    "text": "I will share my screen and we will be looking at the cohort five live meeting page.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.228,
    "end": 38.855,
    "text": " So this is kind of like the starting place for participating or joining cohort five.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 39.616,
    "end": 50.188,
    "text": "You can always click on somebody's icon on the top right of CODA and jump to the exact page they're at if it's not clear from looking at the sidebar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 51.109,
    "end": 53.091,
    "text": "So here we are in the first meeting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 53.511,
    "end": 61.56,
    "text": "And after today, the recording will be here, just like in cohort four, there's recorded videos.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 64.24,
    "end": 86.63,
    "text": " So I guess there's many places to begin, but is there any question that anybody wants to ask about any aspect of the textbook group?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 86.65,
    "end": 92.998,
    "text": "How do we even start and evolve it each time and, and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 94.919,
    "end": 104.349,
    "text": " make it fit for everybody who's doing this on their own time and who's coming at it from different angles?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 107.473,
    "end": 110.216,
    "text": "Varun and anyone else, you can raise your hand or however.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 111.397,
    "end": 113.039,
    "text": "Well, just a quick question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 113.059,
    "end": 122.85,
    "text": "Does the textbook include going through some of those extra notebooks on like active inference coding, like accurate from scratch?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 123.202,
    "end": 126.346,
    "text": " or some of the programmatic implementations?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 127.267,
    "end": 129.11,
    "text": "Or does this mainly stay only on the theory?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 130.972,
    "end": 132.434,
    "text": "Good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 137.0,
    "end": 142.247,
    "text": "The textbook itself, all of the code is in MATLAB.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 142.908,
    "end": 144.67,
    "text": "It's in Appendix C.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 145.375,
    "end": 151.143,
    "text": " And it is not a major part of the textbook itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 151.444,
    "end": 159.475,
    "text": "However, in the textbook group, people are bringing resources and other references.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 160.376,
    "end": 168.868,
    "text": "In the page called code, you'll find several dozen implementations of active inference code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 169.895,
    "end": 188.435,
    "text": " And we can certainly arrange sessions like just us informally or trying to have the authors or other experts join to look over some code features if people are interested in this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 190.117,
    "end": 195.463,
    "text": "But it's not a necessary or central part of the textbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 196.237,
    "end": 208.153,
    "text": " However, because the second half of the textbook is oriented towards application, especially, then talking about how you go from like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 208.943,
    "end": 216.991,
    "text": " a sketch of a system of interest and then use the recipe in chapter six towards actually designing the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 217.051,
    "end": 225.659,
    "text": "So for people who are ready and wanting to actually be working in code, then it's there and we can work on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 226.64,
    "end": 227.941,
    "text": "Esmail?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 229.663,
    "end": 232.246,
    "text": "Yeah, I ask question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 232.266,
    "end": 236.79,
    "text": "I want to know clearly about one",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 237.378,
    "end": 243.445,
    "text": " very important term, surprise, and relationship with free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 244.526,
    "end": 248.43,
    "text": "That can help me for good understanding this textbook.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 248.651,
    "end": 251.153,
    "text": "I think these two terms are so important.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 253.836,
    "end": 254.337,
    "text": "Surprise?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 256.88,
    "end": 258.301,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 258.322,
    "end": 264.128,
    "text": "Yes, great question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 265.34,
    "end": 290.166,
    "text": " many questions will arise um about all kinds of terms and about relationships so here's just one way that that this can be approached so I went to the questions page and in the search box I'll type in surprise now this is going to bring up a lot of questions because it's a very common um term",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 291.563,
    "end": 314.55,
    "text": " but um we could review the questions that have been asked and see if if one of them directly asks what you're looking for um and if not then it's like a huge act of service to add the question",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 315.577,
    "end": 343.592,
    "text": " because it's something that we're all curious about and so this is how we kind of build our repertoire of asking questions and also everyone is always welcome on their own time to go into the answers and discourse section and um develop the answer whether by adding material or by reorganizing shortly to answer your question directly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 343.724,
    "end": 364.467,
    "text": " surprise is about how expected or unexpected a given sensory observation is so if you were least surprised by a sensory observation you would have had like the most accurate belief and so surprise minimization is equivalent to having the model with the maximum evidence",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 365.257,
    "end": 369.743,
    "text": " Surprise in and of itself, though, is often very hard to calculate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 370.464,
    "end": 381.48,
    "text": "And so instead of calculating surprise directly, a tractable, optimizable bound on surprise is used, and that's called free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 383.023,
    "end": 390.994,
    "text": "So that's definitely one of the key pieces, which is like if we had the minimum surprise model, we'd have the maximum evidence model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 392.155,
    "end": 407.056,
    "text": " In the exact bayesian case that would be totally fine, however, in the high dimensional setting it's not tractable to compute surprise, and so we have this optimizable heuristic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 408.678,
    "end": 411.102,
    "text": "With free energy and reducing the kale divergence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 413.145,
    "end": 413.505,
    "text": "Susan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 418.784,
    "end": 425.274,
    "text": " Yeah, I'm particularly interested in actually mapping context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 426.196,
    "end": 436.732,
    "text": "So is there a place that maybe scenarios are stored that have been mapped or could be mapped?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 441.96,
    "end": 446.327,
    "text": "It's a great question there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 448.248,
    "end": 461.249,
    "text": " If it comes up in the context of a chapter, you can always, beneath the questions in each chapter page, definitely people have talked about scenarios.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 462.25,
    "end": 470.323,
    "text": "And then also, I will just add it to the chapter one notes here, but in the Active Block Friends project,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 470.506,
    "end": 476.472,
    "text": " we have several dozen settings for cognitive modeling that people have worked to map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 476.492,
    "end": 479.595,
    "text": "So I'll just add this link for settings for cognitive modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 480.396,
    "end": 480.657,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 480.957,
    "end": 481.337,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 487.804,
    "end": 488.004,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 488.024,
    "end": 492.469,
    "text": "Anyone else have any just random thoughts where we can explore a few other pieces?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 497.494,
    "end": 498.555,
    "text": "Yeah, I,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 500.054,
    "end": 519.696,
    "text": " I'm wondering, given that you've now run several cohorts for the textbook group, and so the knowledge base has already been established, but you've had a few chances to try this out.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 519.916,
    "end": 529.707,
    "text": "I'm wondering what you're hoping each cohort will bring to",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 531.037,
    "end": 539.247,
    "text": " either to the knowledge base, or how do you see each cohort involving the study of these topics?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 541.951,
    "end": 542.452,
    "text": "Good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 542.792,
    "end": 546.156,
    "text": "Definitely remains to be enacted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 546.196,
    "end": 553.466,
    "text": "I'll just give thoughts, but not in any ranked or fine-tuned version.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 553.526,
    "end": 560.014,
    "text": "First, I hope that everyone who comes into this space synchronously or asynchronously can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 559.994,
    "end": 587.588,
    "text": " find epistemic and pragmatic value and learn about what's meaningful to them and be really in the game in the arena with these topics as they're being developed that would be a great first thing and then for people who want to pick up litter in the environment and paint a nice wall and add a little bit of information on their way it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 587.568,
    "end": 616.09,
    "text": " unbelievably helpful for people to take an active stance towards their engagement with the coda it can look like there's a lot but it's not even a thimble in the ocean and so people who really take an active stance towards looking at the material and where there's a question that doesn't have an answer just throw something out there and when there's a question that has a bunch of information",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 617.723,
    "end": 619.005,
    "text": " just delete an empty row.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 619.506,
    "end": 627.697,
    "text": "There's some low hanging fruit that simply inevitably improves the experience for everybody.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 627.737,
    "end": 637.05,
    "text": "There's always increasing amounts of augmented intelligence tools and language models, including with Coda that we can play with and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 637.611,
    "end": 647.545,
    "text": "So even just adding small amounts of information or resources that people find relevant, adding new questions, just helping",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 649.651,
    "end": 678.173,
    "text": " enact and embody that there isn't a final state of the knowledge base again this is like a larger shared document than any of us would have made by ourself on this textbook but there's so many more directions to go so I'm always kind of looking and speaking towards people who see affordances to improve what we have here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 680.482,
    "end": 701.578,
    "text": " and just do different things with it and there's just there's there's so so many ways to go there's so many unstructured notes for every page there's and again there's fun things to do with Coda AI there's fun things to do with synthesis with linking to other work",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 702.959,
    "end": 705.702,
    "text": " in future textbook groups page.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 706.623,
    "end": 720.158,
    "text": "There's there's hundreds of lines of notes on different thoughts that people have had about how to make the material more accessible and applicable and rigorous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 722.581,
    "end": 725.524,
    "text": "So just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 726.871,
    "end": 732.018,
    "text": " enjoying it wherever you're at as you're going through the group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 733.179,
    "end": 747.218,
    "text": "And then if people would like to rejoin for future cohorts for this textbook group or for other projects at the Institute and do more, that's great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 750.142,
    "end": 750.502,
    "text": "Excellent.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 750.522,
    "end": 750.903,
    "text": "Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 751.243,
    "end": 754.768,
    "text": "As a follow up, is there anywhere",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 755.12,
    "end": 771.036,
    "text": " uh either on the coda or through some email link where people can register themselves publicly uh like a little database of people who are participating in the",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 771.016,
    "end": 798.103,
    "text": " a textbook group and maybe as a way to advertise that I'm I'm participating in this and and if anyone else wants to reach out to me um because I'm working on something that maybe you find interesting here's my contact sure um so one option for that is the projects page here's is a kind of project based",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 799.501,
    "end": 809.474,
    "text": " Another option, I'll just make a, I'll put it on this overview page.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 813.859,
    "end": 816.763,
    "text": "I'll just make a table for a cohort of five people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 817.584,
    "end": 822.15,
    "text": "So if people want to add their own information, they can.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 831.715,
    "end": 837.567,
    "text": " So people can at the bottom of the cohort five, this is always a fun plot to look at as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 838.969,
    "end": 846.043,
    "text": "On the X axis, it's people's like self-evaluated familiarity with active inference from not familiar to very familiar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 846.063,
    "end": 852.897,
    "text": "And then the Y axis is the computer science, biology, and math familiarity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 856.184,
    "end": 879.188,
    "text": " it's all over I guess one of the only trends that I see is that very few people say that they have higher than 80 familiarity with active of course all these self-evaluation numbers who knows what they really mean but um this reflects our textbook group through time so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 881.227,
    "end": 888.596,
    "text": " People have just different backgrounds in math and computer science, biology, and all these things, philosophy that weave together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 888.616,
    "end": 902.091,
    "text": "So just staying in the game and where there's uncertainty, like externalizing it, asking it, will keep your cognitive load light and contribute to open science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 902.111,
    "end": 905.435,
    "text": "So that's huge and fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 905.455,
    "end": 905.656,
    "text": "Great.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 905.676,
    "end": 906.036,
    "text": "Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 911.433,
    "end": 914.693,
    "text": " Any other thoughts or questions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 918.301,
    "end": 922.367,
    "text": " I have one question regarding the structure of these text groups.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 922.428,
    "end": 927.556,
    "text": "So you have multiple of these cohorts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 927.696,
    "end": 934.446,
    "text": "Are there any particular structure in terms of like organizing, for instance, these weekly meetings?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 935.408,
    "end": 937.251,
    "text": "Like what to do during this time?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 937.611,
    "end": 938.453,
    "text": "Was it effective?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 938.693,
    "end": 944.983,
    "text": "Or is that basically up to us to decide on like, how to proceed?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 947.073,
    "end": 952.601,
    "text": " I'm highly open to people who want to explore different formats.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 953.963,
    "end": 960.813,
    "text": "You can look at every single meeting to see exactly how it did happen, but that's not how it has to happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 960.833,
    "end": 962.576,
    "text": "It's not like we're locked in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 962.596,
    "end": 973.452,
    "text": "It's just that we wanted to hit the ground running as soon as the textbook was available in 2022 and then just keep this opportunity around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 973.668,
    "end": 997.836,
    "text": " usually the way that we well earlier on we were just simply grasping with the textbook and so we would often scan through the chapter like during the meetings so just working through the chapter and talking through the chapter um where I would really love to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 999.082,
    "end": 1026.27,
    "text": " see it is like people look at what chapter we're reading in the coming week so it's alternating times so usually not everyone can go to both on the given chapter um and also the at the like you can go to cohort four as well if you just want to go to you know there's people are retaking it we're all just taking multiple times um so when the discussion starts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1026.706,
    "end": 1034.135,
    "text": " And again, this can evolve, but here's just one way that we can hear a lot of voices and get content and have like spontaneous things too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1034.836,
    "end": 1042.746,
    "text": "We'll go to chapter one, for example, and I'll specifically look at the cohort five questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1044.769,
    "end": 1047.913,
    "text": "It's all one underlying big table, just different views.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1048.333,
    "end": 1052.699,
    "text": "This is just to make sure that if there's a new question that cohort five asks that we'll be able to get to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1052.779,
    "end": 1054.401,
    "text": "But like, let's just look at cohort four, you know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1056.997,
    "end": 1077.565,
    "text": " So then start with the questions, respect the effort that the person put in ahead of time to surface their curiosity, whether they're at the meeting or not, and try to go through the questions that are asked about the text.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1078.867,
    "end": 1083.233,
    "text": "And then if people have curiosities arising, like during the meeting, oh, I'm wondering now, I'm wondering about 4.3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1083.333,
    "end": 1085.316,
    "text": "It's like, just type it out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1086.747,
    "end": 1089.389,
    "text": " Like if it's typed out, it's forever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1090.19,
    "end": 1091.852,
    "text": "And then we have a place for the discourse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1092.592,
    "end": 1096.396,
    "text": "If it's just shot from the hip, it dissipates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1096.796,
    "end": 1100.039,
    "text": "Now we still, it doesn't dissipate nowhere because we still can record it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1100.139,
    "end": 1103.182,
    "text": "And obviously we publish the transcripts of these textbook groups and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1103.802,
    "end": 1116.113,
    "text": "But like, as curiosities arise, if you add them to the questions table, um, and then we can structure the discussions with just seeing with what's interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1118.725,
    "end": 1146.505,
    "text": " going to questions that have already been asked in the in um certain settings and other times going to new questions and then in the time between the meetings just people hopefully putting in the time to increase their situational awareness of the coda itself read through the textbook it's many coats of paint situation so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1147.295,
    "end": 1176.711,
    "text": " there are parts that are going to be very dense with the use of the active inference ontology or very technical or things like that so just time boxing and staying in the game and then yeah what is the most effective synchronous meeting strategy that's a good question and then also we can make kind of supplemental meetings for example commonly some people want to do a math learning group",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1177.518,
    "end": 1184.305,
    "text": " that is like some people want to focus more on the background and like the basic math.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1185.618,
    "end": 1209.803,
    "text": " like reading equations bayesian statistics and then other people want to do um work on like more of like connecting the dots with with the difference expressions so if people want to do more math if they want to do more programming if they want to be developing their project you know don't don't let the institute be the rate limiting step",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1210.576,
    "end": 1215.56,
    "text": " This is all up to people in their own learning journey and connecting to people here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1215.62,
    "end": 1231.414,
    "text": "And if you stay in the game over the coming three months, you will get a lot more familiar with active inference, even just with one hour per week.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1231.434,
    "end": 1235.878,
    "text": "If you do more than one hour per week, you will get a lot more familiar with active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1237.039,
    "end": 1239.621,
    "text": "It's not all in the textbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1239.888,
    "end": 1242.332,
    "text": " in this one 2022 short textbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1244.455,
    "end": 1251.224,
    "text": "But this is a great landmark for the field as the first textbook, obviously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1251.264,
    "end": 1260.057,
    "text": "And it allows us to reference out to a lot of other cutting edge work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1261.505,
    "end": 1291.275,
    "text": " so the discussions are great for that because we can kind of like be like oh yeah there's this like live stream happening tomorrow or here's what this person said last week and so it lets us kind of like look at how it was stated in 2022 while also break bringing it closer to what's ongoing in the field and if people you know if in future cohorts if people want to be a facilitator it doesn't require technical expertise in active inference to be a facilitator",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1292.943,
    "end": 1293.744,
    "text": " That's an option.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1293.764,
    "end": 1296.147,
    "text": "There's many, many options.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1306.66,
    "end": 1309.564,
    "text": "Thank you for your detailed explanation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1309.584,
    "end": 1320.818,
    "text": "I think, yeah, I do get that there's plenty of room for trying to make this a really fruitful journey.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1320.838,
    "end": 1321.059,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1321.76,
    "end": 1322.14,
    "text": "Thanks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1323.655,
    "end": 1327.984,
    "text": " I've got a question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1328.285,
    "end": 1336.703,
    "text": "Where do you see innovative applications",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1337.645,
    "end": 1357.174,
    "text": " may or may not be utilizing active inference that might signal us to kind of look at what is coming out, whether that be AI or augmented negotiation or social network analysis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1358.235,
    "end": 1366.808,
    "text": "Is there any particular cutting edge areas that are starting to get attention that would be interesting to coalesce around?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1370.77,
    "end": 1373.218,
    "text": " It's a good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1373.238,
    "end": 1384.273,
    "text": "A lot of applications happen in the industrial setting, so they're not always shared.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1386.548,
    "end": 1395.12,
    "text": " like with the full methods and details that we would expect from like a scientific paper or like an open science educational project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1395.16,
    "end": 1399.486,
    "text": "So I think that's one fundamental unknown part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1400.767,
    "end": 1415.948,
    "text": "At least in the learning setting, there's a lot of exciting things with connecting innovative ways of modeling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1416.603,
    "end": 1424.514,
    "text": " different systems, like we're seeing an active inference, and then the application work remains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1425.295,
    "end": 1430.802,
    "text": "Active inference is a very young field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1431.944,
    "end": 1445.462,
    "text": "And so things that might be expected in a more mature field are not commonplace at active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1446.978,
    "end": 1468.176,
    "text": " And rather than interpret them as a dismal state of affairs, people who find that exciting and want to contribute there will find that even some pretty conventional work can actually have very impactful outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1471.7,
    "end": 1475.49,
    "text": " I'll just link a few things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1476.051,
    "end": 1478.598,
    "text": "So here in the bottom, we have the active inference ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1478.638,
    "end": 1485.355,
    "text": "So this is one of the key features of what we develop at the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1485.503,
    "end": 1493.554,
    "text": " which is like, we're speaking in English right now, but to a large extent, you could think of this as being a dialect of English, which is the active inference ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1493.995,
    "end": 1498.321,
    "text": "It's also been translated into many languages by experts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1499.222,
    "end": 1507.753,
    "text": "And it's a project that we work on every week with basically how to utilize the active inference ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1508.374,
    "end": 1512.54,
    "text": "And also I'll add to this page, the knowledge engineering link,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1512.723,
    "end": 1541.835,
    "text": " we've then used the ontology to analyze the literature and look at how terms change in their use per year but overall um let's see if which plot um is relevant here but overall um we are talking about the number of papers being in the low hundreds over the last",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1543.807,
    "end": 1571.738,
    "text": " 10 to 15 years most of them happening more recently many of them happening through Carl Friston at all but that also being increasingly decentralized so just keep the finiteness in mind and look for the affordances to contribute because there are many many",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1589.993,
    "end": 1613.098,
    "text": " um so let's look at just the overall textbook oh yeah we're just in the kind of the dot zero the the background and just talking about the group itself chapter one and chapter 10 are textual overviews they have no equations they're like kind of like bookends on the book",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1614.648,
    "end": 1642.005,
    "text": " chapter two and and again in our between now and December we're going to be going through just chapters one through five but if you want to be also going to cohort four and going through six or ten you can't um and the authors very clearly say the first half of the book is like epistemic it's about learning active inference and so take the time to really learn what active inference is it will make applying it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1642.407,
    "end": 1645.25,
    "text": " easier when you understand what it really is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1646.712,
    "end": 1651.478,
    "text": "And then chapter 6 through 10 are exactly about the recipe of how you apply it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1652.439,
    "end": 1660.509,
    "text": "Now, it's not at the hold your hand guidebook stage yet, but we connect a lot of the dots here, and this is the direction that we're going in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1661.19,
    "end": 1671.402,
    "text": "Chapter 1 gives an overview, and it contextualizes active inference in relationship to a lot of other areas that people are interested in that they study.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1672.158,
    "end": 1697.338,
    "text": " chapter two and chapter three are the low road and the high road to active inference we're going to talk about this like a ton but here's figure 1.2 here's the low road and the high road and they both meet an active inference the low road asks how and it answers it with Bayesian statistics and the high road asks why",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1697.892,
    "end": 1726.853,
    "text": " and the answer is basically self-observation self-organization self-persistence and so active inference brings together this persistence imperative of the free energy principle high road why with a Bayesian statistical implementation approach that's the low road so that's chapters two and three the low road how and then the high road why and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1727.305,
    "end": 1731.89,
    "text": " we get to the essence of active inference, which is the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1732.771,
    "end": 1737.616,
    "text": "The generative model of active inference is like what is being built.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1738.597,
    "end": 1741.34,
    "text": "This is what you have in hand when you have an active inference model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1741.881,
    "end": 1744.403,
    "text": "No generative model, just speculative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1745.465,
    "end": 1748.508,
    "text": "With generative model, you're talking about something specific.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1750.07,
    "end": 1755.996,
    "text": "And so chapter four goes into some of the technical details about what these generative models are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1756.803,
    "end": 1763.151,
    "text": " building on some of the precursor steps that were covered in the low road and the high road.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1765.257,
    "end": 1766.718,
    "text": " Chapter four, generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1767.199,
    "end": 1779.13,
    "text": "Chapter five is going to focus on one of the areas that has the most empirical evidence in the most well-studied area, which is mammalian neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1780.151,
    "end": 1791.342,
    "text": "So as much of this work arose from human neuroimaging in the 1990s and early 2000s, there's a lot of work on human cognitive and behavioral science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1792.584,
    "end": 1795.146,
    "text": "And so that's the first half of the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1795.261,
    "end": 1822.737,
    "text": " context how and why what and then where has it really been applied the most so far but as we look at um every single day people are expanding the scope of active inference applications every single day but the area it's been most studied is in mammalian neuroscience that's the first half of the book",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1823.881,
    "end": 1826.145,
    "text": " it hits hard.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1826.547,
    "end": 1855.153,
    "text": " that's where we're going to get to by december and then just briefly chapter six is a recipe for designing active inference models so it's kind of like a procedure and a set of questions that you can ask yourself as you're designing a generative model which is an important rite of passage in people's work in this area they'll talk about that in chapter 10. chapter 7 and 8 focus on two big families of generative models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1855.133,
    "end": 1865.202,
    "text": " which is generative models that treat time in a discrete setting, like click, click, click, click, and then models that treat time continuously like a flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1866.703,
    "end": 1873.629,
    "text": "Chapter nine looks at the integration of empirical data with generative models, model-based data analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1874.31,
    "end": 1885.039,
    "text": "And then chapter 10, like chapter one, provides context and revisits a lot of the more conceptual questions given what has been covered.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1886.909,
    "end": 1889.893,
    "text": " So that's the main outline of the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1891.876,
    "end": 1894.1,
    "text": "And those are the places that we'll go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1894.14,
    "end": 1900.87,
    "text": "But also, because the questions take us everywhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1902.152,
    "end": 1905.677,
    "text": "And people always raise questions at many, many levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1906.872,
    "end": 1918.228,
    "text": " So if there's an equation or if there's some section that doesn't make sense or it's not what you would have written or you don't understand how they got from here to there, that's totally fine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1918.248,
    "end": 1932.087,
    "text": "I really encourage you just to continue working through it and just pass through the parts lightly that you don't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1934.108,
    "end": 1939.356,
    "text": " feel expert on in the moment of your first reading or your 100th reading.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1946.306,
    "end": 1948.47,
    "text": "Any other thoughts or questions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1957.743,
    "end": 1958.965,
    "text": "But yeah, it should be really fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1959.786,
    "end": 1960.808,
    "text": "We are going to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1962.458,
    "end": 1965.403,
    "text": " head into for the coming two weeks into chapter one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1967.646,
    "end": 1981.448,
    "text": "So you can ask in the chapter one questions, you can just add them here into the cohort five section, then they'll be tagged with cohort five.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1983.471,
    "end": 1989.36,
    "text": "You can go to just the questions overall, like chapter one questions overall,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1989.577,
    "end": 1995.142,
    "text": " And it would be super, super helpful if you upvote the questions that you find interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1996.423,
    "end": 1998.685,
    "text": "That helps prioritize them for the discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1999.546,
    "end": 2013.759,
    "text": "And then also, once we have questions, like maybe 10 or more or some number of upvotes, and then we feel like there's some questions where it's a very open discourse, but there's other questions where it's kind of like there is an answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2015.32,
    "end": 2019.364,
    "text": "And in those situations, we can then go from...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2019.766,
    "end": 2049.081,
    "text": " the question to the curated thoughts on the answer and then we can translate that into different languages we can make short videos we can make more bite-sized materials I mean there's just many ways we can go from there but like this is this is the real work surfacing what people with different backgrounds and curiosities are curious about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2050.951,
    "end": 2079.844,
    "text": " respecting and encouraging all such voices and then doing what we can to coordinate and and do what we can with the answers not to shut the door because some of these topics are are going to be just huge open intersubjective questions or it will just gesture to a whole area of philosophy or some other area of practice",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2084.313,
    "end": 2110.54,
    "text": " but there's been a lot of great questions so far so there's a lot of value in reading what people have written over the years and reviewing the discourse and again hopefully modifying it if you're not sure you can always like select text and then click this little arrow and do like a you know oh I don't think so if you want to you can always do a suggest change",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2112.157,
    "end": 2139.852,
    "text": " or you could add a comment you'd say oh not sure about this shouldn't that were to be that but if you're just adding a reference or adding connecting the dots or reorganizing the material that already exists just the more the better the more eyes that are looking at it and and um taking a deep breath and trying to evaluate it and and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2142.228,
    "end": 2159.258,
    "text": " interrogating it in the moment that is so huge and if it doesn't make sense don't assume that it just made sense to someone else and that you just don't get it just if it doesn't make sense then that's your opening to ask that question to write the follow-up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2168.283,
    "end": 2174.556,
    "text": " And this is a short video with Ali, who's not here now, but he'll probably join us some future times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2176.28,
    "end": 2183.656,
    "text": "If you listen to the recordings, you'll quickly become a fan of Ali's gentle scholarship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2185.881,
    "end": 2187.945,
    "text": "But yeah, we'll go into chapter one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2190.76,
    "end": 2213.157,
    "text": " and we'll have the two weeks to discuss it which whichever one or both people join at again chapter one's a very um pros based chapter it's not equation heavy um it brings up huge ideas though and so then we'll just cruise through the discussion",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2217.322,
    "end": 2218.564,
    "text": " Oh, chat GPT.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2218.604,
    "end": 2219.044,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2219.144,
    "end": 2221.727,
    "text": "Oh, one here in the equation section.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2222.689,
    "end": 2229.677,
    "text": "So we translated all of the equations into LaTeX plain text.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2229.697,
    "end": 2246.738,
    "text": "And then here's using Coda AI to explain to high schoolers, write pseudocode, explain the variables, give philosophy questions, translate into different languages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2247.848,
    "end": 2251.834,
    "text": " Code AI, I believe currently uses GPT 3.5.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2253.836,
    "end": 2258.002,
    "text": "But cert and then also perplexity.ai, you can upload a file.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2258.082,
    "end": 2265.933,
    "text": "So I often have just uploaded the whole textbook and had discourse on the knowledge engineering project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2266.133,
    "end": 2275.206,
    "text": "Again, if people are interested in this, we are curating large amounts of the active inference information environment into fine-tuned language models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2276.485,
    "end": 2304.822,
    "text": " with code and with um visual recognition eventually and some other features so there's a lot of ways to go so that's why we just stay in the game and have fun okay any last comments yes it is exciting thank you Susan",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2310.775,
    "end": 2311.056,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2312.598,
    "end": 2315.343,
    "text": "I will stop the recording, but thank you, everybody, till next time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2317.668,
    "end": 2319.15,
    "text": "Thank you very much, Daniel.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2319.17,
    "end": 2319.371,
    "text": "Bye.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2319.751,
    "end": 2322.697,
    "text": "I really appreciate all this work that you're doing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2323.258,
    "end": 2326.383,
    "text": "I'm looking forward to the next meetings.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2326.403,
    "end": 2326.784,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2327.245,
    "end": 2327.566,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2327.906,
    "end": 2329.369,
    "text": "See you all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2329.389,
    "end": 2330.05,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  }
]