[
  {
    "start": 24.872,
    "end": 51.745,
    "text": " hello welcome it is september 14 2022 and we're in actin live stream number 48.2 welcome to the active inference institute we're a participatory online institute that is communicating learning and practicing applied active inference you can find us at some of the links on the slide this is a recorded and an archived live stream so please provide feedback so we can improve our work",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 52.918,
    "end": 58.302,
    "text": " All backgrounds and perspectives are welcome here and will follow video etiquette for live streams.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 59.883,
    "end": 68.429,
    "text": "Head over to ActiveInference.org to learn more about how to participate in learning groups and projects such as the live streams and others.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 70.333,
    "end": 85.222,
    "text": " Well, we are in our third discussion around this paper, Communication as Socially Extended Active Inference and Ecological Approach to Communicative Behavior from 2021 by Remy Tisson and Pierre Poirier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 86.342,
    "end": 94.827,
    "text": "And last week in 48.1 with the very same fellows in the conversation,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 95.808,
    "end": 100.49,
    "text": " We had some explorations into different aspects of the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 101.57,
    "end": 114.254,
    "text": "Perhaps we can each say hello again and something, if we want to, that we remembered from last week or that we'd like to explore today, and then we can just be right in it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 115.255,
    "end": 124.078,
    "text": "So I'm Daniel, I'm in California, and I'm interested to look towards the latter half, the back nine,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 125.285,
    "end": 150.462,
    "text": " of the paper and see where we go which is kind of what we do in dot twos usually and i just have a feeling that the exit from the slide on this one may put our communication and situatedness in a different place than where we were before and i'll pass it to blue",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 163.419,
    "end": 165.184,
    "text": " I heard the initial part and then lost it, Blue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 168.559,
    "end": 169.239,
    "text": " Can you hear me now?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 169.259,
    "end": 171.66,
    "text": "How about that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 172.1,
    "end": 180.542,
    "text": "I am Blue and I'm a researcher in New Mexico and I am excited to dig back into this paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 180.582,
    "end": 194.425,
    "text": "I think we left a lot of things to wonder about last week and yeah, excited to get to maybe more into the meat of the paper itself as opposed to just discussing tangential ideas.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 195.365,
    "end": 196.185,
    "text": "And I'll pass to Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 198.089,
    "end": 198.489,
    "text": " Thanks, Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 198.569,
    "end": 198.929,
    "text": "I'm Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 198.989,
    "end": 200.41,
    "text": "I'm here in Calgary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 201.33,
    "end": 219.476,
    "text": "I'm interested in seeing whether or not the big roadmap that I think that this paper provides also can be explained as a big score, as in a kind of a musical analogy, because I'm really interested in the interplay or the interaction between orchestration and arrangements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 220.057,
    "end": 226.759,
    "text": "Yesterday, there was a math stream where our guest was really good at sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 227.577,
    "end": 232.981,
    "text": " describing the arrangement part of what's going on in active inference potentially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 233.622,
    "end": 243.79,
    "text": "And so I'm really kind of interested in looking at that because I think from a transmission versus ecological standpoint, we're kind of looking at the difference between mono and stereo.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 244.611,
    "end": 248.534,
    "text": "So I'm wondering if we should maybe look at that through that lens as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 248.554,
    "end": 249.735,
    "text": "I'll pass it to Remy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 252.13,
    "end": 253.912,
    "text": " Hi, I'm Rémy Tizan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 254.412,
    "end": 260.838,
    "text": "I'm a researcher at UCAM in Montreal and I'm the author of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 261.618,
    "end": 267.243,
    "text": "And I'm looking forward to discussing the paper more in detail and maybe go to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 268.244,
    "end": 283.515,
    "text": " towards the later parts of the paper and maybe talk a bit about language and linguistic communication, which is a big piece that is looming behind the paper, but it's not really that much discussed in it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 283.615,
    "end": 290.46,
    "text": "But I think that's what any account of communication aims to go towards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 290.54,
    "end": 294.203,
    "text": "So I hope we'll have the chance to discuss it a little bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 296.564,
    "end": 316.37,
    "text": " let's go to language it's what we're using among other modalities but we are using language and so that sounds like a great place to start so what was in the paper regarding language and what was not in the paper regarding language",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 324.575,
    "end": 344.323,
    "text": " Yes, so the idea was to open a window at the end of the paper towards language, so we talked a bit about conventional forms of communication and we know that most people believe that language is conventional, so we tried to tie",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 345.757,
    "end": 357.615,
    "text": " are the ideas that we put forward in the paper with work by Ramsted in the paper of 2016 about conventional affordances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 357.695,
    "end": 358.777,
    "text": "So we tried to say that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 360.88,
    "end": 372.724,
    "text": " the conventional nature of the language comes from the conventional affordances that are generated in the communicative interaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 372.844,
    "end": 376.585,
    "text": "So that's a way to point towards language in our account.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 379.787,
    "end": 391.55,
    "text": " We talked a bit about different types of acts of language, so informative or declarative and interrogative, imperative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 391.57,
    "end": 396.032,
    "text": "So these kinds of distinctions, we try to account for them in our framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 397.272,
    "end": 416.504,
    "text": " These are various parts of what we consider to be language that we tried to treat in the paper, but there's a lot of things that we couldn't discuss, obviously, because it was like in a small section and at the end, we cannot explain all of language, even in a paper or in a book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 417.365,
    "end": 420.807,
    "text": "So in a small section, that would be obviously way too ambitious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 425.322,
    "end": 449.069,
    "text": " what are we looking to explain or what is needed for language to be encompassed or at home or native to the ecological view rather than the transmission view or in addition to the transmission view read me first then others",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 450.798,
    "end": 462.809,
    "text": " A point that is interesting is that the transmission view comes with a presupposition about what has to be explained by a theory of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 464.387,
    "end": 473.978,
    "text": " of language, it comes with the idea that we have to account for the meaning of the expressions that are used first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 473.998,
    "end": 483.008,
    "text": "So we have to understand what are the meanings of the words that we use and how these meanings are encoded in the brains and the heads of the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 484.489,
    "end": 506.157,
    "text": " of the speakers of a language but that that's uh misleading from the point of view that we adapt in the paper so this it's kind of hard to say uh what we have to explain in order to explain language because for so long uh we have bait in the we have been in the the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 508.238,
    "end": 509.179,
    "text": " the transmission view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 509.719,
    "end": 518.066,
    "text": "And so we are used to believe that in order to explain language, we have to explain these kinds of contents that language transmits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 519.527,
    "end": 529.315,
    "text": "But if we do away with these contents, it's kind of open the question of how do we account for language becomes kind of open in a new way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 530.095,
    "end": 541.505,
    "text": " And I don't really know exactly what we have to account for in order to account for language because it kind of changes our view of what language is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 542.006,
    "end": 553.035,
    "text": "So I think there's a lot of open space in this question of how do we account for language if we do away with the transmission view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 556.678,
    "end": 557.559,
    "text": "Dean or Blu?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 562.895,
    "end": 563.636,
    "text": " What do you got, Blue?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 568.72,
    "end": 570.621,
    "text": "So I just was looking back over the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 570.701,
    "end": 586.154,
    "text": "I think it might be useful to maybe delineate the specific types of language, interrogative versus imperative, and the specificities underlying each one of those right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 586.955,
    "end": 590.998,
    "text": "That would be maybe a good place to just dive into the meat of the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 597.062,
    "end": 614.694,
    "text": " how can we see these different types of speech speech acts as shaping the field of affordances what is being done ecologically with these different speech behaviors as opposed to the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 616.209,
    "end": 618.871,
    "text": " enabling aspect of the transmission view.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 619.271,
    "end": 626.377,
    "text": "I think they're fairly clear within the transmission view what these statements are about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 626.958,
    "end": 633.443,
    "text": "And as you pointed out, it's almost like hard to escape viewing what these speech behaviors are by the content.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 633.483,
    "end": 636.705,
    "text": "Like if not their content, quite literally, then what would they be about?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 637.206,
    "end": 638.427,
    "text": "Even talking about what they're about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 638.747,
    "end": 642.47,
    "text": "But informative would be sharing a proposition or some...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 643.971,
    "end": 667.679,
    "text": " reducing someone's uncertainty about the state of something in the world I'm feeling this way or that weighs this much um and so on or other statements because indeed they're defined by the content and their structure so ecologically Remy what might these types of speech behaviors be doing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 669.488,
    "end": 683.695,
    "text": " Yeah, these types of acts of language are well accounted for in the transmission view, but there are some questions that remain about the imperative form of communication because it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 685.023,
    "end": 703.918,
    "text": " it's not clear that imperative communication can be understood as a form of transmission of content because we have the feeling that when we comment something or we request something we are not transmitting information or we are not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 706.741,
    "end": 711.466,
    "text": " aiming at changing the mental states of the person that we are talking to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 711.486,
    "end": 715.611,
    "text": "We are aiming at making them do something in the world directly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 716.152,
    "end": 719.636,
    "text": "So there's kind of a mismatch there, it seems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 720.837,
    "end": 721.578,
    "text": "So obviously,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 722.799,
    "end": 742.55,
    "text": " the the the people in the transmission view will have an answer they will say that like uh when i have some for instance the desire or the intention that something is the case i then my an imperative act of communication is my transmitting this intention or this desire to the person who then has this desire or this intention and then can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 743.23,
    "end": 760.678,
    "text": " bring about the state of affairs that I intend to achieve but it's not I'm not sure obviously you can delve in the details but I'm not sure that's exactly what we want to do when we state when we produce an imperative act of language obviously we won't",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 762.019,
    "end": 766.002,
    "text": " We don't just want that the person has the intention of doing something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 766.042,
    "end": 769.025,
    "text": "We want the thing done in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 769.105,
    "end": 777.151,
    "text": "So I believe that the imperative kind of communication is not really well accounted for in the transmission view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 778.112,
    "end": 795.358,
    "text": " And what's interesting is that, in a way, the imperative form of communication is like the basic form of communication in our framework, because what communication is, is acting through the behavior of somebody else by affecting its field of affordance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 796.778,
    "end": 809.563,
    "text": " we can go back to the forms of animal communication that we described earlier in the paper, and these can all be considered to be imperative forms of communication, or proto-imperative forms of communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 809.963,
    "end": 811.324,
    "text": "So that's the starting point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 814.523,
    "end": 821.928,
    "text": " And we achieve these acts on the behavior of somebody else by altering their field of affordances to make them do something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 822.548,
    "end": 827.071,
    "text": "But how do we account for informative acts of communication?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 827.511,
    "end": 830.813,
    "text": "And an idea that we put forward in the paper is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 833.695,
    "end": 850.182,
    "text": " The kind of acts of communication that we consider to be informative will be acts that aim to construct or alter a shared field of affordances in a way that is more durable than just an immediate imperative act of language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 850.242,
    "end": 858.446,
    "text": "So what we are doing, we are changing the layout of the context that we take to be relevant to our joint action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 859.126,
    "end": 864.37,
    "text": " And these changing of affordances do not have to be immediately acted upon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 864.55,
    "end": 867.632,
    "text": "I can say, oh, there's something in the context that's relevant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 868.032,
    "end": 874.956,
    "text": "It does not necessarily call for action immediately, but it's something that is like in the background of our context of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 875.316,
    "end": 880.5,
    "text": "And so it changes the shared field of affordance, but it's not directly applied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 881.32,
    "end": 886.002,
    "text": " soliciting an action from the interlocutor, as would be the case for the imperative active language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 886.042,
    "end": 898.267,
    "text": "So in a way, it's like as if in the beginning, an informative active language is like a long term imperative or a dispositional imperative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 898.347,
    "end": 900.928,
    "text": "We put something in the context, we say, oh, that's relevant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 900.988,
    "end": 906.19,
    "text": "We can act on it at some point, but it's not necessarily immediately to be acted upon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 906.59,
    "end": 907.711,
    "text": "So that's how we can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 908.271,
    "end": 932.278,
    "text": " like put the the the idea that okay we can change our context of action what we take to be relevant in the context of action and we can come back to it later when when it's relevant and act on it but it's not something that is to be acted upon immediately and so that's like the the the the the difference uh between imperative and informative begins to to to be uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 933.118,
    "end": 962.125,
    "text": " discerned there where an imperative is like i'm i'm saying that this so this affordance should be acted upon immediately and informative is like i'm putting this in the context it changes the layout of affordances for instance uh there would be i i don't know how to how to come up with an example but if i inform you of something i'm putting i'm changing the layout of the affordance that we take for for granted in our in the context of our interaction and it changes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 962.825,
    "end": 983.157,
    "text": " uh in the long term the interaction and it can like drive the interaction in various ways but it's not something to be acted uh directly immediately so that's the the the basic distinction and that's like the the beginning of a distinction between informative and imperative and i i can say a few words about interrogative too",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 983.977,
    "end": 997.565,
    "text": " So as we said, communication is typically acting through the behavior of somebody else by altering its field of affordance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 997.926,
    "end": 1004.99,
    "text": "And interrogative, it's interesting because it's exactly the distinction between imperative and interrogative is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1005.711,
    "end": 1010.977,
    "text": " really similar to the distinction between pragmatic value and epistemic value in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1011.417,
    "end": 1018.886,
    "text": "So for instance, when we produce an action that aims to maximize pragmatic value, we are trying to, for instance,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1020.433,
    "end": 1025.734,
    "text": " to make the state of the world correspond to a prediction of our directive model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1026.134,
    "end": 1034.736,
    "text": "And when we make something which is guided by epistemic value, what we try to do is we're trying to reduce uncertainty about our niche, for instance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1035.176,
    "end": 1041.978,
    "text": "But so in a way, so for instance, when I'm eating something, I'm maximizing my",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1042.998,
    "end": 1050.164,
    "text": " my pragmatic value because I'm, for instance, reducing a prediction error that I'm hungry and I want to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1050.385,
    "end": 1052.006,
    "text": "So that's like a basic example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1052.386,
    "end": 1059.413,
    "text": "But when I'm exploring my environment, when I'm making a visual saccade to explore my niche, so that would be an epistemic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1060.994,
    "end": 1061.954,
    "text": " action, so to speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1062.214,
    "end": 1071.139,
    "text": "So interrogative acts of language are exactly analog to epistemic actions, but they are epistemic actions through the behavior of somebody else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1071.459,
    "end": 1083.765,
    "text": "So instead of, for instance, by myself exploring the niche, exploring the field of affordance, I can produce this act that will make the other person disclose to me an element of the field of affordance that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1085.006,
    "end": 1105.136,
    "text": " can then reduce my uncertainty about what is the context of our action so that's really the distinction between imperative and interrogative is really to be understood along the line of the distinction between pragmatic value and epistemic value so that's a beginning to an introduction to these these distinctions in the in in the types of acts of language",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1109.278,
    "end": 1110.219,
    "text": " Thanks, Jeremy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1110.279,
    "end": 1117.204,
    "text": "You totally read my mind there about what I wanted to elaborate on, even though my question was very poorly framed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1118.325,
    "end": 1128.733,
    "text": "Yeah, I think that that's very useful for, especially in the goal-directed aspect of imperative versus interrogative or informative.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1128.974,
    "end": 1129.394,
    "text": "Like, what",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1130.074,
    "end": 1139.319,
    "text": " how they interact with our, maybe we don't have a joint goal versus we do have a joint goal, or the goal is to develop some shared state of a shared mental state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1140.119,
    "end": 1140.98,
    "text": "So that was really helpful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1141.0,
    "end": 1141.34,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1143.681,
    "end": 1147.623,
    "text": "Another note is that the informative behavior",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1148.926,
    "end": 1171.469,
    "text": " is like the the base class of the transmission view because it seems to be like it's updating one on the details like what if i'm saying there is a gallon of milk in the fridge truly what else could be conveyed other than the content so it seems like the most natural and then there are specific kinds of content like um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1173.402,
    "end": 1200.731,
    "text": " sharing the content that you have a question or sharing the content that you would like somebody to act and so in that way as you described many forms of speech behavior are well accounted for in the transmission view and that accounting is actually kind of a call back to that math stream four with david spivak about accounting systems so these are like accounting models um and then you highlighted that the imperative",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1201.804,
    "end": 1210.368,
    "text": " in the inactive and ecological view on communication that the imperative is perhaps the basic form of communication.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1210.948,
    "end": 1218.532,
    "text": "And that can be seen developmentally through a child and the kinds of communications that they might engage in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1219.472,
    "end": 1230.875,
    "text": " as well as from an evolutionary perspective with the kinds of audio or chemical or physical stigmergy and marks that different kinds of creatures use to communicate within and across species.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1231.335,
    "end": 1244.198,
    "text": "So those are action-oriented communications as we can then say all action-oriented communication or all communication we can say is action-oriented in an analogous way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1244.598,
    "end": 1247.579,
    "text": "So then imperative becomes the base class.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1248.723,
    "end": 1273.142,
    "text": " shaping the field of affordances if that's what the ecological view on communication is is going to be most natural with kinds of expressions that we can say are imperative and then informative updates are like one step removed from direct action requests so saying turn the handle to the left is an imperative if you said",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1274.574,
    "end": 1275.855,
    "text": " I'm going to inform you about two things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1275.935,
    "end": 1277.596,
    "text": "The handle can be turned to the left.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1278.196,
    "end": 1281.058,
    "text": "And if this happens, you may want to turn the handle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1281.638,
    "end": 1291.883,
    "text": "Those are breaking down a capacity for action into sequential or modular or recomposable statements.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1293.024,
    "end": 1298.287,
    "text": "But those statements are like hiding the consequences of action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1299.227,
    "end": 1303.47,
    "text": "And so in that way, we can have an action-oriented view on communication",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1304.696,
    "end": 1318.686,
    "text": " and then see different kinds of other behavior as like modified or truncated or censored or hidden action modification.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1320.247,
    "end": 1327.252,
    "text": "And that may or may not entail needing to even explain how meaning is represented, transmitted, or received.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1330.083,
    "end": 1330.564,
    "text": " Yes, Remy?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1332.907,
    "end": 1334.448,
    "text": "That's exactly it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1335.149,
    "end": 1337.172,
    "text": "That's really the idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1337.192,
    "end": 1338.133,
    "text": "You explained it very well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1338.213,
    "end": 1344.962,
    "text": "Another example that we often use with Pierre is the joint action of cooking a meal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1345.482,
    "end": 1371.838,
    "text": " with various people so like we an example we used in the last discussion the example of moving a couch so another example maybe to to change a bit our intuitions about communication so with people cooking a meal together we can suppose that some people uh some of the suppose that we're in the kitchen of one of the the person and the other doesn't know exactly where all the things are and so a person the person could say there's flour in the in the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1372.879,
    "end": 1389.362,
    "text": " in the cupboard or in the pantry and saying that that's an informative act of language but that could that's like that might be a hidden imperative in so far as at some point in the interaction in the cooking of the meal the the flour might be needed and at this point",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1389.682,
    "end": 1406.695,
    "text": " this alteration of the field of affordances, this appearance of the flower as an affordance in the context might drive the action of the person when the flower is needed at a certain point, the person will have this affordance in its field and will go to seek it if it's necessary at that point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1406.715,
    "end": 1417.123,
    "text": "So the informative is, as I said, something like a dispositional or long-term imperative, something of a hidden imperative",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1417.663,
    "end": 1443.3,
    "text": " uh that can drive behavior in the long term so so it's like at the beginning this distinction is more this a distinction of like is this affordance to be acted upon uh immediately by you or is it posed in the context and can like alter the dynamic without being directly acted upon immediately so that's how the the basic distinction is drawn and yeah i i",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1443.9,
    "end": 1454.442,
    "text": " I think that's how we try to account for informative without describing it as transmitting a content or an information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1455.122,
    "end": 1456.322,
    "text": "So that's the idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1456.762,
    "end": 1464.384,
    "text": "And I think that you explained it very well in your explanation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1466.644,
    "end": 1466.824,
    "text": "Good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1467.204,
    "end": 1470.165,
    "text": "Yeah, it's very interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1470.325,
    "end": 1471.545,
    "text": "It's just another...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1473.166,
    "end": 1502.526,
    "text": " consequence of centering action so many things that the pragmatic turn pragmatism earlier than the so-called pragmatic turn in the neurosciences and all of the developments in cognitive science in many cases it's been like an information or an inference view yielding to an action view and that has just played out differently on different frontiers",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1504.085,
    "end": 1526.579,
    "text": " and it feels like in a way language is like the stronghold of information views because it's like so amenable to syntactic and discourse analysis and compositionality and all these features that we see in formal models and in computer systems",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1527.867,
    "end": 1534.853,
    "text": " that it feels like, oh, maybe all the funny stuff that people do and say, we'll figure that one out too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1536.574,
    "end": 1537.715,
    "text": "Blue and then Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1542.239,
    "end": 1554.203,
    "text": " So I just wonder about like mimicry, which is something that we see like in the animal kingdom a lot and like whether that is imperative.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1554.223,
    "end": 1560.605,
    "text": "I mean, sometimes I guess it can be imperative, like watch me do this and then you do it, but not always.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1560.905,
    "end": 1568.228,
    "text": "So sometimes it's like, you know, an animal will see another animal do something and then they try it too, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1568.348,
    "end": 1571.529,
    "text": "And so what, I don't know, I just don't know how to like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1573.524,
    "end": 1583.431,
    "text": " in the terms of teaching and learning and like shared goal directedness, like what is maybe the role of mimicry and how does that, like, what is the effect on the field of affordances?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1583.471,
    "end": 1584.552,
    "text": "Does it just open up?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1584.632,
    "end": 1593.399,
    "text": "Like you see someone do something and then your field of affordances opens to that is also possible for me, or does that not have maybe like a semantic analog?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1593.639,
    "end": 1593.939,
    "text": "I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1596.773,
    "end": 1619.942,
    "text": " that's a really good question and often people who adopt the transmission view will adopt the view that the main driver of the evolution of language in human societies was the transmitting of of knowledge and of skills for instance and of various types of activities so that's like a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1621.5,
    "end": 1634.237,
    "text": " a clear example where it seems that the transmission view has a story to say if we take for granted that imitating somebody or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1636.5,
    "end": 1655.953,
    "text": " or learning something to somebody is in effect transmitting a knowledge or a certain kind of mental state or cognitive state so that there's clearly something interesting there for the transmission view but I think that an alternative possible analysis you just heard",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1657.274,
    "end": 1671.381,
    "text": " at it is the idea that when you're interacting with somebody, specifically somebody of your own species, seeing this person do something can open new affordances for yourself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1671.501,
    "end": 1684.247,
    "text": "For instance, if I see somebody that looks like me do something, I have learned that when somebody that looks like me does something, usually maybe with a little bit of effort, I can do it too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1685.387,
    "end": 1691.871,
    "text": " Somebody doing something is a way of opening up new affordances for me and trying to achieve it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1691.891,
    "end": 1696.874,
    "text": "So in many cases, mimicry will not necessarily be communicative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1696.974,
    "end": 1701.137,
    "text": "That is because an organism can do something without having no communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1701.877,
    "end": 1708.501,
    "text": " is not communicating nothing to anybody, but it happens that somebody else watches it and imitates it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1708.541,
    "end": 1711.522,
    "text": "So in that case, there's not necessarily communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1711.823,
    "end": 1719.887,
    "text": "But in cases where there is communication involved, I think we can analyze it just as you said, that is saying that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1720.607,
    "end": 1739.871,
    "text": " uh the the action of the organism opens up a new affordance for the the the person who's watching it doing it and usually in cases of explicit uh skill learning for instance the the the expert will like do the thing more deliberately more slowly more explicitly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1740.211,
    "end": 1745.354,
    "text": " to show what are the relevant movements that have to be made in order to achieve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1745.374,
    "end": 1756.24,
    "text": "So that's like making more salient the kind of movement that has to be made to succeed in performing the skill.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1756.64,
    "end": 1767.886,
    "text": "So I think that's a way that we can understand this kind of skill learning in the transformation of the affordances that are available to the person that's receiving the communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1769.841,
    "end": 1786.244,
    "text": " that's how i would i i think i would analyze it one simple uh example kind of building on this making certain actions deliberate then dean interested for your thoughts even showing something deliberately",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1787.785,
    "end": 1816.003,
    "text": " verbally calling attention or just the position of the body for a physical skill it shapes the field of affordances specifically where somebody can look so if you're like okay I'm gonna swing the bat and then now I'm going to show you what my hand you know this isn't usually how I do it but I'm going to show you how I was holding it at that time you have shaped their field of oculomotor affordances in and that is what enables their generative model to update",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1817.577,
    "end": 1841.213,
    "text": " and so nowhere in that account is I'm transmitting that this is to be held between these two fingers let alone counterfactuals like here's what you do if your hand is slippery but by bodily posture including vocal box bodily posture we can have an integrated account of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1843.021,
    "end": 1859.111,
    "text": " mimicry, skill transfer, again, transfers playing way too strongly into a transmission view, but skill resonance or something similar that helps recognize the cognitive entities learning process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1860.892,
    "end": 1863.893,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1864.594,
    "end": 1869.957,
    "text": "Okay, well, I want to take what you're saying, but I'm going to put a little bit of a weird flex on it because I want to try to combine",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1870.779,
    "end": 1877.083,
    "text": " Blue's pin and Remy's pin and Daniel's pin into one kind of question that comes back to the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1877.283,
    "end": 1888.61,
    "text": "So like the last five minutes of the conversation has been focused on the act of and as typing when it pertains to language and communication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1889.49,
    "end": 1898.116,
    "text": "And Blue bringing mimicry in is a form of as versus a lot of the emphasis in the paper, which is on the of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1899.577,
    "end": 1900.838,
    "text": " of communication and language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1900.878,
    "end": 1902.019,
    "text": "So here's my question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1904.3,
    "end": 1913.027,
    "text": "I went back and read the paper again, and I caught myself asking, what do I hear when I'm reading something or I'm listening to someone?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1913.547,
    "end": 1929.098,
    "text": "What do I hear as both processor and the producer, as we mentioned off camera, an arranger of something being signaled, which I'm picking up on and decoding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1930.208,
    "end": 1938.593,
    "text": " So rather than just leave it there, I'll park that for a second, because I think that's the nut of what I want to ask.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1939.454,
    "end": 1943.957,
    "text": "As a processor and a producer, as an arranger, I can hear things in mono.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1944.837,
    "end": 1946.398,
    "text": "I can hear things in stereo.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1946.678,
    "end": 1950.741,
    "text": "I can even hear things, if I go to my Apple Music, in spatial audio.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1951.841,
    "end": 1957.345,
    "text": "So that is a field of affordances question as opposed to a source.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1958.109,
    "end": 1959.149,
    "text": " of affordances question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1959.189,
    "end": 1965.21,
    "text": "And if I only limit myself to the source, I'm going to be asking only of type questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1967.091,
    "end": 1967.291,
    "text": "Right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1968.131,
    "end": 1986.634,
    "text": "So if I want to stay in the as of, if I want to be able to hold up two things at once at a minimum, the stereo or the spatial, that's when I get into the ecological, even if it's specific ecological, because I'm not collapsing down to a single source as my",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1987.213,
    "end": 2001.641,
    "text": " point of contact, which then leads me to ask the fact that communication can be formed as an of types, meaning mono, stereo, spatial, mimicry, interrogation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2002.242,
    "end": 2013.828,
    "text": "The fact that it can be broken out into those things, does that introduce self-production into the self-processing in your paper?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2014.469,
    "end": 2016.95,
    "text": "Because I know there's a heavy emphasis on the of,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2017.828,
    "end": 2035.656,
    "text": " on the processing, but I wonder if you keep the as, when Blue brings it up or when Daniel brings it up, if we're keeping it on that, even a specific ecological level, are we not, when we hear something, producers as well?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2045.081,
    "end": 2045.901,
    "text": "What are we producing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2048.512,
    "end": 2052.155,
    "text": " I have no idea, but I know I hear something even when I read what you're typing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2052.355,
    "end": 2054.516,
    "text": "I'm not just hearing the tappity-tap.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2055.537,
    "end": 2056.437,
    "text": "I'm hearing something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2056.858,
    "end": 2061.54,
    "text": "We are produce.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2061.681,
    "end": 2062.601,
    "text": "It's changing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2062.741,
    "end": 2068.245,
    "text": "I'm hearing that, not reading that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2068.285,
    "end": 2071.647,
    "text": "If I incorporate that, what am I doing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2072.487,
    "end": 2077.03,
    "text": "I'm not the expert on communication, so I wonder what the expert can tell me about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2081.724,
    "end": 2083.368,
    "text": " Yeah, that's a good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2083.388,
    "end": 2088.599,
    "text": "Yeah, I'm not sure what to say about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2090.824,
    "end": 2092.387,
    "text": "We'll go first, and then we'll continue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2094.699,
    "end": 2101.985,
    "text": " So I wonder if what you're hearing, Dean, has anything to do with the internal monologue, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2102.025,
    "end": 2106.949,
    "text": "So like, as you are reading something, then you are also hearing something, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2107.069,
    "end": 2112.914,
    "text": "And so it's like, there's this internal, I mean, like, I have a very, I'm a talker person.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2112.974,
    "end": 2118.859,
    "text": "And so I like, I have a strong internal monologue, like all the time running, like even getting ready in the morning, okay, I need to get my shoes and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2119.195,
    "end": 2123.077,
    "text": " get my purse and my keys and I have to pack my lunch and like all these things, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2123.117,
    "end": 2123.778,
    "text": "Like that happens.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2123.838,
    "end": 2128.941,
    "text": "So I'm constantly hearing that, like as if I'm saying it maybe to myself, even though I'm not speaking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2129.741,
    "end": 2135.105,
    "text": "But I wonder what, you know, so I definitely am a producer of whatever I'm reading.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2135.205,
    "end": 2136.345,
    "text": "Like I reproduce it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2136.706,
    "end": 2138.186,
    "text": "I reproduce it though, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2138.226,
    "end": 2142.149,
    "text": "So I reproduce it in my own mind, in my own internal monologue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2142.169,
    "end": 2145.651,
    "text": "But I wonder, like, I know not everyone has this internal monologue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2146.231,
    "end": 2148.513,
    "text": "And so what, is it then the same?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2149.153,
    "end": 2152.235,
    "text": " For the people that don't perhaps have this internal monologue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2152.255,
    "end": 2155.937,
    "text": "I mean, maybe they carry around a picture of all the things that they need to get ready in the morning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2156.358,
    "end": 2159.179,
    "text": "So yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2159.92,
    "end": 2160.18,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2160.28,
    "end": 2161.901,
    "text": "And I think you bring up a good point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2162.581,
    "end": 2163.562,
    "text": "Is it a monologue?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2163.822,
    "end": 2165.063,
    "text": "Is it a stereo log?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2165.883,
    "end": 2169.205,
    "text": "Is it a quadraphonic log for some people?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2169.686,
    "end": 2174.889,
    "text": "I mean, I mean, there was an availability way back when, maybe even before some of you were born.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2175.302,
    "end": 2176.922,
    "text": " there was quadraphonic sound.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2177.502,
    "end": 2180.623,
    "text": "I remember the Who album in quadraphonic sound.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2181.163,
    "end": 2187.544,
    "text": "And like to my simple ears, I didn't understand what that even meant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2187.604,
    "end": 2196.226,
    "text": "Just because they were able to break it out into four parts didn't change what I was both producing and processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2196.986,
    "end": 2204.527,
    "text": "So, but the fact that we can type it, like not type it out, but literally turn it into types,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2205.279,
    "end": 2221.752,
    "text": " is the part where I don't really have the background to be able to explain how that ability, that field of affordances as opposed to examining this as a single source of affordance changes the communication game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2221.772,
    "end": 2226.955,
    "text": "Because it certainly does speak to mimicry and what we can and cannot pick up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2227.396,
    "end": 2233.32,
    "text": "It certainly speaks to Daniel's point about what happens when layers",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2234.56,
    "end": 2248.49,
    "text": " appear and disappear because we narrow down what we're picking up on versus have both of our ears working even though we think it's our eyes that are doing all the circadian, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2249.171,
    "end": 2253.895,
    "text": "So again, I'm not trying to ask the impossible question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2253.915,
    "end": 2260.94,
    "text": "I'm just curious in the sense of producer and processor and what that arrangement is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2261.823,
    "end": 2267.966,
    "text": " dependent upon what the, because Daniel brought it up in the last live stream, circumstances matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2269.807,
    "end": 2290.696,
    "text": "So, but as a hearer, I wonder if we know enough about ourselves to really be able to give this anything more than, as Remy kindly pointed out in the paper, give this more than sort of a big road map",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2291.465,
    "end": 2296.898,
    "text": " view if we are taking context into consideration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2298.803,
    "end": 2299.124,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2299.505,
    "end": 2299.665,
    "text": "Rami?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2302.677,
    "end": 2307.378,
    "text": " Yeah, I think the discussion about internal monologue is really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2307.978,
    "end": 2311.259,
    "text": "There's a lot of things that you said, Dean, that are, I think, really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2311.299,
    "end": 2314.58,
    "text": "But I want to go back to the idea of the monologue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2315.02,
    "end": 2324.063,
    "text": "And there are some people who believe that, like Chomsky, who believe that language is not even for communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2324.163,
    "end": 2325.883,
    "text": "It's about structuring thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2325.923,
    "end": 2328.024,
    "text": "And so there are people who believe that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2328.544,
    "end": 2344.938,
    "text": " the language is first and foremost something that is a property of the structure of our thoughts and not a property of systems of communication and so there's this idea that like the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2346.661,
    "end": 2367.095,
    "text": " the the the inner monologue comes first and then comes the communication of this inner monologue in the in in communication so we have this basic a that is once uh once more inherent in the the transmission view that we have our train of thought we are we have our our uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2368.736,
    "end": 2377.42,
    "text": " the inner speech that we have in our heads and then we translate this inner speech in overt speech that is then taken by somebody else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2377.821,
    "end": 2383.864,
    "text": "And I think that this gets the priority wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2384.444,
    "end": 2386.407,
    "text": " between outer speech and inner speech.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2386.447,
    "end": 2403.467,
    "text": "And there's been a lot of work in philosophy by, notably, Wilfrid Sellars and by others in psychology, like Vygotsky, who say that the first form of speech is overt speech that is then internalized",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2404.148,
    "end": 2433.328,
    "text": " in in that becomes like um that becomes inner but first in the beginning there's only overt speech a child that learns language does not have an inner speech there's only outer speech that is expressed directly the child speaks the child do things with his words in its environment and does not directly automatically as the uh corresponding inner monologue in its head and there's a process that's really interesting i think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2434.168,
    "end": 2457.74,
    "text": " that is uh that where the we see that beginning to happen where the child speaks to itself alone when there's nobody else around and so there's this transition where language is used in communicative interaction and at some point the child use a language alone and there's a question of why why does it do and and i think that our view of communication is really um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2458.38,
    "end": 2465.089,
    "text": " interestingly linked with views of inner monologue as self-queuing or self-regulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2465.489,
    "end": 2473.5,
    "text": "And so the child can auto-regulate its field of affordance when it's alone, when there's nobody else around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2474.02,
    "end": 2495.654,
    "text": " and in time this inner the outer uh uh for this outer monologue but alone monologue uh becomes overt because the the child learns to not necessarily produce the the the sound that correspond to the producing of these acts and there's there's this integration that's there's this internalization of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2496.534,
    "end": 2519.221,
    "text": " outer discourse that becomes inner discourse and there's a lot of cute anecdotes about that my nephew is uh i i have a nephew the son of my my sister and he's like when he's uh he's uh about to go to sleep he's in his bed and uh every night he's like rehearsing the events that happen in the day and he's saying like the the the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2519.841,
    "end": 2536.502,
    "text": " the comments that that he the the rules the norms that he heard in the day oh i don't have to do that i must do that and so it's like we are saying what happened in the day so that this outer monologue when he's alone in his bed is like the beginning of inner thought we're seeing his thoughts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2537.183,
    "end": 2558.028,
    "text": " uh out in the open and at some point this inner this outer monologue will become internalized and we we won't hear the his his thoughts uh out in the open but i think that's like the process that it takes and there's also the idea another point that we we for instance when we read usually we read",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2558.608,
    "end": 2573.369,
    "text": " uh silently so we we read what's written and we have the the corresponding inner monologue but it's known that in ancient times when people were reading usually they were reading automatically allow loud loudly and they it's it took a training",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2574.029,
    "end": 2577.272,
    "text": " in order to be able to read without speaking the words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2579.253,
    "end": 2587.56,
    "text": "So like in middle age, and I'm not perfectly sure if it's strictly accurate, we should verify it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2587.9,
    "end": 2590.062,
    "text": "But I believe that's true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2591.082,
    "end": 2592.083,
    "text": "It seems that I heard that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2592.143,
    "end": 2600.75,
    "text": "So it seems that first there's the outer monologue, the outer dialogue, and then there's the outer monologue, and then there's the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2601.25,
    "end": 2609.977,
    "text": " inner monologue that comes after that and I think that's more the true direction of priority between inner monologue and outer monologue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2614.481,
    "end": 2614.661,
    "text": "Luke?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2616.952,
    "end": 2621.534,
    "text": " So I just have a cute anecdote about learning to talk.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2621.554,
    "end": 2623.975,
    "text": "So I have two kids and they're super different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2624.755,
    "end": 2635.119,
    "text": "My son did as your nephew did, Remy, like would be in his crib talking to himself, talking to his stuffed animals and kind of recreating events, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2635.219,
    "end": 2636.199,
    "text": "In a similar way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2636.599,
    "end": 2637.92,
    "text": "He also babbled too.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2638.24,
    "end": 2646.246,
    "text": " a lot, like a lot, like just saying nothing from the time he was tiny and has an incredible vocabulary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2646.287,
    "end": 2649.109,
    "text": "I mean, now he's six, but people are like, wow, how old is this kid?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2649.149,
    "end": 2651.811,
    "text": "I mean, he's reading at three and just is like very, very verbal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2652.632,
    "end": 2655.394,
    "text": "And my daughter is super different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2655.794,
    "end": 2659.517,
    "text": "So she did not really babble, but she signed like crazy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2659.597,
    "end": 2661.078,
    "text": "And they both went to the same school.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2661.098,
    "end": 2661.879,
    "text": "They both teach them",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2662.259,
    "end": 2686.068,
    "text": " the same signs like to have say milk and cracker and cheese and you know bathroom and all the things right so so like they both went to the same daycare same niche environment and she picked up the signing much more than my son ever did he used maybe one or two signs she's like 20 like i had to go learn the signs and before she could sign she would just like stand in the kitchen and scream like just unable to communicate whatever it was that she wanted",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2686.768,
    "end": 2688.409,
    "text": " And it's so odd.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2688.549,
    "end": 2699.255,
    "text": "Like they're, they're, they're just like two totally different kids, but she, when she was learning Chinese, I had a parent teacher conference with the T and like, they've both been learning Chinese now they're in private school and they've been learning for like eight years.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2699.715,
    "end": 2707.94,
    "text": "So when she was first starting to learn, she wouldn't speak in class and the teacher and I had a conference and the teacher said like, I am, am concerned about your daughter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2707.96,
    "end": 2709.18,
    "text": "She doesn't participate in class.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2709.2,
    "end": 2710.521,
    "text": "Like she doesn't have to take Chinese.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2710.561,
    "end": 2711.442,
    "text": "It's not mandatory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2711.782,
    "end": 2714.563,
    "text": "If you wanted to put her in a different class or she could have a silent reading period.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2714.943,
    "end": 2715.484,
    "text": "And I was like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2716.324,
    "end": 2724.191,
    "text": " Oh, so it occurred to me, like, and I knew that she, and because she didn't babble and like, I would, somebody handed her a lollipop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2724.211,
    "end": 2726.673,
    "text": "She was like two and she, I said, say thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2726.733,
    "end": 2727.713,
    "text": "And she did the sign for it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2727.733,
    "end": 2734.499,
    "text": "But, but I mean, she really did not speak, like would not form clear words unless she knew she could say them perfectly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2735.259,
    "end": 2739.363,
    "text": "And so I sent her to tutoring with the Chinese tutor, like just twice, three times.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2739.803,
    "end": 2742.345,
    "text": "And then it began, like, so she was like listening.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2742.365,
    "end": 2743.286,
    "text": "Can I repeat this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2743.346,
    "end": 2744.487,
    "text": "Can I engage with this word?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2744.987,
    "end": 2758.904,
    "text": " correctly and and she just was very more much more careful in that but both kids as soon as they could talk talked in their sleep like crazy anyway there's my cute story nice stories",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2761.26,
    "end": 2767.943,
    "text": " The development of the self-cueing and self-speaking is very interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2768.763,
    "end": 2776.187,
    "text": "Even earlier on in behavioral analysis and behaviorism, like in B.F.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2776.207,
    "end": 2782.13,
    "text": "Skinner's work, there's extensive exploration of how covert behavior",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2783.03,
    "end": 2806.239,
    "text": " monologues and covert speech and societies of mind and then I guess more recently it's become better understood how electrical activity in the body and in the brain are still initiated during covert speech like it's not an audible speech but actually in various ways it still is embodied and then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2807.418,
    "end": 2835.338,
    "text": " this question of reading perhaps is another area where we're talking about in this language area what is similar or different with listening to speech participating in speech audibly is it different if it's read or Braille how does the modality and the media influence some of these things Dean",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2840.188,
    "end": 2857.568,
    "text": " Again, I think the proportions of two ears to one mouth is something that we need to kind of really hold on to in this idea of single source and monologue versus what potentially is a stereologue in a field of affordances as opposed to a single source.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2860.874,
    "end": 2875.281,
    "text": " I don't know why we've been given, I don't know what advantages are given by having an ability to hear in stereo, but they must be better than having a single ear or a single reception site.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2876.602,
    "end": 2878.383,
    "text": "And yet we don't have two mouths.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2879.043,
    "end": 2889.388,
    "text": "So again, I think it's understandable why from a transmission point of view, the deliverer standpoint, we always collapse back to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2890.521,
    "end": 2892.302,
    "text": " a source, a single source.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2892.642,
    "end": 2902.366,
    "text": "But if we flip that and now think about it from the receiving standpoint, how does that change our sense of what communication is?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2902.426,
    "end": 2908.808,
    "text": "Because it doesn't change if I cover one of my ears or if I have an earbud in and it cancels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2909.488,
    "end": 2914.43,
    "text": "And yet something fundamentally must change in terms of communication and the joint action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2914.93,
    "end": 2919.252,
    "text": "Even if it's monologue in my own head versus dialogue,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2919.642,
    "end": 2921.942,
    "text": " or trialogue or quadrilogue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2922.043,
    "end": 2928.624,
    "text": "Now, again, I haven't done any research to try to figure out what other people have done in terms of looking at that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2928.704,
    "end": 2943.807,
    "text": "But to your point, though, Renee, in terms of let's even get past transmission, we're trying to get past the idea of what is being delivered and trying to gain a deeper appreciation of what is being heard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2944.947,
    "end": 2948.308,
    "text": "So, Blue, I'll tell you a little story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2949.724,
    "end": 2950.904,
    "text": " I have a loquacious son.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2950.964,
    "end": 2952.045,
    "text": "He's in his 30s now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2952.625,
    "end": 2956.766,
    "text": "But he's actually, as he's gotten smarter and wiser, speaks less.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2957.787,
    "end": 2964.309,
    "text": "Like occasionally, he gets out of developing word salads that could serve an entire community.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2965.269,
    "end": 2967.43,
    "text": "And I find that really fascinating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2967.47,
    "end": 2968.791,
    "text": "I don't have to comment on it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2970.251,
    "end": 2975.753,
    "text": "It's just you notice that as people know more, maybe they sign more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2975.873,
    "end": 2978.194,
    "text": "Maybe they find other ways to communicate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2978.547,
    "end": 2982.309,
    "text": " to make their point and it goes back to that timing your take thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2983.349,
    "end": 2984.95,
    "text": "So, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2986.751,
    "end": 2987.031,
    "text": "Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2988.071,
    "end": 3003.918,
    "text": "There's so many references like the true way is the one that can't be spoken of or those who do, do and those who can't teach all these kinds of funny, you know, poking fun at different archetypes and so on and how that's related to wisdom.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3005.299,
    "end": 3007.3,
    "text": "The two ears and one mouth is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3009.076,
    "end": 3016.501,
    "text": " which you've been referencing throughout the conversations and the quadraphonic sound, quadrophenia, I'm sure it was amazing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3020.463,
    "end": 3034.913,
    "text": "It is true that the enrichment and the spatial nature of heard sounds, soundscapes, it's like something that can't be turned off",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3036.007,
    "end": 3040.23,
    "text": " Like the receiver, all of our receiving is bilateral.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3041.791,
    "end": 3051.058,
    "text": "Visual, nostrils and smell, proprioceptive is heavily multilateral, but it has a coarse bilateral symmetry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3051.679,
    "end": 3061.886,
    "text": "But the mouth, as our action states, needs generative cohesion, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3064.025,
    "end": 3064.425,
    "text": " Perhaps.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3064.745,
    "end": 3079.173,
    "text": "Just a just-so story, but I don't know of any cases where there are... Now, there are some bodily sounds that are bilateral, like perhaps the vibration of a cricket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3080.233,
    "end": 3084.175,
    "text": "So it's not that sound production can't be bilateral.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3085.996,
    "end": 3091.159,
    "text": "It's just that wherever sound production is localized on the sender,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3093.812,
    "end": 3099.415,
    "text": " When we highlight content and its transmission, where does that account begin?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3099.435,
    "end": 3103.477,
    "text": "It has to begin with the content and the representation in the sender.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3104.197,
    "end": 3111.401,
    "text": "And then you could ask whether it was fully or partially or deceptively recognized by the recipients, potentially.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3112.972,
    "end": 3134.785,
    "text": " when we censor the recipient's action but even calling them a recipient kind of puts them onto a back foot we're just centering the agent's engagement ecologically and they're interfacing with fields of affordances then we we do see that stereophonic enrichment of everything",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3135.959,
    "end": 3162.894,
    "text": " And no matter how narrow or how many Shannon bits or Kolmogorov bits, it doesn't really matter because it's going to be unpacked in a generative model that brings in aspects that aren't and don't need to be in the signal and hence aren't or don't need to be in our account of the signaling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3165.56,
    "end": 3171.143,
    "text": " Just think I'm trying to bring back the inference into the active inference here, because the active part is definitely the transmission piece.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3171.844,
    "end": 3175.006,
    "text": "So, you know, thank you for reinforcing that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3175.586,
    "end": 3188.654,
    "text": "But I do wonder when we do bring the inference back, why are our sensing affordances, are those bilateral forms?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3189.034,
    "end": 3191.875,
    "text": "There must be some advantage to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3192.296,
    "end": 3194.357,
    "text": "And so is it, as Blue pointed out,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3194.793,
    "end": 3199.518,
    "text": " because of as, not just the heavy emphasis on the of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3200.199,
    "end": 3202.721,
    "text": "What was the product of my transmission?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3203.262,
    "end": 3216.796,
    "text": "How am I pulling in this communication and what advantages are there to not getting strung out or hung up on the mono log, the single source?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3219.184,
    "end": 3230.792,
    "text": " One thing that makes me think about is in caricature disinfo representations of bug vision, insect vision, it will look like they're seeing many separate cells.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3232.253,
    "end": 3238.377,
    "text": "Whereas if one were just to take a breath and think about their own visual experience, we don't see two fields of view.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3239.177,
    "end": 3244.661,
    "text": "So it's like not really making sense why an insect would see multiple.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3245.381,
    "end": 3247.463,
    "text": "So the visual field,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3248.263,
    "end": 3270.217,
    "text": " because there's quote objects out there, we have all these different ways that we can talk about how we know that we're experiencing an integrated generative model, like the blind spot, the differences in visual acuity in the peripheral vision, color vision in the periphery, ocular motor saccades, and the way that attention is suppressed during saccading so that it's not causing us nausea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3270.637,
    "end": 3273.359,
    "text": "All these features are really important and they point",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3273.959,
    "end": 3297.354,
    "text": " beyond a photon transmission view a vision into this generative stereophonic vision and then in the audio setting having multiple oral uh orifices and also even covering them up like there's still transduction through the skull and so on um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3298.891,
    "end": 3305.078,
    "text": " We are also seeking to flesh out a generative model of sounds in our environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3306.039,
    "end": 3318.252,
    "text": "So if we cover our ears, that proprioception will help us understand that even if something sounds kind of quiet, we can recognize that it's still a loud noise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3319.435,
    "end": 3328.998,
    "text": " Or if we have one ear in a pillow, we could recognize that something is happening even though if it is being heard differently on both sides.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3332.099,
    "end": 3348.144,
    "text": "So having multiple sensors is very compatible with a unified generative model experience because it forces one to abstract beyond any sensor reading.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3349.085,
    "end": 3376.236,
    "text": " you have one midline thermometer then that's your point estimate for temperature or you could have like a gaussian blur like i'm just less confident about the temperature further from my one central sensor but maybe i'm maybe it's a tight gaussian maybe it's very broad but this is the best estimate why would i have any other estimate centered anywhere else when you have two thermometers",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3377.853,
    "end": 3405.283,
    "text": " now there's a generative modeling question about whether it's going to be a gaussian with a peak in the middle or whether you're going to have a peak more on one side and have it just go through the other depending on those sensor readings but at that point you're ending up with some distributions which if we think of that distribution as like what is experienced as like maybe the product of the sensing process that distributions enrichment is of a different type",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3407.176,
    "end": 3417.124,
    "text": " And yet of a different simplicity than any number of sensor readings in terms of what their raw information are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3418.144,
    "end": 3432.055,
    "text": "So it seems very relevant, this two ears, one mouth, not just for listening twice as much as we speak, but for listening twice as actively as we speak or something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3437.059,
    "end": 3438.521,
    "text": " What do you think about census, Remy?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3440.985,
    "end": 3444.39,
    "text": "Yeah, I think that you explained it well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3447.621,
    "end": 3464.815,
    "text": " Yeah, I think it's useful, as you said, to have multiple sensory channels that can be active because I think that's an argument from Howie in its book, in 2013 book on the predictive mind, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3465.416,
    "end": 3476.065,
    "text": "He says that if you have a tribunal and you're trying to establish, for instance, the culpability of the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3477.254,
    "end": 3501.351,
    "text": " of a convict you you you hope that you have multiple independent sources of information because if these sources of information are influence each other you have a less reliable uh how do you say uh i i forget the world uh timo in english so i i forget the word but you have a less reliable um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3504.396,
    "end": 3509.918,
    "text": " information about the case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3510.378,
    "end": 3517.92,
    "text": "So like it's useful from a reliability standpoint to have multiple independent source of information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3518.54,
    "end": 3528.283,
    "text": "So that may be an explanation of why we have, that may be an explanation of also the relative modularity of perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3528.343,
    "end": 3533.164,
    "text": "So there are, we know that there are great limits to that modularity, but there is a certain degree of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3533.704,
    "end": 3540.369,
    "text": " independence in the different sensory modalities that we have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3542.07,
    "end": 3560.482,
    "text": "So yeah, about the two here, obviously, I think maybe if we had, if our auditory sensory system was only devised to communicative interaction, maybe it would be okay to just have one here, one here, because we could like, we know who's talking to us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3560.602,
    "end": 3562.283,
    "text": "And so we can direct our,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3563.824,
    "end": 3580.86,
    "text": " our sensory apparatus toward this communicative signal, but because we use our ears not just to attune to a communicative interaction, but also to know what's in our surrounding, it's clearly more useful to have a great",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3582.982,
    "end": 3586.005,
    "text": " reception from information from anywhere around us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3586.085,
    "end": 3605.003,
    "text": "So maybe if the audition was only about communication, it would be okay to have just one ear, but because we want to know as precisely what's happening there and at the same time know what's happening there, maybe it has been more useful to have these two ears on both sides.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3605.023,
    "end": 3607.125,
    "text": "So maybe there's something about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3608.72,
    "end": 3619.146,
    "text": " Yeah, one short note, and then Dean, is there are also animals with anatomy so that they can direct their ears, which is seemingly very analogous to the ocular motor saccading.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3619.206,
    "end": 3623.569,
    "text": "It's like an audio saccade, and it just, the human form,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3623.849,
    "end": 3649.415,
    "text": " outside of the ear wiggling which is maybe slightly vestigial representation of that but we have opted for a strategy with fixed ear positioning but a mobile neck which also makes cicades so that's kind of our low speed audio um cicading dean yeah i think the only advantage i could see to having two mouths is that i could eat the french fries and drink the milkshake at the same time",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3650.097,
    "end": 3651.457,
    "text": " And I don't know what that would be like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3651.837,
    "end": 3653.938,
    "text": "It was just overpowering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3653.958,
    "end": 3664.58,
    "text": "But what I think is interesting in the dot one, Baloo brought up the idea of, so how do we make sure that there's a difference between content and context?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3664.64,
    "end": 3672.781,
    "text": "And I think whether it's two eyes, two ears, two nostrils, whatever, there must be some advantage to the form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3673.661,
    "end": 3677.402,
    "text": "Because as I said, even if you cover one of those intakes,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3678.355,
    "end": 3680.296,
    "text": " It's not just a redundancy issue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3680.456,
    "end": 3681.656,
    "text": "It's a recursion issue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3682.096,
    "end": 3689.239,
    "text": "It creates that ability to see context, hear context, and smell context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3689.359,
    "end": 3691.42,
    "text": "I don't believe we would have those things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3692.22,
    "end": 3697.642,
    "text": "And as I said, I think I'd get overwhelmed with context of having both French fries and milkshake.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3698.962,
    "end": 3699.983,
    "text": "It would just blow me up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3700.103,
    "end": 3701.803,
    "text": "So, but that's just...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3704.434,
    "end": 3705.755,
    "text": " That's it, that little self thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3705.935,
    "end": 3708.456,
    "text": "Do not give people too much, it can be overpowering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3709.677,
    "end": 3715.04,
    "text": "One aspect might return us to the question of compositionality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3716.541,
    "end": 3726.326,
    "text": "It seems like visual composition and temporal composition in music and in heard speech has...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3729.338,
    "end": 3737.193,
    "text": " speaking in terms of generative models, have highly factorizable or sparsely connected generative models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3738.305,
    "end": 3744.028,
    "text": " famously connected to like the where and the what streams in visual neuroanatomy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3744.068,
    "end": 3757.275,
    "text": "And that's been explored in some active inference papers with where-ness and what-ness as being factorizable in the generative model, because it really is the case that different where's can host different what's.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3757.715,
    "end": 3760.257,
    "text": "And so it makes sense to like have those two totally separate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3762.078,
    "end": 3764.879,
    "text": "Taste and smell, which are,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3767.27,
    "end": 3789.951,
    "text": " they're more mid-lined though there are two nostrils i'm not totally sure on on whether there's like you know one or two smell chambers or anything composition of chemical bouquets seems quite different like two paintings that you like next to each other or two songs in succession that you like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3792.328,
    "end": 3818.017,
    "text": " or it's a little bit different than two smells or tastes sequentially or composed um and so maybe these more uh sometimes called basal sensory or cognitive features are less effable and this kind of relates to a a a cognitive",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3819.435,
    "end": 3848.059,
    "text": " stack where verbal and symbolic communication is like the tip of the iceberg supported by biological processes that are differently or less effable and at first only pointed towards like through metaphors and speech butterflies in my stomach and so on but then ultimately entirely inexpressible",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3849.488,
    "end": 3861.377,
    "text": " maybe with some stop in between like being able to express through the body, like what it's like to do a certain bodily position or have a certain experience or be in a certain physiological state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3863.799,
    "end": 3871.986,
    "text": "And this kind of casts a light on the transmission view, complimenting the ecological view.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3872.606,
    "end": 3876.489,
    "text": "The transmission view is like down propagating the,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3877.501,
    "end": 3902.939,
    "text": " symbolic communication and seeking for that to apply all the way on down whereas a more bottom-up and arguably eco evo devo informed perspective is grounded in the ecological setting and then allows for the crystallization of symbolic processes",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3904.699,
    "end": 3910.926,
    "text": " including communicated symbolic processes, which aren't they supposed to be the stronghold of the transmission view?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3911.847,
    "end": 3924.08,
    "text": "But then if even that phenomena can be captured within an ecological frame, then there's an extremely strong basis",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3925.333,
    "end": 3951.399,
    "text": " for the the integrative cohesion of an ecological view as opposed to a extremely piecemeal and um question begging transmission view like we talked about semiosis and biosemiosis in livestream 47 so will we see um verbal communication and behavior",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3952.483,
    "end": 3978.332,
    "text": " as something that is enabled and with analogy but not the same as cellular transduction or are we going to seek a cellular transduction explanation based on verbal behavior let's return to some of our topics all right few areas to go blue any thoughts just anywhere you want",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3980.836,
    "end": 4003.646,
    "text": " Yeah, so I just wanted to follow up on what you said, and I just think that the beauty of the ecological approach to understanding communication is that communication between cells, be it semiotic representation or other, and between animals, maybe with gestures, maybe interspecies communication, like, you know, you tell your cat, come here, and the cat comes, or dog or whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4004.099,
    "end": 4012.762,
    "text": " So I think that the ability to model systems like all systems is very important.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4012.842,
    "end": 4029.268,
    "text": "Like if the transmission view is not capable of representing all of the situations from cell to cell communication to human to dog communication and all along the line, I think that maybe it's,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4030.603,
    "end": 4041.447,
    "text": " In the way that the FEP and active inference is scale-free and doesn't have, I mean, it's across any hierarchical, temporal, cognitive scale.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4042.167,
    "end": 4046.329,
    "text": "I think that the way that we view communication also needs to be broadly applicable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4052.932,
    "end": 4053.432,
    "text": " Yes, Remy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4054.532,
    "end": 4056.533,
    "text": "So yeah, that's the aim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4057.533,
    "end": 4077.718,
    "text": "But clearly, some people will say that sophisticated linguistic communication cannot be accounted for in terms of ecological communication because, as Daniel said, the symbolic communication characteristic of language",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4078.138,
    "end": 4084.083,
    "text": " seems to be too removed from the kind of basic interaction described by the ecological approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4084.283,
    "end": 4096.294,
    "text": "So there's a lot of work to be done still to really explain the high-level linguistic interactions that we have in terms of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4097.341,
    "end": 4099.584,
    "text": " of ecological inactive communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4099.964,
    "end": 4103.869,
    "text": "But yeah, there's another example of communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4105.411,
    "end": 4115.403,
    "text": "As you said, we can account maybe for communicative interaction between cells, but there's also, there's been work on communication between plants",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4116.764,
    "end": 4121.385,
    "text": " and how plants perceive their environment in terms of aphrodenses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4121.865,
    "end": 4122.886,
    "text": "There's been work on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4123.026,
    "end": 4131.168,
    "text": "And so I think that it's just to say that it's another way in which we can develop the ecological approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4132.608,
    "end": 4133.849,
    "text": "It seems that if we... Any...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4139.446,
    "end": 4156.862,
    "text": " any organism that behaves, so any organism will have a field of affordance and it seems that if it wants to act on other organisms in its environment, it will act in affecting its field of affordance and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4157.603,
    "end": 4174.675,
    "text": " it looks like the kind of communication that is at play between trees, for instance, which alerts each other about, for instance, the threats in the forest or sources of useful resources in the ground.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4174.956,
    "end": 4177.197,
    "text": "So these kinds of modifications of the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4183.118,
    "end": 4194.917,
    "text": " I don't know exactly the mechanisms by which these communications take place, but we can also see them as modifications of the field of affordances of trees.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4194.937,
    "end": 4197.621,
    "text": "So I think that when I saw that, I was really",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4198.522,
    "end": 4211.077,
    "text": " I thought it was really cool that the trees behaved at a really, really slower timescale, obviously, but like behave when they go and they send like their roots in certain directions and things like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4211.117,
    "end": 4217.364,
    "text": "We can see it as them exploring their environment and reacting to a field of affordance that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4218.806,
    "end": 4230.58,
    "text": " So obviously that's also controversial because there's all this debate about the cognitive states of plants and do they have consciousness or all that thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4230.64,
    "end": 4236.387,
    "text": "But I think that we can say that they probably have something like a field of affordance and it seems that they can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4237.689,
    "end": 4249.602,
    "text": " communicate with each other via these modifications of their field of affordance without us having to say that they are transmitting content, which would be really weird from the standpoint of a plant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4252.004,
    "end": 4252.265,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4254.136,
    "end": 4270.104,
    "text": " So just like if you haven't seen the plant robot created by the MIT Media Lab, like check it out because the plant, like they connected it to a set of wheels and a motor and literally will wheel itself back and forth from window to window, like searching for sunlight.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4270.504,
    "end": 4280.028,
    "text": "So, I mean, when you modify the field of affordances of a plant, it will take advantage of those affordances for movement or any other kind of thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4280.168,
    "end": 4282.63,
    "text": "And as to the complexity of...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4283.959,
    "end": 4286.522,
    "text": " linguistic communication, okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4286.882,
    "end": 4298.413,
    "text": "But also, the complexity of cellular communication, especially in developmental biology and all of the growth factors and signaling cues, and I mean, it's highly complex.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4298.573,
    "end": 4302.177,
    "text": "And the recombinatorial aspect is also incredibly crazy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4302.577,
    "end": 4307.462,
    "text": "I think it would take a lot to convince me that linguistic communication is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4308.05,
    "end": 4313.811,
    "text": " more sophisticated or more advanced than biological communication in a developing organism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4314.391,
    "end": 4315.231,
    "text": "I'm not sold on that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4318.032,
    "end": 4318.492,
    "text": "Thanks, Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4320.433,
    "end": 4329.214,
    "text": "Ruby, can you help me understand a little bit more about the influence piece in the joint action?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4330.214,
    "end": 4337.696,
    "text": "If I'm in Madrid, a lot of people who are trying to get my attention, I'm not very, I'm not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4338.191,
    "end": 4340.751,
    "text": " I don't speak Spanish very well, just barely get by.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4341.372,
    "end": 4349.493,
    "text": "And so a lot of times things are spoken to me and there seems to be a break in terms of the amount of sensing I get.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4350.173,
    "end": 4367.736,
    "text": "And so that joint action, could you maybe, especially in the light of that earlier part where you talked about young kids, it appears they're talking to themselves, but they're talking to the world and maybe they're not influencing the world, but they would",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4368.206,
    "end": 4368.666,
    "text": " like to?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4368.706,
    "end": 4372.289,
    "text": "Could you maybe talk about that sort of sensing side of that joint action?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4373.67,
    "end": 4382.976,
    "text": "Yeah, so I think that what kids that talk alone are doing, they're not, they learn to talk by talking to each other and affecting other persons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4383.236,
    "end": 4387.799,
    "text": "But when they learn to talk to each other, what they're doing, they're influencing themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4388.04,
    "end": 4390.281,
    "text": "I think that's the part about self-cuing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4390.321,
    "end": 4391.242,
    "text": "So what they're doing, they're",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4391.662,
    "end": 4397.625,
    "text": " they're modifying their own field of affordances with this inner speech.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4397.745,
    "end": 4407.77,
    "text": "And that's how they learn to self-cue and self-regulate themselves by bringing some images in mind or things like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4407.81,
    "end": 4415.233,
    "text": "So I think that's what happens when a child learns to speak alone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4416.474,
    "end": 4418.194,
    "text": "There's obviously a lot more to say about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4420.976,
    "end": 4438.526,
    "text": " So the question of different languages when you're in another country and you're spoken to and you're not understanding correctly, but you pick up some parts of what's said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4438.926,
    "end": 4440.007,
    "text": "So I think that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4442.368,
    "end": 4467.647,
    "text": " I think that the learning of a language is often understood as learning a code, so learning a set of associations between meanings and between forms that can be either written or spoken.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4468.127,
    "end": 4476.51,
    "text": " But I think that in the approach that we're advancing here, learning a language is really more like learning a skill.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4476.99,
    "end": 4485.734,
    "text": "So you're learning to speak and learning to understand and interact correctly in a given language as you're learning to do anything else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4485.774,
    "end": 4487.554,
    "text": "You're learning to play a game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4487.574,
    "end": 4492.016,
    "text": "You're learning to play hockey or play soccer or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4492.116,
    "end": 4497.038,
    "text": "It's the same kind of learning and you're learning to interact in that kind of game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4497.738,
    "end": 4507.082,
    "text": " And probably there's a similarity between various languages because there's a similarity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4509.564,
    "end": 4522.81,
    "text": "I could talk about Wittgenstein once again, but various languages resemble each other because they have this family resemblance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4523.21,
    "end": 4525.451,
    "text": "So because you have this familiarity with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4526.231,
    "end": 4551.722,
    "text": " speaking in a language even when you're in another place where you don't understand the language you have a basic grasp of some of the structures of the game that is being played and so from the context you can get understand some of the things that are said understand some of the things that are expected of you because you have this grasp of what a kind of game is played when we speak a language and so even if you're in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4553.303,
    "end": 4561.21,
    "text": " in another country when you don't speak the language from the context in which you find yourself, you may be able to piece some things together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4561.23,
    "end": 4573.32,
    "text": "Obviously, if you're like just in a place with absolutely no context, you're in a white room, completely empty, and somebody is talking to you, you have no context, probably you won't understand anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4573.38,
    "end": 4578.184,
    "text": "But if you're in a context where you can understand that some kinds of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4579.085,
    "end": 4599.671,
    "text": " of there's some some goals that are uh that are in place and some peoples around you are trying to achieve some goal you can apply your understanding of the game that you play in your own language to this new language and so you can get some things you can understand some things about what what's what you have to do and uh how you should behave and how you can respond",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4600.171,
    "end": 4615.585,
    "text": " but i think that that's a better way of understanding the kind of limited understanding that you have in these kind of of interactions rather than in you having a code of your language and then you try to apply this code in this you i think that that the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4616.386,
    "end": 4632.075,
    "text": " The idea of learning a skill, learning how to play a game is a better analogy to understanding how you come to learn a language and how you come to apply this knowledge in other contexts where the language that is spoken is not the same that you're mastering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4632.615,
    "end": 4635.617,
    "text": "Does that kind of confirm that it couldn't be content first?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4637.218,
    "end": 4640.36,
    "text": "That it would have to be context bound?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4642.918,
    "end": 4667.094,
    "text": " yeah in my view the the the context is a central element in uh in in any communicative interaction in any cooperative communicative interaction i think it's the in the context what what i i call the context in the paper appears as a shared field of affordance so that that's the the affordance that are present in the in the the the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4667.714,
    "end": 4684.035,
    "text": " in the the environmental context in which you find yourself in with the other person and that that's that's this element that often pre-exists the communicative interaction is a great great source of constraint on the the communicative interaction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4684.455,
    "end": 4713.855,
    "text": " so yeah when you when you're you you come to speak with somebody you're almost never like in a absolutely context-free uh place you're always in a restaurant in uh in i don't know in the bus in in uh in at the grocery store you're somewhere and there's this basic set of affordances that are shared that you understand that you can do this you cannot do that and this this set of constraint offered by this shared field of affordances really drives and constrains how",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4714.495,
    "end": 4716.637,
    "text": " the communicative interaction will unfold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4716.997,
    "end": 4740.651,
    "text": "So I think that even if you're in another country, often the context will be hard to pick up, but sometimes there will be shared context that you can get a grasp on and that you can, that can favor, that can lead to a, sorry, I'm losing my words, that can lead to an interaction that is optimal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4744.645,
    "end": 4754.077,
    "text": " i i brought it in the uh physical rosetta stone as a special case of of low context asynchronous communication",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4755.262,
    "end": 4779.249,
    "text": " One can imagine there would be a million different contexts by which the analysis of the stone could have been accelerated, such as a person reading any of them, the rules or descriptions being enacted, or a labeled image, or any number of contexts that we would use to interpret and act upon the texts that we read",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4780.169,
    "end": 4796.231,
    "text": " in this setting where we were historically removed from the creation then there still was residual context and it turned out that that was enough to interpret the symbolic materials",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4797.386,
    "end": 4811.456,
    "text": " But this is not like the base communication case that we then need to see all communication and all learning and education of languages and active inference ontology as being like a Rosetta Stone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4812.316,
    "end": 4816.159,
    "text": "Like the definitions of words are not codes to crack.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4817.06,
    "end": 4822.543,
    "text": "They're like inside jokes or ways of communicating on a sports team",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4823.484,
    "end": 4825.665,
    "text": " that have to do with the context of the setting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4826.525,
    "end": 4850.032,
    "text": "And asynchronous modifications in the environment, especially symbolic asynchronous modifications, which are relatively new, potentially existing in their modern form for several hundreds to several thousands of years, depending on how we think about it, symbolic asynchronous modification",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4851.431,
    "end": 4877.672,
    "text": " is a low context communication whereas even the interpretant of asynchronous symbolic communication still uses and embodies their context in the perception so we know that we have stereophonic communication just because we're stereophonic even if we are getting just a morse code symbol um but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4879.105,
    "end": 4905.761,
    "text": " It is a non-controversial here, but interestingly, it sounds like elsewhere that we would want to think about communication broadly as being action-oriented and embedded rather than kind of like reverse-engineered from the kinds of artifacts that we have today with quite literally computer codes and other kinds of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4907.281,
    "end": 4909.402,
    "text": " you know, Turing computers and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4909.422,
    "end": 4913.785,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4915.807,
    "end": 4923.352,
    "text": "I think that you often explain the ideas that I'm trying to convey really better than me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4924.292,
    "end": 4931.297,
    "text": "Daniel, I'm not really fluent in English, so thank you for explaining better than me the ideas that I'm trying to say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4932.798,
    "end": 4933.178,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4933.198,
    "end": 4935.0,
    "text": "I appreciate it, and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4936.144,
    "end": 4939.126,
    "text": " You wrote the paper, and so it's unsurprising.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4939.186,
    "end": 4943.408,
    "text": "It seems novel, and I couldn't say it in any other way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4944.668,
    "end": 4949.011,
    "text": "Even when you speak English, Daniel can still speak better than you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4949.071,
    "end": 4953.573,
    "text": "Communicate more effectively the ideas that you're trying to convey, even when English is your first language.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4955.034,
    "end": 4964.459,
    "text": "Well, context is non-fungible, so I don't think that there can be a best or a final communication.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4965.535,
    "end": 4992.542,
    "text": " it's just like a best or a final species or state for an ecosystem to be in and i guess in the last 25 minutes or however now that our ecosystem has been modified however it has been in these conversations and through reading and opening up threads uh how will it",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4994.099,
    "end": 5001.322,
    "text": " shape our field of affordances and how will we stream and play differently?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5001.822,
    "end": 5002.083,
    "text": "Dean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5003.623,
    "end": 5013.308,
    "text": "So I'm curious from all, from all three of you, um, as a strategy, um, if you want to get past monologue, what do you do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5013.388,
    "end": 5016.849,
    "text": "How many times do you play playing played?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5017.089,
    "end": 5020.651,
    "text": "So as an example of like a real pertinent one right now,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5021.848,
    "end": 5035.256,
    "text": " the way that the live streams have been set up have always been sort of a pre-brief, an introduction with the authors or a play, and then a play, a debrief piece to this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5035.756,
    "end": 5040.298,
    "text": "And so the communication is never left as a one-off exercise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5041.579,
    "end": 5042.64,
    "text": "I just read the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5042.78,
    "end": 5050.304,
    "text": "There is affordances set up to interact with information, to be able to receive it,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5052.221,
    "end": 5079.178,
    "text": " at multiple different time points because I think in the dot one you said we could look at it as slices of time but that's probably not accurate in terms of the dynamic that's in play so one of the things the Active Inference Institute also does is has a textbook group now I've not been a part of the textbook group and I don't know whether they do it in sets of three as well to create that kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5079.628,
    "end": 5089.016,
    "text": " triangulation so that it the interaction that the communication doesn't become monolithic, or monistic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5089.856,
    "end": 5099.544,
    "text": "Or here, here's here's the words that have come down now off the mount, accept them and start, start carrying them out, even though you don't have a context, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5100.024,
    "end": 5106.75,
    "text": "That chiseling them into the stone doesn't increase their priority, at least if you don't have the context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5106.85,
    "end": 5106.99,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5107.85,
    "end": 5125.16,
    "text": " What I'm curious about from the three of you is, if you want to get past instructionalism in terms, or if you want to get past transmission, is there a basic requirement to have multiple reinterpretations, or at least the opportunity to reinterpret?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5125.421,
    "end": 5135.927,
    "text": "Like, from a communication standpoint, must we have reflection and time for that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5135.947,
    "end": 5137.608,
    "text": "Do we have to have time built in for that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5138.087,
    "end": 5142.709,
    "text": " Or are we, are we then bound to a transmitted state only?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5145.55,
    "end": 5146.371,
    "text": "Anybody can answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5147.411,
    "end": 5147.631,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5147.711,
    "end": 5148.172,
    "text": "Blue first.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5150.813,
    "end": 5162.258,
    "text": "So, so not like in the way that we have reflection, like we have a pre-brief and then the actual brief and then, and then the reflection time in the live stream series.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5162.768,
    "end": 5175.301,
    "text": " So not in that way, but I do think that in effective communication, there is like reflection as an essential component of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5175.922,
    "end": 5178.144,
    "text": "Like communication, when you have a conversation,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5179.125,
    "end": 5183.667,
    "text": " It shouldn't be about just waiting for your turn to talk, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5183.947,
    "end": 5190.25,
    "text": "I mean, there should be some reflection of what the other person is saying in what you're saying back to them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5190.591,
    "end": 5192.832,
    "text": "Like, hello, how are you doing today?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5192.852,
    "end": 5194.112,
    "text": "I want scrambled eggs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5194.292,
    "end": 5199.715,
    "text": "Like, if that was a conversation, it wouldn't work, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5199.735,
    "end": 5203.837,
    "text": "So there has to be some element of reflecting back what the other person is saying to you, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5204.597,
    "end": 5206.319,
    "text": " in communication that's effective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5206.359,
    "end": 5211.284,
    "text": "It's not just this tower of disjointed blocks being built.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5214.066,
    "end": 5214.527,
    "text": "Yes, Remy?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5215.868,
    "end": 5219.813,
    "text": " Yeah, I think that what you said, Blue, is interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5220.653,
    "end": 5231.145,
    "text": "A really important element of cooperative communication is that when you're talking to somebody, when you're in a dialogue, you have to concede a part of your autonomy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5231.526,
    "end": 5235.77,
    "text": "You have to accept to be regulated by the other person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5235.89,
    "end": 5236.831,
    "text": "And that's, I think...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5237.812,
    "end": 5267.072,
    "text": " where some people who like talk past each other and don't listen to each other and interact it happens really often some friends talk talk like it seems like when when they're waiting they're just waiting when they're listening they're just waiting to say what they want to say so these people don't like don't respect the kind of pragmatic principle of like you you have to to pay attention to what the other person is saying and to have a proper to have a correct communicative interaction you have to concede",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5269.372,
    "end": 5274.213,
    "text": " You have to accept that your field of affordance is regulated by the person who's talking to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5274.233,
    "end": 5288.636,
    "text": "You have to let yourself be influenced, be constrained by the person who's talking to you just because you have to listen to it and you have to refrain from turning away and go do something else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5288.696,
    "end": 5291.977,
    "text": "You have to... It's really just...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5292.777,
    "end": 5317.184,
    "text": " accepting considering a part of your autonomy and that's another idea from Di Paolo as an active approach of language where like there's in communicative interact in inter any cooperative interaction but in communicative interaction in particular you have to like inhibit a part of your field of affordance to participate in this interaction and listen because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5317.984,
    "end": 5339.79,
    "text": " suppose that what i'm saying is really boring to you and you just want to go eat your piece of cake in the in the fridge like you have to in order to participate to uh maintain the the the interaction you have to inhibit this this afford this solicitation and to uh to to let me regulate your your your field of affordance and so there's this part of like i concede",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5340.33,
    "end": 5343.133,
    "text": " I concede something in order to maintain the interaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5343.233,
    "end": 5356.705,
    "text": "And when there is no more interest or I'm not able to, I don't want to be regulated and there's another solicitation outside the interaction that's more interesting to me, then I will leave the interaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5356.785,
    "end": 5360.128,
    "text": "But to maintain the interaction, you have to have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5363.11,
    "end": 5373.937,
    "text": " capacity of inhibition and executive some form of what would be called executive control to be able to listen and take what the person is saying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5374.037,
    "end": 5384.103,
    "text": "If you don't have that, you're just going to think about something else and not let yourself be constrained by the communicative acts of the other person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5384.123,
    "end": 5390.027,
    "text": "So,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5392.011,
    "end": 5400.578,
    "text": " Back to Dean's point about multi-part and multi-player communication and engagement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5401.839,
    "end": 5411.127,
    "text": "When we only have one communication, then it can feel like a transmission, like the Rosetta Stone transmitted from the past.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5411.268,
    "end": 5415.251,
    "text": "We don't get a .2 or a .1 on the Rosetta Stone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5417.673,
    "end": 5418.434,
    "text": "Structuring...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5420.41,
    "end": 5437.755,
    "text": " learning groups and other activities and relationships and cooperative communication as something unfolding, bumping into each other twice says something about those particles that bumping together just once",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5439.819,
    "end": 5441.62,
    "text": " It's almost like, what do they say?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5441.98,
    "end": 5442.9,
    "text": "Once is an accident.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5443.74,
    "end": 5444.78,
    "text": "Twice is a coincidence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5445.461,
    "end": 5449.942,
    "text": "Three times is a party or something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5450.662,
    "end": 5462.725,
    "text": "So especially with three, because one, two, three, there may be enough of a recurrent engagement and interweaving between",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5463.376,
    "end": 5475.86,
    "text": " to support reflection, development, to de-emphasize any single of those events because none of them are even half of the total series of three.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5476.64,
    "end": 5486.703,
    "text": "So none of them can even be said to be a plurality or a majority if the dot zero, one, and two were to vote, to vote one of them out or something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5487.824,
    "end": 5490.665,
    "text": "And I think it does point towards",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5491.849,
    "end": 5503.536,
    "text": " the reality of our continued interaction with materials and then towards structures that allow us to engage naturally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5504.416,
    "end": 5504.676,
    "text": "Remy?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5509.359,
    "end": 5518.705,
    "text": "I think that what communicating repetitively with the same people, what it achieves, it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5519.682,
    "end": 5522.444,
    "text": " it obviously shapes the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5522.524,
    "end": 5524.645,
    "text": "It aligns them in some ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5524.745,
    "end": 5530.449,
    "text": "So we come to share expectations and share fields of our dances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5531.63,
    "end": 5545.819,
    "text": "So it clearly eases communicative interaction because we don't have to communicate as much when there's this trade-off between if you have a lot of shared context, you don't have to communicate as much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5545.879,
    "end": 5548.921,
    "text": "And if you don't have a lot of shared context, you have to communicate more too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5549.821,
    "end": 5557.523,
    "text": " to have a useful interaction, to have a productive interaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5557.943,
    "end": 5569.646,
    "text": "And so what I think we have done is we have aligned our generative models in ways that helps us understand each other better than we did at the beginning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5571.386,
    "end": 5575.067,
    "text": " For instance, we can refer to things that we said in the past.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5575.087,
    "end": 5579.728,
    "text": "We can say, oh, when you said that, so I think that's relevant now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5579.788,
    "end": 5586.51,
    "text": "And so we can point to relations to things that we said earlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5586.57,
    "end": 5592.071,
    "text": "So there's this continual easing of communication",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5592.791,
    "end": 5614.36,
    "text": " when you have repetitive communicative interaction with somebody, that I think is why we can come to believe that people we're living with, we can read each other's mind without talking because there's so much shared context that something can happen and it can make us think something that is shared without us even saying anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5614.44,
    "end": 5619.082,
    "text": "So there's this context come to be really complex and really...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5620.382,
    "end": 5638.568,
    "text": " really deep and so yeah interacting repetitively obviously eases the communication okay so we can meet multiple times do preparation engagement and reflection",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5640.014,
    "end": 5649.44,
    "text": " before, during, and after a communication and structure communication so that there are multiple such kind of peaks and troughs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5650.8,
    "end": 5665.189,
    "text": "We can talk about aligning or synchronizing in the general synchrony sense, not making identical, but rather coordinating our generative models through perception and learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5667.102,
    "end": 5670.604,
    "text": " As you mentioned, it helps us understand each other better.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5671.345,
    "end": 5674.266,
    "text": "Like a goal of a communication could be epistemic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5675.067,
    "end": 5676.227,
    "text": "Let's get to know each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5677.728,
    "end": 5682.251,
    "text": "And it could also have an element of pragmatic value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5682.411,
    "end": 5686.774,
    "text": "Like let's take epistemic action to find out if a collaboration is relevant here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5687.574,
    "end": 5690.936,
    "text": "And then we're going to engage in these pragmatic actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5692.157,
    "end": 5692.337,
    "text": "Remy?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5694.372,
    "end": 5718.911,
    "text": " yeah and i think that a lot of interaction that we share in our like academic and highly linguistic and advanced societies really often look like transmission interaction so we are saying things that we're thinking to each other but i think that these epistemic or communicative um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5719.691,
    "end": 5735.537,
    "text": " in terms of transmission these communicative transmission interactions are are the way they are because they are explicit aims of the interaction in which we're engaged that is we're transmitting content now when we're talking to each other because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5737.077,
    "end": 5739.698,
    "text": " In a way, that's the goal of the interaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5740.238,
    "end": 5751.942,
    "text": "But in other contexts, it's because we have communicative practices that we have developed that we can have these goals that can drive an interaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5753.523,
    "end": 5758.065,
    "text": " If we're at the grocery store, if we're in another context, we're doing something else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5758.105,
    "end": 5772.234,
    "text": "But when we're in academic contexts, often the goal of the interactions is talking about ideas, transmitting some contents, transmitting some theories, for instance, explaining theories, explaining arguments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5772.714,
    "end": 5779.539,
    "text": " And so these interactions, we look at them and we're like, oh, that's clearly there's, we're transmitting content when we're talking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5779.879,
    "end": 5787.725,
    "text": "But the idea is that this is really a small subset of the cases of communicative interaction that we engage in in everyday life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5788.285,
    "end": 5795.951,
    "text": "And we take these as paradigmatic cases of communicative interaction when they are really",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5797.326,
    "end": 5801.67,
    "text": " the pinnacle of the linguistic civilization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5801.73,
    "end": 5813.199,
    "text": "We're in a really rarefied context where academic discussions are not what we do in everyday settings when we talk to each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5813.759,
    "end": 5822.006,
    "text": "And we do this because it's an explicit aim of our interaction now that we do this, but in other cases,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5824.31,
    "end": 5831.734,
    "text": " In most cases, when we speak to each other, the explicit aim is not to transfer some information or talk about theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5831.774,
    "end": 5833.894,
    "text": "It's about doing things together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5834.295,
    "end": 5836.476,
    "text": "And now we're doing something together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5836.536,
    "end": 5838.096,
    "text": "We're talking about active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5838.596,
    "end": 5845.66,
    "text": "But it looks as if it can be understood in terms of content sharing and content transmission.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5845.7,
    "end": 5848.941,
    "text": "But that's because it's the goal of our interaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5849.001,
    "end": 5851.182,
    "text": "It's not because it's the nature of communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5854.079,
    "end": 5855.78,
    "text": " I don't know if I'm being clear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5855.8,
    "end": 5856.92,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5856.94,
    "end": 5859.701,
    "text": "Dean, you had your hand raised.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5860.721,
    "end": 5870.404,
    "text": "Well, I just, I think I don't want to put my philosopher's cap on, but I will just briefly, I think we use language and communication to save time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5870.484,
    "end": 5872.205,
    "text": "It's an exploitation strategy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5873.185,
    "end": 5879.527,
    "text": "And so I think when we put a 13 week set of parentheses around a learning moment or opportunity,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5880.296,
    "end": 5883.097,
    "text": " we oftentimes get the cart ahead of the horse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5883.337,
    "end": 5888.678,
    "text": "We don't see the pragmatics because we're busy transmitting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5890.098,
    "end": 5902.061,
    "text": "And what ends up happening is the plan forward, that affordance, that exploitation or optimization or savings of time jumps ahead of the prep, the participate and the permeate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5902.261,
    "end": 5908.742,
    "text": "Now we can say that's a luxury, but if we don't respect the fact that people",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5909.756,
    "end": 5921.458,
    "text": " maybe don't necessarily learn as well when they're handed the plan as opposed to given an opportunity to build one or form one themselves through preparation, participation, and permeation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5921.898,
    "end": 5931.82,
    "text": "We could go away from this live stream and each of us could literally now design a better plan as opposed to Remy came to us with a plan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5931.86,
    "end": 5934.52,
    "text": "No, what Remy came to us with was a sketch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5936.341,
    "end": 5938.561,
    "text": "And then we prepped",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5939.349,
    "end": 5941.61,
    "text": " participated and permeated that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5941.71,
    "end": 5955.737,
    "text": "Now, the sophistication of whatever comes out of that in terms of a go forward move for each one of us is orders of magnitude greater because somebody didn't say, oh, well, I've only got 13 weeks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5955.817,
    "end": 5959.379,
    "text": "I don't have the luxury to be able to be pragmatic about this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5960.579,
    "end": 5962.9,
    "text": "So there, I'll take my hat off again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5962.961,
    "end": 5967.943,
    "text": "I don't mean to sermonize, but I think when we actually feel what it's like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5968.922,
    "end": 5980.627,
    "text": " to let the plan naturally evolve and become a part of the ecology as opposed to driving the ecology, the single source, it changes everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5981.487,
    "end": 5988.63,
    "text": "And over and over again, every time we have one of these three set live streams, it reinforces what you could do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5988.67,
    "end": 5993.732,
    "text": "And again, you don't even have to be on the Zoom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5994.733,
    "end": 5996.954,
    "text": "As long as you give over the amount of time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5997.884,
    "end": 6012.574,
    "text": " to see and sense what it's like to prep, participate, and I think the most important one of all, stick around for the permeate because that's where the real nuggets seem to Daniel's metaphor of icebergs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6013.675,
    "end": 6018.238,
    "text": "Things float to the surface when you give it enough time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6018.278,
    "end": 6026.504,
    "text": "But I understand there's also the 13-week window and I'm paying thousands of dollars to sit in your class and come on,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6027.797,
    "end": 6056.245,
    "text": " exploit the daylight side of your communication and i just don't know that people don't realize that they're cutting off their noses despite their their learning so interesting a lot there uh permeation letting it pervade our generative model or uh percolate letting those messages be passed",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6057.29,
    "end": 6084.872,
    "text": " letting that ripple or the perturbation take effect at slower and deeper levels and it is really a challenge when the logistical and transmission aspects of communication are scaffolded and those are like the metadata fields that have to be filled out the boxes that have to be checked",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6086.005,
    "end": 6097.273,
    "text": " and they can feel constraining, yet simply removing them is not a positive solution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6098.173,
    "end": 6104.798,
    "text": "And so the path of least action for many learning scenarios is to replicate the prior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6107.32,
    "end": 6112.083,
    "text": "Over the decades, a professor who might teach the same class in the same way",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6114.144,
    "end": 6116.366,
    "text": " And there's pros and cons to that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6117.367,
    "end": 6130.8,
    "text": "In fact, some of the most enlivened learning communities have like a vibrancy that transcends an almost ironically static learning experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6131.735,
    "end": 6133.435,
    "text": " Like we all read this thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6133.495,
    "end": 6152.541,
    "text": "So it's not that I think the mode of communication and cooperation and education that we're exploring here means that every single experience is going to be like some kind of full attention transformative depth psychology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6153.701,
    "end": 6160.943,
    "text": "I think it would feel more normal and natural and just like participating in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6162.614,
    "end": 6192.397,
    "text": " a cool ecosystem that works with that individual's situation what else can we add or where can we go where is active inference in all of this where do you see active inference um not like you know",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6194.116,
    "end": 6216.093,
    "text": " are your intentions with my child but um where is active inference in your further research agenda remy i think it gives the um the like uh all-encompassing framework and um yeah the the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6221.166,
    "end": 6236.619,
    "text": " the abstractness of the framework allows us to apply it to, as we said, communication between cells and communication between countries or groups of individuals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6237.019,
    "end": 6243.204,
    "text": "This multi-scale property of active inference I think is really useful in the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6244.446,
    "end": 6255.757,
    "text": " in allowing us to describe communicative interaction between these various kinds of free energy minimizing agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6255.777,
    "end": 6259.26,
    "text": "So that's useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6259.32,
    "end": 6259.841,
    "text": "I think that the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6265.936,
    "end": 6288.323,
    "text": " Yeah, the learning mechanisms that are at work in active inference are really useful also to explain how communicative interaction is conducted and how repeated communicative interaction can lead to a form of synchronizing of the generative model as has been explored by Vassil.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6288.903,
    "end": 6291.785,
    "text": " in a paper in 2020, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6292.185,
    "end": 6294.687,
    "text": "So I think that's really useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6295.667,
    "end": 6301.971,
    "text": "There's a lot of things that I think we can take from the Active Inference Framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6304.853,
    "end": 6325.493,
    "text": " the the idea that all actually i think the fundamental intuition is that all all action is uh free energy minimization that that's trivial that that's uh but i think there's a pragmatist uh insight in inactive inference that we can use to um to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6327.655,
    "end": 6333.058,
    "text": " to support the pragmatist view of communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6333.839,
    "end": 6337.481,
    "text": "Everything that an organism does, it does it to minimize its free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6337.941,
    "end": 6339.702,
    "text": "And active inference is no different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6340.563,
    "end": 6348.368,
    "text": "And communicative active inference as a form of active inference also aims to minimize the free energy of an organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6349.008,
    "end": 6354.372,
    "text": "And so when an organism finds itself in a situation where it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6355.453,
    "end": 6367.604,
    "text": " there's a lot of free energy, there's a lot of error prediction, it will try to engage it in its environment, intervene its environment in order to bring itself back in its viable states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6368.104,
    "end": 6369.386,
    "text": "And so all these ideas",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6370.086,
    "end": 6393.974,
    "text": " when we apply them to communication i think they lead not necessarily by implication but i think they there's a a path to these ideas through the the to the the pragmatic view of communication the idea that that communication is another form of uh it's just a mechanism of regulation uh of organisms in order to minimize their free energy i think there's this kind of basic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6394.934,
    "end": 6410.685,
    "text": " biological understanding of the behavior of organism, I think it leads us more toward the pragmatist view of communication rather than toward the more informational or transmission view that is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6411.806,
    "end": 6419.754,
    "text": " that is more at home in our really highly advanced and complex linguistic interaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6419.834,
    "end": 6428.964,
    "text": "And I think that this basic biological framework is a good place to start to understand communication in the pragmatist view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6432.348,
    "end": 6434.19,
    "text": "Very nice answer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6435.419,
    "end": 6443.163,
    "text": " I'll read a comment from Steven and then we can give a thought on it as well as provide some closing thoughts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6444.044,
    "end": 6449.927,
    "text": "So Steven wrote, explicit aims of interaction are important and can be invisible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6450.287,
    "end": 6452.768,
    "text": "Thus communication appears to be based on transmission.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6453.328,
    "end": 6460.092,
    "text": "Should we identify the context through the affordances or via naming the water, like the water we swim in?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6461.052,
    "end": 6461.413,
    "text": "That is...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6462.634,
    "end": 6472.6,
    "text": " Is the context and the explicit aims apparent via the affordances, or is there a special sauce that flavors the cultural waters in which we are swimming?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6480.305,
    "end": 6481.706,
    "text": "Yes, Dean, special sauce, Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6481.846,
    "end": 6482.527,
    "text": "Real quick on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6482.607,
    "end": 6484.268,
    "text": "I think what maybe...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6484.893,
    "end": 6494.92,
    "text": " to build on what Remy just said, I think that perhaps active inference opens up that space to the idea of a special sauce.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6495.0,
    "end": 6499.143,
    "text": "It doesn't guarantee that there will be one, and it certainly doesn't promise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6500.604,
    "end": 6506.729,
    "text": "But what it does do is it says, what are the possibilities within this, not just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6507.321,
    "end": 6508.802,
    "text": " What are we collapsing down to?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6509.342,
    "end": 6517.705,
    "text": "I mean, throughout this series, I've been talking a lot about, well, we can't leave the absolutes, the things that we've experienced out of this equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6518.165,
    "end": 6533.95,
    "text": "But I think what I think the act of inference affords is that those relativities, those entailments and those entanglements always to be determined can be moved towards and maybe accepted",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6534.918,
    "end": 6538.719,
    "text": " with more abundance if we use active influence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6538.799,
    "end": 6541.36,
    "text": "But that's just my optimistic take on it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6544.501,
    "end": 6549.323,
    "text": "Do you have any other closing words before we hear some final thoughts from the others?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6552.964,
    "end": 6553.364,
    "text": "Excellent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6553.544,
    "end": 6553.844,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6554.844,
    "end": 6562.647,
    "text": "Blue or Remy, with some final thoughts, how will it permeate with you?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6567.426,
    "end": 6568.446,
    "text": " Okay, so I'll go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6568.766,
    "end": 6575.268,
    "text": "So yeah, I was really happy to have the chance to talk about the paper with you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6575.288,
    "end": 6586.211,
    "text": "I think that one of the most important things that I'll take home is that now I have a really salient solicitation to go see the plant robot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6587.671,
    "end": 6615.215,
    "text": " in action so like at the second that i close the zoom meeting i'm going to go see that that's really something that i i'm taking from the this discussion uh but yeah no it was really interesting to see different perspectives different backgrounds uh what what these different differing backgrounds can bring uh to a discussion uh that is uh i think that was really uh enlightening",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6615.755,
    "end": 6618.436,
    "text": " for me and I was really happy to be there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6618.536,
    "end": 6636.621,
    "text": "I'll just say thanks for coming Remy, we really enjoyed this discussion and for me I think what will permeate is like the you know everything I think about now I just like think about how can I model this in terms of active inference and I feel like this paper will",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6638.287,
    "end": 6648.614,
    "text": " you know, influence maybe the way that I think about communication, which is a big part of modeling active inference period, especially like in a multi-agent dynamical system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6648.674,
    "end": 6656.378,
    "text": "So I think I will probably leverage this ecological approach in the way that I think about it going forward.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6656.498,
    "end": 6658.86,
    "text": "So I appreciate the opportunity to learn about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6661.001,
    "end": 6661.321,
    "text": "Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6662.042,
    "end": 6666.064,
    "text": "My closing thought, what I'm left with here is I,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6667.282,
    "end": 6685.371,
    "text": " active inference as about affordances it is about the the content of the model is about affordances and active inference is an affordance it allows us to realize epistemic and pragmatic value today and in the future",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6686.639,
    "end": 6707.97,
    "text": " and in that way we can see it as gripper and gripped just like we could talk about the hand as gripper and gripped whether it's holding hands or grabbing an object and especially in this dot too some very nice points added on language as gripper and gripped",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6709.014,
    "end": 6730.033,
    "text": " and contextualizing this kind of breakaway verbal community of research and scholarly education and academia and recognizing that breakaway community and skill as something that's crystallizing out of a much more inclusive and pragmatically oriented niche.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6730.814,
    "end": 6745.94,
    "text": " And I think that will be a win-win framing because it will help ground what can be abstract and lofty discussions and also elevate and bring attention",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6749.381,
    "end": 6765.013,
    "text": " and support to some areas and types of communication that are absolutely natural in the field of affordance view and the ecological view but are not always respected so highly under like a symbolic transmission view and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6765.794,
    "end": 6768.896,
    "text": " The closing image for me is making the sauce underwater.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6769.676,
    "end": 6780.943,
    "text": "I'm just imagining it's like, I don't know, SpongeBob SquarePants or someone's trying to cook and make the sauce, but we're adding things and it's more just like happening in this diffusive space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6781.804,
    "end": 6784.485,
    "text": "And in a way, all kitchens are in fluids.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6785.066,
    "end": 6791.249,
    "text": "That's why we can smell what we're cooking, but it's different enough that the sauce stays in the pan",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6792.35,
    "end": 6799.154,
    "text": " And I think the social inaction of active inference is when the sauce is spilling out of the pan.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6802.016,
    "end": 6802.296,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6803.397,
    "end": 6805.318,
    "text": "Remy, you're always welcome back.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6805.358,
    "end": 6808.94,
    "text": "So hopefully you'll share some developments in this line.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6808.98,
    "end": 6810.341,
    "text": "Good luck with the rest of your work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6811.842,
    "end": 6812.142,
    "text": "Thanks, all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6812.222,
    "end": 6813.463,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6813.803,
    "end": 6814.103,
    "text": "Farewell.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6814.123,
    "end": 6815.784,
    "text": "Bye.",
    "speaker": "SPEAKER_04"
  }
]