[
  {
    "start": 29.744,
    "end": 50.89,
    "text": " all right welcome everyone it is september 7th 2022 we're here in actin live stream number 48.1 in the second discussion on the paper communication as socially extended active inference and ecological approach to communicative behavior welcome to the active inference institute",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 52.393,
    "end": 58.456,
    "text": " We are a participatory online institute that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 59.256,
    "end": 64.678,
    "text": "This is a recorded and an archived livestream, so please provide us with feedback so we can improve our work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 65.658,
    "end": 71.2,
    "text": "All backgrounds and perspectives are welcome, and we'll be following video etiquette for livestream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 72.961,
    "end": 81.344,
    "text": "Head over to activeinference.org to learn more about getting involved in different learning groups and projects at the institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 83.527,
    "end": 94.819,
    "text": " Well, we're here in stream number 48.1, continuing our discussion on communication, active inference, ecological approaches, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 96.38,
    "end": 103.207,
    "text": "This is going to be a really exciting discussion and we're appreciative of the first author joining us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 104.309,
    "end": 110.333,
    "text": " We'll jump right in with some introductions and then onto the discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 110.413,
    "end": 113.996,
    "text": "So if you're watching live, feel free to write any questions in the live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 115.677,
    "end": 123.963,
    "text": "And I know that on our side, we have a lot of things to explore and also, of course, looking forward to learning more and seeing where it goes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 124.804,
    "end": 135.229,
    "text": " So I'm Daniel, I'm a researcher in California, and I guess the ecosystem of today is Chaparral because it's very warm where I am.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 135.609,
    "end": 145.874,
    "text": "And so I was thinking about how different ecosystems and eco tones might facilitate different kinds of communication in a regional way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 146.994,
    "end": 148.595,
    "text": "And I'll pass it to Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 150.543,
    "end": 150.943,
    "text": " Thanks, Tony.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 151.024,
    "end": 151.424,
    "text": "I'm Dean.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 151.624,
    "end": 155.128,
    "text": "I'm in the Rocky Mountains in Western Canada right now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 155.488,
    "end": 159.292,
    "text": "And it's, what would you in Fahrenheit?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 159.332,
    "end": 163.836,
    "text": "It's about 45 Fahrenheit this morning, but it's going to warm up to about 90.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 164.237,
    "end": 167.68,
    "text": "So yeah, there's a bit of an ecology going on around here too.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 168.981,
    "end": 169.322,
    "text": "I think",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 170.788,
    "end": 193.563,
    "text": " It's going to be a really interesting day because I think what we're going to do is take this ecological approach and lens and with the background of everybody here, we're going to really be able to pull up a lot of different interesting things that otherwise we would not pay attention to if we only got stuck on the transmission piece and I'll pass it down to Blue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 196.052,
    "end": 197.032,
    "text": " Hi, I'm Blue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 197.412,
    "end": 203.514,
    "text": "I am a researcher in sunny, beautiful New Mexico at the other end of the Rocky Mountains from Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 203.875,
    "end": 206.616,
    "text": "Like literally, if you just go straight down, I'm in the Sangre de Cristos.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 207.576,
    "end": 212.017,
    "text": "And we are recovering here from a like torrential summer of rain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 212.037,
    "end": 216.619,
    "text": "And I think I think like maybe we're finally getting back to some sun.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 217.219,
    "end": 219.621,
    "text": " It's starting to get hot now, like finally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 220.261,
    "end": 222.642,
    "text": "So I think that the sun is here to stay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 222.662,
    "end": 224.723,
    "text": "We still have a hot month, I guess.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 225.204,
    "end": 233.549,
    "text": "But the desert ecosystem and the Chihuahuan desert is special and fun and always excites me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 233.629,
    "end": 235.87,
    "text": "And I'm interested, too, in this paper in...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 237.811,
    "end": 243.393,
    "text": " how it more applies broadly, the communication as compared to the Vassal paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 243.934,
    "end": 252.857,
    "text": "Can we then apply to animals and also to maybe human-animal interactions and what those look like?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 253.618,
    "end": 260.22,
    "text": "And maybe not only cooperative communication, but also competitive communication.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 260.3,
    "end": 266.183,
    "text": "And I think extending this work into those avenues is interesting and exciting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 268.191,
    "end": 268.451,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 268.792,
    "end": 269.292,
    "text": "Thank you, Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 270.093,
    "end": 271.514,
    "text": "So Remy, welcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 272.114,
    "end": 273.776,
    "text": "And please take it away.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 273.916,
    "end": 277.439,
    "text": "Feel free to introduce yourself and give any context on the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 278.46,
    "end": 278.76,
    "text": "All right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 278.98,
    "end": 280.402,
    "text": "So thank you for having me.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 280.482,
    "end": 284.525,
    "text": "I'm really pleased to see that we'll discuss our paper.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 284.545,
    "end": 287.388,
    "text": "I'm Remy Tizan.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 287.828,
    "end": 291.992,
    "text": "I'm a researcher based in Montreal at UCAM.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 293.425,
    "end": 305.308,
    "text": " and uh yeah it's uh it's sunny it's a nice day here too and so yeah um the the paper was um an attempt to",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 307.401,
    "end": 318.932,
    "text": " to devise a view of communication that could be like a starting point for ecological and inactive approaches to language and communication.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 319.953,
    "end": 324.477,
    "text": "The problem that we saw is that in most",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 326.859,
    "end": 343.431,
    "text": " language sciences like linguistics, in philosophy of language, in mainstream philosophical language and in biology of communication, most researchers, most people adopt automatically a view of communication in which communication is",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 344.358,
    "end": 353.284,
    "text": " essentially transmitting information or transmitting content or an idea to another being.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 353.684,
    "end": 361.449,
    "text": "So usually, like in linguistic communication, that would be like, I have the belief that it's a sunny day outside.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 361.469,
    "end": 364.791,
    "text": "I say it's a sunny day outside.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 364.911,
    "end": 370.695,
    "text": "And then by doing this, I'm transmitting to you the belief that it's a sunny day outside.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 371.355,
    "end": 371.896,
    "text": "So that's the...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 372.376,
    "end": 399.057,
    "text": " basic view of communication the transmission view that is more or less adopted by everybody in in linguistics and in in cognitive science but a lot of people at least and that's a view of communication that is problematic from an inactive and ecological perspective because it relies on the notion of content on the notion of representation to transmit",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 399.617,
    "end": 407.859,
    "text": " content, I must have a representation in my head and then I can transmit it to you so that you can entertain this representation in your head.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 408.339,
    "end": 421.422,
    "text": "But as is quite well known, inactive and ecological approaches to cognition reject the notion of representation, the notion of content as a basic building block of cognition.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 421.942,
    "end": 426.303,
    "text": "So the transmission view is a problem from an inactive ecological view.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 427.023,
    "end": 444.85,
    "text": " And so what we tried to do was to develop a view of communication from which ecological and inactive approaches could start to understand language and communication without having to rely on the notion of content or representation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 445.15,
    "end": 447.991,
    "text": "So that's like the basic motivation of the paper.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 448.311,
    "end": 449.772,
    "text": "That's what we were trying to do.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 450.925,
    "end": 460.453,
    "text": " And we thought that Active in France and especially its ecological interpretation could be useful for doing that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 462.514,
    "end": 465.417,
    "text": "And yeah, the thing that you mentioned, Blue,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 467.638,
    "end": 472.399,
    "text": " The aim was to devise a view of communication that could be perfectly general.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 472.459,
    "end": 489.943,
    "text": "So that could be applied to animal communication, maybe communication between cells at a more small scale level, and eventually maybe communication between groups at a larger scale.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 489.963,
    "end": 492.764,
    "text": "So the view, the attempt was to",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 493.124,
    "end": 519.694,
    "text": " produce a view of communication that is perfectly general and that can be precise along the way so that we can for instance precise the conception of communication to apply it to a cooperative communication for instance which is the kind of communication that is characteristic of human communicative interaction and that was treated notably in the vessel paper to which you you alluded to",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 520.274,
    "end": 548.545,
    "text": " so that's the the aim of the paper and so because of its generality it's a paper that is really um in a way superficial because it really treats a lot of topics really quickly but that was like a big road map for a view of communication that could be used by ecological and inactive researchers so that was essentially what we tried to do in this paper awesome and just one more",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 549.608,
    "end": 556.113,
    "text": " Follow-up question we often ask would be, how did you come to use Active Inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 557.114,
    "end": 564.02,
    "text": "What about the collaboration or your direction led to the fusion of these approaches?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 564.34,
    "end": 568.884,
    "text": "Were you studying communication more broadly and came across Active Inference or vice versa?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 569.929,
    "end": 570.069,
    "text": " Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 570.35,
    "end": 576.938,
    "text": "So earlier in my academic career, so to speak, I was really more in philosophy of mind.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 576.958,
    "end": 581.103,
    "text": "So more of a philosophical background and not really in cognitive science.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 582.024,
    "end": 587.49,
    "text": "So that's where I became acquainted with issues about content, about meaning, etc.,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 588.231,
    "end": 607.405,
    "text": " And then I came at UCAM, worked with Pierre Poirier, which is really more centered in philosophy of cognitive science and was really interested in predictive processing theories and eventually in active inference framework because of its link with predictive processing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 607.785,
    "end": 611.408,
    "text": "So coming at UCAM with Pierre Poirier, I really became interested.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 612.168,
    "end": 615.589,
    "text": " acquainted with these ideas, with these frameworks.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 616.209,
    "end": 627.693,
    "text": "And that's where I linked these new frameworks with my earlier interest in language and communication that came from my background in philosophy of mine.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 627.733,
    "end": 629.493,
    "text": "So that's kind of how it happened.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 630.054,
    "end": 640.637,
    "text": "And talking with Pierre and the community of researchers at UCAM, who is really using the predictive processing and active inference frameworks,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 641.577,
    "end": 643.738,
    "text": " That's how it all came together.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 646.198,
    "end": 646.519,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 647.059,
    "end": 649.96,
    "text": "Well, many places to pick up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 650.12,
    "end": 652.66,
    "text": "Perhaps Dean first, if you'd like to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 655.201,
    "end": 657.182,
    "text": "Well, okay, I'll start with a question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 657.342,
    "end": 668.845,
    "text": "If we're going to take an activist approach to this, we're going to look at what communication is through that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 669.531,
    "end": 679.62,
    "text": " philosophical approach and take all that active inference affords in terms of opening up what communication is.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 681.241,
    "end": 694.112,
    "text": "Maybe, Remy, could you talk a little bit about how people who want to argue that there is no content, how could we then describe",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 694.975,
    "end": 707.559,
    "text": " our experiences, the things that we've played out, the things that we're going to play towards, but mostly what I'm curious about is the things that have been played, because we've got a record of that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 707.619,
    "end": 715.921,
    "text": "We don't have to call it content, but I've had a lot of conversations with a lot of people who live in an activist thinking community.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 716.92,
    "end": 731.468,
    "text": " And they twist a whole bunch of things around, but they really have a hard time coming up with an argument that says, my experiences aren't something, something.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 731.728,
    "end": 733.949,
    "text": "So maybe you could talk to us a little bit about that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 736.091,
    "end": 738.172,
    "text": "Yeah, so that's a good question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 738.192,
    "end": 743.575,
    "text": "I think that one of the answers that I could provide is that from my perspective,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 747.016,
    "end": 754.298,
    "text": " There are some people in ecological and inactive circles who refuse all reference to content.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 754.338,
    "end": 756.318,
    "text": "They say content doesn't exist at all.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 756.758,
    "end": 758.438,
    "text": "But that's not my perspective.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 758.498,
    "end": 765.32,
    "text": "From my perspective, content is just not at the basic level of cognition.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 765.88,
    "end": 771.441,
    "text": "It's like, it's kind of, I don't know if you're familiar with the work of Hutto and Mayen.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 772.241,
    "end": 781.449,
    "text": " These are radical inactivists, and they claim that content is not at the fundamental level.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 781.529,
    "end": 790.937,
    "text": "It's something that gets added up once there are a particular kind of social normative practices that can give rise to content.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 790.957,
    "end": 792.057,
    "text": "So that's my view.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 792.418,
    "end": 800.764,
    "text": "I think that we can describe the basic cognitive functioning of organisms and animals, and in many cases, humans,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 801.765,
    "end": 806.048,
    "text": " without the use of the notion of content, of the notion of representation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 806.088,
    "end": 807.229,
    "text": "I think that we can do that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 807.649,
    "end": 809.09,
    "text": "But at some point,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 810.111,
    "end": 828.935,
    "text": " in our social interactions, there are multiple things that can happen that will give rise to content, to representation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 829.075,
    "end": 831.115,
    "text": "And that's a complicated story.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 831.155,
    "end": 835.376,
    "text": "That's something that I might come back to later on.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 835.756,
    "end": 837.877,
    "text": "But the idea is that content is not",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 839.717,
    "end": 865.788,
    "text": " at the basic level it's not something that we can presuppose in a theory of communication it's something that can be explained by a theory of communication but it's not something that is that can be taken as something that can explain it's something that has to be explained so to speak i don't know if if i'm clear so we can i think use the notion of content to characterize the kind of experience the kind of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 866.488,
    "end": 873.958,
    "text": " phenomena that you allude to, but this notion must not be taken as granted.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 874.238,
    "end": 876.481,
    "text": "That's the view that I take.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 876.862,
    "end": 883.71,
    "text": "And I think there are some ways to explain how content arrives on the scene, but",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 885.012,
    "end": 889.296,
    "text": " It's not something that can be taken as granted in a theory of communication.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 889.316,
    "end": 890.997,
    "text": "And that's what I'm critiquing in this paper.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 891.097,
    "end": 904.649,
    "text": "It's like in traditional transmission view of communication, people presuppose that there is content, that there is representation and communication is defined as the transmitting of this content, of this representation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 904.949,
    "end": 914.955,
    "text": " What I'm saying is that representation is not something that can be used as this basal explanatory notion.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 915.695,
    "end": 920.498,
    "text": "It's something we have to describe communication without the use of this notion.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 920.878,
    "end": 931.785,
    "text": "And then with various tools of social interaction and particularly social normative practices, we can explain how content can",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 932.445,
    "end": 953.582,
    "text": " then arise so that that's I I can if you want to give more detail on that front but that's my my my two cents so um content exists it's not just at the basic level of communication awesome that reminds me of um and to to stay on our philosophy",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 954.878,
    "end": 959.04,
    "text": " wavelength, the difference between the explanandum and the explanands.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 959.88,
    "end": 970.204,
    "text": "So just quoting Wikipedia, an explanandum is a sentence describing a phenomena that is to be explained, and the explanands are the sentences adduced as explanations of that phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 971.004,
    "end": 981.489,
    "text": "And so it's a very interesting difference amongst these theoretical views and framings, which I'm sure we'll be able to unpack a lot of implications of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 982.489,
    "end": 990.78,
    "text": " that content as a phenomena or descriptive category, sign or symbol, we could have many ways of even describing what that is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 991.687,
    "end": 1003.411,
    "text": " However, under the transmission view, you're suggesting that content is seen as what is able to explain different phenomena like communication or cooperative communication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1003.452,
    "end": 1010.554,
    "text": "No matter how far out you go in the sub discussions, content is doing something to explain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1012.155,
    "end": 1019.538,
    "text": "Whereas in the radical and activist approach, radical meaning from the root, so with an activism at the root,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1020.538,
    "end": 1044.891,
    "text": " That doesn't mean that there couldn't be a branch that summarizes and reflects content, but it's something that is explained through inactive means rather than something that we're going to put like the cart before the horse and then use the semantic content representation view and the transmission associated with it to then try to explain inactivism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1045.511,
    "end": 1045.671,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1047.904,
    "end": 1052.489,
    "text": " Yeah, I think I'm on the same page as both of you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1052.769,
    "end": 1065.922,
    "text": "I take an example in 2019, I'm walking up the street rue Saint Denis and I'm heading to the patisserie and I don't have any first hand experience with that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1066.122,
    "end": 1067.223,
    "text": "But once I arrived there,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1068.055,
    "end": 1074.456,
    "text": " and I taste one of those chocolate pastries, now all of a sudden I have content.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1074.896,
    "end": 1077.017,
    "text": "So it wasn't that I had content first.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1077.417,
    "end": 1090.46,
    "text": "Even when I was looking at the map and walking up from UQAM past all the bars and on a beautiful fall day, I had the content once I experienced something first.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1091.54,
    "end": 1096.501,
    "text": "But I also can't deny that there was an aspect of that that wasn't",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1097.549,
    "end": 1102.652,
    "text": " limited just to the moment of all of the actions that I took walking up the street.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1103.052,
    "end": 1126.646,
    "text": "So if we're going to look at an ecology, and as I said, in my first question, if we're going to use active inference as the lens, as the situational analysis method, I don't know how we can drop content, but I do think the timing of when we see it as the important thing or the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1127.045,
    "end": 1135.733,
    "text": " the central aspect of what communication is, I don't think it, I don't think it destroys the fact that we still have it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1135.773,
    "end": 1140.177,
    "text": "It's just, when does it matter in that, in that continuum piece?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1140.237,
    "end": 1141.498,
    "text": "So, yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1141.518,
    "end": 1151.347,
    "text": "And by the way, thank you for just reminding me of that, that trip in to Montreal in 2019, before all the heck broke loose with all these viral things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1151.367,
    "end": 1152.408,
    "text": "It was beautiful time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1154.73,
    "end": 1155.831,
    "text": " I also went to Montreal in 2019.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1155.871,
    "end": 1157.972,
    "text": "Very cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1157.992,
    "end": 1158.172,
    "text": "Lou?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1161.835,
    "end": 1174.524,
    "text": "Yeah, I am curious about the difference between, or maybe there's no difference, or how can we clarify the difference between content and context?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1180.268,
    "end": 1182.129,
    "text": "Yes, great question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1183.731,
    "end": 1184.291,
    "text": "What do you think for me?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1185.362,
    "end": 1186.91,
    "text": " Okay, so content is...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1190.288,
    "end": 1194.19,
    "text": " is essentially something that has accuracy conditions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1194.65,
    "end": 1200.573,
    "text": "So the idea of content is it's something that can be false or true.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1201.034,
    "end": 1206.857,
    "text": "It's something that can be, or more generally, something that can be satisfied or not satisfied.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1206.897,
    "end": 1211.839,
    "text": "So for instance, usually we'll say that our propositional attitudes have content.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1211.859,
    "end": 1216.922,
    "text": "So for instance, when I have a belief, my belief has a content,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1217.992,
    "end": 1220.174,
    "text": " And this content can be true or false.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1220.274,
    "end": 1228.842,
    "text": "For instance, if I believe that it's sunny outside, I have the belief that it is sunny outside and the content, it is sunny outside.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1228.962,
    "end": 1230.103,
    "text": "It can be true or false.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1230.764,
    "end": 1234.187,
    "text": "And if it's sunny outside, then my belief is true.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1234.227,
    "end": 1236.069,
    "text": "So that's the basic idea of content.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1236.089,
    "end": 1238.752,
    "text": "It's something that is attached to our mental states.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1240.613,
    "end": 1244.315,
    "text": " It's usually associated with the notion of representation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1244.375,
    "end": 1249.276,
    "text": "There are complex debates to be had there, but that's the idea of content.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1249.717,
    "end": 1256.179,
    "text": "It's something that has conditions of correction in which it can be correct or incorrect.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1257.259,
    "end": 1258.44,
    "text": "So that's content.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1258.88,
    "end": 1267.143,
    "text": "And context, I don't know if you mean in general or in the specific way in which we use it in the paper.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1270.53,
    "end": 1298.745,
    "text": " how you use it in the paper yeah so context is um a set of elements um that are relevant to the um to the the to a joint action so that's how we use it a context a context of action in particular in the paper we're talking about joint action so when two people or more people are performing a joint action they're doing something together there are going to be some elements",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1299.165,
    "end": 1326.933,
    "text": " some events some objects of the environment that will be relevant on which some action has to be um done in order to advance the the joint action so the context is like the this structured special temporarily structured set of elements on which action has to be taken to progress the joint action so that's the notion of context that we use in the paper i don't know if if that clarifies some",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1327.679,
    "end": 1334.078,
    "text": " Well, so it implies like the set of elements is therefore also content.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1334.5,
    "end": 1334.961,
    "text": "Is that true?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1337.031,
    "end": 1340.653,
    "text": " In the paper, we don't think that it is.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1341.773,
    "end": 1353.94,
    "text": "My describing it as a set of elements is a contentful description because I'm talking about it and there's a content to the sentence of me who's saying that there's a set of elements.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1354.38,
    "end": 1360.384,
    "text": "But the set itself, the thesis that we're pushing forward in the paper is that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1361.364,
    "end": 1370.371,
    "text": " It can be, it can appear in the field of affordances of an organism without it having to represent it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1371.192,
    "end": 1375.035,
    "text": "So that's where, that's what we're going to in ecological psychology.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1375.975,
    "end": 1378.417,
    "text": "There's work on the notion of a field of affordance.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1378.457,
    "end": 1378.978,
    "text": "So it's like",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1379.358,
    "end": 1384.64,
    "text": " the structured set of affordances to which an organism is sensible.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1385.221,
    "end": 1394.344,
    "text": "And it's like there are some elements that will drive its action differentially depending on various internal factors.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1394.685,
    "end": 1397.866,
    "text": "And this sensibility of an organism to its environment",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1398.266,
    "end": 1405.291,
    "text": " doesn't have to be characterized in terms of content, if we believe the ecological psychologist to develop this notion.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1405.652,
    "end": 1427.408,
    "text": "So this set of elements appears in a field of affordances, and these organisms who are sensible to their field of affordances, don't have to entertain a representation of this set of elements, they're just sensible to their field of affordances, and that's how they respond to these sets of elements of their environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1430.322,
    "end": 1438.087,
    "text": " So maybe when you talk about content, maybe that is what needs to actually be clarified.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1438.467,
    "end": 1445.051,
    "text": "So content is specifically some kind of semantic representation or semiotic representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1445.071,
    "end": 1447.072,
    "text": "So it's something that is explicit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1447.112,
    "end": 1454.537,
    "text": "But can you give me an example of what would be an element in a set of elements?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1454.557,
    "end": 1457.399,
    "text": "How is that also not content?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1460.97,
    "end": 1465.576,
    "text": " Yeah, these are obviously complex questions, but yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1468.888,
    "end": 1477.17,
    "text": " Typically, an affordance is a relation between an element of the environment and an action capacity of an organism.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1477.19,
    "end": 1492.635,
    "text": "And the thesis that is taken by an ecological psychologist, not everybody will agree with that, but is that the perception of affordances does not need the mediation of a representation",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1493.195,
    "end": 1518.752,
    "text": " you can directly be sensible to a certain pattern of energy for instance in the in the in the energy array around you and you respond to this pattern of energy by for instance taking the affordance that is specified by this pattern of energy and you don't have it's not necessary to have a representation of the affordance to which you're sensible it's something that you can",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1519.552,
    "end": 1520.653,
    "text": " directly perceived.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1521.073,
    "end": 1525.955,
    "text": "And that's like a central idea of ecological psychology.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1525.995,
    "end": 1531.578,
    "text": "Some people will disagree with that, will say that you cannot be sensible to an affordance if you don't represent it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1531.998,
    "end": 1535.18,
    "text": "So that's obviously something that you can argue for.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1535.86,
    "end": 1547.966,
    "text": "But there's a lot of ecological psychologists who believe that you can be directly sensible to affordances of your environment just by responding to the energy array that is in your environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1548.346,
    "end": 1571.834,
    "text": " without needing to represent this affordance so in doing that they say that we don't need the notion of content or representation to characterize the way in which an organism is responsive to the affordances of its environment and that's what we we presuppose in this paper but obviously there are disagreements to be had there there are people obviously you think that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1573.574,
    "end": 1580.677,
    "text": " If an organism is to act on its environment, it has to have a representation of its environment in order to act correctly.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1580.717,
    "end": 1585.099,
    "text": "So that's obviously something that can be defended too.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1585.299,
    "end": 1585.839,
    "text": "Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1585.899,
    "end": 1586.419,
    "text": "Thank you so much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1586.499,
    "end": 1588.16,
    "text": "No, that's super helpful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1588.5,
    "end": 1588.78,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1590.081,
    "end": 1594.843,
    "text": "It makes me think of a tug of war game or just two people pulling on a rope.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1595.663,
    "end": 1597.884,
    "text": "They're engaged in joint action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1598.888,
    "end": 1625.667,
    "text": " which is how action and activism are placed at the center of the account of context, one individual pulling the rope, they might be thinking or thinking that they think any number of things, but through the field of affordances being shaped, through the regularities and the, I think, arrays of energy that you described in the niche,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1627.668,
    "end": 1649.964,
    "text": " that is going to alter the field of affordances of someone on the other side of the rope and that could be mediated through their appropriate deception or maybe the rope is now not graspable but it was graspable previously none of that requires a symbolic or even necessarily semantic component to be transmitted along with the rope pole",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1651.109,
    "end": 1656.031,
    "text": " Maybe they had a pre-play and they said two tugs means this and three means that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1656.591,
    "end": 1659.632,
    "text": "And that can also reflect planning to communicate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1660.292,
    "end": 1679.54,
    "text": "However, in the act of communication, as we're exploring, we're putting action and the embodiment in the environment as primacy, and then seeing certain types of cognitive agents as being able to develop representation like properties on top of some physical regularities in the niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1680.26,
    "end": 1680.4,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1683.001,
    "end": 1684.903,
    "text": " Remy, what would you think of this idea?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1686.004,
    "end": 1705.742,
    "text": "We haven't defined ecology here in this conversation, but if someone like me came along to you and said, can we define it as both a process, ecology as process and ecology as a product, would you push back on that idea?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1707.15,
    "end": 1709.532,
    "text": " ability to see it two ways.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1710.153,
    "end": 1722.283,
    "text": "And then I guess on top, on the general level to Blue's question, then can we see it as content and context, this idea, this placeholder of ecology?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1722.844,
    "end": 1726.447,
    "text": "If we keep it on that general level, can we have our cake and eat it too?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1733.737,
    "end": 1738.68,
    "text": " Yeah, so ecology here really refers to something specific.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1738.74,
    "end": 1744.304,
    "text": "It's not ecology in general, like in the branch of biology.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1746.005,
    "end": 1752.029,
    "text": "In philosophy of cognitive science, when we talk about ecological psychology, it's a particular...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1753.81,
    "end": 1763.297,
    "text": " movement that began with the work of Gibson in the 50s, 60s and 70s.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1763.677,
    "end": 1781.188,
    "text": "And it's an approach to psychology that states that the cognition of animals is a matter of its direct relation with its environment and is a matter of the kind of skills that are exerted by this animal in its environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1781.489,
    "end": 1781.709,
    "text": "And the",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1783.81,
    "end": 1788.294,
    "text": " The central notion of ecological psychology is the notion of affordances.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1788.795,
    "end": 1791.817,
    "text": "An affordance is a possibility of action.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1792.338,
    "end": 1800.124,
    "text": "It's a relation between an element of the environment and a skill that can be exercised on this element of the environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1800.885,
    "end": 1813.008,
    "text": " And the thesis of Gibson and all the ecological psychologists that followed after that is that organisms and animals primarily perceive affordances in their environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1813.048,
    "end": 1814.508,
    "text": "They don't perceive objects.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1814.608,
    "end": 1817.349,
    "text": "They don't perceive events or properties.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1817.589,
    "end": 1823.65,
    "text": "What they perceive first and foremost is possibilities for action.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1824.07,
    "end": 1830.272,
    "text": "And they are pushed and pulled by their environment in various ways and responsive to their environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1830.812,
    "end": 1853.31,
    "text": " uh to take some affordances and don't not take some other affordances and that's how that's like in a constant interaction with their environment organisms will respond to these affordances and do some do some things and will be attracted by some affordances will be pushed by some other affordances and that's how an organism",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1853.85,
    "end": 1855.632,
    "text": " interacts with its environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1855.652,
    "end": 1864.8,
    "text": "So that's ecology here really refers to that body of ideas that came from the work of Gibson in ecological psychology.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1864.86,
    "end": 1881.754,
    "text": "There are obviously links with ecology more broadly as a branch of biology, but it's really specifically this set of ideas linked to ecological psychology and Gibson's work.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1883.729,
    "end": 1894.159,
    "text": " Do you think that what you just described, the possibility, could be for people like yourself, both a product and a process?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1895.401,
    "end": 1900.646,
    "text": "Is that possibility something that can be categorized two different ways at once?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1902.688,
    "end": 1903.429,
    "text": "That's a good question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1903.469,
    "end": 1904.109,
    "text": "You mean like...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1907.583,
    "end": 1910.886,
    "text": " It's a category error to say it's only a process.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1911.486,
    "end": 1913.728,
    "text": "That would be another way of asking the same questions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1914.769,
    "end": 1932.624,
    "text": "I think that ecological psychologists would more prefer the description of the interaction of an organism with its environment in terms of process because the organism is always changing through its interaction with its environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1933.264,
    "end": 1942.51,
    "text": " And obviously, the organism is also changing the environment culturally, as is described in active inference accounts of niche construction.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1942.53,
    "end": 1952.857,
    "text": "So there's always an evolving interaction in which the organisms gain skills and the environment is transformed.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1953.198,
    "end": 1956.24,
    "text": "So the field of affordances is like never static.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1956.34,
    "end": 1958.981,
    "text": "So it can never really be described as a product.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1959.021,
    "end": 1962.564,
    "text": "I don't know if that answers a bit your question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1964.068,
    "end": 1966.813,
    "text": " Well, are there products within what you just described?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1966.853,
    "end": 1974.306,
    "text": "So for example, if I'm an organism and I've had experiences and I can now use those experiences to continue my process,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1975.805,
    "end": 1984.287,
    "text": " Are those things that I've experienced, do they just have to stay in the same category as now processed as in past?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1984.947,
    "end": 1986.848,
    "text": "Or have they solidified?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1987.108,
    "end": 1990.849,
    "text": "Because I can't go back and change my history per se.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1991.509,
    "end": 1992.549,
    "text": "I can build off of it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1992.91,
    "end": 1994.35,
    "text": "But those are pretty absolute now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1995.01,
    "end": 1997.931,
    "text": "This sentence that I'm getting out is going to have a record.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1998.74,
    "end": 2000.602,
    "text": " That I can't erase.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2001.303,
    "end": 2009.872,
    "text": "So are those things products now in the enacting of whatever I've decided I want to focus on in terms of possibility?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2014.333,
    "end": 2016.154,
    "text": " Maybe, I'll just say something quick.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2016.495,
    "end": 2026.443,
    "text": "Maybe when you take like a definite time slice of an evolving organism, you can say that at that point, there's a product that can be defined.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2026.463,
    "end": 2036.412,
    "text": "You can say, okay, at that point, there's this set of abilities, this set of skills, this set of experiences that can be attributed to this animal.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2036.472,
    "end": 2037.953,
    "text": "So there's a product at that point.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2038.334,
    "end": 2039.295,
    "text": "But if you take",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2039.975,
    "end": 2061.26,
    "text": " the uh organisms uh evolution like it's in its entirety there is always changing so there it's content it's always a process in true the there's always a process but if you you you you freeze frame maybe you can say okay at that point there's this and that that is a product of the",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2062.12,
    "end": 2064.666,
    "text": " of the interaction.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2064.686,
    "end": 2070.878,
    "text": "But I don't know if I answered correctly your question, but that would be my idea.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2071.019,
    "end": 2071.119,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2074.537,
    "end": 2075.898,
    "text": " You are answering, and it's great.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2075.959,
    "end": 2087.47,
    "text": "I'm just trying to get in my mind, if we're going to talk about relativity, and I know that I step into a river and step out and then step into it a second time, I'm not stepping into the same river.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2087.51,
    "end": 2091.574,
    "text": "So what gives me the affordance to realize that difference?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2091.754,
    "end": 2093.115,
    "text": "Is it a product?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2093.395,
    "end": 2097.019,
    "text": "Is that first time I went in now a product?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2097.379,
    "end": 2100.24,
    "text": " because I can't go back and change it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2100.32,
    "end": 2111.565,
    "text": "I can move off of that and see the relative distance or the relative time, but I don't know how we do processing without product.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2112.185,
    "end": 2113.526,
    "text": "That's, I guess, what I'm asking.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2116.457,
    "end": 2122.999,
    "text": " One quick thought on that is that product doesn't necessarily mean singular, final, static.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2123.519,
    "end": 2127.621,
    "text": "There are working products that can be versioned, which digital files have helped us see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2128.321,
    "end": 2131.702,
    "text": "And then also we could say that the past is produced.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2133.359,
    "end": 2151.371,
    "text": " but also it's reproduced when it's remembered, when it's brought back together, and even in the directions you point to towards the end of the paper with what kinds of empirical neurophysiological accounts are helping bolster the ecological claim.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2152.953,
    "end": 2165.268,
    "text": " The realization that memories are not being accessed as static files, but are recreated contextually and relived is an interesting angle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2168.592,
    "end": 2168.953,
    "text": "Yes, Blu?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2171.474,
    "end": 2185.887,
    "text": " So the recreation of memories contextually, like in dreams is really like interesting because it's like the recreation and also like recombination in a different context.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2186.668,
    "end": 2192.774,
    "text": "And just before we leave context entirely, I guess, I think I have a hard time with",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2194.585,
    "end": 2198.75,
    "text": " All of this, because even a field of affordances has content, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2199.051,
    "end": 2201.854,
    "text": "Like I can go fly a kite if it's windy outside.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2201.874,
    "end": 2204.077,
    "text": "Like I have a set of actions that I can choose from.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2204.097,
    "end": 2213.229,
    "text": "And I think because we have to talk about it in a way that's semantic, it's difficult to like experience my field of affordances.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2214.069,
    "end": 2236.194,
    "text": " because i'm a human and and not only that like i'm a very verbal human so so i think that there's there's like that but but wait even the field of affordances is content but but i realized that like it's the mental representation aspect that is not um that that is the distinction between content and context and i i just want to point to um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2236.914,
    "end": 2249.145,
    "text": " the quantum paper where we had the quantum reference frames and Chris Fields' paper on contextuality that like we did on the live stream, I think number 40 and live stream number 17.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2249.325,
    "end": 2251.927,
    "text": "And just it's...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2252.808,
    "end": 2278.861,
    "text": " it's not possible to have a full contextual alignment here and it makes me think of in the paper how you were describing like there's this person on one end of the of the tug of war and then there's another person on the other end of the tug of war and then there's actually the tug of war itself and I just wonder about like what is the so person A has their context",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2279.241,
    "end": 2280.521,
    "text": " Person B has their context.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2280.921,
    "end": 2283.662,
    "text": "What is the context of the tug of war itself?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2283.762,
    "end": 2285.403,
    "text": "It's another entity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2285.803,
    "end": 2299.627,
    "text": "Anytime you have this interaction, and this is something that I've said to Daniel before, you have a relationship with a person, you have a set of communication with a person, that's its own thing that has to be loved, protected, nurtured.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2300.907,
    "end": 2301.767,
    "text": "You have to keep it up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2301.807,
    "end": 2302.227,
    "text": "It has to...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2304.808,
    "end": 2306.209,
    "text": " undergo like autopoiesis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2306.269,
    "end": 2307.63,
    "text": "It has to self-assemble, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2307.671,
    "end": 2309.352,
    "text": "Like it's its own entity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2309.392,
    "end": 2311.954,
    "text": "And I wonder about modeling in that way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2312.114,
    "end": 2322.302,
    "text": "Like, like if I model my communication, like there's me and the person and then the interaction or the collective behavior or, or, or whatever it may be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2322.723,
    "end": 2323.043,
    "text": "I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2323.103,
    "end": 2326.786,
    "text": "I just, it's, I've been thinking about it and yeah, that's all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2329.557,
    "end": 2337.601,
    "text": " It's like a view from the bottom or inside or however of communication where there's two entities and a partially aligned reference frame.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2337.701,
    "end": 2347.666,
    "text": "And then there's also a view where it is just one thing, albeit maybe with partial information encapsulation, but it still becomes one thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2348.486,
    "end": 2356.07,
    "text": "And then is that one thing atomic, even though it contains divisions and partitions as well?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2357.13,
    "end": 2358.751,
    "text": "Remy on that or anywhere you want to go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2359.738,
    "end": 2364.84,
    "text": " Yeah, I think, Blue, your interventions are really, really interesting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2366.1,
    "end": 2372.042,
    "text": "So for the first thing that you said, I know that it's hard to",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2377.581,
    "end": 2386.489,
    "text": " remove our habit of describing things in terms of content because we have language and we describe things in terms of content.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2386.549,
    "end": 2398.6,
    "text": "But it's something that has been remarked really early by phenomenologists like Merleau-Ponty and Heidegger that our primary...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2399.781,
    "end": 2427.432,
    "text": " contact with with the world is not some like a description it's not like a representation um it's not like a reflexive consciousness it's a pre-reflexive consciousness and in your day-to-day interaction with your environment you're not using this kind of language-like description to experience your environment like if you're playing a sport and like for instance with you're playing soccer and you you see like a pass that you can make you're not",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2428.412,
    "end": 2431.615,
    "text": " reflexively thinking that, oh, you could make that pass.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2431.655,
    "end": 2437.679,
    "text": "It's like a push or a pull in a field, in an attractor field kind of thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2438.159,
    "end": 2440.121,
    "text": "And that's how we experience.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2440.201,
    "end": 2454.291,
    "text": "And at the second where us humans, especially, we begin to think about our experience, then we cannot help but describe it in terms of content, in terms of representation that we entertain in a linguistic way.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2455.331,
    "end": 2471.681,
    "text": " linguistic means but in our pre-reflexive engagement with the environment that's the thesis of the phenomenologists and the ecological psychology it's really just a push and a pull from the environment that drives us in different directions and we don't have this kind of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2472.922,
    "end": 2482.194,
    "text": " reflexive consciousness, this kind of representation on which we rely to describe and understand it with these linguistic means.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2482.494,
    "end": 2486.74,
    "text": "So I think that's really the difficulty that we have of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2488.101,
    "end": 2507.274,
    "text": " like getting to this pre-reflexive consciousness when we are so used to at the second that we describe something we are describing it in terms of content so we have it's hard to like say oh there's no content when we talk about it we are invoking content automatically so yeah there's a difficulty there",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2507.874,
    "end": 2513.976,
    "text": " And about the autonomy of the dynamic of an interaction, that's something that's really, really interesting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2514.016,
    "end": 2518.237,
    "text": "And there's been great work on this by Ezequiel DiPaolo.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2518.577,
    "end": 2519.697,
    "text": "I don't know if you're familiar.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2519.717,
    "end": 2523.258,
    "text": "He's an activist researcher.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2523.278,
    "end": 2524.859,
    "text": "He's working on language, too.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2524.919,
    "end": 2528.24,
    "text": "And I've been really inspired by his work.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2528.6,
    "end": 2535.542,
    "text": "And he's describing situations where there are two people interacting, and these two people have goals",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2536.002,
    "end": 2561.796,
    "text": " that are aligned but because of the particular dynamic of the interaction these goals don't come to fruition for instance when you're walking in in a corridor in somewhere and you're facing somebody and both of you want to like fluidly like pass each other but you're both trying to go for on one side and then on one side and you're blocking each other that you're trying to",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2562.457,
    "end": 2567.403,
    "text": " achieve the same goal, which is individually passing past each other.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2567.504,
    "end": 2574.633,
    "text": "But because of a dynamic that arrives from the interaction, you cannot achieve this goal.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2574.653,
    "end": 2577.277,
    "text": "So there's really like this autonomous dynamic",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2578.178,
    "end": 2593.12,
    "text": " at the interaction that is really important and i don't think that obviously that's something that i that we wanted to put in the paper because we're talking about uh the interactive dynamic dynamical systems but i don't think that i've succeeded in um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2594.461,
    "end": 2615.918,
    "text": " translating this in the way we think of shared field of affordances because I define shared field of affordances as the subset that is common to both individual fields of affordances, but I think that neglects this autonomy of the field of affordances that is shared in the interaction.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2615.938,
    "end": 2622.563,
    "text": "I don't know if I'm being clear, but I define the shared field of affordances as a product of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2623.363,
    "end": 2634.051,
    "text": " the combination of the two individual fields of affordances, but it seems that there's a lack of autonomy in the Shell field that I don't know how to account for.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2636.394,
    "end": 2646.124,
    "text": " That makes me think of the ant case where one nestmate might be able to grab a single seed and carry it home.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2646.745,
    "end": 2658.858,
    "text": "So that would be compatible with a view on communication as shaping the field of affordances because it modifies the capacity for another nestmate to pick up that seed because it's been moved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2659.718,
    "end": 2665.321,
    "text": " It doesn't need to have any representational content, although especially when we're linguistically describing, it does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2665.421,
    "end": 2666.842,
    "text": "So I definitely want to come back to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2668.163,
    "end": 2678.309,
    "text": "Then there's this seed grabbing ability, which is predicated on a lower level affordance, like the ability to grasp with the mandibles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2680.203,
    "end": 2702.822,
    "text": " that lower level affordance enables true joint action like multiple nest mates working together to drag something bigger home but dragging something bigger isn't an affordance that even exists at the single nestmate level so there's like shared affordances and joint action at the level of what we can both do",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2704.002,
    "end": 2723.854,
    "text": " And then there's also this very interesting higher level view where perhaps novel affordances become accessible, but then whom or to what or when do these special affordances or maybe nested system affordances come into play?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2724.895,
    "end": 2735.119,
    "text": " and how will we mediate the the handoff or like the way that those different levels of affordances come into relevance or out of relevance blue",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2738.456,
    "end": 2744.297,
    "text": " So in terms of that modeling the field of affordances, it changes through time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2744.317,
    "end": 2749.859,
    "text": "And this is why I was thinking about a competition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2749.879,
    "end": 2756.34,
    "text": "In a tug of war between two people, both of them have the affordance to win, or there could be a tie.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2757.44,
    "end": 2762.161,
    "text": "But it's a potential opportunity for either one to win, but only one can be the winner.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2762.561,
    "end": 2764.082,
    "text": "And so then one person winning,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2765.302,
    "end": 2768.406,
    "text": " by default makes the other person lose.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2768.907,
    "end": 2778.32,
    "text": "And so this field of affordances changing through time is really interesting and I think very broadly applicable for modeling all kinds of processes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2780.575,
    "end": 2781.116,
    "text": " Yeah, that's true.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2781.416,
    "end": 2788.263,
    "text": "And the idea about the collective affordances, there's been some interesting work on that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2788.663,
    "end": 2793.949,
    "text": "And clearly, some organisms like ants don't perceive collective affordances.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2794.509,
    "end": 2798.253,
    "text": "If they perceive something, they perceive their individual affordances.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2798.393,
    "end": 2801.016,
    "text": "And at the collective level, there's the...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2801.917,
    "end": 2824.162,
    "text": " the taking of this higher level affordances this collective affordances affordance but they don't perceive individually probably I don't think they do perceive individually the affordance but some organisms such as humans I think because we have maybe a deeper generative model or something we are able to perceive some collective affordances because we're",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2825.462,
    "end": 2850.879,
    "text": " sensible to them for instance if where i'm moving with a friend i can perceive that a couch is unmovable by me but i can perceive it as movable by us and then i can say like oh we could move this couch together because i perceive it as something that can be acted upon not just by me but with somebody else and then i have a perception it appears in my individual field of affordance as",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2850.879,
    "end": 2864.364,
    "text": " as a collective affordance, but that's different from the ants who achieve a collective action, but without having the perception in their individual field of affordances of this collective affordance.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2866.445,
    "end": 2867.025,
    "text": "That's awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2867.205,
    "end": 2875.709,
    "text": "It makes me think of the human capacity to have counterfactuals and speculative realism on teams and projects like, hey,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2876.485,
    "end": 2884.7,
    "text": " everybody here, we could do X. So there's the ability to communicate semantically and representationally where needed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2885.863,
    "end": 2886.484,
    "text": "Plausible",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2888.615,
    "end": 2899.184,
    "text": " or little sub-niches, new things can be suggested and arise that are specifically about shared or collective affordances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2899.844,
    "end": 2912.095,
    "text": "And then additionally, there are special names for when we take individual level affordances that have consequences on other levels of decision-making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2912.255,
    "end": 2914.817,
    "text": "Like there might be a multi-sig",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2915.868,
    "end": 2943.735,
    "text": " wallet in cryptography or a voting system in democracy where an individual's affordance is like to pull the lever or to fill in a box or to sign a transaction and then it's being engaged in specifically because there's knowledge if 100 people do this then this affordance is going to happen so it seems like there's many cases where we um do",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2945.416,
    "end": 2970.383,
    "text": " our mandible closing, the kind of lower level individual task, also with an explicit knowledge and a communicated knowledge around how someone's individual actions will influence group outcomes that could be like weakly emergent, like merely summating the affordances taken by individuals, as well as",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2971.463,
    "end": 2984.009,
    "text": " strongly emergent or more strongly emergent in the sense that there's, there's nothing different about anyone's pulling lever in voting, but there are phase transitions and dynamics that can be like top down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2986.171,
    "end": 2986.411,
    "text": "Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2989.692,
    "end": 2989.892,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2989.912,
    "end": 2996.976,
    "text": "So, so when we have these experiences and they are kind of absolute in the sense that they they've happened, they've occurred,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2997.842,
    "end": 3008.008,
    "text": " and whether we can recall them or not, they seem to have some kind of an effect on this relativity piece and the relationship piece.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3008.048,
    "end": 3016.313,
    "text": "I don't think it matters whether we see Newton on one side and then Chris Fields and Einstein on the other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3016.573,
    "end": 3019.735,
    "text": "The bottom line is that, to what Daniel was just saying,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3020.239,
    "end": 3030.326,
    "text": " the possible happens when we don't get stuck on what's the gauge of the transmission line, but what does that now allow us to do?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3030.786,
    "end": 3040.272,
    "text": "So how do we move from the absolutes, the modeling piece, to the process piece, the things that are out there",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3040.967,
    "end": 3046.528,
    "text": " that have not happened yet that are still in that possibility category.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3046.988,
    "end": 3064.852,
    "text": "And now we're going to use communication, not just to narrow down to the workbench, the ontology, which Daniel and I are fast friends, except when it comes to the specifics of ontology, the generalities of that and the potential and possibility of that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3065.252,
    "end": 3070.113,
    "text": "Remy, maybe you can talk to us a little bit about that from the ecological lens.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3071.82,
    "end": 3073.141,
    "text": " Yeah, that's a really good question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3074.541,
    "end": 3088.169,
    "text": "I think one interesting thing about collective and shared affordances is I think they are learned in the same way that we learned individual affordances.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3088.829,
    "end": 3093.53,
    "text": " So, for instance, how do we learn to perceive an affordance?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3093.57,
    "end": 3097.551,
    "text": "We learn to perceive an affordance when we gain a skill.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3097.871,
    "end": 3106.113,
    "text": "When we gain a particular skill, we then can perceive in the environment the situations where we can apply this skill.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3106.573,
    "end": 3110.794,
    "text": "So, for instance, when we're really young, we can, I guess, we can...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3112.794,
    "end": 3128.319,
    "text": " can maybe crawl a little bit so we know where surfaces can be crawled upon and we can grab things so we perceive where things can be grabbed and so we start from this like basic skills and then we explore environment we do some things that we",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3129.139,
    "end": 3131.32,
    "text": " We're gaining some abilities.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3131.84,
    "end": 3143.223,
    "text": "And when we do that, probably a little bit by trial and error, we begin to perceive some higher level affordances because we can do some more complex things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3143.583,
    "end": 3151.005,
    "text": "And so our field of affordances deepens and becomes more complex as our set of skills becomes more complex.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3151.485,
    "end": 3154.145,
    "text": "But I think that interacting with others,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3156.566,
    "end": 3172.445,
    "text": " um so sorry for my my accent it's not really good i think i didn't want to say interacting with the animal others so yeah um so when we interact with others we are also learning to do some particular things for instance",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3173.025,
    "end": 3178.309,
    "text": " If I try to pick something up alone, I might not be strong enough to do it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3178.389,
    "end": 3180.39,
    "text": "So I don't have the skill.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3180.41,
    "end": 3181.851,
    "text": "So I don't perceive the affordance.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3181.891,
    "end": 3190.816,
    "text": "But if in some cases I pick something up and I see somebody else picking it up with me and we succeed in lifting it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3191.217,
    "end": 3194.459,
    "text": "And then I have gained the ability to see that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3195.359,
    "end": 3198.141,
    "text": " With somebody else, I can lift the stick.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3198.381,
    "end": 3207.546,
    "text": "But it's not a different kind of learning in that case from the kind of learning that I apply when I'm learning individual skills.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3207.606,
    "end": 3215.571,
    "text": "It's just that interacting with your environment, you acquire skills, sometimes with somebody else, sometimes not.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3216.072,
    "end": 3220.214,
    "text": "And you understand how you can apply these skills in your environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3220.614,
    "end": 3224.857,
    "text": "And then you navigate your field affordances accordingly.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3225.197,
    "end": 3248.856,
    "text": " so how you perceive a possibility is about how you have learned to do some things in the in the past and then because of this learning you perceive situations as affording these kinds of actions they can be individual but in communication they are usually about what others can do and what we can do with others and that's how you perceive like the the possibilities that can be uh",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3250.137,
    "end": 3277.95,
    "text": " that can be brought upon that can be done with with the person with which you're interacting but i don't know if that helped but that's how i see it from a from a modeling standpoint if you if you move away from the constraints and you look at the emancipation and the freedom piece it it obviously becomes combinatorially explosive very very quickly because it can go off in many many directions but as a for example as daniel",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3279.178,
    "end": 3284.775,
    "text": " alluded to when we started today's live stream this could go down many different paths so he left it open",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3285.455,
    "end": 3288.577,
    "text": " He left the freedom aspect in.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3289.257,
    "end": 3312.811,
    "text": "And so I was curious what you think about, so when we do leave that in, when we do move out of the laboratory or we do move away from the mechanics, which you were just describing, and give our attention over to the freedoms piece of it, without immediately assuming, oh, well, we're going to stop modeling now because this is just going to blow up on us.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3312.872,
    "end": 3314.232,
    "text": "I was wondering what you're thinking is,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3315.703,
    "end": 3320.062,
    "text": " around that in terms of communication as a platform for the possible.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3323.177,
    "end": 3330.204,
    "text": " Yes, so the idea of communication is that the role it plays in interaction is the constraint.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3330.684,
    "end": 3335.348,
    "text": "It's a constraint on the set of possible action that can be achieved.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3335.729,
    "end": 3348.06,
    "text": "So the idea is that what communication achieves, it helps to limit the scope of affordances that will be salient at a given moment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3348.44,
    "end": 3370.987,
    "text": " it's like you will center like the the shared field of affordances around a certain set or certain affordances and this will limit this will restrict the the set of affordances that will be um considered or that that can be acted upon by the the individual participants so that's the the role that it plays i don't know if that that helps but that's how",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3371.707,
    "end": 3387.607,
    "text": " communication works, I think, in interaction, that what it does, in dynamical systems terms, the idea was that it helps to create interpersonal synergies in order to achieve the joint goals of the interaction.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3387.647,
    "end": 3389.209,
    "text": "That was the suggestion in",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3389.89,
    "end": 3413.56,
    "text": " in the paper so for instance two people being together in a room they can be a lot they can do a lot of things there's like an almost infinite set of affordances that are open to them but if one of the people in the room like goes to the couch and say like couch or manifestly tries to lift it then what is",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3414.42,
    "end": 3428.925,
    "text": " what is conveyed to take the transmission view idiom, what is conveyed, the effect that it has, it will augment the salience of the affordance of taking the couch.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3428.985,
    "end": 3434.807,
    "text": "And then this will restrict the set of affordances that are open or that are salient in the shared field.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3434.847,
    "end": 3438.189,
    "text": "And then the other person will see, OK, that's what we're doing now.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3438.509,
    "end": 3441.59,
    "text": "And they're going to take the couch together and lift it and bring it",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3443.11,
    "end": 3448.712,
    "text": " So the role of communication is like there's a whole set of affordances open at any moment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3449.072,
    "end": 3459.315,
    "text": "And what communication does, it restricts, it constrains this set of affordances in order to better achieve the joint goals of the interaction.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3459.375,
    "end": 3464.917,
    "text": "That's what we tried to do in the paper to understand cooperative communication.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3466.556,
    "end": 3471.579,
    "text": " You touched on an important difference, though, between is and if.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3472.0,
    "end": 3480.646,
    "text": "So what is does actually put pretty strong, what do we call them, guardrails, constraints.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3481.046,
    "end": 3485.229,
    "text": "But if I ask what if, I haven't put a constraint on something.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3485.269,
    "end": 3489.772,
    "text": "I've looked now at the counterfactual and the possible, and I haven't said what",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3491.53,
    "end": 3498.132,
    "text": " that the first person that answers back to me is going to necessarily be now the new constraint.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3498.292,
    "end": 3501.692,
    "text": "The whole point of if is the possible, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3501.932,
    "end": 3505.973,
    "text": "And it is the freeing up, and it's the whiteboard moment, and we know all of this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3506.974,
    "end": 3511.795,
    "text": "So again, I understand in the context of this paper what the is part of it is,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3512.555,
    "end": 3528.989,
    "text": " in terms of joint action but is there a what is there a place in your research here for the if within the same arguments that you i believe that there is but you didn't speak as clearly to them as you did to the is parts the the constrained parts",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3530.683,
    "end": 3539.328,
    "text": " Yeah, so I think what you're talking about here is the communication about future or counterfactual situation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3539.388,
    "end": 3540.668,
    "text": "That's what you're talking about.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3540.728,
    "end": 3541.049,
    "text": "Okay, yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3541.349,
    "end": 3556.917,
    "text": "So what we tried to do in the paper is we introduced the notion of a simulation of a field of affordances, and that's where we're dancing really closely with the notion of representation, because is it a representation of an affordance?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3557.177,
    "end": 3559.058,
    "text": "That's like a fine line to tread, but",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3560.759,
    "end": 3564.081,
    "text": " So there's this notion of a simulation of an affordance field.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3564.682,
    "end": 3580.371,
    "text": "Some sufficiently cognitively complex organisms such as humans and probably some primates can produce a simulation of an affordance that will enter in this hierarchical affordance competition.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3580.671,
    "end": 3589.316,
    "text": "So you can activate an affordance that is not immediately present in order to affect your current field of affordance",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3589.716,
    "end": 3595.041,
    "text": " to, for instance, go towards this simulation of affordance.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3595.061,
    "end": 3602.046,
    "text": "That's based on the work of Paul Chisek, which is at Montreal, and his work on affordance competition.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3602.427,
    "end": 3603.668,
    "text": "And he argues that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3605.209,
    "end": 3622.217,
    "text": " a lot of phenomena linked to cognitive control such as executive function and these kind of things and working memory can be understood as these effects of affordances at higher hierarchical levels that will constrain",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3622.637,
    "end": 3633.043,
    "text": " the lower levels of the field of affordances in order, for instance, to act accordingly to this higher level affordance.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3633.063,
    "end": 3644.168,
    "text": "So the example that Csikszentmihalyi gives is, for instance, suppose that there's a monkey on a branch that sees a little berry just beside it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3644.208,
    "end": 3646.77,
    "text": "So there's the affordance of eating the berry, but",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3647.55,
    "end": 3655.376,
    "text": " Suppose that there's an apple, which is a bigger fruit, a bigger price, further down on the branch.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3655.716,
    "end": 3660.499,
    "text": "And the monkey has an understanding that there's this apple further there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3660.799,
    "end": 3665.883,
    "text": "It can, with this simulation of the affordance of eating this apple at a higher level.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3665.923,
    "end": 3670.085,
    "text": "So like, if I do that, if I go there, I will get this apple.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3670.145,
    "end": 3676.85,
    "text": "This simulation of an affordance at a higher level will constrain, will diminish the salience of this immediate solicitation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3677.53,
    "end": 3687.376,
    "text": " and it will help him to ignore this immediate berry and it will continue on the branch in order to get to the bigger, to the apple.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3687.416,
    "end": 3692.54,
    "text": "So there's the basic idea of how the simulation of affordances can play",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3693.68,
    "end": 3704.466,
    "text": " like a cognitive control role in order to constrain our behavior according to further goals like in future situations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3704.526,
    "end": 3714.871,
    "text": "So that's the idea on which we speak about it really really quickly in the paper because it's already a really big paper but that's an important point and that's",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3715.251,
    "end": 3721.479,
    "text": " the key to understanding the communication about future and counterfactual situation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3721.799,
    "end": 3723.621,
    "text": "We talk about it in the last section.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3724.503,
    "end": 3730.129,
    "text": "It's the displacement or the absent reference discussion.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3730.17,
    "end": 3733.554,
    "text": "So the idea of how can we talk about things that are not immediately present",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3734.054,
    "end": 3735.554,
    "text": " in a special temporal sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3735.954,
    "end": 3740.595,
    "text": "And the idea is that we can activate shared simulations of affordances.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3740.655,
    "end": 3749.957,
    "text": "So I can speak about an affordance that is not immediately present, but it can affect our shared field of affordance.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3750.417,
    "end": 3756.418,
    "text": "And it can drive our behavior toward this affordance, for instance, even if it's not immediately present.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3756.738,
    "end": 3762.039,
    "text": "But yes, this poses the question of, are these simulations of affordances representations",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3763.899,
    "end": 3775.223,
    "text": " I'm on defense on this question, but if they are, they are probably action-oriented representations that maybe would be acceptable to an activist and ecological psychologist.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3776.763,
    "end": 3778.304,
    "text": "Sorry for my really long answer.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3778.324,
    "end": 3781.265,
    "text": "That's something that I've really thought about a lot.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3782.825,
    "end": 3783.125,
    "text": "Nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3784.026,
    "end": 3784.346,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3785.246,
    "end": 3787.827,
    "text": "Blue, want to add anything, or there's a few ways to go?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3789.988,
    "end": 3790.428,
    "text": "No, I'm good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3790.448,
    "end": 3790.748,
    "text": "Go ahead.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3790.768,
    "end": 3791.168,
    "text": "Take it away.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3791.673,
    "end": 3791.893,
    "text": " All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3792.293,
    "end": 3804.878,
    "text": "Well, one interesting connection with active inference, you mentioned there's nested affordances, including ones that are plausible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3805.918,
    "end": 3817.563,
    "text": "So that reminded me a lot of the attention and metacognition as mental action, which we explored in Livestream 25 with Sanved Smith et al.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3817.523,
    "end": 3820.924,
    "text": "'s paper, where the same way that at the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3821.624,
    "end": 3842.034,
    "text": " kernel layer of the partially observable markov decision process or however we're doing active modeling at the most basal or kernel layer those pies those policy selections and those ease those affordances have to do with the level of affordance that is embodied",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3842.754,
    "end": 3853.518,
    "text": " like the actual actions that the eyes are taking in the oculomotor case, or the actual direction that's taken left or right in a T-Maze example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3854.498,
    "end": 3864.382,
    "text": "And then nested modeling is using an analogous graphical structure where policies",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3865.64,
    "end": 3888.006,
    "text": " of nested levels reflect attention being paid to various lower level lower levels of that hierarchical architecture so there could be uh one lever that can go left and right and one that can go up and down and then there's a higher level decision like which of these two levers",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3889.54,
    "end": 3896.426,
    "text": " should I be paying attention to and how aware am I of which lever I'm paying attention to and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3897.607,
    "end": 3916.142,
    "text": "So I think the paper itself does not present any formalisms, but there's extensive linking to work in active inference and also to really resonant ideas that are in a non slash pre active inference framing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3917.549,
    "end": 3937.038,
    "text": " that are immediately compatible like nested levels of affordances the distinction between the primacy of the bodily affordances but also for certain cognitive systems the existence of what appear to be cognitive affordances and the desire to model those jointly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3937.958,
    "end": 3957.27,
    "text": " perhaps without taking on strong or specific baggage around how we are then constrained to think about the bodily or the cognitive aspects of that modeling blue oh um and then one other thought was on like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3958.607,
    "end": 3961.649,
    "text": " shared action, including shared planning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3962.209,
    "end": 3980.342,
    "text": "So planning to act together and about how events or activity planning in the future is like an activity that one person can do or groups can do, but it's about preparing a context",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3981.852,
    "end": 4001.507,
    "text": " so that a process can occur and sometimes all that's needed is to send the calendar event invite other times there might need to be a lot of work to be done before the event itself however what is the transmission view on planning",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4003.82,
    "end": 4006.862,
    "text": " that might be able to describe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4007.142,
    "end": 4017.449,
    "text": "And I think the paper does an excellent job of saying that the transmission view is not refuted by the ecological and inactive angle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4017.789,
    "end": 4021.792,
    "text": "You said no transmission, no communication, no communication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4022.012,
    "end": 4029.497,
    "text": "It's like, it's an enabling aspect of this action orientation and this focus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4033.479,
    "end": 4038.961,
    "text": " Here's some other areas that we had written down from before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4038.981,
    "end": 4052.345,
    "text": "One I'm really curious to follow up on is about like language and maybe the role of how we're talking about these issues.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4052.505,
    "end": 4058.247,
    "text": "What other media or formats have you found to be insightful",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4060.282,
    "end": 4071.825,
    "text": " Do any inactivists do presentations with silent films or with objects that are mailed to you and you play with or do this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4072.785,
    "end": 4082.288,
    "text": "I mean, how else can we point at the moon and not have it be confused that we're talking about finger anatomy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4082.308,
    "end": 4089.61,
    "text": "Read me first, then look.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4093.306,
    "end": 4115.897,
    "text": " Okay, yeah, I think that's hard to talk about academic subjects like this without having like an explicitly transmission view, like appearance of communication, because the",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4117.918,
    "end": 4131.108,
    "text": " This kind of interactions are so far from the basic interactive activities that were like the context of the evolution of communication, which is what I'm trying to explain here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4131.549,
    "end": 4132.609,
    "text": "It's not like...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4133.59,
    "end": 4144.573,
    "text": " You imagine a tribe somewhere in the Pleistocene, and they're not trying to explain academic subjects to each other.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4144.613,
    "end": 4147.293,
    "text": "They're trying to do things, concrete things together.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4147.313,
    "end": 4154.275,
    "text": "And that's really the context of where communication evolved and what purpose it served.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4154.615,
    "end": 4158.536,
    "text": "But I think that it's hard to envision the context",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4159.356,
    "end": 4176.247,
    "text": " uh an academic discussion such as the one we're having now that would be uh um like that would be more evidence toward the ecological view than for the transmission view i i don't know if that uh that's here but clearly like uh moving a couch together",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4177.067,
    "end": 4202.298,
    "text": " is a better instance of and the communication that takes place in this joint activity is probably a better example of our view than like speaking together about active inference and communication because this is really a specific and really highly complex form of social activity that is more readily described for instance in terms of the transmission view I think.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4205.492,
    "end": 4206.093,
    "text": " Yeah, nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4206.233,
    "end": 4207.474,
    "text": "A lot to say there, Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4210.077,
    "end": 4215.263,
    "text": "So I think all of those things, like even silent films, are also representations, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4215.283,
    "end": 4223.913,
    "text": "So whether it's a communication, like a whisper communication, or even pointing to the moon would be like a... Well, maybe that would be different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4223.953,
    "end": 4224.293,
    "text": "I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4226.276,
    "end": 4231.881,
    "text": " I like this idea of communication as an action that we take.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4232.322,
    "end": 4236.305,
    "text": "And I'm not leaving information transmission behind in the dirt.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4236.365,
    "end": 4239.428,
    "text": "I don't think it needs to go there, I think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4240.369,
    "end": 4244.333,
    "text": "But I do think that all actions are in some way",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4244.973,
    "end": 4247.216,
    "text": " some kind of information transmission.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4247.716,
    "end": 4261.152,
    "text": "So even like, and Remy, you've studied a theory of mine, so I assume you're familiar with integrated information theory and the emergent properties that information can help us to represent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4263.274,
    "end": 4263.915,
    "text": "And so I think,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4265.942,
    "end": 4274.368,
    "text": " like in some way, even like eating food, like tells the environment that you're hungry and, and takes away the food.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4274.428,
    "end": 4285.976,
    "text": "And so there's, there's always some level of informational exchange, even if it's just trivial information exchange, even if it's not meaningful, it doesn't create some bigger emergent thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4286.116,
    "end": 4286.336,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4289.298,
    "end": 4290.138,
    "text": "Thanks blue Dean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4293.921,
    "end": 4294.001,
    "text": "Um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4295.529,
    "end": 4299.03,
    "text": " I think it's an easy, again, I think it's, well, I won't say it's easy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4299.951,
    "end": 4303.952,
    "text": "Remy did a good job of explaining this and not making it too obtuse.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4304.432,
    "end": 4314.455,
    "text": "If you use an example of moving a couch, the physical manipulation, it's not hard to extend that to communication and symbolic manipulation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4314.495,
    "end": 4317.536,
    "text": "The manipulation stays.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4317.837,
    "end": 4324.719,
    "text": "Then that sort of reinforces the idea that there is a process at hand, something that we can observe.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4325.748,
    "end": 4340.003,
    "text": " But I'm still kind of confused about, so once the chair has been lifted or the words have come out of my, I heard an expression because I was watching the John Vervaeke thing yesterday and something comes out of my mouth hole.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4340.744,
    "end": 4342.625,
    "text": "Now it's done.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4343.046,
    "end": 4343.787,
    "text": "It's a product.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4344.795,
    "end": 4349.658,
    "text": " I mean, we can resubmit it or reflect on it or whatever, but it's there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4350.238,
    "end": 4351.379,
    "text": "It's now historical.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4351.92,
    "end": 4361.285,
    "text": "And so that transition from process to product, I think, is something that the manipulation by itself doesn't explain.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4361.305,
    "end": 4367.85,
    "text": "We have to kind of de-link and see the sort of timelessness aspect of this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4368.29,
    "end": 4371.052,
    "text": "Carl talks about deep temporal models.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4371.886,
    "end": 4382.591,
    "text": " And so I don't know that, I'm not sure how communication manipulation, symbolic manipulation gets explained in these deep temporal senses.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4382.771,
    "end": 4384.972,
    "text": "And I'm not just talking about chiseling it into",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4387.129,
    "end": 4388.67,
    "text": " The stones, the tablets, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4388.71,
    "end": 4394.956,
    "text": "Like, there's got to be another piece to this that you've looked into, Remy, and obviously much deeper than I have.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4395.897,
    "end": 4404.325,
    "text": "What is your sense of that once we get past the manipulation processing and start seeing the products pile up?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4410.246,
    "end": 4415.734,
    "text": " Yeah, so, yeah, it's hard to answer this question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4418.037,
    "end": 4421.802,
    "text": "But that's true of everything that is something that happens.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4423.542,
    "end": 4427.084,
    "text": " at some point it's there and you can't change it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4427.144,
    "end": 4434.448,
    "text": "So any event, communicative or not, or like a rock that falls or something, that has that property too, no?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4435.648,
    "end": 4451.557,
    "text": "Once it's happened, it's something to which we can go back and I don't know if that's... So in the same sense, if you talk, you say something, this is something that has happened and you can...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4454.661,
    "end": 4458.645,
    "text": " it's now a product and something to which you can allude to.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4459.806,
    "end": 4471.696,
    "text": "It has influenced your cognitive system and then you can... I struggle to see what's the question exactly.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4471.716,
    "end": 4477.24,
    "text": "One of the things that you pointed to right at the very start of your paper was",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4478.462,
    "end": 4502.382,
    "text": " what these symbols that have been manipulated and now set down in this paper is not the end it's the start of something this product this paper should be the start of a dialogue or a trial log or in this case a quadrilog and it has become something right so so it's the back and forth part that i find really interesting and it's something you",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4502.902,
    "end": 4504.944,
    "text": " spoke to very clearly at the very start of your paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4504.964,
    "end": 4511.17,
    "text": "You didn't say, okay, so if we get stuck in the transmission view, when I stop talking...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4512.168,
    "end": 4512.628,
    "text": " That's it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4512.808,
    "end": 4513.388,
    "text": "That's over.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4513.468,
    "end": 4516.189,
    "text": "And now we're going to start something else.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4516.329,
    "end": 4519.57,
    "text": "No, you basically said there's a continuum aspect to this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4520.27,
    "end": 4533.593,
    "text": "It isn't strictly episodic that we have to look at something more than just what Remy says, which I think is a brilliant way to start a paper and an even better way to start a conversation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4533.693,
    "end": 4533.833,
    "text": "So",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4534.44,
    "end": 4538.504,
    "text": " So there is a product piece to this, and there's a process piece to this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4538.924,
    "end": 4542.787,
    "text": "You put something down, and a child will start manipulating it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4543.328,
    "end": 4548.753,
    "text": "And then they'll start manipulating the symbology that they're applying or affiliating or associating with that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4549.333,
    "end": 4554.878,
    "text": "So again, you've looked at that far deeper than I have, obviously, because listen to how I ramble, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4555.038,
    "end": 4555.158,
    "text": "But...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4555.859,
    "end": 4567.342,
    "text": " I wondered how do you take that transition piece now and hold it up to other people who maybe take an inactivist approach or take more of an instrumentalist approach, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4567.742,
    "end": 4575.464,
    "text": "Because the bottom line is it's hard to deny that it's done or it's still happening.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4575.944,
    "end": 4577.885,
    "text": "But you focused on the it's still happening.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4577.965,
    "end": 4579.305,
    "text": "So what are your thoughts?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4581.141,
    "end": 4585.643,
    "text": " Yeah, I think that there's, with communication, there's a sedimentation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4585.923,
    "end": 4587.904,
    "text": "Di Paolo talks about this too.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4588.245,
    "end": 4600.951,
    "text": "Like the symbol that we use, the words that we speak, there's like this... There's also talk about first order languaging and second order languaging.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4601.031,
    "end": 4606.494,
    "text": "So first order languaging is like the flow, the dynamic where every interaction is new.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4607.295,
    "end": 4613.321,
    "text": " Everything is always like on the fly and there's always a transformation of the linguistic forms that we use.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4613.742,
    "end": 4620.429,
    "text": "And the second order languaging is like the abstraction where we can say, oh, that's the same word that has been used.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4620.469,
    "end": 4621.57,
    "text": "That's the same sentence.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4621.61,
    "end": 4622.471,
    "text": "That's the same meaning.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4622.811,
    "end": 4624.653,
    "text": "And this second order languaging is like a...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4626.455,
    "end": 4654.825,
    "text": " uh something that's added up and that that's an abstraction that's um something a traditional linguistic has really focused on this second order languaging which is like the product of language which is like okay the the the language that the language that we speak is a set of sentences a set of words and that's something that that is identified at the level of the second order languaging but when we're speaking where we're talking it's not at this level that we're doing it when we're",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4655.225,
    "end": 4656.366,
    "text": " acting, it's always new.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4656.407,
    "end": 4658.189,
    "text": "We're always reconfiguring.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4658.229,
    "end": 4659.47,
    "text": "We're always transforming.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4659.771,
    "end": 4674.649,
    "text": "And it's only when we abstract from this like basic interaction, some patterns that we see, okay, at the second order, at the second level, there is words, there's a syntax, there's some rules that are followed, but it's not",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4676.924,
    "end": 4696.737,
    "text": " the real phenomenon of language is at the first order and that's the idea so maybe that's a way to see like the real activity is really a process but if we abstract if we look back on this process and we analyze it and we abstract some parts of it then we can see these forms emerging these languages these words",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4697.177,
    "end": 4702.779,
    "text": " that are used repetitively, and then we can have the product of language.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4703.059,
    "end": 4718.326,
    "text": "But in truth, language is always a process, and that's the shift, the terminological shift of not talking about language, but languaging, which is something that an activist working on language tried to do.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4718.686,
    "end": 4726.409,
    "text": "That really brings forward this notion of language is always an activity, always a process, and not like a set of words, a set of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4726.889,
    "end": 4743.239,
    "text": " Symbols that are used and these these analysis in terms of repeatable symbols is something that we get when we analyze it like after the fact, and we see these patterns that are that are used.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4743.559,
    "end": 4752.323,
    "text": " that we get this second order, but when we're doing it and at the fundamental level, it's really just a process of continual interaction.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4752.343,
    "end": 4756.685,
    "text": "So that's maybe something to think about.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4757.145,
    "end": 4761.768,
    "text": "And there's something I want to say really quickly about what Blue said about the information and",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4762.808,
    "end": 4784.344,
    "text": " the the way in which information is always present and that that's true that that's what i allude to at the end of the paper when i cite uh brian's curves when i say yeah there's always information transmission right just moving in my environment there's information that's transmitted but yeah that's exactly the point and that's uh the idea is that content is not information",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4784.884,
    "end": 4809.202,
    "text": " information is everywhere always when we when anything happens in the environment in the universe there's information that is created doesn't transmitted but the idea is that information understood in this in these terms in uncertainty reduction notion of information is not sufficient to explain communication because there's information always everywhere that's that the point",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4809.782,
    "end": 4822.513,
    "text": " that people who hold the transmission view think that they can rely on this notion of information to explain communication, but it's not a strong enough notion of information.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4823.254,
    "end": 4826.997,
    "text": "They need the notion of content to explain what they want to explain.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4827.377,
    "end": 4837.106,
    "text": "Because, for instance, the information that you think about when I eat, when I wave my arms like that, there's information because there's an exchange with my environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4837.546,
    "end": 4845.115,
    "text": " But that's not sufficient to explain communication because this information is everywhere and communication is not everywhere.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4845.195,
    "end": 4850.402,
    "text": "It's a property of certain behaviors that we have to be more specific to analyze.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4852.785,
    "end": 4853.105,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4855.666,
    "end": 4859.71,
    "text": " So the information has to have context, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4859.75,
    "end": 4867.437,
    "text": "It has to have relevance for the communication, for the collective action, for the collaboration or something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4868.157,
    "end": 4876.005,
    "text": "So there's no, like in order for communication, like that contextual, I don't know, imposition needs to exist, I think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4877.489,
    "end": 4878.809,
    "text": " Yeah, nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4879.71,
    "end": 4881.35,
    "text": "So just a few notes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4881.65,
    "end": 4884.511,
    "text": "I really like this sedimentation of communication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4885.351,
    "end": 4902.315,
    "text": "It's a really rich riverbed or rock formation, natural analogy that's very concordant with ecological perspective to reflect how the products of communication are indeed sequentially layered.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4903.444,
    "end": 4907.229,
    "text": " The pen marks on the page can't be erased.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4907.529,
    "end": 4908.791,
    "text": "We can't undo what was said.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4909.011,
    "end": 4910.213,
    "text": "We can't un-record.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4910.533,
    "end": 4912.856,
    "text": "We can't un-transact on a blockchain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4913.016,
    "end": 4918.984,
    "text": "All these different aspects and even including the scientific literature being appended to continually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4919.645,
    "end": 4921.708,
    "text": "So there's a sedimented aspect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4923.126,
    "end": 4947.91,
    "text": " yet also there is something that is a process like the river that is depositing the sediment and then that made me think about how sometimes communication is descriptive around what was or is and this may map on to the variational free energy inference which is uh kind of like now casting or even retro casting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4949.096,
    "end": 4969.81,
    "text": " But once we enter into action and anticipatory or prospective informing and communicating, looking forward to reduce uncertainty about action selection is vital for systems to persist and thrive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4970.851,
    "end": 4979.308,
    "text": " However, as we've explored in many discussions, sometimes from a really technical angle, the introduction of action",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4980.504,
    "end": 4987.187,
    "text": " into model selection and just modeling in general introduces several complexities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4988.067,
    "end": 5001.653,
    "text": "How the space of possible actions is enumerated and scanned over, it's a simpler and a different question to do purely receptive inference on something about the past.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5002.573,
    "end": 5006.915,
    "text": "But to inject one into the present and embody that presencing,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5008.143,
    "end": 5019.131,
    "text": " requires one to act amidst uncertainty about what the future of the generative process will be and the consequences of action, which are either slightly or almost entirely unknown.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5019.672,
    "end": 5035.563,
    "text": "So the introduction of action puts us into that realm of expected free energy and highlights all these really interesting dynamics and how the future is not the past, but it becomes that way, like it gets sedimented, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5037.327,
    "end": 5064.474,
    "text": " this is the pre-sedimentation there's some dust molecules they're right next to each other in the river one of them is going to sediment the other one's going to go out to the pacific ocean it may not even be clear in that river which way the different particles are going to go and so that's like where like all the complexity and turbulence can be happening um and so it's a very rich distinction and um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5065.399,
    "end": 5073.442,
    "text": " something to really bring back about how the past is sedimented, but there's an openness in the action consideration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5074.303,
    "end": 5081.866,
    "text": "And that's where planning as inference and joint action and shared attention, all these features come into play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5082.706,
    "end": 5082.927,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5084.407,
    "end": 5086.188,
    "text": "Yeah, Daniel, I don't know if you're",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5087.685,
    "end": 5102.097,
    "text": " if indirectly referring back to the 47 series of the live stream, but there it was, what we talked about was that people who have looked through an inactivist lens really make fantastic arguments about let's focus on process.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5102.377,
    "end": 5103.918,
    "text": "Let's focus on the process.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5104.879,
    "end": 5105.76,
    "text": "Apologies.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5106.501,
    "end": 5113.006,
    "text": "If you're talking about people who work in the instrumentalist, hopefully that'll get answered.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5113.775,
    "end": 5118.858,
    "text": " If you're talking about people who are looking through the instrumentalist lens, they really want to talk about product.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5119.159,
    "end": 5120.539,
    "text": "They really want to say, this is a tool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5121.0,
    "end": 5123.181,
    "text": "And they argue fantastically for that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5123.621,
    "end": 5127.964,
    "text": "And I think what we tried to do in the 47 was say, you're both right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5128.405,
    "end": 5130.266,
    "text": "You both have fantastic arguments.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5130.806,
    "end": 5135.89,
    "text": "As an agent who's trying to communicate, why would we say one communication?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5137.99,
    "end": 5151.593,
    "text": " Like if we're active in FERS, why if we're active in FERS, first and foremost, if we're always trying to scan and survey that field of affordances, why would we drop one for the other unless that was necessary?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5152.333,
    "end": 5165.876,
    "text": "Even part of affordance, the ability to option and be able to recognize the tool product and recognize the action in that moment, carrying out that data thread.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5166.576,
    "end": 5173.138,
    "text": " which we can now act further on, as Daniel said, downstream, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5173.699,
    "end": 5185.963,
    "text": "So again, I don't think anybody would argue that inactivism and that ecological approach is hugely important in order to be able to generate those affordances.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5187.695,
    "end": 5197.363,
    "text": " But maybe there's still people who want to argue, no, if you just bring your toolkit, all of your problems will suddenly dissolve.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5197.783,
    "end": 5211.834,
    "text": "Or if you just walk into the room, you'll know how to talk to all of these people without really developing that sense of, okay, so as you said, first order and second order communication, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5212.094,
    "end": 5213.816,
    "text": "You've just walked into the room.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5214.827,
    "end": 5223.209,
    "text": " And then you reflect later on so that the next time you walk into a room, maybe you come at it a little differently each time, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5223.609,
    "end": 5234.032,
    "text": "So again, Daniel, I don't know if you were consciously or subconsciously referring back to the last live stream set, but that's essentially where I'm kind of at.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5234.072,
    "end": 5241.034,
    "text": "Well, I've been there for a bit now, but I wonder how you can argue that it could only be one",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5242.492,
    "end": 5243.793,
    "text": " And if we're talking about affordances.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5244.533,
    "end": 5246.535,
    "text": "If we're not talking about affordances, fine.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5247.796,
    "end": 5248.356,
    "text": "It can be one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5248.576,
    "end": 5254.52,
    "text": "But if we're talking about affordances and we're optioning out, how can it be less than two?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5256.702,
    "end": 5261.666,
    "text": "The menu is not diminished by selecting what you want for that meal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5262.694,
    "end": 5264.775,
    "text": " you don't rip the rest of the menu out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5265.435,
    "end": 5282.402,
    "text": "And then also, Remi, one just insight, I've never heard it phrased this way, but it's so interesting and hopefully gives many people, including us, some directions, is you said it's hard to discuss academic subjects without the transmission view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5283.583,
    "end": 5287.785,
    "text": "And that's just such a fundamental point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5289.025,
    "end": 5294.746,
    "text": " one could take a sort of sociological critique of academic discourse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5295.526,
    "end": 5317.431,
    "text": "And while the practices and the networks of academics and the genres that they write in, the venues and the paywalls and all of these different sociological features structure academic discourse to be such and such a way that can feel lifted from our first order experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5318.721,
    "end": 5345.492,
    "text": " and this actually takes an even more fundamental angle which is yes those sociological features may be what is explained but fundamentally on on that topic or anything what is it about this conceptual or academic mode of synchronous and asynchronous discourse just what is it about what is it on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5346.744,
    "end": 5355.568,
    "text": " And how can we evolve this and develop this to create an ecology of communication to integrate in a new way?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5361.13,
    "end": 5362.491,
    "text": "For Remy first, and then anyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5364.91,
    "end": 5388.804,
    "text": " Yeah, I think that not just the academic discussions, but all our conceptions of education and learning are influenced by this transmission view also, because all the traditional views of education is the notion that you transmit a certain knowledge, a certain view, a certain content to the student.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5389.464,
    "end": 5409.811,
    "text": " you're the teacher and you have this content and you're giving it to the, that's like the traditional view of education and there's been pushback in recent years in philosophy of education and trying to understand education and apply more participative methods of learning",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5410.271,
    "end": 5419.517,
    "text": " that go against that, but really the view of education as transmitting knowledge, I think is really closely connected to this transmission view of communication.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5419.557,
    "end": 5429.903,
    "text": "And I think that's not a particularly good view of applying pedagogic practices.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5429.943,
    "end": 5432.505,
    "text": "I think that's really limited.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5432.945,
    "end": 5438.489,
    "text": " And they haven't waited for our paper in 2021 to do that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5438.549,
    "end": 5453.359,
    "text": "But yeah, there's been in recent years a lot of work in philosophy of education and trying to push back against this transmission view of education and trying to put like having classrooms that are more interactive and in which there's",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5455.36,
    "end": 5472.678,
    "text": " active learning from the students, and they're not just receiving knowledge, but they're gaining skills by acting in a learning environment in which they're agents and not just patients.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5472.998,
    "end": 5476.822,
    "text": "So I think that's something that's also useful to discuss.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5479.758,
    "end": 5489.986,
    "text": " Yes, we had some great times discussing instructionism and interactionism in the context of skillful performance and motor commands.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5490.826,
    "end": 5496.531,
    "text": "And the discussion was, are descending motor commands representational?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5496.911,
    "end": 5499.012,
    "text": "Are they instructions to be carried out?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5499.953,
    "end": 5507.394,
    "text": " Or are they interactions that are being engaged in that might not necessitate taking a representationalist view?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5508.274,
    "end": 5525.217,
    "text": "And in this same spirit and strength of the active inference framework that we can talk about patterns across systems, here is instructionism and interactionism in a very natural setting of the ecological experience of learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5526.317,
    "end": 5528.718,
    "text": "And one can take various",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5529.838,
    "end": 5550.844,
    "text": " critiques or angles on like tabula rasa or blank slate we don't need to endorse the view however what it implies quite directly is that there's a canvas and things are added sedimented on the canvas and one can say that some writing is on the canvas or it's a different shape or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5551.883,
    "end": 5570.258,
    "text": " those are specifying the metaphor, but fundamentally the knowledge accretion model of education, the opt-in model, as well as the ignorance destructive model of education, which is a kind of counterpoint to we're going to add good knowledge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5570.998,
    "end": 5577.163,
    "text": "And then the shadow of that is we're going to destroy bad knowledge and unlearn.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5578.144,
    "end": 5580.906,
    "text": "Both of those are like working in the riverbed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5581.963,
    "end": 5601.725,
    "text": " we going to sediment this way or let's modify these sediments it's still seeing the product of education which is a totally reasonable focus for industries and sectors that are focused on the products of education the products of education for the student the certificate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5603.025,
    "end": 5623.533,
    "text": " and the social recognition and status thereof, or just the outcomes of education for the system, like amount of people with a certain professional training and what is the river that is sedimenting or de-sedimenting that can get dropped?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5624.437,
    "end": 5631.219,
    "text": " And that's the active turn in education, learning by doing, as if even a lecture is doing something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5631.279,
    "end": 5633.899,
    "text": "You're looking, you're hearing, you're touching.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5634.519,
    "end": 5651.944,
    "text": "So it is quite an exciting area to explore how interactionism in settings that have been considered educational, conventionally or unconventionally, what the implications are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5653.155,
    "end": 5664.5,
    "text": " And I'm sure that next week we'll be able to explore many more implications as we kind of have crested one hill and look towards some implications.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5664.6,
    "end": 5676.326,
    "text": "But how do you communicate differently with what you know and have done in philosophy and science of communication?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5678.067,
    "end": 5678.287,
    "text": "Remy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5682.478,
    "end": 5688.662,
    "text": " I think I'm really bad at applying my own theory of communication.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5688.682,
    "end": 5702.772,
    "text": "I think I give a class at UCAM and I always like I'm angry at myself because I really like just automatically applies this really",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5704.293,
    "end": 5708.958,
    "text": " classical way of transmitting knowledge.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5709.058,
    "end": 5716.444,
    "text": "And I'm always angry at myself because I don't apply enough, I think, my own ideas about communication.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5716.925,
    "end": 5724.412,
    "text": "But I think I should do more to provide better evidence for my own theory of communication.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5727.338,
    "end": 5739.262,
    "text": " It's funny, I'm sure it'll be a lifelong process for all of us because we have priors that are templated on the forms that we know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5741.243,
    "end": 5745.805,
    "text": "That's what was and what is and what may be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5747.646,
    "end": 5753.868,
    "text": "And then there's that expected free energy, like active communication perspective that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5754.876,
    "end": 5767.422,
    "text": " And are we going to select only from yesterday's menu or can new dishes and new approaches be added in that we may want to select from?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5767.443,
    "end": 5777.868,
    "text": "Are there new modalities or approaches to communication in educational settings or otherwise that are now",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5779.838,
    "end": 5807.954,
    "text": " authorized or um enabled by this perspective i'm sure we'll continue to discuss it but let's just say this paper becomes a fundamental reading for a communications department or for a early life learning group like a public school what is different",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5809.89,
    "end": 5837.11,
    "text": " in the short term with the structural constraints and opportunities that exist with someone thinking and acting differently and then over slower time scales the co-evolution of those individual affordances cognitive and bodily affordances and the kinds of systemic alterations to the education architecture dean i know you'll have a thought on that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5841.949,
    "end": 5853.784,
    "text": " part of what you were speaking to is simply asking as Remy did at the beginning of his paper, and then what happens, but then not racing to provide the answers.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5854.465,
    "end": 5856.187,
    "text": "It's essentially,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5857.508,
    "end": 5859.129,
    "text": " opening, opening up the space.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5859.589,
    "end": 5873.994,
    "text": "And then, and then what happens might mean that you, you move out of the classroom and you, and you take the classroom migrates to, to the lookout on Mount Royal or you, or you, you simply don't intervene.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5874.474,
    "end": 5877.935,
    "text": "You, you kind of let the ecology work itself through.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5877.995,
    "end": 5886.058,
    "text": "Now that can be very scary at first, because of course you're supposed to be the one herding the cats, but if you let the herd piece of it off,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5886.838,
    "end": 5893.343,
    "text": " and see what cats do when allowed to sort of free think.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5894.104,
    "end": 5909.036,
    "text": "I think, I don't know that it provides the absolute specific answer, but it will provide you that joint action opportunity if you're really truly looking for affordances as opposed to specifics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5910.838,
    "end": 5913.94,
    "text": "And again, I think even in an academic setting,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5916.092,
    "end": 5924.74,
    "text": " I don't think it's too far of a stretch to say affordances matter, and we would like to see if people can exercise those things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5924.78,
    "end": 5927.023,
    "text": "We just don't want to get too crazy, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5931.407,
    "end": 5935.811,
    "text": "Norms and guidelines for affordances matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5938.018,
    "end": 5945.38,
    "text": " I don't know what else to say, but certainly there are things that one would prefer not to see occur in a learning setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5946.101,
    "end": 5946.321,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5946.561,
    "end": 5947.441,
    "text": "Easy to enumerate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5948.281,
    "end": 5965.527,
    "text": "And then there are the known beneficial affordances or phenomena, and then part of interactionism seems to leave that unknown unknown quadrant open and to allow for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5966.983,
    "end": 5986.041,
    "text": " individual or for collective outcomes that are surprising and maybe not explicitly navigated towards or planned for, but how to leave the unknown unknowns open while de-risking unknowns and knowns",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5987.176,
    "end": 6012.063,
    "text": " is a challenge and so again it's natural to see where in the de-risking imperative we de-risk everything and that introduces like second order risks and it closes the door on what may have even been the purpose i mean what's the safest car the one that doesn't move",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6013.593,
    "end": 6021.486,
    "text": " in that one limited local optimization of like reducing the number of high speed collisions or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6024.711,
    "end": 6025.192,
    "text": "Yes, Remy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6027.563,
    "end": 6037.307,
    "text": " So on that topic, I think there's Brunberg and Rydveld and Keverstein talk about an optimal grip on the field of affordance.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6037.327,
    "end": 6041.368,
    "text": "I didn't say it, I think, but their work was a great inspiration for my own work.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6043.949,
    "end": 6066.605,
    "text": " uh so they talk about an optimal grip on a field of affordances and there's like you're always trying to stay in the point where you're there's like the relevant affordances are open to you but you stay you stay at the same time open to switching to other affordances and you're trying to",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6068.247,
    "end": 6075.293,
    "text": " in that process of interaction with your field of affordances, continually minimize your own free energy, but there's risk in that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6075.313,
    "end": 6089.025,
    "text": "So there's the idea, the example that they give is the boxer who's trying to maintain a certain distance to its opponent, because at that distance, if the boxer is farther, it cannot reach with its punches.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6089.165,
    "end": 6094.51,
    "text": "If it's too close, maybe there's less impact and maybe it's more open to being hit.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6094.77,
    "end": 6105.216,
    "text": " So there's like this optimal distance to which the boxer has flexible, multiple opportunities that the boxer can take.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6105.696,
    "end": 6108.457,
    "text": "And I think that's what we're always trying to do.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6108.477,
    "end": 6115.961,
    "text": "We're trying to get to this optimal grip of the field of affordances in which there's multiple affordances that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6117.262,
    "end": 6134.865,
    "text": " afford the free energy minimization and that we want to take that and that's obviously something that can be hard to do but we have through our skillful interaction with the environment we learn these kinds of gradients where should we go",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6135.565,
    "end": 6159.03,
    "text": " in in our environment in order to find these optimal grips and like you're speaking about car i guess depending on your skill you might want a different car to get this optimal grip on the on the on the road if you're like a fast driver who likes to go to go really fast you might want a faster car but if you go too fast then you're getting an accident so there's depending on our skills there's different",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6160.13,
    "end": 6178.15,
    "text": " optimal grips on our field of affordance and something was really afraid to go fast might go with like really slow car and that would be it's that person's optimal grip on the road that would be the this car would provide it for this person so that made me think about that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6180.083,
    "end": 6182.784,
    "text": " So some comments on optimal grip.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6182.864,
    "end": 6186.146,
    "text": "Thanks for bringing in Jelle et al's work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6186.526,
    "end": 6192.189,
    "text": "It's really nice that that was brought in even several years ago into the active inference literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6193.05,
    "end": 6202.295,
    "text": "And if we're imagining a tactile grip, actual prehension, if we're not in a grip strength competition,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6203.308,
    "end": 6207.332,
    "text": " where one might just monotonically prefer more grip.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6208.133,
    "end": 6220.184,
    "text": "If we were like on a playground and we're going to be swinging amongst bars, then the optimal grip has to satisfy us being able to keep us off the hot lava, but also it's not permanent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6220.925,
    "end": 6233.86,
    "text": " And there's a level of engagement that is not as strong as we could possibly grasp, but gets the job done, keeps us in the air, and lets us easily and without repetitive stress grab the next bar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6234.601,
    "end": 6234.721,
    "text": "So...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6235.782,
    "end": 6239.846,
    "text": " How might that be reflected in some of the formalisms of active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6240.426,
    "end": 6245.191,
    "text": "Well, for expected and variational free energy, there are two terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6245.731,
    "end": 6253.819,
    "text": "One is reflecting a divergence minimization, and one is keeping the door open with uncertainty about future outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6254.319,
    "end": 6258.503,
    "text": "So in that balance is like the divergence minimization of the boxer,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6259.304,
    "end": 6261.905,
    "text": " but then also there's something about keeping it open.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6262.525,
    "end": 6269.828,
    "text": "And then it makes me wonder about optimal grip with some of these educational and academic ideas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6270.328,
    "end": 6275.831,
    "text": "What is the optimal grip in a given context of thermodynamics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6276.911,
    "end": 6288.136,
    "text": "Could it be the optimal grip in a easygoing, chill, qualitative conversation to know that thermodynamics has to do with things like temperature,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6289.153,
    "end": 6292.595,
    "text": " And now we're going to talk about something adjacent to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6293.095,
    "end": 6297.256,
    "text": "That was just one bar on the playground to jump amongst.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6298.397,
    "end": 6310.142,
    "text": "And so what does optimal grip look and feel like, and what are the ecologies that support different individuals' optimal grip on different concepts so that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6311.874,
    "end": 6320.682,
    "text": " people can be engaging and interacting in a way that is natural and seamless for them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6320.703,
    "end": 6322.044,
    "text": "Yeah, Remy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6323.482,
    "end": 6328.503,
    "text": " I think there's a case where you're talking about the tactile grips.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6329.063,
    "end": 6332.124,
    "text": "There can be an optimal grip in that sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6332.564,
    "end": 6342.246,
    "text": "And I think in the communicative context, we can also see, for instance, the case that we talked about, the example of moving furniture together.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6342.706,
    "end": 6346.107,
    "text": "There's this optimal grip where, okay, you're holding the couch.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6346.767,
    "end": 6351.711,
    "text": " And you can feel it slipping sometimes and you're like, oh, damn, I must get a better grip.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6351.991,
    "end": 6367.945,
    "text": "But in that case, you have an interactive component and you have a communicative component because you can say when you're feeling your grip slip, you can say stop to the other person to, okay, so the other person can stop moving and then you can get a better grip on the couch.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6367.965,
    "end": 6375.611,
    "text": "So this aspect is that the idea that we tried to put in the paper when we're talking about cooperative communication is that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6376.592,
    "end": 6391.571,
    "text": " there can be an optimal grip from a collective, from an interactive perspective, and communication is a way of achieving that, of achieving an optimal grip by a group of individuals on the context of their joint action.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6391.611,
    "end": 6392.772,
    "text": "And so, for example, if I...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6393.593,
    "end": 6415.182,
    "text": " moving a couch with somebody and i feel my grip slipping i can say oh stop because it will help it will stop the the couch from moving and then it will help me get a better grip in a literal and a figurative sense on the couch so that we can further advance our joint action of moving the couch thank you blue",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6417.788,
    "end": 6426.816,
    "text": " So something else like where is an interesting place where we have grip, where we don't always think about it is in the mental capacity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6427.337,
    "end": 6430.94,
    "text": "So like when you, they talk about overthinking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6431.18,
    "end": 6436.605,
    "text": "So like you think something you can underthink, underprepare, and then you can also overthink.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6437.686,
    "end": 6443.711,
    "text": "So there's like also this optimal space and just as a practitioner of meditation for a long time,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6444.492,
    "end": 6468.649,
    "text": " um when you're meditating on something it's the same so like it's like this over focus like you have to hold it there the object of your meditation but like if you squeeze too tight like if you focus on it too intently it goes away it pops out um and lots of things are like i mean even if you literally grip something if you squeeze it too tight it will pop out of your hand just the force and and um the the laws of physics make it that way so i just wanted to bring that up",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6469.824,
    "end": 6470.324,
    "text": " Thank you, Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6470.705,
    "end": 6473.227,
    "text": "One note on the couch moving example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6473.447,
    "end": 6475.188,
    "text": "It's quickly become our favorite example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6475.228,
    "end": 6477.85,
    "text": "We should definitely do some visuals next time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6481.353,
    "end": 6488.839,
    "text": "It's an interesting example because the communication can be representational and linguistic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6490.1,
    "end": 6493.483,
    "text": "Wait, I don't have enough room for my right hand to come through this doorway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6494.064,
    "end": 6496.846,
    "text": "It's very transmission view compatible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6497.466,
    "end": 6498.867,
    "text": "But also, there's a direct...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6500.491,
    "end": 6513.975,
    "text": " continuous time communication through the mechanics of the couch that are synchronously being experienced in real time and mediated through artifacts and through the niche itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6515.515,
    "end": 6522.798,
    "text": "Linguistic communication has a linear, sequential, and turn-taking aspect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6524.518,
    "end": 6527.519,
    "text": "Active listening is a practice that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6529.286,
    "end": 6545.2,
    "text": " from the point of view of the active listener whether they speak or not brings that real time and continuous engagement to the discourse even if they're listening to a recording or whether they're participating or listening in a conversation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6546.994,
    "end": 6565.045,
    "text": " However, it feels like something really important to unpack as we look towards the linguistic direction to differentiate settings where like through digital stigmergy and note-taking or through physical objects like a rowing team or the moving the couch, there's a mediation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6566.045,
    "end": 6585.235,
    "text": " through the environment continuously, as opposed to something like a correspondence chess game or a phone call where there's a linear turn-taking sedimentation, even though there may still be a continuous unfolding of experience for the agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6585.815,
    "end": 6588.577,
    "text": "So that is a very rich area to look at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6589.037,
    "end": 6589.217,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6591.423,
    "end": 6595.647,
    "text": " Yeah, you're jumping in and saying things that I want to say.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6595.667,
    "end": 6600.272,
    "text": "So we're obviously some sort of simpaticos going on communication-wise.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6600.312,
    "end": 6604.997,
    "text": "What I was going to say is I was going to kind of, now I'm going to build off what you said and what Blue said.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6605.738,
    "end": 6613.706,
    "text": "One of the things that we used to always bring to people's attention in terms of their field of importance is that when you're having to explain something, you have to take your time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6614.855,
    "end": 6615.696,
    "text": " You have to slow down.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6615.716,
    "end": 6617.377,
    "text": "I was working with younger people.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6617.917,
    "end": 6618.918,
    "text": "You have to slow down.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6620.58,
    "end": 6627.986,
    "text": "But the other part of it is you have to know when to hit the hand up reaction button in the Zoom call.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6628.026,
    "end": 6630.568,
    "text": "You have to time your take for full effect.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6631.624,
    "end": 6646.628,
    "text": " So you have to know both of those relativities when we're talking about communication, because if you are, you can show your passion by constantly interrupting another person and actually do yourself a disfavor.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6647.489,
    "end": 6649.469,
    "text": "So the first thing was always slow down.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6650.229,
    "end": 6653.89,
    "text": "The second thing was always think about when you're putting up your hand.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6654.351,
    "end": 6655.931,
    "text": "Think about when it's your turn.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6656.571,
    "end": 6658.892,
    "text": "Allow sometimes for there to be a pregnant pause.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6660.669,
    "end": 6662.29,
    "text": " I know Daniel's very gifted at this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6662.39,
    "end": 6666.753,
    "text": "There's lots and lots of times as the moderator, he could just fill in the space.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6667.253,
    "end": 6672.236,
    "text": "But he's really, really good at sometimes letting the communication happen when nothing is said.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6672.296,
    "end": 6677.759,
    "text": "So I'm going back to what he was asking earlier is, can we signal something by not saying something?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6678.279,
    "end": 6680.241,
    "text": "And I didn't jump in then, but...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6681.121,
    "end": 6692.089,
    "text": " I was kind of hoping to be able to explain that before we have to sign off today, because that's a perfect example of actually doing the signaling without manipulating the symbols per se.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6696.593,
    "end": 6697.373,
    "text": "Interesting stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6698.614,
    "end": 6703.718,
    "text": "Does anyone have any final thoughts in this dot one?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6703.998,
    "end": 6704.999,
    "text": "Yes, please, Remy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6706.289,
    "end": 6715.712,
    "text": " Just quickly, the idea that there's like a skill in when to intervene, speak too much, speak not enough.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6715.792,
    "end": 6721.555,
    "text": "It's like all this dimension, what is called pragmatics in linguistics.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6721.875,
    "end": 6726.136,
    "text": "And there's a really clear example of the notion of an optimal grip.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6726.796,
    "end": 6733.699,
    "text": "Again, in terms of distance, there's an appropriate distance to which you must stand to your interlocutor.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6734.159,
    "end": 6736.462,
    "text": " And that varies in function of culture.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6736.482,
    "end": 6743.208,
    "text": "So if you're really in some culture and some for some person, they can be like really close to you and you're you're uncomfortable for.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6743.469,
    "end": 6748.614,
    "text": "But for them, it might be their their optimal grip in this communicative interaction for their for others.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6748.674,
    "end": 6751.036,
    "text": "Maybe you're you're you must be farther.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6751.076,
    "end": 6754.219,
    "text": "But then if you're too far, then you might hear bad though.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6756.301,
    "end": 6760.223,
    "text": " have a less good understanding of what this person is saying.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6760.563,
    "end": 6766.606,
    "text": "So there's this optimal grip also in the pragmatics of the interaction that, yes, I think that was a good point.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6771.249,
    "end": 6778.913,
    "text": "Optimal grip in space and time and meaning, many spaces for a conversation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6780.006,
    "end": 6786.189,
    "text": " Are you intimately familiar and perturbing and six inches away?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6786.209,
    "end": 6793.513,
    "text": "Or are you yelling purely strategic, impersonal information from across the field?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6794.574,
    "end": 6799.556,
    "text": "A lot of different ecologies, a lot of different agents, so a lot of different communications.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6802.537,
    "end": 6804.958,
    "text": " Blue or Dean, if you have any other thoughts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6805.138,
    "end": 6811.522,
    "text": "Otherwise, that brings us to a very nice end of 48.1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6812.502,
    "end": 6815.084,
    "text": "And I'm sure it'll be a great discussion to continue next week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6819.966,
    "end": 6825.349,
    "text": "Just thanks for providing us with such beefy, juicy stuff to talk about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6825.95,
    "end": 6827.651,
    "text": "I really enjoyed the paper and having you here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6827.911,
    "end": 6828.191,
    "text": "It's great.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6830.447,
    "end": 6831.648,
    "text": " I completely concur, Remy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6831.668,
    "end": 6832.869,
    "text": "It was a fantastic paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6833.549,
    "end": 6846.096,
    "text": "And as I said, there's nothing that I find more intriguing when somebody writes something down, not as providing all the answers, but as opening up all these questions that we've been able to share today.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6846.176,
    "end": 6850.599,
    "text": "So I'm very happy that you were able to join us.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6852.38,
    "end": 6852.58,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6853.0,
    "end": 6853.5,
    "text": "Thank you all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6853.961,
    "end": 6854.521,
    "text": "See you next week.",
    "speaker": "SPEAKER_03"
  }
]