[
  {
    "start": 29.502,
    "end": 29.822,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.743,
    "end": 31.884,
    "text": "Hello, welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.104,
    "end": 39.071,
    "text": "It is September 2nd, 2022, and we're in ACT-INF live stream number 48.0.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 40.512,
    "end": 42.394,
    "text": "Welcome to the Active Inference Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 43.074,
    "end": 48.8,
    "text": "We're a participatory online institute that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 49.861,
    "end": 54.965,
    "text": "This is a recorded and archived live stream, so please provide feedback so we can improve our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 56.041,
    "end": 61.568,
    "text": " All backgrounds and perspectives are welcome and we'll be following video etiquette for live streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 63.19,
    "end": 70.059,
    "text": "Head to ActiveInference.org or ActiveInference.Institute to come to our website, learn more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 71.974,
    "end": 89.412,
    "text": " we are in act inf stream number 48 series we're going to be discussing the paper communication as socially extended active inference and ecological approach to communicative behavior paper in 2021 by Remy tison and Pierre poyer",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 90.387,
    "end": 108.682,
    "text": " the video is a total introduction to some of these ideas it's not a review or capturing every aspect for that you can read the paper and explore some of the ideas we are going to talk about aims and claims abstract roadmap keywords and bring up some notable points",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 110.808,
    "end": 114.889,
    "text": " It is still upcoming with the 48.1 and 48.2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 115.229,
    "end": 122.691,
    "text": "So people are welcome to submit questions or things to discuss, write comments and join the panels live if they want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 123.572,
    "end": 127.113,
    "text": "So let's begin with introductions and warmup.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 127.773,
    "end": 130.814,
    "text": "I think we can share more with our big question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 131.174,
    "end": 134.055,
    "text": "So Dean, why don't you say hello and introduce your big question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 136.035,
    "end": 136.555,
    "text": "Thanks Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 136.895,
    "end": 138.036,
    "text": "I'm Dean, I'm here in Calgary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 141.001,
    "end": 144.363,
    "text": " Well, I could read out the big question, but it's pretty long-winded.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 144.403,
    "end": 157.151,
    "text": "So I'll just say that I'm always curious about what happens when active inference isn't something that we look at as a subject or a topic, but it's something that we actually use or perceive as being around us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 157.211,
    "end": 168.879,
    "text": "And so I think the question of whether or not you focus on what's inside an ecological space or look at the ecology and the system in which we believe",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 169.719,
    "end": 181.884,
    "text": " active inference exists as and maybe within, because in the last 47 livestream, we kind of touched on the idea it could be both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 182.844,
    "end": 194.689,
    "text": "If we're going to expand our horizons and look at what kind of limits are and describe that as an ecology, my question then is, as communication and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 195.313,
    "end": 196.213,
    "text": " of communication?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 196.433,
    "end": 203.696,
    "text": "What is the product of communication and what is communication serve as?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 203.936,
    "end": 205.496,
    "text": "So those are kind of my big questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 205.536,
    "end": 215.099,
    "text": "And I hope in the next three live streams, we can start maybe at least staking out where that ecology begins and ends.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 217.284,
    "end": 245.512,
    "text": " nice well very interesting thanks a lot also for so much of the preparation here we're uh still coming down off of 47 and so i think it's gonna be interesting to see how we approach pragmatism in this discussions so the big questions that brought me to this paper or that i was thinking about during the paper were what are the applications and implications of different interpretations of communication",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 246.755,
    "end": 270.997,
    "text": " why does it matter what would be the things in the world including the mind that would be changed as a factor with or downstream of how our interpretation of communication is and then what are the causes and consequences of different perspectives we take on active inference where perspective also includes action propensity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 271.858,
    "end": 272.779,
    "text": " and engagement with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 273.219,
    "end": 275.881,
    "text": "So perspective is like where one is situated and viewing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 276.761,
    "end": 284.406,
    "text": "And so it's the view from somewhere, from something, rather than a view from nowhere slash everywhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 285.406,
    "end": 293.932,
    "text": "And I think in that specificity, we can have a lot of discussions about ecology as a great system to learn from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 294.392,
    "end": 294.612,
    "text": "Dean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 295.853,
    "end": 300.756,
    "text": "Yeah, I think when we're outside or if we perceive ourselves where we're framing things,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 301.311,
    "end": 304.513,
    "text": " that would be the, on this slide, that would be the first box.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 305.514,
    "end": 308.937,
    "text": "That's our sense that we're kind of outside of the system looking in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 309.877,
    "end": 314.941,
    "text": "Whereas the second box on the right would be, well, we're embedded.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 315.601,
    "end": 321.906,
    "text": "And now the reason we're embedded is the genie came out, got out, and now it's all around us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 321.966,
    "end": 325.909,
    "text": "It's kind of like that the perfume has now been",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 326.331,
    "end": 328.853,
    "text": " distributed through the air and now we're walking through it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 328.973,
    "end": 338.02,
    "text": "So which of those two things, depending upon how we want to analyze, which of those two things produce what results sort of thing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 338.04,
    "end": 341.502,
    "text": "And I think we're both kind of asking the same question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 342.303,
    "end": 343.864,
    "text": "If this, then what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 344.064,
    "end": 345.846,
    "text": "If that, then what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 347.767,
    "end": 348.067,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 349.589,
    "end": 351.29,
    "text": "I'll read the first half of the abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 352.762,
    "end": 380.047,
    "text": " in this paper we introduce an ecological account of communication according to which acts of communication are active inferences achieved by affecting the behavior of target organism via the modification of its field of affordances constraining a target organism's behavior constitutes a mechanism of socially extended active inference allowing organisms to proactively regulate their inner states through the behavior of other organisms",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 383.752,
    "end": 402.442,
    "text": " In this general conception of communication, the type of cooperative communication characteristic of human communicative interaction is a way of constraining interaction dynamics towards the goals of a given joint action by constructing and altering shared fields of affordances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 402.522,
    "end": 413.128,
    "text": "This account embraces a pragmatist view, according to which communication is a form of action aiming to influence behavior of a target and stands against the traditional transmission view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 416.026,
    "end": 419.247,
    "text": " Sorry, I just have to pull it up here because it kind of slid on my screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 420.848,
    "end": 421.428,
    "text": "Where am I?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 421.668,
    "end": 442.974,
    "text": "Transmission view, according to which communication fundamentally serves to convey information, understanding acts of communication as active inference under this ecological interpretation allows us to link communicative and ultimately linguistic behavior to the biological imperative of minimizing free energy and emphasize the action-oriented nature of communicative action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 444.175,
    "end": 444.695,
    "text": "Interactions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 446.104,
    "end": 466.173,
    "text": " all right nice here's the roadmap and there's some light sometimes consistent highlighting at play the paper is prose based there are not any figures or formalisms however many are suggested so we'll have a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 467.213,
    "end": 492.684,
    "text": " interesting time i think making some representations using words maybe some non-linguistic communication because there's so much to add it's not providing visual centers as many papers outside of especially philosophy do so first there's an introduction then the central distinction or dialectic or division is introduced the transmission",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 494.325,
    "end": 507.983,
    "text": " and the influencing the and versus but or the contraries and negations that we've kind of explored this time that type of a dyadic comparison is being brought to two views of communication",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 510.43,
    "end": 529.959,
    "text": " two supporting witnesses join which are ecological interpretation the ecological developments and the turn in that area and active inference and they're going to then in communication active inference focusing on human cooperative communication",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 531.397,
    "end": 548.321,
    "text": " describe how under ecological and active inference starting points, justified starting points, as they'll argue, that we can endorse a pragmatist view at the detriment to the transmission view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 550.721,
    "end": 551.501,
    "text": "Any other thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 551.541,
    "end": 551.781,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 552.821,
    "end": 555.922,
    "text": "Now, the authors are pretty clear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 556.002,
    "end": 559.523,
    "text": "They describe this paper or these arguments as a sketch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 560.444,
    "end": 576.875,
    "text": " So when we say roadmap here, I think it's not a highly detailed, highly specified zoom in on a very precise Google map.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 577.355,
    "end": 581.738,
    "text": "This is kind of a back of the napkin idea for a conversation starter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 582.619,
    "end": 588.083,
    "text": "And so I appreciate that because, I mean, at least by the author's saying,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 589.178,
    "end": 590.241,
    "text": " We want to get this down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 590.281,
    "end": 596.618,
    "text": "We want to stake this out and then let people decide how to come at this empirically to maybe fill in some more of the precision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 597.83,
    "end": 618.663,
    "text": " yeah it's like planning a road trip uh in its implications especially though itself is an entire completed work um let's just jump to the aims well the top two aims are some of the largest they summarize their work as introducing a pragmatist conception of communication",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 619.403,
    "end": 647.106,
    "text": " grounded in ecology of active inference so the three threads are pragmatism ecological interpretation and active inference about communication and they're going to argue that all of communication be understood as socially extended active inference be understood by whom when and uh those are some of the points it brings us to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 648.402,
    "end": 667.342,
    "text": " secondly there are some direct contradictions slash tensions described and um contrasting with the transmission view which is the uh the dancing partner of the advance of the ecological pragmatic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 668.283,
    "end": 682.97,
    "text": " act inf view is to con is by contrast with the transmission view which can help a lot with literature continuity in in uh setting direction for research field people looking for transmission view can see that there's a paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 683.83,
    "end": 705.085,
    "text": " from 2021 that's that's connecting and finding concordances and as dean mentioned they will stress in several different ways that it's an initial account with many gestured to next directions that we'll get to any other thoughts yes yeah i think without using these terms they're they're saying um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 707.111,
    "end": 729.251,
    "text": " know there's there are nodes out there there's there are connect there are potential for connections out there one way of viewing that is through a transmission line and what we would like to do is maybe um advance the idea that those links are are a little bit more embellished than something simple and so again those aren't the terms that they use but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 730.671,
    "end": 732.132,
    "text": " Daniel, you're better at this than I am.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 732.312,
    "end": 742.06,
    "text": "We had a recent live stream this year, I think, where we talked about offloading as being a really important part of extending the active inference term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 742.48,
    "end": 744.422,
    "text": "Do you remember which one that was?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 746.636,
    "end": 746.976,
    "text": " Kind of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 748.296,
    "end": 749.057,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 749.117,
    "end": 749.537,
    "text": "Extended.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 749.817,
    "end": 751.538,
    "text": "If something was extended, let's look.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 751.938,
    "end": 752.538,
    "text": "Yeah, yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 752.838,
    "end": 753.079,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 753.819,
    "end": 755.48,
    "text": "It was with a cognitive offloading.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 756.16,
    "end": 756.76,
    "text": "Cognitive offloading.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 756.8,
    "end": 757.34,
    "text": "Communicate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 757.901,
    "end": 758.141,
    "text": "This is 48.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 758.221,
    "end": 762.463,
    "text": "Oh, extended active inference, constructing predictive cognition beyond skulls, number 41.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 762.603,
    "end": 764.564,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 764.724,
    "end": 771.367,
    "text": "And that live stream, there wasn't really, there wasn't anything in that idea that the betweenness was,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 772.478,
    "end": 787.346,
    "text": " was like the whole idea of how a Markov blanket may function as a way of focusing or bringing down the amount of noise and raising up the amount of signal in a space outside yourself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 787.386,
    "end": 787.846,
    "text": "There was no",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 788.872,
    "end": 813.528,
    "text": " didn't have a lot of pushback on how that theoretically would work so i don't think that they're stepping into the twilight zone by mentioning this nice all right so they make several claims they're summarized here but we'll we'll deal them in the sections in a rough order anything to add though absolutely okay these are just they're going to come up yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 814.088,
    "end": 818.871,
    "text": " Yeah, these are some summaries of some important claims, but we're going to come up with them soon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 819.452,
    "end": 819.712,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 819.832,
    "end": 828.078,
    "text": "And then last stop before we jump into the background, which is one term and then the paper itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 828.338,
    "end": 829.879,
    "text": "What are the key words in your eye?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 832.341,
    "end": 838.565,
    "text": "Well, I mean, we had dynamical systems model in the last live stream, too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 838.585,
    "end": 843.489,
    "text": "So there's a lot of people that are depending on that theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 844.201,
    "end": 846.903,
    "text": " to advance whatever arguments they want to make.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 848.124,
    "end": 859.694,
    "text": "And the other, I think the other term that comes up quite often is joint actions, without really getting into some hard specifics about what that may look like on a scale friendly level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 859.774,
    "end": 869.942,
    "text": "So I think when the authors join us, I think both of those things are things we'll have, there's fertile ground there to, to grow some conversations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 871.607,
    "end": 895.318,
    "text": " awesome the the one i would just want to highlight is dynamical systems model you you mentioned how maybe just rephrasing that people use it to in a lot of different ways and just that being raised made me think about what is being advanced by claiming that alone or together something changes through time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 896.226,
    "end": 897.127,
    "text": " Does anyone disagree?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 897.567,
    "end": 898.949,
    "text": "And would it matter that everyone disagrees?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 899.009,
    "end": 903.614,
    "text": "But what does dynamical mean when we're talking about time-dependent real existing systems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 904.615,
    "end": 908.759,
    "text": "What does it mean that you have a system or a model or a systems model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 910.219,
    "end": 932.289,
    "text": " what does that mean because that's something that's an artifact or is it a quote mental model and so there's a lot to explore about what is being meant by dynamical systems model we're thinking about time or does it mean something more than that continuous time discrete time implementation effects",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 933.868,
    "end": 935.269,
    "text": " There's so many aspects to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 935.369,
    "end": 937.671,
    "text": "And it's actually going to come back at the very end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 938.271,
    "end": 938.511,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 939.352,
    "end": 944.075,
    "text": "And pragmatics, also the top part, you could mention anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 944.235,
    "end": 948.298,
    "text": "Otherwise, Dean, how does this connect to what we discussed in 47?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 951.321,
    "end": 954.483,
    "text": "Well, I kind of wrote this down, so I'd rather read it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 954.903,
    "end": 959.006,
    "text": "Pragmatism and introduction, especially the question of what makes up an aim.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 959.707,
    "end": 962.689,
    "text": "And I put in behind in that, the act, the act.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 963.393,
    "end": 981.52,
    "text": " the process and aiming, which is the central lining, which is, we all know as the generative model given targeting with what, but there's still a question of what are we targeting with when we, when we put it all under one umbrella called active inference, a situational analysis tool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 981.82,
    "end": 987.563,
    "text": "This, this is, we've had lots and lots of people claim that that's what's that's what active inference is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 988.223,
    "end": 990.724,
    "text": "It's a range finder with a depth of filter or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 991.403,
    "end": 999.91,
    "text": " is active inference and affordance generator, something that enables as selection given through framing and step stabilization or both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1000.37,
    "end": 1007.696,
    "text": "Now, if you want to write an academic paper, it's way easier to just limit it to active inference as a stabilizer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1007.756,
    "end": 1011.058,
    "text": "Now we have T0, T1, T2, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1012.119,
    "end": 1018.044,
    "text": "But it's also a way to delimit that temporal, spatial temporal field.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1018.184,
    "end": 1019.345,
    "text": "So do we just ignore that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1019.755,
    "end": 1022.156,
    "text": " because it's easier to write papers if we do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1024.638,
    "end": 1040.386,
    "text": "That's where the arrow of time, meaning we're kind of moving with the flow and temporal depth through the memorial and across the spectral range, whatever we arbitrarily pick as our projectional integration space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1041.926,
    "end": 1050.309,
    "text": " must both be induced or included in whatever the representational is if we analyze the entanglement along with the entailment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1051.009,
    "end": 1052.27,
    "text": "So what is the relationship?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1052.75,
    "end": 1056.091,
    "text": "I mean, is a relationship in the passing of rings?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1056.692,
    "end": 1057.572,
    "text": "No, of course it isn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1057.812,
    "end": 1062.094,
    "text": "But those symbols still reinforce what's going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1062.414,
    "end": 1066.375,
    "text": "So can we just say there's no representationalism in this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1067.856,
    "end": 1071.077,
    "text": "It would be hard to do that on realistic scales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1073.407,
    "end": 1076.109,
    "text": " That would be pragmatics in a nutshell to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1082.034,
    "end": 1084.476,
    "text": "Very interesting closure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1087.238,
    "end": 1093.383,
    "text": "Well, especially if you're recently involved in a long-lasting, long-term relationship, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1095.005,
    "end": 1096.646,
    "text": "It's so true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1096.706,
    "end": 1101.81,
    "text": "The part I'll point out is just the few highlighted words on the top with a lot of citations provided.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1102.751,
    "end": 1116.664,
    "text": " that are gonna be taking a pragmatic federation approach, broadly disparate interests and foci that are being used by these authors in their advancement of an anti-transmission view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1117.224,
    "end": 1121.909,
    "text": "Distributed language hypothesis, constraint view of language, participatory sense-making framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1122.967,
    "end": 1133.993,
    "text": " Maybe those fields are or aren't connected in their citations or co-authorship, but then the authors are able to connect these as kind of three people pointing at the same process or thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1134.414,
    "end": 1145.84,
    "text": "And that's like a nice dense usage that could be really catching people up on a few ways to navigate these topics, because there's a lot of related topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1145.9,
    "end": 1149.722,
    "text": "It's like, aren't we just talking about how things are, including how modeling is?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1152.605,
    "end": 1171.045,
    "text": " um they begin in the introduction with a overview of the layout of their paper and they describe as dean mentioned the sketch it's a pragmatist account of communicative behavior grounded in ecological interpretation of the active inference framework",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1172.366,
    "end": 1199.909,
    "text": " contrasted with a transmission view of communication according to which the function of communicative behavior is to convey information so a claim is that communication is about information transmission then they are contrasting that in light of ecological psychology and theory broadly and also giving an active inference twist slash theory integration",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1201.7,
    "end": 1227.3,
    "text": " introduction of free energy minimization or uncertainty reduction as imperatives or modeling imperatives or existence imperatives whereas some of these previous threads like ecological psychology more neutrally wouldn't have necessarily a formal or a first principles way to connect to modern applications though they may have a first principles grounding in pragmatism",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1228.638,
    "end": 1248.452,
    "text": " so many of the pieces have already been assembled in terms of the ecological and pragmatic and all of these areas coming together outside the paper and so that will be a theme what is linking out to other empirical and philosophical literature what is active inference doing in this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1249.614,
    "end": 1275.202,
    "text": " mediation as a framework something that makes it an organized principle organizing principle in a way that merely the literature corpus of these areas which in many respects have been connected like the pragmatics of linguistics so what is active inference doing anything to add on that well i again i don't think it's hard to argue that um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1276.4,
    "end": 1284.606,
    "text": " to focus only on the string and the two cups is probably reducing too far when we're talking about communication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1284.626,
    "end": 1286.047,
    "text": "I mean, they're entangled, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1286.287,
    "end": 1288.048,
    "text": "Like they're now tied together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1288.088,
    "end": 1294.513,
    "text": "But what the authors are trying to point out here is that there also are signalers and signal receivers in it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1295.293,
    "end": 1301.798,
    "text": "And as soon as you add more layers to this of what's actually going on, suddenly an ecology emerges.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1302.038,
    "end": 1302.198,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1302.748,
    "end": 1310.094,
    "text": " Let's step back and look at everything that is possibly participating in this, not just the hardware.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1310.614,
    "end": 1314.297,
    "text": "And so again, it would be hard to argue against that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1314.557,
    "end": 1328.047,
    "text": "At the same time, if you and I don't have all of the things that we need to communicate from Davis, California to Calgary, Canada, no matter how much we screen, there's no communication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1328.207,
    "end": 1330.709,
    "text": "There's no live stream 48 right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1330.809,
    "end": 1331.97,
    "text": "So again,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1332.998,
    "end": 1341.501,
    "text": " To dismiss a transmission view, I think, is also probably not the best idea in the world because without that, what do you got?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1342.742,
    "end": 1342.922,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1343.822,
    "end": 1344.222,
    "text": "Good point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1344.282,
    "end": 1349.224,
    "text": "And they'll bring up that sort of enabling system perspective in the conclusion very clearly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1350.385,
    "end": 1360.989,
    "text": "They set up the perspective of communication as transmitting information, symbolic information or other kinds of information, influencing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1362.08,
    "end": 1384.713,
    "text": " sculpting what is it influencing is it modifying cognitive dials is it modifying the field of affordances is it doing both is it any number of ways that people have been studying Nexus of communication intraspecies interpersonally everything",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1387.205,
    "end": 1388.366,
    "text": " Anything else to say?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1388.386,
    "end": 1394.511,
    "text": "I was going to say, if you've read anything from Charles Saunders Pierce, you would have to say it's both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1395.812,
    "end": 1405.439,
    "text": "I mean, if you're a purse follower, you're not left with much choice because there's a lot of influencing going on because there's a lot of interpreting happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1406.84,
    "end": 1407.08,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1409.182,
    "end": 1409.542,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1410.403,
    "end": 1410.683,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1411.143,
    "end": 1412.104,
    "text": "Setting the context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1412.124,
    "end": 1415.567,
    "text": "Do you want to mention it or do you want me to mention it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1417.025,
    "end": 1430.565,
    "text": " All right, well, the first footnote is about the notion of information and they describe different information and uncertainty concepts, which we can address in later discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1432.557,
    "end": 1446.049,
    "text": " They do not dedicate a lot of time and space to fleshing out the transmission view and different ways that people have formally, informally addressed it, causes and consequences, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1446.589,
    "end": 1448.491,
    "text": "However, they have provided a lot of citations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1450.43,
    "end": 1462.719,
    "text": " Then in footnote four, they are describing Frege, writing in the 1890s, which is a very interesting connection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1462.899,
    "end": 1467.562,
    "text": "I don't know the details, but some information is provided in this section footnote.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1469.332,
    "end": 1480.099,
    "text": " It's an interesting path that'd be fun to kind of go down more because we've now brought back in Peirce to the discussion as others are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1480.119,
    "end": 1486.062,
    "text": "And I think walking the fine line between not using last names for equations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1487.003,
    "end": 1500.973,
    "text": " while respecting the process and contributions of past researchers and practitioners in just different areas will be really part of what active inference brings together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1500.993,
    "end": 1505.056,
    "text": "All right, anything else?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1507.037,
    "end": 1516.464,
    "text": "All I would say is that I think what this maybe points at, again, this is not what they wrote in their notes, but with every transmission, there are things like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1517.307,
    "end": 1521.349,
    "text": " Conflict embedded in that or complexity embedded in that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1521.389,
    "end": 1526.572,
    "text": "I mean, any good writer knows that you can't just transmit a bunch of information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1526.592,
    "end": 1535.536,
    "text": "There are expectations around what are you moving towards and why would I continue to communicate?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1535.577,
    "end": 1544.041,
    "text": "And so you have to have a context around which that continuing regime of attention is held up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1545.216,
    "end": 1545.396,
    "text": " Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1545.956,
    "end": 1548.497,
    "text": "Share attention, regimes of attention, joint action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1550.337,
    "end": 1556.478,
    "text": "So setting the logic, here they are going to flesh out two primary reasons to explore theoretical alternatives to TV.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1557.158,
    "end": 1562.659,
    "text": "So not they're wrong, they thought bad, but there are two reasons to explore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1563.439,
    "end": 1568.9,
    "text": "We're at camp and we're going to explore some theoretical alternatives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1570.64,
    "end": 1573.901,
    "text": "Firstly, TV entails a commitment to an account",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1575.322,
    "end": 1594.889,
    "text": " the putative contents conveyed via communication providing such an account is notoriously difficult especially if linguistic practices cannot be invoked as part of the explanation very deep points about what is linguistically accessible consciously accessible perceptible under different",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1596.149,
    "end": 1616.114,
    "text": " situations through different kinds of memory and anticipation and all these features which we know do play roles in semiosis and then the second reason why to explore theoretical alternative is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1616.994,
    "end": 1632.863,
    "text": " how it's not clear that communication conceived of as the transmission of content could be relevant to the basic allostatic processes which drive the behavior of organisms so you might say biosemiotically the pancreas communicates with different cells in the body through hormone signaling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1633.852,
    "end": 1658.369,
    "text": " but in a transmission view would one be committed to the viewpoint insulin means do XYZ to whom under what conditions in what ways is that a communication so especially at scales and systems that aren't quite literally humans talking about language which is quite common then there's going to be an account that's non-linguistic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1659.676,
    "end": 1671.859,
    "text": " So to what extent are we going to privilege or center this type of linguistic discourse and communication in a broader ecology of communication?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1674.16,
    "end": 1682.502,
    "text": "So if the content by itself cannot help us derive meaning,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1683.544,
    "end": 1695.129,
    "text": " then what this essentially is saying is that we need more than that in order to get the equal sign or symbol to equate to meaning, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1695.249,
    "end": 1701.332,
    "text": "So that's all essentially what they're trying to talk about here is if we're going to go past TV, why?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1702.554,
    "end": 1710.419,
    "text": " Yeah, it could be a supplement to TV or an extension of TV, which, as they'll point out later, can never be denied or rejected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1711.459,
    "end": 1720.624,
    "text": "So then pragmatism, they trace a thread of scholarship in which language is viewed as a form of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1722.005,
    "end": 1726.748,
    "text": "And I'm reminded of Professor Deborah Gordon's paper, Wittgenstein and Antwatching,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1728.412,
    "end": 1732.887,
    "text": " seeing the behavioral ecologists as they're observing ant behavior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1734.102,
    "end": 1760.954,
    "text": " the multiple stages and steps and ways that knowing and acting and naming of different kinds, namings of activities and then association of activities as named with identities and that naming process that comes in very late in the game in terms of the actions taken to prepare the context for that observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1762.031,
    "end": 1763.832,
    "text": " So I thought that was a very interesting link.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1763.932,
    "end": 1766.252,
    "text": "And here are those green highlighted words from earlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1766.673,
    "end": 1768.293,
    "text": "So what else would you add about pragmatism?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1769.874,
    "end": 1783.178,
    "text": "Well, I think what they were moving towards here, at least alerting us to, is that the fact that there are aspects of a pragmatist view, although it may sound a little strange to say it at first, I think is true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1783.839,
    "end": 1787.98,
    "text": "At least with a pragmatist view, you can now conjure things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1788.513,
    "end": 1791.235,
    "text": " that you can't do simply with content.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1791.275,
    "end": 1795.778,
    "text": "I mean, I can have a whole bunch of ingredients and not have a recipe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1796.318,
    "end": 1799.48,
    "text": "But at least with a pragmatist view now, I can start experimenting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1799.82,
    "end": 1804.243,
    "text": "And I think that's all they're basically asking us to contemplate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1806.285,
    "end": 1808.106,
    "text": "It's the experimentation piece.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1808.206,
    "end": 1817.872,
    "text": "It's not just sort of leaving everything out on the bench and going, whoa, well, I can take an account of this or an inventory of it, but not really do anything with it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1818.846,
    "end": 1822.408,
    "text": " So that's what I took away from this part of the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1823.248,
    "end": 1823.448,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1824.369,
    "end": 1824.629,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1824.929,
    "end": 1827.21,
    "text": "Here's a discussion around what signals mean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1827.61,
    "end": 1828.231,
    "text": "Anything to add?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1830.011,
    "end": 1831.612,
    "text": "No, just read it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1831.832,
    "end": 1832.813,
    "text": "It's pretty straightforward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1833.333,
    "end": 1833.573,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1834.734,
    "end": 1834.974,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1835.994,
    "end": 1845.619,
    "text": "In this section, setting active inference framework, we've informally introduced the ecological interpretation of the active inference framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1847.415,
    "end": 1874.091,
    "text": " in the terms of which we will formulate a pragmatist conception of communication in section communication and active inference um when is it of the active inference framework the genitive case when is it in the active inference framework the locative case with the instrumental case there's so many routes to explore with linguistic and non-linguistic communication",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1875.902,
    "end": 1894.619,
    "text": " even only keeping with active inference as the gripper and the gripped right they provide a description which is copied here and one key line that they'll bring back in service of communication is organisms can reduce free energy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1895.737,
    "end": 1908.908,
    "text": " either by adjusting the sensory input to the generative model, quote, active inference, or by adjusting the generative model to the sensory input, perceptual inference, which correspond respectively to action and perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1909.928,
    "end": 1914.152,
    "text": "So one could ask whether active inference only applies to adjusting sensory input",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1915.686,
    "end": 1920.77,
    "text": " or whether action corresponds to active inference and perception to perceptual inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1920.79,
    "end": 1922.091,
    "text": "That's one way to think about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1922.791,
    "end": 1930.837,
    "text": "It certainly is one sense of active inference, which is inference about action, planning, decision-making, and also the consequences of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1931.687,
    "end": 1935.909,
    "text": " being able to introduce preference into future and current actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1936.93,
    "end": 1944.734,
    "text": "And we're talking about active inference also as a framework for considering this view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1945.774,
    "end": 1952.497,
    "text": "So that was just the connection with active inference there, one connection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1952.637,
    "end": 1959.361,
    "text": "So part of this, I'll ask you, because I may ask the authors when we do the dot one is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1960.663,
    "end": 1976.253,
    "text": " Of this stuff that they just wrote out here, because we've seen this many, many times, people just want to make sure that they're following what the free energy principle up to this point has generally been agreed to mean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1976.793,
    "end": 1986.8,
    "text": "My question from that last organisms can reduce free energy either by... So if I were to give you the metaphor of getting the toothpaste back into the tube,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1989.005,
    "end": 1993.387,
    "text": " how does communication serve that purpose, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1993.487,
    "end": 2000.331,
    "text": "Because it's really easy to squeeze it out, but how does communication serve to get it back in?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2001.592,
    "end": 2011.517,
    "text": "Because it can, but how does what they're describing here as an ecological view speak to that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2015.543,
    "end": 2016.083,
    "text": " Let's explore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2017.845,
    "end": 2021.787,
    "text": "They then go to the ecological interpretation of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2022.668,
    "end": 2045.043,
    "text": "So after introducing just purely in principle, using some active inference ontology terms and key ideas like embodiment of generative models and reduction of surprisal, bounding that through variational and expected free energy, they continue to add in ingredients to the recipe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2046.244,
    "end": 2066.327,
    "text": " and contrast an abstract theory-neutral description of active inference which is their framing of vanilla or standalone or somehow perhaps archetypal active inference as being theory-neutral",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2068.824,
    "end": 2088.311,
    "text": " and therefore compatible with many conceptions of cognition, pointing to a citation where it's described as a state theory compatible with many different process theories, which is why potentially someone could and probably has argued for a transmission view using active inference as symbolic communication or semantic communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2089.151,
    "end": 2092.653,
    "text": "There's probably so many angles on that we could explore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2096.192,
    "end": 2120.286,
    "text": " bringing in the ecological papers, citing some of the earlier ecological psychology and perceptual work in predictive processing, and then just connecting it to more recent papers, for example, Brunberg, Kiverstein, Rittveld, Ramsted, many of these authors' collaborations in about the past six years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2122.207,
    "end": 2122.807,
    "text": "Anything else to add?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2123.748,
    "end": 2123.928,
    "text": "Well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2124.4,
    "end": 2142.15,
    "text": " I got some notes that I want to talk about in the dog one, but I think this is interesting because it would be at this point where if they wanted to introduce formalisms, which basically are just a bunch of symbols set up operationally, that they could, but they haven't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2142.671,
    "end": 2151.436,
    "text": "So how do we explain or how do we take into account all of those formulas that we've looked at",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2152.182,
    "end": 2160.449,
    "text": " through a number of live streams if we're talking about something that's ecological because they are there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2164.272,
    "end": 2179.925,
    "text": "So are they floating around us or are they only something that we keep inside of a very contained, very constrained, very condition set aspect of this diverse, very complex environment?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2181.658,
    "end": 2184.119,
    "text": " situation that we find ourselves under.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2184.199,
    "end": 2204.988,
    "text": "So yeah, that when you, as soon as you say of, I would, I would assume that one of the products of an ecological interpretation would be a whole bunch of formalisms because you could derive those pretty, well, I can't, I'm not Carl or Thomas or one of those, you know, super math people that they can.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2205.448,
    "end": 2209.69,
    "text": "So, so what do we, how do we, how do we account for that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2211.547,
    "end": 2230.593,
    "text": " Yeah, one note on that is some of the famous models of predator prey type dynamics are those dynamical equations are used in neuroimaging to model, for example, winner list competitions amongst brain regions or with different signaling regimes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2231.474,
    "end": 2237.556,
    "text": "So in many ways, the SPM package specifically, as well as neuroscience more broadly,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2238.656,
    "end": 2260.368,
    "text": " Many threads and precursors are here, which is why I really appreciate that by interpreting the way you are about how active inference is being interpreted, there aren't just the bullet point or the visual abstract of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2260.928,
    "end": 2267.132,
    "text": "If that is the active inference that is the interpretation of the author's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2269.52,
    "end": 2298.421,
    "text": " using active inference like they're working through it and making a trace in a process versus just saying well this is the standalone author independent interpretation not sure if that makes sense but all right this uh here's some text on a slide to look at connecting uh spatial temporal structure of affordances in ecological settings",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2299.557,
    "end": 2325.502,
    "text": " the concept known as field of affordances or the landscape of affordances and different affordances different kinds of action capacity introducing how salience and attention and proclivity towards an affordance is determined by its free energy by the free energy is expected to reduce by the system entity or by the modeler um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2327.54,
    "end": 2330.502,
    "text": " And there's a few more notes on ecological psychology and affordances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2331.563,
    "end": 2334.825,
    "text": "Can I just read a sentence in the last bullet there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2334.905,
    "end": 2336.946,
    "text": "I think it's really important too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2337.186,
    "end": 2354.878,
    "text": "Again, to go back to the, I won't ask you to go back to the previous slide, but we don't carry around those formalisms and those operations with us, but humans become attuned to social affordances by being immersed in and participating in shared social cultural practices very early in their development.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2355.259,
    "end": 2357.06,
    "text": "That seems pretty obvious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2357.728,
    "end": 2361.35,
    "text": " This immersion leads to the integration of a social physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2361.81,
    "end": 2373.956,
    "text": "Okay, well then there is math involved in this, which is the set of structured and systemic social contingencies available in an environment of development.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2374.016,
    "end": 2384.601,
    "text": "So even if we can't identify what those formalisms are, those formalisms must be present in order for this early, this thing that we call",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2385.071,
    "end": 2389.955,
    "text": " early development and integration to exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2390.255,
    "end": 2393.758,
    "text": "We can't just say, oh, it's there, but we can't explain it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2394.118,
    "end": 2397.821,
    "text": "There actually is something symbolic and representational.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2398.581,
    "end": 2408.008,
    "text": "Even if we can't conjure it ourselves, there are those aspects which we need to include, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2408.049,
    "end": 2413.813,
    "text": "Just because I don't think of it as math doesn't mean the math isn't present.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2415.339,
    "end": 2421.242,
    "text": " So I think that's a really important one here in terms of making their argument.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2422.062,
    "end": 2434.068,
    "text": "Even though it's an ecology, there's still a lot of formalism that would seem to be abstract, but presents as something real.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2434.769,
    "end": 2438.971,
    "text": "So, yeah, my little two cents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2439.611,
    "end": 2440.712,
    "text": "Yeah, that's it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2442.446,
    "end": 2454.299,
    "text": " interesting direction and made me think about attractors dynamics gravity in social settings and that puts quite a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2456.357,
    "end": 2462.302,
    "text": " spin on Bayesian mechanics as a social physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2463.523,
    "end": 2477.175,
    "text": "And sociophysics has been approached from the classical billiards case, from the statistical thermodynamic informational case, and probably more speculatively by some from the quantum case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2477.755,
    "end": 2483.92,
    "text": "So it's those three mechanics, classical, statistical thermo info, and quantum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2484.541,
    "end": 2484.621,
    "text": "Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2485.302,
    "end": 2498.194,
    "text": " three five however many there are um are what are being proposed in their integration by bayesian mechanics which we'll be discussing in uh that next live stream actually in 49 with uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2500.436,
    "end": 2527.908,
    "text": " some really interesting formalisms to re-enter into so i think it's like seeing what's not there but seeing depth in what they're pointing to even just by discussing integration of social physics we don't need to provide a hundred citations to social crises or tragedies it is just what is gestured towards with what the domain of the work is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2531.462,
    "end": 2531.742,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2533.704,
    "end": 2539.768,
    "text": "In the section communication as socially extended active inference, here's some quotes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2540.488,
    "end": 2541.189,
    "text": "Anything you want to add?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2543.57,
    "end": 2544.831,
    "text": "I just want to read bullet three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2544.851,
    "end": 2558.08,
    "text": "Communication is thus understood as what we might call socially extended active inference situations where the organism reduces free energy by influencing the behavior of another organism in such a way",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2558.817,
    "end": 2567.665,
    "text": " that its sensory input will correspond to the predictions of its generative model, thereby regulating its own internal states by the behavior of the other organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2568.746,
    "end": 2572.73,
    "text": "Other than through formalism, how could we prove that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2574.412,
    "end": 2575.513,
    "text": "Would be my question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2576.754,
    "end": 2576.994,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2577.615,
    "end": 2578.355,
    "text": "Great question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2579.276,
    "end": 2579.797,
    "text": "And, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2581.175,
    "end": 2590.537,
    "text": " What if there are many routes and one can ask somebody to stop writing on the sidewalk with chalk?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2591.197,
    "end": 2593.398,
    "text": "Or they could just wash it while they're gardening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2594.238,
    "end": 2596.258,
    "text": "Or they could go in so many ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2597.019,
    "end": 2607.561,
    "text": "It's like the adjacent possible of the social physics is open in a way that contrived or designed settings aren't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2608.769,
    "end": 2612.63,
    "text": " Which isn't to say they aren't useful or educational, but that's not the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2613.731,
    "end": 2613.911,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2613.951,
    "end": 2621.333,
    "text": "The only way you could prove it, though, I think is through representational, symbolic, operational.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2621.473,
    "end": 2624.974,
    "text": "Like, I don't know how, because every time you try to repeat it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2626.075,
    "end": 2629.456,
    "text": " Someone like Dean comes along and says, oh, I think I know what the game is here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2629.476,
    "end": 2631.057,
    "text": "I'm going to disrupt the game, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2631.317,
    "end": 2634.959,
    "text": "So there really is only one way to prove it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2635.019,
    "end": 2639.24,
    "text": "And so, yeah, I like that they put this in here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2640.101,
    "end": 2646.403,
    "text": "Now, one of our colleagues, Stephen, likes to talk about the prefixes added to active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2647.204,
    "end": 2650.045,
    "text": "And so, again, do we need those prefixes added?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2650.874,
    "end": 2652.918,
    "text": " in order to be able to explain our argument?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2652.978,
    "end": 2657.447,
    "text": "Is it for the convenience of our argument, or do those things really happen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2658.469,
    "end": 2661.956,
    "text": "And can we say they really happen because we can prove it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2663.783,
    "end": 2664.303,
    "text": " All right, nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2665.124,
    "end": 2675.307,
    "text": "The following section is some cases of communication and three areas are highlighted, some cases of communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2676.168,
    "end": 2689.313,
    "text": "And for those cases, one could ask what is or could be a transmission view on that setting or how have people framed a certain case or instance or type of communication as transmission view?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2690.333,
    "end": 2705.864,
    "text": " and then how is an ecological active inference interpretation changing that challenging that going beyond it and three areas that they are looking at are aggressive behavior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2707.134,
    "end": 2730.808,
    "text": " mating or sexual reproductive signaling and alarm signaling and they write about in each of these cases how one might see the type of behavior exhibited there as kind of a canonical signaling case like when you look up signaling you'll find these keywords describing it as categories of signaling and communication",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2731.688,
    "end": 2741.394,
    "text": " And one very excellent book to follow up on is Helen Longino's 2012 book, Studying Human Behavior, How Scientists Investigate Aggression and Sexuality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2742.094,
    "end": 2746.777,
    "text": "They're two of the go-to areas in behavioral study.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2747.477,
    "end": 2753.581,
    "text": "Two of the go-to approaches and phenomena and framings of action and interaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2755.351,
    "end": 2781.481,
    "text": " and this is a very multi and transdisciplinary book that addresses in the context of some recent historical debates around the relevance of genetic inheritance ecological inheritance social structuring all these different topics approached in a really edifying way i think it speaks to the gripper and the being gripped which is kind of the role of what history and philosophy of science has been doing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2783.132,
    "end": 2789.936,
    "text": " in a disciplinary academic way with a certain approach and timeframe and feedback method.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2794.198,
    "end": 2794.418,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2795.058,
    "end": 2795.259,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2795.979,
    "end": 2797.16,
    "text": "Human cooperative communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2798.44,
    "end": 2800.081,
    "text": "Um, anything to add?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2802.502,
    "end": 2809.166,
    "text": "I'm always curious about, um, I put a little note on the, on the actual paper, my copy of the paper",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2812.33,
    "end": 2813.451,
    "text": " about cooperation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2815.312,
    "end": 2821.676,
    "text": "And I'm no expert on cooperation, so I'm sketching this out like the authors are sketching certain things out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2821.716,
    "end": 2825.838,
    "text": "But I think this is what I wrote.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2828.92,
    "end": 2831.021,
    "text": "Let me see here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2831.101,
    "end": 2831.442,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2835.764,
    "end": 2836.185,
    "text": "Neither the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2837.836,
    "end": 2867.229,
    "text": " transmission version nor the ecological field of affordances model can say for certain how long the cooperative state will exist for which requires a different type of analysis over the one that confirms that communication lines are functioning regardless of function type so stepping back and saying that there is a type of communication which we'll call cooperative is great",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2868.647,
    "end": 2880.231,
    "text": " we can say that there's a type here, but just naming it doesn't mean we've actually tamed or been able to explain why that type exists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2880.971,
    "end": 2886.493,
    "text": "So that's one of those things, again, when we have the authors with us, I'd like to chat about that a little bit more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2887.893,
    "end": 2893.995,
    "text": "Yeah, what that makes me think about is even non-communication can be considered part of the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2896.015,
    "end": 2901.237,
    "text": " perhaps shaping the landscape of affordances, perhaps being communication of non-linguistic type.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2901.977,
    "end": 2912.68,
    "text": "And so how could we have a model of communication where the special cases of which there are infinite, the special cases are communications in their embodied sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2913.34,
    "end": 2920.963,
    "text": "And we can also abstract to people who only communicate through social networks, through breathing the same air,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2922.043,
    "end": 2948.493,
    "text": " all these kinds of very loose only ecologically aligned if only on earth aligned views of communication seeing that as like the field from which different forms of communication of cognitive entities arises from rather than something symbolic and transmissive which could only be instantiated kind of from the top down by a symbolic subsystem or sub functionality",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2949.502,
    "end": 2964.072,
    "text": " which isn't denied by a bottom-up view but it's contextualized as part of a process that includes the ecology and the shaping of the field of affordances and landscapes and the stigmergy as something fundamental",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2965.014,
    "end": 2968.916,
    "text": " And that's where the ecology of the context does act as a constraint.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2969.576,
    "end": 2970.577,
    "text": "So, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2970.877,
    "end": 2971.177,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2971.777,
    "end": 2972.038,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2972.778,
    "end": 2973.298,
    "text": "Conclusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2974.199,
    "end": 2981.862,
    "text": "So, they introduced a pragmatist conception of communication grounded in an ecological interpretation of the active inference framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2982.723,
    "end": 2983.983,
    "text": "There's a lot more to develop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2985.044,
    "end": 2986.325,
    "text": "So, where do papers end?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2987.179,
    "end": 2988.9,
    "text": " Where do projects begin?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2990.7,
    "end": 2997.082,
    "text": "And then they mentioned two different directions, which are relatively well-confirmed empirical results.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2999.603,
    "end": 3010.866,
    "text": "First is the work on joint attention and seeing joint attention as a relevant aspect in relationship to coordination on landscapes and relevant for language development.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3011.006,
    "end": 3014.187,
    "text": "And then the second point of empirical evidence that they want to bring in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3014.987,
    "end": 3032.854,
    "text": " is neuroimaging data showing co-activation or partnership in some way of different parts of the body and brain associated with certain actions that seem to be linked in a way that's best understood or coarse-grained as being ecological or embedded",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3034.298,
    "end": 3061.197,
    "text": " then here is the uh part mentioned earlier to conclude it is trivially true that pretty much any episode of communication can be described as a transmission of information as suggested in the section some cases of communication so no bird call no bird call hard to get around that one in practice maybe there's some theoretical tricks but um what if communication is pre-planning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3062.062,
    "end": 3068.484,
    "text": " really hear a bird call in five minutes, really want that to happen or make that happen, and then what happens?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3071.024,
    "end": 3081.987,
    "text": "However, there'd be no communication if there was no information in some sense, that is some form of association between a signal and affordance, which constitute general ecological information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3083.027,
    "end": 3088.689,
    "text": "Semiosis, Persean triad, abductive discussion we had in 47.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3090.254,
    "end": 3118.464,
    "text": " this is the biosemiotic ecological angle that we came from last time and this paper is going to really highlight the ecological and the free energy minimizing aspect via field of affordance modifying through stigmatic modifications or other types of communication maybe just making your body visible in a certain way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3119.409,
    "end": 3124.451,
    "text": " and using that as part of a joint socially co-enacted free energy minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3125.711,
    "end": 3129.712,
    "text": "Pointing the way towards models that would do that, but not as the only endpoint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3130.452,
    "end": 3138.095,
    "text": "But it's in a framing where models could conceivably do that, like through software packages and model design processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3140.695,
    "end": 3148.398,
    "text": "I sometimes choose words not carefully, and I don't think that the word trivially was placed in that last bullet as a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3150.445,
    "end": 3169.248,
    "text": " as a way of provoking but maybe it was I think basically it's basically true but saying it's trivially true is like saying okay well a math proof is trivial because it just is there I think it's sometimes hard to to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3171.258,
    "end": 3174.719,
    "text": " overstate how some of the basics matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3175.379,
    "end": 3179.38,
    "text": "That doesn't mean get locked in just and then stop because you got the basics, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3179.4,
    "end": 3186.002,
    "text": "I mean, there's a whole bunch of stuff that pops out of that and include that too if you're looking at something realistically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3186.122,
    "end": 3189.643,
    "text": "However, I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3189.683,
    "end": 3191.383,
    "text": "I don't know if it's very trivial or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3191.703,
    "end": 3193.684,
    "text": "Like, I don't know that it's that common.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3194.484,
    "end": 3198.525,
    "text": "Some of these more interesting mathematical proofs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3199.488,
    "end": 3207.552,
    "text": " We could say they are because they've already been proven, but that doesn't mean everybody has access to it or even understands the importance of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3207.632,
    "end": 3215.296,
    "text": "So that's just a little side comment because I know I catch myself regretting sometimes describing things in certain ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3217.137,
    "end": 3217.437,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3217.997,
    "end": 3221.819,
    "text": "To defend the trivial, I looked up the definition I really wanted to know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3221.839,
    "end": 3226.462,
    "text": "It turns out it is originating from trivium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3227.651,
    "end": 3251.768,
    "text": " is an introductory curriculum at a medieval university involving the study of grammar rhetoric and logic so maybe it's it's so trivial it's just the kind of trivial details that you end up spending quite a long time working on okay good good defense that would be that would be a funny interpretation you know bring back the trivium",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3254.529,
    "end": 3263.272,
    "text": " Our hope is that the model describes inspires experimental designs that can lead to such theoretical or applied treatments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3263.812,
    "end": 3264.072,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3264.733,
    "end": 3265.413,
    "text": "What are your thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3268.634,
    "end": 3273.795,
    "text": "Well, as I wrote here, I think that means keeping active inference on the bench and constrained to a control setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3274.916,
    "end": 3282.018,
    "text": "I mean, again, if you want to be able to compare to a control, this is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3283.834,
    "end": 3284.855,
    "text": " This is your next step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3285.215,
    "end": 3295.12,
    "text": "However, since when does setting a condition liberate communication to do what communication does, which is release understanding and not just aggregated for the sake of control?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3295.901,
    "end": 3297.842,
    "text": "And I wrote here, time to break out the meme launches.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3297.862,
    "end": 3303.805,
    "text": "Dan, you've got more direct experience with writing about active inference and memes than I have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3303.925,
    "end": 3306.286,
    "text": "Yes, that's the slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3306.966,
    "end": 3307.567,
    "text": "Here we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3308.187,
    "end": 3313.25,
    "text": "Yeah, well, just wanted to kind of explore this and leave some open space to go into it more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3314.045,
    "end": 3314.265,
    "text": " Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3314.746,
    "end": 3321.293,
    "text": "Building on the work of our colleague Maridula, who is a professor in Monterey, California.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3321.313,
    "end": 3322.134,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3322.515,
    "end": 3327.881,
    "text": "She had written about memes as quasi-arguments and about the kind of space that opens in...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3329.803,
    "end": 3352.363,
    "text": " between in enduring the meme and specifically image meme interpretation or interpolation process so in addition to or an alternative to the purely dynamical descriptive and uh evolutionary fitness oriented meme definition commonly used by dawkins and all since",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3353.524,
    "end": 3364.928,
    "text": " this is a very media and cognitive interpretation of artifacts and through a paper in 2021 and in 2022 we used some previous work that had been done by Ekweha et al. 2020",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3371.653,
    "end": 3382.622,
    "text": " on a three-tier model of how to frame complex ecosystems, the kinds that people are usually talking about when they mention ecosystems, like the non-metaphor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3382.802,
    "end": 3388.926,
    "text": "If there were a non-metaphor and it wasn't just app ecosystems and social ecosystems, the one with the trees, but...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3389.933,
    "end": 3411.044,
    "text": " they all um three layers being an instrumental layer of pure observations basically mapping onto observed states then a contextual layer which can bring in some knowledge about how different measurements or inferences about measurements are linked like to common entities and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3411.764,
    "end": 3421.33,
    "text": " and then using this type of statistically inferred information and augmented information from the contextual layer to do inference on pure unobservables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3421.99,
    "end": 3438.56,
    "text": "Those might be things that are observable, but you didn't observe, like the temperature at some point where there wasn't a thermometer, or the true unobservables could be like propensity of this mile square of land to be used for this purpose in the next five years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3439.46,
    "end": 3441.543,
    "text": " But that's not something that could be measured.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3441.563,
    "end": 3446.268,
    "text": "There's no measuring device other than the modeling process, but it's an important modeling process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3446.789,
    "end": 3451.314,
    "text": "And they did amazing work connecting complex systems and ecologies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3452.115,
    "end": 3453.156,
    "text": "And on the rise in...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3455.118,
    "end": 3479.023,
    "text": " tournament in spirit is discussions of digital ecosystems and ecological approaches to communication as noted by the authors here and hence by extension ecological approaches to digital communication and so we were able to modify or to translate and respect the ecosystem integrity three-tier model provided by those authors",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3480.303,
    "end": 3502.348,
    "text": " onto the kinds of digital discourse analysis platforms that would be aligned in that ecological interpretation and way so i think there'll be a lot to explore maybe now maybe next times go ahead yes quick just quickly so would you describe what you did from a and transition to b as an inaction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3505.331,
    "end": 3525.749,
    "text": " was an inaction in the slides software of one type and then it becomes a different inaction when it is shared as a asynchronous file or through live communication with a colleague it's a different inaction when the pre-print is open source and available immediately upon completion there are many levels of and types of inaction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3527.15,
    "end": 3533.754,
    "text": " All right, then it closes with a discourse from Skirms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3534.395,
    "end": 3549.505,
    "text": "Skirms 2010 suggests that in any complex organization, different highlighting, information, transmission, and processing and coordination of action may not be entirely separate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3550.686,
    "end": 3551.046,
    "text": "Gasp.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3554.443,
    "end": 3579.586,
    "text": " skirmish 1996 and skirmish 2010. these are actually really excellent books I hope that is not taken as dismissive but it goes to show what views are seen as and justified to be often needing support and what that means or why that behavior is that way what is that linguistic string for in this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3581.383,
    "end": 3597.78,
    "text": " quote from 2022 written originally in 2010 and then the authors write what fundamentally matters is the control of behavior and not the transmission of information even if the control of behavior may be described as a form of information transmission",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3598.48,
    "end": 3616.809,
    "text": " so very much a syntax semantics question how many bits is the file what does the file mean syntax and semantics in the specific unfolding of the interpretation you can take a top-down overview like 55 of people who did this also did that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3617.549,
    "end": 3634.532,
    "text": " and then there's a bottom-up cognitive view which is the ecological embodied engagement with the image meme or with something like that with the animal signal or mark or smell and then to paraphrase skirmish the information transmission gloss",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3635.313,
    "end": 3637.415,
    "text": " Footnote 35 with some Egan citations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3638.375,
    "end": 3648.082,
    "text": "The information transmission gloss on communicative behavior, if it is to prove useful at all, might be thought of as an aspect of the control of behavior rather than the other way around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3650.564,
    "end": 3652.886,
    "text": "Reversing primacy but not denying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3654.727,
    "end": 3663.473,
    "text": "We propose that conceiving communication in such a way provides better insights into the pragmatic nature of communicative behavior and its evolution as a free energy minimizing activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3663.874,
    "end": 3664.354,
    "text": "End of paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3667.674,
    "end": 3687.3,
    "text": " do you want to add that's basically it we have a few things written down 48.1 but what would you like to add on that i mean what i like about the conclusion is that they say i'm i'm i'm taking and paraphrasing in my own thinking in my own words um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3690.236,
    "end": 3704.882,
    "text": " just because you transmit doesn't mean that you're actually sussing out or determining or confirming the difference between play as one kind of action, playing, and then played.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3705.542,
    "end": 3718.127,
    "text": "So they really want to incorporate that temporal piece, which I think is really smart, which again, I'm a big believer that there's a logic that supports that, which delimits",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3719.386,
    "end": 3725.291,
    "text": " which direction you're necessarily asking to look at time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3725.891,
    "end": 3726.932,
    "text": "Are you going with time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3727.753,
    "end": 3728.934,
    "text": "And there's only one direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3729.134,
    "end": 3730.055,
    "text": "Are you enacting it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3730.755,
    "end": 3741.244,
    "text": "Or are you delimiting and able to place some sort of gap between the memorial and the projectional?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3741.384,
    "end": 3745.648,
    "text": "And the other thing is, I think,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3747.341,
    "end": 3752.122,
    "text": " When we walk into these situations and see them as ecologies, we are going to miss things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3753.283,
    "end": 3765.185,
    "text": "So I think we just have to accept that there will be laterals and collaterals on the margins that will sort of bleed into what our regime of attention is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3765.846,
    "end": 3771.527,
    "text": "And so I think if you only focus on the transmission, my turn, your turn, my turn, your turn,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3772.265,
    "end": 3784.57,
    "text": " You don't have a hope of trying to bring those very important things that are essentially building up whatever you are taking away from this communication exercise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3785.17,
    "end": 3789.771,
    "text": "So again, I think that's something important that they raise in sketching this out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3790.052,
    "end": 3793.713,
    "text": "There's actually a benefit or a feature in not filling it in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3795.343,
    "end": 3798.225,
    "text": " with too much detail, because how could they?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3799.006,
    "end": 3808.814,
    "text": "Every time there's a communication act going on or a dyad happening, the openness of that means there's going to be some scale-friendly fallout.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3809.475,
    "end": 3811.556,
    "text": "It can't be predicted with certainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3811.677,
    "end": 3815.48,
    "text": "So I really like their conclusion, actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3815.58,
    "end": 3820.264,
    "text": "So yeah, there's my thoughts in those last couple of slides.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3824.932,
    "end": 3853.474,
    "text": " a lot to think about i guess and discuss in the coming weeks i think a few last pieces here seeing transmission as enablement for semantics and connecting that to the persian triad and abductive logic and as a uh escaping the nosedive of descriptionism and reductionism",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3854.608,
    "end": 3860.869,
    "text": " by holding space for the pragmatics, if nothing else, of higher order levels of analysis and core screening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3861.389,
    "end": 3873.832,
    "text": "So whether you need to appeal to computational resources, we won't be able to finish the analysis or other kinds of pragmatics, including meaning as pragmatics in the socially extended cognitive space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3874.532,
    "end": 3882.534,
    "text": "Then there's a very rich view in which we don't need to like reject digital signal processing in order to have an ecological interpretation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3884.935,
    "end": 3889.818,
    "text": " I think there's a few other areas we can go into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3890.758,
    "end": 3895.141,
    "text": "So with that, there's other relevant works to share.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3895.161,
    "end": 3898.062,
    "text": "Okay, any final, final thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3900.464,
    "end": 3908.248,
    "text": "No, I mean, what I appreciate is how smoothly and quickly we're able to kind of go through this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3908.268,
    "end": 3911.13,
    "text": "I think that's a testament to the author's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3912.04,
    "end": 3933.543,
    "text": " um being clear about what they wanted to ascribe and what they wanted people to be able and extend off of so it kind of reinforces their idea of this extended active inference instead of them having all the answers they just planted some seeds and let people kind of take it off in different directions which i think maybe was one of their goals i don't know",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3935.157,
    "end": 3935.537,
    "text": " Very nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3935.597,
    "end": 3936.258,
    "text": "Totally agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3936.898,
    "end": 3945.202,
    "text": "Agreed that it's a very readable, clear paper that laid out a nice path with berries to pick from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3945.222,
    "end": 3947.663,
    "text": "A lot of footnotes and paths to explore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3948.504,
    "end": 3952.526,
    "text": "And it is going to be great to discuss it in the coming weeks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3952.546,
    "end": 3956.207,
    "text": "So Dean, thanks so much for the preparation and for joining live.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3956.828,
    "end": 3957.988,
    "text": "And we'll see you very soon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3958.749,
    "end": 3960.069,
    "text": "Same back, right back at you, buddy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3960.409,
    "end": 3960.81,
    "text": "Take care.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3961.23,
    "end": 3961.45,
    "text": "Peace.",
    "speaker": "SPEAKER_02"
  }
]