[
  {
    "start": 36.647,
    "end": 41.974,
    "text": " hello everyone welcome to actinflab to actinflab live stream number 32.2 it's november 16 2021",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 46.889,
    "end": 48.03,
    "text": " Welcome to the Act-Inf Lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 48.75,
    "end": 55.414,
    "text": "We are a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 55.855,
    "end": 58.696,
    "text": "You can find us at some of the links here on this slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 59.697,
    "end": 65.501,
    "text": "This is a recorded and an archived live stream, so please provide us with feedback so we can improve on our work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 66.501,
    "end": 73.386,
    "text": "All backgrounds and perspectives are welcome here, and we'll be following good and fun video etiquette for live streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 75.322,
    "end": 78.264,
    "text": " At this short link, you can see some of the upcoming streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 78.424,
    "end": 84.227,
    "text": "This is our second participatory group discussion on the Stochastic Chaos and Markov Blankets paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 85.067,
    "end": 92.491,
    "text": "And then in the second two weeks of November, we're going to be discussing Thinking Like a State by our friend and co-participant, Avil.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 93.191,
    "end": 95.312,
    "text": "And we haven't yet set the papers for December.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 95.392,
    "end": 104.677,
    "text": "So if you know an author who you'd like to invite, or if you yourself would like to join for several weeks of discussion of one of your works, then just let us know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 107.079,
    "end": 130.4,
    "text": " today in act imp stream number 32.2 we're aiming to learn and discuss and ask what if and what is and hold all these different questions at once we're in the second participatory discussion around the paper stochastic chaos and markov blankets by friston heinz ulzhofer da costa and parr and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 130.94,
    "end": 141.487,
    "text": " And last week we had an awesome discussion in the .1 and we got right up to the cliffhanger where the M word actually was deployed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 142.167,
    "end": 147.711,
    "text": "And I think today we're going to sprint up to that cliff and then jump off.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 148.191,
    "end": 151.834,
    "text": "So it'll be a fun discussion for those who are watching live.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 152.614,
    "end": 164.199,
    "text": " totally write questions and comments in the live chat and steven and dean and i and anyone else who joins will be just more than happy to hear what you have to share and to um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 165.342,
    "end": 167.263,
    "text": " roll with it as you write things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 167.844,
    "end": 172.426,
    "text": "So let's begin just by giving a introduction or a warmup.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 173.027,
    "end": 189.417,
    "text": "So we can say hello, and then also just maybe what was exciting about the paper overall, or since we all participated in the dot one, what are you looking forward to in the dot two, or maybe how have you changed how you thought about it over the previous week?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 190.077,
    "end": 193.199,
    "text": "So I'm Daniel, I'm a researcher in California and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 196.414,
    "end": 201.696,
    "text": " I'll save what I'm excited for until a little bit later and I'll pass it to Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 203.937,
    "end": 204.417,
    "text": "Hi, good morning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 204.957,
    "end": 205.557,
    "text": "My name is Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 205.757,
    "end": 206.677,
    "text": "I'm in Calgary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 208.818,
    "end": 219.862,
    "text": "In the one week's time since we left off, I think this paper more than many of the other papers we've had conversations around breathes life into something that is typically perceived as",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 221.334,
    "end": 240.61,
    "text": " not very alive, it's just sort of a point to and an explanation of, but I think this is one of those papers where when people pick it up and start having conversations with one another about the kind of work that's being done here, it makes it really, really interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 240.63,
    "end": 248.256,
    "text": "It doesn't give us necessarily the answers that the authors could project would be given, and I really like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 249.926,
    "end": 250.446,
    "text": " Thank you, Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 250.646,
    "end": 250.827,
    "text": "Stephen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 250.847,
    "end": 251.807,
    "text": "And I'll pass it to Stephen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 253.948,
    "end": 256.109,
    "text": "Yeah, good morning as well from Toronto.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 258.251,
    "end": 266.455,
    "text": "I'm really interested in this paper, I think, because it does give a unifying perspective.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 266.855,
    "end": 276.741,
    "text": "It does help with that unifying perspective, even though at first when you see things like stochastic chaos, it can be like, oh, we're going down another rabbit hole, et cetera, et cetera.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 277.781,
    "end": 278.402,
    "text": "But actually...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 279.95,
    "end": 290.078,
    "text": " rather than always justifying or talking about applied active influence through applications and quotient applications, there is some benefit to this kind of coming to the foundation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 290.658,
    "end": 291.999,
    "text": "So I'm excited by that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 292.019,
    "end": 303.989,
    "text": "And also actually following a conversation we were having earlier and the fact that we have this complexity weekend is some of the ways that complexity can be talked about outside of a more woo-woo kind of,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 305.219,
    "end": 312.221,
    "text": " conversational sense at these foundational levels, which again seems to get into unnecessary detail.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 313.101,
    "end": 324.484,
    "text": "Ultimately, I think it starts to allow some of these crossovers between applications of complexity and this to happen, which for me personally, I don't think I was necessarily able to articulate a year ago.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 324.504,
    "end": 329.686,
    "text": "So I think some of this work does just help fill in some of those gaps.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 331.715,
    "end": 331.995,
    "text": " Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 332.255,
    "end": 332.896,
    "text": "I agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 333.616,
    "end": 348.424,
    "text": "The system that's picked up and turned around and remodeled throughout the course of the paper in a very narrative-driven way is the Lorenz attractor, which is the classic complex systems model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 349.104,
    "end": 355.308,
    "text": "So it just kind of plays into contemporary work on complexity and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 356.61,
    "end": 384.895,
    "text": " so many other areas but and then also dean i really like what you said like the authors i hope will be able to join for a future presentation so we're in contact they probably won't join today but what the authors are putting out there and then how that's received and um communicated around and explored that's what's fun and um i know that we'll have many cool things to explore today",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 385.928,
    "end": 388.97,
    "text": " So let's jump to the big questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 389.671,
    "end": 394.214,
    "text": "Then we'll look at the roadmap and try to remember where we got to yesterday.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 394.534,
    "end": 397.336,
    "text": "And maybe a different big question is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 398.413,
    "end": 401.155,
    "text": " striking either of you or anyone in the live chat today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 401.756,
    "end": 407.481,
    "text": "And then we'll try to remember how far on our road trip we got last Tuesday.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 408.122,
    "end": 410.744,
    "text": "And then let's see which sections we're going to get to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 411.284,
    "end": 414.007,
    "text": "And we have a bunch of other things kind of written down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 414.707,
    "end": 423.775,
    "text": "So the big questions that we had previously asked were, what is a good model of thingness in a chaotic, dynamic, and dissipative world?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 424.756,
    "end": 429.881,
    "text": " How might this model or approach to thingness speak to system sentience?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 430.601,
    "end": 440.309,
    "text": "And then there in little tiny font, it's sentience not in the phenomenological, like experiential, but greeting Serval, good to see you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 441.47,
    "end": 446.155,
    "text": "But sentience in the sense of thinking and feeling systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 447.475,
    "end": 451.999,
    "text": " without worrying about the first person experience side, at least in this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 452.78,
    "end": 463.329,
    "text": "And then the key technical question of this paper, which broaches onto a million and a half other areas is what is a Markov blanket?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 463.369,
    "end": 464.95,
    "text": "Just what are these blankets?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 465.911,
    "end": 470.417,
    "text": " And how is one modeled, identified, defined statistically?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 470.858,
    "end": 473.141,
    "text": "What are the pros and cons of different approaches?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 473.581,
    "end": 476.045,
    "text": "And so that's some of the technical details that we'll get to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 476.325,
    "end": 478.268,
    "text": "So Stephen, thanks for raising your hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 478.368,
    "end": 479.489,
    "text": "And then welcome, Serval.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 479.589,
    "end": 482.673,
    "text": "After that, feel free to say hello and introduce yourself if you'd like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 485.014,
    "end": 485.715,
    "text": " Yeah, I'm curious.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 486.015,
    "end": 497.188,
    "text": "I notice here that we start with thingness, which I do agree is this big question of thingness is something that Carl Friston brings up quite a lot, but I think he's often...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 498.971,
    "end": 523.024,
    "text": " he's the he in that part i feel he's often a bit of a lone voice in terms of really pushing the thing this side of things and i and i think it's really interesting that second question then of okay how does that speak to system sentience and you see now we move into systems right and okay thing this sort of to me is it gives rise to systems and gives rise to sentience however",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 524.085,
    "end": 524.885,
    "text": " I think it's thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 524.926,
    "end": 526.386,
    "text": "This is still there, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 526.426,
    "end": 526.586,
    "text": "Thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 526.626,
    "end": 529.568,
    "text": "This is still the game in some ways of being maintained.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 529.608,
    "end": 538.053,
    "text": "So that first question, because when we then get into the third question, thing, this can get lost and it's all about system sentience.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 538.113,
    "end": 552.581,
    "text": "And I think there's something really interesting there because, um, there is a question of, I mean, it's, it's even as we say in those brackets, what it really means to have system sentience or even just system is, um,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 553.922,
    "end": 556.103,
    "text": " probably rather ill-defined.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 556.123,
    "end": 560.225,
    "text": "And I suppose to some extent is how much is it even needed?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 561.525,
    "end": 568.468,
    "text": "How much can thingness be maintained as an equal partner in the game and not sort of passed over once we scale?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 568.688,
    "end": 571.91,
    "text": "So I think that's a good piece of a provocation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 573.19,
    "end": 573.55,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 573.71,
    "end": 581.554,
    "text": "And to what extent can things and systems be identified in a bottom-up way from measurements of dynamical systems?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 582.611,
    "end": 584.272,
    "text": " Serval, would you like to add anything?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 584.672,
    "end": 585.193,
    "text": "Or say hello?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 586.013,
    "end": 586.454,
    "text": "Or bonjour?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 589.556,
    "end": 591.237,
    "text": "Hello, I'm Serval.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 592.758,
    "end": 594.679,
    "text": "I'm a complexity scientist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 595.3,
    "end": 602.785,
    "text": "I founded the Cambridge Research Laboratory, which is interested in building inactive models of social political changes, and I'm here to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 605.129,
    "end": 613.594,
    "text": " see the discussion around the formalism of the paper, which I did not revise, and I therefore cannot make informed comments on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 616.276,
    "end": 616.936,
    "text": "Thank you, Sir Val.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 617.777,
    "end": 617.997,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 619.618,
    "end": 621.899,
    "text": "I just want to add one thing to what Steve was talking about there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 623.0,
    "end": 632.966,
    "text": "I think what the big questions and what this paper addresses pretty directly is, can we accept a minimum of two, that there's an abstraction",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 634.005,
    "end": 637.007,
    "text": " and that there's a material aspect to thingness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 638.588,
    "end": 645.773,
    "text": "And marrying those two things is kind of what we're hoping to be able to do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 646.393,
    "end": 650.676,
    "text": "But it comes in two very discrete forms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 651.337,
    "end": 652.778,
    "text": "So what of that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 654.264,
    "end": 658.788,
    "text": " we call it thingness because it kind of spans both realms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 659.529,
    "end": 665.754,
    "text": "And that's what I think I take away from the idea that it can be chaotic and not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 669.758,
    "end": 670.358,
    "text": "Absolutely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 670.779,
    "end": 674.002,
    "text": "There's the map in the territory and the,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 675.06,
    "end": 680.305,
    "text": " one thing that we're gonna return to is like the first map that we apply to the territory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 680.345,
    "end": 685.27,
    "text": "So already we're separating the territory and the map, but even the first map can be chaotic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 685.99,
    "end": 693.657,
    "text": "And then can we put a second map, the Laplacian approximation, as it turns out in the paper, can that second map",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 694.699,
    "end": 713.938,
    "text": " be one that gives us some properties that make it more tractable to handle like you know potholders taking something hot out of the oven give a better grip on the first map which gives a better grip in terms of actionable insight into the territory can that second level",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 714.659,
    "end": 726.806,
    "text": " both be more tractable, especially using computers, but also retain those chaotic properties, which we're going to see when they estimate the Lyapunov exponent of the Laplacian approximation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 727.506,
    "end": 728.146,
    "text": "So, Stephen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 728.386,
    "end": 732.389,
    "text": "That's the recursion prior to the repetitiveness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 733.309,
    "end": 736.671,
    "text": "That's what I think this really gets into, recursion modeling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 737.691,
    "end": 738.052,
    "text": "Thanks, Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 738.072,
    "end": 738.552,
    "text": "So, Stephen?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 740.421,
    "end": 745.723,
    "text": " Yeah, I'm going to put this as maybe a little bit of a question as well, but it's rhetorical if it doesn't want to be answered.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 745.743,
    "end": 758.668,
    "text": "But I think that the thingness and the mark of blanket, because we get into that stage here, there is this, I think there tends to be a sense that, okay, we have a thing and because it's,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 760.339,
    "end": 769.781,
    "text": " trying to sort of maintain itself in a dissipative world, then that's effectively a system, because it's got a Markov blanket and we're in that world.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 770.201,
    "end": 772.581,
    "text": "But with this, it's like, well, look, you've got Lorenz attractor.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 773.461,
    "end": 776.902,
    "text": "Then Lorenz attractor goes into thingness, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 777.562,
    "end": 784.863,
    "text": "Now, and then thingness potentially goes into, probably with a few phases, system, sentient system.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 785.163,
    "end": 787.524,
    "text": "So the question is, which side of thingness",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 789.611,
    "end": 790.712,
    "text": " is Markov blanket.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 791.553,
    "end": 805.667,
    "text": "Does Markov blanket emerge from going from Lorenzo Tractor into thingness and then continue, or is it like Lorenzo Tractor into thingness, into Markovian blanketed thingness?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 808.149,
    "end": 812.914,
    "text": "Curious what your thoughts are on that, and maybe this paper must shed some light on that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 815.046,
    "end": 816.266,
    "text": " Great question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 816.526,
    "end": 822.127,
    "text": "Let's look at the roadmap and just see how that comes into play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 823.248,
    "end": 836.97,
    "text": "So we talked in 32.1 about a few different ideas and we have some slides ready with just tabula rasa if we'd like to add notes or we can always modify slides and deal with questions as people are raising them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 837.731,
    "end": 839.131,
    "text": "Let's go to the roadmap though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 839.471,
    "end": 839.651,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 840.956,
    "end": 843.937,
    "text": " So the roadmap of the paper is as follows.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 844.877,
    "end": 846.338,
    "text": "In section one, there's an introduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 846.718,
    "end": 851.319,
    "text": "In section two, there is from dynamics to densities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 851.88,
    "end": 858.042,
    "text": "So this is one of the really fundamental kind of linking events early in the paper",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 859.022,
    "end": 880.747,
    "text": " where dynamical systems dynamics are linked to flow systems like densities so this equivalence between dynamical systems and density driven systems is going to be finessed extensively in the paper so that's an introductory step that's very important to note",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 881.627,
    "end": 900.621,
    "text": " The Helmholtz decomposition is a tool from vector calculus that applies very well to densities and flows where it's usually applied, but because of what links were made in section 2, it becomes possible to take that Helmholtz decomposition approach to dynamical systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 901.622,
    "end": 915.456,
    "text": " that is specifically visited and revisited and then moved beyond in the lorenz system that's one of those classical chaotic systems and a favorite toy of complexity analysis",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 918.226,
    "end": 926.532,
    "text": " The Lorenz system is moved beyond and then approximated with the Laplacian and then even moved beyond there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 927.093,
    "end": 930.335,
    "text": "So that's pretty much where we got to last week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 930.856,
    "end": 944.526,
    "text": "We tried to do a really solid grounding in first the equivalence between dynamical systems and density driven systems or two kind of representations of underlying systems that could be seen as equivalent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 945.327,
    "end": 956.714,
    "text": " And then we talked about the Lorenz system and about how it's chaotic and how chaotic means like sensitivity to small changes as quantified by the Lyapunov exponent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 957.755,
    "end": 967.801,
    "text": "And then we talked about how the Laplacian approximation, which is kind of like fitting a quadratic, which is kind of like letting the ball roll to the bottom of the bowl.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 968.182,
    "end": 972.545,
    "text": "And this idea of like, well, if we can phrase the problem like a bowl,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 973.405,
    "end": 1001.41,
    "text": " then all we have to do is roll to the bottom there's only one bottom and we know which slope we're on so that's also called convex optimization because no matter where you are if you know that the problem is shaped like a quadratic curve like a bowl you can just instantaneously estimate the slope of the bowl and then just run downhill whereas if you're on a rugged landscape just you know you're lost in a mountain region we'll go downhill",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1002.295,
    "end": 1006.461,
    "text": " you're going to get trapped into a valley potentially, and you might not make it out to the ocean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1007.262,
    "end": 1019.018,
    "text": "But if you could reimagine that rugged landscape in a way that was more bowl-like, it would allow for tractable estimation of which way to move.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1021.041,
    "end": 1026.063,
    "text": " In section four, we get to the Markov blanket concept and the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1026.563,
    "end": 1036.727,
    "text": "And I think that's gonna be the really fascinating discussion is like, okay, so let's get what that Markov blanket, what is that partitioning?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1036.827,
    "end": 1037.947,
    "text": "What are we really talking about?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1038.628,
    "end": 1041.649,
    "text": "And then are we talking about the territory?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1042.557,
    "end": 1047.261,
    "text": " Are we talking about the Lorenz map or are we talking about the Laplacian map?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1047.721,
    "end": 1052.265,
    "text": "Where is this blanket partitioning coming into the picture?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1052.905,
    "end": 1056.328,
    "text": "And then how does that help us reduce our uncertainty about systems?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1057.188,
    "end": 1060.491,
    "text": "And what does it say or not about that underlying system?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1061.091,
    "end": 1064.054,
    "text": "And that's where we're going to be talking about particular partitions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1064.734,
    "end": 1070.018,
    "text": "Of course, a favorite and recurrent pun, which is that particular means specific.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1070.839,
    "end": 1076.883,
    "text": " but also it means like a particle, like a autonomous particle drifting around in space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1077.704,
    "end": 1081.126,
    "text": "And then section five really comes to a...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1082.372,
    "end": 1086.775,
    "text": " culmination with a discussion of the free energy principle alone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1087.495,
    "end": 1100.584,
    "text": "And so I think it'll be interesting to discuss like what is subsumed into the free energy principle and why do we need one section Markov blankets and free energy principle, and then another section on just the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1100.924,
    "end": 1103.666,
    "text": "So that's kind of the roadmap, Stephen, and then deep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1105.356,
    "end": 1131.316,
    "text": " yeah just a quick question see if this clarifies something which i think is what you're saying dynamics is um the dynamics more particular flow like so it's and densities while you could have a density of particles it's actually more like a probability density on wave functions would i be right in thinking is there's a kind of a wave particle",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1132.836,
    "end": 1136.125,
    "text": " or actually a particle then wave way into this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1136.386,
    "end": 1140.857,
    "text": "And that's partly how they're playing this out.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1143.004,
    "end": 1149.951,
    "text": " Someone with more experience with the formalism would be totally open to their contributions on that question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1150.351,
    "end": 1160.381,
    "text": "My first take would be, you could make a dynamical systems model, like equations of motion for a particle floating around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1160.902,
    "end": 1165.546,
    "text": "And so it's like, you're focusing on the first, second and third derivatives of movements",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1166.616,
    "end": 1170.458,
    "text": " in XYZ space or tetrahedral space for some particles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1170.518,
    "end": 1174.501,
    "text": "So a dynamical system model could be describing the movement of a particle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1175.181,
    "end": 1181.965,
    "text": "But the flow that gives rise to the movement of that particle, it's kind of like figure and ground.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1182.506,
    "end": 1186.548,
    "text": "Like the dynamical equation features the movement of that particle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1186.568,
    "end": 1188.709,
    "text": "Like I want to know the pendulum's location.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1189.41,
    "end": 1192.352,
    "text": "And so that's going to be a dynamical model of the pendulum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1193.012,
    "end": 1195.413,
    "text": "Whereas the flow-based models,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1196.394,
    "end": 1202.059,
    "text": " like you pointed out, are much more about, well, what is the underlying space of the flow of that pendulum?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1202.359,
    "end": 1205.241,
    "text": "So it's like, if it's to the left of the bottom, it's like it flows this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1205.301,
    "end": 1207.343,
    "text": "And if it's to the right, it's like it flows that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1207.923,
    "end": 1218.031,
    "text": "And so that is about asking what is the underlying flow dynamics that do give rise to movement of potentially particles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1218.912,
    "end": 1238.188,
    "text": " And those are why this meme is on the slide and why they are made in equivalence early in the paper, because it is like talking about the difference between the movements of a point through a space versus understanding the flow dynamics of that space that, yes, does give rise to the movement of particles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1239.749,
    "end": 1240.69,
    "text": "And could I just ask one?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1240.73,
    "end": 1247.936,
    "text": "So almost it goes from just purely the momentum of a particle to this flow.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1249.202,
    "end": 1263.692,
    "text": " And the flow is kind of a bridge then between density dynamics, which is maybe more of a probability density of where it could be, which can map both to an object where an object might be, but also where a wave function might be in broad sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1263.712,
    "end": 1270.557,
    "text": "So then you're sort of going from literal particles in a classical sense to the flow.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1271.118,
    "end": 1276.882,
    "text": "And then the flow then bridges into density dynamics, which can be more probability orientated.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1276.902,
    "end": 1278.263,
    "text": "Is that fair to say?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1279.321,
    "end": 1302.837,
    "text": " yes particle is going to take a particular meaning a little bit later when we talk about the partitioning of states but i believe that's correct and also the density like you suggested ties much more closely to statistical density distributions like in statistics we're often interested in density distributions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1303.698,
    "end": 1328.808,
    "text": " of a special type like the area under the distribution summing to one the integral over a distribution being one allows us to treat it like a probability distribution and so that's the whole debate in quantum is it actually a wave or does that distribution of positional uncertainty merely describe our statistical inference on the location of something that's at a specific point so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1329.813,
    "end": 1336.72,
    "text": " Whichever side we want to come at this from, section two says it's going to be okay to use both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1337.281,
    "end": 1345.569,
    "text": "And we're going to sometimes lean more on our left leg, and sometimes we're going to lean more on our right leg because there's tools that exist for one but not the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1346.17,
    "end": 1346.33,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1348.533,
    "end": 1366.219,
    "text": " Yeah, I don't know if this begins to answer Stephen's rhetorical question, but I think where most people get introduced to a Markov blanket, they get introduced to the idea that it's either a way of partitioning and dividing, or it's a way of being able to envelop or blanket.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1366.619,
    "end": 1370.12,
    "text": "And I think what the paper points out is that it's both all the time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1370.2,
    "end": 1372.821,
    "text": "So you can, for example, find a box of cookies,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1373.701,
    "end": 1385.112,
    "text": " and see all the cookies settling at the bottom, or the person who's described as being creative uses that box of cookies as a leverage point to get more cookies off the top shelf.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1385.613,
    "end": 1386.514,
    "text": "Now it's a platform.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1387.489,
    "end": 1388.43,
    "text": " And now it's a mound.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1389.23,
    "end": 1394.134,
    "text": "And so we can see it both ways at once if we think of it as both ways at once.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1394.154,
    "end": 1395.255,
    "text": "It's not an or question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1395.795,
    "end": 1402.06,
    "text": "It's that minimum of two piece again that is really fascinating about this that really kind of blows people up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1402.12,
    "end": 1403.221,
    "text": "It's really both at once.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1403.701,
    "end": 1405.222,
    "text": "Then you decide which it's going to be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1406.163,
    "end": 1413.989,
    "text": "And that's what I think is really fascinating for people who are just sort of start getting into this because they've been so habituated to saying, oh, it's a cookie jar.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1414.829,
    "end": 1415.77,
    "text": "Oh, it's a platform.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1415.97,
    "end": 1416.491,
    "text": "No, it's both.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1417.298,
    "end": 1418.536,
    "text": " And that's what we want to do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1419.65,
    "end": 1420.13,
    "text": " Thanks, Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1420.37,
    "end": 1433.757,
    "text": "And Marco in the chat wrote, like a boat in a stormy sea, it moves at the mercy of the seas and winds flowing forces with only its rudder, sails, and other limited mechanisms to steward the world's influence on its journey.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1434.277,
    "end": 1437.738,
    "text": "So Bucky meme one, unity is plural at minimum two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1438.199,
    "end": 1441.96,
    "text": "Bucky meme two on his gravestone, call me trim tab, kind of like the rudder.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1442.561,
    "end": 1446.943,
    "text": "And that is exactly getting at the point of this paper, which is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1447.583,
    "end": 1467.617,
    "text": " If we just were talking about a dust molecule floating in the air, then we could say, well, we could use the dynamical systems model of the position of the dust particle, or we could do inference on the flow of the room, and that gives us a different and complimentary totally co-extant picture, but that's a dust molecule.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1468.377,
    "end": 1478.148,
    "text": " What about active systems that have affordances that are able to do inference on action selection, choose different policies?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1478.768,
    "end": 1480.61,
    "text": "How do those active systems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1481.479,
    "end": 1486.401,
    "text": " do inference, that's the winged snowflake, that's the moth to the flame.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1487.001,
    "end": 1488.861,
    "text": "And those are the really exciting systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1489.281,
    "end": 1507.087,
    "text": "And that also speaks to the difference between what's called mere active inference, like the particle where we can still have this partitioning and still see it as a dynamics or a flow versus the adaptive active inference, which is then we're thinking about those systems where the particle, the particular states",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1507.927,
    "end": 1515.352,
    "text": " are able to affect different policies and select between them in a way that acts as if it's resisting dissipation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1515.712,
    "end": 1519.875,
    "text": "And those are the kind of exciting systems that we want to get to by the end of the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1520.255,
    "end": 1520.515,
    "text": "Stephen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1523.457,
    "end": 1533.564,
    "text": "And pulling on that idea of cookie jar, is the cookie jar is maybe almost a particle, a thing,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1534.69,
    "end": 1539.032,
    "text": " that is like leveraged, and there's a thingness which it becomes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1539.952,
    "end": 1546.615,
    "text": "So say it has a thing about it, but there's a thingness of being an affordance.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1547.295,
    "end": 1562.101,
    "text": "So this is an interesting, just sort of came to me, but the thingness in itself is slightly emergent, because only by the process of trying to use it to get the higher cookie does another kind of thing emerge, which becomes a step.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1563.439,
    "end": 1571.486,
    "text": " So there's something interesting there about the Ness as an emergent, you know, is it ever a step?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1572.387,
    "end": 1572.887,
    "text": "Really?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1574.368,
    "end": 1578.952,
    "text": "But it's always, it's never not a thing at the same time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1579.033,
    "end": 1586.119,
    "text": "So there's a, I think there's something quite interesting there in that emergent stroke, flow stroke, you know, literal sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1587.509,
    "end": 1600.918,
    "text": " And also, I don't know to what extent this is intentional, but thingness, we talk a lot about N-E-S-S, the non-equilibrium steady state or non-equilibrium stationary states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1601.578,
    "end": 1605.681,
    "text": "And so it's like the things-ness, that's the thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1606.001,
    "end": 1608.702,
    "text": "The thing we're talking about is the things-ness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1609.363,
    "end": 1613.626,
    "text": "So we're not talking and saying that the system is at stationarity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1614.086,
    "end": 1615.527,
    "text": "We're saying that the things-ness exists",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1617.045,
    "end": 1621.948,
    "text": " by virtue of how we're modeling it, has stationary characteristics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1623.129,
    "end": 1631.275,
    "text": "And that is the thing as we model it, which is that always existing difference between the map and the territory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1631.615,
    "end": 1634.777,
    "text": "We're not saying that the territory is even a thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1635.377,
    "end": 1643.763,
    "text": "We're saying the way we're relating and interacting with the map, which we totally made, no one's going to deny that, that maps everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1644.435,
    "end": 1646.977,
    "text": " is tractable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1647.217,
    "end": 1648.918,
    "text": "I can hold the map in my hands.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1649.299,
    "end": 1651.52,
    "text": "That gives me better grip on my road trip.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1652.981,
    "end": 1653.282,
    "text": "Stephen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1655.703,
    "end": 1665.851,
    "text": "That's a really... Yeah, I think also the thingness can tie into the idea that something ontologically...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1667.179,
    "end": 1673.322,
    "text": " comes into being through relation, through some sort of network dynamic in which it acts.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1675.203,
    "end": 1677.784,
    "text": "And actually, that speaks to this Lorenz attractor.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1678.424,
    "end": 1687.789,
    "text": "So the Lorenz becomes part of a network of an ontology of thing, which is really a thing in relation to what some other thing is.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1687.829,
    "end": 1692.091,
    "text": "Because obviously, the scale of the cookie box is quite a lot different to the scale of the atoms in the cookie box or the",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1692.791,
    "end": 1694.713,
    "text": " Whatever scale we want to.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1695.374,
    "end": 1697.776,
    "text": "And then there's some sort of affordance level.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1699.097,
    "end": 1701.92,
    "text": "And maybe we can get out of the whole sentient system thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1702.241,
    "end": 1706.004,
    "text": "And it's like it's just an affordance for the thingness to maintain thingness.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1708.026,
    "end": 1716.235,
    "text": "It doesn't need to know about systems as such unless some creature happens to evolve a brain which starts to sit down working out system diagrams.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1716.255,
    "end": 1716.615,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1717.768,
    "end": 1741.154,
    "text": " two-legged ones potentially um otherwise it's like it's just things all the way up right let's now that we're 30 fun minutes in let's um sprint up to that markov cliff and then see where we go so figure one of the paper",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1742.154,
    "end": 1750.721,
    "text": " is kind of making this first fundamental connection between the Lorenz system as defined by dynamical equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1751.182,
    "end": 1756.986,
    "text": "So the traditional Lorenz is defined more like the blue version with an equations of motion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1758.591,
    "end": 1771.5,
    "text": " Well, it has a positive lyopinib exponent, which is to say that very closely located points diverge rather than stay in like a laminar flow parallel line world or converging.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1771.921,
    "end": 1772.601,
    "text": "So they diverge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1773.682,
    "end": 1786.711,
    "text": "And that's what makes Lorenz system chaotic, ergo difficult to predict given measurement error and tiny perturbations due to even thermal noise, which is like kind of how pseudo random number generators work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1788.22,
    "end": 1795.249,
    "text": " And then there's going to be an approximation based upon this stochastic solution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1796.27,
    "end": 1803.198,
    "text": "And so the trajectory in the right panel here, it's the deterministic solution to the Laplacian form of the Lorenz",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1804.264,
    "end": 1806.084,
    "text": " based upon the Helmholtz decomposition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1806.705,
    "end": 1816.427,
    "text": "And so this is sort of like the version on the right that's usually seen in the state space model is almost like we're sampling stochastically from points along that racetrack.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1817.127,
    "end": 1819.087,
    "text": "So that was figure one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1819.927,
    "end": 1825.188,
    "text": "We- Could you just explain that, just go over that one more time, just to clarify that bit.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1825.828,
    "end": 1829.889,
    "text": "I think I understand what you're saying, but it's kind of an important point you make there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1830.549,
    "end": 1832.99,
    "text": "When you say deterministic solution,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1834.454,
    "end": 1840.281,
    "text": " That, I didn't, there is that, just to clarify what that means.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1841.703,
    "end": 1848.952,
    "text": "So the deterministic solution would have no noise so that the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1850.677,
    "end": 1860.885,
    "text": " The position at the following time is entirely determined by the non-stochastic state that it's in at the preceding moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1861.505,
    "end": 1867.33,
    "text": "Whereas when we talk about a stochastic form, it's like, that's like your car's driving",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1869.006,
    "end": 1871.107,
    "text": " and there's thermal vibrations on the road.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1871.667,
    "end": 1881.809,
    "text": "Now, the Lyapunov exponent on that car at non-zero temperature is small so that the flow term dominates the vibratory term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1882.309,
    "end": 1890.411,
    "text": "But there could be some other system where the difference between, well, if it's in an absolute zero world and just on the road, then it's going to go straight.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1890.911,
    "end": 1894.612,
    "text": "But once you introduce any wiggling,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1896.129,
    "end": 1904.031,
    "text": " When the system is chaotic, it has that positive Lyapunov exponent, then the tiniest wiggle causes the system to diverge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1905.751,
    "end": 1906.571,
    "text": "That's really helpful.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1907.531,
    "end": 1915.273,
    "text": "So basically, normally we just, like with the deterministic thing, it's just whatever the initial conditions, if it varies slightly, but then once it runs, it will settle into something.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1915.313,
    "end": 1920.254,
    "text": "But if you've got the initial condition and you've got the perturbations due to noise...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1921.889,
    "end": 1932.72,
    "text": " as it's actually running, which adds, I suppose you could say, a little bit of an extra change in initial conditions to each state that the Lorenz attractor is moving through.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1932.74,
    "end": 1934.562,
    "text": "So, okay, that's helpful.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1934.582,
    "end": 1935.063,
    "text": "Thanks, Daniel.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1935.303,
    "end": 1937.685,
    "text": "Yes, and I'm going to just show this image.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1937.745,
    "end": 1943.952,
    "text": "This is, I don't know if it's the very, very first, but this is the image that Lorenz",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1946.164,
    "end": 1971.412,
    "text": " used to talk about chaos in 1961. so i mean what's the difference between 76.8 and 76.85 it's imperceptible if your thermometer only had like three significant figures you wouldn't even be able to talk about the difference but i mean how different can it be and it turns out that they those two systems start imperceptibly different but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1972.603,
    "end": 1975.504,
    "text": " nearby points in chaotic systems do diverge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1975.564,
    "end": 1978.065,
    "text": "And so it's like, okay, but they're still tracking each other, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1978.525,
    "end": 1980.866,
    "text": "It's like, well, no, wrong, later on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1981.427,
    "end": 1986.949,
    "text": "And so, of course, a more chaotic system with a more positive lyopinib exponent diverges faster.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1987.529,
    "end": 1993.311,
    "text": "But any system with a positive leading lyopinib exponent is going to have divergence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1994.032,
    "end": 1997.413,
    "text": "And so if you have a purely deterministic system,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1999.051,
    "end": 2004.956,
    "text": " or one without this kind of the operative induced chaos, then you can predict far out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2005.837,
    "end": 2015.584,
    "text": "However, prediction matter experts, as Dean I'm sure will revisit us too, meet their match with chaotic systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2015.704,
    "end": 2027.473,
    "text": "And that's actually one thing I hope that we get to by the end, which is that by putting action in every loop and inference on action, we can still, whichever of these timelines we end up on,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2028.325,
    "end": 2029.585,
    "text": " we're going to be doing okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2030.226,
    "end": 2036.548,
    "text": "Because we're always readjusting our inference to whichever of these mountains we're on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2036.588,
    "end": 2040.229,
    "text": "It's not like one of these is better or worse or more or less challenging.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2040.249,
    "end": 2042.33,
    "text": "Like they have the exact same upper and lower bound.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2042.95,
    "end": 2048.632,
    "text": "The only mistake would be to make a prediction and be super confident about it and be on the wrong predictive timeline.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2049.392,
    "end": 2073.27,
    "text": " but as long as we're always updating our predictions then either of these days are going to be okay but if we put on the jacket because we thought that it was going to be cold here and that's when it was hottest then we're injured but if we just think okay well we know we have the jacket afford in so we're just going to keep an eye on that as we watch the temperature and continue to update our predictions maybe then it'll be okay",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2076.499,
    "end": 2080.025,
    "text": " So that was the initial Lorenz attractor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2081.331,
    "end": 2086.512,
    "text": " Section three goes into the Helmholtz decomposition, which we've talked about in several other streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2087.552,
    "end": 2101.475,
    "text": "And we've seen it introduced as the breaking down of a vector field, the total current in this kind of electromagnetic representation into the irrotational, which is kind of like the straight line.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2101.795,
    "end": 2109.457,
    "text": "There's no rotation in those straight lines and the purely rotational solenoidal current flow, currency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2111.141,
    "end": 2113.743,
    "text": " We've talked about solenoidal ingredient partitioning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2114.184,
    "end": 2121.109,
    "text": "And then what this paper does, and I think the technical details are in the Appendix B of 16.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2121.79,
    "end": 2123.571,
    "text": "So that was the Bayesian Mechanics paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2125.293,
    "end": 2127.735,
    "text": "And then also there's this housekeeping big lambda.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2129.486,
    "end": 2143.003,
    "text": " that's in one of the appendices to this paper so that would be like something for someone else to help us understand a little bit of because it does matter and it's actually a key contribution because if",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2144.707,
    "end": 2147.488,
    "text": " the landscape is changing moment to moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2148.068,
    "end": 2160.292,
    "text": "You can't just do the Helmholtz decomposition once and sail on that sea without updating your estimate of the partitioning here, of the decomposition here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2163.612,
    "end": 2168.354,
    "text": "That decomposition, so again, dynamical systems, that's like the position of the car.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2168.814,
    "end": 2171.295,
    "text": "And then we're going to, because of section two,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2173.058,
    "end": 2176.701,
    "text": " having an equivalence between that dynamics and the flow modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2177.781,
    "end": 2186.087,
    "text": "And one of the terms that shows up on both of these is the fancy J, fancy I. It's the self-information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2186.868,
    "end": 2195.174,
    "text": "The first part performs a Riemannian gradient descent on the negative log of the steady state density, which can be interpreted as self-information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2195.754,
    "end": 2203.479,
    "text": " So how surprised should one be to be at a given location relative to expectation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2203.579,
    "end": 2222.19,
    "text": "So we talked about how like the potential energy of the ball higher up on the bowl is higher, and then the potential function drops, and that's the physical analogy to this more informational statistical distribution approach to the self-information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2223.171,
    "end": 2223.531,
    "text": "And then in 3.1,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2225.948,
    "end": 2235.73,
    "text": " that self-information is going to be pursued and expanded upon for a relatively more simple case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2236.45,
    "end": 2254.033,
    "text": "So we're going to identify, due to the Helmholtz decomposition, that there's this key variable which can be interpreted as like a potential function corresponding to the self-surprisal, and that self-surprisal term may have functional forms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2254.983,
    "end": 2259.249,
    "text": " so we can have a function that describes how surprised we should be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2260.07,
    "end": 2260.351,
    "text": "Stephen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2262.674,
    "end": 2265.418,
    "text": "Yeah, if you could go to that last slide, the previous one there,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2267.697,
    "end": 2268.438,
    "text": " I like this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2268.498,
    "end": 2269.259,
    "text": "It's quite useful.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2269.279,
    "end": 2278.489,
    "text": "So the Fokker Planck, if it's at an equilibrium, which we're not at because we're doing non-equilibrium steady state, but if it were, then it would be zero, basically.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2278.509,
    "end": 2281.152,
    "text": "It's at equilibrium, so it's not changing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2281.953,
    "end": 2286.197,
    "text": "So there's no divergence because it's zero.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2287.799,
    "end": 2293.281,
    "text": " And then he's taking this Helmholtz composition, which in a way is like a vector, isn't it?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2293.321,
    "end": 2303.764,
    "text": "With a vector, you can split something's movement into x and y. So the gradient is coming out, and the solenoid is at right angles to the gradient.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2304.505,
    "end": 2308.706,
    "text": "So it's kind of like that trick that he does with accuracy and complexity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2308.726,
    "end": 2313.828,
    "text": "He can say that there's a solenoid and gradient which go together.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2314.775,
    "end": 2320.039,
    "text": " for when it's still in a kind of a particular angular momentum sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2320.899,
    "end": 2329.485,
    "text": "And then there's that ability to, with the housekeeping, to then move it into the flow, which I'm not entirely sure.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2329.505,
    "end": 2336.51,
    "text": "I think that's the bit where we might need some, quite what, because flow could probably be more specifically thought about.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2337.271,
    "end": 2342.234,
    "text": "So now you've got this ability to sort of structure",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2345.094,
    "end": 2349.677,
    "text": " through the kind of more particular context, the solenoidal and gradient.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2350.918,
    "end": 2365.509,
    "text": "And then there's this transition to a more kind of general variable, which can be just, we don't need to get the particulars now because it's a variational metric that just gets used in an approximation sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2366.39,
    "end": 2368.852,
    "text": "And then it follows into what you're saying.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2368.892,
    "end": 2371.274,
    "text": "Would I be on the right tracks with that?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2372.128,
    "end": 2378.091,
    "text": " I'm not sure who he is, even though I have an expectation because it's a multi-person paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2378.652,
    "end": 2386.496,
    "text": "But just looking at these as like circles and triangles and squares, we can see that upside down triangle, fancy I of X is in both terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2386.856,
    "end": 2390.758,
    "text": "So there's like a Q multiplied by something and then a gamma multiplied by something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2391.439,
    "end": 2392.9,
    "text": "And we see that omega",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2394.0,
    "end": 2396.401,
    "text": " is defined as like the Q minus the gamma.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2397.041,
    "end": 2404.243,
    "text": "So these two terms, which were decomposed out from each other, get recombined into the final flow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2405.464,
    "end": 2417.428,
    "text": "So that's just like if it were like A times X minus B times X, and then omega were defined as A minus B times X. So we're recomposing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2418.467,
    "end": 2422.209,
    "text": " a flow equation that still features this fancy eye.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2423.15,
    "end": 2427.812,
    "text": "And yes, we're solving that for a specific point that matters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2427.932,
    "end": 2430.314,
    "text": "We want to solve that for where the ball is at the bottom of the bowl.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2431.214,
    "end": 2445.342,
    "text": "So there's a function that's going to tell us more or less in multiple ways, whether we're more or less away from the bottom of the bowl.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2446.846,
    "end": 2450.508,
    "text": " And again, it's not about the system being at stationarity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2451.288,
    "end": 2456.991,
    "text": "It's about this decomposition having a Fock or Planck steady state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2458.471,
    "end": 2458.732,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2458.872,
    "end": 2460.072,
    "text": "Oh, yes, you've got it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2460.592,
    "end": 2461.273,
    "text": "Just one quick thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2461.613,
    "end": 2473.859,
    "text": "So at the bottom of the bowl, the gradient can effectively be zero, but solenoidal could still have a value because it can still be spinning around at the bottom of the bowl, but the gradient then... Because I noticed the gradient...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2474.818,
    "end": 2496.398,
    "text": " term isn't in the flow but the solenoidal term is oh the gradient is because q minus gamma is in omega so omega is this omega del fancy i is just these two terms combined okay okay yeah dean yeah i was just gonna say what",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2497.932,
    "end": 2507.807,
    "text": " Typically when this is brought forward, it's easier to understand the decomposition and the recompiling if we view the blanket as a partition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2508.428,
    "end": 2512.394,
    "text": "Where it gets a little bit more interesting is when the blanket is literally an envelopment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2513.322,
    "end": 2523.306,
    "text": " And there's a physicist by the name of Keith Humphries who talks about emergence and he looks at that piece of it as well, because there's a polar aspect to this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2523.887,
    "end": 2535.231,
    "text": "We can think of that in terms of positive and negative fields, magnetization and stuff like that, and how that is also a decomposition and a recompiling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2535.812,
    "end": 2538.373,
    "text": "So I understand how it was presented in this paper,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2539.511,
    "end": 2542.474,
    "text": " That's the partition way of looking at it, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2542.674,
    "end": 2552.963,
    "text": "It's more or less, but there's also the positive and negative polar piece to this when we look at the Markov blanket as a blanket, as opposed to a separator.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2553.544,
    "end": 2559.83,
    "text": "And again, if we're holding up two things at once, this doesn't change that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2560.19,
    "end": 2565.315,
    "text": "It's just making sure that we hold both things up at once, the envelopment and the divider.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2566.175,
    "end": 2573.221,
    "text": " I just want to bring that out there because, again, we can see it easier as a partition, like the skin as a partition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2573.481,
    "end": 2576.503,
    "text": "We don't typically see the skin as a platform for sunscreen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2577.664,
    "end": 2578.445,
    "text": "That's my point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2580.046,
    "end": 2580.547,
    "text": "Thanks, Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2580.567,
    "end": 2580.867,
    "text": "Stephen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2583.129,
    "end": 2587.012,
    "text": "Yeah, this is a good point in terms of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2588.157,
    "end": 2590.859,
    "text": " You can imagine, at first I was thinking about gradient.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2591.099,
    "end": 2608.951,
    "text": "It's obvious that you've got a gradient that you can pass through maybe where the gradient's zero, but also solenoidal flow, I suppose, if things are moving around this way and it starts to turn and it starts to go the other way, at some point the solenoidal flow is also passing through a zero.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2609.372,
    "end": 2612.614,
    "text": "So they can both pass through a zero point.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2612.754,
    "end": 2615.656,
    "text": "It just wasn't as intuitive when I first thought about it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2616.294,
    "end": 2616.494,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2616.674,
    "end": 2623.641,
    "text": "And even if you have something that's spinning around, like something that's spinning in a circle, like a hammer thrower, it's actually continual acceleration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2623.921,
    "end": 2625.222,
    "text": "That doesn't mean it's speeding up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2625.763,
    "end": 2628.466,
    "text": "It means that the vector is continually changing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2629.386,
    "end": 2636.894,
    "text": "So now our map is of that acceleration and it is unchanging in how it changes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2638.115,
    "end": 2641.358,
    "text": "So that is to say that the system can have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2643.635,
    "end": 2645.476,
    "text": " in a different way of thinking about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2646.076,
    "end": 2647.537,
    "text": "Yes, a solenoidal component.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2647.557,
    "end": 2650.96,
    "text": "We're not saying that balls at the bottom of bowls are dead and unmoving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2651.78,
    "end": 2660.767,
    "text": "We're saying in our map, there's only one point because we set it up to be like a bowl map where the derivative is zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2662.11,
    "end": 2665.972,
    "text": " That's the solution where the rate of change is zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2666.813,
    "end": 2669.574,
    "text": "So that's not to say that the system isn't moving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2669.915,
    "end": 2673.677,
    "text": "That's to say that the flow steady state has been achieved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2675.413,
    "end": 2681.496,
    "text": " In figure four, well, in figure three, we see the three states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2681.536,
    "end": 2687.738,
    "text": "So this is like the cover of the GEB book, like kind of three different projections from a three-dimensional system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2689.079,
    "end": 2692.901,
    "text": "The second versus the third, the first versus the third, and the first versus the second.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2693.701,
    "end": 2695.142,
    "text": "And we're seeing how there's,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2696.002,
    "end": 2706.711,
    "text": " movements of sampled trajectories, and they're kind of coming back to something that's bowl-like for any set of two dimensions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2707.451,
    "end": 2721.182,
    "text": "So it's kind of like a three-dimensional bowl now, because any two of these dimensions, it's more like a regular bowl, the kind that soup goes in, but then the soup bowl is like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2722.122,
    "end": 2733.968,
    "text": " a down projection of a system that has an attractor in a higher dimension, potentially a much higher dimension, but the Lorenz, they're only modeling three because the particle only moves in three dimensions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2736.289,
    "end": 2745.614,
    "text": "When we continue to investigate the bowl-like properties of our Laplacian approximation to that Lorenz system,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2746.567,
    "end": 2752.772,
    "text": " we see that there's a few different shapes of bowls depending on which angle we're gonna shine the flashlight from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2753.652,
    "end": 2755.874,
    "text": "Some of them are like spherical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2756.615,
    "end": 2764.681,
    "text": "So a spherical bowl doesn't have any specific correlation between the two dimensions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2765.421,
    "end": 2767.583,
    "text": "It's like a cloud of points.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2767.983,
    "end": 2769.965,
    "text": "The regression is just like flat through it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2770.685,
    "end": 2772.267,
    "text": "However, there are some",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2775.03,
    "end": 2776.892,
    "text": " where the bowl is non-random.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2777.452,
    "end": 2782.356,
    "text": "So it's almost like if we were tracking the movement of a ball, it's getting jostled around in these bowls.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2782.917,
    "end": 2788.081,
    "text": "Well, like the one of the first and third, if that was the light we were shining, it would just look like it was a scatterplot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2788.561,
    "end": 2790.563,
    "text": "There's a totally... The regression's flat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2790.923,
    "end": 2792.625,
    "text": "There's not much information being provided.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2792.805,
    "end": 2792.905,
    "text": "It's...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2794.466,
    "end": 2819.172,
    "text": " within the bowl so it already has some nice dynamics but it's kind of within that attractor zone it's a scatter there's no pattern but clearly for the first and the second we see that there is a coupling now imagine if we didn't see the bowl because of course we don't it's not there that's part of our map we're just seeing the movement of that ball as we sample it through time and it would be only on this manifold",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2820.051,
    "end": 2825.373,
    "text": " kind of being like spending more time going from the top left to the bottom right in these images.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2826.734,
    "end": 2843.18,
    "text": "So we're gonna take that idea and then connect it to the Jacobian and the Hessian, which is again, throwback to our matrix math slide and an awesome opportunity for anyone who wants to bring more of a technical interpretation to the stream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2843.92,
    "end": 2847.262,
    "text": "The Jacobian is like the first,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2848.351,
    "end": 2851.512,
    "text": " the unnamed matrix is just like the matrix of position.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2852.532,
    "end": 2855.613,
    "text": "So that's like the first moment of the distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2856.214,
    "end": 2859.455,
    "text": "And then higher moments are like the partial derivatives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2859.715,
    "end": 2862.356,
    "text": "So Jacobian is like the first order partial derivative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2862.856,
    "end": 2865.877,
    "text": "So that's like the slope of the ruler at that point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2866.237,
    "end": 2868.958,
    "text": "And then the Hessian is the second partial derivative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2869.418,
    "end": 2870.378,
    "text": "That's like the curvature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2871.039,
    "end": 2874.44,
    "text": "So if it's a bowl, there's only one point where it's flat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2875.14,
    "end": 2879.365,
    "text": " And then it could be flat and the bowl could be like up or the bowl could be upside down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2880.046,
    "end": 2886.574,
    "text": "And so that's why it's important to also have this second curvature term to understand whether we're at a bowl like this or a bowl like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2886.954,
    "end": 2888.636,
    "text": "So that's kind of like calculus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2890.318,
    "end": 2892.541,
    "text": "And those...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2894.269,
    "end": 2899.531,
    "text": " bowls, those bowl attractor shapes, which we're inferring using the Laplacian quadratic assumption.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2899.911,
    "end": 2906.673,
    "text": "So it's not saying that the Lorenz has these, possesses these, is these, it's saying that's the approximation that we're going to make.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2908.754,
    "end": 2920.057,
    "text": "It turns out that although there's somewhat of an unclear correlation pattern in the first derivatives, so like the movement to the left, it's not like it's correlated with movement up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2920.897,
    "end": 2922.598,
    "text": "However, the second",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2924.514,
    "end": 2930.838,
    "text": " partial derivative, the Hessian matrix, starts to look a lot like the covariance matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2931.659,
    "end": 2943.427,
    "text": "So the actual positional covariance of these states with each other, so like the on diagonal is kind of obvious, like of course your position on the x-axis is correlated well with your position on the x-axis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2944.247,
    "end": 2949.711,
    "text": "But there are correlations between state one and two, and the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2950.64,
    "end": 2960.168,
    "text": " That is recapitulated in the structure of the second order polynomial approximation to these attractors that are Laplacian approximations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2960.889,
    "end": 2969.897,
    "text": "So again, up until that point in 3.5 and in figure six, Markov has not been introduced.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2971.423,
    "end": 2993.677,
    "text": " nothing has been said that word hasn't come into play it didn't come into the system's definition and so that's just really important because it's just showing like there's a lot of groundwork to get to where we make the markovian partitioning and so there's power and challenge in that stephen",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2996.152,
    "end": 3019.64,
    "text": " Would I be correct in saying that effectively it's a case of approximating the states of the Lorenz attractor and that's what's currently there so this is different ways of showing that within some manifold state space and by approaching it in different ways it",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3021.013,
    "end": 3023.315,
    "text": " reveals a different type of approximation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3023.655,
    "end": 3026.677,
    "text": "The only thing I would ask, I'm a little bit confused why it does squish.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3027.197,
    "end": 3028.198,
    "text": "Maybe I'm missing something.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3028.458,
    "end": 3031.9,
    "text": "I can see why there'd be kind of a round one.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3031.92,
    "end": 3035.642,
    "text": "I'm just trying to work out how it squishes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3035.703,
    "end": 3040.145,
    "text": "Is it something to do because of the solenoidal piece or the gradient piece, or is there something else?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3041.426,
    "end": 3041.686,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3042.567,
    "end": 3049.992,
    "text": "So if we were talking about just a particle undergoing Brownian diffusion in three dimensions...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3051.201,
    "end": 3056.125,
    "text": " So it doesn't have any kind of correlations or any sort of structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3056.505,
    "end": 3058.247,
    "text": "It's just a random walk in three dimensions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3058.887,
    "end": 3063.25,
    "text": "Well, then it would have a spherical error profile for all of these images.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3064.076,
    "end": 3072.161,
    "text": " But we are capturing structure that exists because Lorenz attractor has a specific specification.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3072.962,
    "end": 3075.824,
    "text": "So the states are whichever are being modeled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3076.044,
    "end": 3081.807,
    "text": "If you cared about pressure and volume, that's your state space, that two-dimensional state space of the map.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3082.208,
    "end": 3084.329,
    "text": "It's not saying those are the only states of that system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3084.369,
    "end": 3085.93,
    "text": "It's just, those are the ones that you're modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3087.431,
    "end": 3090.313,
    "text": "In the Lorenz system, we have three states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3091.013,
    "end": 3092.935,
    "text": "It's positioned in three dimensions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3093.82,
    "end": 3104.062,
    "text": " But those three dimensions, again, also apply to a Brownian diffusing particle, which has a different Jacobian covariance and Hessian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3104.962,
    "end": 3111.884,
    "text": "We're talking about those being calculated for the Lorenz system with the parameters that they selected.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3113.144,
    "end": 3122.606,
    "text": "And so we are pulling out covariances and connecting it to this second order polynomial approximation in the Hessian",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3123.643,
    "end": 3128.75,
    "text": " for a system where the movement is not just a Brownian diffusion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3129.291,
    "end": 3135.759,
    "text": "And so that's why there's structure in the covariance, and that's why the structure is interestingly recapitulated in the Hessian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3135.959,
    "end": 3136.1,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3137.745,
    "end": 3165.626,
    "text": " Yeah, and all I would supplement that with is things, things, here we go, things that are in something that's moving, the thing that's moving, that's in something that's moving, that's on something that's moving has a tendency to have the negative charge things all congregate in one place down in the lower right corner and all the positive things all congregate in another place.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3166.371,
    "end": 3167.852,
    "text": " in the upper left corner.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3168.093,
    "end": 3169.934,
    "text": "That's the nature of movement.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3170.735,
    "end": 3180.364,
    "text": "And so that polar part of it is in play as well, if we consider it as part of these statistical transitions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3180.685,
    "end": 3189.052,
    "text": "And that's, again, it's fascinating if you look at it a minimum of two things, so not just",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3189.983,
    "end": 3198.907,
    "text": " not just as a partition, but also as an envelope, those things suddenly pop out at you and you see the pattern in a different way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3200.127,
    "end": 3205.65,
    "text": "So I want to think about a physical system that's not chaotic, but will help us understand what this covariance matrix is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3206.19,
    "end": 3208.811,
    "text": "So let's think about a children's carousel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3209.611,
    "end": 3212.433,
    "text": "So it moves, the horsey is moving around in a circle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3212.593,
    "end": 3215.054,
    "text": "And so that's like our unit circle, like the four quadrants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3215.194,
    "end": 3217.315,
    "text": "And then also the horsey is going up and down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3218.075,
    "end": 3239.736,
    "text": " okay so when you're you know so again it's like you know if you were at 12 o'clock on the carousel it's like you have a one for the y and a zero for x okay so i hope that makes sense now as it goes around it's like 0.5 and 0.5 again just using simple numbers here like the x and the y are correlated and then they're also correlated here so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3241.875,
    "end": 3266.866,
    "text": " one could say that there's like a correlation between the x and the y like they have a covariance together but now the z-axis is moving up and down independently so a system like that you'd see a covariance between the x and the y positions of the horsey and not that they're a different system but that they are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3267.978,
    "end": 3268.718,
    "text": " uncorrelated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3268.758,
    "end": 3272.44,
    "text": "They don't provide mutual information on the Z axis, which is oscillating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3273.04,
    "end": 3288.987,
    "text": "Now, if this paper had done, we model a deterministic carousel and it's kind of like putting the rabbit in the hat because the covariance matrix, it looking like this would be no surprise because it would have been defined that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3289.607,
    "end": 3291.388,
    "text": "So that's the key insight.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3291.628,
    "end": 3295.549,
    "text": "And one of the key contributions is like, they didn't put this in the hat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3296.45,
    "end": 3296.81,
    "text": "This is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3298.359,
    "end": 3300.1,
    "text": " the OG complex system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3301.12,
    "end": 3312.166,
    "text": "Yet the approximation, the Laplacian approximation pulls out a covariance structure that's extremely tractable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3313.167,
    "end": 3321.931,
    "text": "And it turns out that it still has a very strongly positive and very similar Lyapunov exponent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3322.752,
    "end": 3324.713,
    "text": "So it's like, now it's like a chaotic carousel,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3325.979,
    "end": 3344.2,
    "text": " And yet our approximation, our map of that chaotic carousel still holds the chaotic nature of the system while also giving these bowl-like attractors for any given two and even all dimensions or states considered simultaneously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3347.043,
    "end": 3370.081,
    "text": " we're not conflating the simplicity of a non-equilibrium steady state with the complexity of the underlying density dynamics so just because the map is simple doesn't mean that the territory is and so that to me is a knockout blow against realism and for instrumentalism because this paper's saying nothing about the underlying system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3370.902,
    "end": 3373.443,
    "text": " Act-inf doesn't say anything about the underlying system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3373.763,
    "end": 3377.664,
    "text": "We're talking about approximations and our maps of territories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3378.504,
    "end": 3386.006,
    "text": "In other words, the probability density can evolve in a complicated fashion in attractors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3389.707,
    "end": 3390.167,
    "text": "Go ahead, Steven.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3392.21,
    "end": 3398.699,
    "text": " And from what you're saying, it's like if I was to take that Lorenzo tractor, which is like a saddle.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3398.719,
    "end": 3399.981,
    "text": "People often talk about a saddle.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3400.501,
    "end": 3401.342,
    "text": "And you took the most...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3404.949,
    "end": 3407.15,
    "text": " agreeable way of viewing it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3407.27,
    "end": 3419.256,
    "text": "So you view it in a box space this way and look for how it's moving that way and then flip the box like this and see how it's moving that way and flip the box like this and see how it's working that way.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3420.036,
    "end": 3423.658,
    "text": "Those approximations would be those three different distributions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3424.198,
    "end": 3427.68,
    "text": "However, if you'd have moved it by like one degree,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3429.401,
    "end": 3432.143,
    "text": " that would be like messy, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3432.163,
    "end": 3453.154,
    "text": "So it's like, if you look, it's almost like this is how the Lorenz attractor taking the most optimal view of X, Y, Z can be mapped out as it transgresses through the saddle, if that makes sense, to bring it into a physical space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3454.955,
    "end": 3458.437,
    "text": "But again, it's more complex than that because this is taking it where there's",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3459.588,
    "end": 3471.05,
    "text": " the Fokker plank is zero to try and get the most optimum sort of, that's why those things are, follow a nice stable transition.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3471.11,
    "end": 3476.551,
    "text": "Whereas if you'd taken a sort of an odd angle, it might all be completely a mess.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3477.632,
    "end": 3479.692,
    "text": "Would that be a fair way of saying it?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3481.792,
    "end": 3485.013,
    "text": "If you were to take a perspective, a projection down,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3486.627,
    "end": 3496.77,
    "text": " that was a mixture of other axes than, I'm not sure what is gained by that, but I see what you're saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3496.81,
    "end": 3510.254,
    "text": "There's some particle moving in three dimensions and you can have a projection into any side of that cube, or you could take some sort of off kilter view that would be still some type of linear summation of all three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3510.374,
    "end": 3515.796,
    "text": "So it hasn't really reduced the challenge of estimating, but yes, I mean, that's one way to see it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3516.136,
    "end": 3516.296,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3518.96,
    "end": 3520.702,
    "text": " So I'm in complete agreement.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3521.182,
    "end": 3527.208,
    "text": "It has to be instrumental so that you can compare to the real, so the minimum of two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3527.768,
    "end": 3532.292,
    "text": "You have to have multiple maths, not one, in order to be able to see this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3533.013,
    "end": 3541.441,
    "text": "And that basically then reinforces the idea that the Markov blanket has to both, at the same time, be a partition and be an envelope.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3541.921,
    "end": 3544.464,
    "text": "It's both at the same time, a minimum of two again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3545.532,
    "end": 3555.336,
    "text": " So again, all we keep reinforcing is this idea that if we over reduce, if we get to a place of under two, we may be deceiving ourselves.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3557.137,
    "end": 3558.738,
    "text": "And I think we'll come back to that soon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3558.858,
    "end": 3565.621,
    "text": "So now, one hour in, we're able to get to the Markov blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3566.764,
    "end": 3589.898,
    "text": " okay so previously we were talking about the case of a single markov blanket and so if we thought about like a bayesian graph so now we're thinking about three nodes each corresponding to the x y and z axis nodes a and b you know the first two axes would have like an edge between them because they have some type of statistical relationship",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3590.987,
    "end": 3596.732,
    "text": " And then it would be disconnected from the third node because it doesn't have a statistical relationship with them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3597.533,
    "end": 3614.828,
    "text": "Okay, so now to actually start to get towards more like the communicating systems or system in the niche that we're interested in, that's the target that we're trying to aim towards in section four.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3615.779,
    "end": 3625.001,
    "text": " The authors repeat the analysis of the previous section, but approximate two Lorenz systems that are coupled to each other through their respective first states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3625.761,
    "end": 3628.102,
    "text": "Okay, so we're going to look at this matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3630.222,
    "end": 3637.624,
    "text": "Okay, so notice that there are two, this, make that transparent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3638.224,
    "end": 3641.065,
    "text": "So here's one Lorenz system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3643.066,
    "end": 3647.749,
    "text": " Here's the other Lorenz system, the red one and the blue one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3648.769,
    "end": 3654.533,
    "text": "And then there in these other cells, these are the coupling terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3656.303,
    "end": 3658.745,
    "text": " So these are couples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3659.326,
    "end": 3662.949,
    "text": "This is saying that the first state of each are coupled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3663.469,
    "end": 3674.078,
    "text": "So it's a bidirectional coupling and that it's saying like state one, the fourth state on the matrix, like matrix row and column four is the first state of the blue system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3675.646,
    "end": 3686.428,
    "text": " The first state of the blue one, the top left of the blue and the top left of the red are coupled through the off-diagonal green boxed terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3687.389,
    "end": 3695.93,
    "text": "If this was all zeros, nine zeros here and nine zeros here, we would have two independently evolving Lorenz systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3696.531,
    "end": 3698.151,
    "text": "So we kind of took the Lorenz system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3699.107,
    "end": 3703.051,
    "text": " the three by three matrix that specified the dynamics of that system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3703.932,
    "end": 3718.486,
    "text": "And then we just made another, now a six by six matrix with two Lorenz systems that would be evolving statistically independently unless we introduce this targeted coupling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3720.049,
    "end": 3724.071,
    "text": " And they say this form of coupling was chosen to be as simple and symmetric as possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3724.811,
    "end": 3735.897,
    "text": "Okay, so this is like the next step, but it's a difference that makes a difference because this is going to change the total dynamics of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3736.477,
    "end": 3745.822,
    "text": "If you had just the red and just the blue, you could like split that matrix and you'd be getting the exact same modelability because the systems wouldn't be interacting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3746.598,
    "end": 3759.983,
    "text": " But now we've introduced these terms, even if we only had one, where you can no longer divide this matrix into sub matrices that perfectly describe the time evolution of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3761.543,
    "end": 3763.064,
    "text": "So seven, figure seven,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3764.281,
    "end": 3765.983,
    "text": " is like figure three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3766.883,
    "end": 3774.69,
    "text": "So it's similar, we're taking like sort of pinpoint locations on the Laplacian approximation of the Lorenz system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3775.611,
    "end": 3781.376,
    "text": "And now seven is doing the same, but it's looking at these two synchronized systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3782.056,
    "end": 3783.497,
    "text": "Or maybe it's better to say that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3784.403,
    "end": 3789.107,
    "text": " there's two coupled systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3789.187,
    "end": 3789.407,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3789.547,
    "end": 3802.877,
    "text": "And due to the structure of their coupling, it results in an entangled movement pattern such that their trajectories have very, their trajectories are informative of each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3804.098,
    "end": 3811.003,
    "text": "And that's also reflected by this flow diagram where clearly they're,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3812.717,
    "end": 3815.465,
    "text": " movements exist on a manifold",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3816.462,
    "end": 3819.264,
    "text": " that's in a restricted space of the possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3819.545,
    "end": 3825.87,
    "text": "So two people, Brownian diffusing in two separate rooms, you'd get that circle scatterplot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3826.951,
    "end": 3830.775,
    "text": "Two people who are tied to each other, you would see a perfect correlation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3831.395,
    "end": 3841.984,
    "text": "And so we're seeing something, even though each system has complex and even chaotic endogenous dynamics, we're seeing that the introduction of this coupling term",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3843.163,
    "end": 3871.091,
    "text": " allows the systems to actually empirically have entangled behavior steven we've now got lorenz systems as opposed to an attractor and i'm curious when does it go from an attractor to a system is it because is that does the coupling effectively start to create more systemic",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3872.748,
    "end": 3875.351,
    "text": " nature or, you know, I'm just curious about that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3875.371,
    "end": 3880.377,
    "text": "Um, systems, the Lorenz system is just these three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3880.537,
    "end": 3884.802,
    "text": "This is the specification of a Lorenz system and it has, it's a chaotic attractor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3885.403,
    "end": 3886.825,
    "text": "And so now we're talking about two of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3888.206,
    "end": 3894.232,
    "text": " So there's two coupled Lorenz systems, but it doesn't make sense to talk about two coupled attractors because that's not what's coupled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3894.272,
    "end": 3897.175,
    "text": "The systems are coupled as per the matrix specification.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3897.875,
    "end": 3902.12,
    "text": "And then it doesn't even make sense to couple the attractors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3902.64,
    "end": 3908.005,
    "text": "The whole point is there is an attractor now by virtue of the coupling of the Lorenz systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3909.487,
    "end": 3912.67,
    "text": "Is it almost like once you start to have something and you're going to relate them,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3913.899,
    "end": 3918.721,
    "text": " As soon as things relate, there's a system because there's a relational quality to it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3919.581,
    "end": 3923.522,
    "text": "Whereas previous that it could be a mathematical formalism.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3923.883,
    "end": 3925.483,
    "text": "It was still described as Lorenz system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3925.523,
    "end": 3930.965,
    "text": "So I wouldn't get too hung up on that word, but yes, systems have multiple interacting parts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3932.966,
    "end": 3933.146,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3934.526,
    "end": 3941.729,
    "text": "Figure eight, just like seven revisited the format of three, eight is going to revisit four",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3942.961,
    "end": 3946.204,
    "text": " And now we're going to get to where we start to see the partitioning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3947.205,
    "end": 3948.426,
    "text": "Figure eight's going to revisit four.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3948.506,
    "end": 3954.49,
    "text": "So remember the first partial derivative, the second partial derivative, and the Jacobian and the Hessian respectively, and then the covariance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3955.031,
    "end": 3960.776,
    "text": "So we're going to do that same thing that we did on a three by three, but now we're going to do it on a six by six.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3961.816,
    "end": 3966.66,
    "text": "The log Jacobian looks a lot like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3967.421,
    "end": 3970.363,
    "text": "The non-zero cells in the specification of the system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3971.417,
    "end": 3975.4,
    "text": " which is the system itself for systems that we get to specify.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3976.401,
    "end": 3977.682,
    "text": "It looks a lot like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3977.982,
    "end": 3997.978,
    "text": "But again, for territories we don't get to specify, the map looking like this does not say something specific about the territory, but it's not super surprising that we actually see like similar this top right has like no correlation, like one and three are not correlated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3998.638,
    "end": 4001.34,
    "text": " and we see that little chip missing here and here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4002.001,
    "end": 4011.93,
    "text": "So we see a lot of the same dynamics at play within each of the coupled Lorenz systems, but also we've introduced a coupling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4013.123,
    "end": 4018.206,
    "text": " Now that coupling induces a new and different covariance structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4018.947,
    "end": 4022.389,
    "text": "Look at these gray squares in the off diagonals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4023.089,
    "end": 4040.42,
    "text": "Now one and two of system A are coupled to one and two of system B. Less so, a little bit grayer than the one that are within each system, but still very marked bidirectional synchronies being induced.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4041.909,
    "end": 4065.908,
    "text": " interesting piece comes into play when we look at this second order approximation and that's where we see that several cells can be identified so here we have like the magenta uh mute please steven thank you the magenta and the red are those first states of system a and b those are the ones that have the coupling on the fourth okay",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4067.068,
    "end": 4090.542,
    "text": " then you have the other two states of system a in teal and the other two states of system b in dark blue so it's almost like we have four kinds of states four kinds of states out of these six of course you could say well each each state is unique great totally true they're different states that's why we have those different dimensions in our model but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4091.596,
    "end": 4113.556,
    "text": " there's going to be some interesting things that fall out as a function of us separating out the two systems and then separating out parts of the system that interface internally and externally, and then parts of the system that do not directly, by virtue of how we know we specified the system, do not couple out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4114.867,
    "end": 4125.038,
    "text": " Again, the fascinating thing is that like state two of system A and state two of system B have a covariance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4126.299,
    "end": 4128.682,
    "text": "That's like maybe a mirror neuron.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4128.862,
    "end": 4136.91,
    "text": "Again, using a more like realistic mapping, it's like there's some internal part that is only interacting with other internal parts by virtue of how the system is defined.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4137.85,
    "end": 4147.241,
    "text": " And yet these two parts in each system, which are not directly interacting by virtue of how we set up the system, have covariance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4148.202,
    "end": 4155.872,
    "text": "So that is what leads us to this numerical analysis, which kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4157.423,
    "end": 4160.905,
    "text": " provides a little bit stronger and different empirical evidence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4160.945,
    "end": 4185.217,
    "text": "So it's not just an analytical formulation, it's a numerical simulation where we can see that when we actually let that system play out, that even when states start very correlated, like we just start the third and the sixth states in a very similar position, so they start out with a high partial correlation coefficient,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4186.4,
    "end": 4192.243,
    "text": " when we run out that simulation through time, it ends up trending towards zero partial correlation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4193.083,
    "end": 4205.25,
    "text": "So we're recapitulating the correlation patterns of the system, even when it starts in a more correlated place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4206.691,
    "end": 4210.793,
    "text": "And so that suggests that some very essential",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4212.265,
    "end": 4240.013,
    "text": " aspects of the system are being isolated and tractably handled by this kind of partitioning of coupled systems so it's pretty interesting now we've seen this top dive oh dean yes and then we'll just just real quickly daniel what it also says is that hyperbolic is also existing in this pattern although it's not necessarily being um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4242.406,
    "end": 4245.228,
    "text": " materialized in these diagrams, it's also there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4245.348,
    "end": 4256.133,
    "text": "I mean, what that's what this explains is that there can be continuity, there can be alignment, and there can be hyperbolic function within all at the same time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4256.193,
    "end": 4261.316,
    "text": "Again, that's I just want to, again, I just want to point to the non obvious, but it's still there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4263.537,
    "end": 4263.757,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4264.418,
    "end": 4266.599,
    "text": "So we've seen this top of Stephen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4266.639,
    "end": 4266.799,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4269.615,
    "end": 4283.739,
    "text": " I was also going to add that by showing the nature of the coupling, like varying the nature of the coupling that you showed, it can reach a different sort of state, non-equilibrium steady state in some ways.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4283.779,
    "end": 4284.439,
    "text": "Would that be true?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4285.379,
    "end": 4296.842,
    "text": "There's a different pattern emerges as, so it could speak, maybe I'm overextending this, but changing the nature of how things couple is,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4297.847,
    "end": 4302.291,
    "text": " could in a way change the sort of states which things can fall into.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4302.511,
    "end": 4309.277,
    "text": "So you could almost have multiple states being inferred based on how the coupling is set up.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4309.797,
    "end": 4310.117,
    "text": "Oh yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4310.237,
    "end": 4318.544,
    "text": "I mean, we would throw out any model that treated two people tied to each other as simply moving the same way as two people in different rooms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4319.125,
    "end": 4324.609,
    "text": "It is the coupling of systems that influence their behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4325.512,
    "end": 4329.574,
    "text": " And again, we're not talking about the causal structure of the world territory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4330.154,
    "end": 4337.737,
    "text": "We're talking about the models that we got to specify and how changing the coupling pattern changes their behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4338.477,
    "end": 4338.637,
    "text": "Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4339.893,
    "end": 4354.846,
    "text": " And Stephen, when you're taking the abstraction here off the page, so you could set up your programming, for example, that says, okay, I'm willing to sponsor somebody because I want to mentor them in bricklaying.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4355.446,
    "end": 4366.476,
    "text": "You can start with that, or you can start with, there's two people that are interested in bricklaying, but the first thing we have to address is whether there's a potential for positive entanglement.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4368.571,
    "end": 4384.897,
    "text": " In real terms, that's how you can flip the abstraction into the likelihood of those entanglements turning out, extending, because the people will actually be relatable to one another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4385.837,
    "end": 4393.46,
    "text": "So that, I just, again, I'll bring that up because that's how we turn the abstraction into the, so what does that look like?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4393.48,
    "end": 4396.821,
    "text": "Okay, Stephen, something quick on this, otherwise we'll get to 10.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4397.492,
    "end": 4398.393,
    "text": " Oh, yeah, just very quickly.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4398.653,
    "end": 4410.739,
    "text": "Yeah, so that speaks to, because we often think about the model on the inside, the generative model and the external states and, you know, the model trying to understand what the external states are doing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4410.799,
    "end": 4418.584,
    "text": "But this speaks to the ability to change the way the blanket is coupling.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4418.784,
    "end": 4422.606,
    "text": "So, you know, how much work is going on in terms of,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4423.604,
    "end": 4436.695,
    "text": " enabling there to be information, variational free energy information being used in the generative models, how much is being done by actually changing coupling dynamics in the blanket",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4437.515,
    "end": 4449.28,
    "text": " Is that, it's even feasible that, you know, because that in itself will start to yield more and more ways for the generative model to start to extract and make inferences based on what's going on externally.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4449.32,
    "end": 4451.221,
    "text": "So that also helps, I think.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4451.521,
    "end": 4454.763,
    "text": "So as a heuristic thought pump, yes, great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4454.843,
    "end": 4458.705,
    "text": "But actually the blanket is downstream of the coupling pattern.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4459.105,
    "end": 4465.268,
    "text": "So it's like changing the coupling of a blanket is a little bit of a cart before the horse because there is the coupling of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4465.928,
    "end": 4472.57,
    "text": " And that is what induces partitionings, which we can then map to Markovian assumptions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4472.65,
    "end": 4488.614,
    "text": "So it's like, you know, when you put on headphones and you're listening to this, yes, a different blanket is in play because the partitioning is different, because the coupling is different between other states in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4489.214,
    "end": 4489.735,
    "text": "Dean on this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4489.955,
    "end": 4490.535,
    "text": "And then let's go to 10.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4491.411,
    "end": 4493.913,
    "text": " Yeah, I'll be real quick.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4493.993,
    "end": 4510.105,
    "text": "So Charles Saunders Peirce's abduction doesn't guarantee that when you walk in later and see beans in one hand and a bag of beans in the other, that you'll get to a... Okay, I just lost Dean, so I'm going to continue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4511.046,
    "end": 4515.809,
    "text": "So in figure 10, but he was talking about abduction in C.S.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4515.849,
    "end": 4516.07,
    "text": "Peirce.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4517.438,
    "end": 4518.619,
    "text": " kind of that flipping that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4519.24,
    "end": 4520.02,
    "text": "I understand, you're right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4520.301,
    "end": 4522.122,
    "text": "It is the cart ahead of the horse.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4522.963,
    "end": 4524.484,
    "text": "And sometimes that helps.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4525.205,
    "end": 4532.211,
    "text": "Not saying it's, and I know you're agreeing with me, but all I'm saying is we shouldn't just assume that it only goes one way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4533.152,
    "end": 4534.353,
    "text": "Horse first, cart second.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4534.949,
    "end": 4556.669,
    "text": " yes and in fact partitioning different imagining differences ways it could be different absolutely this is how we are going to apply and ask what is if for active inference like what is is like what is the blanket states given a coupling pattern well there's an answer",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4557.35,
    "end": 4564.051,
    "text": " Sensory states are the ones with incoming statistical dependencies, and active states are the ones with outgoing statistical dependencies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4564.251,
    "end": 4565.091,
    "text": "Those are the blanket states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4566.192,
    "end": 4568.672,
    "text": "What if the coupling were different?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4569.312,
    "end": 4572.093,
    "text": "Then what would the blanket be?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4572.773,
    "end": 4576.814,
    "text": "So yeah, it's not that that first blanket that you identified is being changed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4577.194,
    "end": 4583.895,
    "text": "What's being changed is the coupling, which induces a different kind of covariance amongst the states, but it can be almost thought of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4585.6,
    "end": 4586.645,
    "text": " in a cart before the horse way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4587.167,
    "end": 4590.16,
    "text": "So just to recap this nomenclature, which we've seen before,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4591.277,
    "end": 4594.979,
    "text": " So we have external states, sensory states, active states, and internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4595.68,
    "end": 4598.021,
    "text": "B is the set of blanket states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4598.601,
    "end": 4601.423,
    "text": "So this is one of the innovations of Friston et al.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4601.503,
    "end": 4605.125,
    "text": "beyond Pearl 1988, beyond Markov et al.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4605.305,
    "end": 4615.031,
    "text": "earlier, earlier, earlier, is that blanket states, which in the non-FEP act-inf world are the set of states upon which",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4615.973,
    "end": 4619.196,
    "text": " Conditionally, internal and external states are independent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4620.116,
    "end": 4625.42,
    "text": "Those blanket states, again, we're going to partition them into incoming and outgoing statistical dependencies, sense and action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4626.101,
    "end": 4630.584,
    "text": "Now we have autonomous states alpha, which is the set of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4631.559,
    "end": 4632.94,
    "text": " active states and internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4633.881,
    "end": 4638.064,
    "text": "Autonomous states are the ones that for systems that we design, we get to control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4638.804,
    "end": 4640.266,
    "text": "We get to control our internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4640.526,
    "end": 4642.047,
    "text": "We get to control our actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4642.647,
    "end": 4646.21,
    "text": "We don't get to control directly the sensory input.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4646.93,
    "end": 4653.015,
    "text": "You can close your eyes so that it's darker, or you can move your head so it looks differently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4653.495,
    "end": 4657.698,
    "text": "And maybe you'll even be right about what sensory information comes in then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4658.598,
    "end": 4663.303,
    "text": " but you can't just say, I want different sensory information coming in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4663.583,
    "end": 4665.024,
    "text": "So those are the autonomous states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4665.785,
    "end": 4668.147,
    "text": "And then there's the particular states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4669.008,
    "end": 4672.77,
    "text": " The particular states are the whole particle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4673.391,
    "end": 4676.773,
    "text": "That's the blanket states, which are a sense and action, and the internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4677.473,
    "end": 4685.879,
    "text": "So the particular states are like the whole particle floating around in the room or the whole cell or whatever, again, to give physical interpretations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4686.579,
    "end": 4690.122,
    "text": "And then the autonomous ones are like the things that the cell can control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4691.161,
    "end": 4693.303,
    "text": " or the thing that the system designer can control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4693.683,
    "end": 4702.591,
    "text": "So we have autonomous states, which composed of internal and action states, blanket states, action and sense, particular, all three on the right side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4703.051,
    "end": 4713.28,
    "text": "And these are all being defined as a partitioning, a cleaving apart from external states as modeled, not of the territory of the map only.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4713.921,
    "end": 4714.161,
    "text": "Steven?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4717.856,
    "end": 4726.707,
    "text": " And as we mentioned here, this paper gives a way for this to emerge from the very most basic principles.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4726.748,
    "end": 4731.333,
    "text": "And then we have, like you described, the blanket states, the autonomous states.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4731.834,
    "end": 4732.615,
    "text": "But of course, in...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4734.389,
    "end": 4738.371,
    "text": " any sort of system, organism, non-equilibrium steady state, they're always nested.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4738.391,
    "end": 4746.394,
    "text": "So it's not like there will be a whole nested levels of Markovian blankets.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4747.054,
    "end": 4750.336,
    "text": "So when we emerge at higher levels,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4751.38,
    "end": 4752.821,
    "text": " we might be emerging.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4753.361,
    "end": 4756.623,
    "text": "It's not like, unless we made our blanket, there'd be no blanket.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4757.623,
    "end": 4760.225,
    "text": "There's going to be blankets all the way up and down.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4760.845,
    "end": 4766.328,
    "text": "So as a blanket starts to be formed or brought into play, then the,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4768.547,
    "end": 4778.07,
    "text": " the nature of how those blankets come into play starts to draw in the idea of coupling.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4778.27,
    "end": 4786.653,
    "text": "So maybe there's some of those things that you just mentioned there about there's not a dependency.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4786.713,
    "end": 4793.375,
    "text": "The fact that we're creating something from first principles doesn't mean in the real world without the first principles, we can't make a blanket.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4794.994,
    "end": 4813.792,
    "text": " because in other cases it's going to be sort of emergent through more coupling between blankets because i know we're talking about the blanket but it's also good about the blanket in this scale and then the blankets in plural at the multi-scale okay yeah so within",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4816.027,
    "end": 4819.27,
    "text": " internal states, again, these are statistical dependencies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4819.31,
    "end": 4821.472,
    "text": "So this one can have other things happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4822.052,
    "end": 4824.194,
    "text": "It's like a black box within each one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4824.855,
    "end": 4832.781,
    "text": "And so that is for people who expect to see the mechanics of the system, that's a disappointment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4833.564,
    "end": 4848.55,
    "text": " But for people who want to model real systems, including machines, it's a huge advantage because it allows us to go in keeping the map territory distinction totally apparent, which is the real transparency we need from our machine learning models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4848.95,
    "end": 4859.595,
    "text": "You know, there's not going to be a transparent explanation for how 500 variables interact, but we can transparently see potentially how the map and the territory are distinguished.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4860.799,
    "end": 4864.422,
    "text": " Now that's where we get to their definition of Markov blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4865.203,
    "end": 4871.409,
    "text": "So let others read through and work through the math and critique it and build on it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4872.11,
    "end": 4881.298,
    "text": "But we're talking about boundaries based upon sub matrices of the total state space of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4882.27,
    "end": 4890.297,
    "text": " So like, this is just two coupled systems that we're talking about here, where we were studying like system A and system B, each is Lorenz.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4891.098,
    "end": 4898.844,
    "text": "We added the coupling to one and four, and that's where we saw a new pattern arising.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4901.587,
    "end": 4905.17,
    "text": "Why does a particular partition comprise four sets of states?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4906.291,
    "end": 4909.193,
    "text": "Is it because tetrahedra are the minimum polyhedra in our world?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4910.205,
    "end": 4914.527,
    "text": " In other words, why does a particular partition consider two Markov boundaries?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4915.608,
    "end": 4922.592,
    "text": "The reason is that the particular partition, again, particular states, blanket and internal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4923.792,
    "end": 4929.936,
    "text": "The particular partition is the minimal partition that allows for directed coupling with blanket states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4931.604,
    "end": 4949.545,
    "text": " Sensory states can influence internal states, incoming dependencies, and active states can influence external states, outgoing dependencies, without destroying the conditional independencies of the particular partition, as shown in the upper panel of figure 10.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4951.303,
    "end": 4965.029,
    "text": " So very cool how we went from one coupled system or from one system with chaotic dynamics, made an approximation, and then showed that it had certain well-behaved aspects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4965.629,
    "end": 4970.971,
    "text": "And then we took like the next step up, which is to couple systems in a way that we designed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4971.812,
    "end": 4977.494,
    "text": "And that gave a new manifold that the systems were using.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4979.218,
    "end": 5001.79,
    "text": " acting entangled as if within and then here's where we get that very fun claim that there's no claim either the original Lorenz system or coupled Lorenz system possesses a Markov blanket we're not describing the territory I don't even think we're even describing the first level of the map",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5003.154,
    "end": 5012.5,
    "text": " The claim here is that there exists a Laplacian approximation to these kinds of systems that in virtue of the zero elements of the Hessian feature Markov blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5013.26,
    "end": 5013.361,
    "text": "So,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5014.321,
    "end": 5035.46,
    "text": " This is one reason why, while also acknowledging that there's many perspectives and so much to learn, that we do want to be precise with our language, because it's easy enough to say that the system has a Markov blanket, or there is a Markov blanket in the system, or all these other ways which prepositions and nouns might be combined.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5036.261,
    "end": 5041.182,
    "text": " And those might be so misleading, it could be truly incredible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5041.862,
    "end": 5060.085,
    "text": "So it's a word of warning because as we figure out exactly what the technical details are and continue to clarify here, it will matter which natural language words we use to describe it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5060.786,
    "end": 5062.226,
    "text": "And it really does matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5062.786,
    "end": 5062.946,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5064.261,
    "end": 5066.962,
    "text": " So let me add to that, Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5066.982,
    "end": 5073.743,
    "text": "So on an abstracted level, we can frame the problem as in or out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5074.423,
    "end": 5082.064,
    "text": "And then when we translate that into the physical space, we know when something is entangled or when something is different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5082.704,
    "end": 5090.666,
    "text": "But I think what this allows us for on the abstract level is to sample the Markov blanket",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5091.873,
    "end": 5094.035,
    "text": " as in and out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5094.195,
    "end": 5101.28,
    "text": "It gives us the potential for a second way of looking at how those two things work together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5101.5,
    "end": 5105.843,
    "text": "The Markov blanket has both a divider and an enveloper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5107.565,
    "end": 5108.225,
    "text": "Do you agree?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5109.546,
    "end": 5116.832,
    "text": "So on an abstracted level, it's very important to be precise, but if we include this,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5118.083,
    "end": 5130.231,
    "text": " we have to accept the fact that on an abstracted level, in and out must be part of our repertoire, not just in or out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5131.071,
    "end": 5139.737,
    "text": "Because one is more precise, what is active inference, while the other allows for what if active inference, the and.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5140.457,
    "end": 5141.058,
    "text": "Would you agree?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5142.979,
    "end": 5144.6,
    "text": "I think I agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5146.522,
    "end": 5156.129,
    "text": " I'm just imagining that it could be possible to design a system where there was one coupling going out, but there was no coupling back in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5157.349,
    "end": 5164.554,
    "text": "So one could devise edge case matrices that have various kinds of properties.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5166.235,
    "end": 5170.558,
    "text": "Would those even be good maps of systems that we care about?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5171.419,
    "end": 5172.339,
    "text": "Probably not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5173.266,
    "end": 5181.312,
    "text": " So for some of the basic attributes like of communication, like of course, if one person's not wearing their headphones, like, yeah, the systems are coupled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5181.412,
    "end": 5185.795,
    "text": "One person's talking and the other person can hear them, but not return any information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5186.936,
    "end": 5189.418,
    "text": "So it's like, that's interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5189.598,
    "end": 5193.1,
    "text": "It's a type of coupling that systems can have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5193.681,
    "end": 5196.062,
    "text": "And it has a different blanket because of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5197.043,
    "end": 5216.027,
    "text": " But especially for systems where we want to think about states that are influencing the environment and vice versa, whether it's communication or stigmergy or coupling or collective behavior, that whole class of systems, it's extremely important to have, of course, in and out and more and less and different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5218.027,
    "end": 5219.468,
    "text": " I wouldn't drop or.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5219.728,
    "end": 5220.909,
    "text": "Sorry, Stephen, I just got to get this in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5220.949,
    "end": 5221.85,
    "text": "I wouldn't drop or.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5221.87,
    "end": 5230.657,
    "text": "I'm actually suggesting that this tells us we must also contemplate and.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5230.977,
    "end": 5238.183,
    "text": "So that's like saying, okay, so which is more important, the positive ions or the negative ions?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5238.223,
    "end": 5239.424,
    "text": "They're going to congregate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5240.663,
    "end": 5245.427,
    "text": " And we can tell the difference, but we shouldn't apply a value all the time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5245.707,
    "end": 5262.761,
    "text": "There are times when we can just see the difference and accept that for what it is, as opposed to always jumping to the idea that something has to be more or less, that the positive ions are more important than the negative ones.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5262.822,
    "end": 5265.384,
    "text": "Maybe they are, but we shouldn't jump to that right away.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5266.244,
    "end": 5266.805,
    "text": "Done, I'm done.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5269.016,
    "end": 5272.105,
    "text": " Okay, closing thought on this, Stephen, and then we're going to get to free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5273.197,
    "end": 5289.561,
    "text": " Yeah, so yeah, just mention a little bit to what Dean said there, like, yeah, if something's a charged particle, how much is the system of the molecule showing the distribution of charge, and how much is it the quality of the thingness of that thing, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5289.581,
    "end": 5295.423,
    "text": "So I suppose, and that becomes, I don't think there's a definite transition.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5296.143,
    "end": 5298.103,
    "text": "And I'm glad you went back to this diagram.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5298.143,
    "end": 5300.744,
    "text": "This is the one I just wanted to mention there then, just to...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5302.61,
    "end": 5317.354,
    "text": " The arrows there on the right, so where sensory states, it shows that the sensory states are related to the same external states as the action states are affecting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5317.594,
    "end": 5320.134,
    "text": "So it shows it's almost like there's a regime of attention.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5321.875,
    "end": 5325.576,
    "text": "So it's not, the sensory states aren't reading something coming in",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5326.676,
    "end": 5345.616,
    "text": " about something which is completely unrelated to you know it's not like i'm looking i'm acting in front of me but actually my eyes in the back of my head right so my sensory state there's there's an alignment and and then when i look to the the left this this coupling that's going on then between",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5347.103,
    "end": 5356.006,
    "text": " in the way that it's set up between this, it's saying it's not a Markov blanket when it's saying it's a coupled system.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5356.647,
    "end": 5366.85,
    "text": "So it's sort of saying in a way that this more slightly more nascent version, there's kind of, there's still a spookiness about it, I suppose we might say.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5366.87,
    "end": 5372.552,
    "text": "There's sort of a, it's not, it doesn't drop out as far as a Markov blanket.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5372.613,
    "end": 5373.633,
    "text": "There's that kind of,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5375.322,
    "end": 5390.591,
    "text": " resonation going on and i suppose somewhere between left and right you start to become you you meet the the conditions of a markov blanket and i suppose you know that's an interesting point",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5391.877,
    "end": 5395.099,
    "text": " I don't want to just make the water murky with too many terminology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5395.239,
    "end": 5396.46,
    "text": "We haven't brought attention in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5396.58,
    "end": 5398.781,
    "text": "It's not related to what we are discussing here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5399.022,
    "end": 5407.987,
    "text": "But I see what you mean that, yes, if actions were influencing state A, you know, your actions were moving something up or down, but you were observing the left-right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5408.448,
    "end": 5415.432,
    "text": "Yes, that's a different kind of system than if you're observing and acting on the up-down movement of something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5416.733,
    "end": 5419.595,
    "text": "That's not a regime of attention, but I know what you mean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5421.472,
    "end": 5440.717,
    "text": " let's get to the fep okay finally remember that edges reflect statistical relationships which is the other side of the coin of saying that the absence of an edge reflects a conditional independence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5441.886,
    "end": 5469.564,
    "text": " so one can provide a definition of the conditional density over external states so probability density that's why it was so important to go from dynamics to densities in section two and we're going to think about that external density probability density conditional statistical density as being parameterized by the conditional expectations of internal states given external states here's the formalism",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5471.306,
    "end": 5488.84,
    "text": " see how the coupled systems have a flow where like, given where you were on one, even if it were a little noisier, as long as it looked like an oval, as long as you were like, you'd know that if you were low on the left, you were going to be low on the up and down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5489.18,
    "end": 5491.722,
    "text": "And if you were further to the right, you'd be higher up on the Y axis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5492.022,
    "end": 5492.243,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5492.763,
    "end": 5497.006,
    "text": "But imagine if the flow was like in a circle, you'd say, okay, we're at X on the zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5497.046,
    "end": 5497.206,
    "text": "Well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5498.089,
    "end": 5501.292,
    "text": " you really don't know because you could be low, you could be high.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5502.152,
    "end": 5507.777,
    "text": "Or imagine if it was just like a scatter cloud, no matter where you were, you wouldn't, like it was everywhere in the box, you wouldn't really know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5508.577,
    "end": 5525.431,
    "text": "But because there's a manifold, then this admits the possibility of a diffeomorphic, which means like sort of like function-like and stretchable map between the sufficient statistics of the respective densities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5527.006,
    "end": 5555.909,
    "text": " not the territory not the first map i don't even know if we're at the second map anymore we're talking about sufficient statistics of densities of approximations okay i think it's a death blow for realism personally but i would love to hear somebody who thinks it's not the existence of this mapping rests upon a continuously differentiable and invertible map which is linear under laplace approximation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5557.995,
    "end": 5567.646,
    "text": " There's a few technical pieces there, but it's almost like we set up the system in a way that was defined only by its coupling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5568.447,
    "end": 5572.132,
    "text": "But then we also got to choose our approximation approach",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5573.55,
    "end": 5595.795,
    "text": " And it turns out that with a system with interesting coupling dynamics, enough to befuddle almost every other kind of model out there, the approximation has a really nice relationship that recapitulates aspects of the system and lets us map, like if we're on low on here, we can go to low on here and low on here to low on here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5595.975,
    "end": 5599.316,
    "text": "Like it's a kind of, it's a function that can go both ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5601.058,
    "end": 5614.871,
    "text": " And so that is going to be the relationship sigma mapping between the internal and the external states, which was explored more in the Bayesian mechanics paper number 26.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5616.893,
    "end": 5624.76,
    "text": "This means the autonomous flow can be expressed as a gradient flow on a free energy functional of the variational density.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5626.894,
    "end": 5632.617,
    "text": " Here are those four states, four kinds of states, external, sense, action, internal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5633.538,
    "end": 5636.64,
    "text": "And those are going to be expressed as a tuple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5636.92,
    "end": 5640.242,
    "text": "It has to be, because it has to be all four of those states co-evolving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5641.202,
    "end": 5645.925,
    "text": "And those have a gradient flow, gamma and then the upside down triangle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5647.039,
    "end": 5649.302,
    "text": " plus the solenoidal flow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5649.783,
    "end": 5659.817,
    "text": "So remember way back when, when we saw that we had Q solenoidal, G gamma for gradients, and then lambda for housekeeping.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5660.278,
    "end": 5663.303,
    "text": "Okay, so now that is coming back into play",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5665.1,
    "end": 5668.703,
    "text": " The solenoidal is still a single term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5669.243,
    "end": 5676.209,
    "text": "That's just the potential function, that self-surprisal and one solenoidal term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5677.069,
    "end": 5683.334,
    "text": "Then we have a gradient over these four states and then the lambda housekeeping.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5684.595,
    "end": 5687.037,
    "text": "That can be rewritten.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5687.978,
    "end": 5690.38,
    "text": "And now pi, again,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5692.583,
    "end": 5701.449,
    "text": " let the ontology develop so that we can resolve some of this, but notice how particular states pi are the blanket and the internal, okay?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5702.109,
    "end": 5704.731,
    "text": "But how have we usually used pi?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5705.331,
    "end": 5707.532,
    "text": "Policy, action selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5708.113,
    "end": 5709.634,
    "text": "So this is a different pi.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5711.243,
    "end": 5724.713,
    "text": " the free energy functional on particular states, particular states, let's call them, equals the self-surprisal on the particular states plus a divergence term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5727.075,
    "end": 5738.263,
    "text": "That is the form that then lends the ability to interpret that free energy functional on particular states",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5739.338,
    "end": 5762.701,
    "text": " to be rewritten in several ways including energy minus entropy that's a very classical chemical way to talk about free energy to be phrased as the divergence between the q distribution on external states and the p distribution on external states conditioned on particular states",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5764.48,
    "end": 5783.781,
    "text": " plus the self-surprisal of those particular states, or the one that's closest to the Bayesian information criteria on Bayesian modeling world, but still being shown as equivalent to, is the accuracy minus model complexity and the evidence lower bound.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5784.642,
    "end": 5795.619,
    "text": " So that's where we've seen these formalisms come out many, many times, but we're approaching it from a very different way and a lot more bottom up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5796.421,
    "end": 5796.661,
    "text": "And again,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5797.799,
    "end": 5807.305,
    "text": " I think, but again, would be open to people correcting in a way that fully embraces the map territory distinction and makes no bones about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5807.746,
    "end": 5815.471,
    "text": "Whereas if you just pop in from the top with these formalisms, it might seem like they're describing aspects of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5815.931,
    "end": 5827.459,
    "text": "But I hope that the way we've approached this over the last like six hours of live streams, literally, and the way that the authors wrote it so carefully makes it clear we're talking about these formalisms on,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5828.78,
    "end": 5834.047,
    "text": " probably not even the first map and maybe the second map or summary statistics thereof.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5834.667,
    "end": 5845.08,
    "text": "These are relationships that are intrinsic to our approach of map making because we did the Laplacian approximation, et cetera, et cetera, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5846.041,
    "end": 5847.443,
    "text": "Steven, and then Deep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5849.315,
    "end": 5850.335,
    "text": " Yeah, this is very helpful.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5850.355,
    "end": 5857.997,
    "text": "I might just ask we go and walk through the very first sentence again in a second, just because I think it'd be helpful just to reiterate.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5858.017,
    "end": 5873.38,
    "text": "But from what you're saying, and I hear this really clearly, is that the particular states and the thingness of maintaining particular states, potentially, or of whatever those particular states persist,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5874.992,
    "end": 5903.644,
    "text": " effectively then is the same when at a higher order level over time and space as a policy because let's not bring policy in picture yet we just haven't gotten there but states and internal states okay i won't i won't jump the gun on that but so um i i suppose the the the point is just to say that we we can still be in the realm of thingness",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5904.662,
    "end": 5909.945,
    "text": " Okay, we can still be in the realm of thingness because we're talking about particular states of things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5910.785,
    "end": 5912.586,
    "text": "So we haven't got, and I won't say beyond that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5912.606,
    "end": 5919.169,
    "text": "And then maybe just to go through the ontology, not just of that first sentence, just to reiterate, just to get it clearer.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5919.83,
    "end": 5923.111,
    "text": "Again, autonomous flow, expected internal state.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5923.151,
    "end": 5928.874,
    "text": "Could you just recap that just to just unpack that a little bit more, just so that it's a little bit clearer?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5930.675,
    "end": 5930.915,
    "text": "Okay.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5932.418,
    "end": 5942.45,
    "text": " So the autonomous flow, so autonomous states are actions, which are not, we're not even bringing policy selection in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5942.47,
    "end": 5944.913,
    "text": "So it's the right direction we want to go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5945.414,
    "end": 5949.299,
    "text": "We want to be talking about internal states that are actually doing planning as inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5949.639,
    "end": 5951.24,
    "text": " that affect their action states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5951.48,
    "end": 5955.183,
    "text": "But for now, we're just treating the action states as outgoing statistical dependencies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5955.703,
    "end": 5960.186,
    "text": "And then we're just, we're pausing on how the actions are selected.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5960.466,
    "end": 5966.731,
    "text": "We're just, because in the Lorenz system, there's no policy selection, but there are external states that are modified by states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5966.951,
    "end": 5967.891,
    "text": "Those are the active states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5968.472,
    "end": 5972.334,
    "text": "So it's almost like we can talk about action without policy inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5973.275,
    "end": 5977.037,
    "text": "So the autonomous states, the autonomous flow,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5978.075,
    "end": 5979.756,
    "text": " at the expected internal state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5980.577,
    "end": 5990.645,
    "text": "So these are expectations of autonomous states, action, outgoing, and internal states can be expressed as a gradient flow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5991.245,
    "end": 6004.496,
    "text": "So now it's like, we're going to, rather than have a six state system, we're going to rewrite as four states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6006.383,
    "end": 6025.716,
    "text": " remember we pulled out four kinds of nodes and now we're going to express a flow, not in a six dimensional space where each dimension was a measurement that we were making, but express a flow over the four kinds of states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6027.377,
    "end": 6033.261,
    "text": "And then that means that even if there was a bunch of internal nodes that were communicating to each other,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6034.622,
    "end": 6055.762,
    "text": " we could still use this fourfold breakdown, hashtag William Blake, hashtag Bucky, hashtag Fristin, no matter how many specifics were inside the internal or how many blanket states there were, like how many nodes in the graph or how many external states, because now it's like a flow over kinds of nodes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6056.917,
    "end": 6065.244,
    "text": " And then that, because the nodes are defined by their directionality of relationship, like how they influence each other, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6065.264,
    "end": 6068.127,
    "text": "Like internal and external, we know don't directly influence each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6068.547,
    "end": 6071.109,
    "text": "They're conditionally independent based upon blanket states, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6071.87,
    "end": 6078.856,
    "text": "That allows us to write formalisms that are like evergreen and can be expressed as flow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6079.737,
    "end": 6079.897,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6081.24,
    "end": 6088.383,
    "text": " Yeah, I would just say that when I first encountered these kind of formalisms, I always ask, and then what happened?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6088.423,
    "end": 6092.244,
    "text": "And that's when I coined the phrase, when in doubt, zoom in, zoom out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6092.304,
    "end": 6097.666,
    "text": "But I didn't want that zooming in and zooming out to be collapsed just to the optical zoom.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6098.607,
    "end": 6107.33,
    "text": "I assumed that your legs wouldn't become paralyzed when you picked up a telescope or a microscope, that you would still zoom in and zoom out by moving.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6108.531,
    "end": 6110.753,
    "text": " So the inference is in doubt.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6111.774,
    "end": 6113.296,
    "text": "So how do you overcome that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6113.596,
    "end": 6116.519,
    "text": "You become more active, but not just with your eyes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6117.52,
    "end": 6122.104,
    "text": "You actually pick yourself up and move yourself around a little bit more.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6122.885,
    "end": 6125.847,
    "text": "You don't just have to be on the north end of the carousel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6128.018,
    "end": 6131.722,
    "text": " Sometimes you can pick up a ladder and look down on it as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6132.142,
    "end": 6138.108,
    "text": "And that'll give you a whole new set of data or more complimentary data, a different collection.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6138.828,
    "end": 6146.135,
    "text": "And so that's why I think it's really, really good to be able to see that and understand what it implies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6147.096,
    "end": 6151.0,
    "text": "It basically says, if you're not sure, act some more.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6156.653,
    "end": 6158.375,
    "text": " How could I disagree with Acton for a surf?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6159.075,
    "end": 6160.737,
    "text": "Let's just look at this slide then, Stephen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6161.037,
    "end": 6173.708,
    "text": "So this functional, the flow over the four kinds of states that is using this blanket partitioning paradigm can be expressed in several forms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6175.089,
    "end": 6176.431,
    "text": "Expected energy,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6177.538,
    "end": 6179.24,
    "text": " E, big E is expectation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6180.061,
    "end": 6183.465,
    "text": "Expected energy minus the entropy of the variational distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6183.485,
    "end": 6187.029,
    "text": "Remember the Q variational distribution is like the one that we get to control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6187.269,
    "end": 6194.097,
    "text": "Q of mu, that's the Q of internal states, which is equivalent to the self-information",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6195.356,
    "end": 6200.08,
    "text": " fancy I, plus the KL divergence between the variational and conditional density.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6200.44,
    "end": 6203.702,
    "text": "That's this KL divergence term, which is always greater than zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6204.263,
    "end": 6207.345,
    "text": "So self-surprisal is always zero or greater.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6207.365,
    "end": 6208.926,
    "text": "You can't have negative surprisal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6210.908,
    "end": 6215.071,
    "text": "And then the divergence is always gonna be positive as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6215.952,
    "end": 6221.296,
    "text": "This can be decomposed into accuracy and complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6222.317,
    "end": 6223.918,
    "text": "So that's this third framing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6224.158,
    "end": 6225.059,
    "text": "And in that setting,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6226.661,
    "end": 6232.804,
    "text": " Negative free energy becomes the evidence lower bound or ELBO, which will be familiar to many people with machine learning backgrounds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6234.164,
    "end": 6235.185,
    "text": "Okay, amazing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6235.245,
    "end": 6237.566,
    "text": "So those are the three different formalisms and how they fell out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6238.366,
    "end": 6240.187,
    "text": "This is the basis of the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6240.627,
    "end": 6242.388,
    "text": "Wait, what's the free energy principle?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6243.248,
    "end": 6256.134,
    "text": "Put simply, it means that the expected internal states of a particular partition at non-equilibrium steady state can be cast as encoding conditional or Bayesian beliefs about external states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6258.598,
    "end": 6269.067,
    "text": " That's the free energy principle in this paper, not the first and not the last way it'll be defined and not the only, but that's how they discuss it here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6270.309,
    "end": 6277.996,
    "text": "And basically we moved from early on, it's like tying our shoe with the density to dynamics side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6278.716,
    "end": 6284.521,
    "text": "And now we have this whole universe of formalisms that connect",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6285.538,
    "end": 6292.282,
    "text": " free energy looking formalisms like chemistry with information theory formalisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6293.162,
    "end": 6311.492,
    "text": "So thermochemistry with energy and entropy with thermo information, divergence and self-information to information and inference with accuracy minus complexity as a modeling heuristic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6313.493,
    "end": 6314.254,
    "text": "So that's big.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6315.236,
    "end": 6316.256,
    "text": " Re-energy is big.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6317.737,
    "end": 6330.443,
    "text": "And then they immediately go to talk about physiological perspectives and how that surprisal function that constitutes the potential is log model evidence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6330.783,
    "end": 6339.667,
    "text": "So if you're getting good evidence for your physiological model, you're spending a lot of times in your preferred and expected physiological states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6340.623,
    "end": 6340.803,
    "text": " Stephen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6340.823,
    "end": 6341.103,
    "text": "Stephen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6366.88,
    "end": 6388.506,
    "text": " amazing this this really ties into the active inference paradigm shift because okay traditionally if we're going to have represented like traditionally representationism for instance like you were saying it does really really um throw that out in a way because if i have 100 cameras normally",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6389.244,
    "end": 6396.45,
    "text": " and I took 100 different cameras all taking a photo, it's going to make it 100 times more blurry in that sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6396.65,
    "end": 6413.924,
    "text": "However, in this sense, 100 sources in this noisy dynamical gives me 100 ways to integrate free energy reduction",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6415.39,
    "end": 6425.756,
    "text": " And even actually the noise of me moving it a hundred ways by a hundred cameras gives me more and more informational thermodynamic ways in.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6426.357,
    "end": 6434.781,
    "text": "So that just shifts very much the way we might think about how to know about how to act in the world.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6436.082,
    "end": 6436.382,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6438.103,
    "end": 6442.806,
    "text": "Let's continue on and we'll probably do a few minutes after the hour to get to these last few points.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6443.747,
    "end": 6443.847,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6445.168,
    "end": 6466.496,
    "text": " we've been talking about different ways that we can talk about the free energy functional of the particular states 5.1 is where this idea of the internal states as a generative model and self-evidencing or like the minimization of self-surprise",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6467.956,
    "end": 6490.081,
    "text": " is really leaned into so the alternative and deflationary perspective rests on noting that the free energy gradients are also the gradients of self-information so it's like the free energy itself is a wind that's difficult to latch on to so the free energy bowl the one where you'd be doing strictly as well as you could if you were on the bottom of it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6491.311,
    "end": 6492.212,
    "text": " we're not on that bowl.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6493.112,
    "end": 6498.336,
    "text": "But the one that we can be keenly aware of is our self-surprisal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6499.677,
    "end": 6520.892,
    "text": "So if the self-surprisal gradient is aligned with the free energy gradients, then reducing our uncertainty about sensory states incoming helps us on the way towards minimizing free energy gradients, reducing that difference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6522.557,
    "end": 6527.34,
    "text": " The organism wants to be minimally surprised about expected and preferred observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6528.081,
    "end": 6529.541,
    "text": "And those are the perceptions or measurements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6530.462,
    "end": 6535.725,
    "text": "More technically, it wants to be minimally surprised about expected states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6536.686,
    "end": 6542.61,
    "text": "And then preferences are going to play a key role when we talk about active systems that do resist dissipation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6544.738,
    "end": 6546.92,
    "text": " This is where the moth to the flame comes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6547.02,
    "end": 6549.742,
    "text": "And I just, I love this plot arc from 2006.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6550.843,
    "end": 6554.646,
    "text": "Ice Queen Fristin with the winged snowflake.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6555.406,
    "end": 6558.028,
    "text": "And then, you know, things are heating up for Act Dymph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6558.949,
    "end": 6561.671,
    "text": "Others are being drawn like a chaotic moth to the flame.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6562.011,
    "end": 6563.953,
    "text": "They come close, but then it burns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6564.513,
    "end": 6565.534,
    "text": "And then they fly away.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6565.554,
    "end": 6569.958,
    "text": "Oh, dear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6570.546,
    "end": 6575.028,
    "text": " So one could imagine these kinds of systems to be like stochastic chaos.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6575.709,
    "end": 6583.493,
    "text": "And that could be, now again, we're thinking about, previously the Lorenz system was like maybe a particle in a chaotic weather system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6583.853,
    "end": 6586.175,
    "text": "So that was like the weather systems that Lorenz was studying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6587.015,
    "end": 6597.241,
    "text": "But now we're gonna be thinking about particular states, like a particular moth, that's able to not just have outgoing statistical dependencies,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6598.373,
    "end": 6600.894,
    "text": " but to do policy selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6601.474,
    "end": 6605.795,
    "text": "So this is where we actually get adaptive active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6606.195,
    "end": 6614.238,
    "text": "And again, if there's two kinds of moths, some of them are just particles and then they get burnt when they get burnt and they don't when they don't, some will survive and some won't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6614.878,
    "end": 6620.38,
    "text": "But the ones that do enact effective policy selection",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6621.4,
    "end": 6643.889,
    "text": " are going to be persistent even a day later so then the lepidoptera have been around for millions of years so is it really any surprise that the moths have adaptive behavioral systems but that when the niche changes like with electric nighttime lighting that that doesn't entail that it's going to instantly be the adaptive system for that new niche",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6645.882,
    "end": 6653.524,
    "text": " We can think about the motion of a moth attracted towards a flame, but constantly thwarted by turbulent or solenoidal air currents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6654.325,
    "end": 6667.369,
    "text": "Because active states influence sensory states and possibly external states, this would look as if the particle, the moth, was trying to attain its most likely state in the face of random fluctuations and solenoidal dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6668.433,
    "end": 6678.541,
    "text": " So it's like, there's those arrows, the irrotational component are like converging the moth to the flame, but then like overshoot and the windy room are blowing it around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6679.081,
    "end": 6687.527,
    "text": "And so again, there's the moth in the room and we could look at it in the X, Y, and the Z. And if the candle were in the center of the room, it would be like a bowl",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6688.51,
    "end": 6695.436,
    "text": " that the moth were converging towards for any two dimensions that you looked at and indeed all three dimensions when considered together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6696.437,
    "end": 6708.127,
    "text": "And the movement of that particle, the dynamics of that particle would be related to something about the flow of the air in that room with a pullback attractor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6709.451,
    "end": 6715.577,
    "text": " This perspective emphasizes the active part of self-evidencing, sometimes referred to as active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6716.217,
    "end": 6724.945,
    "text": "So we were calculating the potential, the self-surprisal, the outgoing dependencies for particles before we talked about policy selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6726.129,
    "end": 6730.513,
    "text": " And that is showing mere active inference as it's called.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6731.114,
    "end": 6742.504,
    "text": "But then when you think about the real world where only the anti-dissipative systems persist and the successful ones even more so, that's where policy selection comes in to play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6743.405,
    "end": 6745.827,
    "text": "And that's actually where this paper ends.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6747.128,
    "end": 6750.591,
    "text": "They basically just bring it to that point",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6751.798,
    "end": 6761.443,
    "text": " and say all systems are gonna be able to be framed within this way, again, not the territories, all of the approximations that we make will have these attributes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6762.644,
    "end": 6780.534,
    "text": "And then we can imagine that there are some systems where the internal states are not just acting as if they're doing conditional expectations on external states, but then they take those conditional expectations, like about the weather, and then there's another node for policy selection, like the other pie,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6781.527,
    "end": 6783.608,
    "text": " policy selection in the models we've seen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6784.348,
    "end": 6787.77,
    "text": "And then that pie can be like put on the jacket or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6788.25,
    "end": 6794.534,
    "text": "Those are like the two affordances or those are the two states in the affordance variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6795.654,
    "end": 6810.162,
    "text": "And then in a dissipative world, you're going to see adaptive agents as the ones that are able to recurrently adapt to changing and chaotic circumstance to repeatedly come back to that candle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6811.058,
    "end": 6817.405,
    "text": " And so just to summarize, then we'll just, if there's any implications we want to touch, but we'll summarize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6820.067,
    "end": 6832.22,
    "text": "They constructed a Laplacian system that's quadratic, aka bowl-like, in its potential function and flow operators, state-dependent flow operators, by the way, that includes the housekeeping function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6833.424,
    "end": 6845.768,
    "text": " that evinces, so provides evidence for stochastic chaos because it has that Lyapunov exponent that was very similar to the ones that were calculated from the non-Laplace assumptions or approximations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6848.769,
    "end": 6862.413,
    "text": "The way that the polynomial approximation played out with the first and second order approximations gave a sparsity which can be interpreted as conditional independencies",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6863.504,
    "end": 6866.026,
    "text": " and a partitioning into four kinds of states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6869.048,
    "end": 6873.69,
    "text": "Coupled systems have a conditional synchronization map.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6874.471,
    "end": 6876.292,
    "text": "In this example, it had a linear form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6876.512,
    "end": 6878.533,
    "text": "They were on that manifold that was like Y equals X.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6880.27,
    "end": 6887.797,
    "text": " And this is important because in these Laplacian coupled systems, the conditional synchronization map is necessarily diffeomorphic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6888.198,
    "end": 6894.083,
    "text": "Again, would be awesome if somebody wanted to come on and like help us see what the technical implications of the diffeomorphism is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6895.445,
    "end": 6895.645,
    "text": "But...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6896.892,
    "end": 6900.236,
    "text": " The simplest level is like, it doesn't bend back on itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6901.037,
    "end": 6902.84,
    "text": "So it's a good function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6903.721,
    "end": 6910.129,
    "text": "So that means for every sensory state, there's a unique expected internal state and conditional density over external states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6911.13,
    "end": 6913.653,
    "text": "So it'd be like, yeah, when the thermometer says like 20, it could be 20 or 50.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6915.993,
    "end": 6940.009,
    "text": " that's not a very helpful thermometer now if you say the thermometer always reads half of the temperature or it's always double or it's a little noisy those are all workable but like the thermometer could just totally be deceiving you and then it just is a it's a wacky world with what the thermometer says not going to be a very adaptive system the resulting formulation can be read as bayesian mechanics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6940.953,
    "end": 6946.076,
    "text": " in which internal states on average parameterize belief of a Bayesian sort about external states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6947.196,
    "end": 6963.385,
    "text": "Just like these equations when applied to particles and statistical distributions were a statistical mechanics, we're taking the full Bayesian insight and reading these equivalencies and formalisms as a Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6964.363,
    "end": 6965.864,
    "text": " So that's the summary of 5.2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6966.604,
    "end": 6971.047,
    "text": "And then there's a few implications that they get into, but we'll first have any questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6971.067,
    "end": 6972.208,
    "text": "So Dean, then Steven.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6974.049,
    "end": 6985.196,
    "text": "Well, I just think it's fascinating that it doesn't matter whether we're talking moths or people, we're kind of blissfully unaware of the statistical manifold",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6986.724,
    "end": 6993.626,
    "text": " floating around us prior to us being pulled back to that flame and either becoming the hero moth or the fool moth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6994.106,
    "end": 7006.149,
    "text": "We don't discover that until afterwards, but if we could be aware of the kind of the statistical distribution in play prior to us being pulled, it might help.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7006.929,
    "end": 7013.591,
    "text": "I don't think it determines much, but it certainly enlightens as opposed to being lit up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7015.817,
    "end": 7019.098,
    "text": " Yeah, and the moth example, I think, well, you know, but if it really reaches the flame, it dies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7019.578,
    "end": 7024.219,
    "text": "So maybe that's not even the final perfect example for how attractors work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7024.319,
    "end": 7026.74,
    "text": "That'd be like a bowl with a hole at the bottom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7027.28,
    "end": 7029.68,
    "text": "So again, it's just, it's a heuristic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7030.16,
    "end": 7032.721,
    "text": "It helps us think about the kinds of systems that we're talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7032.781,
    "end": 7042.683,
    "text": "But realism interpretation asides, even that example doesn't capture the whole thing because it's a metaphor, because it's like map of map of territory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7042.804,
    "end": 7044.024,
    "text": "So it's totally chill.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7044.404,
    "end": 7044.644,
    "text": "Steven?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7047.079,
    "end": 7057.642,
    "text": " Yeah, the evinces, stochastic chaos, which wasn't a word I'd heard of before, to be honest, is this idea of equality.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7059.382,
    "end": 7076.027,
    "text": "So that's really useful, how it gives a sense of how both there can be chaos in the attractor and the noise maintained, at least at some level,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7077.005,
    "end": 7085.747,
    "text": " throughout because in most cases, the noise is just averaged away in other scenarios.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7086.647,
    "end": 7092.448,
    "text": "So this piece where we're tapping into that quality is really interesting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7092.608,
    "end": 7105.031,
    "text": "And then that then tying into the Bayesian mechanics all the way down is very, very useful, especially when I think the Bayesian mechanics, as I've mentioned before,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7105.951,
    "end": 7122.153,
    "text": " is stacked it's like it's not saying this is where everything is different to evidence in it's like like we're going to give better evidence which or better evidence which make us think we're going to show a more accurate Lorenz attractor solution no it's",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7123.047,
    "end": 7144.735,
    "text": " evinces and we can stack up and add these fuzzy qualities together and we'll still have a fuzzy quality but maybe we'll have one which is a little bit more practical and that's the game in town here is practicality so i like that cool also um it does average out noise",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7145.66,
    "end": 7150.604,
    "text": " the internal states on average, the expectation parameterizes beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7150.704,
    "end": 7160.552,
    "text": "And so that's going to be a major challenge is to go from these expectation and mean field approximations without going into ergodicity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7160.792,
    "end": 7162.773,
    "text": "That is literally the whole challenge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7163.434,
    "end": 7170.98,
    "text": "The Laplacian is like a quadratic that's fit on another distribution, which we're not even caring to learn the form of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7172.199,
    "end": 7182.364,
    "text": " And so we could say that the expectation, the single number expectation, the expectation of a child in that class is five feet tall, but maybe it's all four and six feet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7182.864,
    "end": 7187.646,
    "text": "But if we fit Laplacian on that, it's gonna be at five looking like a quadratic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7188.586,
    "end": 7200.792,
    "text": "So the map and the territory are not the same, and it is a significant challenge across domains to connect some of the approximations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7201.96,
    "end": 7203.82,
    "text": " that are double-edged swords.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7204.7,
    "end": 7211.102,
    "text": "Like let's approximate over a bunch of possible futures, or let's approximate this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7211.142,
    "end": 7213.182,
    "text": "Like there's no free lunch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7213.982,
    "end": 7221.863,
    "text": "So the internal states on average parameterize beliefs, but does any given internal state parameterize beliefs?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7222.704,
    "end": 7228.124,
    "text": "Evolution kind of helps us out by saying like, well, on average, it's gonna get better and better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7228.184,
    "end": 7230.885,
    "text": "That's like the fundamental theorem of natural selection, FTNS.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7232.475,
    "end": 7235.059,
    "text": " And then the ones that don't do as well, they die.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7236.0,
    "end": 7242.529,
    "text": "So evolution in a way helps us get out of this, but the formalism doesn't have that as we saw it right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7243.05,
    "end": 7243.691,
    "text": "Yeah, Steven on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7244.721,
    "end": 7245.842,
    "text": " That's a really good point.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7246.042,
    "end": 7265.017,
    "text": "And so it also does tie into the... So it gives a way to sort of the word average, but to average or approximate these faster perturbations, yet it still maintains perturbations, which could be used at the next nested level or in other ways.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7265.658,
    "end": 7268.12,
    "text": "So there's an interesting thing about it's reducing and...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7273.408,
    "end": 7275.819,
    "text": " the overwhelming noise",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7278.208,
    "end": 7289.07,
    "text": " yet it's also not doing what traditional statistical averaging does, which is basically crash everything down to, you know, a fixed point.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7289.17,
    "end": 7292.571,
    "text": "It gives this ability for it still to be alive in a way.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7293.271,
    "end": 7293.811,
    "text": "Absolutely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7294.072,
    "end": 7304.414,
    "text": "Like if we just took the expectation, the single average point of the Lorenz attractor itself, it would just be one point in the middle of the saddle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7306.198,
    "end": 7319.582,
    "text": " Okay, but we have something that still has a dynamical nature with a tractable approximation and the dynamics have a positively operative exponent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7320.222,
    "end": 7324.723,
    "text": "So we didn't squash the system down to a point or a racetrack.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7325.443,
    "end": 7330.525,
    "text": "We kept some of the dynamical and even chaotic aspects of the system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7331.624,
    "end": 7334.772,
    "text": " while still being able to talk about things on average.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7335.514,
    "end": 7338.441,
    "text": "But we're not talking about the average position of the particle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7339.423,
    "end": 7340.286,
    "text": "Yeah, Stephen, quickly on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7341.485,
    "end": 7342.846,
    "text": " Yeah, I think that's a good point.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7342.886,
    "end": 7352.029,
    "text": "And also, just one thing that caught my mind is with that butterfly, with the moth going to the flame, is it talks about a perspective that's been taken.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7353.429,
    "end": 7357.491,
    "text": "And this is probably useful when people are thinking in the applied active inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7358.051,
    "end": 7360.492,
    "text": "This is the perspective that we're having.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7360.552,
    "end": 7363.793,
    "text": "And it's possibly more used, the word perspective, because we see a picture of a moth.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7364.273,
    "end": 7366.274,
    "text": "If there was no picture there, we might say a description.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7367.174,
    "end": 7382.229,
    "text": " of the scenario okay so there's this perspective on the moth yet the moth isn't necessarily in this scenario taking a perspective it's doing it's it's doing its mothness",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7383.274,
    "end": 7385.456,
    "text": " Yep, it's definitely moths gonna moth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7385.676,
    "end": 7388.258,
    "text": "Although the picture was not in the paper, I added that one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7388.478,
    "end": 7391.88,
    "text": "But the winged snowflake was indeed in the 2006 paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7392.421,
    "end": 7399.966,
    "text": "So let's just recap a few of the domains of implication and then we'll close because like, what a fun pape and discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7400.947,
    "end": 7403.049,
    "text": "So one, implication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7404.368,
    "end": 7426.275,
    "text": " but also sort of note of caution, is that just because we took the OG complex system Lorenz and coupled it, so two chess moves beyond some sort of simple scenario, it doesn't mean that a synchronization map exists, let alone a good one for any given system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7426.875,
    "end": 7427.075,
    "text": "But",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7428.436,
    "end": 7448.212,
    "text": " One of the implications of this paper was that now we know that for a non-zero subset of dynamical systems, a non-zero subset of chaotic dynamical systems, and a non-zero subset of dynamical chaotic coupled systems, we can get this well-behaved approximation map.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7449.072,
    "end": 7454.577,
    "text": "So not to say all, but we know that the answer is now not none.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7455.878,
    "end": 7457.539,
    "text": "So that's a key implication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7459.232,
    "end": 7467.034,
    "text": " Another implication was to really start to bring in the variational free energy in terms of generalized synchrony.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7467.614,
    "end": 7485.68,
    "text": "That's what opens up to the DaCosta discrete state space synthesis active inference, Bayesian surprise, optimal Bayesian design, intrinsic motivation, InfoMax, risk-sensitive policies, KL control, Occam's principle, decision theory, utility theory, Max-Ent, constructal theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7487.483,
    "end": 7504.58,
    "text": " this is not all in this paper so a lot more has to be done to get to some of these places especially in such a uh reasoned and bottom-up way um another implication of the paper is that they",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7506.004,
    "end": 7508.066,
    "text": " took the Helmholtz decomposition in a new way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7508.866,
    "end": 7512.71,
    "text": "And it might provide a generic model for random dynamical systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7513.551,
    "end": 7533.728,
    "text": "Importantly, because we connected it so closely to Bayesian generative modeling, it could be possible to do less just like, let's do descriptive analytics on flow to like, let's have a map that we can run both ways, where we're updating the parameters of our flow map",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7535.069,
    "end": 7538.791,
    "text": " with what we're observing, but then we can also generate data sets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7538.831,
    "end": 7540.292,
    "text": "We can generate counterfactuals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7540.792,
    "end": 7551.579,
    "text": "And so that is what allows sparse data sets to play into Active Infant FEP and ties us more closely to modern machine learning like variational autoencoders.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7553.84,
    "end": 7563.806,
    "text": "Another implication or next step would be like we were looking at a three-dimensional system, the X, Y, and Z of the Lorenz attractor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7564.721,
    "end": 7569.703,
    "text": " but how could we approach high dimensional dynamical systems?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7570.363,
    "end": 7575.406,
    "text": "So attractors in 50 dimensions, that's a little bit different and hard to solve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7576.206,
    "end": 7591.533,
    "text": "So they suggest that a way to approach this, probably hint, hint, cough, cough, wink, wink, et cetera, is to learn the state dependent flow operator and the Ness using deep neural networks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7592.577,
    "end": 7596.908,
    "text": " So it's kind of like you have a neural network now that recognizes bulls.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7598.038,
    "end": 7604.681,
    "text": " And so we're still kind of keeping some of the same things that we had a intuitive interpretation of in lower dimensions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7605.461,
    "end": 7608.142,
    "text": "It's just like, you go like, okay, I know about the cube.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7608.202,
    "end": 7610.343,
    "text": "And then someone says, well, there's like an 11 dimensional cube.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7610.363,
    "end": 7617.106,
    "text": "And you go, okay, I kind of know what, I don't really see exactly what that means, but I kind of see what is being discussed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7617.667,
    "end": 7620.328,
    "text": "How are we going to compute on the 11 dimensional cube though?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7620.808,
    "end": 7622.309,
    "text": "Well, neural networks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7623.169,
    "end": 7627.411,
    "text": " And that is actually very close to neural stochastic differential equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7627.531,
    "end": 7628.992,
    "text": "And I think this is super exciting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7630.193,
    "end": 7642.619,
    "text": "One could, ergo hasn't been done, probably, hint, hint, use a separate feed forward neural network to parameterize different components of the flow operator and self-information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7644.12,
    "end": 7647.642,
    "text": "So in other words, we're taking what we talked about here",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7648.74,
    "end": 7659.748,
    "text": " And we can think about combining it with the types of stochastic differential equations, neural stochastic differential equations and Bayesian neural networks, all of these advances in machine learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7660.548,
    "end": 7668.574,
    "text": "And now we're actually coming back to the table with new architectures for deep learning, because this would be a deep learning model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7668.754,
    "end": 7670.235,
    "text": "It would have a deep neural network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7670.315,
    "end": 7672.436,
    "text": "You would benefit from having a GPU,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7673.317,
    "end": 7694.718,
    "text": " but it's an architecture that was inspired by the discussions that we had here and then just the final implications and then we'll just have a little closing um the flows across the boundary also notice that a little bit of the blanket starting to potentially be inched away from talking more about a markov boundary",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7695.993,
    "end": 7715.179,
    "text": " And connecting the FEP to the constructal law and the work of Professor Adrian Bajon, who honestly is a lot like Friston in some ways, and a really gracious person and communicator as well, with a long career of working towards this kind of a unifying structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7715.379,
    "end": 7730.65,
    "text": " flow theory to get towards the evolution of design in nature and as the image shows like kind of like from floodplains to lung alveoli that similar kind of a unifying model and then a final set of implications",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7731.627,
    "end": 7759.284,
    "text": " is that we take covariances all the time from time series that's like how we do crypto trading that's how we do weather prediction that's all kinds of systems take covariance matrices on time series and so potentially because the hessian is recapitulating elements of the covariance matrix it could be possible to have an empirical data set",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7760.191,
    "end": 7766.855,
    "text": " and empirically take the covariance and then learn something about the Hessian, the curvature of the underlying flow states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7767.495,
    "end": 7778.841,
    "text": "So in other words, if you use the Laplacian approximation, even if it's stochastic, chaotic, and dynamic, that empirical covariance could identify conditional independencies where there's a zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7780.662,
    "end": 7781.563,
    "text": "And so in principle,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7782.81,
    "end": 7800.354,
    "text": " you could furnish a description of expected flow and the Lyapunov exponents to establish whether the system was chaotic or not, because we found that the Hessian approximation gave us a Lyapunov estimate that was like the actual Lyapunov exponent in the Lorenz system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7800.995,
    "end": 7809.897,
    "text": "So we could go from empirical covariances, which people do literally every day, C, O, V, open parentheses and R, empirical covariances,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7810.757,
    "end": 7817.403,
    "text": " two estimated Hessians, two estimates of things like the Lyapunov exponents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7818.864,
    "end": 7836.599,
    "text": "And that's why people often study chaotic systems in the super toy models, like the double pendulum and Lorenz, because it turns out it's shockingly hard to find chaotic systems in nature outside of those toy examples, because the real noise in the system swamps your signal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7837.594,
    "end": 7851.464,
    "text": " And so in conclusion, having a simple functional form for the flow of random dynamical systems may be useful for modeling and analyzing time series generated by real world processes that are far from equilibrium and may or may not be chaotic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7851.945,
    "end": 7853.666,
    "text": "And so that's the closing question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7854.967,
    "end": 7865.234,
    "text": "Human flow, physical flow, supply chains, information flow, narrative flow, semantic flow, ants bringing seeds in and taking the mid and out, all of these flows",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7866.158,
    "end": 7867.619,
    "text": " we have data sets for them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7868.299,
    "end": 7872.521,
    "text": "And now we have a new kind of model that we can use to model those flows.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7873.542,
    "end": 7878.224,
    "text": "So we'll just chill and talk for a few more minutes, but what a great discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7878.304,
    "end": 7881.805,
    "text": "So thanks a lot, Dean and Stephen and everybody else who participated in 32.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7882.926,
    "end": 7884.007,
    "text": "So Stephen first.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7887.328,
    "end": 7887.768,
    "text": "Deep breath.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7889.269,
    "end": 7895.272,
    "text": "Yeah, there was a couple of things there that seems to have a big impact because",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7897.185,
    "end": 7924.504,
    "text": " As well as Markovian monism and the idea that active inference brings in this partitioning and the active inference field, which can then also have relationships to deep learning and how predictive processing is thought about, what's being said here that there's also evincing or evince, the idea of the evince and statistic chaos itself",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7926.064,
    "end": 7935.646,
    "text": " also being a paradigm, paradigmatic part of evidence being arrived at.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7936.466,
    "end": 7946.008,
    "text": "So which in some ways is not dependent purely on Markovian monism being the overarching game in town.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7946.948,
    "end": 7953.909,
    "text": "So that is quite an interesting additional way for",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7955.185,
    "end": 7982.091,
    "text": " deep learning to be um to be impacted by is this a field of practice is it a domain i don't know what we call it but that that that does it does it does make everything does it doesn't mean it's all markovian monism in terms of the ability to then infer you've also got this other um ability to get",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 7984.457,
    "end": 8010.714,
    "text": " information and from what you're saying it almost as much by inferring if there is chaotic presence or if there's not maybe not having maybe going and seeing if there's not chaos present may give an idea of there's maybe no correlations present and that's that's jumping the gun but you know maybe there's other ways of being able to interrogate statistical dependencies in time series analysis",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 8012.014,
    "end": 8016.083,
    "text": " that can be sitting alongside the Markovian monism.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 8019.457,
    "end": 8028.419,
    "text": " So how that's connected to Markovian monism is definitely a good question, but yes, these are general tools for complex systems analysis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8028.779,
    "end": 8037.68,
    "text": "So I hope people don't read this paper as like frist in apologetics or some sort of fringe development in ACT-INF only.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8038.3,
    "end": 8047.702,
    "text": "It's pretty clear from the nouns that we used that this is actually like a fundamental contribution towards analyzing dynamical, stochastic, chaotic systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8048.342,
    "end": 8057.508,
    "text": " However, just because you find, for example, a low lyopinib exponent of your approximation, it's not a statement about the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8058.748,
    "end": 8062.351,
    "text": "So we will always be able to just halt right there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8062.831,
    "end": 8064.452,
    "text": "You know, it's not that it's not a chaotic system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8065.132,
    "end": 8069.455,
    "text": "Your approximation doesn't have a chaotic leading lyopinib exponent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8071.396,
    "end": 8072.897,
    "text": "So say what you want to say about your map.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8072.997,
    "end": 8076.86,
    "text": "And now if your map isn't chaotic and you're doing a great job,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8077.642,
    "end": 8080.523,
    "text": " predicting, explaining, controlling, designing, creating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8081.243,
    "end": 8081.704,
    "text": "Wonderful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8081.924,
    "end": 8086.065,
    "text": "I hope the business is successful and that you can have friendship and health and all those things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8086.385,
    "end": 8088.426,
    "text": "But that's not a claim about the territory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8089.046,
    "end": 8092.708,
    "text": "And so there's going to be so many fun ways to talk and explore that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8093.888,
    "end": 8096.068,
    "text": " Dean, what are your closing thoughts?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8096.749,
    "end": 8097.369,
    "text": "Just real quick.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8097.589,
    "end": 8118.793,
    "text": "I think what the covariation piece, which is basically statistics and an abstraction to sort of explain things, points out is that if we can understand the world as being both within, enveloped, and between, partitioned, at the same time, that's a good fundamental place to start.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8118.833,
    "end": 8120.894,
    "text": "And I completely agree with your last statement.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8121.274,
    "end": 8121.594,
    "text": "We're not...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8123.325,
    "end": 8127.289,
    "text": " We're not counting fairies on pins and then just leaving it there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8127.469,
    "end": 8132.094,
    "text": "We're actually hoping at some point to be able to turn this into something useful and functional.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8132.414,
    "end": 8138.941,
    "text": "But if you can't start from a place of seeing it as two things at once, within and between, you're going to struggle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8139.702,
    "end": 8145.328,
    "text": "You're going to tend to collapse prematurely and you're not going to get very creative and active inference will",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8147.042,
    "end": 8156.926,
    "text": " Well, you'll be able to define it and describe it, but I'm not sure how much new information you'll be able to derive with it, unless you can hold up both at once.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8157.306,
    "end": 8158.247,
    "text": "It's within in between.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8162.068,
    "end": 8162.368,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8162.828,
    "end": 8173.273,
    "text": "There's so much more that we all have to learn, the appendices, the formalisms we didn't go into, the citations, other perspectives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8174.448,
    "end": 8175.81,
    "text": " you know, it's just the beginning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8175.85,
    "end": 8177.872,
    "text": "And that's what dot two is about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8178.313,
    "end": 8186.943,
    "text": "Like how far we've come, you know, when we can go back to our roadmap and just be like, wait, dynamical systems and densities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8187.504,
    "end": 8188.485,
    "text": "And then we're, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8189.74,
    "end": 8214.959,
    "text": " 300 miles past there but where have we gotten and so it's like just really exciting and i'm glad that we're doing it in a participatory way because um there's a lot to it so dean and steven thank you again everybody watching live and replay hope that you get involved and stay involved with act and flap see you later bye",
    "speaker": "SPEAKER_01"
  }
]