[
  {
    "start": 1.357,
    "end": 10.424,
    "text": " hello and welcome everyone it is june 28 2022 and we are here in actin flap guest stream number 24.1",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 12.762,
    "end": 19.167,
    "text": " Today we're here with Professor Steven Grossberg and the agenda will be as follows.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 19.888,
    "end": 22.71,
    "text": "First, Ali will provide a short introduction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 23.391,
    "end": 29.976,
    "text": "We will then play a 45 minute prerecorded video followed by a Q&A.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 30.476,
    "end": 38.603,
    "text": "So thanks everyone for joining and Professor Grossberg really appreciate joining and I'll pass to Ali for the introduction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 42.875,
    "end": 43.696,
    "text": " Hello and welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 43.716,
    "end": 44.456,
    "text": "I'm Ali.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 44.476,
    "end": 46.558,
    "text": "I'm an independent researcher from Iran.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 46.798,
    "end": 52.764,
    "text": "I'm very happy and excited to be here and be able to speak with Professor Grossberg today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 53.484,
    "end": 56.907,
    "text": "So I'd like to thank Professor Grossberg for joining us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 58.208,
    "end": 70.119,
    "text": "Steven Grossberg is the Wong Professor of Cognitive and Neural Systems and a Professor Emeritus of Mathematics and Statistics, Psychological and Brain Sciences, and Biomedical Engineering at Boston University.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 71.391,
    "end": 82.118,
    "text": " For more than 50 years, he has led pioneering research in discovering and developing neural design principles for autonomous adaptive intelligence based on biological and machine learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 83.119,
    "end": 93.986,
    "text": "His neural network models have been applied to many large-scale problems in engineering and technology, including the design of increasingly autonomous adaptive algorithms and mobile agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 95.047,
    "end": 98.069,
    "text": "In fact, this is what Carl Friston says about him.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 98.942,
    "end": 108.749,
    "text": " Whenever you claim to be the first to do this or that in artificial intelligence, it is customary and correct to add, with the exception of Steven Grossberg.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 109.249,
    "end": 114.332,
    "text": "Quite simply, Steven is a living giant and foundational architect of the field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 115.793,
    "end": 123.899,
    "text": "Professor Grossberg is the recipient of the 2015 Norman Anderson Lifetime Achievement Award of the Society of Experimental Psychologists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 124.548,
    "end": 136.577,
    "text": " the 2017 Frank Rosenblatt Award of the IEEE Computational Intelligence Society, and the 2019 Donald O. Hebb Award of the International Neural Network Society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 137.517,
    "end": 148.025,
    "text": "His latest book, Conscious Mind, Resonant Brain, as a culmination of his decades-long research, written in a rather non-technical and conversational style, is published in 2021 by Oxford University Press",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 150.714,
    "end": 158.598,
    "text": " and is the winner of the Association of American Publishers in 2022 prose award for the best book of the year in neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 159.339,
    "end": 165.442,
    "text": "Now, I'll pass it to Professor Grossberg, and then we'll continue with the 45-minute pre-recorded lecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 170.084,
    "end": 173.406,
    "text": "If you'd like to say hi, otherwise I'll begin the video.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 173.466,
    "end": 176.628,
    "text": "I just saw my face frozen on the screen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 177.589,
    "end": 180.19,
    "text": "Well, I'm delighted to be here, and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 181.812,
    "end": 189.215,
    "text": " I hope you find some points of interest in the lecture and I'll look forward to the Q&A.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 189.475,
    "end": 198.58,
    "text": "Ali has prepared a series of questions that I've thought about and have some prepared sketched answers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 198.68,
    "end": 210.725,
    "text": "And then after that, if you're still interested, I'm happy to do live Q&A about anything related to the topics of the day.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 212.822,
    "end": 213.102,
    "text": " Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 214.363,
    "end": 215.264,
    "text": "Onto the main course.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 216.745,
    "end": 219.487,
    "text": "I will play the video now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 222.149,
    "end": 224.33,
    "text": "And you won't hear anything on the live stream.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 224.35,
    "end": 228.073,
    "text": "I'll crop it and the audio will be coming through fine now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 233.397,
    "end": 233.857,
    "text": "Hello.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 233.877,
    "end": 240.682,
    "text": "I'm delighted to be able to speak to you today about a topic concerning",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 241.286,
    "end": 246.449,
    "text": " artificial intelligence, which, as you know, is very much in the news these days.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 247.29,
    "end": 253.473,
    "text": "And I'll be contrasting two very different approaches to artificial intelligence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 254.134,
    "end": 263.479,
    "text": "But to do that, I need to pull up my PowerPoint slides and share them with you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 263.499,
    "end": 270.844,
    "text": "And let me maximize them and minimize my face.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 272.637,
    "end": 282.705,
    "text": " So my topic today is Explainable and Reliable AI, Comparing Deep Learning with Adaptive Resonance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 285.167,
    "end": 293.294,
    "text": "This lecture is based on the following article from this year, which is both open access and on my webpage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 294.194,
    "end": 297.557,
    "text": "The article summarizes core problems of deep learning",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 298.231,
    "end": 309.539,
    "text": " such as its untrustworthiness because it's unexplainable and its unreliability because it experiences catastrophic forgetting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 310.48,
    "end": 326.071,
    "text": "The article explains how adaptive resonance overcomes these problems, indeed, overcomes 17 problems of deep learning and outlines a blueprint for achieving autonomous adaptive intelligence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 327.608,
    "end": 353.197,
    "text": " The article is part of a Frontiers in Neuro-Robotics special issue about explainable AI, whose editors wrote, and I quote, though deep learning is the main pillar of current AI techniques and is ubiquitous in basic science and real world applications, it is also flagged by AI researchers for its black box problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 353.917,
    "end": 355.058,
    "text": "It is easy to fool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 355.905,
    "end": 360.987,
    "text": " and it also cannot explain how it makes a prediction or decision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 361.927,
    "end": 364.968,
    "text": "In other words, deep learning is not trustworthy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 365.808,
    "end": 376.952,
    "text": "No life or death decision, such as a medical or financial decision, can confidently be made based upon a deep learning prediction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 378.633,
    "end": 382.434,
    "text": "Deep learning uses the back propagation algorithm",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 382.847,
    "end": 387.831,
    "text": " for learning how to predict output vectors in response to input vectors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 388.671,
    "end": 396.758,
    "text": "That propagation was based on perceptron learning principles that Frank Rosenblatt started to introduce in the 1950s.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 396.958,
    "end": 406.365,
    "text": "It has a complicated history, which Juergen Schmidhuber beautifully reviewed in an article from this year.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 407.686,
    "end": 412.71,
    "text": "Major contributors include Shinichi Omari, Paul Werbos, and David Parker.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 413.677,
    "end": 429.145,
    "text": " Perhaps one would say that it reached its modern form with simulated applications in Paul's 1974 paper before being popularized 12 years later by Rummel, Hart, Hinton, and Williams.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 430.866,
    "end": 439.67,
    "text": "Here's a schematic of a back propagation circuit reprinted from a survey article by Gail Carpenter of neural network models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 440.871,
    "end": 441.151,
    "text": "In it,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 441.784,
    "end": 447.967,
    "text": " Information flows feed forward from an input stage to an output stage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 449.528,
    "end": 457.452,
    "text": "Learning is supervised by an external teacher who on each trial defines a target or desired output.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 458.793,
    "end": 466.017,
    "text": "The teaching signal is the error or mismatch between the actual and the target outputs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 467.617,
    "end": 469.899,
    "text": "The teaching signal in level F3",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 471.385,
    "end": 480.11,
    "text": " of adaptive weights in level F2 have no network pathway whereby to reach from F3 to F2 within the algorithm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 480.871,
    "end": 492.758,
    "text": "So the algorithm uses an artifice called weight transport, which physically lifts the weights from here and moves them there so that they can be used to control learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 493.418,
    "end": 500.002,
    "text": "Well, this is clearly a non-local operation as well as being clearly",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 501.334,
    "end": 502.995,
    "text": " non-biological.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 505.477,
    "end": 515.624,
    "text": "Backpropagation learns through slow learning, which means that the adaptive weights change just a little to reduce error on each learning trial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 516.204,
    "end": 526.231,
    "text": "That requires many trials, that is to say many repetitions of the whole database to learn, possibly hundreds or thousands of trials.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 527.432,
    "end": 529.934,
    "text": "This is to be contrasted with fast learning,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 530.492,
    "end": 539.298,
    "text": " where adaptive weights zero error signals on each trial, just as we can learn a face that we see just once and remember it for a long time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 540.039,
    "end": 545.182,
    "text": "If backprop tried to use fast learning, it would become wildly unstable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 546.503,
    "end": 557.851,
    "text": "Catastrophic forgetting also occurs in backprop, so that during any learning trial, an unpredictable part of its learned memory can unexpectedly collapse.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 559.784,
    "end": 567.126,
    "text": " So deep learning, which is based on backpropagation, is thus neither reliable nor trustworthy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 568.126,
    "end": 569.166,
    "text": "But why is this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 570.006,
    "end": 574.527,
    "text": "One reason is that all inputs are processed by a shared set of learned weights.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 575.367,
    "end": 581.088,
    "text": "The algorithm cannot selectively buffer learned weights that are still predictably useful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 581.708,
    "end": 584.109,
    "text": "In particular, there's no attention mechanism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 585.285,
    "end": 598.954,
    "text": " This problem occurs in any learning algorithm whose shared weight updates follow the gradient of the error in response to the current batch of data points while ignoring past batches.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 600.335,
    "end": 603.397,
    "text": "There have been multiple efforts to fix back propagation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 604.237,
    "end": 613.523,
    "text": "One is to selectively slow learning on the weights important for learning by optimizing parameters using the Bayes rule, as Kirkpatrick et al.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 614.241,
    "end": 616.002,
    "text": " suggested a few years ago.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 616.782,
    "end": 631.87,
    "text": "But that assumes an omniscient observer who can discover and alter the important weights, as well as non-local computations, such as the Bayesian computation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 632.75,
    "end": 642.415,
    "text": "The same problem occurs with evolutionary algorithms and diffusion-based neuromodulation and other approaches to try to fix back problems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 644.127,
    "end": 652.193,
    "text": " These efforts to overcome catastrophic forgetting created additional conceptual and computational problems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 653.153,
    "end": 665.842,
    "text": "I view them as adding epicycles to ameliorate a fundamental flaw in the model, which to me is reminiscent of adding epicycles to correct problems in the Ptolemaic model of the solar system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 666.723,
    "end": 672.667,
    "text": "As we all know, the Copernical model that we now accept didn't require epicycles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 674.019,
    "end": 687.783,
    "text": " Perhaps this is why Jeffrey Hinton, who played a key role in developing both backprop and deep learning, said in an Axios interview a few years ago that, quote, he's deeply suspicious of backpropagation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 688.583,
    "end": 690.603,
    "text": "I don't think it's how the brain works.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 691.504,
    "end": 694.405,
    "text": "We clearly don't need all the labeled data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 695.185,
    "end": 699.626,
    "text": "My view is throw it all away and start over.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 699.646,
    "end": 703.387,
    "text": "I would claim we don't have to start over",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 704.025,
    "end": 709.69,
    "text": " because these problems were solved in the 1970s and 1980s.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 710.491,
    "end": 723.362,
    "text": "In particular, in the first issue of the journal Neural Networks in 1988, I had an article that listed 17 problems of backpropagation that are overcome by adaptive resonance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 724.083,
    "end": 726.145,
    "text": "And here they are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 728.086,
    "end": 740.912,
    "text": " With regard to not needing all the label data, I noted in the third item here that self-organized unsupervised or supervised learning frees us from needing labels all the time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 741.792,
    "end": 748.615,
    "text": "As to slow learning, I noted that in ART you can have fast or slow learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 749.455,
    "end": 757.619,
    "text": "Indeed, ART can learn to classify an entire database using fast learning on a single learning trial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 758.248,
    "end": 762.11,
    "text": " as Gail Carpenter and I showed in the 1980s.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 762.951,
    "end": 771.395,
    "text": "Moreover, art overcomes all 17 problems of backpropagation without the cycles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 772.035,
    "end": 783.341,
    "text": "Furthermore, all the core art predictions have been supported by subsequent psychological and neurobiological data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 784.162,
    "end": 786.103,
    "text": "Indeed, art is a principled,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 786.584,
    "end": 795.809,
    "text": " biological and technological theory, unlike back-prop and deep learning, which are just algorithms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 797.47,
    "end": 806.915,
    "text": "ART has explained data from hundreds of experiments and it's made scores of predictions that have subsequently received experimental support.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 808.096,
    "end": 810.417,
    "text": "But why has ART been so successful?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 811.117,
    "end": 813.619,
    "text": "There are a number of reasons, but one of them is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 814.349,
    "end": 824.634,
    "text": " that art can be derived from a thought experiment about a universal problem in error correction that I published 40 years ago in Psychological Review.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 824.654,
    "end": 836.099,
    "text": "The thought experiment asks the question, how can a coding error be corrected if no individual cell knows that one has occurred?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 836.879,
    "end": 838.52,
    "text": "Let me quote from my paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 839.622,
    "end": 858.737,
    "text": " The importance of this issue becomes clear when we realize that erroneous cues can accidentally be incorporated into a code when our interactions with the environment is simple and will only become evident when our environmental expectations become more demanding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 859.737,
    "end": 865.662,
    "text": "And even if our code perfectly matched a given environment, we would certainly make errors",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 866.377,
    "end": 868.478,
    "text": " as the environment itself fluctuates.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 869.038,
    "end": 875.199,
    "text": "So I was talking about autonomous local learning in a changing world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 877.16,
    "end": 889.823,
    "text": "A purely logical inquiry into error correction is translated at every step of the thought experiment into processes learning autonomously in real time",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 890.336,
    "end": 892.757,
    "text": " with only locally computed quantities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 893.537,
    "end": 912.302,
    "text": "Moreover, the thought experiment uses familiar environmental facts about how we learn as its hypotheses and odd circuits naturally emerge, where these facts are familiar because they're ubiquitous environmental constraints on the evolution of our brains.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 912.942,
    "end": 917.103,
    "text": "And since we're living with them all the time, they become familiar.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 918.581,
    "end": 932.528,
    "text": " Because of this universality, art circuits may thus in some form be embodied in all future truly autonomous adaptive intelligent devices, whether biological or artificial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 934.209,
    "end": 943.634,
    "text": "Art has probably for this reason already been used in many large scale engineering and technological applications.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 944.934,
    "end": 948.316,
    "text": "In fact, almost immediately after art was introduced,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 949.099,
    "end": 965.882,
    "text": " It began being used because it succeeded in benchmark studies against machine learning, back propagation, statistical methods, genetic algorithms, either getting much better accuracy or much faster training speed or both.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 966.822,
    "end": 978.364,
    "text": "It's also used in applications where other algorithms totally fail, such as the Boeing company's part design reuse and inventory compression",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 979.405,
    "end": 980.326,
    "text": " application.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 981.066,
    "end": 991.151,
    "text": "That's just one of many large-scale applications in engineering and technology, some of which can be found on our tech lab webpage at bu.edu.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 992.032,
    "end": 998.335,
    "text": "The Boeing parts design retrieval system in particular was used to help design the Boeing 777.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1001.587,
    "end": 1010.932,
    "text": " And to do that, you needed fast learning and stable memory to learn and search a huge and continually growing non-stationary parts inventory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1011.553,
    "end": 1020.198,
    "text": "At the time of this application, there are already 16 million, 1 million dimensional vectors that were used to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1021.087,
    "end": 1043.163,
    "text": " describe each of the parts and you have to be able to quickly search the inventory if you wanted to find a part to use in a new plane, especially if your new design might have a part in the inventory that was similar to it, finding it and slightly modifying design could save millions of dollars in fabrication costs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1044.564,
    "end": 1048.387,
    "text": "Satellite remote sensing is another large scale application",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1048.888,
    "end": 1051.108,
    "text": " that art was used for very soon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1051.629,
    "end": 1054.449,
    "text": "And Gail Carpenter and her colleagues took the lead here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1055.089,
    "end": 1075.673,
    "text": "For example, using a very small number of pixels of ground truth of 17 vegetation classes, they used art to automatically complete these maps using remote sensing data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1076.528,
    "end": 1080.329,
    "text": " Art did it in a day, rapidly and automatically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1080.389,
    "end": 1088.931,
    "text": "It gave a confidence map for each pixel, and the pixels were 30 meters in scale, which was small enough to see roads.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1089.591,
    "end": 1099.394,
    "text": "This contrasted with an AI expert system, which took a whole year to do with, and it had to derive ad hoc rules from experts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1099.878,
    "end": 1103.821,
    "text": " You had to correct upwards of a quarter of a million site labels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1104.361,
    "end": 1109.845,
    "text": "And even so, the pixel size was an order of magnitude larger.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1109.865,
    "end": 1116.67,
    "text": "Gail went on with her colleagues to study information fusion in remote sensing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1117.17,
    "end": 1119.452,
    "text": "Let's say you have multiple observers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1120.152,
    "end": 1123.475,
    "text": "Each of them may be using different labels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1123.988,
    "end": 1128.229,
    "text": " Their labels may also be incomplete or missing or even incorrect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1128.869,
    "end": 1141.112,
    "text": "And the task was to derive consistent knowledge from potentially inconsistent data to automatically learn and stably store one to many mappings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1141.893,
    "end": 1150.855,
    "text": "And along the way, Gail and a colleague showed how to self-organize a hierarchy of cognitive rules, including confidence measures",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1151.431,
    "end": 1154.373,
    "text": " between these different levels of the hierarchy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1156.234,
    "end": 1158.154,
    "text": "There's been continual work on odds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1158.215,
    "end": 1176.504,
    "text": "Some more recent work was summarized in a special issue of neural networks just in December 2019 that was edited by Donald Bunch, who started this special issue with a general overview of neural network models that I and my colleagues developed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1176.997,
    "end": 1190.935,
    "text": " and then went on in a long and detailed article with several collaborators to provide a survey of adaptive resonance theory neural network models for engineering applications to the present time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1193.533,
    "end": 1200.419,
    "text": " So backpropagation and deep learning are a feed-forward adaptive filter, but art is more than that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1201.1,
    "end": 1209.868,
    "text": "In fact, art is an explainable, self-organizing production system in a non-stationary world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1210.829,
    "end": 1212.55,
    "text": "What do these words mean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1212.57,
    "end": 1219.957,
    "text": "Art's self-organizing because it can autonomously carry out arbitrary combinations",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1220.62,
    "end": 1227.444,
    "text": " of unsupervised or supervised learning trials with the world as its only teacher.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1228.704,
    "end": 1244.233,
    "text": "It's a production system because it uses hypothesis testing to discover and learn rules by a top-down matching process that focuses attention on critical feature patterns.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1244.293,
    "end": 1247.775,
    "text": "These are the patterns that predict behavioral success",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1248.413,
    "end": 1251.135,
    "text": " while suppressing irrelevant features.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1253.097,
    "end": 1267.249,
    "text": "Or it's explainable using both its activities or short-term memory STM traces and its adaptive weights or long-term memory LTM traces, activation dynamics, learning dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1268.37,
    "end": 1276.757,
    "text": "Observing the STM traces in a critical feature pattern explain what recognition categories will learn to code",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1277.375,
    "end": 1280.716,
    "text": " and what features predict goal-oriented actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1281.576,
    "end": 1306.742,
    "text": "In particular, the long-term memory traces in the fuzzy art map algorithm translate into explicit fuzzy if-then rules that code what combinations of critical features in what numerical ranges effectively control predictions, thereby illustrating one of many examples where neural networks can learn rule-based behaviors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1309.372,
    "end": 1329.344,
    "text": " ART includes a bottom-up adaptive filter of feedforward neural network, as I've observed already, but that's supplemented by top-down learned expectations and two types of recurrent inhibitory feedback interactions that help to choose the recognition categories and the critical features.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1330.325,
    "end": 1338.95,
    "text": "Notably, top-down expectations use what Gail Carpenter and I call the ART matching rule to learn how to focus attention,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1339.6,
    "end": 1343.622,
    "text": " on critical features that control predictive success.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1344.663,
    "end": 1356.45,
    "text": "The art matching rule is another way of talking computationally about the process of object attention, how we pay attention to salient objects in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1358.231,
    "end": 1363.014,
    "text": "And we show how it stabilizes learning and thereby avoids catastrophic forgetting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1364.515,
    "end": 1367.937,
    "text": "Remarkably, and this has been supported by many data,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1370.77,
    "end": 1378.515,
    "text": " the art matching rule can be realized by a top-down modulatory on-center off-surround network.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1378.535,
    "end": 1379.736,
    "text": "Well, what does this mean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1379.756,
    "end": 1388.662,
    "text": "Well, let's say we have bottom-up inputs from external features to feature selective cells that get stored in short-term memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1390.283,
    "end": 1398.168,
    "text": "Let's say we activate a recognition category, which has previously been learned and tries to read out its learned",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1398.709,
    "end": 1400.53,
    "text": " excitatory prototype.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1401.29,
    "end": 1408.853,
    "text": "Well, it can't fully do so because it also reads out an inhibitory off surround that's broader than the prototype.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1409.594,
    "end": 1413.616,
    "text": "So this is approximately one excitatory against one's inhibitory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1414.196,
    "end": 1418.158,
    "text": "It can only give you a modulatory on center.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1419.118,
    "end": 1425.841,
    "text": "But if you have both bottom-up inputs and the top-down expectation simultaneously active,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1427.369,
    "end": 1455.932,
    "text": " then within the bounds of the prototype, if you also have a bottom-up feature, you have two excitatory against one inhibitory, and those features can be selected, gain amplified and synchronized to start focusing attention on this critical feature pattern, while outlier features, the ones that aren't within the prototype, only have one excitation against one inhibition,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1456.582,
    "end": 1457.703,
    "text": " are suppressed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1459.343,
    "end": 1466.427,
    "text": "And in 1999, I was able to begin to understand how laminar cortical circuits carry out object attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1467.107,
    "end": 1477.552,
    "text": "In particular, layer six of a higher cortical area can activate layer six of a lower cortical area, either directly or via layer five.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1478.273,
    "end": 1482.815,
    "text": "And then it can fold up the layer four",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1483.499,
    "end": 1489.863,
    "text": " to modulate an on-center and to inhibit an off-surround.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1490.543,
    "end": 1502.05,
    "text": "So attention acts via a top-down, modulatory on-center, off-surround network via folded feedback within laminar neocortex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1502.911,
    "end": 1512.417,
    "text": "And this is one example of the paradigm of laminar computing that I introduced, which asks why are all neocortical circuits organized in layers?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1513.129,
    "end": 1519.132,
    "text": " And how do laminar circuits give rise to all kinds of biological intelligence?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1521.052,
    "end": 1528.956,
    "text": "Adaptive resonance answers this story because attended feature clusters reactivate their bottom-up pathways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1529.976,
    "end": 1542.101,
    "text": "Activated categories reactivate their top-down pathways, closing an excitatory feedback loop between features and categories, giving rise",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1542.742,
    "end": 1558.527,
    "text": " to a feature category resonance that synchronizes, amplifies, and prolongs system response between the attended critical features and the category to which they are bound.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1559.488,
    "end": 1572.132,
    "text": "And it's this resonance that triggers fast learning in the bottom-up and top-down adaptive weights, which is why I have called the theory adaptive resonance theory",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1573.271,
    "end": 1591.186,
    "text": " Moreover, I've done a lot of work since then showing that all conscious states are resonance states, and these feature category resonances are one example of that, one that supports conscious recognition of visual objects and scenes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1592.807,
    "end": 1595.469,
    "text": "There's a lot of data support for art predictions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1595.549,
    "end": 1602.275,
    "text": "It's well known that attention does have an on-center or surround circuit behind it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1602.728,
    "end": 1609.95,
    "text": " and that attention can facilitate matched bottom-up signals, many other data as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1611.55,
    "end": 1615.811,
    "text": "So now we can say more about why art is explainable or trustworthy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1616.531,
    "end": 1628.874,
    "text": "In short-term memory, it's because the critical feature patterns determine the attentional focus that controls information processing, and you can just read off what those features are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1629.716,
    "end": 1640.264,
    "text": " In long-term memory, again, it's the critical feature patterns that determine the adaptive weights learned by the bottom-up adaptive filter and the top-down learned expectation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1640.785,
    "end": 1643.887,
    "text": "So you know also what these weights are encoding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1645.328,
    "end": 1658.919,
    "text": "Oughts reliable and avoids catastrophic forgetting because outlier features that are not in the critical feature pattern are suppressed so that only the predictive features are processed and coded.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1660.586,
    "end": 1665.248,
    "text": " Or it's a production system because it carries out a kind of hypothesis testing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1665.848,
    "end": 1674.431,
    "text": "And this is nicely illustrated in the simplest art model called Art 1 that Gail Carpenter and I published in 1987.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1674.571,
    "end": 1689.296,
    "text": "Art 1 has an attentional system that does all the category learning and the expectation learning and the paying attention that interacts with an orienting system, which is activated",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1689.824,
    "end": 1699.669,
    "text": " when there are big enough matches in the attentional system and thereby drives a reset and search for novel or better matching categories.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1700.429,
    "end": 1705.791,
    "text": "Here's a schematic of the art hypothesis testing and learning cycle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1706.992,
    "end": 1710.494,
    "text": "So let's say you have a bottom-up feature pattern coming in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1710.994,
    "end": 1717.997,
    "text": "There may be many, many active bottom-up features, but I'll draw just one arrow here for simplicity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1718.68,
    "end": 1725.223,
    "text": " but that vector of input features can activate a distributed pattern of feature detector cells.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1725.643,
    "end": 1730.666,
    "text": "Some may be very active, some not so active, some not active at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1731.426,
    "end": 1739.91,
    "text": "And as this is happening, each of these active pathways is trying to turn on the orienting system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1739.95,
    "end": 1746.373,
    "text": "So there might be quite a few inputs converging here, but as the features are activated, each of them tries",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1746.894,
    "end": 1764.379,
    "text": " to inhibit the orienting system, and there are as many features as there are inputs, so this excitation inhibition of balance, keeping the orienting system quiet as the feature pattern goes through the adaptive filter and chooses a category.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1765.36,
    "end": 1773.342,
    "text": "That category reads out a learned top-down expectation that obeys the art matching rule, which can suppress some mismatched features",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1773.854,
    "end": 1790.346,
    "text": " thereby reducing the amount of inhibition on the orientic system and raising the question, when you have too little inhibition and too much excitation, how big a mismatch will activate the orientic system and cause reset?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1791.046,
    "end": 1799.452,
    "text": "And that ratio is determined by what's called vigilance, which I'll say more about soon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1801.564,
    "end": 1806.145,
    "text": " But if you don't have enough inhibition, then the orienting system gets activated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1807.005,
    "end": 1815.687,
    "text": "It equally activates all the cells in the category layer because it doesn't know which cell may be active or not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1816.167,
    "end": 1823.469,
    "text": "So it causes a novelty sensitive, nonspecific burst of arousal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1823.989,
    "end": 1829.67,
    "text": "Novel events are arousing, thereby selectively shutting off the active category",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1830.347,
    "end": 1839.033,
    "text": " eliminating its top-down expectation and unmasking the original feature pattern, which can again go through the adaptive filter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1839.673,
    "end": 1854.102,
    "text": "However, now this previously disconfirmed category remains off and the category level is renormalized, so it responds to the same input pattern with a new category.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1854.582,
    "end": 1858.905,
    "text": "And you go through this cycle of resonance and reset",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1859.511,
    "end": 1866.855,
    "text": " until you get a good enough match to either learn a new category or select a previously learned category.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1868.255,
    "end": 1884.443,
    "text": "And it's a theorem that as categories are learned through this matching process, search automatically disengages leading to direct access without search to the globally best matching category.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1885.904,
    "end": 1887.385,
    "text": "Explaining, for example, how",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1887.83,
    "end": 1897.634,
    "text": " we can quickly recognize familiar objects like your mother's face, even if as we get older, we store enormous numbers of additional memories.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1898.275,
    "end": 1900.696,
    "text": "So you don't have to search your whole repertoire.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1901.096,
    "end": 1905.378,
    "text": "When you see mom, you get direct access and quickly say, hi, mom.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1906.658,
    "end": 1910.18,
    "text": "There's a lot of support for the hypothesis testing cycle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1911.06,
    "end": 1917.143,
    "text": "One source of support is from the ventrolate potentials, also called human scalp potentials,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1917.699,
    "end": 1943.776,
    "text": " which shows correlated sequences of three different evoked potentials during oddball learning tasks, an experiment that John Paul Banquet and I reported in the 80s, where you'll get a P120 for a mismatch, an N200 for the arousal activated by the ordinating system, and a P300 for the short-term memory reset of the category layer,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1944.363,
    "end": 1949.866,
    "text": " thereby supporting the processing stages of the search cycle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1951.207,
    "end": 1970.318,
    "text": "There was also physiological data from intratemporal cortex where categories are learned early on from the lab of Bob Desimone who showed an active matching process that's reset between trials during this kind of event.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1972.196,
    "end": 1976.037,
    "text": " There's also classical data about hippocampal mismatch dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1976.577,
    "end": 1982.459,
    "text": "It's known that novelty potential subside as learning proceeds from numerous experiments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1982.539,
    "end": 1985.781,
    "text": "This is as the orienting system is disengaged.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1986.601,
    "end": 1998.785,
    "text": "And there's more recent data using multiple electrode studies from the lab of Earl Miller from prefrontal cortex and simultaneous recordings in hippocampus",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1999.454,
    "end": 2019.948,
    "text": " And they show there's rapid object-associative learning may occur in prefrontal cortex, which is a projection of infratemporal cortex, one of the stages of category learning, while the hippocampus may guide neocortical plasticity by signaling success or failure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2020.469,
    "end": 2026.393,
    "text": "Well, this is just what happens when the attentional system interacts with the orienting system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2028.527,
    "end": 2031.389,
    "text": " There's also complementary computing in art.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2031.95,
    "end": 2045.42,
    "text": "In particular, the attentional and orienting system was a complementary as manifested by the fact that two event-related potentials are complementary, processing negativity and M200.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2046.001,
    "end": 2053.066,
    "text": "Processing negativity is activated when there's a top-down match in the attentional system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2053.827,
    "end": 2054.227,
    "text": "The M200 is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2055.518,
    "end": 2061.583,
    "text": " As I just noted, it's activated when there's a mismatch that activates the orienting system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2062.123,
    "end": 2079.957,
    "text": "And you can just look across these four rows and see that these two kinds of ERP potentials are manifestly complementary as illustrated the complementarity of the attentional and orienting systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2081.078,
    "end": 2084.521,
    "text": "So this leads us to discuss another paradigm introduced,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2085.103,
    "end": 2092.226,
    "text": " which I call complementary computing, that asks, what is the nature of brain specializations?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2093.947,
    "end": 2108.513,
    "text": "Complementary computing introduces new principles of uncertainty and complementarity that clarify why there are multiple parallel processing streams with multiple processing stages in our brains.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2109.133,
    "end": 2112.555,
    "text": "And a beautiful example of that is this famous image",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2113.268,
    "end": 2131.576,
    "text": " of the macro circuit of the visual system from David Van Essen and his colleagues, where you can see these multiple parallel processing streams and the multiple stages needed to achieve what I call hierarchical resolution of uncertainty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2132.777,
    "end": 2136.118,
    "text": "But what are complementary properties?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2136.158,
    "end": 2141.541,
    "text": "They're analogies, like a key fits into a lock, or puzzle pieces",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2142.096,
    "end": 2143.276,
    "text": " fitting together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2144.276,
    "end": 2153.158,
    "text": "In words, computing one set of properties at a processing stage prevents that stage from computing a complementary set of properties.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2153.818,
    "end": 2158.159,
    "text": "These complementary parallel processing streams are balanced against one another.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2158.179,
    "end": 2168.221,
    "text": "It's a very yin-yang kind of situation, and interactions between the streams overcome their complementary weaknesses.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2170.034,
    "end": 2174.818,
    "text": " In fact, there are many complementary processes that are known in the brain that have been modeled.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2175.398,
    "end": 2177.9,
    "text": "Here is just five of them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2177.96,
    "end": 2179.041,
    "text": "There are many more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2179.702,
    "end": 2184.065,
    "text": "So this is a basic principle of brain organization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2186.307,
    "end": 2197.175,
    "text": "So in summary so far, back propagation and deep learning do not have thought-to-memory activation patterns, including critical feature patterns, so they can't pay attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2197.676,
    "end": 2199.197,
    "text": "Indeed, they don't have any",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2199.758,
    "end": 2213.885,
    "text": " fast information processing, nor do they have long-term memory top-down learned expectations, so they can't carry out hypothesis testing using interactions, short-term and long-term memory traces.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2214.605,
    "end": 2226.711,
    "text": "Indeed, there's no neural architecture, there's just an algorithm in really great contrast with complementary computing, which discusses the global organization of our brains.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2227.892,
    "end": 2232.335,
    "text": " From the very start, it was shown how easy it is to get catastrophic forgetting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2232.395,
    "end": 2239.559,
    "text": "And Carpenter and I showed it in art when we would shut down the art matching rule.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2240.039,
    "end": 2253.788,
    "text": "Then we demonstrated you could get catastrophic forgetting if you had just four input vectors, A, B, C, D, presented in the order A, B, C, A, D, A, B, C, A, D, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2254.534,
    "end": 2259.18,
    "text": " if they obeyed very simple subset relationships.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2259.921,
    "end": 2262.284,
    "text": "And here's a computer simulation of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2262.884,
    "end": 2265.087,
    "text": "Here you don't have the arc matching rule.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2265.107,
    "end": 2267.851,
    "text": "Here's A, B, C, A, D.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2268.798,
    "end": 2280.844,
    "text": " A, B, C, A, D. And you see A is coded by category one here, by category two here, by category one here, two here, it never settles down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2281.404,
    "end": 2288.887,
    "text": "But as soon as you impose the art matching rule, learning is complete by the second trial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2289.327,
    "end": 2294.91,
    "text": "And after that point, you get direct access to the globally best matching category.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2296.308,
    "end": 2298.65,
    "text": " Well, let's say a little more about vigilance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2299.971,
    "end": 2304.135,
    "text": "Vigilance determines what features are learned in the critical feature pattern.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2304.695,
    "end": 2311.481,
    "text": "It clarifies how our brains learn concrete knowledge for some tasks and abstract knowledge for others.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2312.222,
    "end": 2322.351,
    "text": "In particular, high vigilance leads to learning of narrow, concrete categories, like a category that fires selectively to a frontal view of your mother's face,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2324.013,
    "end": 2329.875,
    "text": " Low vigilance leads to learning of broad and abstract categories like everyone has a face.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2330.675,
    "end": 2337.738,
    "text": "It should be emphasized that critical feature patterns are explainable at every level of vigilance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2338.678,
    "end": 2347.141,
    "text": "It's known from physiological experiments by Desimone again that their vigilance",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2348.331,
    "end": 2356.756,
    "text": " control in the infratemporal cortex, which they showed by studying easy versus difficult discriminations in monkeys.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2357.456,
    "end": 2369.383,
    "text": "And in the difficult condition, which you'd assume would give you high vigilance, as expected, you had enhancement of the responses and sharpened selectivity to the intended stimuli.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2370.964,
    "end": 2373.105,
    "text": "How is vigilance computed?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2373.506,
    "end": 2377.048,
    "text": "Well, let's say of input vector, it instates",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2378.248,
    "end": 2385.35,
    "text": " a vector of activities and feature detectors at the same time as it tries to activate the orienting system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2385.81,
    "end": 2394.473,
    "text": "But it does so multiplied by a parameter rho, which is a sensitivity or gain parameter, that's vigilance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2395.393,
    "end": 2400.855,
    "text": "And as these features get in state, they try to shut off the orienting system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2401.715,
    "end": 2404.436,
    "text": "And if the excitation is less,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2405.472,
    "end": 2411.294,
    "text": " Then the inhibition, the orienting system stays quiet so the system can resonate and learn.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2412.714,
    "end": 2417.035,
    "text": "But if inhibition isn't strong enough, the orienting system gets activated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2417.535,
    "end": 2419.816,
    "text": "You get reset and search for new categories.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2420.296,
    "end": 2429.919,
    "text": "This is a very simple computation because you have an orienting system that's complementary to the attentional system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2430.879,
    "end": 2434.2,
    "text": "Well, how do you change vigilance based on predictive success?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2434.977,
    "end": 2439.32,
    "text": " For this, we have to go from unsupervised to supervised art models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2440.1,
    "end": 2452.369,
    "text": "So we'll have an unsupervised art A model, an unsupervised art B model, linked together by a learned associative map, as occurs in fuzzy art map.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2452.769,
    "end": 2464.237,
    "text": "And the key point is you can have an input here that can create an output there because you have both bottom-up and top-down connections at all these levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2465.515,
    "end": 2471.299,
    "text": " So in this way you can learn many-to-one and one-to-many maps.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2472.38,
    "end": 2482.528,
    "text": "One example of a many-to-one map is let's say you're trying to categorize visually processed a letter A, which comes in multiple fonts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2483.168,
    "end": 2489.153,
    "text": "You'll learn various visual categories of A based on visual similarity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2490.494,
    "end": 2494.857,
    "text": "At the same time, you're learning auditory categories for saying A",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2495.492,
    "end": 2515.182,
    "text": " And then the associated map can map all of these visual categories of different A's to saying A. But it could have been here that these inputs were symptoms, tests, and treatments in a medical database prediction example, and you're predicting length of stay in the hospital.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2515.802,
    "end": 2519.624,
    "text": "The possibilities here are endless, and they've been in many applications.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2521.425,
    "end": 2522.165,
    "text": "Or let's say...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2526.772,
    "end": 2532.076,
    "text": " you're trying to figure out what this image is, and you've learned to say that's a dog.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2532.477,
    "end": 2546.227,
    "text": "But today you say it's Rover, and that causes a mismatch which drives the search to focus attention on the particular combination of features in this dog that will identify it as Rover.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2546.688,
    "end": 2555.955,
    "text": "That leads to learning of a visual category of Rover, an auditory category for the name Rover, an associative map between them,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2556.502,
    "end": 2562.306,
    "text": " and you can now simultaneously store expert knowledge about that image.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2563.686,
    "end": 2574.373,
    "text": "Well, how do you conjointly minimize predictive error and maximize generalization so that you minimize using memory resources?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2574.433,
    "end": 2578.416,
    "text": "Let me read you an answer and then show what it means in images.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2579.956,
    "end": 2583.899,
    "text": "Match tracking realizes a minimax learning principle",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2584.52,
    "end": 2595.326,
    "text": " namely given a predictive error, vigilance increases just enough to trigger search and thus sacrifices the minimum generalization to correct the error.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2595.846,
    "end": 2604.45,
    "text": "So let's say you've made a prediction that must mean that vigilance is less than the analog match between bottom up and top down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2605.131,
    "end": 2608.593,
    "text": "But let's say now you have a mismatch.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2608.653,
    "end": 2611.114,
    "text": "Well, that'll lead to a match tracking signal",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2611.667,
    "end": 2618.53,
    "text": " that bumps vigilance up till it's just above the analog match, just big enough to drive a search.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2619.07,
    "end": 2624.333,
    "text": "So you've given up the minimum amount of generalization to correct the error.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2625.733,
    "end": 2632.056,
    "text": "Well, are art mechanisms like vigilance control realized in lamina cortical and thalamic circus?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2632.096,
    "end": 2633.457,
    "text": "The answer is yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2634.417,
    "end": 2641.08,
    "text": "My PhD student Max Versace and I showed this by developing the synchronous matching art or SMART model",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2642.469,
    "end": 2658.681,
    "text": " which introduced a lot more neurophysiological and anatomical verisimilitude into the model, including spiking dynamics, lamina cortical circuits interacting with specific and non-specific thalamic nuclei.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2659.302,
    "end": 2662.464,
    "text": "This is another example of lamina computing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2663.125,
    "end": 2665.246,
    "text": "And here's a schematic of the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2665.707,
    "end": 2672.352,
    "text": "You see all the cortical layers with identified cells, a hierarchy of cortical regions,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2672.91,
    "end": 2679.296,
    "text": " interacting with specific thalamic nuclei and non-specific thalamic nuclei.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2680.156,
    "end": 2686.542,
    "text": "A ton of anatomical data got functionally explained in this way, and many other data as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2686.582,
    "end": 2696.31,
    "text": "For example, we showed if you have a good enough match between bottom-up and top-down, you're going to get fast gamma oscillations during a tension.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2696.69,
    "end": 2699.513,
    "text": "There was quite a bit of data about that already,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2699.946,
    "end": 2705.329,
    "text": " But we also showed if you have a big enough mismatch, you'll get slower beta oscillations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2705.75,
    "end": 2707.31,
    "text": "That wasn't well known.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2708.551,
    "end": 2717.156,
    "text": "But since that time, there have been experiments in at least four labs in three different parts of the brain confirming that prediction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2718.317,
    "end": 2728.063,
    "text": "Most important vigilance control was shown how to be controlled by mismatch-mediated acetylcholine release, a big enough mismatch,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2728.652,
    "end": 2746.157,
    "text": " in the nonspecific thalamic nucleus, activates nucleus space cell as a minor that releases acetylcholine and layer five cells across the cortex, reducing after hyperpolarization currents and causing vigilance to go up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2746.937,
    "end": 2756.62,
    "text": "And I also showed that breakdowns in acetylcholine modulation can help to explain the symptoms of multiple mental disorders.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2758.311,
    "end": 2770.581,
    "text": " So as to memory consolidation, we know there's a dynamic phase of memory consolidation while the input exemplar still drives memory search and before direct access occurs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2771.101,
    "end": 2773.563,
    "text": "But what if the orienting system's cut out?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2774.084,
    "end": 2776.486,
    "text": "What if you have a lesion in the hippocampus?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2777.547,
    "end": 2786.654,
    "text": "Well then, as occurs in medial temporal amnesia, you get unlimited anterograde amnesia because you can't search for new categories.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2787.318,
    "end": 2794.841,
    "text": " You get limited retrograde amnesia because you can have direct access to previously learned categories.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2795.421,
    "end": 2800.443,
    "text": "This is a failure of consolidation, which is mediated by the orienting system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2801.023,
    "end": 2807.106,
    "text": "You get defective novelty reactions because that is also mediated by the orienting system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2807.846,
    "end": 2814.569,
    "text": "And memory consolidation novelty detection are mediated by the same structures for the same reason.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2815.538,
    "end": 2820.72,
    "text": " There's normal priming because priming occurs within the attentional system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2821.52,
    "end": 2823.661,
    "text": "Learning of the first item dominates.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2823.701,
    "end": 2826.862,
    "text": "You can get some learning, but you can't then search.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2828.082,
    "end": 2835.585,
    "text": "And there's an impaired ability to attend to relevant dimensions of stimuli, again, because you can't search.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2836.665,
    "end": 2841.487,
    "text": "So now, where does intratemporal cortex fit in within the larger brain?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2842.588,
    "end": 2843.748,
    "text": "I introduced...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2844.395,
    "end": 2858.12,
    "text": " the predictive art or part algorithm model in order to show how the prefrontal cortex, among other things, learns to control all higher order intelligence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2858.16,
    "end": 2862.401,
    "text": "You can find that in a 2018 paper on my webpage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2862.461,
    "end": 2864.982,
    "text": "I also published it, open access.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2866.502,
    "end": 2868.583,
    "text": "And in this macro circuit,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2869.878,
    "end": 2880.683,
    "text": " These green areas of prefrontal cortex control processes like working memory, learned plans, prediction, optimized action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2881.723,
    "end": 2890.607,
    "text": "These regions in red control processes like reinforcement learning, emotion, motivation, adaptively timed learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2891.307,
    "end": 2896.289,
    "text": "The category of learning I've talked about in IT is just in those two regions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2896.869,
    "end": 2898.25,
    "text": "All these processes",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2900.514,
    "end": 2902.194,
    "text": " control visual perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2902.675,
    "end": 2907.856,
    "text": "And there are detailed models of all of these regions and their interactions now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2908.596,
    "end": 2922.519,
    "text": "And each brain region in nature and in predictive art carries out a different function, contrasting really dramatically with the homogeneous organization of a typical deep learning network.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2924.244,
    "end": 2930.067,
    "text": " So I've told you just a little bit about some aspects of cognition and why they're explainable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2930.807,
    "end": 2938.45,
    "text": "But if you put in all the biological models of perceptual cognition, emotion, and action, they're all explainable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2939.071,
    "end": 2951.536,
    "text": "And then you can assert how perceptual and cognitive processes use art-like excitatory matching and match-based learning to create self-stabilizing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2952.003,
    "end": 2960.585,
    "text": " attentive and conscious representations of objects and events that embody increasing expertise about the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2961.505,
    "end": 2978.548,
    "text": "Moreover, complementary spatial and motor processes that I couldn't mention at all use inhibitory matching and mismatch-based learning to continually update spatial and motor representations to compensate for bodily changes throughout life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2979.309,
    "end": 2981.089,
    "text": "Taken together, they provide",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2981.641,
    "end": 3001.75,
    "text": " a self-stabilizing perceptual and cognitive front end for conscious awareness and knowledge acquisition, which can intelligently manipulate the more labile spatial and motor processes that enable our changing bodies to act effectively on a changing world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3002.631,
    "end": 3009.454,
    "text": "And when you put them all together, they provide a blueprint for designing autonomous adaptive algorithms and mobile technologies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3009.955,
    "end": 3018.481,
    "text": " robots with behaviors humans can understand and control because they're both explainable and reliable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3019.262,
    "end": 3028.048,
    "text": "See my webpage, sites.vu.edu, Steve G., for these models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3028.769,
    "end": 3034.793,
    "text": "And with that, I'd like to thank you very much for your attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3036.574,
    "end": 3038.756,
    "text": "Before we get started, what I want to say, so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3039.477,
    "end": 3049.206,
    "text": " I should say that everything I've talked about and much more is in my book, Conscious Mind, Resonant Brain, How Each Brain Makes a Mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3049.226,
    "end": 3054.832,
    "text": "For those who don't know, it's self-contained and non-technical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3055.592,
    "end": 3064.641,
    "text": "It's written in a conversational style so that people who know nothing about the mind or the brain can enjoy reading it and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3065.709,
    "end": 3077.653,
    "text": " I have friends who are a rabbi, a minister, a painter, a gallery owner, a lawyer, a social worker, who've all been enjoying reading it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3078.553,
    "end": 3080.174,
    "text": "Also, it's a big book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3080.334,
    "end": 3089.597,
    "text": "It's almost 800 double column pages with over 600 color figures, so everything is illustrated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3090.217,
    "end": 3092.157,
    "text": "But instead of costing $150, it costs",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3095.055,
    "end": 3108.603,
    "text": " $35 for the hard copy and only $17 for the Kindle because I spent a lot of my own money so that people who are interested in the topic can read it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3108.683,
    "end": 3114.467,
    "text": "And one other comment, if people do have questions or comments,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3116.058,
    "end": 3130.309,
    "text": " about my lecture or anything they read in the book, my email is just steve, S-T-E-V-E, at buaustinuniversity.edu, and I'll be happy",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3131.089,
    "end": 3132.611,
    "text": " to try to apply.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3133.732,
    "end": 3134.072,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3135.153,
    "end": 3147.906,
    "text": "Now, some researchers in explainable AI, people like Leonardo, Giovanna, and Antonio Di Cecco, demand that any explainable AI should at the very least meet these four criteria.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3148.246,
    "end": 3153.712,
    "text": "To be fair, not biased in one way or another, to be accountable or reliable,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3154.512,
    "end": 3160.921,
    "text": " to be secure against malicious hacker attacks and not to be fooled easily, and also to be transparent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3161.402,
    "end": 3170.614,
    "text": "Now, you explained how adaptive resonance theory or ART, and by the way, I gotta say, I love your creative and clever use of acronyms for your models,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3171.895,
    "end": 3181.325,
    "text": " My favorite one is sovereign model, self-organizing, vision, expectation, recognition, emotion, intelligent, goal-oriented, navigation, if I'm correct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3181.745,
    "end": 3182.126,
    "text": "Amazing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3183.107,
    "end": 3192.757,
    "text": "Anyway, you explained how art can address and overcome the issues of accountability, security, and transparency of current deep learning approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3193.973,
    "end": 3208.581,
    "text": " But it seems that this fairness issue, aka the problem of algorithmic bias, has also been a growing concern lately, especially since it's regarded by some researchers like Antonio Baria as a practically intractable problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3209.121,
    "end": 3217.425,
    "text": "So I wanted to ask, in what ways do you think art can contribute to the ongoing quest for mitigating this problem?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3219.626,
    "end": 3220.167,
    "text": "Well, when...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3221.932,
    "end": 3224.213,
    "text": " Holly sent me this question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3224.273,
    "end": 3235.72,
    "text": "I said, well, first, I'd like you to send me a definition of algorithmic bias that will clarify what you have in mind so that I know what I'm trying to respond to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3236.62,
    "end": 3246.725,
    "text": "And you wrote me that you borrowed the term from Badia's book, The Information Manifold, and you sent me a quote from page 247 that I will quote in part before",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3252.012,
    "end": 3254.854,
    "text": " I respond to that background information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3255.614,
    "end": 3265.781,
    "text": "So there are two main reasons for algorithmic approach to decision-making that may result in unfair outcomes, either at the individual or group level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3266.561,
    "end": 3276.628,
    "text": "One is that data used is biased, and another is that the algorithm analyzes the data in such a way that it yields biased results.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3277.488,
    "end": 3281.291,
    "text": "The basic point to remember is that algorithms are designed to achieve a certain",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3282.008,
    "end": 3285.531,
    "text": " goal not created naturally by evolution or accident.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3286.211,
    "end": 3295.097,
    "text": "Thus, most algorithms are written to detect certain patterns of interest for a particular objective, not just any pattern.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3296.559,
    "end": 3310.949,
    "text": "To be able to pick out some patterns and disregard others, programmers build a model of the data by listing expectations about what data should be like in order to qualify as relevant to the problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3312.093,
    "end": 3324.122,
    "text": " Well, as I'll explain below, self-organizing learning classification prediction models like adaptive resonance theory or ART overcome all the problems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3324.822,
    "end": 3326.724,
    "text": "It's a general purpose device.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3327.184,
    "end": 3335.15,
    "text": "But why don't I try to answer that as part of my replies to Ali's subsequent questions?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3338.772,
    "end": 3340.174,
    "text": " Okay, thank you so much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3340.835,
    "end": 3355.113,
    "text": "Now, as you also mentioned in your lecture in 1988, you pointed out 17 issues with backpropagation in one of your most famous and highly cited papers on nonlinear neural network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3356.188,
    "end": 3359.869,
    "text": " So it's been 34 years now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3360.269,
    "end": 3372.251,
    "text": "Now, do you see any fundamental Copernican change of perspective happening in deep learning research, or we still keep adding epicycle upon epicycle to our Ptolemaic model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3373.391,
    "end": 3377.392,
    "text": "Well, you've sort of anticipated what I'm going to say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3377.432,
    "end": 3383.833,
    "text": "And as I said in my lecture, various investigators, and I mentioned Klund,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3385.27,
    "end": 3393.133,
    "text": " Patrick and Velez have recently attempted to modify deep learning to overcome some of these problems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3393.213,
    "end": 3409.918,
    "text": "But as Ali just mentioned, my lecture noted that, at least in my mind, they're like epicycles that are added to a kind of Ptolemaic model of the solar system to overcome some of its problems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3410.538,
    "end": 3411.739,
    "text": "But as we all know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3412.489,
    "end": 3419.752,
    "text": " the Ptolemaic model ultimately crashed because it was both qualitatively and quantitatively wrong.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3420.772,
    "end": 3433.476,
    "text": "And they could only be solved by throwing out the Ptolemaic model and replacing it with the Copernican model that became the basis for modern astronomy and astrophysics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3434.477,
    "end": 3438.498,
    "text": "So art overcomes foundational deep learning problems",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3439.329,
    "end": 3441.891,
    "text": " that can't be solved using epicycles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3442.051,
    "end": 3446.835,
    "text": "And I've already done it shortly after I introduced it in 1976.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3446.975,
    "end": 3451.498,
    "text": "And it can't be overemphasized.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3452.359,
    "end": 3458.763,
    "text": "As I noted in my lecture, deep learning is untrustworthy because it's not explainable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3459.444,
    "end": 3465.008,
    "text": "And it's unreliable because it can experience catastrophic forgetting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3465.788,
    "end": 3467.93,
    "text": " And that happens for a basic reason.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3467.99,
    "end": 3476.017,
    "text": "Deep learning, just like backprop, which is its learning engine, is just a feed-forward adaptive filter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3477.618,
    "end": 3489.828,
    "text": "So as you note in your question, I describe these two problems in addition to 15 others in my oft-cited article that I published in 1988 in the first issue of Neural Networks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3490.8,
    "end": 3495.643,
    "text": " And I also showed then that art had already solved the problems in 1976.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3495.763,
    "end": 3517.175,
    "text": "And what I find sad is that back propagation and deep learning architects like Jeff Hinton, who knows all of this background, never mentioned this history and keep talking about making deep learning explain the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3518.609,
    "end": 3526.753,
    "text": " but it can't explain the brain because its foundation is contradicted by basic psychological and neural data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3526.773,
    "end": 3530.315,
    "text": "Yes, great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3530.855,
    "end": 3533.736,
    "text": "Someone should be in the deep learning community.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3535.017,
    "end": 3543.521,
    "text": "I like comparative discussion and criticism, but I don't like solipsism in science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3545.642,
    "end": 3546.443,
    "text": "Great, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3547.506,
    "end": 3560.628,
    "text": " Now, on slide number 50 of your presentation, you pointed out that art is inconsistent with models where top-down match is suppressive, such as Bayesian explaining away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3561.831,
    "end": 3577.384,
    "text": " A similar view is evident on page 195 of Conscious Mind, Resonant Brain, to which he also adds, one of many serious problems of the Bayesian models is that fully suppressive matching circuits cannot solve the stability-plasticity dilemma.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3578.145,
    "end": 3581.227,
    "text": "Now, would you care to further elaborate on this point?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3582.488,
    "end": 3582.949,
    "text": "Sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3584.45,
    "end": 3589.294,
    "text": "My lecture and my book summarizes my book",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3589.969,
    "end": 3591.81,
    "text": " My lecture couldn't go into a lot of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3591.83,
    "end": 3598.876,
    "text": "Some of the copious psychological, anatomical, and neurophysiological evidence",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3601.272,
    "end": 3613.002,
    "text": " expectations, which obey what Gail Carpenter and I call the art matching rule, are matched against bottom-up input patterns.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3613.782,
    "end": 3622.85,
    "text": "And as the lecture briefly noted, the art matching rule is defined by a modulatory on-center off-surround network.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3623.89,
    "end": 3627.533,
    "text": "And the modulatory on-center is excitatory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3628.294,
    "end": 3630.656,
    "text": "However, acting by itself",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3631.3,
    "end": 3634.341,
    "text": " It can't fully excite its target cells.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3635.201,
    "end": 3647.324,
    "text": "It can prime them, sensitize, excuse me, or modulate them to be ready to fire vigorously when matched bottom-up inputs arrive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3648.124,
    "end": 3659.627,
    "text": "And when there is a good enough match between the bottom-up inputs and an active top-down expectation that's reading out a circuit that obeys the ARC matching rule,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3660.404,
    "end": 3676.553,
    "text": " That's when you get what I noted in my lecture, what I call a feature category resonance, because it develops between the matched or attended features and the recognition category that they activate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3677.294,
    "end": 3686.379,
    "text": "And it's this resonance that synchronizes and gain amplifies the matched features while suppressing the mismatched features.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3687.84,
    "end": 3689.161,
    "text": "And that sustained",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3690.166,
    "end": 3705.193,
    "text": " Resonance is important because it's sustained long enough to drive learning in the more slowly varying adaptive weights of the active bottom-up filter and learning top-down expectation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3705.933,
    "end": 3713.677,
    "text": "And it's because resonance triggers learning that I call the theory adaptive resonance theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3715.118,
    "end": 3719.88,
    "text": "And the arc matching rule avoids catastrophic forgetting, as I briefly mentioned",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3720.603,
    "end": 3743.459,
    "text": " in the lecture because it suppresses irrelevant features using its off surround while it's amplifying and focusing attention on the critical features that regulate both bottom-up and top-down learning as well as successful predictions because they're relevant.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3743.719,
    "end": 3748.162,
    "text": "They've been selected by previous learning experiences",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3749.461,
    "end": 3756.988,
    "text": " which discover the set of features that are predictive or causal in a given situation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3758.669,
    "end": 3775.443,
    "text": "And along the way, not only does the art matching rule achieve causality in predictions, although as the world changes, you have to update your causal explanations, it also solves the stability of plasticity dilemma.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3777.532,
    "end": 3780.594,
    "text": " In brief, purely suppressive matching can't do any of this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3781.555,
    "end": 3787.479,
    "text": "It shuts off the expected data, and so it can't focus attention or learn about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3788.82,
    "end": 3797.126,
    "text": "And there is fully suppressive matching in spatial and modal learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3798.032,
    "end": 3803.534,
    "text": " But that isn't learning to be expert about the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3804.595,
    "end": 3809.076,
    "text": "I could explain that more if you want to know, but that's also in my book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3810.057,
    "end": 3821.321,
    "text": "And these two kinds of learning, the excitatory match-based learning and the inhibitory-mispatched learning, are computation complementary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3821.441,
    "end": 3825.423,
    "text": "It's another example of complementary computing and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3826.84,
    "end": 3853.759,
    "text": " The match-based learning goes on in the ventral or Watt cortical stream, and the mismatch learning goes on in the wear or dorsal cortical stream, the Watt stream for perception and categorization and prediction, the wear stream for spatial representation and action, and then you need what to wear and where to what interactions so that you can",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3854.542,
    "end": 3863.549,
    "text": " reach for and otherwise engage through approach and what have you, look at, reach for, approach the things that we recognize.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3866.351,
    "end": 3866.712,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3867.132,
    "end": 3875.599,
    "text": "Now, following from the previous question and considering that the free energy principle and active inference framework as works in progress,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3876.229,
    "end": 3885.417,
    "text": " are related to predictive coding and Bayesian brain hypothesis, what is your view on the extent of compatibility between art and active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3886.177,
    "end": 3895.005,
    "text": "Because despite some prima facie similarities between the two, do you see them as fundamentally incompatible or irreconcilable?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3896.065,
    "end": 3905.113,
    "text": "And how could this issue be rigorously evaluated and positively resolved in terms of reconciliation or integration of art",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3906.206,
    "end": 3908.348,
    "text": " and active inference or otherwise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3908.728,
    "end": 3926.407,
    "text": "Because you see, to add some more context here, Smith et al in their recent paper, An Active Inference Approach to Modeling Structure Learning, have stated that although they have not explicitly incorporated art's top-down attentional and feedback mechanisms,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3927.067,
    "end": 3936.035,
    "text": " There are mechanisms within their active inference-based model which they believe are quite similar to top-down and bottom-up feedback exchange in art.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3936.095,
    "end": 3942.94,
    "text": "So there seems to be some degree of disagreement about the compatibility between the two frameworks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3944.301,
    "end": 3951.007,
    "text": "Well, let me try to respond to the two parts of your question separately.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3951.647,
    "end": 3955.09,
    "text": "So I'm not going to try to talk about Smith at all for a moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3957.328,
    "end": 3969.033,
    "text": " Let's talk about free energy, and I like getting definitions on the table because it's really so frustrating to try to remember what something is when someone's talking about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3969.733,
    "end": 3971.454,
    "text": "So I go to Wikipedia.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3972.194,
    "end": 3983.879,
    "text": "Wikipedia writes in part that the free energy principle asserts, quote, that systems minimize the free energy function of their internal state",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3985.014,
    "end": 3988.255,
    "text": " which entail beliefs about hidden states in their environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3989.036,
    "end": 4006.062,
    "text": "The implicit minimization of free energy is formally related to variational Bayesian methods and was originally introduced by Carl Friston as an explanation for embodied perception neuroscience, where it's also known as active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4006.122,
    "end": 4010.744,
    "text": "And we all know Carl is a brilliant and very insightful man.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4012.202,
    "end": 4028.049,
    "text": " The free energy principle describes the behavior of a given system by modeling it through a Markov blanket that tries to minimize the difference between their model of the world and their sense and associative perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4028.729,
    "end": 4038.273,
    "text": "This difference can be described as surprised and is minimized by continuous correction of the world model of the system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4040.452,
    "end": 4052.859,
    "text": " One more part of the quote, the free energy principle has been criticized for being very difficult to understand, even for experts, and the mathematical consistency of the theory may have been questioned by recent studies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4053.58,
    "end": 4068.748,
    "text": "Discussions of the principle have also been criticized for invoking metaphysical assumptions far removed from a testable scientific prediction, making the principle unfalsifiable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4070.552,
    "end": 4080.058,
    "text": " And in a 2018 interview, Frisson acknowledged that the free energy principle is not properly falsifiable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4081.499,
    "end": 4083.44,
    "text": "So that's Frisson himself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4084.801,
    "end": 4098.489,
    "text": "So my main concern with the free energy principle, just like any theory about how a brain makes a mind is, how much data can it explain in a principle and unifying way?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4099.815,
    "end": 4101.755,
    "text": " That's what we do in science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4101.895,
    "end": 4105.096,
    "text": "We develop theories to explain and predict data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4105.796,
    "end": 4112.597,
    "text": "And in the case of the free energy principle, from what I can see, the answer is essentially no data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4113.158,
    "end": 4114.938,
    "text": "And you can correct me if I'm wrong.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4116.418,
    "end": 4120.899,
    "text": "It therefore cannot be evaluated as a physical theory at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4122.339,
    "end": 4125.28,
    "text": "And there's a basic reason for this problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4126.903,
    "end": 4138.366,
    "text": " Our brains are designed to autonomously learn in real time in response to a changing or non-stationary world that's filled with unexpected events.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4138.466,
    "end": 4142.167,
    "text": "Like today, we're experiencing an unexpected event.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4142.267,
    "end": 4146.708,
    "text": "I didn't know until recently that I'd be enjoying your company today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4148.069,
    "end": 4156.211,
    "text": "Optimization principles were designed to cope with stationary dynamics whose rules and probabilities do not change.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4159.178,
    "end": 4173.906,
    "text": " So it's not possible to, quote, minimize the difference between their model of the world and their sense and associated perception, unquote, because there is no predefined model of the world, which is always changing in unexpected ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4174.526,
    "end": 4178.008,
    "text": "So you need a theory about how the world changes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4180.589,
    "end": 4193.317,
    "text": " Surprise occurs in art when there's a big enough mismatch between an input pattern and the currently active top-down expectation of a category that it's activating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4194.137,
    "end": 4204.944,
    "text": "This mismatch activates the art-orienting system that I briefly discussed in my talk, which interacts with the attentional system where the category learning doesn't occur.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4205.784,
    "end": 4210.147,
    "text": "And as I illustrated in our discussions of search and vigilance,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4210.851,
    "end": 4217.952,
    "text": " that it drives hypothesis testing or memory search to discover a better match or to begin to learn a new category.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4219.493,
    "end": 4234.296,
    "text": "So auto discuss a better match in the case where the system was attending some other familiar features when the new input occurs, but the features of the new input have previously been categorized.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4234.316,
    "end": 4235.476,
    "text": "That's why they're familiar.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4236.176,
    "end": 4239.237,
    "text": "And then the orienting system very quickly shifts attention",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4239.906,
    "end": 4245.751,
    "text": " to the matching category, and you resonate on, and you recognize it consciously often.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4246.972,
    "end": 4254.338,
    "text": "Art begins to learn a new category when the input represents a truly unfamiliar and novel situation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4255.339,
    "end": 4260.563,
    "text": "Now, as to Bayesian methods in science, hey, I'm a mathematician.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4261.364,
    "end": 4263.286,
    "text": "How can I not love Bayes, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4264.407,
    "end": 4266.969,
    "text": "But the beauty of Bayes is its simplicity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4267.884,
    "end": 4273.73,
    "text": " You just write the probability of two events, A and B, in two different ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4274.51,
    "end": 4287.403,
    "text": "The probability of B given A times the probability of A, the probability of A given B times the probability of B. Set them equal because they're identical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4287.983,
    "end": 4291.486,
    "text": "Divide by, let's say, probability of A and then optimize.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4292.127,
    "end": 4292.888,
    "text": "That's Bayes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4294.847,
    "end": 4299.87,
    "text": " And it's a useful statistical method and should continue to be used in statistics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4300.55,
    "end": 4304.113,
    "text": "But it's just a formal identity wherein lies its power.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4304.933,
    "end": 4311.397,
    "text": "It says nothing about any physical reality, whether in physics, chemistry, or biology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4312.337,
    "end": 4321.883,
    "text": "Today's rule itself tells us nothing about physical reality and contains no heuristics to discover anything about physical reality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4322.841,
    "end": 4329.887,
    "text": " For that, you need to develop models driven by a profound analysis of large databases.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4330.708,
    "end": 4337.074,
    "text": "So it turns out that biological models like art do not incorporate the Bayes rule.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4337.134,
    "end": 4345.722,
    "text": "However, art does routinely choose the best or optimal categories that represent the data best.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4346.702,
    "end": 4349.445,
    "text": "So you don't need Bayes to achieve optimality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4350.433,
    "end": 4354.796,
    "text": " Also, Bayes works best in a stationary world with stationary probabilities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4355.557,
    "end": 4359.58,
    "text": "And art's designed to learn about a non-stationary world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4361.661,
    "end": 4364.564,
    "text": "So one can discuss this till the cows come home.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4365.885,
    "end": 4368.487,
    "text": "It's good for what it was designed for.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4371.149,
    "end": 4379.775,
    "text": "And some of the neuroscientists who try to apply Bayes are wonderful experimentalists, but they know no math and no theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4380.854,
    "end": 4388.359,
    "text": " And it's the temptation of a free lunch.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4389.44,
    "end": 4391.521,
    "text": "There it is, waiting to be applied.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4392.202,
    "end": 4394.203,
    "text": "There is no free lunch in science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4399.567,
    "end": 4399.947,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4401.448,
    "end": 4405.591,
    "text": "Now, as a final point of comparison, what are the- To Smith.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4405.671,
    "end": 4406.752,
    "text": "I didn't reply to Smith.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4406.772,
    "end": 4406.892,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4407.987,
    "end": 4408.227,
    "text": " Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4408.948,
    "end": 4409.848,
    "text": "OK.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4410.128,
    "end": 4412.99,
    "text": "You quoted a sentence of Smith.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4415.252,
    "end": 4418.614,
    "text": "But before that sentence Smith et al.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4418.654,
    "end": 4436.706,
    "text": "wrote, it is also worth highlighting that as our model is intended primarily as a proof of concept and a demonstration of an available model expansion reduction approach that can be used within active inference research,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4437.592,
    "end": 4451.062,
    "text": " It does not explicitly incorporate some aspects such as top-down attention that are of clear importance to cognitive learning processes and that have been implemented in previous models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4451.082,
    "end": 4465.213,
    "text": "For example, the adaptive resonance theory law model of Grossberg was designed to incorporate top-down attentional mechanisms and feedback mechanisms to address a fundamental knowledge acquisition problem",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4466.226,
    "end": 4477.5,
    "text": " the temporal instability of previously learned information that can occur when a system also remains sufficiently plastic to learn new and potentially overlapping information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4478.801,
    "end": 4485.85,
    "text": "While our simulations do not explicitly incorporate these additional complexities, there are clear analogs",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4486.869,
    "end": 4498.377,
    "text": " the top-down and bottom-up feedback exchanges in art within our model, such as the prediction and prediction error signaling within the neural process theory associated with active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4499.218,
    "end": 4512.227,
    "text": "Art addresses the temporal instability problem primarily through mechanisms that learn top-down expectancies that guide attention and match them on bottom-up input patterns, which is quite similar to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4513.342,
    "end": 4517.305,
    "text": " the prior expectations and likelihood mappings used within active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4518.707,
    "end": 4534.18,
    "text": "But as I've already noted, the, quote, prior expectations and likelihood mappings within adaptive inference, quote, unquote, do not have any of the key learning, attention, and memory stability properties of the ARC matching rule.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4534.801,
    "end": 4539.805,
    "text": "The ARC matching rule is a unique solution to that problem in its variations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4542.222,
    "end": 4549.287,
    "text": " It's been supported by psychological, anatomical, physiological, and biophysical data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4551.389,
    "end": 4553.551,
    "text": "It also occurs in many species.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4554.191,
    "end": 4557.174,
    "text": "Nobuo Suga, for example, shows that it occurs in bats.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4558.775,
    "end": 4561.437,
    "text": "It occurs in ferrets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4562.958,
    "end": 4565.5,
    "text": "So also, I think it's important to know",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4567.23,
    "end": 4573.752,
    "text": " that when learning begins in an arc model, it doesn't need prior expectations or likelihood.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4574.793,
    "end": 4583.936,
    "text": "In fact, typically, the initial bottom-up weights are chosen to be random, because you don't know what you're going to be experiencing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4584.377,
    "end": 4595.901,
    "text": "And the initial top-down expectations are chosen to be large, so that whatever category happens to be learned, when it reads out its top-down expectation,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4596.627,
    "end": 4600.17,
    "text": " it can match whatever features activated that category.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4600.83,
    "end": 4609.417,
    "text": "So they all start large and then they're pruned to match the critical features that happen to be learned in that category.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4610.237,
    "end": 4614.16,
    "text": "So there are no built-in models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4615.041,
    "end": 4617.082,
    "text": "Art discovers its own models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4618.884,
    "end": 4623.547,
    "text": "I should also emphasize that active inference is also not explainable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4624.448,
    "end": 4625.949,
    "text": "Arts is explainable because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4626.644,
    "end": 4643.034,
    "text": " A currently active critical feature activity pattern, namely the features to which attention is paid, controls all learning and prediction by the model and in principle can be measured by neurophysiological experiments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4643.835,
    "end": 4653.961,
    "text": "A model without cell activities or short-term memory traces that can represent the critical feature pattern can't be explainable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4655.871,
    "end": 4658.854,
    "text": " So I think there are qualitative differences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4659.775,
    "end": 4662.637,
    "text": "I don't say people shouldn't use active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4663.438,
    "end": 4668.903,
    "text": "It may be incredibly useful and powerful in technological applications.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4669.663,
    "end": 4679.933,
    "text": "But when one is doing, you know, brain science, psychology, it just doesn't match foundational data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4680.193,
    "end": 4682.335,
    "text": "It just doesn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4688.2,
    "end": 4688.46,
    "text": " Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4689.261,
    "end": 4714.741,
    "text": "And I guess you somehow already answered a part of this question, but what are the possible ways in which an arts approach to explainable AI, which, if I'm not mistaken, can be described as a model-dependent, intrinsically explainable approach, can inform active inferences approach and cross-fertilize with it, which is based on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4715.177,
    "end": 4725.644,
    "text": " abductive reasoning through constructing generative models, for example, as is sketched out in Parr and Pizzullo's Understanding, Explanation, and Active Inference paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4727.104,
    "end": 4732.828,
    "text": "Well, first, I don't think art is model dependent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4734.209,
    "end": 4743.995,
    "text": "As I just noted, one begins typically to learn an art with random initial bottom-up weights and uniformly distributed",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4744.838,
    "end": 4750.861,
    "text": " about that initial adaptive weight so you can match any category that you happen to learn.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4752.502,
    "end": 4764.209,
    "text": "But the authors you quoted write in part that active inference, and here I want to quote them so I can respond in a little more detail.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4765.149,
    "end": 4772.814,
    "text": "Active inference, quote, implies a deep generative model that includes a model of the world",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4773.84,
    "end": 4794.784,
    "text": " used to infer policies, and a higher-level model that attempts to predict which policies will be selected based upon a space of hypothetical, that is, counterfactual explanations, and which can subsequently be used to provide retrospective explanations about the policies pursued.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4794.804,
    "end": 4803.566,
    "text": "So again, art works without a generative model of the world or any predefined policies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4804.701,
    "end": 4813.969,
    "text": " Because what it's trying to do is discover what changing world it happens to be in, and nobody knows what it is a priori.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4815.45,
    "end": 4832.164,
    "text": "And in general, an art classifier responds to a front end of pre-processes that process perceptual data from one or another sense, notably vision and audition, where we get",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4832.95,
    "end": 4836.111,
    "text": " most of our information about the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4838.492,
    "end": 4850.857,
    "text": "And that's why I classify it like art begins its work in the brain in the temporal cortex, where it receives highly preprocessed perceptual representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4852.097,
    "end": 4859.8,
    "text": "So decades of work went into understanding how our brains consciously see and hear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4861.522,
    "end": 4879.909,
    "text": " And in the case of vision, art classifies perceptual boundaries and surfaces that require multiple stages of processing because, as I mentioned briefly, they are the outcome of what I call hierarchical resolution of uncertainty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4880.609,
    "end": 4890.753,
    "text": "You need multiple stages to define a perceptual boundary of surface, one reason being because our sensory organs",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4891.816,
    "end": 4906.119,
    "text": " registers such noisy and incomplete data, like you may know, that our photosensitive retina has a huge blind spot, where you can't register any sense, any visual signal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4906.58,
    "end": 4914.021,
    "text": "The blind spot as big as the fovea, where all of our high resolution vision occurs, so it's not a little thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4914.861,
    "end": 4916.722,
    "text": "And moreover, veins",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4917.639,
    "end": 4921.58,
    "text": " come out of the fovea and occlude the retina in multiple places.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4922.32,
    "end": 4926.901,
    "text": "And you can't register visual signals on the veins either.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4926.961,
    "end": 4936.883,
    "text": "So the signal you're getting is very incomplete and it takes multiple processing stages to overcome those uncertainties.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4937.023,
    "end": 4942.804,
    "text": "And my colleague and I have worked for decades to explain how that happens.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4945.646,
    "end": 4948.087,
    "text": " maybe I'll stop there for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4949.107,
    "end": 4949.788,
    "text": "Thank you so much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4950.728,
    "end": 4970.716,
    "text": "Now, this next question is of a personal interest to me because currently I'm working on modeling some probabilistic aspects of affective response to music and your most recent paper toward understanding the brain dynamics of music immensely helped me gain a better understanding of entrainment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4972.397,
    "end": 4975.158,
    "text": "As you pointed out in the supplementary notes for this paper,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4976.678,
    "end": 4986.403,
    "text": " Violation of prior learned expectations is instrumental in inducing a wide range of affective responses in musical and non-musical situations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4987.163,
    "end": 4994.166,
    "text": "Some psychologists, such as Patrick Uslan, have distinguished between perception and arousal of emotions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4994.186,
    "end": 4997.028,
    "text": "I'm sorry to interrupt you, but you left out a question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4997.688,
    "end": 5000.729,
    "text": "Is it the lack of time or you just skipped it accidentally?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5001.45,
    "end": 5004.271,
    "text": "I want to know quite a bit about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5005.57,
    "end": 5010.352,
    "text": " How do you see the future of auto and neuro-inspired AI research?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5010.432,
    "end": 5012.653,
    "text": "I think that will be our last question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5012.673,
    "end": 5015.234,
    "text": "Okay, so we'll come back to that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5015.955,
    "end": 5017.235,
    "text": "Yes, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5017.555,
    "end": 5020.157,
    "text": "Because that's an important question for me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5020.297,
    "end": 5020.517,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5020.917,
    "end": 5022.277,
    "text": "Okay, so sorry to interrupt.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5022.357,
    "end": 5023.478,
    "text": "I just wanted to be sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5023.814,
    "end": 5024.815,
    "text": " No problem, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5025.655,
    "end": 5037.482,
    "text": "Now, yes, well, some psychologists such as Patrick Uslan have distinguished between the perception and the arousal of emotions in the context of musical experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5038.603,
    "end": 5045.907,
    "text": "And also several studies, such as the works of Uslan and Gabrielson from the Psychology Department of Uppsala University,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5046.747,
    "end": 5059.776,
    "text": " have shown that despite music's ability to communicate a wide range of positively and negatively valenced emotions, it somehow evokes mostly positively valenced emotions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5060.796,
    "end": 5067.041,
    "text": "For instance, we can easily perceive rage or anger in music without necessarily getting angry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5067.621,
    "end": 5073.265,
    "text": "On the other hand, we're more likely to actually feel elevated and happy after listening to happy music.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5074.686,
    "end": 5088.576,
    "text": " And also the evidence shows that this disparity between perception and evocation of emotion is probably even more significant in musical experiences than any other non-musical experiences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5089.557,
    "end": 5099.284,
    "text": "So how can this difference in diversity between perceived and aroused or evoked musical emotions be accounted for within art",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5101.325,
    "end": 5101.845,
    "text": " framework?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5101.885,
    "end": 5113.19,
    "text": "Can it possibly be regarded as another kind of broken symmetry, as you mentioned on page 621 of your book, but specific to musical effects?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5115.671,
    "end": 5126.274,
    "text": "So, as you've noted, I haven't studied these issues in the context of music, but I'll try to venture some general comments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5127.275,
    "end": 5130.196,
    "text": "I should first note that the Laminart model",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5132.231,
    "end": 5149.684,
    "text": " which is a development of art to show how and why all neocortical circuits that support perception and cognition typically share a canonical six-layer circuit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5150.925,
    "end": 5156.87,
    "text": "My colleagues and I have modeled how, just as in our brains, variations of this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5157.762,
    "end": 5164.164,
    "text": " canonical laminar circuit can support all perceptual and cognitive processes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5164.204,
    "end": 5166.765,
    "text": "So there's a major generalization of art.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5169.085,
    "end": 5175.687,
    "text": "And we've done it for vision, speech, and cognitive working memory, and planning in particular.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5176.688,
    "end": 5184.01,
    "text": "So the main point is that the laminar circuitry is basically an all perceptual and cognitive",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5184.947,
    "end": 5187.588,
    "text": " areas, vision, audition, et cetera, et cetera.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5187.608,
    "end": 5193.05,
    "text": "That's how one can create a context for discussing music.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5193.11,
    "end": 5198.433,
    "text": "And in fact, my work on music applied such discoveries.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5198.613,
    "end": 5211.038,
    "text": "I was able to put together discoveries that had been made based on what I believe were different evolutionary pressures",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5214.308,
    "end": 5235.805,
    "text": " the organization of our brains, but that evolution also discovered, and I try to sketch how, if you put some of them together in a certain way, then capacity for learning and consciously performing music could arise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5236.686,
    "end": 5238.607,
    "text": "So now how about arousal?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5239.534,
    "end": 5243.095,
    "text": " Well, it's essential, of course, to all awareness and consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5243.936,
    "end": 5251.179,
    "text": "Your cortex needs to be adequately aroused for waking consciousness to occur at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5252.339,
    "end": 5268.486,
    "text": "It also arousal plays a major role in the processing of emotions, and it's very relevant to musical issues, because my gated dipole model explains how opponent processes, opposites,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5269.611,
    "end": 5278.455,
    "text": " are organized in all parts of our brain, perceptual, cognitive, motor, affective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5279.516,
    "end": 5286.519,
    "text": "In particular, emotions are organized in pairs in such an emotional dipole.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5287.8,
    "end": 5294.863,
    "text": "And one reason is because emotions need to compete with each other, such as fear versus relief.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5296.869,
    "end": 5317.283,
    "text": " For example, in post-traumatic stress disorder therapy, a therapist may try to help a patient to think about positive experiences that generate relief in order to inhibit the chronic fear that's so destabilizing during PTSD.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5318.324,
    "end": 5321.366,
    "text": "So their opposites are competing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5322.767,
    "end": 5325.909,
    "text": "And another property that arousal enables is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5326.806,
    "end": 5341.791,
    "text": " The sudden offset of an emotion like fear, let's say during escape behavior, let's say, you know, a favorite example of mine is, you know, some cruel experimentalist puts a pigeon in a Skinner box.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5342.552,
    "end": 5344.032,
    "text": "The floor is electrified.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5344.052,
    "end": 5347.733,
    "text": "The pigeon is feeling pain and fear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5347.853,
    "end": 5352.435,
    "text": "It's dashing frantically around trying to keep its feet off the floor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5353.155,
    "end": 5355.076,
    "text": "It bangs into a red buzzer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5356.132,
    "end": 5367.795,
    "text": " the buzzer shuts the shock off, and the animal experienced a wave of relief or positive motivation for learning the escape response.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5368.795,
    "end": 5385.259,
    "text": "So the rebound from theater relief that can be associated with actions that lead to escape and can motivate escape by means in the future is energized by arousal in the gated dipole.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5386.96,
    "end": 5398.328,
    "text": " You shut off the external cue of shock, but the arousal is tonically or has sustained activity in both the fear and the relief channels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5398.408,
    "end": 5413.179,
    "text": "So because the arousal is sustained or tonic through time and equally activates the fear and relief channels, when fear suddenly decreases, then arousal in the relief channel wins the competition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5414.173,
    "end": 5432.242,
    "text": " and can thereby call what I call an antagonistic rebound from theater relief that activates the relief channel and thereby providing motivation for escape, whether reactive or learned through escape experiences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5433.503,
    "end": 5441.547,
    "text": "And I also approve, which is related to some degree to music, that the non-occurrence of an expected event",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5442.688,
    "end": 5455.5,
    "text": " can by itself cause a burst of arousal and thus an antagonistic rebound and can flip emotions from positive to negative in so doing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5456.48,
    "end": 5459.143,
    "text": "And I always loved that discovery because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5459.835,
    "end": 5468.24,
    "text": " I especially love discoveries where the occurrence of nothing has profound effects on future behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5469.201,
    "end": 5476.646,
    "text": "So it's the non-occurrence of the expectation cause of this mismatch that can flip emotions",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5478.476,
    "end": 5483.801,
    "text": " Now, how this influence of the perception of music needs more work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5484.321,
    "end": 5489.986,
    "text": "As I mentioned in my paper, I haven't tried to study that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5492.168,
    "end": 5497.492,
    "text": "My paper on music, I feel, is like a drop in the bucket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5497.732,
    "end": 5502.436,
    "text": "And hopefully, if I don't get around to it, someone else will.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5503.257,
    "end": 5506.66,
    "text": "But the above examples show that arousal and emotion",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5507.583,
    "end": 5516.307,
    "text": " are not the same thing, because arousal can support all emotions, fear, relief, hunger, satiety, whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5517.088,
    "end": 5524.651,
    "text": "The ones that win the competition are then able to support compatible behaviors by motivating them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5526.212,
    "end": 5535.396,
    "text": "And I've also explained that the level of arousal must be chosen within an intermediate range to support normal behaviors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5535.456,
    "end": 5536.817,
    "text": "It's a kind of golden",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5537.637,
    "end": 5547.861,
    "text": " mean there's an inverted U on the effects of having arousal from too little or too much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5548.621,
    "end": 5557.324,
    "text": "And if you have too little arousal, you have an underaroused syndrome, which can support symptoms like autism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5559.64,
    "end": 5587.016,
    "text": " over arousal can support symptoms of a disease like schizophrenia is only one of many factors in these diseases but I'm happy to say that subsequent clinical data supported those predictions that these two mental disorders are at opposite extremes of the arousal inverted view so I think and you know there's very",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5587.959,
    "end": 5594.702,
    "text": " because I've never really seriously studied it, and I try not to speculate, but what the hell.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5595.842,
    "end": 5605.766,
    "text": "The kind of arousal that music activates is generally positive, just like the arousal that activates exploratory behaviors is positive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5607.246,
    "end": 5608.507,
    "text": "It somehow links.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5609.287,
    "end": 5614.269,
    "text": "You know, music is a sonic adventure, if you like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5615.435,
    "end": 5629.6,
    "text": " There's no aversive cue when listening to music, except perhaps music that's played so loud as to cause a headache or ear damage or even a seizure in susceptible individuals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5629.7,
    "end": 5638.103,
    "text": "So there's no particular reason why it shouldn't be positive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5639.603,
    "end": 5641.964,
    "text": "So now which question you want to ask me?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5644.139,
    "end": 5646.84,
    "text": " I think we're left with just two other questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5647.541,
    "end": 5650.562,
    "text": "If we're not too tired.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5650.862,
    "end": 5653.643,
    "text": "Start with as a final point of comparison.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5654.423,
    "end": 5656.664,
    "text": "Another starts on a more fluid side.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5657.684,
    "end": 5657.984,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5659.025,
    "end": 5662.246,
    "text": "The last we're on the last two questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5663.834,
    "end": 5668.476,
    "text": " So you want to do, how do you see the future of all-immune spider research?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5669.316,
    "end": 5678.26,
    "text": "And before that, yes, before that, I just wanted to ask you about your view about artificial consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5679.54,
    "end": 5684.983,
    "text": "Do you see... I really need the first answer to answer the second question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5685.883,
    "end": 5687.304,
    "text": "Okay, as you wish, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5687.324,
    "end": 5689.164,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5689.324,
    "end": 5691.085,
    "text": "So, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5691.845,
    "end": 5692.866,
    "text": "And how do you see...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5695.484,
    "end": 5696.345,
    "text": " Yes, it's quite fine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5696.905,
    "end": 5702.668,
    "text": "And how do you see the future of art and brain-inspired AI research in general?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5703.729,
    "end": 5708.511,
    "text": "In your view, what research areas ought to gain more attention than they do today?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5710.553,
    "end": 5715.896,
    "text": "So I'll give you quite a general answer, but it implies...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5718.868,
    "end": 5720.369,
    "text": " and what I think about this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5720.989,
    "end": 5727.494,
    "text": "So first, with a caveat, I like to say I couldn't predict the present, so I can't predict the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5728.975,
    "end": 5741.704,
    "text": "That being said, I believe that all engineering technology and AI will increasingly embody autonomous adaptive intelligence in the coming century.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5742.484,
    "end": 5744.606,
    "text": "And we can already see its beginnings",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5745.31,
    "end": 5752.675,
    "text": " in autonomous automobiles and airplanes and increasingly autonomous controllers on the factory floor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5752.715,
    "end": 5756.258,
    "text": "And many people have written about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5757.279,
    "end": 5763.824,
    "text": "And I think art will play a central role in this, as well as other models that are summarized in my book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5763.884,
    "end": 5767.046,
    "text": "And that's because already in 1980, I published",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5769.238,
    "end": 5779.541,
    "text": " a thought experiment in the journal Psychological Review, which was then and still probably remains the leading theory journal in psychology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5780.642,
    "end": 5790.825,
    "text": "And you may recall that Einstein derived both special relativity theory and general relativity from thought experiments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5791.025,
    "end": 5798.267,
    "text": "And let me just clarify by my thought experiment, wherein they derived their enormous power",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5799.542,
    "end": 5812.012,
    "text": " So my thought experiment was about how any system can autonomously, it's all about autonomy, correct predictive errors in a changing world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5813.213,
    "end": 5823.541,
    "text": "And the hypotheses upon which the thought experiment were derived are just a few facts that are familiar to us all from daily life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5824.722,
    "end": 5827.724,
    "text": "And they're familiar because they represent ubiquitous",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5828.553,
    "end": 5832.336,
    "text": " environmental pressures on the evolution of our brains over the millennia.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5833.617,
    "end": 5839.722,
    "text": "And when they act together, I suggest art is the unique outcome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5839.862,
    "end": 5841.844,
    "text": "That's a huge claim.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5842.785,
    "end": 5850.131,
    "text": "And I turn to the power of the thought experiment, not to any personal ego trip, for that belief.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5851.632,
    "end": 5857.637,
    "text": "In particular, nowhere in the thought experiment are the words mind or brain mentioned.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5858.789,
    "end": 5875.053,
    "text": " So if you accept that these facts about the world exist, which we all do, and that they're always operating on us, then you have to accept the outcome if you believe in the scientific method and logic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5876.213,
    "end": 5884.775,
    "text": "So art is a universal solution to the problem of autonomous error correction in a changing world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5886.584,
    "end": 5905.332,
    "text": " Said in another way, if you can't find a mistake in the thought experiment, then I think you either have to believe in art-like dynamics, maybe expressed in Laminard or your favorite art variant, or you have to give up your belief in logic and the scientific method.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5906.493,
    "end": 5909.294,
    "text": "It doesn't imply that art can't be further developed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5909.994,
    "end": 5913.056,
    "text": "I expect a large number of scientists and technologists",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5914.534,
    "end": 5919.96,
    "text": " to be busy developing architectures long after I'm gone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5921.421,
    "end": 5925.025,
    "text": "So maybe now we can go to your philosophical note with that background.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5926.126,
    "end": 5926.366,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5926.907,
    "end": 5927.587,
    "text": "Thank you so much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5928.43,
    "end": 5938.719,
    "text": " Now, yes, as I mentioned earlier, I just wanted to ask about your view on artificial consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5939.56,
    "end": 5948.648,
    "text": "Do you see the consciousness as artificially producible or engineerable, as some researchers like Mike Solmsley?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5950.029,
    "end": 5954.573,
    "text": "Is there a fundamental distinction between a biologically conscious agent and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5955.017,
    "end": 5959.2,
    "text": " an artificial agent with a fully simulated computational model of consciousness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5959.801,
    "end": 5966.206,
    "text": "I know it's a big, big question, but I couldn't resist asking your opinion as an authority on consciousness modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5967.967,
    "end": 5969.988,
    "text": "I'm happy to give a shot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5971.089,
    "end": 5983.919,
    "text": "So, as I just noted, my work on art suggests it solves a universal problem about how we can learn to correct predictive errors in a changing world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5985.895,
    "end": 6008.404,
    "text": " My work also shows in its analysis of hierarchical resolution of uncertainty, remember like how you go from some noisy retina to a surface representation that can control looking and reaching, how evolution may have been driven to discover conscious states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6009.725,
    "end": 6012.206,
    "text": "So this was a surprise to me too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6013.865,
    "end": 6036.711,
    "text": " conscious states were needed in order to choose that processing level or levels that computes a sufficiently complete context-sensitive and stable representation, the case of vision, surface representation, with which to successfully plan and act to realize value goals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6037.731,
    "end": 6040.011,
    "text": "So let me make it clear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6040.591,
    "end": 6042.732,
    "text": "So you start with a noisy retina, you have to go,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6043.507,
    "end": 6054.832,
    "text": " up all of these stages until you get a sufficiently complete surface and boundary representation that you can use to regulate successful action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6055.613,
    "end": 6064.717,
    "text": "And if you use one of the earliest stages, it would lead to incorrect actions, which would kill you off by Darwinian selection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6065.418,
    "end": 6070.46,
    "text": "So how the hell do you know where the stage is where you complete",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6070.984,
    "end": 6077.128,
    "text": " compute the sufficiently complete context senses and stable one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6078.508,
    "end": 6097.36,
    "text": "And I propose in vision, I predicted that the choice is embodied in what I call a surface shroud resonance between pre-strived visual cortical area V4 and the next processing stage, posterior parietal cortex, or PPC.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6098.965,
    "end": 6103.428,
    "text": " So it's in V4 you get this really good surface representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6105.089,
    "end": 6112.073,
    "text": "And then a resonance between the surface and spatial attention, which fits the surface.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6113.313,
    "end": 6118.036,
    "text": "That spatial attention in PPC is called a shroud.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6118.116,
    "end": 6121.078,
    "text": "Christopher Tyler gave it that name.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6121.738,
    "end": 6128.162,
    "text": "A surface shroud resonance allows you to take conscious",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6129.164,
    "end": 6136.651,
    "text": " spatial attention to the surface that you're going to use to control looking and reaching behaviors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6137.331,
    "end": 6142.075,
    "text": "So it's a way of ensuring you have a good enough representation to control action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6145.639,
    "end": 6156.288,
    "text": "So the shroud is computed in posterior parietal cortex, which is part of the dorsal or where cortical stream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6158.041,
    "end": 6166.628,
    "text": " And the shroud modulates invariant category learning in the ventral or Watt cortical stream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6167.228,
    "end": 6170.291,
    "text": "I can't go into that right now, but my book discusses it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6171.311,
    "end": 6179.077,
    "text": "The category learning itself in the Watt cortical stream, as I indicated, is supported by a feature category resonance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6180.438,
    "end": 6186.283,
    "text": "And so the surface shroud resonance is modulating invariant category learning",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6187.778,
    "end": 6189.859,
    "text": " in the feature category resonances.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6190.66,
    "end": 6194.382,
    "text": "So for shroud resonance also supports conscious seeing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6195.502,
    "end": 6200.245,
    "text": "The feature category resonance is supporting conscious recognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6201.265,
    "end": 6211.771,
    "text": "And when they synchronize across streams on a familiar object, that's when you consciously see something that you know about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6213.952,
    "end": 6214.852,
    "text": "Okay, so...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6216.732,
    "end": 6221.616,
    "text": " Conscious states hereby arise due to learning requirements.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6222.777,
    "end": 6234.867,
    "text": "This sort of fell out of the wash of how you do invariant category learning, and learning in particular without catastrophic forgetting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6234.927,
    "end": 6237.389,
    "text": "It's regulating feature category resonance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6238.43,
    "end": 6245.256,
    "text": "So given that the above solutions are computationally universal in the sense I sketch,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6246.598,
    "end": 6259.103,
    "text": " The self-organizing machine that embodies them should be able to support internal representations whose parametric properties mimic conscious states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6260.744,
    "end": 6271.668,
    "text": "But whether such a machine can experience conscious qualia remains as much of a mystery for machines as it does for humans.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6273.226,
    "end": 6286.848,
    "text": " And that's because no computational theory, which after all is just a set of equations, can do more than imitate the dynamics of our brains, perhaps with great precision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6287.949,
    "end": 6300.511,
    "text": "I don't have a clue why the representations that my colleague and I have worked so hard to explain huge amounts of psychophysical data about seeing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6302.213,
    "end": 6308.877,
    "text": " Extra shading, 3D form, just go through the list.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6309.817,
    "end": 6311.278,
    "text": "Why they support qualia?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6312.319,
    "end": 6312.799,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6314.42,
    "end": 6321.263,
    "text": "Ask God or whatever God you choose to believe in in the 21st century.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6325.916,
    "end": 6327.097,
    "text": " Thank you so much, Professor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6327.717,
    "end": 6335.062,
    "text": "I think we have a couple of questions in the chat, but we are actually approaching our two hour limit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6335.082,
    "end": 6341.766,
    "text": "I don't know, Daniel, if it's a good place to stop or whatever you say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6343.226,
    "end": 6345.686,
    "text": " I think that's a great place to stop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6345.706,
    "end": 6349.347,
    "text": "You've given us a lot to think about and digest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6349.927,
    "end": 6358.529,
    "text": "And I hope that these words are taken well and paid attention to, might create some categories, activate some categories.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6360.049,
    "end": 6363.91,
    "text": "But Professor Grossberg, thanks again for this amazing live stream.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6363.93,
    "end": 6364.79,
    "text": "We really appreciate it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6365.33,
    "end": 6366.09,
    "text": "I appreciate it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6366.19,
    "end": 6368.691,
    "text": "And depending on younger people like yourself,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6369.514,
    "end": 6371.375,
    "text": " But do just what you said, Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6371.435,
    "end": 6373.356,
    "text": "I'm not going to be around that much longer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6374.217,
    "end": 6385.803,
    "text": "So I hope you have, whether with my work directly or related work, you have a very fulfilling intellectual adventure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6385.883,
    "end": 6389.305,
    "text": "I know I've been on a wild ride since I was 17.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6389.745,
    "end": 6393.967,
    "text": "That's 65 years of discovery.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6395.368,
    "end": 6396.689,
    "text": "I've loved every minute of it.",
    "speaker": "SPEAKER_02"
  }
]