[
  {
    "start": 5.33,
    "end": 6.391,
    "text": " All right, hello and welcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6.932,
    "end": 11.678,
    "text": "This is Active Inference Guest Stream 87.1 on September 5th, 2024.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 12.819,
    "end": 15.122,
    "text": "We're here with John Boyk and Lee Ayer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 15.563,
    "end": 21.209,
    "text": "So Lee, how about please say hello and give some contextualizing thoughts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 21.87,
    "end": 27.297,
    "text": "Introduce John however you like, and then we'll have presentation discussion with John.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 27.497,
    "end": 28.258,
    "text": "So go for it, Lee.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 28.418,
    "end": 29.059,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 29.866,
    "end": 30.227,
    "text": " Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.707,
    "end": 31.248,
    "text": "Thanks, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 31.449,
    "end": 48.539,
    "text": "So I came across John through the Active Influence Institute because he was the only other person sitting on the strange intersection that I'm sitting on in this space between looking at societal transformation and active influence as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 48.559,
    "end": 49.942,
    "text": "So I was very excited.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 50.663,
    "end": 54.169,
    "text": "And I joined the first live stream that he did on his",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 54.149,
    "end": 56.112,
    "text": " science driven transformation papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 57.054,
    "end": 67.891,
    "text": "And subsequently I contacted him and we both explored a kind of a shared interest, I guess, in functional forms of cognition at scale and how those can be facilitated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 67.911,
    "end": 71.837,
    "text": "And John was talking about the potential of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 71.817,
    "end": 100.896,
    "text": " uh some kind of software solution to facilitate that and uh the kind of the discussion that ensued over the following months um has led to john creating this this paper so i'm i've kind of been in discussion with him sort of over the months and i'm really really interested to get more into this presentation okay thank you go for it john",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 101.99,
    "end": 102.792,
    "text": " Thanks, Lee.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 102.833,
    "end": 103.755,
    "text": "Appreciate that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 103.775,
    "end": 111.057,
    "text": "But I think it was more like many months of discussions that we were engaged in that led up to this paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 111.098,
    "end": 114.227,
    "text": "So thanks for all your input during that time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 115.591,
    "end": 118.156,
    "text": " My name is John Boyk.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 118.276,
    "end": 122.484,
    "text": "I'm a research fellow at the Active Inference Institute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 123.306,
    "end": 126.812,
    "text": "I'm very pleased to be appointed to that position.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 126.832,
    "end": 138.274,
    "text": "I have two new preprints available to the public, two papers that we'll be discussing today, both on the topic of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 138.254,
    "end": 141.04,
    "text": " of group cognition at scale.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 141.661,
    "end": 151.643,
    "text": "As Lee mentioned, I'm proposing a essentially software ecosystem, online ecosystem for group cognition at scale.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 152.645,
    "end": 157.495,
    "text": "And today we'll talk about kind of the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 157.475,
    "end": 172.125,
    "text": " there's some of the general ideas there the overview of that project and then on the second guest stream but maybe is this slides view can everyone see the slides right now and can you go to the next slide then please",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 175.565,
    "end": 179.954,
    "text": " So the two papers have two gas streams that we're doing today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 180.014,
    "end": 182.299,
    "text": "And then the next one is on September 10.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 183.201,
    "end": 187.329,
    "text": "And on the second one, today we'll cover some general concepts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 187.349,
    "end": 194.063,
    "text": "And on the second one, we'll get a little bit more into some technical details about the underlying meaning representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 194.043,
    "end": 198.954,
    "text": " I'll discuss in a moment what that term meaning representation means.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 199.755,
    "end": 202.361,
    "text": "But this first paper is available on archive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 203.022,
    "end": 204.526,
    "text": "You can download the paper from there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 204.546,
    "end": 208.755,
    "text": "And let's get started.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 211.14,
    "end": 212.102,
    "text": "Next slide, please.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 215.018,
    "end": 218.261,
    "text": " So I'm proposing something called the Cognar Ecosystem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 218.862,
    "end": 221.865,
    "text": "And Cognar stands for cognitive narrative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 223.087,
    "end": 229.734,
    "text": "And in concept, and I should say this is just a concept, this project is still in its incubation phase.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 232.737,
    "end": 238.343,
    "text": "The two papers are the substance of what has been done so far on this project.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 238.323,
    "end": 249.976,
    "text": " And I'm hoping that I can interest others in the research community and in other communities, civil society communities and other communities, to get engaged with this project and help it to move forward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 251.478,
    "end": 267.857,
    "text": "So in concept, this is an open source, online, extensible ecosystem of basically software, but resources, tools, applications, libraries, services that facilitates group cognition, and especially for large groups.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 268.732,
    "end": 278.825,
    "text": " And especially with regard to deliberation, strategizing, problem solving, decision making, that kind of things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 278.925,
    "end": 285.653,
    "text": "But you'll see that as we go through these slides, you'll see that there's really a variety of use cases for this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 285.813,
    "end": 292.782,
    "text": "But these are the use cases that I really had in mind as I was developing the concept for the project.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 294.112,
    "end": 300.042,
    "text": " So essentially, Cognar helps users to, the way I phrase it, is tell their story.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 300.083,
    "end": 309.96,
    "text": "And by that, I mean to convey their beliefs to their group about how the world works relative to some situation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 309.94,
    "end": 336.285,
    "text": " so um a group can be anything uh could be a you know could be a uh uh could be a a city could be a corporation could be a school could be any kind of group that is trying to you know process the the understandings and beliefs of its members towards some goal perhaps problem solving or some other goal",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 337.565,
    "end": 346.201,
    "text": " So towards that aim, Cognar helps users to tell their story, that is, convey their beliefs to the group about how the world works.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 347.003,
    "end": 355.759,
    "text": "I use the word story and I use the word narrative in the series of two papers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 355.739,
    "end": 369.077,
    "text": " But I don't mean to confuse the reader because I'm not talking about a narrative in the normal sense, like a written narrative where you write down several paragraphs or several pages of text.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 369.617,
    "end": 381.493,
    "text": "This is a little different, but I still call the representation a story because it's a story in the sense that it conveys",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 382.537,
    "end": 411.193,
    "text": " a user's beliefs about like why something happened and what might happen next and um what should we do and what does it mean and all that kind of stuff so you know this this belief really a belief model that the user is is creating for this situation maybe explains you know what is the explains what the problem is what are we trying to solve or here's my solution or",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 411.173,
    "end": 427.512,
    "text": " what just i think this is what just happened or what did happen or here's here's what i think will happen next um here's what i here's what i think will the people that will be affected by this issue uh i believe that so and so and so and so was involved",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 427.492,
    "end": 456.469,
    "text": " uh i i think that this this situation means such and such and we should take you know to address it we could take these series of actions or i think i think this should be done or or we could learn this from the situation so it's a story in in the sense that it it spans the who what where how why questions regarding some situation um next slide please",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 460.516,
    "end": 475.179,
    "text": " So there's actually several services and apps available for group collaboration, for example, voting apps and things like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 478.685,
    "end": 488.38,
    "text": "The Cognar ecosystem is, I would say, a much more sophisticated approach to that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 488.63,
    "end": 495.036,
    "text": " It allows a user to tell what I refer to as a potentially rich story.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 495.456,
    "end": 500.341,
    "text": "That means the story could be long, complex, nuanced.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 501.502,
    "end": 502.803,
    "text": "It could be conditional.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 502.863,
    "end": 511.35,
    "text": "Like, for example, I might believe that in some situation, if we do A and B, then perhaps C will happen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 511.411,
    "end": 516.335,
    "text": "But if D happened first, then something else is going on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 516.795,
    "end": 518.637,
    "text": "So it could be a conditional story.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 518.617,
    "end": 530.919,
    "text": " It could be the equivalent of maybe a few paragraphs of text, very short a story, or a story could be the equivalent of a book chapter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 531.62,
    "end": 533.503,
    "text": "It all depends on what the user wants to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 534.648,
    "end": 542.782,
    "text": " So how could such rich information be processed by a large group?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 543.764,
    "end": 546.769,
    "text": "That's really the question behind Cognar.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 546.889,
    "end": 549.253,
    "text": "How could that happen?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 550.275,
    "end": 553.821,
    "text": "So the proposal includes a backend",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 553.801,
    "end": 557.284,
    "text": " computational system that does numerous things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 558.085,
    "end": 561.628,
    "text": "It assists users in creating and constructing stories.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 562.149,
    "end": 582.407,
    "text": "It helps the group to digest what all of these stories are saying and how they are the same and how there's different and what interesting points other stories make and where there's agreement and what are the many ways that this issue is seen by this group of people.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 583.855,
    "end": 589.944,
    "text": " So it does analytics on stories, for example, to help answer some of those questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 591.125,
    "end": 603.143,
    "text": "The system also assesses stories for quality, like is this story on topic for whatever the group is trying to do, whatever the situation is the group is addressing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 603.904,
    "end": 605.105,
    "text": "Is it complete?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 605.466,
    "end": 608.31,
    "text": "Does the story just make sense in and of itself?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 608.29,
    "end": 617.526,
    "text": " And the system can use those kinds of assessments to give feedback to the user.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 617.566,
    "end": 631.57,
    "text": "Like, for example, a story might have some character in it named Bob and some other character named Sue, and it might not be clear from what the user is creating how those two people are related.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 631.671,
    "end": 633.133,
    "text": "So the system might...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 633.113,
    "end": 640.542,
    "text": " If the system is confused about what the relationship is, it might actually ask the user, like, I'm a little confused.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 640.562,
    "end": 643.145,
    "text": "What's the relationship between these two people?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 643.706,
    "end": 649.813,
    "text": "So in that sense, the system acts very much like an engaged, active listener.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 650.614,
    "end": 659.425,
    "text": "Like if you were at home telling your story to a friend, the system is kind of like that friend that is listening and trying to make sense of what you're saying.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 659.405,
    "end": 689.327,
    "text": " maybe asking you know pertinent questions to help direct your your telling of the story so that it understands what's what what the story is about and the system also performs inference for uh uh for queries like perhaps other users other people in the group have a question for the for the storyteller or the story or perhaps the system has questions like what's the relationship between bob and sue as i just mentioned",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 690.623,
    "end": 699.216,
    "text": " So the system has to perform various kinds of inference to help generate and answer those types of queries.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 700.985,
    "end": 714.92,
    "text": " Without such a computational system, imagine a large group of thousands of people and thousands of people submit a long, complicated story.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 715.42,
    "end": 727.393,
    "text": "How would a group make sense of that if there weren't some kind of computational system doing assessments and inference and guidance and assistance behind the scenes?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 729.094,
    "end": 729.675,
    "text": "Next slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 734.06,
    "end": 740.555,
    "text": " So I've been talking about a group, a group that's interested in some topic, some situation or topic or problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 741.176,
    "end": 748.493,
    "text": "But maybe we should take a moment and just let me explain what I mean by group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 749.155,
    "end": 752.322,
    "text": "So we're talking about a group of people in this case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 752.302,
    "end": 766.961,
    "text": " And I call a group a collection of people that demonstrate some kind of coordinated behavior in response to dynamic conditions as time elapses and conditions evolve.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 766.981,
    "end": 771.467,
    "text": "So examples include just about anything you can think of that would be a group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 771.627,
    "end": 781.6,
    "text": "So social clubs, volunteer groups, civic organizations, nonprofits, corporations, and even political entities like cities and states and nations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 783.082,
    "end": 800.82,
    "text": " um a group can range from the very informal to formal flexible to structured temporary to permanent small to large autocratic to democratic in the way it manages information and manages decision making and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 800.8,
    "end": 805.547,
    "text": " So a group does many things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 806.949,
    "end": 808.491,
    "text": "Generally, a group has a purpose.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 808.751,
    "end": 810.013,
    "text": "It forms for some purpose.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 810.774,
    "end": 817.744,
    "text": "And to carry out its purpose, it generally senses its world, processes information, anticipates outcomes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 818.725,
    "end": 827.297,
    "text": "Like a group might say, we should take steps A and B in order to be financially viable or some such thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 828.442,
    "end": 838.483,
    "text": " A group evaluates its options, it makes decisions, and then it takes actions, either just within the group or within the world, or in some way, some kind of actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 839.845,
    "end": 845.016,
    "text": "In other words, I'm saying that a group can be thought of as an organism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 845.637,
    "end": 847.781,
    "text": " An organism that performs cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 847.841,
    "end": 856.757,
    "text": "And just like any organism, an animal, a rabbit, a human, the animal has to do all of these things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 856.817,
    "end": 861.906,
    "text": "It has to sense its world, sense danger in particular, look for food.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 862.707,
    "end": 866.093,
    "text": "It has to process the information that it receives from the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 866.073,
    "end": 872.541,
    "text": " And some of that information, of course, can be noisy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 872.962,
    "end": 876.467,
    "text": "Like it thinks it sees a wolf, but maybe that's not a wolf.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 876.547,
    "end": 877.147,
    "text": "What does it do?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 877.167,
    "end": 879.851,
    "text": "What should the animal do in this situation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 879.931,
    "end": 893.008,
    "text": "It has to anticipate the outcomes of its actions, evaluate options, make decisions, and then take some kind of action in order to maintain itself in the world, and really in order to thrive in the world, if that's possible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 894.271,
    "end": 904.338,
    "text": " So I'm thinking of a group as an organism, and that organism is just like any organism is performing cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 905.742,
    "end": 906.103,
    "text": "Next slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 910.488,
    "end": 913.212,
    "text": " So that's a quick overview of Cognar.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 913.312,
    "end": 920.763,
    "text": "But now maybe it's a good point just to ask the question, who cares?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 920.803,
    "end": 924.648,
    "text": "Or more in particular, why should you care, the listener?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 927.332,
    "end": 932.8,
    "text": "So obviously, Cognar is about group cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 933.05,
    "end": 937.136,
    "text": " And maybe you see the need for improved cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 937.557,
    "end": 959.209,
    "text": "Maybe in particular you wish that some group, perhaps a political group, a nation or a state or a corporation or some other group, maybe you have a story to tell that you think would be important to help this group out, to help the people, to protect, to warn of danger, to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 959.189,
    "end": 967.222,
    "text": " highlight a problem or a solution that you think no one else has thought of or is being underrepresented.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 968.704,
    "end": 974.133,
    "text": "Maybe you have beliefs, maybe you have a story to share with a group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 974.454,
    "end": 978.48,
    "text": "Not only that, it's not just sharing a story because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 978.46,
    "end": 1002.73,
    "text": " because if i i could write a a 50-page letter and send it to my congressman or you know some other some other group a group or group member and there's really no guarantee that that group will really understand what i'm saying in this in this thing you know that's um so you so whatever you share with a group you want them to you want the group to actually hear it to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1002.71,
    "end": 1028.464,
    "text": " register it to hear it and then understand what it is that you're saying because why bother if uh why bother submitting information if if it if it's not really heard or understood or maybe you maybe you look at the world as as i do and you see that the world has some serious uh you know the human world has some serious issues to solve",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1028.63,
    "end": 1035.74,
    "text": " climate change would be one example, but there's many, pollution, climate change, poverty, all kinds of social problems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1036.601,
    "end": 1042.55,
    "text": "And maybe you feel that, isn't there some way that we could do better?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1042.65,
    "end": 1054.266,
    "text": "Isn't there some way that as a group, as small groups, as large groups, as formal groups, as informal groups, is there some way that we could cognate better, that we could be,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1054.246,
    "end": 1082.295,
    "text": " uh more functional organisms group organisms and better act better make better decisions in our world and take better actions you know maybe maybe you think we could do better or maybe you just are a scientist and you're interested just simply in the science behind cogner and and i would say that this project is large uh it's and complex and it touches or or could touch",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1082.883,
    "end": 1085.729,
    "text": " really just about every field of science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1086.451,
    "end": 1098.057,
    "text": "I mean, if you give me a scientific field, I could take a guess as to how this Cognar project might affect it or how it incorporates ideas from that field.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1098.037,
    "end": 1101.866,
    "text": " Let's just take one example, say medicine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1102.788,
    "end": 1108.702,
    "text": "You might think, what would Cognar have to do with medicine?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1108.822,
    "end": 1114.375,
    "text": "Because it's not a medical program in and of itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1114.355,
    "end": 1135.958,
    "text": " doctors have to make decisions groups groups of doctors insurance companies other groups have to make decisions so that they have to come together as a group to make a decisions and and assess some situation so that's one potential way another another potential impact on medicine is as a patient",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1136.596,
    "end": 1138.058,
    "text": " I have a story to tell.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1138.338,
    "end": 1140.201,
    "text": "I have a story about what happened.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1141.863,
    "end": 1143.044,
    "text": "You know, there was an accident.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1143.645,
    "end": 1145.187,
    "text": "I cut my arm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1146.068,
    "end": 1147.09,
    "text": "I stepped on a nail.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1147.17,
    "end": 1147.851,
    "text": "It was rusty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1147.911,
    "end": 1149.954,
    "text": "This and this, you know, this and this happened.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1150.014,
    "end": 1151.816,
    "text": "And I'm afraid of this and this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1151.936,
    "end": 1154.86,
    "text": "And I have a condition, past condition of this and this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1155.02,
    "end": 1156.322,
    "text": "And I'm allergic to this and this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1156.803,
    "end": 1161.148,
    "text": "And all of that can just be written on a piece of paper, you know, like a regular intake form.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1161.749,
    "end": 1166.215,
    "text": "But in Cognar,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1166.195,
    "end": 1175.579,
    "text": " that the story is standardized in a sense so that it's easily readable and understandable by humans and computers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1176.541,
    "end": 1180.17,
    "text": "And a story that a patient is telling",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1180.707,
    "end": 1189.519,
    "text": " using the Cognar system would be more accessible to inference and computation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1189.799,
    "end": 1197.049,
    "text": "And also there's a natural record of stories in Cognar.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1197.749,
    "end": 1208.824,
    "text": "So there would be potentially many areas of medicine as just one example of how either Cognar incorporates the science or could affect the science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1210.154,
    "end": 1214.639,
    "text": " Um, or maybe you're just curious about, uh, you know, what's possible for human groups.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1214.819,
    "end": 1220.805,
    "text": "You know, we, we live in a society that, uh, is faces, uh, all kinds of challenges.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1221.686,
    "end": 1223.768,
    "text": "Uh, there's future challenges on the horizon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1223.788,
    "end": 1227.592,
    "text": "Uh, you know, what, what is the potential of society?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1227.653,
    "end": 1232.698,
    "text": "How, how is considering that a society is a group of people.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1232.758,
    "end": 1234.219,
    "text": "So again, we're talking about groups.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1234.78,
    "end": 1238.524,
    "text": "How, how could, how could a society best.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1239.955,
    "end": 1244.562,
    "text": " share information, make decisions, cognate, really.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1244.702,
    "end": 1254.496,
    "text": "How could the organism called a society perform functional cognition or improved cognition over what is common or available today?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1255.537,
    "end": 1261.165,
    "text": "So I hope there's many reasons why you might care about cognitive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1261.586,
    "end": 1262.267,
    "text": "Next slide, please.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1264.778,
    "end": 1267.882,
    "text": " So I've mentioned the term large group already.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1267.942,
    "end": 1269.965,
    "text": "So what does large group mean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1270.326,
    "end": 1271.107,
    "text": "What does it mean to me?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1271.147,
    "end": 1277.355,
    "text": "Dozens, question mark, hundreds, thousands, millions of participants?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1278.177,
    "end": 1281.922,
    "text": "And I would say the answer is yes, all of those.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1283.484,
    "end": 1292.997,
    "text": "Maybe dozens of people perhaps can fit in a room and talk freely about some situation, some topic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1292.977,
    "end": 1299.173,
    "text": " and share rich information verbally or in other ways, face-to-face.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1300.267,
    "end": 1303.591,
    "text": " That might work with dozens, but it doesn't work so well with hundreds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1304.492,
    "end": 1307.356,
    "text": "And it certainly doesn't work so well with thousands or millions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1307.456,
    "end": 1322.995,
    "text": "So as I said a moment ago, Cogner has many potential use cases, but one that I'm really targeting is the large group setting where really, you know, hundreds to thousands or millions of people are involved in the group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1323.015,
    "end": 1328.822,
    "text": "And having said that, there's also use cases for just a single person using Cogner.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1328.971,
    "end": 1342.997,
    "text": " would be reasons why somebody might want to record their story in card now just for personal reasons to as a history for example to look back on later and reflect when and there's other reasons too that we'll talk about shortly",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1344.142,
    "end": 1357.874,
    "text": " So the question at hand is, what kind of online ecosystem would allow, say, 100,000 people to share some kind of rich, complex story, and particularly a dynamic story?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1358.035,
    "end": 1359.959,
    "text": "I'm a member of a group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1359.979,
    "end": 1361.543,
    "text": "We're sharing our stories.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1361.523,
    "end": 1376.908,
    "text": " I write down what my story is, I look at what you're writing, I look at your story and I go, I like that idea, I like that part of it or that seems really useful to me or I forgot, I should have mentioned that myself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1378.19,
    "end": 1382.637,
    "text": "By sharing stories, by sharing belief models,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1382.617,
    "end": 1401.064,
    "text": " we can come to um you know uh uh reach a you know better agreement our belief by sharing our belief models can start to um influence one another and and develop and the group then develops a shared belief model just to an extent",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1402.664,
    "end": 1418.698,
    "text": " um and then and then it's not just about cognar is not just about sharing uh uh stories it's about using them in some kind of uh to facilitate functional uh group cognition",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1418.678,
    "end": 1419.079,
    "text": " Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1419.219,
    "end": 1428.551,
    "text": "So you can imagine a group, a corporation, any kind of group, civic group, a city state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1429.793,
    "end": 1436.521,
    "text": "And the cognition for that group, you might say, is functional sometimes or really quite dysfunctional sometimes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1436.602,
    "end": 1442.109,
    "text": "So Cognar is aiming at facilitating functional group cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1442.189,
    "end": 1443.07,
    "text": "That's its purpose.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1445.253,
    "end": 1445.493,
    "text": "Next.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1445.874,
    "end": 1446.795,
    "text": "Next slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1449.847,
    "end": 1463.653,
    "text": " Okay, so we've talked about what a group is, and I've used the word cognition now many times, so maybe we should talk about what is cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1465.068,
    "end": 1471.137,
    "text": " In cognitive science, one might come up with various definitions of what is cognition?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1471.157,
    "end": 1471.838,
    "text": "How does it work?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1472.439,
    "end": 1473.26,
    "text": "What is its purpose?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1474.461,
    "end": 1486.579,
    "text": "So I'm relying quite heavily on the active inference framework for my definition of cognition and the way the Cognar system would work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1487.7,
    "end": 1492.948,
    "text": "But active inference is essentially a Bayesian description of cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1492.928,
    "end": 1500.639,
    "text": " It's a normative principle underwriting cognition in biological and artificial agents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1500.82,
    "end": 1506.408,
    "text": "In active inference, there's an intelligent agent and a world that the intelligent agent is acting in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1506.428,
    "end": 1509.933,
    "text": "Maybe there's even multiple intelligent agents acting in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1511.075,
    "end": 1515.962,
    "text": "An agent has an internal generative model about how the world works.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1517.244,
    "end": 1521.67,
    "text": "That is, given some conditions,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1521.65,
    "end": 1533.707,
    "text": " It sees that there's potential actions that could be taken and it sees that there's likely outcomes of various actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1534.689,
    "end": 1538.134,
    "text": "So an agent has a model of how the world works.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1538.174,
    "end": 1539.716,
    "text": "What will happen if I do A?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1541.218,
    "end": 1542.32,
    "text": "What will happen if I do B?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1542.82,
    "end": 1544.603,
    "text": "What will happen if I don't run from that lion?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1546.152,
    "end": 1558.724,
    "text": " And the agent and its world are separated, in a sense, statistically separated by what's called a Markov blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1559.465,
    "end": 1565.27,
    "text": "And that blanket consists of agent actions and agent observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1565.39,
    "end": 1568.934,
    "text": "So as an agent, I take some action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1569.534,
    "end": 1570.956,
    "text": "That action affects the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1571.436,
    "end": 1575.72,
    "text": "The world reacts in some way according to the world's generative process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1575.7,
    "end": 1579.324,
    "text": " And then things change, conditions change.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1580.325,
    "end": 1602.469,
    "text": "And as an agent, I perceive my world, but maybe it's dark and I don't perceive it very closely, or maybe it's loud and I don't hear it very accurately, or I get sensations from the world, but I'm not necessarily observing the actual state of the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1602.529,
    "end": 1605.252,
    "text": "I'm observing some kind of noisy representation of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1606.598,
    "end": 1615.467,
    "text": " So the Markov blanket, it's conditionally separates the world from the agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1617.269,
    "end": 1630.283,
    "text": "And Active Inference is the framework that I'm using to talk about cognition and not just cognition, how it works, but also what is the purpose of cognition?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1630.303,
    "end": 1633.507,
    "text": "What is functional cognition versus dysfunctional cognition?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1634.748,
    "end": 1635.829,
    "text": "Next slide, please.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1640.635,
    "end": 1642.859,
    "text": " So what is the purpose of cognition?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1642.939,
    "end": 1656.402,
    "text": "Well, from an active inference perspective, we can think of it simply as an idealized four-part cyclic process of I predict what will happen if I act.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1656.722,
    "end": 1660.669,
    "text": "I choose an action from my generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1660.649,
    "end": 1686.758,
    "text": " i i the world changes i sense whatever however the world has changed and i learn from processing those sense sense inputs for example uh suppose i'm a young boy and i'm learning how to catch a baseball right if i don't lift my arm high enough i maybe missed the ball so that happens a few times i i learn",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1686.738,
    "end": 1691.82,
    "text": " that i really need to lift my arm higher and if i want to catch that ball so uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1693.032,
    "end": 1701.26,
    "text": " So again, informally and simply, it's the cycle of predict, act, sense, and learn.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1702.121,
    "end": 1703.942,
    "text": "And an agent does this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1703.962,
    "end": 1716.715,
    "text": "It engages in cognition to reduce its uncertainty about whether it's going to achieve and maintain those conditions that it thinks will be good for it, that will help its thriving.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1717.395,
    "end": 1720.238,
    "text": "As a young boy learning how to catch a ball,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1720.471,
    "end": 1722.194,
    "text": " I want to catch the ball.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1722.394,
    "end": 1725.4,
    "text": "That will be good for me if I can learn how to catch a baseball.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1726.281,
    "end": 1730.709,
    "text": "And I want to reduce my uncertainty that I'm going to catch that ball.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1730.769,
    "end": 1737.822,
    "text": "I'm going to practice hard and I'm going to learn from my mistakes and I'm going to reduce the uncertainty that when I put my glove up, that ball is going to land on it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1739.287,
    "end": 1744.455,
    "text": " or I'm going to outsmart the lion and get away from danger when the lion appears.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1744.515,
    "end": 1756.294,
    "text": "So an agent favors those choices, those actions that are going to ensure the greatest resolution of uncertainty under the constraint that preferred outcomes are realized.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1756.735,
    "end": 1760.721,
    "text": "That's the way Friston phrases it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1760.701,
    "end": 1767.336,
    "text": " And so it's not just that I want to learn how to catch a ball or run from a line.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1767.356,
    "end": 1774.592,
    "text": "It's that I want to be sure or pretty sure that I can catch that ball or get out of the way of that line.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1775.922,
    "end": 1784.612,
    "text": " And from all this, I would say that active inference offers a potential description of functional versus dysfunctional cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1785.393,
    "end": 1798.327,
    "text": "If I have a pattern of making poor predictions and therefore acting in ways that are harmful to me, we could call that dysfunctional cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1798.508,
    "end": 1802.352,
    "text": "If I fail to remember what happened last,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1802.332,
    "end": 1812.603,
    "text": " or fail to remember how many times or the many ways that I missed the ball, that could be also called dysfunctional cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1813.163,
    "end": 1825.977,
    "text": "And cognition itself rests on many core functionalities like remembering and attention and communication and other processes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1825.957,
    "end": 1836.473,
    "text": " And any one of those or all of them together and any one individually could be functional or dysfunctional in some cognitive event.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1838.877,
    "end": 1839.498,
    "text": "Next slide, please.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1843.063,
    "end": 1850.074,
    "text": "So given all of that background, what is the Cognar ecosystem really?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1851.083,
    "end": 1857.972,
    "text": " I'm going to claim or offer that Cognar could be viewed as a cognitive architecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1858.713,
    "end": 1871.45,
    "text": "So every organism has some kind of, every organism cognates, whether it's an amoeba or a human, and cognition requires some sort of cognitive architecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1872.512,
    "end": 1880.803,
    "text": "For humans, we have a central nervous system, and we also have computers and external tools and things that can be thought of as part of that cognitive architecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1880.783,
    "end": 1888.517,
    "text": " And the cognitive architecture essentially integrates information and helps us coordinate our actions in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1889.599,
    "end": 1894.368,
    "text": "And it's the set of components by which and through which cognition occurs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1894.748,
    "end": 1903.905,
    "text": "And for a group that includes, a group has members, so it includes the cognitive architecture of the individual members.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1903.885,
    "end": 1932.373,
    "text": " but it also includes the this the set of norms that a group uses its rules its mechanisms and institutions its tools its sensors perhaps we're talking about a group that is a nation and it has sensors on air pollution you know something like that it's analytic processes its systems procedures all of which uh facilitate or guide cognition really make cognition possible",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1932.353,
    "end": 1938.844,
    "text": " And every part of a cognitive architecture can be functional or dysfunctional, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1938.904,
    "end": 1949.603,
    "text": "So for a group, say, maybe its rules, maybe it has certain rules that are either enhanced",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1950.089,
    "end": 1954.959,
    "text": " functional cognition or detract from functional cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1955.82,
    "end": 1962.113,
    "text": "So I view Cognar as a component of the cognitive architecture of the groups that are using it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1962.854,
    "end": 1967.984,
    "text": "And again, its purpose is to facilitate functional cognition versus dysfunctional cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1970.689,
    "end": 1971.13,
    "text": "Next slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1971.952,
    "end": 1972.553,
    "text": "Oh, Lee, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1975.925,
    "end": 1976.546,
    "text": " Yeah, hi, John.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1978.349,
    "end": 1992.432,
    "text": "Sorry, this is really interesting because, you know, based on the discussions we've been having, I'm kind of using the concept of cognitive architecture in some of the research that I'm doing in organizations at the minute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1992.412,
    "end": 1993.854,
    "text": " and tried to feed it back in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1994.055,
    "end": 2012.243,
    "text": "So if you take an organization like a public sector body or a commercial organization, would you consider that the structure of the processes are all part of the cognitive architecture of that particular entity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2013.877,
    "end": 2023.105,
    "text": " Well, I mean, I suppose, depending on how broadly you want to define an architecture, I suppose it could include just about every aspect of a group, you know, potentially.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2023.726,
    "end": 2043.563,
    "text": "But I think in a practical sense, you could probably focus on those components of group, you know, those mechanisms and structures of the group and its dynamics that would be particularly aimed at sensing really the four steps that I discussed just a minute ago.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2043.543,
    "end": 2049.334,
    "text": " taking action, learning, sensing the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2049.354,
    "end": 2064.842,
    "text": "I guess one of the reasons I ask is that one of the things that tends to... The context in organisation has an enormous influence in shaping people's behaviour.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2064.822,
    "end": 2094.795,
    "text": " but uh because there's a there's a general kind of widespread view that cognition is localized within people rather than a kind of uh you know an organismic view of it i guess where it's kind of distributed between people um in a hierarchical organization a lot of those factors if i mean i'm almost viewing it now as a generative model but there's no way that certain processes that determine behavior can actually be subject to change because they're not considered just part of the cognitive structure",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2094.775,
    "end": 2119.467,
    "text": " if you if you see what i mean so i think the idea that um you know that that um groups could view themselves as organisms is really interesting but currently there's kind of more of a mechanistic kind of view of of organizations and i think that potentially gets in the way anyway maybe this is a discussion for a for a different no no no no no it's actually good because i i i i",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2119.447,
    "end": 2140.037,
    "text": " i wanted to emphasize the importance of this view you know thinking of a group as an organism as a cognitive organism and thinking of decision making and those operations as aspects of group cognition so you know",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2141.435,
    "end": 2155.208,
    "text": " uh the world is kind of crazy in some ways politics are engaging for many people and this is just one example in the for a political entity but you know we we",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2156.504,
    "end": 2167.01,
    "text": " We rarely ask what a economic system is supposed to do, or what a governance system is supposed to do, or really what an organization is supposed to do, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2167.07,
    "end": 2173.686,
    "text": "So we're framing all of that now in terms of cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2173.666,
    "end": 2183.595,
    "text": " And we're framing it in such a way that it is amenable to scientific examination of whether this is functional or dysfunctional.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2184.876,
    "end": 2189.04,
    "text": "And from an active inference perspective, cognition has a purpose.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2189.701,
    "end": 2203.133,
    "text": "So then we can start talking about, is this organization, its structures, the way it's put together, its rules, its mechanisms, its institutions, is that functional?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2203.113,
    "end": 2214.372,
    "text": " yeah and and right and could it be improved like now that we know what we're after now that we have the problem you know the the issue and focus",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2214.925,
    "end": 2223.696,
    "text": " How could we improve the cognition of... I can just give you a tiny little vignette.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2223.756,
    "end": 2227.8,
    "text": "So in this particular organization, they have a performance management system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2227.861,
    "end": 2236.231,
    "text": "So if you were to take the view of functional cognition, you'd go, what's the purpose of the performance management system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2236.251,
    "end": 2241.557,
    "text": "Well, it's there to motivate employees, reward them, make them feel excited about their work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2241.537,
    "end": 2242.819,
    "text": " But it doesn't do any of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2242.88,
    "end": 2249.152,
    "text": "What it actually does is it demoralizes them, annoys them, gets in their way and just generally pisses them off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2249.172,
    "end": 2251.336,
    "text": "I mean, it's actually doing the opposite of what's intended.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2251.376,
    "end": 2254.963,
    "text": "If you take the whole system out, the organization would be better off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2255.423,
    "end": 2259.411,
    "text": "But it's not subject to any prediction error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2259.391,
    "end": 2264.336,
    "text": " signal because it can't be defined in terms of, you know, purpose and outcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2264.396,
    "end": 2273.245,
    "text": "So it's a completely dysfunctional system that's just stuck there that you can't take out and nobody, you know, nobody has a view on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2273.345,
    "end": 2276.068,
    "text": "It's really weird, but I think would really get to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2276.529,
    "end": 2278.671,
    "text": "But anyway, sorry to interrupt.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2278.791,
    "end": 2280.112,
    "text": "No, no, no, no, no, it's good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2280.152,
    "end": 2280.473,
    "text": "It's good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2281.273,
    "end": 2285.998,
    "text": "I just want to emphasize again, that this is a, in a sense, it's a change in worldview.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2286.178,
    "end": 2287.66,
    "text": "It's a it's this is a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2288.737,
    "end": 2308.298,
    "text": " comprehensive and potentially very useful way to con to understand what a group is whether that group is a small informal group or a large formal group and and and then to assess you know how well it's doing and how could how could we how could it do better",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2309.493,
    "end": 2322.188,
    "text": " Right, so that's the question for Cognar that I raised just a minute ago is like, okay, given the setup, given our goals, given the purpose of Cognar, so how should Cognar be designed?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2322.348,
    "end": 2327.254,
    "text": "You know, like, how should it be designed to do what we're saying it should do?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2327.574,
    "end": 2330.758,
    "text": "You know, that's the question here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2331.768,
    "end": 2342.217,
    "text": " But anyway, getting back to where we were at in the slides, Cognar is, I would say Cognar is a part of the cognitive architecture of the group that's using it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2343.701,
    "end": 2344.022,
    "text": "Next slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2348.828,
    "end": 2361.733,
    "text": " So actually, this slide speaks, Lee, to some of the things that you were raising there and speaks to some of the things that I just mentioned.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2362.415,
    "end": 2367.124,
    "text": "But so consider a society as a group, say a nation as a group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2368.488,
    "end": 2388.522,
    "text": " Again, a group that is an organism performing cognition for some purpose, and that purpose obviously for any organism is to thrive, to maintain viability, to do well, to live, to pass on information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2388.772,
    "end": 2413.699,
    "text": " in the i i wrote a series of uh of three papers a couple of years ago in 2020 and 21 2021 and i think maybe there's i don't know daniel four guest streams for that series i think three or four or something like that that are in the archives so i encourage viewers to check those out too um and that series of three papers",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2413.679,
    "end": 2441.813,
    "text": " again looked at cognitive architecture only in this case it looked at uh societal systems as the cognitive architecture of a society so by core societal systems i mean for example economic systems financial systems governance systems legal systems educational systems you know these constitute a considerable",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2441.793,
    "end": 2463.177,
    "text": " aspect of the cognitive architecture for society we use these systems to sense the world to think to make decisions to allocate resources to take a variety of actions uh that that hopefully actions that better the you know the nation at hand",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2464.726,
    "end": 2491.678,
    "text": " so um societies around the world the nations around the world have i should really say nations around the world have some kind of the core societal systems say economic systems that have some kind of particular design to them for financial system has a particular design but the question i raise in this paper is in the series of papers is out of all conceivable designs",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2492.907,
    "end": 2517.244,
    "text": " know the existing designs or completely new designs which which of them might be most fit for this purpose of group cognition which of these might best serve the common good and and obviously making good decisions that you know favor the vitality and well-being of a nation is serving the common good",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2517.224,
    "end": 2536.954,
    "text": " so out of any conceivable design or economic systems you know what is money for example is there some other way to think about money or some other alternative to money or how do votes happen or you know like any aspect of a core societal system",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2538.976,
    "end": 2551.075,
    "text": " one could imagine many conceivable variations on a theme or just completely new designs, new ways of looking at what an economic system is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2551.696,
    "end": 2563.093,
    "text": "And from this umbrella of considering all of these systems as part of a cognitive architecture, then one can ask,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2563.073,
    "end": 2583.276,
    "text": " you know, really what designs are fit for purpose and how do we, of course, how do we measure fitness and, you know, what kind of information goes into assessing the fitness of some system, but it opens the door for a science-based design of the systems by which societies live under.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2583.256,
    "end": 2612.419,
    "text": " and that is not the way that is not the you know our current system economic system financial systems governance systems they were not you know developed through some kind of science-based process they were they kind of evolved through social social pressures and social conditions and you know ideas from individuals but we could revisit all of that um and and ask the question you know",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2613.175,
    "end": 2617.081,
    "text": " What designs actually would serve us best?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2618.002,
    "end": 2637.09,
    "text": "And in this series, I propose an R&D program to really address that very question, not just as an academic exercise of let's write some interesting papers about how governance systems could be redesigned,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2637.07,
    "end": 2644.322,
    "text": " The idea in this series is, what kind of designs would potentially be most useful?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2644.683,
    "end": 2657.425,
    "text": "And then how do you test them, actually practically test them, implement them, use them, gain information from the experience of using them and learn from them?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2657.405,
    "end": 2678.383,
    "text": " how how how could that happen how could that actually be done how could some kind of transformation you know i call it transformation in the series but how could some kind of transformational step like that occur and be viable and practical so in the in the series i offer you know what i think is one path towards that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2679.46,
    "end": 2686.33,
    "text": " But this current series of two papers that we're discussing today, it's an extension of the same idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2686.75,
    "end": 2697.605,
    "text": "It's, again, looking at the cognitive architecture of a group and asking the question, in this case for Cognar, what kind of design of Cognar could best help group cognition?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2698.907,
    "end": 2705.356,
    "text": "And how could Cognar be used by groups to help them perform better cognition?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2706.758,
    "end": 2707.459,
    "text": "Next slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2711.641,
    "end": 2716.327,
    "text": " Now that I've said next slide, but there's just one more thing I want to say about the last slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2717.088,
    "end": 2739.555,
    "text": "As I was about to say a few minutes ago, lots of people are interested in politics and what a government should do, and they have ideas for maybe somebody thinks that term limits for judges or for politicians should be limited, that that would be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2739.535,
    "end": 2764.092,
    "text": " that might be a solution to some of our problems or you know there's all kinds of of proposals floating around for how to improve economic systems or governance systems or you know any any of the course societal systems and and even say corporations do the same thing you know they wonder how could we improve our communications and all that kind of stuff",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2765.152,
    "end": 2779.583,
    "text": " But this concept, this really powerful approach of viewing systems as a cognitive architecture allows those questions to become, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2781.217,
    "end": 2791.806,
    "text": " meatier in a way, more relevant, with a greater high-level understanding of what that system is actually supposed to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2791.826,
    "end": 2809.502,
    "text": "So I believe that by viewing the societal systems of a society as a cognitive architecture and looking at groups as small or large groups as organisms that perform cognition,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2810.14,
    "end": 2829.584,
    "text": " I think that opens up all kinds of doors and avenues for investigation into what kinds of designs, what kinds of rules and approaches and methods and tools might actually help groups perform better cognition and better solve their problems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2830.646,
    "end": 2831.727,
    "text": "Okay, next slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2834.997,
    "end": 2839.865,
    "text": " So everything we've talked about so far has just been sort of high level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2839.905,
    "end": 2840.626,
    "text": "What is Cognar?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2840.666,
    "end": 2841.167,
    "text": "What does it do?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2841.207,
    "end": 2841.968,
    "text": "What is its purpose?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2842.609,
    "end": 2850.863,
    "text": "But this slide really gets more to the question of how does Cognar work under the hood.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2850.843,
    "end": 2859.24,
    "text": " So I've already said that I use the word story, but I don't mean story in the regular sort of written narrative sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2860.082,
    "end": 2869.662,
    "text": "A user creates a story, and it creates a story perhaps by speaking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2869.642,
    "end": 2875.957,
    "text": " In one version of Cognar, maybe a user speaks the story and the system hears it and understands it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2875.977,
    "end": 2885.119,
    "text": "But maybe the first version of Cognar would be somebody, the user inputs a story kind of passage by passage, you know, sentence by sentence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2886.449,
    "end": 2901.551,
    "text": " And the system takes that input, those little passages and other metadata associated with passages, and constructs a fragment of a story.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2901.591,
    "end": 2908.661,
    "text": "And that story is represented as a graph.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2908.681,
    "end": 2914.009,
    "text": "So its internal meaning representation is actually called a story graph.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2915.305,
    "end": 2932.453,
    "text": " And that story graph, the reason that it's not stored in just regular English text or some other language is that this representation is more amenable to computation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2932.433,
    "end": 2937.041,
    "text": " and could be better understood in the large group setting in that sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2937.381,
    "end": 2938.624,
    "text": "There's other reasons too we'll get to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2939.385,
    "end": 2955.893,
    "text": "But the important thing for this slide is that actually what the user is creating is something that resembles a graph, a graph of how little elements of the story are related.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2957.02,
    "end": 2960.786,
    "text": " And story graphs are really the core innovation on which Cognar is based.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2960.866,
    "end": 2970.52,
    "text": "And that representation allows Cognar to curate, understand, reason with, perform inference for stories.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2970.821,
    "end": 2974.746,
    "text": "And these stories then represent really high quality information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2976.93,
    "end": 2981.176,
    "text": "Much of the vagueness of natural language is eliminated in this way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2982.178,
    "end": 2985.863,
    "text": "Not all the vagueness, but some of the vagueness is eliminated in this way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2986.94,
    "end": 2993.793,
    "text": " So at the top of this little graph, you can see that a user types in, for example, text passages.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2994.354,
    "end": 3000.827,
    "text": "Those are translated by the system into what I call a story graph fragment, just a small little graph for that passage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3001.488,
    "end": 3007.48,
    "text": "And that story graph fragment is then merged with the growing larger story graph.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3007.46,
    "end": 3014.729,
    "text": " And once it's complete, the complete story graph can then be translated and used in various ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3015.17,
    "end": 3021.999,
    "text": "It could be translated back into natural language so that potentially a user could listen to their story back.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3022.019,
    "end": 3028.888,
    "text": "Like, you know, I typed in my story about, you know, what should happen for this particular situation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3029.809,
    "end": 3034.395,
    "text": "And I could ask the system to replay that back to me and hear it perhaps.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3035.472,
    "end": 3045.011,
    "text": " The story graph can also be translated or used as input into a variety of inference models, so probabilistic, logical, or other kinds of models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3045.773,
    "end": 3053.228,
    "text": "And maybe it could be translated into alternative meaning representations that would be useful in certain kinds of inference models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3054.457,
    "end": 3066.75,
    "text": " So that's what happens under the hood you're constructing a story graph and you can view the user can view aspects of that graph as it's constructed to verify that the system actually understood correctly what i'm trying to say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3066.79,
    "end": 3069.698,
    "text": "Next slide please.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3072.125,
    "end": 3075.149,
    "text": " Oh, well, fine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3075.209,
    "end": 3075.73,
    "text": "This is good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3076.571,
    "end": 3084.542,
    "text": "So this is an example of a meaning representation, a very common meaning representation called the abstract meaning representation for a particular sentence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3085.383,
    "end": 3093.674,
    "text": "Sentences, a similar technique is almost impossible to apply to other crops, such as cotton, soybeans, and rice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3094.195,
    "end": 3099.482,
    "text": "So you can see that this sentence, the representation is structured.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3099.462,
    "end": 3112.059,
    "text": " There's rules for how the representation is constructed and there's a structure to it and certain links, arrows, lines between nodes have a given meaning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3112.119,
    "end": 3124.255,
    "text": "And I have this slide in the paper and here, just really, just as an example of what I would call a relatively simple",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3124.235,
    "end": 3127.462,
    "text": " meaning representation might look like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3127.923,
    "end": 3136.661,
    "text": "So the Cognar meaning representation is going to be like this, only far more sophisticated in many ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3136.761,
    "end": 3141.771,
    "text": "So just as one example, anticipation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3141.751,
    "end": 3168.973,
    "text": " and predictions are an important very important part of cognition as we've already discussed and the meaning representation has to be you know sophisticated enough to handle the predictions of a story of a belief system like if the uh if if the topic at hand is uh immigration um i have a beliefs about you know what kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3168.953,
    "end": 3188.7,
    "text": " rules the immigration authorities should have and how it should be done and you know build a wall or don't build a wall it's just one of the topics of the conversation in the in the papers these days um um but for my story uh there would be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3189.102,
    "end": 3193.368,
    "text": " naturally would be anticipations and predictions related.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3193.428,
    "end": 3200.117,
    "text": "Like, if we build a wall, then it will have such and such an effect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3200.158,
    "end": 3202.601,
    "text": "If we don't build a wall, it'll have such and such an effect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3202.641,
    "end": 3206.306,
    "text": "If we allow freer immigration, it'll have such and such an effect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3206.326,
    "end": 3212.595,
    "text": "These are all anticipations, predictions, and the meaning representation has to be sophisticated enough to handle all of those.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3212.575,
    "end": 3235.123,
    "text": " and they're not just and they're not just um predictions they're probabilistic predictions no one knows what's going to happen in the future so all of those kinds of statements are are probabilistic so even even you know it has to be even more the meaning representation has to be sophisticated enough to handle probabilistic uh predictions about you know what a story means and what might happen next",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3236.167,
    "end": 3244.265,
    "text": " So this is a very simple graphical version just to give you the user a very, very high level rough idea of what's going on under the hood.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3244.826,
    "end": 3250.178,
    "text": "But in actuality, the Cognar meaning representation would be much more sophisticated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3251.08,
    "end": 3251.661,
    "text": "Next slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3255.235,
    "end": 3258.059,
    "text": " So what is the purpose of the story graph?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3258.079,
    "end": 3265.47,
    "text": "Some of this I've mentioned already, but it represents a story in a format that is less ambiguous than natural language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3265.65,
    "end": 3267.573,
    "text": "Natural language can be very ambiguous.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3269.115,
    "end": 3274.683,
    "text": "The story graph is meant to be readable and understandable both by humans and computers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3274.763,
    "end": 3279.91,
    "text": "So a human can look at a story graph or pieces of a story graph, views of a story graph,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3279.89,
    "end": 3285.919,
    "text": " and verify that the system understood the story correctly, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3286.36,
    "end": 3298.118,
    "text": "But computers then can also read and process the stories and then perform analytics and inference and do the many things that the back end, the computational system has to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3299.296,
    "end": 3319.178,
    "text": " The stories obviously then provide a structure for inference and analysis, and they also serve as a natural language independent representation that's suitable for translations into other languages or uses inputs to analytical models or other things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3320.525,
    "end": 3321.908,
    "text": " So that's what a story graph should do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3321.948,
    "end": 3328.82,
    "text": "And then one of the questions is, well, what does the Cognar story graph, you know, what is its design?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3329.061,
    "end": 3332.326,
    "text": "You know, what are the specifics of its design?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3332.867,
    "end": 3338.758,
    "text": "And that is a topic that I raise in the second paper that we'll talk about a little bit in the next guest room.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3339.9,
    "end": 3340.862,
    "text": "Next slide, please.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3345.466,
    "end": 3371.018,
    "text": " so um we've talked about stories and i've said a little bit about what they are but let's maybe recap that just a bit so you know a user has some story in their head about a situation some you know issuer problem in the world and and the user has an internal belief model about how the world works relative to that situation or problem and a story is a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3371.588,
    "end": 3377.622,
    "text": " is an externalization of that belief model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3377.862,
    "end": 3381.17,
    "text": "And it potentially is a dynamic externalization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3381.43,
    "end": 3387.825,
    "text": "It can change as the user sees other stories or reads what other people think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3388.801,
    "end": 3395.974,
    "text": " So it externalizes a user's belief system and makes it shareable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3396.174,
    "end": 3401.984,
    "text": "You know, that's the purpose of Cognar is to share these belief models with other members of the group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3403.046,
    "end": 3406.793,
    "text": "So again, the story conveys a user's beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3406.773,
    "end": 3410.382,
    "text": " And the emphasis here is on beliefs, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3410.422,
    "end": 3422.993,
    "text": "Because the computational system is not going to predict what's going to happen in real life if the group takes actions A versus action B, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3422.973,
    "end": 3447.411,
    "text": " uh and it's not gonna the system is not gonna verify that somebody's story is ac is accurate is realistic or or is practical for the situation at hand those are those are assessments that the group of users has to do you know together and the system helps that process but it doesn't perform those kinds of uh assessments",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3447.391,
    "end": 3467.644,
    "text": " so so the system the system doesn't have to know the rules of gravity or you know newtonian mechanics or it doesn't have to predict what's going to happen in the world it re all the system needs to do is to capture a user's belief model and to communicate that model with others and to help",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3467.624,
    "end": 3493.648,
    "text": " and others help the group understand that model and how it compares to other models and um what elements are in it and you know what is its time span and you know what it what is what what is this you know what are the characteristics of this user's belief system and and what is the user predicting will happen so it's it's the story just captures the user's beliefs right and then the group",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3494.455,
    "end": 3515.687,
    "text": " shares and acts in some way on those beliefs so so that's it the the system helps a group to understand what its members believe that's that's really the core of this and then those by sharing those beliefs users can influence one another perhaps you know like in a decision-making setting next slide please",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3519.751,
    "end": 3520.093,
    "text": " All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3520.193,
    "end": 3528.394,
    "text": "So, uh, so we've talked about what a story is, how it's representative and under the hood, what is PR what the purpose of Cogner is, what the purpose of a story is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3528.88,
    "end": 3534.13,
    "text": " And now we can talk about how this cognitive system might be actually used.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3534.15,
    "end": 3543.548,
    "text": "And I've said that the emphasis is on, you know, the cognition in the large group setting and particularly for things like decision-making and collaboration and things like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3543.648,
    "end": 3551.563,
    "text": "But in actuality, there's a very wide span of use cases that are possible with this kind of ecosystem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3553.028,
    "end": 3559.239,
    "text": " And I'll cover just a few possibilities, but this is a non-exhaustive list.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3559.279,
    "end": 3560.862,
    "text": "There's many, many possibilities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3561.463,
    "end": 3569.257,
    "text": "And the communications in its different uses, maybe there's an app developed for each particular kind of use.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3569.898,
    "end": 3572.623,
    "text": "So maybe there's many apps that are part of the ecosystem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3572.603,
    "end": 3584.438,
    "text": " But the sort of events, I call it a group, a group defines an event and then invites people to participate in the event.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3584.478,
    "end": 3599.657,
    "text": "So for example, a city might, if a city is using the system, it might define a group event to solve some particular issue, maybe a trash issue or a recycling issue or a road issue or some other issue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3599.637,
    "end": 3613.888,
    "text": " And the group would define the topic for the event and the purpose of the event and the rules for the event and the methods for the event and how decisions were made and, you know, the setup for how this event is going to unfold.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3614.609,
    "end": 3618.658,
    "text": "And then it asks for group input through storygraphs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3619.786,
    "end": 3631.04,
    "text": " So depending on the event and the group and the purpose of the event, the communications can be many to many as in, you know, collaborative decision-making, for example, that could be many to one or even one to many.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3631.52,
    "end": 3645.017,
    "text": "So, uh, and, and, and, and I've been emphasizing group use, but again, uh, an individual might use this just for their own personal use, just to record their, their understandings of the world at a certain time, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3646.263,
    "end": 3666.06,
    "text": " So some possible use cases are in decision making, such as by a corporation or a city, maybe customer service, emergency reports, public polling, instructions for how to put together bookshelves or instructions for how to run a machine, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3666.04,
    "end": 3686.749,
    "text": " uh system descriptions of you know what what is what is this system and how does it work or maybe there's a whole variety of educational uh use cases also and uh later versions of cognitive could be could include things like role playing or game playing like uh intentional games uh purposeful games",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3686.729,
    "end": 3715.622,
    "text": " and strategizing what what what here's here's my belief system of the world relative to the situation and uh you know the people involved in this story or the characters involved in this story are you know so and so and so and so and so and so and what would happen if i if i take action a you know what's likely to be the outcome what is what does player b gonna likely to do if i take action a so later more sophisticated versions of cogner might include that kind of stuff where",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3715.602,
    "end": 3726.368,
    "text": " a user might play against the system or two systems in a sense might play against each other to strategize for some situation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3728.192,
    "end": 3728.633,
    "text": "Next, please.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3732.646,
    "end": 3738.663,
    "text": " So the next couple of slides are just a few examples that I have in the paper for use cases.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3738.783,
    "end": 3740.227,
    "text": "So I'll cover them briefly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3740.267,
    "end": 3747.668,
    "text": "So I have written at the top of these slides some text.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3747.648,
    "end": 3754.94,
    "text": " And this isn't actually the text that somebody would write in the real Cognar.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3754.98,
    "end": 3760.369,
    "text": "This is just a snippet, an example snippet of the kind of information that a user might want to convey.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3760.409,
    "end": 3771.006,
    "text": "So this user, there's an issue, some issue X, and this person believes that in order to address that, we should first address it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3770.986,
    "end": 3792.083,
    "text": " issue y that caused x and y started when you know it's when such and such happened and it had the effect of such and such and this person believes that if we don't solve issue y then some event a someone wanted event a is likely to occur maybe within a few months and then x the original issue is going to be impossible to solve",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3793.48,
    "end": 3811.573,
    "text": " so if that if a happens then you know there's going to be all these effects maybe you know and there's some this this in this story there's some kind of uh you know 20 value put on the risk of this or the or the outcome of this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3811.553,
    "end": 3824.938,
    "text": " and uh this user says a possible solution to this this problem why is to do you know such and such and it's conditional so do such and such if event b occurs and such and such if event c occurs",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3826.1,
    "end": 3831.905,
    "text": " So there's some kind of complicated story, conditional story involved here that has predictions in it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3834.007,
    "end": 3837.25,
    "text": "There's some shoulds in it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3837.31,
    "end": 3838.271,
    "text": "We should do this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3838.652,
    "end": 3844.177,
    "text": "And how does all that work for the decision-making case?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3844.817,
    "end": 3855.347,
    "text": "Well, I believe what would be a common setup for the decision-making case is a group forms or comes together for an event.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3855.327,
    "end": 3859.003,
    "text": " and individuals create their story.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3859.023,
    "end": 3861.895,
    "text": "That's kind of at the top of this diagram.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3863.14,
    "end": 3867.726,
    "text": " They create their story and then submit their story.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3867.866,
    "end": 3876.958,
    "text": "And the system, the middle block there, the system does its assessments and computations and the various things that the system is going to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3877.018,
    "end": 3886.009,
    "text": "And then it reports back to the group about the range of stories that have been submitted and what they include and who they involve and what",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3885.989,
    "end": 3896.624,
    "text": " kinds of solutions have been proposed and various kinds of summaries and details about the set of stories that have been involved.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3896.744,
    "end": 3908.2,
    "text": "And then the group digests that information and looks at individuals, can look at the stories of other individuals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3908.18,
    "end": 3913.065,
    "text": " so users can kind of take in what the group is saying.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3913.105,
    "end": 3920.112,
    "text": "And maybe a user thinks, oh, that's, you know, Bob had something really interesting to say there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3920.993,
    "end": 3923.155,
    "text": "You know, I should really include that as part of my story.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3923.175,
    "end": 3924.456,
    "text": "That was a good idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3924.496,
    "end": 3926.298,
    "text": "I didn't include it, so I should include it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3926.338,
    "end": 3934.086,
    "text": "So the next step is this process cycles in a series of rounds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3934.066,
    "end": 3958.217,
    "text": " and at the end of each round there's a kind of a dialogue and digestion phase where everyone looks at what's been done and gets a better idea of what the group is thinking and maybe they adjust their their story uh you know accordingly and hopefully over time over a series of rounds the a proposed solution that the group favors starts to become clear",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3959.125,
    "end": 3979.511,
    "text": " And then this process can end when it's sufficiently clear and there's enough agreement that we understand each other, we think we understand the situation, and we think as a group that this solution or this set of solutions might be the best actions to take.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3981.634,
    "end": 3985.939,
    "text": "So that's group decision-making might occur over a series of rounds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3987.581,
    "end": 3988.002,
    "text": "Next slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3991.458,
    "end": 3994.342,
    "text": " Here's an example use case for emergency reports.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3994.402,
    "end": 3999.128,
    "text": "This is a person who wants to report that they just witnessed an accident.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3999.969,
    "end": 4003.233,
    "text": "There's an accident with some kind of truck of some kind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4004.255,
    "end": 4006.157,
    "text": "Maybe it was going too fast.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4006.237,
    "end": 4008.06,
    "text": "Maybe it was because of the wet conditions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4008.941,
    "end": 4010.403,
    "text": "It shouldn't have been going so fast.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4011.584,
    "end": 4013.747,
    "text": "Lots of accidents like side information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4013.767,
    "end": 4015.43,
    "text": "There's been many accidents at that corner.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4015.57,
    "end": 4016.571,
    "text": "So maybe that,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4016.551,
    "end": 4021.461,
    "text": " Maybe the local conditions have something to do with this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4021.481,
    "end": 4030.759,
    "text": "But anyway, the truck had a telephone pole, and now there's sparks in the grass, and there's a school, and children are playing outdoors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4031.821,
    "end": 4034.646,
    "text": "All of this is a little unclear to me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4034.686,
    "end": 4038.694,
    "text": "I'm about a block away, but that's what I see, and I report it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4038.674,
    "end": 4063.045,
    "text": " so you know there's a there's an interesting story and you could imagine even a more complex story of someone that wants to report something maybe they want to report a crime for example or in this case an emergency report and there's also there's various kinds of inference that has to happen like under the hood for this right like if you read the the sentences that i that i wrote there i never say that a wire",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4065.067,
    "end": 4085.742,
    "text": " uh fell from the lines and is now on the grass that's sort of inferred right so there's various things that the that the the system has to infer about the story in order to make sense of it and i say that there's you know this user is saying that there's children present but the implication is is that there's a danger to those children",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4085.722,
    "end": 4086.323,
    "text": " Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4086.364,
    "end": 4092.459,
    "text": "So there's actually a forecast, like a prediction, like if we don't do something, someone might get hurt.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4092.759,
    "end": 4097.571,
    "text": "These children might be harmed because of the aftermath of this accident.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4098.985,
    "end": 4116.066,
    "text": " This little story is a lot different than, for example, calling a hotline and the hotline instructs you to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4116.046,
    "end": 4122.34,
    "text": " press one if there's a fire, press two if there's something else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4122.741,
    "end": 4132.283,
    "text": "And then if you press one for a fire, it says, press one if the fire is in your house, press two if whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4133.613,
    "end": 4143.934,
    "text": " There are other computational systems out in the world that seek to address, seek to gather this kind of information for the purpose of making an emergency report.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4143.994,
    "end": 4152.972,
    "text": "But I'm claiming that out of all the kinds of systems that I know of, the Cognar system",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4152.952,
    "end": 4176.641,
    "text": " much more functional and has the capacity to convey a much richer story, understanding of someone's understanding about a situation and perform inference on it and record as a history the story and how it evolved and many other things that the computational system does, offers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4178.183,
    "end": 4180.005,
    "text": "Next slide, please.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4182.989,
    "end": 4186.415,
    "text": " This is an example for a customer service.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4186.435,
    "end": 4193.086,
    "text": "This is an example of a many to one sort of communication, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4193.146,
    "end": 4205.908,
    "text": "In the sense of many customers are communicating with one agent, one central agent, which is the corporation in this case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4205.888,
    "end": 4222.328,
    "text": " So people are writing in and they're sending in their broken parts and they're giving a description of why this part worked or is this part defective or why was this...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4222.308,
    "end": 4245.97,
    "text": " why was this aspect of the part designs seemingly so poorly or could you fix this design or you know like here's what here's what's here's where it's broken this this part here this this part f has a leak in it and it causes this other part to h to slip you know some kind of sliding mechanism to slip and uh and you know seems to me that part was",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4245.95,
    "end": 4275.113,
    "text": " it wasn't really broken it's just that it didn't really fit so it was that by design or is this part defective or you know is what's what's what's going on here with this so you know this is rich information that a that a corporation might receive about uh its products from users and uh you know much more useful than say just a you know a couple of sentences written in natural language or maybe a paragraph written in natural language because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4275.093,
    "end": 4294.302,
    "text": " you know, the corporation could use this to really assess, you know, really analyze closely what's going on and how many times this has happened and how many times have people complained that that part was too thin and, you know, all that kind of stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4294.922,
    "end": 4301.913,
    "text": "So there's an example of a many to one sort of communication scheme.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4302.694,
    "end": 4303.395,
    "text": "Next slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4307.678,
    "end": 4310.122,
    "text": " This is also an example of a many to one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4310.563,
    "end": 4320.158,
    "text": "So, you know, lots of political things happening in the world right now, elections and so on, and lots of polling going on too for the different elections.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4320.939,
    "end": 4325.606,
    "text": "And, you know, typically in polls, you might be asked a yes or no question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4325.807,
    "end": 4328.05,
    "text": "You know, do you agree with the statement, yes or no?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4328.03,
    "end": 4333.075,
    "text": " Or maybe you have a short multiple choice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4333.115,
    "end": 4341.863,
    "text": "Yes, I agree strongly, or no, I disagree strongly, or I can rate my agreement on a scale of one to five, or something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4342.403,
    "end": 4355.455,
    "text": "But that is not near as rich as intaking what the user actually has to say, what they think are the important aspects to the question that's being pulled about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4355.435,
    "end": 4376.397,
    "text": " In this case, the user is, there's a poll for some candidate and this user is saying, you know, I thought her past decisions on certain issues are terrible and I've been fuming about them and I don't trust her on this issue because of such and such statement and I don't even think she's sincere on that issue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4376.377,
    "end": 4382.809,
    "text": " But anyways, that issue could be solved by some other much simpler process, which I mentioned here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4382.849,
    "end": 4385.493,
    "text": "And I don't think I'm gonna vote for her.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4386.235,
    "end": 4387.978,
    "text": "So this is rich information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4388.018,
    "end": 4394.149,
    "text": "And again, there's inference that has to go on behind the scenes with the system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4394.129,
    "end": 4418.415,
    "text": " uh for example the word fuming you know that has various meanings uh does it mean that the person the writer is on fire no not in this case you know it means that they're angry so a lot of the various definitions of the word fuming the system has to figure out what definition is the user aiming for here um next slide",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4419.374,
    "end": 4420.996,
    "text": " And then I think we're done with the next slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4422.278,
    "end": 4424.462,
    "text": "We've come to the end of our talk.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4424.802,
    "end": 4426.965,
    "text": "So what is next for this project?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4427.847,
    "end": 4431.292,
    "text": "I've already mentioned that Cogner is in the incubation phase.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4431.432,
    "end": 4438.142,
    "text": "And I put out the vision in these two papers, the vision for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4438.122,
    "end": 4462.341,
    "text": " really it's a big project it touches on many aspects of science computational science complex system science all kinds of different sciences that touches on and this is all beyond my capacity as one person to create so if this project is going to move forward it will need your help whether you're a scientist or you're",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4462.321,
    "end": 4477.545,
    "text": " uh belong to a civic organization or you're just an interested citizen or whatever there's there's there's some way that uh just about anyone could be involved in this especially as it picks up steam and and moves starts to move forward",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4477.525,
    "end": 4481.295,
    "text": " There's many, many interesting questions to address.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4481.416,
    "end": 4488.455,
    "text": "I raised a few future research questions in the papers, but there's many, many more that could be imagined.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4489.137,
    "end": 4493.509,
    "text": "And I encourage people to reach out to me if they have interest in this project.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4493.489,
    "end": 4496.917,
    "text": " Upcoming, there's the guest stream on September 10th.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4496.957,
    "end": 4498.34,
    "text": "That's next Tuesday.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4499.382,
    "end": 4505.736,
    "text": "And I believe I'll be starting a Cognar project at the Active Inference Institute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4506.698,
    "end": 4510.266,
    "text": "People can get involved that way and get involved with the Institute that way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4510.246,
    "end": 4513.51,
    "text": " And there should be some additional talks coming up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4513.53,
    "end": 4523.504,
    "text": "There's an active inference symposium coming up that I think I'll present at, and there's a few other talks I'll be giving to private groups and such.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4524.185,
    "end": 4534.819,
    "text": "So again, please reach out to me if you have interest in this and show up next time for the guest stream on September 10th, and we'll continue the discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4536.841,
    "end": 4555.204,
    "text": " awesome thank you john i will read some of the questions from log chat upcycle club wrote is group cohesion one of the goals of cognar um so good question and and you know the the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4556.197,
    "end": 4580.702,
    "text": " in any kind of group there may be very different opinions of what should happen and um there may be lots of friction in that group right so um it's not that kagnar is is necessarily going to solve all kinds of friction problems and get everybody on the same page for every setting you know that would that's not the way the world works right but but what it what kagnar does do",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4580.682,
    "end": 4610.689,
    "text": " is a sets up a process and a means and a mechanism by which people can share their stories and perhaps come to some agreement uh shared understanding you know share that share their way they see the world and maybe the group will come to some kind of shared understanding if the purpose is decision making you know that's kind of the context here so um hopefully a group will come to some kind of uh agreement but but but even if they don't cognar can",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4610.669,
    "end": 4635.31,
    "text": " Cogner has a record of the stories and of the differences in stories and maybe there's really kind of two subsets in this group or three or four subsets in this group and and each subset views the situation in a very different way well at the very least Cogner is going to help the group to understand that there's you know different ways to look at this problem and different proposed solutions and it's going to record",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4635.29,
    "end": 4664.723,
    "text": " the the the evolving stories that are related to the to this you know like how they how a particular story started and what it what it grew to become over the course of cognition and um so you know maybe that maybe the group will actually come to a well uh you know widely accepted uh decision on some topic or maybe it won't but at least it's going to have a functional process to you know to to go through to to understand itself right",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4664.703,
    "end": 4691.335,
    "text": " so that's the that's the that's the hopefully yes and but you know that what happens the dynamics depends on what the group is and what the topic is thank you all right next question from abbas tollgate who wrote two questions one how does kognar maintain consistency in story graph updates when passages are the single source of record",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4693.39,
    "end": 4700.24,
    "text": " Second question, how are changes propagated across the story graph and associated models without conflicts?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4702.684,
    "end": 4710.575,
    "text": "Can you flip back in the slides to the process of creating the story?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4711.877,
    "end": 4713.219,
    "text": "It's kind of far back.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4714.421,
    "end": 4715.042,
    "text": "Is that one more?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4715.342,
    "end": 4716.584,
    "text": "Yeah, there we go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4716.604,
    "end": 4716.925,
    "text": "This one?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4717.245,
    "end": 4718.888,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4719.048,
    "end": 4720.149,
    "text": "There you go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4720.169,
    "end": 4720.71,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4721.171,
    "end": 4721.271,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4722.382,
    "end": 4723.719,
    "text": " So,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4725.115,
    "end": 4728.72,
    "text": " One could imagine, you know, we're thinking about how should Cognar be designed?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4728.74,
    "end": 4729.661,
    "text": "You know, how should it work?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4729.681,
    "end": 4731.103,
    "text": "You know, what should it do?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4732.125,
    "end": 4747.185,
    "text": "And, you know, one could imagine a user could input text, type in something, and then that text becomes a story graph fragment here, and then the story graph fragment becomes a story graph.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4747.846,
    "end": 4752.593,
    "text": "And then maybe the user realizes, oh, I didn't mean that, or I didn't make that clear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4752.633,
    "end": 4753.654,
    "text": "I want to add something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4753.634,
    "end": 4757.001,
    "text": " So how should the user edit this thing, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4757.502,
    "end": 4765.9,
    "text": "You could edit the story graph or you could edit the graph fragment or you could edit the original text and then rebuild the story from there, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4766.081,
    "end": 4767.103,
    "text": "So how should it happen?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4768.231,
    "end": 4777.58,
    "text": " Well, the simplest approach and the approach I suggest in the paper is that all the editing really happened on the text passages.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4778.14,
    "end": 4795.437,
    "text": "Because if you allow edits on the story graph, then they have to propagate in this diagram, have to propagate upward to change the original text passages so that everything is in agreement, all the different sources of information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4795.417,
    "end": 4808.717,
    "text": " are in agreement so it would be easier and simplest if there's only one source of information and that the entire graph can be um regenerated from that source as the as the information changes",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4810.199,
    "end": 4812.462,
    "text": " What was the second question?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4812.482,
    "end": 4813.984,
    "text": "I think maybe I answered it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4814.245,
    "end": 4834.013,
    "text": "How is the internal consistency and the statistical consistency, and then also the changes through actual propagation, how does conflict, how are changes propagated across the story graph and associated models without conflicts?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4834.381,
    "end": 4856.001,
    "text": " yeah yeah that's that's that's i think i answered the question or at least i tried to um so there's only one source of record and that's the text passages itself but suppose now that the that the system uh suppose the user created a story and the system uh uh responds and says hey i don't i don't understand is is you know is bob",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4856.302,
    "end": 4858.608,
    "text": " Bill's brother or his boss?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4858.648,
    "end": 4861.155,
    "text": "I don't understand what this relationship is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4861.977,
    "end": 4865.888,
    "text": "Or when you say he, which he are you referring to, Bob or Bill?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4866.088,
    "end": 4869.096,
    "text": "Who is it that this passage refers to?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4870.291,
    "end": 4882.715,
    "text": " So now you have a situation where maybe the question is, are they brothers or are they coworkers?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4882.915,
    "end": 4884.719,
    "text": "Maybe that's the question the system poses.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4885.641,
    "end": 4891.472,
    "text": "And maybe the user responds, they're brothers, as a response.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4891.452,
    "end": 4912.363,
    "text": " well how does that how does that response you know get into the story graph right because you don't want the system to edit the story graph because then the system would have to change you know propagate that changed information back up into the text passages and that might not work so well you know what if the system doesn't propagate it correctly",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4913.575,
    "end": 4922.863,
    "text": " The user could simply change their original text passages and make clear that what the relationship is, you know, whatever the question is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4923.464,
    "end": 4924.825,
    "text": "So, you know, that's a clear way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4924.865,
    "end": 4927.567,
    "text": "The user just changes the text passage itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4928.168,
    "end": 4940.199,
    "text": "But another way is there's metadata associated with a text passage and that metadata might actually be, you know, include the kind of the conversation between the user and the system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4940.239,
    "end": 4942.941,
    "text": "The system says, the system asks,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4942.921,
    "end": 4945.127,
    "text": " Are they brothers or coworkers?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4945.609,
    "end": 4947.935,
    "text": "And the user's response is they're coworkers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4948.256,
    "end": 4957.943,
    "text": "Okay, well, that's meta information that is now saved as meta information and can become part of the graph downstream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4957.923,
    "end": 4969.146,
    "text": " What about the human element of conflict, like using code as law, legal code, plain text repositories, versioning and forking and instancing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4969.206,
    "end": 4978.345,
    "text": "How does the social reality of the conflict not go into the fractal Linux kernel",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4979.725,
    "end": 4995.743,
    "text": " separation and what would actually you said one version of record and whether or not that resolves logical ambiguity that's an internal question but what about the actual existence and production and power and influence over that one version of record if there really is one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4997.039,
    "end": 5001.306,
    "text": " Are you asking how reliable is a versioning system?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5002.128,
    "end": 5011.023,
    "text": "Like if there's some kind of versioning system where the user changes information, is there a reliable versioning system that can keep track of all these changes?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5012.145,
    "end": 5019.537,
    "text": "Yeah, and even given a reliable, complete, perfect, Git-type versioning of the text,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5019.517,
    "end": 5030.011,
    "text": " How does that not, or does it, or etc., have conflict outside of the text?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5030.031,
    "end": 5034.116,
    "text": "Well, I'm not exactly sure what you're asking, but let me pose this situation to you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5034.657,
    "end": 5048.275,
    "text": "Suppose that, I don't know, suppose that the system is unclear about what the story is saying, and asks the user, you know, is...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5048.474,
    "end": 5051.719,
    "text": " Bill's are these two people related?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5051.8,
    "end": 5052.801,
    "text": "Are they coworkers?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5052.881,
    "end": 5057.81,
    "text": "And the user responds, the user makes a response.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5058.03,
    "end": 5064.401,
    "text": "So therefore changes the record, changes the metadata and says something really vague.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5064.441,
    "end": 5068.929,
    "text": "Like, uh, they're, they, they, they know each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5070.01,
    "end": 5070.972,
    "text": "That's the response.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5071.103,
    "end": 5098.647,
    "text": " didn't really address the question right like it didn't resolve the issue that was raised right but then so what that means is that the story is simply vague right so the story is not a maybe not a great story it just has inconsistencies within it it's it's uh not logical maybe or it's just too vague to understand what is what is being said so that's not the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5098.627,
    "end": 5101.994,
    "text": " That's not a problem of Cognar itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5102.074,
    "end": 5109.809,
    "text": "That's a problem with the telling of the story and its completeness and its logical consistency and things like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5110.37,
    "end": 5116.703,
    "text": "And just like any, just like if you and I were in a room together and we're hashing out what we think about some situation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5116.683,
    "end": 5123.651,
    "text": " I might make some vague statement to you about people involved, and you might think in your head, what?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5124.492,
    "end": 5125.133,
    "text": "What is he saying?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5125.173,
    "end": 5128.577,
    "text": "And that's the way it is, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5128.978,
    "end": 5129.658,
    "text": "That's the way it goes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5129.959,
    "end": 5131.981,
    "text": "And you might ask me, can you clarify that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5132.041,
    "end": 5135.365,
    "text": "But maybe I give you some unclear answer, and then you still don't know what I'm saying.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5135.405,
    "end": 5140.311,
    "text": "And you walk away thinking, well, John doesn't really know what he's saying.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5140.291,
    "end": 5142.736,
    "text": " But that also can happen here, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5142.836,
    "end": 5160.831,
    "text": "So if I'm a user and there's some group that I'm participating in, and there's some event that I'm offering a story to, and I submit a story that is, especially if I have a history of submitting stories that are unclear, logically inconsistent, incomplete,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5160.811,
    "end": 5165.563,
    "text": " My reputation in that group is probably not going to rise very high.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5166.104,
    "end": 5174.365,
    "text": "People will eventually figure out that he's not clear on what he's saying, or else he doesn't know what he's saying.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5175.509,
    "end": 5191.807,
    "text": " So, you know, that's part of the dynamics, interpersonal dynamics, and the, you know, assessing who in the group can be relied on to give a thoughtful, you know, reasonably useful contribution, and who should we pay attention to?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5191.907,
    "end": 5194.55,
    "text": "Like, the group has an attention mechanism, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5195.391,
    "end": 5198.454,
    "text": "Naturally, and maybe even facilitated by Cognar to some degree.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5199.235,
    "end": 5205.482,
    "text": "And that attention mechanism sort of naturally focuses on contributions from people who are known to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5205.462,
    "end": 5213.451,
    "text": " provide clear, useful information in the past, or maybe people who have good predictive capacity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5213.791,
    "end": 5220.859,
    "text": "Like maybe I get a record and a reputation because I've participated in this group many times or on many different events.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5221.119,
    "end": 5226.585,
    "text": "And a lot of what I said was going to happen in the world actually happened.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5226.865,
    "end": 5231.23,
    "text": "I'm good at making forecasts of what's in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5231.39,
    "end": 5232.111,
    "text": "Maybe I'm good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5232.091,
    "end": 5262.098,
    "text": " and making forecasts so maybe the group is going to weigh my contribution a little bit more than some other person's contribution that was unclear or made poor forecasts maybe i maybe i kind of didn't answer your question daniel but yeah i i think it touches on and you cite and discuss some related projects related to like meta governance like you talk about modular policy and about attention economics and then also the trust networks it's uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5262.078,
    "end": 5283.225,
    "text": " lot of interesting work like john ash's work in cognizant and just thinking about how the attention distribution which is changing moment to moment based upon what kinds of message passing and and quantum reference frames the interpretant deploys in that moment in the information environment setting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5283.728,
    "end": 5291.783,
    "text": " And then how that relates to formal and informal and all of these heterogeneous systems, which I think will bring us through the series towards active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5292.604,
    "end": 5298.335,
    "text": "And what does active inference do beyond you saying there's positive alternative narratives?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5298.595,
    "end": 5303.965,
    "text": "However, such is some of the most common statements that people implicitly or explicitly say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5304.89,
    "end": 5305.951,
    "text": " Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5305.971,
    "end": 5308.635,
    "text": "Well, you raised many good points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5308.855,
    "end": 5311.919,
    "text": "I'd like to speak to a couple of them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5313.221,
    "end": 5329.463,
    "text": "One is that by thinking of group decision-making as a cognitive process and thinking of a cognitive process as being a purposeful process,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5329.443,
    "end": 5343.636,
    "text": " and using active inference and other frameworks to potentially evaluate how, maybe there's ways to evaluate how functional a given process was.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5344.077,
    "end": 5347.806,
    "text": "Maybe in retrospect, a group can look back at its history",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5347.786,
    "end": 5374.637,
    "text": " and assess how functional is our cognition how how how are we doing how how is information flowing how what are the many you know from it from a scientific standpoint what are the many ways that we could evaluate the process of cognition for its you know capacity or functionality or other things so you know those are some of the nitty-gritty scientific uh questions that that this project is sort of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5375.005,
    "end": 5394.617,
    "text": " uh offering in a way uh another thing that you mentioned that i'm really glad you mentioned was meta governance and um it's an interesting group uh and i i you know cite them in the first paper at the end um but uh i did i did it reminded me that i wanted to say that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5394.597,
    "end": 5399.848,
    "text": " that Cognar itself is sort of a group agnostic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5400.108,
    "end": 5404.737,
    "text": "Different kinds of groups could use Cognar, a Cognar app.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5405.439,
    "end": 5412.994,
    "text": "And the different groups might have different levels of formality or different ways they want to make decisions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5412.974,
    "end": 5434.307,
    "text": " Maybe if it's a decision-making process they're interested in, maybe they want to use majority vote, maybe they want to use ranked choice voting, maybe they have some other unusual system they want to use, maybe the group is organized in a particular way, maybe it's an autocratic group or a very democratic group or something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5434.287,
    "end": 5437.091,
    "text": " So Cognard could be used by any group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5437.411,
    "end": 5444.662,
    "text": "The group is going to define what it is and how it works and what its rules are and how things go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5444.722,
    "end": 5455.637,
    "text": "And then Cognard seeks to be the structure on which then cognitive group events can occur.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5455.617,
    "end": 5468.983,
    "text": " And that is really good because Cognar is not responsible for forcing all users to use some particular method or approach or rule set or whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5469.023,
    "end": 5472.069,
    "text": "There's room for innovation within the Cognar system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5472.089,
    "end": 5476.157,
    "text": "There's room for experiment within the Cognar.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5476.137,
    "end": 5501.352,
    "text": " system there's a history of of events that can be assessed in hindsight for how well they worked uh how did they how well did they guide a group towards uh shared uh you know widely widely shared and uh valued solutions to problems and things like that so uh yeah",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5501.787,
    "end": 5517.417,
    "text": " awesome okay another question from live chat and anyone else can continue to write questions and we can continue to explore a few things synthetic data generator wrote can it be used as a protocol for group mental model harmonization",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5519.675,
    "end": 5521.076,
    "text": " Well, that's what it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5521.116,
    "end": 5525.02,
    "text": "If I understand the question correctly, that's sort of what it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5525.06,
    "end": 5542.878,
    "text": "If you and I are together in a room and we're talking about some situation in the world, I have a model in my mind about how the world works and what will happen if we do something or not do something and what it means and what the future might be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5543.719,
    "end": 5547.403,
    "text": "And you have your own model in your head.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5547.383,
    "end": 5551.069,
    "text": " And we're communicating aspects of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5552.312,
    "end": 5564.212,
    "text": "But what Cognar does is it kind of makes that process available to the large group setting where there's potentially millions of people who are participating in this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5564.753,
    "end": 5569.662,
    "text": "And what it does is it makes the model explicit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5570.806,
    "end": 5571.106,
    "text": " right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5571.667,
    "end": 5585.681,
    "text": "It puts it down in an explicit way so that it can be assessed and analyzed and considered as whether it's different, how different it is from other ways of approaching the situation or what its components are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5585.701,
    "end": 5599.395,
    "text": "So that is what Cognar does is it represents a user's mental model of a situation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5600.303,
    "end": 5616.355,
    "text": " yeah and i think an important aspect of the harmonization is whether or not any given sense of harmonization is achieved or whether that's like a positive attribute used like coherence informally by taking like a dynamical systems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5616.335,
    "end": 5619.519,
    "text": " parametric modeling, Bayesian probabilistic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5619.819,
    "end": 5633.176,
    "text": "There actually are ways, like using fMRI analysis on the brain, that rhythms of different time scales, different mutual information, different KL divergences, like there's a whole toolkit of harmonics and analysis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5633.737,
    "end": 5637.361,
    "text": "So this is one mapping strategy and representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5637.421,
    "end": 5640.385,
    "text": "However, it doesn't",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5641.293,
    "end": 5659.521,
    "text": " need to be the only mapping or representation one that has some great causal properties though and helps be like kind of a repository format for the perception cognition and action that make things about a given system specific rather than like the generic active inference formalism",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5660.294,
    "end": 5670.429,
    "text": " Recently there's been several papers published on how groups harmonize their belief systems as they come together to understand the world or make decisions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5670.51,
    "end": 5685.272,
    "text": "So there's already prior work on what harmonization in a group setting might look like and how that works and how it might be even mathematically approached for modeling purposes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5685.252,
    "end": 5691.177,
    "text": " And another thing that you just raised there a moment ago, Daniel, is the idea of a repository.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5691.638,
    "end": 5701.126,
    "text": "So suppose that Cognar existed and there were, say, millions of stories in Cognar and hundreds of thousands of group events that could be analyzed in retrospect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5701.507,
    "end": 5715.259,
    "text": "Think of the value that would be to science for understanding cognition and understanding how information is conveyed and used and flows and...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5715.239,
    "end": 5744.065,
    "text": " what kind of designs for rule systems or uh inputs or whatever facilitate uh cognition in the best way I mean just the existence of a repository of externalized belief models of you know complex externalized belief models of a variety of individuals on a variety of topics itself would be extremely valuable for cognitive science and computer science and various other you know",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5744.045,
    "end": 5763.555,
    "text": " psychology of the various other aspects of science yeah this relates to a question that synthetic data generator followed up on it's an interesting question larkin and simon were the seminal researchers in this diagrammatic reasoning is the explicit model visual or linguistic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5766.202,
    "end": 5788.142,
    "text": " is the um is if i can interpret that is the question is the story graph visual or linguistic is that about it um uh so it's it's a comp the the story graph one of the purposes of the story graph the meaning representation is to allow computation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5789.506,
    "end": 5793.191,
    "text": " So in that sense, I guess you would say it's linguistic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5793.291,
    "end": 5806.189,
    "text": "It's trying to record the, trying to capture the meaning of what a phrase is, what the user is trying to say, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5806.209,
    "end": 5811.396,
    "text": "And how that phrase relates to other phrases of what the user is trying to say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5811.376,
    "end": 5826.919,
    "text": " But it's also visual in the sense that suppose, and I'm glad you brought this slide up, but suppose I'm creating a story and now I want to check whether the system is understanding that story correctly, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5826.939,
    "end": 5831.005,
    "text": "So what I might want to do is I might want to view",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5830.985,
    "end": 5855.895,
    "text": " a portion of the story graph under the hood and see if the system put those things together correctly so that aspect could be sort of visual as a user i could look at something you know like this like what you have on the screen and go like okay i see that i see that these two concepts were properly connected with each other it actually you know",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5855.875,
    "end": 5867.337,
    "text": " sue actually is related to robert and uh you know this particular way or it was it was sue that dropped the gun not bob or you know whatever the story is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5868.245,
    "end": 5880.623,
    "text": " So there might be visual tools that the user would have available in order for them to query the underlying story graphs or even query someone else's story graph.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5880.663,
    "end": 5882.065,
    "text": "There might be visual tools for that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5882.726,
    "end": 5891.839,
    "text": "And a result from a query might be a visual result so that it sort of makes sense to how the different elements are connected with each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5891.819,
    "end": 5904.698,
    "text": " But the kind of the core thing happening under the hood is computation based on the linguistic meaning of phrases and the intent of the user.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5906.315,
    "end": 5921.99,
    "text": " Yeah, a lot there, especially programs considered and graphs considered as diagrams, like from an applied category, theoretic perspective, the data structures themselves already being diagrammatic symbolic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5922.55,
    "end": 5935.022,
    "text": "Now they, they might not be the right semantic representations for given system with this available observable with this unobservable modeled for this person with this accessibility, that language, like, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5935.424,
    "end": 5939.429,
    "text": " But that is a cognitive situation with the human computer interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5940.21,
    "end": 5961.718,
    "text": "So whether it's a phone and uses this interface or uses another interface, part of the interesting question with a generative model interoperability is can those different blankets, different screens be also connected to a system that has an underlying representation that those perspectives come filtered through?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5962.492,
    "end": 5963.253,
    "text": " Right, right, right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5963.493,
    "end": 5971.445,
    "text": "You raised the field of applied category theory there a minute ago, which is really interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5971.505,
    "end": 5989.41,
    "text": "Lots of applications of applied category to this sort of setting, because maybe you want to translate this graph into some other representation, and you want that translation to preserve meaning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5989.39,
    "end": 5994.799,
    "text": " Well, that's a functor in applied category theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5994.859,
    "end": 6003.934,
    "text": "So there might be ways to use applied category theory in even designing the structure of this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6004.575,
    "end": 6006.979,
    "text": "Structurally, how does a story graph work?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6007.32,
    "end": 6007.761,
    "text": "What is it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6007.781,
    "end": 6008.803,
    "text": "How is it stored?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6008.823,
    "end": 6010.285,
    "text": "How is it retrieved from",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6010.265,
    "end": 6027.43,
    "text": " a database and you know how is it manipulated and how is it you know what kind of functors translate a particular story into a different version or visualization or you know",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6028.844,
    "end": 6043.512,
    "text": " But really just a different version of that story, or a sub-story, or translated from a story graph into English, or a story graph into animation, or whatever the case might be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6045.796,
    "end": 6046.718,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6047.677,
    "end": 6050.664,
    "text": " This was a great first go for .1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6051.886,
    "end": 6061.888,
    "text": "Maybe just restate what are we going to head towards in .2, what would be fun, and what for those who are watching now could do between now and then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6063.218,
    "end": 6070.885,
    "text": " Yeah, well, so today we've kind of talked about the general high level, what is Cognar and what is it supposed to do?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6071.686,
    "end": 6081.494,
    "text": "Next time when we get together, we'll talk more about meaning representations and what should the Cognar meeting representation look like?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6081.535,
    "end": 6082.155,
    "text": "What should it do?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6082.295,
    "end": 6084.197,
    "text": "What characteristics should it have?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6084.237,
    "end": 6085.578,
    "text": "How was it put together?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6086.499,
    "end": 6092.044,
    "text": "Maybe we'll have a chance to talk about how does applied category fit into all of this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6092.024,
    "end": 6117.407,
    "text": " um in the meantime uh you know i i encourage watchers to take a look at the papers and uh and also if there's questions and you know feel free to send questions i think i can be reached through the institute somehow perhaps and um or post questions and maybe we can try to pick up any of those questions or comments or",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6117.387,
    "end": 6133.438,
    "text": " suggestions you know that are offered in the intermedium intermediate part pick it up next time okay awesome thank you again john and lee too so see you next time sounds good bye",
    "speaker": "SPEAKER_02"
  }
]