[
  {
    "start": 8.047,
    "end": 29.92,
    "text": " hello and welcome this is active guest stream number 87.2 on september 10 2024 we're continuing on with the cognar ecosystem series with john boyk so john thank you again go for it and we'll look forward to people's comments and questions great thank you daniel",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.845,
    "end": 49.596,
    "text": " uh my name is john boyk i'm a active inference institute research fellow um i have two new papers published or excuse me posted as a pre-prints and that's what this live stream these two live streams are about next slide please daniel",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 52.36,
    "end": 55.286,
    "text": " So on September 5th, we had our first one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 55.607,
    "end": 58.253,
    "text": "I encourage listeners to check that out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 58.273,
    "end": 61.36,
    "text": "The links are in the PDF.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 61.38,
    "end": 68.917,
    "text": "And today we're talking about the second paper, which is the Cognar Ecosystem Preliminary Thoughts on a Story Graph Meaning Representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 71.182,
    "end": 71.803,
    "text": "Next slide, please.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 75.715,
    "end": 81.544,
    "text": " So the next several slides are brief recaps of what we discussed before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 81.584,
    "end": 87.374,
    "text": "The Cognar project is new, and it's large, and it's fairly complex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 87.394,
    "end": 95.867,
    "text": "And it might help a little bit to set the stage for this talk just by quickly reviewing some of the main components of the Cognar system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 96.505,
    "end": 106.343,
    "text": " So Cognar means cognitive narrative and it's, uh, it's a, it's a, it's a, um, the, the cognitive system is still a concept.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 106.363,
    "end": 107.385,
    "text": "It's, it's new.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 107.425,
    "end": 111.713,
    "text": "It's very much being created as we speak.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 112.975,
    "end": 131.451,
    "text": " It's conceived to be an open source online ecosystem of tools and services, et cetera, that facilitates group cognition, especially for large groups and especially with regard to deliberation, strategizing, and collective problem solving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 133.154,
    "end": 134.697,
    "text": "Cognar helps users",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 135.115,
    "end": 138.621,
    "text": " and the phrase I like to use is tell their story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 139.402,
    "end": 153.546,
    "text": "So I use the word story and I use the word narrative in the paper and I will in this talk, but I don't mean story as in fable or I mean story as in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 153.526,
    "end": 182.065,
    "text": " actually what i mean by story is is the a belief model of a user so the idea is that relative to some problem or situation of interest a group as having a online discussion you could say and the users are contributing their an externalization of their belief model to this discussion so they are they are in this in this story they're they're",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 182.5,
    "end": 187.807,
    "text": " describing what's the situation or problem, what happened, why did it happen, what might happen next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 188.788,
    "end": 192.213,
    "text": "What might happen next clearly is predictive, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 192.233,
    "end": 195.778,
    "text": "So there's predictions are part of, generally are part of a story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 196.559,
    "end": 198.241,
    "text": "Who does this situation affect?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 198.321,
    "end": 199.082,
    "text": "Who was involved?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 199.102,
    "end": 199.723,
    "text": "What does it mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 199.803,
    "end": 200.544,
    "text": "What should be done?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 200.604,
    "end": 201.465,
    "text": "What can be learned?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 201.505,
    "end": 207.293,
    "text": "All those kinds of questions can be addressed in a story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 207.273,
    "end": 218.756,
    "text": " And a story really is a model, an externalization of beliefs about how a user sees the world and sees the situation and thinks that the world works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 221.382,
    "end": 222.143,
    "text": "Next slide, please.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 227.911,
    "end": 236.464,
    "text": " Um, so, uh, stories can be rich and by rich, I mean, potentially long, complex, nuanced, informative, conditional dynamic, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 236.864,
    "end": 245.617,
    "text": "So maybe a typical story might be the equivalent of a few pages of text perhaps, but, uh, but, uh, could be even be longer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 245.637,
    "end": 256.213,
    "text": "It could be like a equivalent to a book chapter, for example, or a story could be very short equivalent to a paragraph that really depends on what the user wants to communicate, but they can be rich.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 257.662,
    "end": 269.578,
    "text": " And this is much different from other online services that are aimed at collaborative decision-making and similar tasks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 270.925,
    "end": 287.743,
    "text": " This is not a choose multiple choice sort of system where the user can contribute to the conversation by choosing A, B, C, or D, or filling in a blank with a couple of words.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 288.043,
    "end": 291.546,
    "text": "Stories can be much, much richer than that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 293.288,
    "end": 300.696,
    "text": "There is a backend computational system, and that system assists and guides users in constructing their stories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 300.895,
    "end": 304.981,
    "text": " assess the stories for quality, but for example, is the story on topic?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 305.041,
    "end": 306.003,
    "text": "Is it comprehensible?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 306.644,
    "end": 311.591,
    "text": "Did the user follow whatever rules the group set out for submitting stories?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 312.593,
    "end": 323.309,
    "text": "And primarily the backend computational systems helps the group to digest and make sense of the many stories that might've been submitted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 323.99,
    "end": 327.595,
    "text": "And when I say many stories and large group,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 327.575,
    "end": 334.631,
    "text": " I mean, potentially a group of thousands to tens of thousands to hundreds of thousands, even to millions of peoples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 335.432,
    "end": 339.762,
    "text": "So, you know, potentially very, very large groups.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 341.007,
    "end": 347.894,
    "text": " And the backend system also performs inference for queries that users generates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 348.174,
    "end": 366.453,
    "text": "For example, I'm part of a group, we're all sharing our stories, and I might have some question about some particular story, like in that story, does the economy, does unemployment go down?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 366.493,
    "end": 370.677,
    "text": "Some question like that, and I can pose a query",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 370.657,
    "end": 377.966,
    "text": " or even a more specific query either to the storyteller of that story or to the story itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 378.467,
    "end": 381.891,
    "text": "And the system can also generate queries all by itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 383.413,
    "end": 393.846,
    "text": "When you're creating a story, the system might ask you, I'm confused, do you mean that the unemployment is going to go down because of this or some such question like that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 394.906,
    "end": 399.053,
    "text": " But the system, this is quite important, the system does not predict the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 399.293,
    "end": 406.285,
    "text": "So it's not going to assess a story for how useful that will be in real life or how accurate it will be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 406.325,
    "end": 408.929,
    "text": "That's the purpose of a story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 408.949,
    "end": 411.333,
    "text": "A user does this in their story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 411.574,
    "end": 419.547,
    "text": "The user says, I believe that if we take actions A, B, C, and D, then unemployment will go down, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 420.792,
    "end": 427.727,
    "text": " And the system does also not assess the realism or accuracy of the story or a group of stories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 428.208,
    "end": 434.481,
    "text": "And that's really the responsibility of the group that's collecting the stories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 436.284,
    "end": 437.046,
    "text": "Next slide, please.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 440.873,
    "end": 452.008,
    "text": " Importantly, those last two bullets means that the back-end system does not have to have its own model of how the world works in reality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 453.41,
    "end": 458.236,
    "text": "It does not need to know mechanics, for example, or biology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 458.296,
    "end": 470.813,
    "text": "It really just needs to communicate stories and help users digest stories and help users create stories in such a way that users can communicate their belief systems and share their belief systems together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 472.075,
    "end": 479.506,
    "text": " So if the purpose of the Cognar system is to facilitate group cognition, the obvious question is, well, what is cognition?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 480.648,
    "end": 485.055,
    "text": "In this project, I'm looking at cognition through the active inference lens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 485.636,
    "end": 489.181,
    "text": "And active inference is a normative Bayesian description of cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 489.782,
    "end": 498.075,
    "text": "In the previous PDFs for the first series, there's links that listeners could follow to find some literature on this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 498.135,
    "end": 501.019,
    "text": "And obviously, there's references in my papers also.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 502.552,
    "end": 510.1,
    "text": " So an agent has, in active inference, an agent has an internal probabilistic model about how the world works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 510.72,
    "end": 515.786,
    "text": "And that is the model that is conveyed, really, that is externalized into the story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 517.267,
    "end": 526.216,
    "text": "So cognition is idealized here, simplified as a four-part cyclic process of predict, act, sense, and learn.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 526.276,
    "end": 529.96,
    "text": "So I underline the word act here because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 530.26,
    "end": 535.931,
    "text": " Often that's really not considered a part of cognition, but in the active inference world, it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 535.951,
    "end": 542.022,
    "text": "So for example, I'm learning how to play football.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 542.703,
    "end": 548.995,
    "text": "I predict that if I jump up high and raise my arms, I might catch a high pass.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 549.565,
    "end": 552.429,
    "text": " I act on those predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 553.15,
    "end": 555.953,
    "text": "I sense whether I actually caught the ball or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 556.414,
    "end": 560.279,
    "text": "And if I didn't catch the ball, I learn from my mistakes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 560.339,
    "end": 565.165,
    "text": "I learn that I need to jump higher or reach higher or take some other action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 565.225,
    "end": 567.388,
    "text": "And then we repeat the process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 567.488,
    "end": 573.075,
    "text": "And over time, I get better and better at catching that ball.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 573.663,
    "end": 583.981,
    "text": " And in action, an agent favors choices that ensure the greatest resolution of uncertainty under the constraints that are preferred outcomes are realized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 584.001,
    "end": 590.833,
    "text": "So my preferences are that I catch that ball and I really want to reduce the uncertainty that I'm going to miss it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 590.853,
    "end": 598.607,
    "text": "So I repeat this learning process over and over and my certainty about catching that ball goes up and up as I get better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 599.988,
    "end": 610.907,
    "text": " And active inference is normative, so it offers a description of functional cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 611.347,
    "end": 618.84,
    "text": "And that's what we're after in the Cognar system is to facilitate functional cognition as opposed to dysfunctional cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 618.82,
    "end": 629.732,
    "text": " So for example, dysfunctional cognition would not ensure the greatest resolution of uncertainty under the constraints that preferred outcomes are realized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 630.153,
    "end": 644.268,
    "text": "If uncertainty does not decrease about preferred outcomes, then that's a sign that cognition may have problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 647.412,
    "end": 648.473,
    "text": "Next slide, please.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 652.03,
    "end": 678.375,
    "text": " so what is cognar really then um i in in this project i i look at a group as an organism as a cognitive organism so just like any organism it needs to needs to react in the world it needs to do those that four-step process of you know sense act learn uh a cognitive architecture",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 678.845,
    "end": 681.447,
    "text": " integrates information and coordinates action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 681.608,
    "end": 685.591,
    "text": "And every organism has a cognitive architecture, and so do groups.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 685.912,
    "end": 687.954,
    "text": "So do groups viewed as organisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 688.974,
    "end": 698.183,
    "text": "And the cognitive architecture for an individual human, say, is the human biology, the central nervous system, the body, and also tools that a human might use.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 698.984,
    "end": 703.068,
    "text": "Computers, for example, could be considered a part of that cognitive architecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 703.348,
    "end": 707.772,
    "text": "Notes to remember is an extension of the brain's capacity to remember, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 709.085,
    "end": 720.943,
    "text": " And cognitive architecture for a group might include rules, methods, institutions, sensors, sensors for air pollution, for example, for a group that might be a nation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 722.565,
    "end": 726.551,
    "text": "And essentially, all the components by which and through which cognition occurs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 727.493,
    "end": 737.488,
    "text": "As an aside, in a previous series of three papers that we discussed in the previous guest streams a few years ago,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 737.468,
    "end": 749.225,
    "text": " I look at a society's core systems, that is governance systems, economic systems, financial systems, legal systems, as part of that society's cognitive architecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 749.786,
    "end": 757.958,
    "text": "And this Cognar project is kind of closely related, or maybe you could say an offshoot of that initial series.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 759.811,
    "end": 764.416,
    "text": " So Cognar is a component of the cognitive architecture of the groups that use it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 764.496,
    "end": 768.24,
    "text": "And its purpose again is to facilitate functional cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 769.882,
    "end": 779.673,
    "text": "And as I've mentioned, a story is a potentially dynamic externalized representation of a user's internal belief model about how the world works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 781.134,
    "end": 785.139,
    "text": "Next slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 785.159,
    "end": 788.923,
    "text": "Just a couple more of these recaps, and then we're on to the meat of today's talk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 790.473,
    "end": 795.099,
    "text": " Um, so, um, under the hood, this is how the Cognar system works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 795.599,
    "end": 798.322,
    "text": "Um, I've used the word story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 798.423,
    "end": 805.611,
    "text": "I've used the word narrative, but, um, I do not mean textual, uh, information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 805.631,
    "end": 820.429,
    "text": "So it's not, users don't convey and discuss and, and share their stories in, in text form, but rather in a very special kind of meaning representation that I call a story graph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 821.843,
    "end": 826.824,
    "text": " And story graphs really are the core innovation of the Cognar system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 826.844,
    "end": 831.685,
    "text": "It's really what allows the Cognar system to function well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 833.318,
    "end": 837.266,
    "text": " Um, this diagram shows how story graphs are constructed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 837.867,
    "end": 856.002,
    "text": "A user might either speak or write a short text passages, a sentence, a few sentences, maybe with some metadata associated with that, perhaps a table, perhaps the graphs, you know, something like that, perhaps a, a few words about how the sentence is supposed to be interpreted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 857.45,
    "end": 875.42,
    "text": " Um, uh, the system accepts that, uh, those passages, uh, translates that into a story graph fragment, and then merges that story graph fragment into the growing story graph and the story graph fragment and the story graph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 875.52,
    "end": 881.23,
    "text": "That's, that's, that's the meaning representation, uh, for the Cognar system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 882.458,
    "end": 885.843,
    "text": " Once the story graph is constructed, then several things can happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 885.883,
    "end": 888.848,
    "text": "It could be translated into a natural language, potentially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 888.988,
    "end": 907.656,
    "text": "So one day you should be able to instruct the system to take the story graph and then read it back to me, play it back to me so I can hear how it sounds, or translate that story graph into some other alternative meaning representation that's maybe better suited for a particular",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 907.636,
    "end": 928.142,
    "text": " logical or inference some kind of inference model or some kind of analysis or translate it directly into you know either in part or in whole into some kind of probabilistic model or logical model or other kind of model to conduct either analysis or inference next slide please",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 931.919,
    "end": 934.803,
    "text": " Here's an example of a meaning representation that's used.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 934.864,
    "end": 940.893,
    "text": "This is a very popular meaning representation called abstract meaning representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 941.915,
    "end": 948.645,
    "text": "This is for the sentence, similar technique is almost impossible to apply to other crops.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 948.625,
    "end": 950.688,
    "text": " such as cotton, soybeans, and rice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 953.032,
    "end": 965.773,
    "text": "You can see at a glance from this meaning representation that it's graph-based, that's one thing, and that the edges in this graph represent some kind of relationship between words and the sentence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 966.817,
    "end": 968.939,
    "text": " The rest of it is not important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 968.979,
    "end": 973.444,
    "text": "And I don't use, we don't use AMR in the Cognar system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 973.504,
    "end": 985.295,
    "text": "We're actually, the purpose of this second paper is to explore what is the best meaning representation for Cognar?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 986.797,
    "end": 988.799,
    "text": "What does, what should it do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 989.139,
    "end": 991.261,
    "text": "What should it, how should it be constructed?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 991.321,
    "end": 993.503,
    "text": "What should it be able to accomplish?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 994.024,
    "end": 995.085,
    "text": "Those kinds of questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 996.23,
    "end": 1004.816,
    "text": " But this graph picture gives you a very rough idea of what we might be after.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1004.856,
    "end": 1007.083,
    "text": "Next slide, please.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1010.675,
    "end": 1029.662,
    "text": " so um the purpose of the of the story graph meaning representation is to represent a story in a format that's less ambiguous than natural language natural language can be very ambiguous and it should be a representation that is readable and understandable both by humans and computers",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1029.642,
    "end": 1043.855,
    "text": " As a creator of a story, I should be able to look at that graph and confirm or validate that, yes, that the system understood what I was trying to tell it, things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1045.016,
    "end": 1047.278,
    "text": "It provides a structure for inference and analysis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1047.438,
    "end": 1057.708,
    "text": "It serves, as I noted in the previous slide, it serves as input to various kinds of inference and analytical models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1057.688,
    "end": 1084.928,
    "text": " and it serves as an interlingua which is a natural language independent representation that's suitable for translation into other languages and and models next slide so now we now we can really begin with today's talk so what is the cognar meaning representation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1085.026,
    "end": 1089.633,
    "text": " That's the question, but whatever it is, it's fit for purpose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1090.034,
    "end": 1092.237,
    "text": "And what does fit for purpose mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1092.818,
    "end": 1097.585,
    "text": "Daniel, if you back up one slide, this is the purpose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1098.066,
    "end": 1110.245,
    "text": "So the task at hand is to design a meaning representation that is capable of performing these tasks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1111.066,
    "end": 1113.43,
    "text": "Okay, let's go forward two slides.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1115.924,
    "end": 1123.682,
    "text": " All right, so I've already showed you an example of AMR, abstract meaning representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1124.584,
    "end": 1132.262,
    "text": "And I've mentioned that that's a common meaning representation used in research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1132.242,
    "end": 1135.108,
    "text": " So, there's others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1135.449,
    "end": 1152.124,
    "text": "So, before we jump into questions about what should the cognitive meaning representation look like, it's useful to look at the meaning representations that are used in the research world, particularly in the natural language inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1153.623,
    "end": 1182.769,
    "text": " on natural language inferences inferences falls under the general category of natural language processing there's many tasks that that fall into the categories of nlp and nlu natural language understanding and natural language inference is one of them and perhaps it's analyzed the in a sense the most difficult because in in in nli",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1182.749,
    "end": 1191.013,
    "text": " for inference, the system or the model really needs to understand the meaning of some text.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1191.855,
    "end": 1197.552,
    "text": "So this is the way that NLI is conducted in the research setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1198.679,
    "end": 1217.582,
    "text": " uh some text is selected usually that text is just a single sentence or maybe you know a short a small number of sentences at the most um and that text might be selected from some some database of of sentences you know where the meaning is is well understood",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1218.963,
    "end": 1228.679,
    "text": " And that text then is sent to a natural language processing system, so for parsing, word sense disambiguation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1228.719,
    "end": 1235.391,
    "text": "The result of that is then sent to some meaning representation, such as AMR.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1235.431,
    "end": 1240.92,
    "text": "And then the meaning representation is used within the inference method.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1240.9,
    "end": 1250.003,
    "text": " So this is typically how it's done, but the Cognar is much different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1250.243,
    "end": 1251.587,
    "text": "The setting is much different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1252.389,
    "end": 1256.479,
    "text": "In Cognar, numbers 1, 2, and 3 here happen almost at the same time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1256.459,
    "end": 1259.423,
    "text": " And it's interactive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1259.863,
    "end": 1265.671,
    "text": "So Cognito doesn't select text out of a database to make a story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1266.572,
    "end": 1270.376,
    "text": "Users are contributing text to make a story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1270.396,
    "end": 1271.558,
    "text": "And they're doing that for some reason.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1271.778,
    "end": 1282.011,
    "text": "A user wants to convey some information, some aspect of their beliefs about how the world works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1283.341,
    "end": 1287.386,
    "text": " So in an NLI study, that text is fixed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1288.086,
    "end": 1296.676,
    "text": "You're given a sentence, and then the whole system is going to be scored on how well it understands that particular sentence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1297.257,
    "end": 1304.746,
    "text": "But in Cognar, if the system doesn't understand what you tried to say, it can ask you for feedback.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1304.806,
    "end": 1305.927,
    "text": "It can say, I don't understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1306.047,
    "end": 1310.192,
    "text": "Who is the word he referring to, for example?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1310.172,
    "end": 1312.557,
    "text": " Or do you mean flame?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1312.597,
    "end": 1317.568,
    "text": "Do you mean flame as in a hot burning candle?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1317.709,
    "end": 1323.041,
    "text": "Or do you mean flame as in a romantic interest?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1323.702,
    "end": 1325.987,
    "text": "So the system can ask you for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1325.967,
    "end": 1335.512,
    "text": " ask you questions, give you feedback, maybe suggest phrasing or just simply say, I don't understand what you just entered.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1336.213,
    "end": 1343.031,
    "text": "And then the user is able to adjust that text to something that the system can understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1343.011,
    "end": 1356.55,
    "text": " which of course can reduce ambiguity and error and improve the quality of the story, the text that is being converted into a story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1358.352,
    "end": 1369.187,
    "text": "And as I showed in one of the graphs a few slides ago, the system then takes that text and converts that into a story graph fragment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1370.517,
    "end": 1388.684,
    "text": " And depending on the use case for the Cognar system, say in a use case that involves group decision making, the editing of that story might occur over a series of rounds where people edit their stories, share their stories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1389.205,
    "end": 1399.36,
    "text": "The system helps digest the set of stories in a given round and how they've changed and what they entail and how they're different and how they're similar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1399.34,
    "end": 1413.763,
    "text": " And then at the end of each round, users would have the opportunity maybe to read other people's stories, digest the information from other stories, and maybe change their story if they see an idea that they like or they think, oh, I should have included that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1413.843,
    "end": 1416.808,
    "text": "I meant to, but I didn't, and I'm going to include that in my story now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1416.788,
    "end": 1423.297,
    "text": " So in that process of iteration and rounds, the quality of the story increases even further.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1424.058,
    "end": 1430.106,
    "text": "So that's really quite different from the research setting that is typically used in NLI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1430.467,
    "end": 1435.033,
    "text": "And it gives the Cognar system a lot more flexibility as to how it operates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1435.013,
    "end": 1456.903,
    "text": " Because it can interact with the user and ask questions and give feedback to the user and tell the user that it doesn't understand something when it doesn't understand something, it really has the capacity, at least the potential capacity, to create much higher quality stories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1456.883,
    "end": 1465.164,
    "text": " and perform even more complex forms of inference than would be possible in normal NLI studies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1466.688,
    "end": 1467.771,
    "text": "Okay, next slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1471.227,
    "end": 1477.052,
    "text": " So in the literature over the years, many meaning representations have been proposed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1477.072,
    "end": 1481.977,
    "text": "This is a table from the second article, but there's even more than this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1482.037,
    "end": 1485.74,
    "text": "This is just some selected meaning representations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1486.241,
    "end": 1491.585,
    "text": "And actually, meaning representations are being developed and created regularly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1491.765,
    "end": 1496.93,
    "text": "So it's not that there's three fixed meaning representations and you have to pick one of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1497.351,
    "end": 1498.472,
    "text": "That's not really the way it works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1498.572,
    "end": 1501.234,
    "text": "People are creating new ones as",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1501.214,
    "end": 1505.639,
    "text": " as new situations arises, new tasks arises that they're trying to address.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1508.942,
    "end": 1522.757,
    "text": "We will focus on a few of them today, and the second paper focuses on a few of them, particularly discourse representation theory, which is, I don't know, about the fifth one down or so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1522.797,
    "end": 1529.905,
    "text": "And there's a few others, type theory with records, the last one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1529.885,
    "end": 1538.886,
    "text": " And we'll also look at Disco Cirque towards the bottom there, which is not exactly a meaning representation, but it's related.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1541.171,
    "end": 1541.532,
    "text": "Next slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1544.009,
    "end": 1548.975,
    "text": " This is a T this is a, uh, graphic from Lou, uh, 2021.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1550.037,
    "end": 1556.585,
    "text": "And, uh, he was interested in, in meeting representations for document length text.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1556.605,
    "end": 1566.017,
    "text": "And so are we, you know, document length text means, you know, potentially the, the equivalent of a, a book or a book chapter, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1567.246,
    "end": 1591.954,
    "text": " um so we have the same interest as lou he's also interested in graphical meaning representations not all meaning representations are graphical and the reason that you might prefer a graphical meaning representation is because graphs computers understand graphs very well that's a it's a way to encode text information such that computers are able to process it well",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1593.149,
    "end": 1605.994,
    "text": " And I might back up just a minute here and say like, why is it even necessary that a backend computational system assesses stories and, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1607.56,
    "end": 1624.776,
    "text": " does inference on stories why not just why not just write your story in text form and and you know share it with the group why why not that well the reason is because uh we're interested here in group in group cognition in the large group setting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1624.756,
    "end": 1642.005,
    "text": " So if you have a group of, say, 100,000 people and each of them is submitting some long story that's complicated and nuanced and dynamic, they're going to change it maybe next week as they learn something new.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1643.15,
    "end": 1648.777,
    "text": " There's no human that's able to digest, you know, a hundred thousand long stories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1648.877,
    "end": 1649.958,
    "text": "It's just not going to happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1650.599,
    "end": 1659.209,
    "text": "So the purpose of that backend system is to help use, help the group to digest all of that information and make sense of all that information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1660.931,
    "end": 1664.615,
    "text": "And that's why the computer needs to understand what is written.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1664.996,
    "end": 1670.322,
    "text": "And that is one way to do that is to use a graph based meaning representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1671.5,
    "end": 1684.853,
    "text": " So in Lou's table, you can see that discourse representation theory really scores quite well for all the many things that are necessary for understanding aspects of text.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1686.574,
    "end": 1695.103,
    "text": "And for the very same reasons, DRT looks interesting for the Cognar system also.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1696.984,
    "end": 1697.625,
    "text": "Next slide, please.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1701.149,
    "end": 1704.073,
    "text": " So this is an example of discourse representation theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1704.693,
    "end": 1714.786,
    "text": "This is the box form, and DRT is not graph-based, inherently graph-based, but people have proposed ways to convert this into a graph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1715.988,
    "end": 1720.914,
    "text": "This is a DRT for the two sentences Max fell, John might have pushed him.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1721.955,
    "end": 1727.983,
    "text": "We have some reference, X1, X2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1728.368,
    "end": 1746.996,
    "text": " X1 is a person named Max, and some event happens, he fell, and he fell before some event, and that event being pushed by John.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1747.056,
    "end": 1756.35,
    "text": "And the two boxes represent roughly the two sentences, and they're related in the sense that this word because.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1756.33,
    "end": 1774.98,
    "text": " because of k1 k2 yeah max fell because john might have pushed him um uh yeah that's that's that i think it's it's kind of straightforward how you would read a drt box next slide please",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1776.901,
    "end": 1781.769,
    "text": " As I said, DRT itself is not inherently graph-based.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1782.41,
    "end": 1792.007,
    "text": "And Lou came up with a version of DRT that he calls Discourse Representation Tree Structure, DRTS.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1791.987,
    "end": 1799.76,
    "text": " that is graph-based and that really is aimed at document-length text.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1800.601,
    "end": 1815.345,
    "text": "And this looks particularly interesting in the Cognar setting because it's graph-based, it's really constructed for long text, and it has all the benefits that DRT has.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1816.625,
    "end": 1825.78,
    "text": " So you could imagine a story graph looking a little bit like this, but still far more sophisticated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1828.144,
    "end": 1828.806,
    "text": "Next slide, please.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1833.233,
    "end": 1837.68,
    "text": "By the way, that was a DRTS for the very same two sentences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1837.781,
    "end": 1839.223,
    "text": "Max fell, John might have pushed him.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1840.925,
    "end": 1852.421,
    "text": " Another type, this is not really a meaning representation per se, but closely related, something that would be of interest in the Cognar setting, is type theory with records.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1853.302,
    "end": 1859.871,
    "text": "So type theory actually is closely related to category theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1860.712,
    "end": 1863.956,
    "text": "Types are really like category objects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1865.558,
    "end": 1870.425,
    "text": "And type theory with records is a hybrid type theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1871.671,
    "end": 1883.282,
    "text": " But in type theory with records, there's records, uh, that is, you know, in a sense, a, uh, abstract description of some potential situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1883.342,
    "end": 1887.132,
    "text": "The potential situation here is, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1887.466,
    "end": 1904.833,
    "text": " boy hugs a dog that's so that's the event that is this uh hypothetical that could happen boy hugs a dog and for that to happen there has to be a boy there have to has to be a dog and there has to be some event where the boy hugs the dog so that's written as a record and um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1905.286,
    "end": 1916.657,
    "text": " Then there has to be, if that event is perceived in life or in a story or in the imagination, there becomes a witness for that event.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1916.677,
    "end": 1920.848,
    "text": "So type theory with records has both record types and witnesses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1921.773,
    "end": 1935.964,
    "text": " And a witness really is like a proof and the proof of the proof of this boy hugs dog event is that, uh, you know, I witnessed a boy and I witnessed a dog and I witnessed this boy hugging the dog.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1936.165,
    "end": 1936.886,
    "text": "So there we go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1936.907,
    "end": 1937.588,
    "text": "That's the proof.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1938.833,
    "end": 1947.383,
    "text": " And this is actually, type theory with records really kind of captures in a way the way human cognition works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1949.085,
    "end": 1954.952,
    "text": "Because we have in our minds these kind of possible things that could happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1955.392,
    "end": 1960.598,
    "text": "And then we witness the world and process our sense information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1961.219,
    "end": 1965.364,
    "text": "And we usually make then probabilistic judgments about whether something happened.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1965.344,
    "end": 1982.188,
    "text": " uh it's dark i think that was a horse in the front yard it looked like a horse it was big it sounded like a horse i don't know why a horse would be in my front yard but i think i'm pretty sure that was a horse so that would be a potential witness for a horse in the yard type event",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1983.434,
    "end": 1984.956,
    "text": " TTR is very flexible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1985.897,
    "end": 1986.838,
    "text": "Records can be nested.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1986.918,
    "end": 1988.981,
    "text": "It can be as complex as you would like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1990.302,
    "end": 1998.652,
    "text": "It's kind of closely related to DRT, but it can do some things and has some capabilities that maybe DRT doesn't have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1999.793,
    "end": 2007.923,
    "text": "And its inference using type theory through records is potentially fast in that it depends mostly on type checking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2007.903,
    "end": 2014.716,
    "text": " So was there a boy, an individual of type boy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2014.756,
    "end": 2016.099,
    "text": "Was there a dog?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2016.98,
    "end": 2018.163,
    "text": "And so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2018.684,
    "end": 2021.068,
    "text": "And because it depends mostly on type checking,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2021.234,
    "end": 2034.41,
    "text": " play well with proof assistance for which there's, you know, sophisticated software programs to do that service proof assistance, logical proof assistance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2035.091,
    "end": 2038.635,
    "text": "So inference with TTR could be potentially fast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2039.336,
    "end": 2043.841,
    "text": "And as I said, it mimics semen cognition more so than interpretation of logical formulas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2044.662,
    "end": 2045.683,
    "text": "It's more flexible than that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2048.307,
    "end": 2048.727,
    "text": "Next slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2050.867,
    "end": 2067.306,
    "text": " So what I'm doing here, maybe I should have introduced what I'm doing a little bit, but I'm just going through some of the meaning representations that look potentially useful for the Cognar setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2068.467,
    "end": 2071.833,
    "text": " So I'm going to take a quick diversion from that, though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2071.914,
    "end": 2072.695,
    "text": "We'll get back to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2073.657,
    "end": 2077.524,
    "text": "I'm going to take a quick diversion and talk about large language models in this setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2078.727,
    "end": 2084.618,
    "text": "I think probably most users are familiar now with large language models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2084.778,
    "end": 2087.944,
    "text": "In the paper, I call them pre-trained language models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2089.19,
    "end": 2101.537,
    "text": " But they're large in the sense that they have billions of parameters, as the top graph is showing, and the size of the models is increasing over the years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2101.738,
    "end": 2108.312,
    "text": "So they essentially ingest an enormous amount of text that's available.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2108.292,
    "end": 2128.174,
    "text": " via the web and other sources and then process that text and find associations between words and between words in a sentence and between words in different sentences and things like that so that through those, you know, it learns those associations and then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2128.154,
    "end": 2146.163,
    "text": " can perform various tasks based on based on the information in those associations and um the large language models typically use some kind of transformer attention mechanism which showed in the you know high level view is shown in the bottom the graph there",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2147.037,
    "end": 2149.36,
    "text": " There's some text comes in at the bottom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2149.401,
    "end": 2155.83,
    "text": "This is a few French words, and that's encoded through an encoder.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2155.89,
    "end": 2158.514,
    "text": "That information is sent to the decoder.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2159.416,
    "end": 2161.559,
    "text": "There's attention mechanisms mixed in there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2161.579,
    "end": 2169.651,
    "text": "And then the output of the decoder is going to be some answer to a query.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2170.252,
    "end": 2175.66,
    "text": "And in this case, it's the translation of the French into English.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2177.21,
    "end": 2185.839,
    "text": " I won't go into any, you know, it's not necessary to go into any more detail about how transformers and large language model works, but that's the high level overview.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2187.926,
    "end": 2188.468,
    "text": "Next slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2191.25,
    "end": 2202.681,
    "text": " And the reason that I'm injecting this LLM discussion here is that I really wanted to talk about vector embedding, because that'll be important to the next meaning representation we talk about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2203.441,
    "end": 2220.177,
    "text": "So in using large language models, words are converted, embedded really, into vectors to capture their meaning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2220.157,
    "end": 2243.194,
    "text": " This is just a really simple sort of example, but suppose you have the word cat and suppose you have a list of a vector, really a list, a vector of 30 other words like mom and dog and tree and run and a variety of other words.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2244.693,
    "end": 2251.239,
    "text": " Well, cat is gonna be more similar to, the meaning of cat is gonna be more similar to some of those and less similar to others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2251.839,
    "end": 2254.802,
    "text": "So cat might be very similar to tiger.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2255.603,
    "end": 2263.309,
    "text": "So if tiger is in this, is one of the possibilities in this list, then that's gonna get a high similarity score.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2263.57,
    "end": 2274.379,
    "text": "So from that process, you can imagine constructing a series of numbers that are reflecting how similar some query object is to some reference objects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2275.76,
    "end": 2277.042,
    "text": " or at least reference vectors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2277.583,
    "end": 2283.431,
    "text": "So that's basically how the meaning of words is embedded into vectors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2284.112,
    "end": 2293.244,
    "text": "And then these vectors can be used in a variety of computational tasks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2294.226,
    "end": 2305.041,
    "text": "It also opens up the possibility for what's called a vector database, where on the left there, at the bottom left, the user has some kind of query.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2305.713,
    "end": 2309.981,
    "text": " For example, how do you translate this sentence from French into English?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2310.682,
    "end": 2318.295,
    "text": "Maybe has some extra content that kind of gives more information about the setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2318.315,
    "end": 2326.59,
    "text": "So maybe the content in this example is the French phrase has to do with the petroleum industry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2326.57,
    "end": 2327.391,
    "text": " for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2328.292,
    "end": 2332.537,
    "text": "It's like a little hint as to what this phrase might mean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2332.597,
    "end": 2341.967,
    "text": "That information then is embedded in vectors, and those vectors could be saved in a vector database, a very large vector database.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2342.508,
    "end": 2354.181,
    "text": "And then at the bottom right, the LLM could communicate back and forth with the vector database looking for vectors that are good matches for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2354.161,
    "end": 2359.133,
    "text": " what the query is, and then eventually the LLM spits out some kind of answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2361.218,
    "end": 2368.897,
    "text": "So that's a brief overview of vector embedding, and that'll be important in the next meeting representation we discuss.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2369.639,
    "end": 2370.381,
    "text": "Next slide, please.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2374.023,
    "end": 2380.502,
    "text": " I'm calling the disco-circ here a meaning representation, but that's not actually true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2380.522,
    "end": 2385.557,
    "text": "It's not a formal meaning representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2385.597,
    "end": 2387.121,
    "text": "It's really more a computational method.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2388.485,
    "end": 2398.147,
    "text": " So, a disco-circ, distributional compositional circuits, is kind of a mixture of category theory and distributional semantics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2398.327,
    "end": 2405.042,
    "text": "Distributional semantics is really what I was just referring to with a vector embedding of word meaning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2406.423,
    "end": 2410.39,
    "text": " And it presents a graphical calculus via string diagrams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2410.43,
    "end": 2412.654,
    "text": "An example of a string diagram is shown there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2412.694,
    "end": 2418.505,
    "text": "And this is not just a diagram that sort of shows relationships.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2418.746,
    "end": 2420.869,
    "text": "It's actually a computational diagram.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2420.889,
    "end": 2430.507,
    "text": "It's the way string diagrams are processed really implies that there's some computational aspect going on here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2432.917,
    "end": 2436.402,
    "text": " So let's just look at the at the very top left there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2436.522,
    "end": 2452.824,
    "text": "We have some entity Alice and Alice is sober and the meaning of Alice and the meaning of sober should be merged in some way to create the concept of a sober Alice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2453.264,
    "end": 2454.045,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2454.065,
    "end": 2455.287,
    "text": "And how is that merging done?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2455.427,
    "end": 2457.71,
    "text": "Well, it's depicted as a string.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2458.692,
    "end": 2462.637,
    "text": "This string diagram is shown here, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2462.617,
    "end": 2468.19,
    "text": " The vector representations of Alice and Sober are then multiplied.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2469.854,
    "end": 2475.486,
    "text": "You can think another word for vectors or complicated vectors is tensors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2475.988,
    "end": 2479.275,
    "text": "So these tensors might be very high dimensional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2480.352,
    "end": 2485.557,
    "text": " And then you have some multiplication happening in a high dimensional space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2486.338,
    "end": 2489.861,
    "text": "And that is merging the ideas of Alice and Sober.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2490.221,
    "end": 2497.288,
    "text": "And then it continues on through the rest of the graph, multiplication of high dimensional tensors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2497.368,
    "end": 2507.878,
    "text": "And then the answer is whatever the output of the last tensor product",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2510.575,
    "end": 2518.358,
    "text": " the the last event in that tensor product line of events so um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2519.536,
    "end": 2543.299,
    "text": " just a little bit i don't want to really get into category theory too much but it obviously category theory obviously is important in this sort of approach and um and as we'll discuss later it has category theory and applied category theory really it may be applicable in many of the many of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2543.279,
    "end": 2548.084,
    "text": " computational tasks that Cognar has to perform.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2548.345,
    "end": 2551.368,
    "text": "So I'll just say a few quick words on it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2552.289,
    "end": 2556.634,
    "text": "So string diagrams represent morphisms and monodal categories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2559.717,
    "end": 2562.22,
    "text": "Category objects are the nouns, the strings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2562.3,
    "end": 2566.004,
    "text": "So the string for Alice, that's a object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2566.985,
    "end": 2569.809,
    "text": "And the boxes are morphisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2569.969,
    "end": 2572.932,
    "text": "Morphisms are like maps, like functions, sort of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2574.11,
    "end": 2576.293,
    "text": " And they transform one type into another.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2576.373,
    "end": 2582.501,
    "text": "So we have the type Alice, and we have the type Solver, and then we're going to do something to merge those two types together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2583.503,
    "end": 2594.758,
    "text": "And then functors map the monoidal category of string diagrams into another category of vector spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2595.459,
    "end": 2602.108,
    "text": "And that's where this linear maps can happen, the multiplication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2602.088,
    "end": 2607.196,
    "text": " So again, this string diagram is really a computational diagram more than anything else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2607.817,
    "end": 2622.038,
    "text": "And the other thing maybe that's important here is that since we're talking about linear multiplication operations in high dimensional space,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2622.018,
    "end": 2639.048,
    "text": " um this system becomes a little it's really really best suited maybe for uh Quantum computers Quantum computers could handle the you know when they're event when as they become more and more available and as they improve",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2639.433,
    "end": 2656.53,
    "text": " quantum computers could handle this kind of situation very very well it can still be done on on on you know current systems but would really be ideally suited for quantum computation next slide please",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2660.223,
    "end": 2675.286,
    "text": " So there's variations on disco circ, uh, actually on disco cat, uh, which is the, the, the disco circ is really aimed at understanding, um, you know, how multiple sentences fit together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2675.306,
    "end": 2679.312,
    "text": "Disco cat is aimed at, uh, understanding single sentences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2680.726,
    "end": 2690.348,
    "text": " uh so a higher order version of disco cat uh as uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2692.353,
    "end": 2702.45,
    "text": " uses a Lambda calculus as a word in this higher order version is a diagram valued higher order function via Lambda calculus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2703.051,
    "end": 2706.697,
    "text": "And then the meaning of a sentence can be given by composing Lambda terms together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2706.737,
    "end": 2713.669,
    "text": "And then that ends up with a diagram that can be interpreted in the category Vect as in Disco Cat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2713.649,
    "end": 2718.136,
    "text": " So this is again a computational graph that we're looking at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2718.176,
    "end": 2720.78,
    "text": "It's for the sentence no man is an island.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2721.762,
    "end": 2730.375,
    "text": "And the pink areas in there, that is the areas where the actual vector multiplication is happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2731.57,
    "end": 2740.43,
    "text": " But because it's offering this higher order function, it can do things that a discusser can't do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2740.47,
    "end": 2744.399,
    "text": "It can easily handle adverbs, propositions, negation, quantifiers, and more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2745.101,
    "end": 2748.128,
    "text": "So this is really interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2748.108,
    "end": 2749.75,
    "text": " It has potential.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2749.79,
    "end": 2762.241,
    "text": "It may offer a way to use the system that is more applicable to conventional computing rather than quantum computing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2763.423,
    "end": 2774.453,
    "text": "And it's obviously more flexible and can process other kinds of meanings that DiscoCirc has trouble with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2775.8,
    "end": 2792.661,
    "text": " um but um it's new and it this higher order version there's not a higher order version of disco circ yet this is a higher order version for disco cat nevertheless quite interesting next slide please",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2796.117,
    "end": 2804.527,
    "text": " Okay, so now we're going to jump back and talk a little bit about the potential roles of large language models in Cognar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2804.587,
    "end": 2822.327,
    "text": "But just to kind of summarize what we've already discussed, we've talked about a couple of meaning representations or things like DiscoCirc and higher order DiscoCat that are closely related.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2822.307,
    "end": 2830.262,
    "text": " So we have a few ideas now about maybe what a Cognar meaning representation might look like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2830.302,
    "end": 2832.426,
    "text": "It's probably going to be graph-based.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2833.027,
    "end": 2838.257,
    "text": "It might lose tree structures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2840.313,
    "end": 2852.848,
    "text": " potential for, you know, especially with quantum computers, potential for kind of using a very different approach of the disco cat and higher order disco circ when it's available.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2853.529,
    "end": 2856.573,
    "text": "So that we have a few ideas that we might work from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2856.633,
    "end": 2865.504,
    "text": "And now the question arises, well, why do we even want to use a meaning representation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2865.584,
    "end": 2868.227,
    "text": "Why can't you just take text, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2868.73,
    "end": 2877.995,
    "text": " Some sentences and feed that into a large language model and and get the kind of inference that you seek do the kinds of analysis that you seek.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2879.299,
    "end": 2880.964,
    "text": "So I want to address that question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2884.072,
    "end": 2884.393,
    "text": "So.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2885.656,
    "end": 2888.279,
    "text": " Large language models, they're pretty amazing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2888.299,
    "end": 2889.44,
    "text": "They can do a lot of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2890.241,
    "end": 2895.107,
    "text": "And they've really, in a sense, taken the research world by a storm in the last few years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2895.687,
    "end": 2897.49,
    "text": "And they've been used in NLI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2897.53,
    "end": 2903.316,
    "text": "So there's numerous studies that have used large language models to perform a variety of NLI tasks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2903.657,
    "end": 2915.41,
    "text": "And there's many NLI tasks, and different databases, and complexities of sentences, and types of linguistic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2915.39,
    "end": 2924.202,
    "text": " phenomena that are used for various kinds of NLI tests in various kinds of NLI tests.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2925.724,
    "end": 2938.341,
    "text": "So from everything that's been written so far that I've digested, LLMs can be amazing, but they can also really struggle in certain situations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2938.802,
    "end": 2942.747,
    "text": "And it happens that some of those situations are the situations of Cognar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2942.727,
    "end": 2947.396,
    "text": " So LLM struggle with complex text, long text.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2949.059,
    "end": 2952.365,
    "text": "If it's not domain specific, they can struggle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2952.425,
    "end": 2955.01,
    "text": "Stories can be about anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2955.03,
    "end": 2960.661,
    "text": "They can be about industrial processes or environmental issues or social issues or political issues or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2961.062,
    "end": 2962.204,
    "text": "Story can be about anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2963.602,
    "end": 2978.443,
    "text": " And LLM struggle with that kind of variable setting, variable domains, and also struggle regarding logical reasoning, especially over long texts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2979.204,
    "end": 2985.273,
    "text": "And in some NLI tests, LLMs can really do quite poorly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2985.834,
    "end": 2988.057,
    "text": "Some they do okay, and some they can really fail.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2989.015,
    "end": 2991.199,
    "text": " LLMs can also hallucinate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2991.219,
    "end": 2995.787,
    "text": "They can kind of make up people in situations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2996.708,
    "end": 3003.601,
    "text": "And they don't generally, I'm really talking about vanilla LLMs here, but they generally don't provide explainable answers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3003.761,
    "end": 3014.179,
    "text": "And that's kind of important because, for example, I'm writing a story and maybe the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3014.159,
    "end": 3032.91,
    "text": " scores my story quality in some way maybe i get a low a low score for story quality because perhaps the story is off you know in theory perhaps the story is off topic or it's uh not just not comprehensible or it's incomplete or you know some kind of problem like that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3032.89,
    "end": 3038.139,
    "text": " And I maybe want to know why am I getting a low quality score in the story?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3038.179,
    "end": 3039.141,
    "text": "What's going on?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3039.221,
    "end": 3040.864,
    "text": "Why did you give me this score?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3041.646,
    "end": 3046.134,
    "text": "And in general, at least a vanilla LLM wouldn't be able to provide that answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3046.174,
    "end": 3052.425,
    "text": "Its answer would be, well, I multiplied all these numbers in some high dimensional space and came up with this value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3052.505,
    "end": 3055.27,
    "text": "And that's why you got a low score.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3056.515,
    "end": 3079.148,
    "text": " And in contrast to that, this is just one of many contrasts, using a story graph as an intermediary in the computational process provides several utilities, one of which is that that story graph can then be inspected visually by a user to see if the system has understood",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3079.128,
    "end": 3080.651,
    "text": " the story correctly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3081.192,
    "end": 3094.96,
    "text": "I can, if I'm, as I'm creating a story, I can view aspects of the story graph to see that, um, uh, that, uh, you know, these two persons in the story are related.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3095.0,
    "end": 3099.229,
    "text": "One works for the other, for example, the system understood that correctly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3100.627,
    "end": 3108.814,
    "text": " Um, so, uh, you know, the question here is it's not whether LLMs should be used at all in Cognar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3108.994,
    "end": 3130.633,
    "text": "It's really more of the question of, um, there's two approaches, uh, uh, an approach to natural language inference that does not use any kind of intermediate meaning representation, just, just text as input and the approach where, uh, there is a intermediate meaning representation in this case, a story graph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3130.613,
    "end": 3150.255,
    "text": " And from what I can tell in reading the literature, the LLMs are just not capable of doing all the things, all the sort of inference and analytical processes that would be necessary in the Cognar setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3150.535,
    "end": 3158.764,
    "text": "So using story graphs as an intermediary in that computational process could be, I think, more useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3159.2,
    "end": 3170.003,
    "text": " And also keep in mind that suppose that the group is very large, suppose that hundreds of thousands of people are gathering for some event to explore some situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3171.502,
    "end": 3176.128,
    "text": " And many of them are submitting long stories, long complex stories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3176.148,
    "end": 3180.614,
    "text": "Well, you would have to somehow compare all these stories to each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3180.654,
    "end": 3199.078,
    "text": "You'd have to have LLMs ingesting very large masses of textual information and then comparing their various parts and then following the logical line of reasoning through a story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3199.058,
    "end": 3205.807,
    "text": " Really, LLMs are just not up to that task as it sits today and as it looks even in the near future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3207.71,
    "end": 3208.571,
    "text": "Next slide, please.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3211.155,
    "end": 3214.599,
    "text": "But that doesn't mean that LLMs couldn't still be useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3215.28,
    "end": 3228.238,
    "text": "So the combination of LLMs and story graphs or story graph fragments is potentially useful and makes sense from what's in the literature today and what looks to be coming down the pike.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3229.602,
    "end": 3250.362,
    "text": " So for example, as a user starts to create a story graph and inputs text or spoken language into the system to create a story graph fragment, an LLM might be very useful to help understand the words of those passages",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3250.342,
    "end": 3277.513,
    "text": " and to put them into a proper story graph fragment that might be one example and another interesting really interesting approach is to use a graph a story graph as a contextual input to an llm so in in theory llms could digest graphical information and use that to provide a context for the query",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3278.978,
    "end": 3293.933,
    "text": " And LLMs might be useful, for example, in transforming story graphs or story graph fragments into natural language to export a written story of what the story graph is saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3295.145,
    "end": 3302.162,
    "text": " And several new, more sophisticated approaches are being developed for LLM.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3302.182,
    "end": 3303.465,
    "text": "There's many of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3304.227,
    "end": 3309.621,
    "text": "Some of them are actually what I've just mentioned, using graphical information as input to the LLM.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3309.781,
    "end": 3311.044,
    "text": "That's one of the approaches.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3311.024,
    "end": 3322.211,
    "text": " And another is processing the outputs of the LLM through some kind of other program, maybe a logic program to enforce semantic constraints.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3323.173,
    "end": 3325.879,
    "text": "And you can think of that actually as tool use by LLMs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3325.899,
    "end": 3329.067,
    "text": "So that's really an interesting possibility too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3330.312,
    "end": 3339.724,
    "text": " And there's many others, and these newer, more sophisticated approaches could be useful in many areas of Cognar, potentially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3340.505,
    "end": 3357.147,
    "text": "But nevertheless, it still appears to me that using a meaning representation as an intermediary, either as input to an LLM or as something that the LLM is creating from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3357.127,
    "end": 3366.207,
    "text": " Text or spoken language would seem to be the most useful and productive path to follow at this point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3368.392,
    "end": 3368.993,
    "text": "Next slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3371.707,
    "end": 3380.499,
    "text": " Okay, so now we've talked about several possible meaning representations, graph-based and not graph-based.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3380.519,
    "end": 3383.383,
    "text": "Well, yeah, graph-based and not graph-based.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3384.083,
    "end": 3390.492,
    "text": "DTR is not, type theory with records is not really graph-based, but potentially it could be converted to graphs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3392.092,
    "end": 3394.939,
    "text": " So now we get an idea of what's out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3394.959,
    "end": 3402.118,
    "text": "And now the task is, so what is the Cognar meaning representation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3403.634,
    "end": 3412.142,
    "text": " And I said in one of the early slides, whatever that meaning representation is, it's fit for purpose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3412.162,
    "end": 3415.145,
    "text": "And then we talked about what that purpose is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3415.205,
    "end": 3428.899,
    "text": "For example, be readable by both humans and computers, and facilitate analytical and inference computations, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3429.25,
    "end": 3450.398,
    "text": " so in the paper i offer a desiderata of about 20 or so items roughly 20 items um that this you know that's these are the things that we would want a cognitive meaning representation to to to do or to qualities that we would want it to have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3450.378,
    "end": 3456.424,
    "text": " And these seven that I list here is just kind of a smattering out of that larger set of about 20 or so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3460.347,
    "end": 3469.016,
    "text": "Obviously, we would want the graph to be readable by humans and computers for inference and analysis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3469.216,
    "end": 3476.723,
    "text": "And for computational reasons, I think we would want the meaning representation to be graph-based.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3478.019,
    "end": 3485.811,
    "text": " Uh, it should be capable of handling document like text stories of very, uh, stories that contain varied linguistic phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3485.831,
    "end": 3487.794,
    "text": "And there's a lot of linguistic phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3487.854,
    "end": 3494.124,
    "text": "If you're, if you're trying, if you really wanna understand natural language, there's a lot of linguistic phenomena to understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3494.925,
    "end": 3496.247,
    "text": "And some of it is quite challenging.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3497.78,
    "end": 3502.436,
    "text": " Um, I, I give examples of that kind of phenomena in the papers, in the two papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3503.701,
    "end": 3509.14,
    "text": "Uh, the story graph should be reproducible in the sense that similar stories should have similar graphs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3510.605,
    "end": 3515.013,
    "text": " Otherwise, comparing graphs would not be so meaningful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3515.394,
    "end": 3518.6,
    "text": "Comparing two stories by comparing the graphs wouldn't be very meaningful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3519.481,
    "end": 3523.369,
    "text": "The system should be able to handle metadata.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3524.17,
    "end": 3534.469,
    "text": "For example, if I'm typing in a passage of text, but I want to refer to a table, I input a table of data or maybe a figure or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3535.765,
    "end": 3540.252,
    "text": " And, uh, the, the meeting representation ought to be able to handle that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3540.772,
    "end": 3545.94,
    "text": "It ought to be, be able to handle fluid beliefs because we're not creating a story that is static.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3546.0,
    "end": 3550.026,
    "text": "We're creating a story that is, that is live and amenable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3550.546,
    "end": 3560.541,
    "text": "And if, if this happens to be a group event, that's going in rounds, I might change my story, parts of it, um, you know, over the next hour or the next day or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3561.938,
    "end": 3565.923,
    "text": " Um, and it should also be able to handle beliefs about beliefs, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3565.983,
    "end": 3577.577,
    "text": "So, but, uh, in this story, I'm telling you, I believe that such and such person is acting the way they're acting because they think that such and such is the case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3578.919,
    "end": 3591.895,
    "text": "Uh, so beliefs about beliefs, uh, you know, uh, and non-symmetric information, like in this story, I know that John is a murderer, but my neighbor doesn't know that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3593.377,
    "end": 3600.669,
    "text": " And the meaning representation has to handle uncertainty in all its forms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3601.731,
    "end": 3606.018,
    "text": "In particular, uncertainty about predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3606.319,
    "end": 3614.372,
    "text": "So part of the inactive inference, part of the cognitive process is anticipation of what",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3614.352,
    "end": 3618.976,
    "text": " will happen if some action is taken or not taken.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3619.637,
    "end": 3624.841,
    "text": "So these are predictions, anticipations of what will happen if certain actions are taken.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3625.802,
    "end": 3629.686,
    "text": "And a story, stories in general, will have predictions in them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3630.166,
    "end": 3632.208,
    "text": "Typically will have predictions in them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3632.789,
    "end": 3643.178,
    "text": "For example, if we tax rich, wealthy people more, the economy will",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3643.782,
    "end": 3647.125,
    "text": " get better or we'll get worse or, you know, something will happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3648.506,
    "end": 3659.016,
    "text": "So stories often, usually, uh, typically have predictions in them and there's uncertainty associated with those predictions and uncertainty, even about what the story is saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3659.076,
    "end": 3662.66,
    "text": "Like, I think I saw a horse in my front yard, but I'm not sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3662.7,
    "end": 3672.709,
    "text": "And, uh, if it's a horse, I really better go close the gate to the garden or, you know, sue my neighbor for letting their horse eat my corn or, you know, whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3674.157,
    "end": 3700.89,
    "text": " um so how so now suddenly you know i showed you the picture of the amr the little graph for a sentence and i showed you the store the graphs for two sentences put together max fell john pushed him now we're you can see that we're talking about something much more sophisticated here we're talking about you know predictions and models modeled you know the output of of probabilistic models and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3700.87,
    "end": 3722.035,
    "text": " um we're talking about beliefs about beliefs so that so one could imagine a meaning representation that maybe has multiple layers to it a graph based meaning representation that has multiple nodes and multiple layers and that that a user should be able to zoom in to to look at a particular part or zoom out so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3722.015,
    "end": 3727.342,
    "text": " You should be able to have various views of this meaning representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3727.362,
    "end": 3735.633,
    "text": "And maybe as you zoom out, it should be possible to just kind of summarize what you're looking at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3736.314,
    "end": 3744.445,
    "text": "If you zoom out all the way out of a story, maybe you end up with something similar to a tagline to a movie, like this is a story about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3744.425,
    "end": 3756.708,
    "text": " How a man who was once a thief turns his life around and he says it's possible for anyone in his position to do so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3757.168,
    "end": 3763.48,
    "text": "Maybe that's the overall meaning of the story, but then you can zoom in to the different details.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3764.962,
    "end": 3783.898,
    "text": " um you should also be able to confer nodes and edges in this meaning representation with with meaning so maybe a group of nodes and edges really represents say a bank you know a bank has some complicated transactions that occur within it and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3783.878,
    "end": 3799.71,
    "text": " there's ports to this bank the bank the you know people can put their savings money in this bank or take out loans and various things so you could imagine some kind of compositional or you know",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3799.69,
    "end": 3821.918,
    "text": " a set of nodes and edges that have meaning in in and of themselves and are also reusable so to make it really useful if you if i want if if many of us are telling stories about banks well it might be very useful to have some bank objects that we have in a library that we can include in our story that makes it much easier to construct the story",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3823.315,
    "end": 3830.133,
    "text": " And ideally, this whole meaning representation would be compositional in the category sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3831.396,
    "end": 3839.637,
    "text": "So in category theory, g of f, there's a function or map f and g mapping.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3839.617,
    "end": 3843.466,
    "text": " And you apply one to the results of the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3843.486,
    "end": 3845.19,
    "text": "That's called a composition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3845.771,
    "end": 3850.943,
    "text": "And in category theory, that composition preserves algebraic structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3850.963,
    "end": 3857.338,
    "text": "And then there's functors between categories that preserve structure, including the composition of morphisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3857.318,
    "end": 3875.82,
    "text": " So if it's possible, that sort of approach could be used so that it makes sense when you link computational events together in this graph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3876.541,
    "end": 3883.95,
    "text": "In a sense, the meaning is preserved or conveyed through some series of computations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3884.555,
    "end": 3885.476,
    "text": " and transformations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3886.638,
    "end": 3888.26,
    "text": "And that's different than just modularity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3888.3,
    "end": 3891.625,
    "text": "Modularity really means just the ability to chain things together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3891.645,
    "end": 3899.697,
    "text": "So compositional is kind of a more sophisticated setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3900.779,
    "end": 3909.111,
    "text": "And as I said, you should be able to reuse objects to make it really easy and fast to create graphs for some particular story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3909.091,
    "end": 3915.562,
    "text": " So these are just a small selection of the many desiderata that are listed in the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3916.023,
    "end": 3923.515,
    "text": "And whatever the meaning representation is, it would be really good if all or many of these could be fulfilled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3924.958,
    "end": 3930.627,
    "text": "Next slide, please.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3930.961,
    "end": 3936.231,
    "text": " I've already mentioned category theory, applied category theory, so just a few more thoughts on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3938.375,
    "end": 3949.837,
    "text": "Category theory can be used to reduce the complexity of a system, to understand the complexity of a system and then to work with the complexity of a system, to manage complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3950.859,
    "end": 3953.003,
    "text": "And compositionality is part of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3954.13,
    "end": 3969.692,
    "text": " And in particular, it is, I think, possible to use C-sets, which is an object from applied category theory, as property graphs as the basis of story graphs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3970.972,
    "end": 3993.049,
    "text": " So, you know, I've already showed you graph pictures of, you know, like say AMR of what kind of a simple, simple meaning representation might look like, a simple Cognar meaning representation might look like, but that could actually be stored under the hood as property graphs where a node has various, you know, flexible properties that can be attributed to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3993.31,
    "end": 3995.173,
    "text": "And same with edges, edges can have properties.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3996.335,
    "end": 4007.371,
    "text": " And all of that could be really constructed as C-sets from applied category theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4008.293,
    "end": 4015.423,
    "text": "And then there's also functors for various kinds of transformations, graph-to-graph, graph-to-text transformations that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4015.403,
    "end": 4018.947,
    "text": " kind of preserve meaning through the transformations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4019.848,
    "end": 4022.751,
    "text": "I've mentioned zooming in and zooming out and summarization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4022.791,
    "end": 4042.373,
    "text": "There's an interesting paper where an applied category approach has been used to make a system, this in the chemical world, but a systems dynamic model of a situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4042.353,
    "end": 4045.256,
    "text": " and then convert that into causal loop diagrams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4045.336,
    "end": 4050.723,
    "text": "And causal loop diagrams are kind of a simplified version of a systems dynamic model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4051.404,
    "end": 4063.378,
    "text": "And causal loop diagrams are sort of more approachable for the lay public, but still convey some of the main information that would be contained in a systems dynamic model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4063.758,
    "end": 4072.208,
    "text": "So that offers kind of one possibility of how you might zoom in and out and summarize meaning for story graphs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4073.15,
    "end": 4084.084,
    "text": " And then there's also mathematical models of group interactions and belief sharing that could be constructed using concepts like sheaf and topos theory from category theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4085.406,
    "end": 4100.666,
    "text": "So that's the application of category theory to the Cognar meaning representation and Cognar computational processes, I think, is a really rich area for exploration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4101.548,
    "end": 4101.908,
    "text": "Next slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4106.022,
    "end": 4121.044,
    "text": " So given all of that in the paper, I suggest maybe the best approach for a meaning representation is to base the meaning representation on the tree structure, the discourse representation tree structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4121.024,
    "end": 4128.534,
    "text": " And then with TTR, type theory with records, and higher order disco-circ as being also potentially interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4129.935,
    "end": 4140.91,
    "text": "But if DRTS is used sort of as kind of the main idea, then it would still have to have numerous extensions as per the desiderata.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4141.05,
    "end": 4145.175,
    "text": "So layers, compositionality, and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4145.155,
    "end": 4154.518,
    "text": " And also, I think it might be useful to use a categorical grammar, like combinatorial categorical grammar, CCG.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4155.139,
    "end": 4160.312,
    "text": "And that kind of grammar is, for example, patterns in a language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4160.292,
    "end": 4173.307,
    "text": " you know, verb noun, adjective noun, big dog, dog runs, you know, those sort of patterns would be contained in a categorical grammar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4173.347,
    "end": 4181.236,
    "text": "And then the system would understand if you use those patterns, the system would better understand what it is you're trying to say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4181.296,
    "end": 4186.722,
    "text": "So that's a form of restriction of input, user input to a categorical grammar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4186.702,
    "end": 4195.091,
    "text": " But it probably makes sense to do so to improve the capacity of the system to understand what is being said.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4195.131,
    "end": 4205.241,
    "text": "And if you were to use some kind of pattern in text that wasn't part of the category of grammar, then the system could say, I don't understand what you're trying to tell me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4205.301,
    "end": 4207.043,
    "text": "Can you rephrase that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4207.083,
    "end": 4208.184,
    "text": "Do you mean this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4208.585,
    "end": 4209.486,
    "text": "Or do you mean this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4209.826,
    "end": 4210.887,
    "text": "You know, something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4212.233,
    "end": 4231.609,
    "text": " And then, uh, one inference, one potential inference pipeline is to use a categorical grammar, create the story graph, and then send, uh, convert the story into a logical forms is like, for example, suitable for natural logic, and then send the results of that to a proof assistance, a proof assistant for a fast inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4232.973,
    "end": 4243.243,
    "text": " These are just some ideas, but at this point, it looks like this approach might be the most productive of the approaches that we've discussed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4243.304,
    "end": 4244.788,
    "text": "Next slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4248.464,
    "end": 4270.438,
    "text": " Um, so some research questions, um, I should say that this is a, this is a, it looks like a long list, but this is a short list of all the possible, uh, you know, uh, to do's and questions that could be raised about, uh, about the cognitive system and about the cognitive meaning representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4271.482,
    "end": 4287.403,
    "text": " I mean, there's really all kinds of questions, like questions that don't have anything to do with the meaning representation per se, like how do you ensure that the information being shared is not manipulated?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4287.463,
    "end": 4297.557,
    "text": "How do you ensure the quality of information that's being submitted and discussed in this Cognar setting?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4297.537,
    "end": 4300.882,
    "text": " What are the social implications of this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4301.003,
    "end": 4302.625,
    "text": "What are the legal implications of this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4303.427,
    "end": 4308.455,
    "text": "How do you protect privacy of a person's information and their stories?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4309.016,
    "end": 4311.36,
    "text": "There's all kinds of big picture questions like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4311.42,
    "end": 4313.503,
    "text": "And then there's detailed questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4313.483,
    "end": 4328.303,
    "text": " uh that need to be answered too but uh you know how do you construct what is a what is the meaning graph uh representation what is the role of of of category theory and developing the system um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4329.447,
    "end": 4333.536,
    "text": " what kinds of stories are going to be applied here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4334.057,
    "end": 4335.501,
    "text": "What are the categories of stories?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4336.423,
    "end": 4344.621,
    "text": "So just looking at the second bullet there, maybe one early step is just to create a, or excuse me, the first bullet,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4344.601,
    "end": 4347.725,
    "text": " is just to create a small set of very simple stories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4347.785,
    "end": 4363.383,
    "text": "Maybe the stories are only a short paragraph in size, and those serve then as the kind of proof of concept or as the core of what the rest of the machinery is constructed on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4364.945,
    "end": 4369.351,
    "text": "So perhaps that's a good start, generate a small set of simple stories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4369.591,
    "end": 4373.055,
    "text": "It could even be like three or four or five simple stories just to start.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4374.368,
    "end": 4390.215,
    "text": " And then using those simple stories, perhaps develop some kind of simplistic meaning representation, perhaps building on discourse representation tree structures, convey these simple stories in that representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4390.255,
    "end": 4396.005,
    "text": "And then maybe that process is even done manually at first, not in some automated fashion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4395.985,
    "end": 4416.694,
    "text": " automated fashion the automation would come later as you as you know we get more familiar from comfortable with the approach and the chosen meaning representation um as I mentioned category theory and in particular algebraic Julia which is a software in the Julia system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4416.674,
    "end": 4422.046,
    "text": " that is aimed at applied category theory could be useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4422.087,
    "end": 4425.755,
    "text": "There's various kinds of models in algebraic Julia that could be useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4425.795,
    "end": 4430.506,
    "text": "Explore C-sets as property graphs for meaning representations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4430.526,
    "end": 4433.974,
    "text": "That would be, I think, useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4435.372,
    "end": 4442.143,
    "text": " Uh, given a simple next bullet, given a simple meeting representation, explore version control systems for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4442.203,
    "end": 4458.088,
    "text": "How do, how, how are we keeping track of edits to stories so that they can, so that we have a history of edits and so that, uh, we can construct a, uh, you know, we can regenerate a story from the various original inputs in the edits.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4459.047,
    "end": 4461.294,
    "text": " And then how are stories stored?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4461.394,
    "end": 4463.821,
    "text": "What kind of database is used for storage and recall?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4464.885,
    "end": 4473.31,
    "text": "How do we zoom in and out of stories and summarize meaning when you zoom out?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4473.661,
    "end": 4476.445,
    "text": " What kind of query language is used for story graphs?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4476.465,
    "end": 4481.993,
    "text": "You have a graph and you have various questions that you want to ask about the graph for inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4482.233,
    "end": 4485.498,
    "text": "What kind of, how do you query a story graph?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4486.519,
    "end": 4487.701,
    "text": "How are LLMs used?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4487.741,
    "end": 4489.384,
    "text": "What role do they have?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4489.464,
    "end": 4495.973,
    "text": "Could they be used for generating a story graph fragment from a small text passage?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4495.953,
    "end": 4500.404,
    "text": " What is the initial simple inference pipeline?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4500.484,
    "end": 4511.751,
    "text": "Does it involve, for example, natural logic and proof software?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4513.334,
    "end": 4515.257,
    "text": " proof assistance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4517.22,
    "end": 4519.463,
    "text": "How about a simple analysis on story graphs?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4519.503,
    "end": 4522.788,
    "text": "How do you compare the similarity between two story graphs?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4526.373,
    "end": 4530.499,
    "text": "What is the first simple probabilistic model for handling story graph uncertainty?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4530.479,
    "end": 4547.239,
    "text": " and predictions how does that occur you know there's various software programs that handle a probabilistic model so you know choosing one of them and um and you know incorporating uncertainty and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4547.219,
    "end": 4552.549,
    "text": " Uncertainty really means, too, in predictions, maybe the future comes out this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4552.609,
    "end": 4558.139,
    "text": "Maybe this time I run the story, I execute the story computationally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4558.64,
    "end": 4561.927,
    "text": "The result is that events A and B happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4562.848,
    "end": 4565.012,
    "text": "And then I execute the story again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4565.092,
    "end": 4567.557,
    "text": "And because it's a probabilistic story,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4567.537,
    "end": 4592.768,
    "text": " events a and b don't happen in the second round they they happen in the some other event happens event c happens then i run the story again and again a and b happen and i run the story again and again c happens and then i run the story again and now d happens so uh you know the outcomes of a story are are variable because stories are probabilistic that's the way we understand the world",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4594.064,
    "end": 4603.66,
    "text": " So all of those are research questions to consider, ideas for moving forward, ideas for getting involved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4604.764,
    "end": 4605.627,
    "text": "Next slide, please.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4609.218,
    "end": 4612.341,
    "text": " And that's really kind of where we're at right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4614.324,
    "end": 4619.069,
    "text": "In the series of papers, I've laid out the ideas of Cognar, sort of the vision of Cognar, really.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4619.109,
    "end": 4625.015,
    "text": "And that's all that's been done on the Cognar project to date is these two papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4625.736,
    "end": 4632.163,
    "text": "There's no GitHub repository for Cognar code.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4632.944,
    "end": 4633.805,
    "text": "Nothing has happened yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4634.265,
    "end": 4635.867,
    "text": "This is fresh.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4635.847,
    "end": 4651.662,
    "text": " i i hope that the vision is interesting to not just to other researchers but the public at large and civic organizations and people who are interested in improving the ability of society to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4651.642,
    "end": 4677.413,
    "text": " cog functionally cognate and make better decisions and be functional in the group setting so i i hope this project is of interest and uh cognar really needs your help to move forward there's numerous interesting questions to explore so please reach out to me you know if you have interest",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4677.393,
    "end": 4687.306,
    "text": " Upcoming, I believe that I'll be submitting a project to the Active Inference Institute, so that'll be kind of one hub to work through.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4687.346,
    "end": 4694.456,
    "text": "I'll be involved in some additional talks, the Active Inference Institute symposium coming up, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4695.998,
    "end": 4706.151,
    "text": "I think my email address is in the papers, so people can reach me that way, or I think they can reach me through the Institute, and I encourage anyone who is interested to reach out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4707.717,
    "end": 4709.259,
    "text": " So that's all I got, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4710.922,
    "end": 4711.322,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4715.128,
    "end": 4717.392,
    "text": "A lot of places to continue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4717.972,
    "end": 4721.598,
    "text": "For people who are watching live, feel free to write a question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4722.259,
    "end": 4729.049,
    "text": "How about just to start it off, what did you get more curious about during the course of this path?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4731.873,
    "end": 4733.556,
    "text": "Oh, well...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4734.464,
    "end": 4762.497,
    "text": " you know i obviously was a process to create these papers and uh i i did you know at first when i started i didn't realize what i was up against i didn't realize how complicated this project was and i thought that i could i thought that i could create a working model of you know some code of a of a of a story graph and doing inference on a story graph and things like that and i suppose that could still be possible but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4762.477,
    "end": 4782.443,
    "text": " I realized as I went through the process that there was so much to think about, there was so much meat to this whole thing that it would be better for me to write two introductory papers that lay out the vision than actually constructing some initial version of the cognitive system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4783.553,
    "end": 4794.167,
    "text": " So, you know, it was kind of humbling in a sense, the process of humbling in a sense, in that I realized I really didn't know enough to actually start constructing the Cognar system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4794.207,
    "end": 4799.614,
    "text": "I really needed to like lay out some of the fundamentals before that step could even be taken.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4800.976,
    "end": 4801.297,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4801.357,
    "end": 4808.346,
    "text": "The papers and the presentation, it's like a whirlwind tour of linguistics and semantics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4809.71,
    "end": 4814.08,
    "text": " you're dealing and invoking with, well, you said like natural language is ambiguous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4814.601,
    "end": 4817.908,
    "text": "And then it's like, well, what does that mean when it's precisely what it is?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4817.969,
    "end": 4823.261,
    "text": "And then here's the vector representation, here's string diagrams and all these different like proofs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4824.283,
    "end": 4829.254,
    "text": "And all these interacting pieces, like the backend could have,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4830.01,
    "end": 4851.073,
    "text": " multiple parallel or or related processing methods one just doing like how many words are there over under 300 words defined by a space between the two words and then some other part could could go through llms it's like it's more like a linguistics fusion approach and also you're really focusing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4851.053,
    "end": 4862.717,
    "text": " in on the representation, not so much on the social process around how people would convene and narrativize around what it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4863.102,
    "end": 4864.303,
    "text": " Right, right, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4864.323,
    "end": 4865.204,
    "text": "That's a good point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4865.244,
    "end": 4869.828,
    "text": "The papers really are focused on sort of the nuts and bolts parts of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4870.649,
    "end": 4879.077,
    "text": "But clearly, if Cognar were to be successful, there would be a very large, potentially large social impact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4879.758,
    "end": 4889.447,
    "text": "And then there would be all kinds of questions, some of which I already raised, about how do you protect user privacy and how do you ensure that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4889.427,
    "end": 4908.887,
    "text": " quality information is being shared and discussed you know all that kind of stuff so my thinking is is that uh really i think maybe it's better to focus on the nuts and bolts parts first to get a simple uh you know to get simple meaning representations constructed",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4908.867,
    "end": 4919.643,
    "text": " conveys a few simple stories in them, figure out some of the inference methods that might work best for this, those kinds of nuts and bolts questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4920.284,
    "end": 4932.501,
    "text": "And then once you have something to kind of show and tell, once you have a little small working model, then start to explore how you use this in the social setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4932.601,
    "end": 4937.008,
    "text": "How do you engage people to participate in Cogner?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4937.048,
    "end": 4937.929,
    "text": "How does that work?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4937.909,
    "end": 4948.57,
    "text": " And even there, I imagine the process that'll happen if the project moves forward is that there'll be maybe the initial work on this will be kind of slow and detailed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4948.61,
    "end": 4959.09,
    "text": "But as things, as artifacts start to be developed and there starts to be something to kind of put you, something you can hold in your hand,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4959.07,
    "end": 4981.433,
    "text": " then there'll be a little wider circle of researchers and you know others from the civic society and just ordinary people who become interested in the project and start to contribute and as that grows eventually there'll be a you know start to be a little bit more of a critical mass that oh this is really starting to be a thing we have you know there's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4981.413,
    "end": 4983.235,
    "text": " We're starting to get a repository for this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4983.256,
    "end": 4999.658,
    "text": "We're starting to understand how it could be used, what it would look like, how we engage people, how we make this easy to construct stories, story graphs out of stories, how we ensure that the dialogue and the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4999.638,
    "end": 5006.49,
    "text": " discussions and the sharing are healthy and useful for cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5006.891,
    "end": 5014.204,
    "text": "And also numerous questions, as that happens, there'll be more and more of the social questions will come into play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5015.264,
    "end": 5039.668,
    "text": " there's also like all kinds of other questions like how do you like in the nli setting it's really uh straightforward how you measure success you know you you you have a fixed set of sentences you know you know this is their gold standard so you know what the actual meaning of these sentences is and then you score the model or system that you're constructing on how well they reach the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5039.648,
    "end": 5041.731,
    "text": " actual meaning of these sentences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5042.413,
    "end": 5043.595,
    "text": "Well, they convey the actual meaning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5044.035,
    "end": 5046.56,
    "text": "Well, how do you do that in the Cognar setting?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5046.6,
    "end": 5052.53,
    "text": "Like, how would you actually do a study to prove that the Cognar system is understanding properly what you're saying?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5052.57,
    "end": 5058.72,
    "text": "It becomes a little more complicated because now you're engaging the user in creating the story",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5058.7,
    "end": 5079.342,
    "text": " in an interactive fashion so it's a you know even studying the cognitive system you know from a scientific standpoint becomes a little bit more complex right because users are actively engaged in in the dynamics and and for that matter you know how do you how do you how do you assess",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5079.322,
    "end": 5080.984,
    "text": " the quality of cognition?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5081.445,
    "end": 5082.927,
    "text": "That's a really interesting question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5083.347,
    "end": 5094.903,
    "text": "In one of the early slides, I suggested that active inference can be used as a means to assess what functional cognition looks like versus dysfunctional cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5095.644,
    "end": 5105.076,
    "text": "Maybe you can think just off the top of your head of a few examples where that would clearly be a symptom of dysfunctional cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5105.056,
    "end": 5123.271,
    "text": " For example, if I had a pattern, as a person, if I have a pattern of making really poor predictions about what's going to happen next, you know, I see a lion in the road and I think, oh, that's a pet lion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5123.472,
    "end": 5125.275,
    "text": "I'll walk up to it and pet it on the head.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5125.593,
    "end": 5127.115,
    "text": " That's a really poor prediction, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5127.135,
    "end": 5132.423,
    "text": "So those kind of pattern of poor predictions might be a sign of dysfunctional cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5133.144,
    "end": 5138.612,
    "text": "Well, how do you assess functional versus dysfunctional cognition in this group setting, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5139.493,
    "end": 5147.044,
    "text": "There's many interesting avenues just in that question alone, many interesting avenues to explore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5147.024,
    "end": 5173.791,
    "text": " uh for example the brain seems to you know information flow in the human brain seems to occur at that edge of chaos concept you know it's it's not it's stable the system is stable but almost unstable and because it's almost unstable potentially an input from off to the side an intuition from off to the side can",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5173.771,
    "end": 5197.247,
    "text": " rapidly change the setup so that i switch gears and now i realize that that lion really is dangerous and i'm going to uh you know jump out of the way really fast so that's a system on the edge of chaos really is in many ways a the most efficient processing system you know it's most amenable to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5197.227,
    "end": 5201.874,
    "text": " input, it's most flexible, and yet it retains its kind of core stability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5201.914,
    "end": 5216.975,
    "text": "So these ideas of chaos and other ideas from complex system science could actually be used for assessing information flow in the cognitive system and kind of the quality of information flow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5217.816,
    "end": 5224.686,
    "text": "That's just one idea, but there's dozens of related avenues you could follow just on that question alone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5225.932,
    "end": 5231.783,
    "text": " I'll ask a live chat question and then anyone else write a live chat question or I'll add anything if we have time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5232.525,
    "end": 5236.513,
    "text": "Andrew writes, Dr. Boyk, thank you for presenting your work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5236.533,
    "end": 5238.156,
    "text": "It's a very interesting project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5238.176,
    "end": 5241.202,
    "text": "Do you have any thoughts on implementation in terms of code, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5241.282,
    "end": 5243.907,
    "text": "any particular programming languages or libraries?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5245.085,
    "end": 5270.063,
    "text": " um well um i'm a fan of julia so in the papers i i i uh i uh suggest various uh probabilistic software programs and uh uh an algebraic julia system that i've already mentioned in this talk uh julia is fantastic uh for a variety of reasons speed and other reasons",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5270.043,
    "end": 5284.322,
    "text": " now that being said this project doesn't have to be constructed in julia but i see i see julia as a potential resource for constructing this and and maybe as a place to start you know initially",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5287.154,
    "end": 5307.61,
    "text": " You know, certainly Julie is an open source project, so is Python, but you would want to engage the open source community as much as possible in this project because there's, you know, around the world, there's just so much talent and so many good ideas can come from that world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5309.075,
    "end": 5317.085,
    "text": " Just on that topic, maybe this is kind of an aside, but this is conceived to be an open source project.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5318.126,
    "end": 5324.573,
    "text": "And one of the reasons I conceive it to be that way is you could imagine, suppose that Cognar was successful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5325.194,
    "end": 5328.538,
    "text": "And suppose that you had a repository of stories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5329.499,
    "end": 5336.027,
    "text": "And again, each story is conveying the belief system of a human in relation to some situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5337.037,
    "end": 5339.92,
    "text": " Suppose you had a repository of a million stories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5340.561,
    "end": 5351.495,
    "text": "You have this really rich information about how people think in different situations, in a variety of different situations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5351.755,
    "end": 5357.622,
    "text": "And that kind of information is very powerful, very powerful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5358.383,
    "end": 5366.773,
    "text": "And you would not necessarily want some private entity, like a corporate entity, to have control over that whole thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5366.753,
    "end": 5393.149,
    "text": " I think you would really want some kind of open governance, an open source project controlled by some governance framework to ensure that this whole thing is used for a common good, that it's really used for purpose, for its purpose, intended purpose, which is to facilitate a group cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5396.639,
    "end": 5402.262,
    "text": " A comment in the chat, Saskia wrote, life is thriving on the edge of chaos and order.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5403.592,
    "end": 5408.778,
    "text": " So it's this kind of paradox and the precarious nature of the body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5408.958,
    "end": 5411.741,
    "text": "Like how much oxygen storage does the body have?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5412.102,
    "end": 5421.953,
    "text": "Very little, how much water, how much nutrition, like there's different kinds of reservoirs, but it isn't just trying to hold on to flows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5422.533,
    "end": 5428.3,
    "text": "So that gives streamlined nature adaptive and on, on the critical",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5428.28,
    "end": 5455.131,
    "text": " frontier and then at the same time also precarious over different time scales and this is making it explicit with the narrative and cognitive infrastructure as the information processing semantic linguistic narrative elements of our ecosystem become like more and more intermediative more and more active more and more powerful",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5456.36,
    "end": 5457.682,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5458.463,
    "end": 5474.605,
    "text": "As an offshoot to that comment, I think that democracy, the idea of democracy, could be framed in that edge of chaos view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5474.585,
    "end": 5496.323,
    "text": " in the sense that in a democracy what you would really like is that each person has the potential to influence the the group as a whole this you know the condition of the group as a whole and that's that's what that edge of chaos you know allows because it a lot it's it's it's as i said before this system is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5496.303,
    "end": 5512.191,
    "text": " stable, but just on the edge of maximal flexibility, so that an input from some person, like an idea, a comment in a democratic system, can actually change the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5512.311,
    "end": 5517.4,
    "text": "Or a small group of people can actually change the system with some good input.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5517.38,
    "end": 5545.581,
    "text": " So I think that not only is the edge of chaos model maybe useful for Cogner, but it might actually be useful as we explore the interplay between what is a political system, really even what is an economic system, what is a political system, what is an economic system, what is a legal system in the context of the goal of group cognition, either societal cognition or otherwise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5546.489,
    "end": 5563.047,
    "text": " Yeah, another, I think, really important point with the juxtaposition you made of graph-based, more formalized, non-distributional semantics and using LLMs to project onto those formal structures, generate from them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5563.027,
    "end": 5576.386,
    "text": " First off, how incredible that from a semantic graph, we could generate materials in many natural languages, many lengths to many different audiences, if only for a starting point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5576.406,
    "end": 5579.31,
    "text": "So just on the generation side, that's very powerful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5579.35,
    "end": 5587.802,
    "text": "And then an interesting thing to consider is like the information supply chain, for example, for someone's voice in a group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5587.782,
    "end": 5612.625,
    "text": " so then if people's inputs are taken as a blob of text smashed into a very large model and then it comes out then the information supply chain of that perspective has been collided with a very large billions of parameters lot of tokens of training and then the supply chain of the resulting outcome is like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5613.247,
    "end": 5624.839,
    "text": " group perspectives provided and whatever the question mark unknown training and inputs supply chain that are obscured for a proprietary LLM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5624.859,
    "end": 5629.384,
    "text": "Or even if it's an open source, totally open LLM, you'd still have a complex information supply chain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5630.044,
    "end": 5639.254,
    "text": "So this opens up an opportunity for end to end or in early stages or later stages or parallel stages",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5639.369,
    "end": 5648.102,
    "text": " to be able to have the kind of, for example, counterfactual reasoning, like, here's how this graph looked with and without.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5648.663,
    "end": 5653.851,
    "text": "Here's the distribution of outcomes with and without what this traceback had done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5654.672,
    "end": 5665.709,
    "text": "And then there's kind of a trade-off if there's a more simple, more symbolic system, like more code-like, more formal semantics, then the traceability will be deeper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5665.769,
    "end": 5668.313,
    "text": "Explainability, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5668.445,
    "end": 5679.671,
    "text": " And then if you make it more statistical, it'll start getting blurred in with more and more other factors just probabilistically, but it still could be disentangled.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5679.691,
    "end": 5686.487,
    "text": "So it's like the LLM route has the fluency and a lot of other advantages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5686.467,
    "end": 5696.766,
    "text": " And strengths and then also having more traceable like rails and flesh in tandem could give, it's just a design palette.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5696.786,
    "end": 5701.134,
    "text": "It's not that one or the other or the blender, it's situational, but using the two together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5702.136,
    "end": 5702.977,
    "text": "Good point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5702.997,
    "end": 5708.948,
    "text": "You actually raise numerous good issues there that are worthy of, you know, prolonged discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5709.029,
    "end": 5720.673,
    "text": " But one of the points you raise, and it's a really good point, is that there isn't just one model in Cognar to digest information from a group of stories and present it to the group as a summary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5720.713,
    "end": 5724.861,
    "text": "That's not just a single model doing that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5724.841,
    "end": 5747.71,
    "text": " there can be many different views many different questions many different queries you can just like uh you know just like the inf like how do you summarize the information about a nation well there's all kinds of you know ways to do that there's graphs about the economy there's graphs about health there's grab you know like there's there's many ways to to to put together the information from us from a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5747.69,
    "end": 5749.952,
    "text": " body of information to make sense of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5750.493,
    "end": 5757.639,
    "text": "And Cognar would, you know, most likely would be multiple models, some of which would be maybe more explainable than other models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5757.8,
    "end": 5761.083,
    "text": "Maybe, you know, some logic models might be very explainable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5761.783,
    "end": 5764.686,
    "text": "Some results of LLM models might be less explainable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5765.307,
    "end": 5774.035,
    "text": "But nevertheless, there would be a history of, you know, edits to story graphs, a history of how story graphs evolved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5774.015,
    "end": 5792.782,
    "text": " There would be the possibility of looking backwards in retrospect to assess how the evolution happened, how ideas developed, how different models might have looked at that information differently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5792.802,
    "end": 5798.79,
    "text": "Then you could assess the capability of Cogner in retrospect about how it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5798.77,
    "end": 5818.973,
    "text": " how it handled various situations you could assess the functionality of the group process like was this functional cognition were did were many voices heard was that information used did was it represent anything on the edge of chaos where you know a single voice could have an influence over the whole",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5820.151,
    "end": 5836.32,
    "text": " You know, because there's a history, say, you could examine that trajectory in various ways and assess your system and assess the group process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5836.452,
    "end": 5859.507,
    "text": " one interesting side inter point one to point two discussion was around like classical and quantum information fungible and non-fungible information and how like the single source of truth that you invoked last time even though that's a fractal concept just this get",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5859.655,
    "end": 5878.913,
    "text": " branch as its own sort of time cone of traceability of classical information there are certain operations that you can do like the diff the merge the rebase and all those kinds of different decisions however the actual non-fungible cognitive entities",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5879.078,
    "end": 5902.116,
    "text": " it doesn't work like that so it's this interesting tension between how enabled on certain dimensions these representations are but of course those are not the first person perspective on semantics the whole point of of the second paper is to to throw some approaches to this question of what can you make that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5902.568,
    "end": 5913.78,
    "text": " represent semantics, but then immediately to whom slash how, and they do, they represent and are different things to different views.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5914.0,
    "end": 5923.41,
    "text": "Like for example, just the visual view of a figure, and then the more statistical analysis on the graph, is that the same semantics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5923.47,
    "end": 5926.353,
    "text": "Is that different semantics, even though it's like the same representation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5926.393,
    "end": 5930.938,
    "text": "And so how does the representation do relevant work",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5931.644,
    "end": 5955.171,
    "text": " in a specific cognitive ecosystem and that's sort of like the systems design and the metacognitive engineering question especially if not too strong of even though this is hard to to peel back to but what what biases and what priors and what biases and those are those are the same distribution",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5955.742,
    "end": 5956.163,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5956.303,
    "end": 5968.553,
    "text": "And clearly the system would have to be very transparent to be able to, you know, assess all of that, to assess biases in the system, to assess biases in, you know, the way Cognar assesses similarity between stories or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5969.917,
    "end": 5973.944,
    "text": " So there's certainly a lot to unpack with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5974.425,
    "end": 5979.474,
    "text": "I do want to just briefly mention something that we talked about in the first talk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5980.235,
    "end": 5990.693,
    "text": "And that is just to emphasize that we've been talking about groups forming to explore some topic or situation of interest to them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5991.027,
    "end": 5995.578,
    "text": " Cognar actually has a wide range of use cases, some of which don't look like that at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5995.979,
    "end": 6006.285,
    "text": "Cognar could be used, for example, in customer service for a corporation where people are maybe submitting a story graph to explain why they're",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6006.265,
    "end": 6012.738,
    "text": " gadget broke or didn't work or why it broke or how it broke or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6012.778,
    "end": 6016.766,
    "text": "So there's really a wide range of use cases for this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6017.668,
    "end": 6027.548,
    "text": "And secondly, as I conceive of Cognar, it's agnostic to how the group wants to operate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6027.528,
    "end": 6027.849,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6027.889,
    "end": 6046.65,
    "text": "So it's not forcing a group to use, you know, if say it's engaged, a group is engaged in decision making, it's not forcing a group to use majority, you know, you know, in voting use majority rules or or rank choice voting or some other system of voting or.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6046.63,
    "end": 6072.098,
    "text": " some other you know arrangement of how the group is structured you know whether it's an autocratic group or a democratic group or whatever the cognar is intended to be kind of agnostic to the group setting and so that means that there's a variety of types of groups with different interests and different structures and different rules and different methods and different approaches can all use cognar in the way that they see fit",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6072.854,
    "end": 6102.321,
    "text": " know there obviously might be some restrictions on how it's used but by and large it's flexible and and a kind of an open system so that so that you know various kinds of groups can use it for various purposes but whatever the you know the the the system is whatever group uses it for whatever purpose the the system is learning from the engagement the system is you know the come back in computational system is learning",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6102.993,
    "end": 6130.84,
    "text": " you know, how people think what they, what they, what they think will happen next when this and that happens, how, how better to, how better to summarize information or, you know, present information or encourage a group to move towards well-supported decisions when they're trying to make decisions or, you know, like all of that kind of stuff, the system is learning in the background, you know, uh, uh, just like, uh, an intelligent agent would learn in a, in a new setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6134.768,
    "end": 6135.149,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6135.629,
    "end": 6142.639,
    "text": "So maybe just what are some of the possible anticipated milestones for the rest of the year?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6145.003,
    "end": 6155.497,
    "text": "Oh, I most likely will try to... These two papers are in preprint, so I most likely will try to submit them to journals for publication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6156.178,
    "end": 6162.227,
    "text": "Although they are kind of conceptual papers, they're not the normal type of research paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6163.642,
    "end": 6165.044,
    "text": " They're concept papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6167.367,
    "end": 6168.048,
    "text": "So that'll happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6168.108,
    "end": 6174.357,
    "text": "I'll start a group, a project, at the Active Inference Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6174.377,
    "end": 6177.321,
    "text": "And I encourage people to reach out to me on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6177.822,
    "end": 6184.811,
    "text": "And really, I hope to pick one or two of these research questions myself and focus on that next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6185.692,
    "end": 6189.818,
    "text": "So hopefully, there'll be a couple of more papers coming out at some point here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6189.798,
    "end": 6200.989,
    "text": " and um you know really it's up to the community as to what happens from there i'll do what i can and if people like the idea maybe someone will jump in and you know participate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6202.96,
    "end": 6219.315,
    "text": " And maybe just in closing, and we're almost done now at the end of these two sessions, and maybe it would be just a good idea to kind of look at the big picture a little bit as to, like, why are we doing, why is this of any interest to anyone, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6219.375,
    "end": 6222.478,
    "text": "It's an interesting academic excursion for certain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6222.558,
    "end": 6227.923,
    "text": "There's all kinds of, you know, basically touches on numerous scientific fields.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6228.623,
    "end": 6232.647,
    "text": "So there's all kinds of good research questions, but why should we even do this, you know?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6233.993,
    "end": 6258.567,
    "text": " and uh to that i would say there is a you know at least i'm i'm proposing that um groups can be thought of as organisms cognitive organisms and as cognitive organisms groups you know whether they're societies or corporations or civic clubs or whatever need to be able to be functional like make good decisions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6258.547,
    "end": 6271.092,
    "text": " act in the way that active inference kind of lays out in that they're, you know, a functional group is going to reduce the uncertainty about achieving the kinds of conditions that are good for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6271.673,
    "end": 6276.583,
    "text": "You certainly would want that for society and you even want it for human civilization as a whole, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6276.924,
    "end": 6278.547,
    "text": "It would be good if humans",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6278.527,
    "end": 6296.35,
    "text": " reduce the uncertainty that we live in a good kind of world that people flourish in right we would want that for everybody and um when you look around today there's obviously uh many many examples of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6296.33,
    "end": 6302.324,
    "text": " what appear to be more decision-making on the part of humans, because we face really a poly-crisis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6302.926,
    "end": 6311.526,
    "text": "Climate change and extinction rates are skyrocketing and we are in danger.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6311.586,
    "end": 6314.794,
    "text": "Humans are in danger, serious danger.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6315.55,
    "end": 6337.17,
    "text": " and um new ways of of looking at our situation our condition i think are needed in order to maybe steer a different direction to inspire a different kind of organization for society that is more functional that that does exactly what a functional organism does it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6337.15,
    "end": 6347.288,
    "text": " senses its world, it makes decisions that are good for it, that reduce the uncertainty about achieving the conditions that it needs to thrive and continue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6348.751,
    "end": 6357.927,
    "text": "And I think that a high-level approach to small groups, large groups, societies,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6358.261,
    "end": 6379.847,
    "text": " holds great promise great potential to to suggest ways that where we might not be doing well and where we could do better and and opens up a whole host of really i think useful questions about how could humans humans groups whether we're talking about small human groups or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6380.671,
    "end": 6409.125,
    "text": " Nations and civilization as a whole, how can we reorganize ourselves to achieve what we actually want, but to function, you know, purposefully through, through organizations and institutions and rules and mechanisms that are fit for purpose, but actually our quality functional processes through which we can sense our world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6410.219,
    "end": 6421.504,
    "text": " anticipate what's going to happen next, make good decisions, and reduce the uncertainty that there are future conditions are really what exactly we need to thrive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6421.545,
    "end": 6427.097,
    "text": "So there's nitty gritty detail to this project,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6427.077,
    "end": 6456.274,
    "text": " that that are important and interesting and then there's this big picture that i think is really really useful to to think of you know of of how how viewing groups as organisms that are cognitive and that cognition has a purpose functional cognition can be you know described and used as a target for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6456.254,
    "end": 6462.081,
    "text": " moving human groups towards a future where we are simply more functional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6462.161,
    "end": 6471.233,
    "text": "And I suspect that through the process of evolution, each of us, or most of us, crave, you know, are missing that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6471.293,
    "end": 6481.165,
    "text": "Maybe we don't even know what we're missing, but once you get a whiff of what functional cognition and good decision making and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6481.145,
    "end": 6505.144,
    "text": " and fairness and all that other kind of you know things that go with it once that what what once you get a whiff of what that feels like i suspect that there would be a great sense of relief you know for people they would go like oh god i i'm so glad we you know we can get together as a group and be functional and make you know good decisions and we have a we have some clue as to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6505.124,
    "end": 6532.161,
    "text": " how to assess the quality of our interactions and our in our cognitive process so that we we know that we're aiming towards a future that is really substantially better than the poly crisis that we now exist in all right thank you john great time thanks for having thanks for having me yep okay thanks everybody in live chats too thank you",
    "speaker": "SPEAKER_01"
  }
]