[
  {
    "start": 8.063,
    "end": 18.478,
    "text": " okay hello and welcome everyone this is the 2024 review stream it's december 20th 2024.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 20.011,
    "end": 22.294,
    "text": " Welcome to the Active Inference Institute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 22.314,
    "end": 27.821,
    "text": "We're a participatory online institute that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 29.022,
    "end": 34.549,
    "text": "This is a recorded and an archived livestream, so please provide us feedback so we can improve our work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 35.47,
    "end": 40.737,
    "text": "All backgrounds and perspectives are welcome, and we'll follow video etiquette for livestream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 40.717,
    "end": 45.851,
    "text": " Head over to ActiveInference.Institute to start to find out more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 46.613,
    "end": 54.253,
    "text": "And for those in the live chat, we will greatly look forward to your comments and questions and we'll return to them at the end of the stream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 55.415,
    "end": 74.419,
    "text": " okay so today in the review stream as we have done for the two previous years we're going to recap reflect on the streams and video production of 2024",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 74.399,
    "end": 95.884,
    "text": " and preflect to 2025 in other words to take a break from streaming and documenting and typing while out there driving through the active fields to take a look back so that we can be how",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 97.147,
    "end": 100.191,
    "text": " and why we want to be in the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 101.232,
    "end": 106.139,
    "text": "So maybe by way of intro or warm up, Dean, where are you at?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 107.581,
    "end": 110.665,
    "text": "How do you reflect on the reflect?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 111.986,
    "end": 118.655,
    "text": "Well, I honestly, Daniel, think that this is probably one of the most valuable exercises one can carry out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 119.917,
    "end": 126.225,
    "text": "Again, you don't have to have been there every day that another",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 127.673,
    "end": 131.863,
    "text": " another piece of content was captured.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 132.244,
    "end": 143.893,
    "text": "But I do think that being able to take one of these step back and have a look at the entire cycle is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 144.599,
    "end": 148.043,
    "text": " It's just super insightful in terms of my own learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 148.203,
    "end": 152.227,
    "text": "And I think it's, again, something that there is no proxy for you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 152.648,
    "end": 169.165,
    "text": "You either show up on these days and you come away way smarter or you think you know it all until you look back and you go, whoa, holy mackerel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 169.185,
    "end": 170.907,
    "text": "So I love doing this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 172.549,
    "end": 172.969,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 173.101,
    "end": 175.403,
    "text": " OK, let's just jump in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 175.444,
    "end": 178.106,
    "text": "We'll see where we get to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 178.467,
    "end": 179.628,
    "text": "We'll see where we triangulate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 179.828,
    "end": 182.571,
    "text": "We'll see what else people put in the chat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 182.591,
    "end": 202.753,
    "text": "OK, so here's a screenshot on the right side of the back end organizing of audiovisual production, which is truly something like see an interesting paper or other shared note in the ecosystem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 203.273,
    "end": 230.395,
    "text": " find the contact information for that or those people send them a templated invite or sometimes a slightly personalized invite coordinate the date set up the format that they're interested in make a row in this table and then lights camera action end stream and that's happened now three four five hundred times",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 230.375,
    "end": 259.521,
    "text": " so as the sample size grows on on this and other fronts again so much of the looking back becomes even the more valuable and this year there were 137 such scenes for which there was also a behind and a before during after and we're going to use that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 259.501,
    "end": 270.131,
    "text": " Obviously, we could just play the 137 videos concatenated with each other and have a 220 hour or whatever it would be sequence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 272.253,
    "end": 285.306,
    "text": "We could just line up every bird in the ecosystem, or we can do something that's fun and weaves in the past and the present and the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 286.096,
    "end": 299.025,
    "text": " So a few highlights that I expect we will enjoy thinking about how this might go about those 137 videos.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 300.322,
    "end": 307.494,
    "text": " One of them was the majority of the Active Inference Insights episodes that Darius Parvizi-Wayne made.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 307.514,
    "end": 318.972,
    "text": "These were basically the only video productions in Institute time that I didn't play a role in, so that's not the only reason though.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 318.952,
    "end": 344.875,
    "text": " uh they're also the most popular video productions that the institute has ever made possibly because of darius's charming nature and easygoing conversational style and format but they truly were great sessions as characteristic as well we had many fascinating guest streams ranging from the the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 346.188,
    "end": 365.715,
    "text": " hurried to the beyond deliberate we had probably the two longest streams of my life like that's a don't hold me to it but but probably um above 80 on that the two mega streams of the symposium and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 367.383,
    "end": 388.564,
    "text": " only two paper focused live stream series with a full dot zero dot one dot two with the authors and that was interesting and different maybe we can explore uh how that came to be with only two papers being discussed but over the previous",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 389.894,
    "end": 413.978,
    "text": " three years we did 56 then dot dot dot question mark question mark and math art so i'll let you share what did you see in this orthogonality and space between well one of the things that we when we do these presentations even today's review stream it's",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 414.987,
    "end": 417.955,
    "text": " It sets itself up, as you said, we can line up all the birds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 418.376,
    "end": 424.391,
    "text": "We've got the bullets and everything is sort of in nice, neat rows and columns and stuff like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 424.411,
    "end": 432.051,
    "text": "But one of the things that if you are able to internalize the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 432.554,
    "end": 448.875,
    "text": " process of active inferring and consider yourself maybe a subject matter expertise in X and be an active inferrer, then the question becomes, okay, so, well, what does that mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 449.336,
    "end": 462.493,
    "text": "One of the metaphors I might suggest is that you move from just being able to pivot or slide or take in each bullet in a sequence",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 462.811,
    "end": 477.192,
    "text": " and start developing this sort of 360 degree view that you already have been afforded, even though you don't have eyes in the back of your head, you're kind of aware of everything in your niche around you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 477.272,
    "end": 482.28,
    "text": "There's an advantage in not just being stuck with the blinders on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 482.7,
    "end": 491.333,
    "text": "The math art of that kind of sets up that 360 degree potential or policy because it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 491.38,
    "end": 514.685,
    "text": " The way I would describe it is if you have math at zero or part at 360, and then you have this ability to come full circle, complete a cycle, it just creates the kind of gapping situation where going off on tangents isn't just going down rabbit holes, so to speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 514.705,
    "end": 520.712,
    "text": "There's some real potential to gain some sense of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 521.215,
    "end": 535.45,
    "text": " how the pattern recognition works, why certain patterns you can take your eyes off of because you think that they're going to be stable, why others seem to dissolve and percolate up in completely other different contexts and you don't recognize them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 536.11,
    "end": 547.662,
    "text": "But us taking this potential of holding up to things that are perceived as being far apart and not having to necessarily build a bridge",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 548.013,
    "end": 573.497,
    "text": " across it but just be able to say okay so what happens if you keep an eye on both at once it can it can um it can change the way you think yes both at once it just makes me sort of think about the representations of insect vision being all compounded and sort of pixelated",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 573.646,
    "end": 601.088,
    "text": " when we also have just the minimum of two eyes with a unity of perception and then that even goes outside of our visual field with just our spatial and temporal situational awareness okay let us begin so the stream series in no particular order just basically haphazard so there were",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 602.823,
    "end": 632.83,
    "text": " several dozen guest streams ranging from january up through just a few days ago again there are interfaces and tables that you can search for keywords you can sort by date you can download the tables you can put them into llms you can do all sorts of different things with these um is there any that you wanted to make a comment on dean or maybe i'll pick like one or two two aspects from here just from this moment",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 632.81,
    "end": 639.784,
    "text": " I just picked one, and that was Juan Diego's What Could Come Before Time, because I really thought he did.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 640.927,
    "end": 651.388,
    "text": "Well, again, he's the, well, he's more than Hercel, but he uses a lot of Hercel's thinking, and I've always found that quite interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 653.352,
    "end": 653.653,
    "text": "Hmm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 654.882,
    "end": 671.811,
    "text": " and that brings me to another what is the limit question and which of these guest streams are topical like the topic of embodied intelligence which one ask a question which one present attention",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 672.28,
    "end": 674.443,
    "text": " or what they do just in the title.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 674.963,
    "end": 693.968,
    "text": "I think some other highlights I see are whether it's Anna Pereira or David Blumen, Robert Warden, John Boyk, seeing the research fellows before and during their fellowship also play a guest at the home field.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 693.948,
    "end": 713.239,
    "text": " and i think the one that just i'm drawn to in the moment is the marshall mcluhan and project 69 gas stream 69 with andrew mcluhan because it it was just an awesome example i think and hope",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 713.219,
    "end": 738.585,
    "text": " of of actively inferring seeing what happens rolling the die there was a last minute cancellation that otherwise that would have been number 70. so to but it happened to be 69. it happened to connect up all of these dots and and that was the through line that that I still",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 740.877,
    "end": 768.488,
    "text": " i guess that's the question enjoy and reflect on it and learn again from with or without re-listening yeah you you don't necessarily think these things should just work out the way they do but when they do it's it's like oh okay i'm glad you mentioned um roberts because i think he",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 768.839,
    "end": 772.343,
    "text": " he laid, he, he's another good litigator of his, his ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 772.363,
    "end": 781.494,
    "text": "And he laid out a really good story with some people who could really, you know, shredded his ideas, but they had to sort of keep an open mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 781.534,
    "end": 790.145,
    "text": "And even though they asked some good questions, he was, he was really comfortable in sort of explaining what he thought he'd unearthed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 790.345,
    "end": 792.788,
    "text": "So I thought that was really glad you mentioned Roberts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 792.828,
    "end": 794.43,
    "text": "I really liked his too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 794.45,
    "end": 794.61,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 796.025,
    "end": 814.675,
    "text": " And also cool to see interns and just I hope we can continue with the contributions of others in the coming years more and more to curate and invite broadly and globally and timely and relevantly because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 815.718,
    "end": 826.335,
    "text": " we can keep one foot in active inference through multiple different ways and still be in triple threat and pivot and assist",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 826.568,
    "end": 856.575,
    "text": " and connect and reach out to people and sometimes it's as easy as just present and then let's see what the live chat says other times we or they want to do a little bit more prep to make sure there's going to be some um some clips on that rock climbing face that we're going to go on together but the guest stream is just a really unique opportunity for people who like to think active inference and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 856.555,
    "end": 859.69,
    "text": " And then they run into that Mad Lib.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 860.133,
    "end": 861.077,
    "text": "They run into that bar.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 862.243,
    "end": 864.836,
    "text": "So fun times with the guest stream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 864.856,
    "end": 865.097,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 867.473,
    "end": 894.561,
    "text": " live stream so this is sort of the um the the the one that's named after itself because they're all live streams basically but the live stream serie itself as mentioned earlier focuses on a specific paper so when i look at these two papers that we discussed which were in the first half of the year working with chris bennett",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 894.541,
    "end": 905.182,
    "text": " on preparing and executing the active data selection information seeking paper, which Thomas Parr and Carl Friston joined for the discussion of.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 906.003,
    "end": 910.592,
    "text": "And then in the second half of the year leading up to the symposium,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 910.572,
    "end": 921.042,
    "text": " working with Arun Niranjan on From Pixels to Planning, Scale-Free Active Inference, which Lance DaCosta and Carl Friston joined for.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 922.523,
    "end": 925.466,
    "text": "These were heavy papers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 926.567,
    "end": 930.751,
    "text": "Every paper is different, some more so.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 931.412,
    "end": 937.518,
    "text": "And these were really heavy, analytically complex papers in certain ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 938.519,
    "end": 939.82,
    "text": "And yet in that,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 941.183,
    "end": 943.92,
    "text": " ever so delightful active inference way",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 946.01,
    "end": 952.237,
    "text": " people had intuitive grasps and resonances with them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 953.098,
    "end": 972.338,
    "text": "Active data selection, whether it's the iCicade or the machine learning case, is about looking not just where you know, not just where you don't know, but looking where the information gain is going to be the highest and understanding how is that structurally set up",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 972.824,
    "end": 987.064,
    "text": " So that again, sometimes you have the most information to gain where you simply plainly know the least, but that's not always the case, especially if you're thinking about scenes that change in time or other situations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 987.765,
    "end": 1000.182,
    "text": "So to work with Chris and really go into, okay, how does information gain epistemic value have similarities and differences from maximum entropy?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1000.651,
    "end": 1006.858,
    "text": " Those are some core connections to make in Active Inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1006.878,
    "end": 1018.592,
    "text": "And so to be able to climb that hill and get there and then come away and now look back on it is all part of the learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1019.953,
    "end": 1030.185,
    "text": "And then similarly in the From Pixels to Planning paper, which was possibly one of the splashier in our field overall this year,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1031.009,
    "end": 1046.306,
    "text": " it really operationalized a lot of the developments that have been happening in multi-scale modeling and connected to the renormalization group methods, which two, three years ago were not so much on the table for active inference at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1047.248,
    "end": 1054.095,
    "text": "And now they're being taken into and across different domains as that paper works through.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1054.115,
    "end": 1060.763,
    "text": "And so for it to dovetail in the DOT2 during the symposium and just, it was great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1060.743,
    "end": 1088.404,
    "text": " two thick papers with a lot of direct and accessory learning both done with very mature and diligent colleagues and to have Carl and a plus one join both times so great times fun papers and uh anything to add on that Dean",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1090.308,
    "end": 1098.76,
    "text": " Just a thank you to all the people that participated in those because it's one thing to write a dense paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1098.821,
    "end": 1116.927,
    "text": "It's another to show up and do your best and to try and support our community and sort of take it off the bench and try to be able to explain it in ways that people who maybe don't have that same degree of background might enter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1116.987,
    "end": 1119.471,
    "text": "That was the one thing I took away was",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1119.89,
    "end": 1137.628,
    "text": " they weren't dumbing down what they were talking about, but they were also going to great lengths to make sure that people weren't intimidated by what they had to say, that they felt that it was something that they wanted to, not to share, but make accessible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1139.06,
    "end": 1160.747,
    "text": " thank you yeah it's a point we we truly can't make enough which is i and we are very appreciative to the all volunteer cast of this show and this channel and this institute and ecosystem largely so for people to write the paper",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1160.727,
    "end": 1182.668,
    "text": " it is easy to put it in your rear view mirror meaning put it behind you put some distance between and never look back but to add value and promote open science and to engage with the true serendipity and spontaneity of the live chat and the live stream format",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1182.648,
    "end": 1197.268,
    "text": " And again, I could continue on this angle, but through undergrad and graduate school, I saw so many paper-oriented lab meetings, so live stream format, and then guest presentations, like guest stream format.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1198.369,
    "end": 1210.866,
    "text": "Good points were raised, amazing points, perhaps novel points, perhaps critical points for reproducibility, side insights, deep lore, like incredible, dissipate into the wallpaper",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1211.42,
    "end": 1229.496,
    "text": " never to be seen again so not that everything needs to be open all the time but the start streaming and stop streaming button gives us that in and out and so i i'm just really thankful that that so many people",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1230.067,
    "end": 1259.348,
    "text": " in the research area and increasingly in applications do step into our clean well-lit place to discuss active inference and that so many so many participants in the live really live and in the follow-up sort of online discourse area get to engage with but also like co-create and even lead",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1259.817,
    "end": 1289.689,
    "text": " some of the research so that's just too epic not to mention all right there were four round tables quarterly round tables the last of which being yesterday but the date's just off by one here so check those out i i could have screenshotted again i could have put every picture of every bird we could have put every frame of every video so just showing more by showing less",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1290.901,
    "end": 1293.147,
    "text": " Four roundtables were great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1294.069,
    "end": 1296.876,
    "text": "I look forward to this quarterly tradition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1296.916,
    "end": 1306.902,
    "text": "It's part of how we see nested timescales from the most tactical and operational and day-to-day through the monthly newsletter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1306.882,
    "end": 1316.134,
    "text": " and the quarterly rhythm of the roundtable, the annual rhythms with different cohorts turning over, symposium, all these different things and many more to come.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1316.634,
    "end": 1326.527,
    "text": "So it's just awesome to compile these updates and it is a learning experience not unlike a reflection",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1327.267,
    "end": 1356.48,
    "text": " to feel busy and feel that progress was made, and there's places where progress wasn't made, windows that closed or windows that remain open, and yet the inertia and the challenge of actually preparing a meaningful reflection, because it can feel just like studying history, but those who understand the past control the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1359.616,
    "end": 1360.177,
    "text": " Any comments?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1362.2,
    "end": 1363.281,
    "text": "No, you sounded well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1363.301,
    "end": 1364.323,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1364.343,
    "end": 1364.823,
    "text": "Org stream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1365.685,
    "end": 1378.603,
    "text": "So this was the three videos that were looks like in the beginning of the year in January, March, and April, four, nine, two squared, three squared.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1379.685,
    "end": 1384.071,
    "text": "And these streams in different ways dealt with organizations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1385.384,
    "end": 1392.776,
    "text": " Two of the three, with Scent, Janita, and Hazel, and with Nathan Schneider, were from the MetaGov community.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1393.417,
    "end": 1405.575,
    "text": "So that was really cool to just connect with our MetaGov colleagues and, again, provide a space that's like a two-way street.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1406.096,
    "end": 1410.463,
    "text": "There's people who are going to be familiar with governable spaces.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1410.832,
    "end": 1435.017,
    "text": " not and active inference or not so all four of those quadrants are especially in play when we go outside of the sort of first in co-authorship space and and that's where there's these sparks that can fly and in or extreme seven with jamie joyce and john ash",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1434.997,
    "end": 1464.328,
    "text": " great discussions again about how in small and medium and large groups in our modern synthetic augmented environment does prediction attention memory all these cognitive phenomena that from the research side from the high road side we're talking about unifying and what do those look like on the ground and today okay",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1466.148,
    "end": 1490.012,
    "text": " all right model stream so here in a sort of countervailing pattern to the live streams where there's the 56 over the previous three years then followed by two here we can see by the numbers that there were nine model streams over three years and then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1491.713,
    "end": 1515.865,
    "text": " eights over this year so model streams and some of this can just be categorization because each stream only goes into one category so it's just again just remarking on the way that the cards did fall not the way they could have fallen the model streams go over specific models whether they're",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1516.469,
    "end": 1531.289,
    "text": " active inference specific models or even a little bit more general like a POMDP, a partially observable Markov decision process, it doesn't have to be explicitly active inference based, but that's how we're coming towards it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1534.132,
    "end": 1543.084,
    "text": "These streams from the math and the computer science side add a lot of primary material",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1545.275,
    "end": 1565.072,
    "text": " and that secondary material layer like follow-up questions or just the order of presentation from these experts can can get the the much larger crew who's at the third layer to understand what these models are about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1565.052,
    "end": 1587.583,
    "text": " so for there to be this sort of air of rigor with informality and engaging the technical details and just seeing how the presentation takes off and and it's like all on the modeling",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1589.116,
    "end": 1606.264,
    "text": " steady hands and then the presentation's over but we're still there with the informality and and like that after party for the model almost which is like really where the connections are made and and uh the one that i would highlight was ranways",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1606.885,
    "end": 1636.555,
    "text": " work on the value of information and reward specification which kind of connects back to the active data sampling too and just this idea that well we have mdps markov decision processes let's just say like chess and then we have the po mdp like chess with some observation error that's the partial observability part and then the idea that we can see the po mdp",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1636.906,
    "end": 1660.197,
    "text": " as an mdp where you're observing an uncertainty measure and so that connects a lot of dots with reinforcement learning and what epistemic value is it's not epistemic value towards future pragmatic value it's a separate source of value and there are situations where those vectors",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1663.315,
    "end": 1664.019,
    "text": " cancel each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1664.502,
    "end": 1666.977,
    "text": "There are situations where they're orthogonal to each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1667.017,
    "end": 1669.512,
    "text": "There are situations where they're doubly aligned.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1670.082,
    "end": 1694.25,
    "text": " and to be able to really neatly and concisely see here not that this is the only way to frame this but here's how active inference differs from reinforcement learning in reinforcement learning you have a utility function you need to coerce or shoehorn epistemic behavior heuristics whatever you want to think about into utility",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1694.416,
    "end": 1708.527,
    "text": " you can use all different kinds of mechanism but you only have one currency that's utility or reward and you're reinforcing and you're training on that epistemic value is the second eye opening that's what makes it different",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1708.895,
    "end": 1718.646,
    "text": " having the epistemic and the pragmatic value in the expected free energy equation, not just coercing the epistemic into the pragmatic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1719.026,
    "end": 1720.648,
    "text": "So what a great point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1721.629,
    "end": 1731.46,
    "text": "What an analytical connection to lock in and also a jumping off point for thinking more broadly about modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1732.901,
    "end": 1737.366,
    "text": "How much jumping off do you think that the authors of these papers",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1738.004,
    "end": 1742.654,
    "text": " in the after party actually materialize?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1742.954,
    "end": 1747.022,
    "text": "Because it's that emancipation piece that I think is really important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1747.063,
    "end": 1754.157,
    "text": "If you're using it as leverage, how much of that do you think materialize?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1756.246,
    "end": 1779.098,
    "text": " hard to say sometimes finishing a paper it feels just like pulling up to the side of a pool and being exhausted after bringing it over the finish line but then I think then there's a rest and then they push off in how maybe they see their next research dimensions going",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1781.862,
    "end": 1801.525,
    "text": " and and i mean let's let's see what others think and so on but then it's it's more like the model streams are those are those are the those are the hard ish crystal parts floating out there so there's this sort of like history of science like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1802.348,
    "end": 1807.38,
    "text": " How did Jacques jump off after this paper?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1807.4,
    "end": 1809.965,
    "text": "I think that's really cool and interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1810.406,
    "end": 1817.202,
    "text": "But for the other 8 billion people, it's about how they will push off of this paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1822.193,
    "end": 1838.734,
    "text": " all right math stream so there were five math streams these were all excellent Richard Chervijan is a participant at the institute and prepared for his lab group",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1838.714,
    "end": 1866.578,
    "text": " as a part of some of the completion phases for his phd this two-parter on bayesian mechanics and sort of re gave that lab meeting presentation on these streams i think that's a pattern we could see more and more people going out doing stuff and then coming back and giving round two as a dot one or or some other combination",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1867.115,
    "end": 1869.804,
    "text": " with Jonathan Gord in March.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1869.824,
    "end": 1878.913,
    "text": "This was one of the most watched live streams of the year, which was great to see because we laid out a lot of connections between",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1879.197,
    "end": 1908.546,
    "text": " steven wolfram's observer theory and a lot of what was happening in active inference so there was sort of this like funny thing where i i just saw again only one way to see it like this but just there were conversations like on machine learning street talk between carl and steven between friston and wolfram then it's like that is a splash that ripples then there's kind of the postdoc level discussion",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1908.813,
    "end": 1923.902,
    "text": " So that's just one like academic structuring to see it, but it just, this is how through time, it's like a zipping and an annealing of different research fields and how they co-inform each other",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1924.287,
    "end": 1951.392,
    "text": " and the way in which we're going to be able to use research tools to translate between ontologies notation systems and all of these things is going to turn an amazing spotlight back on the past and that's going to reflect a lot forward too thomas varley gave a great stream on information and then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1952.84,
    "end": 1956.666,
    "text": " Dean, one of our favorite colleagues, Toby St.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1956.686,
    "end": 1961.334,
    "text": "Clair Smyth, with the sort of live stream 54.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1961.374,
    "end": 1974.797,
    "text": "This is not 54 follow up on his new structured active inference, which both addresses many critical topics that the computer science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1974.777,
    "end": 1994.372,
    "text": " side are thinking a lot about like how do we do active inference with apis how do we think about multimodal interfaces and active inference all of those questions and the category theory and his charming ineffable style any comments on these no",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1999.837,
    "end": 2023.768,
    "text": " there were textbook group activities from february on through i believe october so they were sort of like semi-live streams because they're live while they happen but they don't directly go out to the youtube channel but then after the cohort has finished we flip them all to open but they're unlisted during the cohort",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2023.867,
    "end": 2031.078,
    "text": " Not sure why, but just don't want to string it along, want to release the full cohort recording at the end.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2032.022,
    "end": 2034.231,
    "text": "It's now been...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2035.544,
    "end": 2056.033,
    "text": " several years since the march 2022 release of this textbook we await more and other textbooks in the time to come but there's something nice about revisiting a text not just looking for more and different but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2057.802,
    "end": 2086.56,
    "text": " after reading each of these sections so many times and still finding new familiarities and new unfamiliarities it it really highlights and and thinking about what what is the role of of an attract text as a tractor text as entry point text as jumping off and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2089.207,
    "end": 2114.168,
    "text": " how do you think we can well I could I could add more about the updates on the group itself like about sort of the participation Trends but I'm just thinking here you know what is the role of textbook groups that sort of learning pattern in how we how we welcome people into our yellow learning circle",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2115.937,
    "end": 2133.117,
    "text": " I think what's really interesting is that you'll have more to say on this than I do, because I don't directly participate in the textbook group things, but if people have a chance to have conversations with one another on the same subject, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2133.157,
    "end": 2140.425,
    "text": "this book and its contents, is there a greater potential",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2141.063,
    "end": 2147.088,
    "text": " to open up each one of those perspectives to that 360 degree camera view?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2147.108,
    "end": 2151.613,
    "text": "I mean, you've gone back and looked at the book multiple times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2152.253,
    "end": 2160.721,
    "text": "How many times did it take you going back for your 360 perspective to become really tangible?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2164.504,
    "end": 2167.567,
    "text": "I don't know if it's gotten more or less tangible through time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2167.627,
    "end": 2169.889,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2171.675,
    "end": 2178.934,
    "text": " This year, Andrew Pashea co-facilitated a handful, like half of the meetings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2179.695,
    "end": 2187.355,
    "text": "So it almost became more tangible when I see it from the side.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2189.697,
    "end": 2211.739,
    "text": " and see another and i just think wow he just laid it down directly that was like laying down railroad tracks whereas i just feel like i'm sort of a lightweight forager leaving a little pheromone trace but when when i see another um lay it out it's really different even if it was",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2211.989,
    "end": 2213.05,
    "text": " semantically similar.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2213.11,
    "end": 2225.565,
    "text": "And then to the 360, when you mentioned that, you know, 360 makes me think about like a wedding or an event.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2226.446,
    "end": 2229.59,
    "text": "And then it's like, well, where'd you come in from?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2230.531,
    "end": 2232.133,
    "text": "What vector did you come in from?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2232.153,
    "end": 2233.996,
    "text": "And some people volunteer that information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2234.036,
    "end": 2240.123,
    "text": "Other times it comes out indirectly, but then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2240.373,
    "end": 2264.102,
    "text": " if we can have that theory of group and and realize oh people are coming there was a 360 that came to here so this this is a ready willing and able being approached from multiple sides embodied only and specifically by the actually present",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2264.707,
    "end": 2268.05,
    "text": " And for those who weren't there, it just, it wasn't that way for them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2268.651,
    "end": 2271.534,
    "text": "Which is how you can say things are in general.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2272.775,
    "end": 2287.27,
    "text": "You know, it's, it's, cause it's interesting to me if, if, um, if the pattern holds most people that are, that are, are, are taking up a text for the first time, they will, they will tend to follow the sequence of the chapters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2288.371,
    "end": 2290.393,
    "text": "The 360 doesn't happen until.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2291.318,
    "end": 2299.11,
    "text": " they are able to say, okay, what happened at five o'clock means something different than chapter five.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2299.29,
    "end": 2300.492,
    "text": "What happened at two o'clock?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2301.433,
    "end": 2308.944,
    "text": "It's now, it turns into a question of relativity as opposed to, okay, so I completed chapter five.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2309.966,
    "end": 2318.098,
    "text": "How did that closure now organize and set up for the next mini loop, right, on the continuum?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2318.118,
    "end": 2319.3,
    "text": "So it's like there's a bunch of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2319.618,
    "end": 2343.752,
    "text": " beads strung together for the first time engagers whereas the 360 viewer could quite literally step in to any chapter and because of their priors now their their their free engagements with the book they you could you could literally go i could say to daniel okay uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2344.829,
    "end": 2351.957,
    "text": " thinking about this thing from chapter six and he's already seeing it nested within the entirety of the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2352.197,
    "end": 2354.92,
    "text": "It's just a question of when does that emerge?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2355.821,
    "end": 2371.377,
    "text": "So that's the part I find really interesting because I'm not anti-text, but I also know that most people end up stopping, as you say, and things get yellow after they conclude the epilogue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2373.398,
    "end": 2400.908,
    "text": " yeah i guess just briefly to to kind of connect that to some of the specifics of the textbook group as through many discussions we've come to see it we know joking about reading it forwards reading it backwards middle out all that it's like well chapter one and ten are the bookends they're like the opening and the summary then you have the first half chapter one through five being in as they frame it more epistemic and the second half is more",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2400.888,
    "end": 2425.022,
    "text": " uh application oriented and it's like zoom into the first half well you got chapter five with the neuroscience and reviewing about where active inference has been applied to the system that so far has been studied the most the mammalian neuroanatomy and then you have the active in general in two three four and then you have the generative model four and the high and the low road in two and three",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2425.103,
    "end": 2453.22,
    "text": " and then going back to part two there's the recipe to begin it then there's seven and eight continuous and discrete time and then nine with the data it's like but if i just had this there at the 10 chapters i wouldn't have been able to memorize that but then going into it so many times just cycling through many coats of paint many spins the tech being okay with not knowing and then it's kind of like seeing each chapter as an interface and all of a sudden there they are all at once",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2455.006,
    "end": 2458.715,
    "text": " they tend to morph into rules as you, as you gain familiarity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2459.256,
    "end": 2473.369,
    "text": "And that's, that's why I was always curious when I asked, I'm always wondering whether the person who I'm talking to sort of catches themselves moving from that, that content context as",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2473.703,
    "end": 2483.838,
    "text": " as the shorelines and moving into those conceptual rules-based heuristic stuff, it's now internalized to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2484.258,
    "end": 2489.245,
    "text": "I can go in different places and not lose the thread.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2490.888,
    "end": 2491.168,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2492.75,
    "end": 2494.152,
    "text": "Golden thread, golden ring.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2494.953,
    "end": 2495.374,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2497.177,
    "end": 2499.783,
    "text": " Fourth Applied Active Inference Symposium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2500.745,
    "end": 2501.506,
    "text": "So, wow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2501.947,
    "end": 2505.214,
    "text": "What a fun ride this one was.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2507.359,
    "end": 2508.722,
    "text": "It was in November.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2509.107,
    "end": 2538.169,
    "text": " there was a third day session that john clippinger led while i was blissfully driving away elsewhere um but on the 13th and the 14th there were these two mega sessions let's see here's the first session um yeah here's the 19 segments on the first session the the pre-recorded ones were",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2538.149,
    "end": 2566.097,
    "text": " concatenated at the end so that was like cool but but the uh the front of house back of house on the live handoffs was i mean it's it's fun like if someone doesn't think it's fun they're probably right but if they wonder if it's fun i would recommend that they try these kinds of things um and then here was the second session but these were like 12 or 14 hours each so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2566.077,
    "end": 2592.574,
    "text": " again it was it was bizarre i i exercised a ton and just listened and learned a ton so and and uh but certainly was in an altered state of just learning and being focused but also very distracted you have a new definition of how to manage the binge yeah",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2594.596,
    "end": 2614.765,
    "text": " i guess just put it into do a weekend and then and then i don't know so it was awesome i mean again we say say more but people want to know how active inference can be applied and we coordinate this symposium and and seek",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2615.217,
    "end": 2628.197,
    "text": " curious co-organizers to get out in front for next year let's start in january or do something amazing for number five um maybe could you just give a remark on how",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2636.8,
    "end": 2642.206,
    "text": " I don't like to use the meme of tipping points, but I think it's really appropriate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2642.486,
    "end": 2664.411,
    "text": "I honestly think that just getting to that place of no return and seeing that things will continue to self-organize, there's a huge element of a role that you carried in terms of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2664.88,
    "end": 2679.604,
    "text": " trying to orchestrate things, and that's, people don't necessarily have to know the details around that, but there's also a huge element that this thing kind of has an element of what we talk about all the time, which is a self-organizing system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2680.986,
    "end": 2690.702,
    "text": "And watching something autopoetically get its act together, I think is, again, one of those,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2691.813,
    "end": 2700.547,
    "text": " one of those opportunities to learn how processes, there's a certain amount of hands-on to it, but there's also a huge element of hands-off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2700.848,
    "end": 2706.677,
    "text": "And then it's, again, playing in that space that gives you confidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2706.757,
    "end": 2708.64,
    "text": "That would be my only comment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2710.392,
    "end": 2731.168,
    "text": " cool yeah that just makes me think about carl and the the panel with alex arorbia and that was like the only one where there was some technical um comedy with the with the jumping around and all this other stuff um and and yet also it was very it it was like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2731.486,
    "end": 2750.98,
    "text": " they had co-written mortal computing and that was also a major contribution of the this year and and uh so it was like it was kind of like abbott and costello back again but but it but it was the after party or something like that so it's it was awesome okay fun times morphstream",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2750.96,
    "end": 2780.697,
    "text": " so this was a series that Sarah Hamburg proposed and did the other two last year and she did one stream this was uh it's a great topic the connection of morphological and and neuromimetic computation cognition and active inference and she did an awesome job with this morph stream and I look forward to people continuing to add more rows here",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2781.672,
    "end": 2784.976,
    "text": " Okay, now we get to active inference insights.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2785.036,
    "end": 2786.498,
    "text": "What do you want to add here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2788.4,
    "end": 2797.551,
    "text": "Well, I did a screen grab of the... It's not ironic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2797.611,
    "end": 2805.181,
    "text": "I don't know if there's been any empirical research done on this, but as people are trying to gain insights, they're looking off into the distance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2805.661,
    "end": 2810.447,
    "text": "And I wanted to catch Darius and his great locks, something I'm envious of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2810.663,
    "end": 2837.008,
    "text": " staring staring off on the horizon because i mean bottom line is uh he stepped up and he he i thought he did a pretty polished job of of bringing a whole bunch of people a cast of characters into some sort of a coherency so um my my doing the screen grab here is out of respect i'm not trying to make make fun of this because i i do think that there was a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2837.967,
    "end": 2845.455,
    "text": " a certain amount of learning on the fly that Darius wasn't afraid of showing the audience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2845.935,
    "end": 2850.32,
    "text": "And I think that message came through loud and clear and I really appreciated that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2850.74,
    "end": 2860.85,
    "text": "There's a certain amount of vulnerability that I think everybody that wants to get into this for the first time has to sort of carry into the situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2860.93,
    "end": 2867.417,
    "text": "And I thought he did it without sort of pandering or acting like this was",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2868.089,
    "end": 2869.191,
    "text": " overwhelming or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2869.211,
    "end": 2870.573,
    "text": "So good balance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2872.075,
    "end": 2873.257,
    "text": "I totally agree.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2873.277,
    "end": 2891.103,
    "text": "I think there was a really prodigious balance between the preparation that clearly he put in, both in general to upskill in the field, get familiar with the late breaking changes in the literature and all that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2891.704,
    "end": 2895.109,
    "text": "And then also clearly before each specific interview,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2896.034,
    "end": 2917.834,
    "text": " And yet to do that background so that he could look off to the side, it's like the anti teleprompter is when somebody's actually put in the, the preflection, put in the background so that they can push off of that firmness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2918.815,
    "end": 2924.64,
    "text": "And, and also for that moment of openness and uncertainty,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2926.156,
    "end": 2950.003,
    "text": " in linear online time to be something that people empirically like to listen to so that's that's an amazing balance and yeah the guests were great and we had a little reflection of our own where we switched positions for that last one but the rest were just him and the guests and they were the most watched videos on our channel",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2950.49,
    "end": 2976.21,
    "text": " and it's challenging for me to not have the visual because there's such a visual element so to do it as a conversation which was his intention from the beginning was to make a conversation style podcast style not and here on the left side you'll see this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2976.477,
    "end": 2979.722,
    "text": " That's challenging because it's a big topic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2979.822,
    "end": 2985.35,
    "text": "So just to have it strung along, it can, from an expert's ear, make a lot of sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2985.47,
    "end": 2996.386,
    "text": "But how does that become enticing and accessible to somebody who may not know why they're putting A, B, C, X, Y, Z?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2996.407,
    "end": 3003.497,
    "text": "And if you want to drink a game, every time he looks away, just take a sip and it's actually quite relaxing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3003.933,
    "end": 3008.25,
    "text": " Every time he humbly brings up one of his papers or thoughts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3010.438,
    "end": 3011.884,
    "text": "Don't drive after that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3014.969,
    "end": 3038.428,
    "text": " um okay art stream so we we're we're starting to circle we're starting to to approach math art but first we're stopping in in the pure math um stream earlier now we're here in the pure art side again these these um categorical distinctions the categorical imperative they're they're",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3038.847,
    "end": 3056.097,
    "text": " almost their own form of sorting and like this year starting the art stream series saying we're not going to put order and change in art into a guest stream",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3056.313,
    "end": 3081.392,
    "text": " we know we can but what if we open up an art stream avenue what if we had a separate link so that we could share with our artistic colleagues to let them know that we have a lane and a channel and a touch point for them so that is fun to see a new series start",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3081.727,
    "end": 3085.672,
    "text": " Again, we could just number all videos sequentially.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3086.233,
    "end": 3088.997,
    "text": "Or we don't even need to put numbers on the videos at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3089.377,
    "end": 3090.939,
    "text": "So what does the numbering really do?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3090.979,
    "end": 3095.425,
    "text": "All of these were really interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3095.445,
    "end": 3101.433,
    "text": "The one just a few weeks ago with Corinne Kukkonen was fantastic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3102.294,
    "end": 3106.62,
    "text": "The way that it just dove, it was novelistic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3107.444,
    "end": 3132.945,
    "text": " and novel just to begin it's like you open the book and you're right there you know it's on the street and this is happening right there it's like you're in media res and the way that she brought us in media res into this higher order predictive processing reading that doesn't deflate",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3133.094,
    "end": 3154.377,
    "text": " or fall into any other number of sort of simplistic fallacies or ways to constrain the variance and the open-endedness of literature, but just engage so richly with the material substrate of the text and bring in cultures and angles that we know we've never seen on a stream before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3156.483,
    "end": 3159.988,
    "text": " And that's one of the things I really like her presentation too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3160.068,
    "end": 3168.759,
    "text": "One of the things that I kept thinking about when she was talking was the thing most people think they, they get into a book, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3168.839,
    "end": 3179.373,
    "text": "Like it's, it, it, it draws you in and, and, and she, she talked a lot about how it can also, it can also free you up, free you up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3179.393,
    "end": 3185.882,
    "text": "So help you get outside of your, your patterns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3187.043,
    "end": 3189.786,
    "text": " which I thought was actually really quite fascinating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3189.866,
    "end": 3209.267,
    "text": "So that part of it could, in my background, I was an English literature teacher and I never, had I had access to the information she provided, I think I would have gone at presenting literature in some, maybe a little more novel ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3210.228,
    "end": 3213.931,
    "text": "So that was a nice surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3213.951,
    "end": 3214.552,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3214.572,
    "end": 3214.933,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3214.953,
    "end": 3215.413,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3217.537,
    "end": 3242.599,
    "text": " math art starting in only may with math art stream one and completing the decade in the 10th month i'll let you take the first pass on this well i guess the first thing we should do is acknowledge our leader uh that the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3243.389,
    "end": 3249.679,
    "text": " I don't know if she would be a queen or she must be higher than some royal rank.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3250.581,
    "end": 3255.649,
    "text": "Shanna is so ready, enthusiastic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3256.13,
    "end": 3266.848,
    "text": "And she really does have this ability to take that wishbone moment and not get stuck at",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3267.048,
    "end": 3285.138,
    "text": " at the branching point, like she can take the whole thing in at once and really appreciates anybody who is willing to take back to the risk thing, take that risk and look at things in a variety of different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3285.419,
    "end": 3292.33,
    "text": "So Hector, uh, Magdalena, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3292.647,
    "end": 3295.59,
    "text": " Sonia, Sonia came as a, as a guest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3295.67,
    "end": 3305.839,
    "text": "And again, all of these people that are trying to not get cubby hold into, there's only one way of looking at this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3306.859,
    "end": 3315.587,
    "text": "It takes a lot of enthusiasm and it takes a lot of, it takes a lot of community.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3315.787,
    "end": 3322.333,
    "text": "And I think that was one of the most enjoyable things was when Jim and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3322.718,
    "end": 3350.802,
    "text": " shanna and estelle and when everybody was sort of they just they they they made it feel comfortable they made it feel i'm not a safe space guy but it they wanted people to take risks and that was i don't put a price on that i just think it's invaluable so yeah thank you for that and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3351.271,
    "end": 3360.282,
    "text": " I greatly appreciate the facilitation and the holding of the creative center of Shanna and Hector and everyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3360.302,
    "end": 3372.857,
    "text": "I greatly enjoyed MathArtStream 4 with Kirby Urner on Dimension and Synergetics because it was like such a world weave moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3373.259,
    "end": 3397.714,
    "text": " myself and a learning experience to see dimension from this other way inside and and it just it was that multiple ways at once visualizing the fourth dimension and it was all about one two three four five and that's the traditional or at least mainstream way that people think about adding dimensions and that's the computer scientists data structure",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3397.694,
    "end": 3424.427,
    "text": " and that's the the brain bending question of the fourth dimension visualized for many and then here's cool kirby just like hold the tat in your hand hold the grain of sand in your hand there's the four it's like what do you mean there's the four it's like they're just all there at once spatially and here's the math so i think it's awesome and uh then the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3424.559,
    "end": 3450.263,
    "text": " paul can i say one thing apologies to kirby i actually put this image on this slide in dedication to him and then completely forgot to mention his name as you can see tickles 24d right so yeah uh shout out to kirby nice cool cool kirby my my the closest thing i know to a human yoda",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3451.103,
    "end": 3459.059,
    "text": " And then here is math art stream 11, the mathematical holiday poetry party.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3459.099,
    "end": 3469.5,
    "text": "We didn't realize it when it was planned to be, but I was thinking like, you know, there's people who have canceled streams.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3471.067,
    "end": 3499.403,
    "text": " weeks before or minutes before there's times where we've rescheduled but only shanna has taken the non-stream and turned it into into its own performance of like this dark like the strip it hasn't happened but it's like now especially it has so that's why i have it sort of like fading because when we imagine in in the dark imaginarium the in the dark symposium",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3500.075,
    "end": 3508.366,
    "text": " if we imagine it, it's like it has been because it hasn't, but it hasn't because it has only been imagined.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3509.107,
    "end": 3521.024,
    "text": "And so when we're playing with so many things about what is cognitive and real and embodied and all these, it's just a symbolic tour de force.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3521.765,
    "end": 3529.255,
    "text": "And again, for most people, they just like cancel and that's kind of the it and the all, but even a cancellation goes further.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3531.243,
    "end": 3531.643,
    "text": " Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3532.865,
    "end": 3534.506,
    "text": "Okay, active inference stream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3534.606,
    "end": 3536.488,
    "text": "I'll let you take the first pass on this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3537.789,
    "end": 3540.111,
    "text": "No, I can't make any passes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3540.131,
    "end": 3546.517,
    "text": "My my putting these two images on here is because the the shift the eyes on the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3546.718,
    "end": 3547.738,
    "text": "That's the extent of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3547.999,
    "end": 3549.4,
    "text": "Most of the stuff you talk about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3549.42,
    "end": 3551.742,
    "text": "I have no clue what the heck you're doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3553.624,
    "end": 3557.908,
    "text": "Yeah, well, this also began, I guess just four months ago.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3559.137,
    "end": 3581.922,
    "text": " but I've really treasured it as an opportunity to give like a little topical slice into some development effort also heavily using cursor and LLMs and code and all of that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3582.442,
    "end": 3586.447,
    "text": " And I try to leave it all out on the dance floor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3586.467,
    "end": 3593.237,
    "text": "I try to bring in the deep baseball history and references and skip around.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3595.199,
    "end": 3601.007,
    "text": "I hope it's enjoyable and kind of like a variety show.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3600.987,
    "end": 3626.401,
    "text": " with with all the time here when you've left and when you were wrong, it's it's it's super funny and and a topic that we always come back to with, OK, their subject matter expertise and what and just seeing like literally over these streams, you'll see even in the six, seven, eight.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3627.242,
    "end": 3628.564,
    "text": "And I'm saying",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3628.544,
    "end": 3633.331,
    "text": " It's doing 800 lines, but 200 lines was the limit just a few months ago.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3633.371,
    "end": 3655.581,
    "text": "So being there when the tide pulls out and the 100-foot wave comes onto shore and being like, no, the subject matter expertise and the cramming textbooks of Bayesian statistics into your head and the coding and the for loops and all of these, it's like, that's...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3656.202,
    "end": 3680.775,
    "text": " not going to fall onto a human's shoulders in most cases anymore so as that as that knowledge playground just morphs i mean these these may be seen as some of the most rapid months of synthetic intelligence acceleration in a long time",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3680.992,
    "end": 3683.175,
    "text": " Yes, in a 10,000 or 100,000 a year.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3684.277,
    "end": 3685.82,
    "text": "Can you say that in history?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3688.524,
    "end": 3690.086,
    "text": "You're on the almost vertical?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3691.088,
    "end": 3699.882,
    "text": "I think there's the sort of fractally element of zooming in and it being a hockey stick, O Canada, all the way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3699.922,
    "end": 3706.172,
    "text": "But at the same time, just talk about seeing it play out on the day to day.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3706.81,
    "end": 3735.957,
    "text": " with the new versions of cursor and the new language models and the fixating salience of the sophistication of the technology and like the kind of promethean angle on that and the power and the potential and open source",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3736.088,
    "end": 3746.537,
    "text": " and revisiting a bunch of previous papers that I've written, qualitative ones, collaborations, more structural ones,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3748.019,
    "end": 3760.597,
    "text": " kicking it off with the field shift, just saying, hey, you know, it's not necessarily, you might not give an A plus, but at the B plus to A level, we have the all by all maps.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3761.097,
    "end": 3776.018,
    "text": "Like the sphere of the shifted, like you could think about A in terms of B. It's like, okay, well now we have A through Z by A through Z. So now that the board has been sketched,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3776.707,
    "end": 3801.853,
    "text": " and that that's just like it's daunting but it's empowering but it's terrifying and it's also exciting and so what does it mean you know when when careers were made on what if we thought about a like b and now we have that low bar rising tide",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3802.407,
    "end": 3803.809,
    "text": " Will it float all boats?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3803.889,
    "end": 3811.501,
    "text": "And what is going to get swept away when that technique becomes increasingly powerful?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3813.524,
    "end": 3828.447,
    "text": "To someone who has zero experience with how you play with each of these different tools, the metaphor that keeps running in my mind is it's not a roller coaster that's already been set up in the field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3828.567,
    "end": 3830.71,
    "text": "It's quite literally...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3830.791,
    "end": 3855.459,
    "text": " the rails of the roller coaster are only about, developed only about 10 feet in front of you, and it looks like you're going to go off the rails and just, you know, fall to your death, but it just seems like there's more rail as you progress, there's more rail literally materializing as you move down the tracks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3856.34,
    "end": 3859.363,
    "text": "And so, yes, that is terrifying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3860.305,
    "end": 3889.57,
    "text": " yeah that's all that's all i'm gonna say yeah and just the who's on first dialogue leitmotif just being funny and information laden for me and maybe for others but but again just pointing more broadly like whatever cultural vehicle or format you want information in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3890.815,
    "end": 3910.832,
    "text": " that that roller coaster is going to take that turn in the next 10 seconds you know the book is there it's static and there's there's so much to be said for all of that too in the shared reference point of the text like we were exploring earlier but when when the book is morphing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3911.774,
    "end": 3927.741,
    "text": " second to second you can flip back to a page it was like wait i just was like it's like it's already different enough when the text is static and and it's like being on a on a hyper mutating trampoline so so just seeing that happen",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3927.721,
    "end": 3952.294,
    "text": " and just it just how quickly we've gone from here's a great blog post you might want to check it out they use this cool metaphor to like i'm 75 prompts deep like wired into this alternative reality game but i'm also getting this like tacit understanding of bayesian statistics is like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3954.265,
    "end": 3977.026,
    "text": " You know, will, again, just speaking personally, will I have come to see, will I come to see the hours with the organic chemistry book in the library in those years as creating the foundation of habits and ways that become empowered?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3978.087,
    "end": 3984.053,
    "text": "Will those study methods in ways be misleading or worse?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3984.826,
    "end": 3992.597,
    "text": " Is it something that others just analogously would want to engage in for the character building or for the traditionalism?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3992.617,
    "end": 3996.323,
    "text": "Or is it just like a historical legacy cope?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3997.244,
    "end": 4004.936,
    "text": "And new nestmates will do things that will just completely... And it's probably some of all of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4005.717,
    "end": 4012.707,
    "text": "It's just that it's evolved so much and I don't feel like I've been studying it that long.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4012.906,
    "end": 4027.044,
    "text": " but I can't even, there's no Venn diagram some days between when I finished undergrad in 2014 and how I was studying and where it got to this year.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4028.986,
    "end": 4030.088,
    "text": "So here's a question for you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4030.108,
    "end": 4042.423,
    "text": "Like a couple of years ago, 2022, 2021, we spent a lot of time in the Institute pondering this idea that it just seemed like Markov blankets were arbitrary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4045.019,
    "end": 4055.533,
    "text": " Because I'd done some programming in the previous decade, I had equated Markov blanket and where they're placed with the idea of, so what's good enough?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4056.134,
    "end": 4057.516,
    "text": "It's not just arbitrary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4058.718,
    "end": 4060.901,
    "text": "I don't want to get caught up in a recursive loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4060.921,
    "end": 4065.627,
    "text": "Comedic outcomes aside, I know who's on first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4066.619,
    "end": 4068.362,
    "text": " And that's good enough for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4068.382,
    "end": 4073.29,
    "text": "Like I don't have to sit there and continually ask prompt after prompt after prompt, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4073.371,
    "end": 4082.907,
    "text": "So where do you think this idea that a lot of the stuff that we do know now about active inference, where is it going to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4083.848,
    "end": 4111.307,
    "text": " bump up against this idea that a lot of information now is going to be synthesized through these llms but not knowing what the llm's definition of good enough is relative to our own yeah that's a question to revisit it just makes me think of of the hand on the page",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4111.928,
    "end": 4123.824,
    "text": " And there's this, this chain of continuity materially from like the ink of the printing press on through your fingertips and, and neurons and glia.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4124.265,
    "end": 4125.807,
    "text": "So there's like this material chain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4126.508,
    "end": 4138.744,
    "text": "And then now it's like, we have a whole team of telephone between the whole library and us at the terminal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4140.146,
    "end": 4141.648,
    "text": "So there's so much",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4143.248,
    "end": 4173.053,
    "text": " And yes, with open source models, we can look a little bit under the hood and all of that, but just do a single dimensional linear regression and check how interpretable that one is, and then use that for a gut check for what kinds of interpretability in the short and maybe even longer term we can even expect from these massive systems with billions of components and numerical representations and meaning all of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4173.235,
    "end": 4200.728,
    "text": " and and so there's just so much space between that it almost like obsoletes the concept of space between because it becomes its own place to be and i i guess how can we see that as just the new water that we're in um and and but but again just like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4202.362,
    "end": 4224.505,
    "text": " we should add the um the car meme swerving off the freeway but that's gonna be like yeah that's that's gonna be the the the the educational question like when I see educational organizations grappling with whether using",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4225.463,
    "end": 4233.694,
    "text": " at this level or that level is augmenting learning or a referral to student judicial affairs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4235.216,
    "end": 4242.986,
    "text": "It's like there's going to be a chasm growing that is not going to get taped over simply.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4244.669,
    "end": 4250.436,
    "text": "Well, 10 years ago, I had people that were coming to me and insisting that I impose rubrics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4250.456,
    "end": 4253.901,
    "text": "And 10 years ago, I said, those are already...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4255.602,
    "end": 4256.843,
    "text": " they've lost their shelf life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4257.164,
    "end": 4278.229,
    "text": "And I think everything that you just pointed out confirms that anybody that's still in that way of thinking, if you believe that that's the way that you measure and qualify what good enough is, think again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4278.249,
    "end": 4283.095,
    "text": "That isn't going to help you anymore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4283.243,
    "end": 4283.583,
    "text": " Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4284.144,
    "end": 4284.444,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4284.985,
    "end": 4286.627,
    "text": "Last moments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4287.648,
    "end": 4294.415,
    "text": "So we have, of course, one review stream this year happening right now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4295.496,
    "end": 4301.282,
    "text": "And so I'll bring in a William Blake quote, and then you can convey what you added.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4302.964,
    "end": 4305.587,
    "text": "Eternity is in love with the productions of time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4310.352,
    "end": 4313.115,
    "text": "So I just asked, so where does that...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4313.382,
    "end": 4329.087,
    "text": " Where does the time that's then processed, now behind us, then fit in to the idea, the concept of scale-free?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4329.949,
    "end": 4332.773,
    "text": "Because Blake, I'm sure, you're the Blake expert.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4333.755,
    "end": 4340.706,
    "text": "When Blake was unshackled from the asks and the tasks that he had to do to put food on his table,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4342.002,
    "end": 4346.089,
    "text": " how would you suggest he looked back on his day?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4352.539,
    "end": 4358.429,
    "text": "Before he broke out the quill and said something profound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4361.173,
    "end": 4361.454,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4363.377,
    "end": 4368.465,
    "text": "Well, what a big question to explore the...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4370.116,
    "end": 4396.866,
    "text": " multiple of his works deal with this in media res realization of fragmentation through memory of a prior state and the instantaneous primal recognition of temporality and time boundness",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4397.69,
    "end": 4425.739,
    "text": " which is time as produced the productions of time which whether you apprehend this through reason faith axiom principle framework it comes from eternity of eternity and so this aphorism it it captures that like there's the eternity of the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4426.816,
    "end": 4449.28,
    "text": " sentences all meanings at once the sentence as one at once and then there's the the linear sequential productions of time and the letters in their ordering and the words in their ordering and uh it uh so how did he see",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4451.15,
    "end": 4452.232,
    "text": " the end of his day?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4452.752,
    "end": 4469.396,
    "text": "That's an interesting question after after what what by by many modern standards would be grueling, extremely challenging, repetitive etching work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4470.297,
    "end": 4472.16,
    "text": "It's an interesting question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4472.6,
    "end": 4476.206,
    "text": "When I first saw this, I thought to myself, OK, so here we go again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4476.266,
    "end": 4480.752,
    "text": "We've got a highly respected thinker",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4481.272,
    "end": 4494.311,
    "text": " And he's essentially, in his own words, saying, well, there is an eternity capacity, a carrying capacity, a scale-free component, and then there's a scale-friendly component, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4494.351,
    "end": 4496.073,
    "text": "The cycle of the day is done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4497.876,
    "end": 4502.723,
    "text": "When I'm having my own little moment now to go, okay, was I productive today?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4503.85,
    "end": 4527.536,
    "text": " I wonder what, what, what he fits into the, well, here's the, here's the, here's the things I made, but here's the, here's the new ideas that I'm, I'm still, I'm still forming and hoping to, to, to bring into a, a way of getting others to maybe go long.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4529.357,
    "end": 4529.858,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4531.424,
    "end": 4543.537,
    "text": " From the production of Etching and Ready to Slip, and Shanna talked about memory and Hector and sleep and how you have to remember to be able to fall asleep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4544.44,
    "end": 4546.345,
    "text": "And then also, here's just...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4547.793,
    "end": 4563.962,
    "text": " this is from uh uncle john's band by the grateful dead but the last line there where does the time go it's like yeah okay if it flies like from or to where or is it just all at once",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4563.942,
    "end": 4585.326,
    "text": " that's the sort of time crystal time diamond spatialization of time but spatial is a metaphor for moments existing but what would it even mean to exist quote at once when you're talking about something that changes okay last one so yours alone",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4587.449,
    "end": 4592.475,
    "text": " Well, I think in 2025, something interesting is going to happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4592.796,
    "end": 4608.795,
    "text": "And rather than taking all of the items on this slide and somehow being able to insert them into a prompt field in an LLM, maybe that's possible now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4608.815,
    "end": 4610.137,
    "text": "Like I said, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4610.697,
    "end": 4616.865,
    "text": "I don't know how you'd put... I know how you string words together in a prompt.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4617.622,
    "end": 4639.737,
    "text": " field, but I don't know what would happen if you put in a Clydesdale, a radio flyer wagon, a King's coach, a miniature horse, a table, two tangential sandwiches and a list, what it would come up with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4639.757,
    "end": 4643.443,
    "text": "But I think an active infer, if I said to an active infer,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4645.82,
    "end": 4656.176,
    "text": " Rearrange this, reformat this, take this and make it, make it, make it your self, organize it into your coherency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4658.159,
    "end": 4673.903,
    "text": "And then, and then if you want to give us a narrative, but just go through a process of acting in a furry without, without, you know, I dunno how many times you have to re",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4675.368,
    "end": 4677.371,
    "text": " resubmit the prompts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4678.792,
    "end": 4682.737,
    "text": "But I know that that's an exercise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4682.998,
    "end": 4691.188,
    "text": "This is a different kind of exercise because it's taking information and allowing the person who sees it to reformat it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4692.49,
    "end": 4697.376,
    "text": "And I think that that's something that's going to come to the fore",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4699.28,
    "end": 4705.348,
    "text": " I hope it's going to come to the fore within the active inference community in the next calendar year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4705.969,
    "end": 4721.911,
    "text": "Because I think this is an ability and affordance that we have to take seeming pieces of information and not just get stuck in the sequentialness of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4722.892,
    "end": 4724.815,
    "text": "There is that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4725.79,
    "end": 4729.655,
    "text": " But there's also this other way of being able to look at things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4730.316,
    "end": 4755.207,
    "text": "And I think together, that's the potential of not being replaced by AI, but actually having it act as a tool in the context of having this other way of being able to look at information and not necessarily have to continually give it more",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4755.524,
    "end": 4785.075,
    "text": " more definition more terms more refinement it's it's literally an opening up the option is yours like if i said to you daniel play with this and decide whether the where the list stays where it is or whether you take a word like subjective subjectist and put put it over the miniature horse or which is which is the active inference which is the instrumental like it's actually fun",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4785.73,
    "end": 4789.294,
    "text": " You, there's nobody telling you how the puzzle gets completed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4789.734,
    "end": 4803.67,
    "text": "It's the actual process of doing the self-organization that creates the narrative and the generative model that you want to carry into this next year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4804.03,
    "end": 4815.062,
    "text": "So that's why I put this on here because I think that's the pre-fleck moment that, you know, four years and now the year number five, as you mentioned before we came live here,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4815.515,
    "end": 4818.461,
    "text": " I think we have that opposable digit moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4819.723,
    "end": 4837.118,
    "text": "And rather than being taken out by AI and machine learning, I think it's now, it just seems like the moment of sensitivity where we can take this other way and put the two together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4839.629,
    "end": 4845.124,
    "text": " Wow, okay, I'm gonna read a timely question from the chat and I think you'll have a take on this one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4845.886,
    "end": 4853.166,
    "text": "Monty wrote, how does Active Inference explain the bunny rabbit interpretation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4855.677,
    "end": 4884.655,
    "text": " uh with the duck is with the rabbit that's how active inference explains it it's as you as as you uh change swap perspective and foreground and background that what what active inference explains to us is that it's the fact that our our ability to cohere take the duck and the rabbit and see them as with not necessarily one before the other",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4884.803,
    "end": 4898.403,
    "text": " That's one of the great powers of being able to not get stuck just in subject matter expertise, but be able to predict not just the limitations, but also the leveraging points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4900.165,
    "end": 4900.486,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4900.866,
    "end": 4904.652,
    "text": "So if we see time as moment by moment,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4905.053,
    "end": 4929.036,
    "text": " which is the the the commentary for the baseball game it's a duck no it's no it's a bird it's a plane no it's a duck it's a rabbit then and then and then that's how next steps occur in contrast we have eternity which is multiple moments at once and their space between we have duck with",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4929.269,
    "end": 4956.542,
    "text": " rabbit and the duck with rabbit is in love with the production of the experience of duck then rabbit yeah yeah and that and again at first that just that may sound to people like what the heck are they talking about but again if you can relax your grip on no it's a duck no it's a rabbit no it's like if you can let go of or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4958.345,
    "end": 4966.917,
    "text": " even if it's just for a little bit, and just kind of go, okay, well, I don't see a duck rabbit, or I don't see a ruck or a dabbit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4967.438,
    "end": 4978.854,
    "text": "That's okay, because you're still able to see the all aspect of that, in addition to the, oh, now it's a duck, now it's a rabbit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4978.874,
    "end": 4979.174,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4982.419,
    "end": 4985.483,
    "text": "Horse by duck, rabbit by horse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4986.627,
    "end": 4988.67,
    "text": " There we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4988.77,
    "end": 4996.259,
    "text": "So one of the critical things here, I think, is that I think a lot of people will go, oh, we live in a world of hyper trucks now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4997.04,
    "end": 5004.829,
    "text": "No, it's still a minimum of two if we're talking about the natural component of this and not just the technology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5004.849,
    "end": 5006.792,
    "text": "If we're talking about the real and the instrumental.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5007.513,
    "end": 5016.043,
    "text": "So again, I just think that 2025, that opposing digit metaphor is going to really come into play here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5016.665,
    "end": 5018.068,
    "text": " Here, just copying this in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5018.268,
    "end": 5025.021,
    "text": "We can come to closure, but just Monty wrote, what is driving this change of perspective?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5025.041,
    "end": 5032.294,
    "text": "The solidification of recognition reminds me of the process of gaining hand independence in piano.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5036.898,
    "end": 5066.837,
    "text": " um well i i guess that depends on on the person i mean i think there's going to be some people that are going to be doing it out of a sense of fear maybe some people that want to be just curiosity they just want to try perspective swapping because maybe they're feeling like they're in a bit of a rut in the you know the one size fits all view that they've carried forward for whatever length of time i mean there's almost infinite reasons why",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5068.15,
    "end": 5087.161,
    "text": " But I think the idea in a world where it appears that a lot of the choices are being taken away, there's always a reaction to that and people will want to, if there's a way, to opt not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5087.181,
    "end": 5094.192,
    "text": "And not have something make them feel as though they're no longer relevant, so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5095.724,
    "end": 5102.314,
    "text": " Last question, Monty asks, is will the final answer to the fundamental driver?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5105.598,
    "end": 5105.799,
    "text": "No.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5106.94,
    "end": 5110.666,
    "text": "It's just relative to what you can and can't do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5114.291,
    "end": 5115.653,
    "text": "Do you have any closing comments?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5118.838,
    "end": 5125.107,
    "text": "Again, I can't pound the table enough and hard enough to say if",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5125.458,
    "end": 5135.552,
    "text": " If you sometimes don't want to participate in one of these exercises because you weren't there for everything, you're kind of missing the value in it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5135.912,
    "end": 5146.386,
    "text": "I would suggest that this year I was actually physically present for 18 to 20% of the stuff that went on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5147.193,
    "end": 5160.345,
    "text": " I got a chance to, because of the nature of the availability in the library of videos, go back and look at another 60% and there's at least 22% that I have no idea what went on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5160.565,
    "end": 5165.337,
    "text": "But I still like to come here because it gives you that sense to step back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5166.565,
    "end": 5188.37,
    "text": " So I hope people that are on the Discord, I hope people that are in the community, I would like to see this sort of exercise be something that became more of a, I guess there's some way that we have to digitally feed people because if we could get them all into a big smorgasbord and feed them while we were doing this, we could probably get more people in this room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5188.41,
    "end": 5195.779,
    "text": "But I just think it's a really valuable exercise and I hope other people want to join with you on this next year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5196.4,
    "end": 5196.861,
    "text": " Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5197.763,
    "end": 5202.011,
    "text": "I'd like to acknowledge Upcycle Club making a gift to us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5203.274,
    "end": 5204.797,
    "text": "He said thank you for all the hard work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5205.278,
    "end": 5208.485,
    "text": "And also, Jeff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5208.505,
    "end": 5210.348,
    "text": "So, what a stream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5210.99,
    "end": 5211.531,
    "text": "What a year.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5211.571,
    "end": 5213.254,
    "text": "Thank you all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5213.555,
    "end": 5215.118,
    "text": "See you next time.",
    "speaker": "SPEAKER_00"
  }
]