[
  {
    "start": 9.008,
    "end": 34.155,
    "text": " hello and welcome it's april 3rd 2024 we're here in active inference guest stream 78.1 discussing what could come before time with juan diego bogota and this should be a great presentation followed by a discussion so thank you again for joining looking forward to the presentation and discussion",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 36.481,
    "end": 37.062,
    "text": " Thank you, Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 37.082,
    "end": 39.044,
    "text": "So, hello, everybody.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 39.064,
    "end": 40.266,
    "text": "So my name is Juan Diego Bogota.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 41.027,
    "end": 44.051,
    "text": "And today I'm going to talk about mainly phenomenology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 44.151,
    "end": 50.72,
    "text": "Not so much about active inference, but maybe our discussion will go that way, I kind of assume.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 51.781,
    "end": 53.824,
    "text": "So to give you a bit of context about this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 54.004,
    "end": 61.915,
    "text": "So this presentation is actually based on a paper that I recently published in Phenomenology and the Cognitive Sciences last month.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 62.367,
    "end": 79.988,
    "text": " but to give you a bit more context in general i'm interested in the relationship between cognitive science and phenomenology and when i talk about phenomenology i'm very mindful about the fact that this is a term that is a bit ambiguous in the literature because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 81.183,
    "end": 93.64,
    "text": " maybe philosophers of mind or cognitive scientists when they talk about phenomenology they often think about say qualia or you know the what it's like of phenomenal consciousness",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 94.193,
    "end": 105.865,
    "text": " And that's okay, but I usually use that term to refer to a specific philosophical tradition known as phenomenology that was started towards the beginning of the 20th century by Edmund Husserl.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 106.426,
    "end": 112.092,
    "text": "And it was further developed by people like Merleau-Ponty or Heidegger or Simone de Beauvoir.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 112.512,
    "end": 120.741,
    "text": "And the whole point of phenomenology is to try to provide a very strict and rigorous analysis of consciousness and lived experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 120.721,
    "end": 124.466,
    "text": " by taking very, very seriously the first-person perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 124.506,
    "end": 129.713,
    "text": "So it's a matter of trying to unveil the invariant structures of consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 129.853,
    "end": 145.193,
    "text": "And I think that this methodology is quite promising for us to better understand consciousness and cognition, so it might be an interesting thing to further integrate into our scientific understanding of the mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 145.763,
    "end": 174.353,
    "text": " And I think that a good way of connecting phenomenology with the broader kind of empirical context of the cognitive sciences is the inactive approach, mainly because people like Francisco Arella or Evan Thompson have been very influenced by phenomenologists like Husserl and Merleau-Ponty when it comes to ideas like embodiment, the embeddedness of cognition, the importance of subjectivity, this kind of stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 175.058,
    "end": 184.251,
    "text": " And in this particular talk, I want to focus on something that these two frameworks have in common, which is how they characterize intentionality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 184.772,
    "end": 193.704,
    "text": "So usually in cognitive science, philosophy of mind, when we talk about intentionality, we mean kind of this directiveness or aboutness of certain mental states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 194.305,
    "end": 198.351,
    "text": "So there's this kind of relationship between the mind and specific object in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 198.852,
    "end": 201.235,
    "text": "And that's kind of...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 201.772,
    "end": 219.872,
    "text": " the usual concept of intentionality, but I think that phenomenologists and quite a bit of nativists have a bit of a broader conceptualization of intentionality, not only as this aboutness that is directed towards a specific object in the world, but rather as a general openness to the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 220.393,
    "end": 227.02,
    "text": "And the whole idea of phenomenology is precisely to identify the structures that constitute that openness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 227.641,
    "end": 231.227,
    "text": " And again, that's kind of the context of my presentation and my paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 232.369,
    "end": 248.417,
    "text": "But when you look at the literature in classical phenomenology, you notice that there is one particular structure or feature of lived experience that has some sort of primacy, and that's temporality, or as Husserl calls it, time consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 248.477,
    "end": 250.24,
    "text": "So here I bring a quote of Husserl.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 254.658,
    "end": 255.279,
    "text": " What do you mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 256.221,
    "end": 260.768,
    "text": "There's like multiple kind of overlaid visual frames.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 260.788,
    "end": 261.269,
    "text": "Oh, hold on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 261.429,
    "end": 262.23,
    "text": "Let me try again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 262.271,
    "end": 262.972,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 266.678,
    "end": 268.941,
    "text": "I was entertaining the possibility it was intentional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 270.264,
    "end": 270.644,
    "text": "Oh, no.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 271.746,
    "end": 274.37,
    "text": "Yeah, I don't know what happened.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 274.39,
    "end": 275.452,
    "text": "Let me try again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 278.557,
    "end": 279.319,
    "text": "Yeah, looks good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 279.359,
    "end": 279.719,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 280.641,
    "end": 281.442,
    "text": "Okay, fantastic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 281.928,
    "end": 287.98,
    "text": " Okay, so now without the overlay, so here I have a quote of Fusserl talking about time consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 289.463,
    "end": 299.363,
    "text": "He says that in the ABCs of the constitution of all objectivity given to consciousness and subjectivity as existing for itself, time consciousness is the A.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 299.343,
    "end": 307.697,
    "text": " It consists, as we might say, in a universal formal framework in a synthetically constituted form in which all other possible synthesis moves participate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 308.037,
    "end": 318.414,
    "text": "And this is a very kind of fancy and wordy way of saying that, you know, if you want to understand consciousness from its first-person perspective, the first thing you have to analyze is temporality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 318.454,
    "end": 319.977,
    "text": "That's kind of the basis of it all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 320.457,
    "end": 323.983,
    "text": "And the reason why we should start with temporality is because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 323.963,
    "end": 343.66,
    "text": " not only we tend to experience things as unfolding in time but also because uh consciousness itself is a stream of consciousness it's a temporal unfolding and that kind of frames all of our experiences so temporality is kind of the fundamental structure of consciousness uh and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 344.264,
    "end": 353.094,
    "text": " When we get deeper into the Husserlian analysis of temporality, we tend to find this tripartite structure of time consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 353.514,
    "end": 368.01,
    "text": "So Husserl tends to say that what he calls the living present, which is literally how we experience the present right now, is usually an integration of the past, the present and the future, the just past, the immediate present and what is about to come.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 367.99,
    "end": 387.113,
    "text": " And these have like very specific terminologies we'd call retention, the kind of this experience of the just past, parallel impression, the experience of what is literally happening right now in like a very small now phase of perception, and protension to the anticipation of what is about to come.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 387.515,
    "end": 392.848,
    "text": " And these different kind of operations of consciousness have very complex relationships.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 392.928,
    "end": 394.913,
    "text": "I'm not going to dwell too much into them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 395.354,
    "end": 405.338,
    "text": "The whole point is that they together constitute the kind of the flowing feature of consciousness, how it flows temporally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 405.824,
    "end": 410.669,
    "text": " sinking into the past because we're constantly anticipating what is about to come.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 410.689,
    "end": 412.51,
    "text": "This anticipation is usually implicit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 412.851,
    "end": 416.154,
    "text": "We don't necessarily think about what is about to come explicitly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 416.174,
    "end": 417.075,
    "text": "It just kind of happens.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 417.535,
    "end": 427.925,
    "text": "But when we experience something, the primal impression either confirms or fulfills what we were pretending or anticipating or negates the anticipation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 428.506,
    "end": 435.713,
    "text": "And regardless of whether there is anticipation or fulfillment, what is experienced kind of sinks into the past and this is called retention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 435.693,
    "end": 442.395,
    "text": " So we have this kind of continuous flow of time that goes from the future towards the past, sinking into the past.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 442.78,
    "end": 460.257,
    "text": " But importantly, this constitution of the living present or the flow of time can be conceptually understood as pre-temporal or atemporal, because the whole point is that these processes, these operations are literally constituting our experience of time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 460.557,
    "end": 468.265,
    "text": "So they cannot be given in time as such, because if you claim that, then you have a circular argument.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 469.24,
    "end": 493.932,
    "text": " uh who nevertheless recognizes that this structure the structure of time consciousness is just an abstraction it's just a formal framework that has to be further um complemented by qualitative content so even though time conscious is kind of the basis of it all we have to go beyond in order to better understand consciousness and when we talk about content we have to talk about affection",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 494.502,
    "end": 502.849,
    "text": " So for Husserl, affection is the lure given to consciousness, the peculiar pull that an object given to consciousness exercises on the ego.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 503.25,
    "end": 506.533,
    "text": "It is a pull that is relaxed when the ego turns towards it attentively.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 506.873,
    "end": 516.942,
    "text": "So it's just like in very simple terms, affection occurs when something in our field of perception, our perceptual field kind of tries to catch our attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 516.962,
    "end": 522.467,
    "text": "We feel this kind of solicitation or pull or tendency or disposition to pay attention to something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 522.903,
    "end": 533.338,
    "text": " And for Husserl, this process of affection corresponds to the basic form of intentionality, because that's literally when we first have this directness towards an object.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 533.618,
    "end": 537.464,
    "text": "It's the first moment when an object becomes salient for us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 538.044,
    "end": 541.469,
    "text": "And it also gives rise to the minimal form of activity, which is attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 541.489,
    "end": 544.894,
    "text": "So there's this distinction between affection and attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 544.874,
    "end": 555.433,
    "text": " For me to attend something to being able to be attentive towards an object, that object should try to call my attention, it has to affect me beforehand.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 556.054,
    "end": 558.999,
    "text": "Logically, not temporarily, it's like a logical relationship here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 559.36,
    "end": 565.11,
    "text": "So that's why we can conceive of affection as this kind of precondition of attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 565.411,
    "end": 570.599,
    "text": " And to better give you an illustration of what affection is, you can see this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 570.619,
    "end": 572.282,
    "text": "It's the flag of Japan.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 572.782,
    "end": 577.93,
    "text": "And probably when you see the flag of Japan, the thing that catches your attention the most is the red circle in the middle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 578.571,
    "end": 586.644,
    "text": "And the reason why this catches our attention is because of the very, very stark contrast between the circle and the background, the white background.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 587.084,
    "end": 594.135,
    "text": "So in a lot of cases, like in sensorial cases, affection is related to this contrast.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 594.115,
    "end": 598.061,
    "text": " Compare this to seeing an artwork by Jackson Pollock.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 598.161,
    "end": 604.83,
    "text": "In this case, there's chaos, there's a bunch of paint strokes, and there's nothing that is specifically catching your attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 604.851,
    "end": 607.354,
    "text": "Maybe you're seeing the yellow, then the red, then the black.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 607.715,
    "end": 608.676,
    "text": "It's like chaos.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 609.357,
    "end": 619.752,
    "text": "And the reason why this happens, at least from a phenomenological perspective, is because there is contrast, but it's not as strong as in this case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 620.204,
    "end": 622.406,
    "text": " Of course, again, this is like a very basic case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 622.446,
    "end": 625.269,
    "text": "We can also introduce interest and concerns.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 625.369,
    "end": 630.654,
    "text": "Sometimes something catches our attention just because it's relevant for our current interests.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 631.055,
    "end": 637.922,
    "text": "So, for instance, now I'm very focused on the screen on my laptop, and it's precisely because I'm interested in giving this presentation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 638.662,
    "end": 649.333,
    "text": "So this is broadly what affection means, this kind of felt pull or tendency towards an object or like a sensory content in our perceptual field.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 650.427,
    "end": 656.755,
    "text": " Now, the importance of affection lies in the fact that the world is first properly given and experienced through it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 657.176,
    "end": 659.539,
    "text": "For something to be experienced, it must affect me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 659.999,
    "end": 664.845,
    "text": "So this kind of shows the importance of affection in relation to temporality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 665.146,
    "end": 675.439,
    "text": "Temporality provides the formal framework that organizes experiential content, but for us to experience something at all, there has to be affection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 675.841,
    "end": 682.951,
    "text": " And I like to link the Husserlian concept of affection to the broader concept of affectivity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 683.111,
    "end": 686.797,
    "text": "And I borrow Giovanna Colombetti's concept of affectivity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 687.377,
    "end": 696.33,
    "text": "It's not only about emotions or moods or these different kinds of affective states, but rather it's a broader dimension that she defines as a lack of indifference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 696.749,
    "end": 707.261,
    "text": " And in this case, we can say that affection, in the Husserlian sense, is completely consistent with affectivity, because when something affects us, then we're no longer indifferent to it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 707.561,
    "end": 711.433,
    "text": "So that's affectivity in the broadest and most basic of senses.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 712.004,
    "end": 729.051,
    "text": " But importantly, for Husserl, and I would say that for other classical phenomenologists, affection still presupposes time-conscience, temporality, mainly because for something to affect us, it has to occur, it has to be given in the impressional present, so that our face,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 729.031,
    "end": 733.102,
    "text": " It also forms this orientation toward the future, this tendency towards attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 733.483,
    "end": 737.574,
    "text": "It's a solicitation towards the future, so it presupposes pro-attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 737.895,
    "end": 742.568,
    "text": "And there's also a relationship with retention, but I'm not going to dwell too much into that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 742.902,
    "end": 755.068,
    "text": " The whole point about this is that, given that affection still presupposes time consciousness, we can say, or this Husserl would say, temporality is the most basic structure of consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 755.429,
    "end": 762.143,
    "text": "So if we want to do cognitive science or consciousness research, we should probably start by temporality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 762.68,
    "end": 773.297,
    "text": " And interestingly, if we go to the inactive approach and Varela's neurophenomenology, which is a way of trying to integrate phenomenological research",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 773.497,
    "end": 800.955,
    "text": " with neurobiological research by establishing reciprocal constraints between these two domains the first neurophenomenological study and analysis that Varela developed is precisely of time consciousness and he considers it to be kind of an acid test for the neurophenomenological project but there is some differences between how Varela and Husserl conceive of temporality whereas for Husserl",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 801.29,
    "end": 807.002,
    "text": " Temporality is kind of abstract, formal framework that is always organizing our experiences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 807.403,
    "end": 813.555,
    "text": "Varela very clearly states that embodied activity gives temporality its roots in living itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 813.635,
    "end": 815.94,
    "text": "So that's kind of the enacted gimmick, isn't it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 816.224,
    "end": 841.911,
    "text": " uh we have for varela what actually gives rise to experience of time is the fact that we're embodied beings that are um relating their were interacted with the world through action and an example of this is something like the dog rabbit illusion so sometimes you see a dog sometimes you see a rabbit and i would say that this shift which is a temporal shift we can actually experience kind of the temporal unfolding",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 841.891,
    "end": 845.215,
    "text": " of how our percept changes over time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 845.635,
    "end": 861.372,
    "text": "For Varela, this shift occurs because there's action going on, usually very minimal and often unnoticed action, for example, visual saccades or maybe just shift your attention a bit, and that changes the whole percept.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 861.392,
    "end": 871.122,
    "text": "And this kind of shows for Varela that we actually have to focus on this embodied activity that gives rise to this constant temporal unfolding of how we perceive the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 872.08,
    "end": 898.746,
    "text": " and the kind of the whole point of neuro phenomenology is to try to look at what's happening at the neural level and what Varela says or he discovers is that if you look at the neural dynamics that underpin this embodied activity and you describe them through the tools of dynamical systems theory the kind of model you get you know trajectory in state space",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 898.996,
    "end": 927.805,
    "text": " these dynamics would mirror will will probably mirror the structure of the living present as it is analyzed by hooser so we have this kind of almost isomorphic relationship between the dynamics of uh the neural dynamics that underpin and what activity and the dynamics of time consciousness which or varela suggests that that's precisely where we can find the reciprocal constraining between phenomenology and neurobiology but there is an important distinction between",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 928.325,
    "end": 940.008,
    "text": " Another important distinction between Varela and Husserl here, whereas for Husserl, at least in the classical texts in which he analyzes time consciousness, protension is kind of the mirror opposite of retention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 940.068,
    "end": 943.074,
    "text": "So, protension is kind of this retention that is looking to the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 943.615,
    "end": 946.941,
    "text": "Varela notices that there is something different about protension.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 946.921,
    "end": 952.489,
    "text": " For him, pretension seems to be marked by an affective tonality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 952.709,
    "end": 972.017,
    "text": "And in the 1999 paper, the example he gives is that while he's trying to write this work, while he's trying to find the correct words, he feels this tendency, this disposition to look for a very specific word, but it's also marked by frustration because he cannot really find the proper expression.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 971.997,
    "end": 978.324,
    "text": " So there's this kind of correlation between anticipation and the tendency towards the future and a feeling tonality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 978.765,
    "end": 982.79,
    "text": "And that's all he says in the 1999 paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 982.97,
    "end": 987.215,
    "text": "He says that I'm just doing a sketch of this and hopefully I'll work on this in the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 987.896,
    "end": 992.601,
    "text": "And I think there's two ways in which we can find the elaborations on these ideas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 993.102,
    "end": 998.308,
    "text": "On the one hand, we can borrow from a later inactive analysis of emotion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 999.082,
    "end": 1019.767,
    "text": " When you read, for example, the work of Evan Thompson or Giovanna Colombetti, they often emphasize the fact that emotion is a process that integrates a lot of neural sub-processes, including attention, evaluation, bodily arousal, and importantly for what I'm interested in, action tendencies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1020.147,
    "end": 1028.177,
    "text": "And a way to illustrate this is by borrowing Walter Freeman's dynamic architecture of the limbic system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1028.461,
    "end": 1042.386,
    "text": " so for freeman if you look at the dynamics of brain body and environment you can find a lot of causal loops that constitute certain cognitive processes so for instance if we want to understand",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1046.888,
    "end": 1073.419,
    "text": " hippocampus the motor systems and the environment from this causal loop it's a an action perception loop mainly and this suggests like that environment body and brain co-constitute action cognitive action but the important thing here for me is that all these loops all these different proprioceptive motor loops all go through the hippocampus which is as you probably know kind of the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1073.703,
    "end": 1077.368,
    "text": " one of the most important parts in the brain that is related to emotion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1077.929,
    "end": 1091.608,
    "text": "And this is a way of noticing that all these cognitive processes, action, perception, proprioception, are probably at the subpersonal neural level colored or constituted by emotion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1093.17,
    "end": 1093.551,
    "text": "And",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1093.987,
    "end": 1112.388,
    "text": " What Thomson takes from this is that if you look at the relation between the motor system and the sensory system, there has to be what we may call a state of expectancy, because our sensory systems have to be prepared in relation to the consequences of our actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1112.728,
    "end": 1118.695,
    "text": "And this is kind of very, very similar to some of the claims in the active infant literature, although this is earlier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1118.945,
    "end": 1145.897,
    "text": " but that's important because then you have this kind of anticipation what it's about to come at the sensory level at least at a neural level and thompson says that we can actually link this neural process to what at the experiential level phenomenologists call protension so we start seeing this connection between protension so temporality and emotion so affectivity so we see at a neurophenomenological level how we're moving beyond",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1146.113,
    "end": 1149.922,
    "text": " just this very formal and abstract description of temporality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1151.285,
    "end": 1160.848,
    "text": "But even if we look at this paper by Varela and Depra in 2005, they look further and they analyze the experiential level of affection",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1161.183,
    "end": 1166.329,
    "text": " And they kind of analyze it as a form of what they call a micro-temporality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1166.349,
    "end": 1177.002,
    "text": "So they say that if you analyze not only kind of the neural level, but also the phenomenological slash experiential level, you'll find that there's this kind of very quick integration of events.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1177.023,
    "end": 1185.553,
    "text": "You have the precipitation of an event or trigger, so something affects you, the emergence of salience, so experientially what affects you becomes salient,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1185.533,
    "end": 1199.075,
    "text": " there's a balanced feeling tone, that's the call affective tonality I've been talking about for a while already, there's motor changes, so there's action tendencies that are formed towards the object, and there's autonomic physiological changes that kind of bring everything together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1199.115,
    "end": 1205.145,
    "text": "And this kind of this micro-temporality actually constitutes what Husserl calls affection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1206.507,
    "end": 1212.857,
    "text": "But from this analysis, which is completely consistent with the neuro-phenomenal analysis I just mentioned,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1213.124,
    "end": 1225.881,
    "text": " Varela and de Braque claim that this micro-temporality implies that affection precedes temporality because it gives rise to a tendency that can only deploy itself in time and thus as time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1226.281,
    "end": 1228.885,
    "text": "And that's a very obscure sentence for me, to be honest.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1228.965,
    "end": 1232.129,
    "text": "I've had to read it like a thousand times when I was reading that paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1233.21,
    "end": 1241.241,
    "text": "But from what I can understand, and I think that at least Evan Thompson seems to read it very similarly, is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1241.947,
    "end": 1248.958,
    "text": " What happens with this micro-temporality is that it forms a tendency, an action tendency, that precisely is protension.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1249.479,
    "end": 1261.738,
    "text": "So what we see is that this integration of very quick events that is correlated to the neurophysiological level are actually what give rise to protension.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1261.858,
    "end": 1267.286,
    "text": "And because protension is kind of the spearhead of temporality, we can say that affection precedes temporality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1267.306,
    "end": 1269.81,
    "text": "It's kind of the temporal and logical",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1269.79,
    "end": 1273.894,
    "text": " an empirical antecedent to temporality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1273.914,
    "end": 1279.98,
    "text": "So we have a very different claim in comparison to what Husserl and other phenomenologists say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1280.361,
    "end": 1294.715,
    "text": "Whereas Husserl would say, you know, the first and most important and most basic structure of consciousness is temporality, it seems like some inactivists would say, no, no, no, no, temporality is super important, but it actually presupposes affectivity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1296.537,
    "end": 1299.24,
    "text": "And I think there's something odd about that claim,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1299.743,
    "end": 1303.948,
    "text": " Because how can affection precede temporality if it is deployed in time?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1304.529,
    "end": 1306.871,
    "text": "There seems some sort of paradox going on here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1308.834,
    "end": 1310.035,
    "text": "That's precisely their claim.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1310.135,
    "end": 1317.564,
    "text": "If you see here, they say affection precedes temporality because it gives rise to a tendency that can only deploy itself in time and thus as time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1317.644,
    "end": 1318.505,
    "text": "That's their claim.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1318.845,
    "end": 1324.452,
    "text": "Temporality emerges in this micro-temporality of affection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1325.039,
    "end": 1345.866,
    "text": " i think that there's the risk of um conflating two different temporalities in here there is on the one hand what we may call objective time so it's the time of neural processes the time that neuroscientists use to measure all these um neural events and dynamics and there's subjective time so time consciousness how we experience the world",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1346.487,
    "end": 1365.019,
    "text": " And it's problematic to complete these two kind of temporalities because the whole point of phenomenology from the consulting perspective is to find the structures that actually allow us to experience time as an objective feature of the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1365.573,
    "end": 1374.489,
    "text": " When I say that there's the risk of completing these two levels in the inactive approach, it's very clear when you see this precisely, the micro-temporality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1374.75,
    "end": 1379.258,
    "text": "If you take a look at this micro-temporality, some events are clearly experiential.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1379.398,
    "end": 1381.422,
    "text": "For instance, the emergence of salience,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1381.402,
    "end": 1398.938,
    "text": " and the valence feeling tone so we experience the saliency of objects we experience the feeling tonality of of what it's like to be you know a human being that engages with objects but for instance motor changes and autonomic physiological changes seem to be more of a sub-personal or even neural",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1398.918,
    "end": 1400.521,
    "text": " process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1400.801,
    "end": 1406.01,
    "text": "So that's not at the subjective level, but rather at the objective level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1406.35,
    "end": 1417.149,
    "text": "So there is this kind of shifting between the objective and subjective levels, which I think is what actually justifies the claim that affection precedes temporality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1417.569,
    "end": 1425.162,
    "text": "I mean, affection precedes temporality if we understand affection just at this level, at the level of neural process and neural loops.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1425.142,
    "end": 1431.789,
    "text": " But if we look at it from an experiential perspective, that is not so clear, because we cannot really experience these loops.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1431.849,
    "end": 1437.015,
    "text": "We experience kind of the effect, if you want to put it like that, or kind of what emerges from these correlations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1437.435,
    "end": 1438.877,
    "text": "We don't experience them as such.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1439.497,
    "end": 1453.512,
    "text": "So again, saying that affection precedes temporality, it is as if we are saying affection, a subjective process, objectively precedes another subjective process, and that's where the compilation kind of comes in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1454.487,
    "end": 1472.045,
    "text": " And what is interesting about this conflation is that if you look at the 1999 paper of Varela, the one on time consciousness, he realized that there is something odd about the relationship between temporality and affectivity or emotion, as he calls it there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1472.285,
    "end": 1479.432,
    "text": "And he says that maybe what we have to look for is what he calls a non-dual solution or a non-dual perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1479.452,
    "end": 1481.254,
    "text": "So we're trying to show that these",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1483.698,
    "end": 1508.777,
    "text": " maybe one or there's some sort of dialectic going on if you want to put it like that and it's quite interesting because again at that point he's saying i'm just sketching some ideas and then later on when he publishes the varela and the paper of 2005 which is actually like 2002 um there's no non-dual perspective at all what you find is precisely a dual perspective according to which affectivity precedes temporality",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1509.483,
    "end": 1524.164,
    "text": " So what I want to do here now is to try to pursue this non-dual perspective and show that temporality and affectivity go hand in hand, they are co-emergent, but to actually show that we have to avoid conflating the objective and the subjective levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1524.204,
    "end": 1529.191,
    "text": "And that's the reason why I focus on the phenomenological level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1530.654,
    "end": 1533.077,
    "text": "So this brings me back to Husserl.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1533.344,
    "end": 1549.55,
    "text": " So, when we're talking about affection, it's very important to notice that this kind of transition from affection to attention gives rise to a foreground-background structure in perception, and it's very well noted by Gestalt psychologists later on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1550.111,
    "end": 1558.845,
    "text": "So, for instance, in this usual example of Gestalt perception, if you focus on the black shape, you will probably see something like a vase,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1559.247,
    "end": 1582.555,
    "text": " but this perceptual meaning the fact that you're perceiving a black vase and it's only possible because there is also a white background so you have this kind of perceptual interplay between the foreground and the background whereas the black foreground the object of attention is given in a specific way the background is still given you're experiencing that the white",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1582.923,
    "end": 1609.47,
    "text": " part but it's not the focus of your attention and that's very important because that kind of shows that when we shift from affection to attention there's still an effective background kind of not only pulling and trying to pull our attention but it's also kind of giving meaning to what we're perceiving so that kind of shows that the object of attention always presupposes an effective background",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1610.767,
    "end": 1625.974,
    "text": " And this not only happens in very simple cases like this, but also if we look at a more complex painting, there's a lot of different objects and colors and beautiful sketches that are trying to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1626.241,
    "end": 1653.835,
    "text": " precisely pull our attention it's affection and if you focus for instance in the face of this girl there's a lot of colors that are still there and they will probably produce a feeling of i don't know maybe you like the painting maybe you think it's beautiful or maybe you don't like that but this all comes in the interplay between foreground and background or between attention and affection and if we go kind of zoom out from here",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1654.203,
    "end": 1665.536,
    "text": " And going back to the concept of intentionality, then a phenomenologist like me would say that this kind of shows that we can distinguish two concepts of intentionality that are always at play.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1665.976,
    "end": 1680.152,
    "text": "There is what we may call object intentionality, which is the usual way in which philosophers of mind and cognitive scientists talk about intentionality, this kind of directedness or aboutness of the mind that is directed towards a specific object.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1680.172,
    "end": 1682.134,
    "text": "In this case, it could be, say, the face of the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1682.114,
    "end": 1684.557,
    "text": " That's the intentional object.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1685.158,
    "end": 1690.385,
    "text": "Phenomenologists would say that that's an active, attentive, and explicit form of intentionality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1690.525,
    "end": 1693.268,
    "text": "It is attentive because it presupposes attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1693.569,
    "end": 1696.212,
    "text": "It's explicit because I'm explicitly related to that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1696.232,
    "end": 1697.614,
    "text": "I'm thematizing an object.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1698.075,
    "end": 1702.921,
    "text": "And it's active because, in a sense, I am the one who decides what to attend.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1703.421,
    "end": 1707.767,
    "text": "At least at a very minimal level, there's a form of action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1708.203,
    "end": 1730.38,
    "text": " but behind this there's always this effective background or effective horizon which is also intentional because we are experienced in it it's given or pre-given user would say but it's easier to think about as given in experience but it's passive because we do not decide what affects us it just kind of happens it's something in our perceptual field it's effective because it um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1730.849,
    "end": 1740.93,
    "text": " occurs through affection and it's often implicit because we are not paying attention to the background, precisely because we are attending the foreground, the background is often implicit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1741.291,
    "end": 1748.406,
    "text": "But this background is super, super important because it shapes how we experience the intentional object.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1748.948,
    "end": 1751.052,
    "text": "If you want to go further,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1751.774,
    "end": 1778.237,
    "text": " deeper into into the concept of predictive intentionality you can think about the experience of your body so proprioceptive experience we often do not pay attention to how our body feels but it's always there in the background it's affecting us it's like a form of self-affection some phenomenologists would say and this all comes together precisely to give rise to the specific experiential meaning of the intentional object at the level of object intentionality",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1779.517,
    "end": 1801.795,
    "text": " so this kind of shows that affection is way more important and perhaps more complex than initially thought and to even kind of make things a bit more complex we can also take into account the fact that affection is deeply embodied so to give you an an example but uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1802.838,
    "end": 1813.357,
    "text": " elaborated by Husserl, he says that every perception that presents the object to me in this attentional orientation leaves open the practical transition to other appearances of the same object.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1813.598,
    "end": 1817.725,
    "text": "So this practical transition to other appearances, precisely the transition from",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1818.194,
    "end": 1819.295,
    "text": " affection to attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1819.355,
    "end": 1823.52,
    "text": "I can always thematize or attend what is affecting me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1823.9,
    "end": 1829.407,
    "text": "But as Husserl would note, this involves practical engagements.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1829.427,
    "end": 1833.011,
    "text": "So he says that the possibilities of transition are practical possibilities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1833.551,
    "end": 1844.083,
    "text": "There is thus a freedom to run through the appearances in such a way that I move my eyes, my head, alter the posture of my body, go around the object, direct my regard to it, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1844.35,
    "end": 1863.709,
    "text": " so this shows that attend affection is not only a like it's not an abstract pool not an abstract solicitation it's actually an embodied solicitation it's not only trying to uh objects are not trying to capture attention and that's it they're trying to move us in a very literal sense",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1863.908,
    "end": 1867.194,
    "text": " And this is kind of very, very familiar to an activist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1867.214,
    "end": 1874.586,
    "text": "This is precisely what Varela was trying to point out when he was saying that embodied activity is at the root of temporality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1875.228,
    "end": 1877.271,
    "text": "This is the embodied activity he was thinking about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1877.371,
    "end": 1879.775,
    "text": "It's already found in the works of Husserl.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1880.377,
    "end": 1885.866,
    "text": "And we take very, very seriously this practical or embodied nature of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1886.183,
    "end": 1909.643,
    "text": " affection i think that we end up thinking about the world as something very similar to um climbing wall so if you've ever been to a climbing center you might encounter something like this walls full of holes and they have different shapes they have different colors some of them are very very difficult to get a hold of some of them are quite easy there's there's a lot of stuff going on",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1909.623,
    "end": 1915.385,
    "text": " And all of them are quietly doing what ecologists would call affordances.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1915.525,
    "end": 1920.223,
    "text": "They afford different action possibilities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1921.013,
    "end": 1940.71,
    "text": " how they afford how strongly they afford to do that how strongly they solicit your action depends on thing depends on things like uh your skills how skillful you are uh the kind of body you have or even the interest you have so if you're trying to run through a specific curse in the in the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1941.331,
    "end": 1948.578,
    "text": " in the climbing wall, some holds would be completely irrelevant in relation to the course you're trying to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1948.918,
    "end": 1954.364,
    "text": "So they are not as affording as they might be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1955.085,
    "end": 1959.529,
    "text": "And that's kind of how I understand the world from a phenomenological perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1959.609,
    "end": 1963.172,
    "text": "This is what operative intentionality opens up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1963.713,
    "end": 1969.819,
    "text": "The world becomes what ecological psychologists would call a field of relevant affordances.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1975.233,
    "end": 1978.316,
    "text": " our needs, our skills, or the kind of body we have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1978.376,
    "end": 1980.598,
    "text": "That's mainly the point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1980.618,
    "end": 1992.349,
    "text": "And what I like about affordance is that you can very easily move from this more ecological perspective to a phenomenological perspective by asking how affordant perception works.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1992.85,
    "end": 1994.812,
    "text": "Again, that's a classical phenomenological question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1994.912,
    "end": 1997.915,
    "text": "How does this specific form of experience work?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1998.055,
    "end": 2000.457,
    "text": "What are its instructions?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2000.477,
    "end": 2003.62,
    "text": "And as I've done elsewhere,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2004.055,
    "end": 2017.809,
    "text": " analyze this affording perception as the interplay between a pull or solicitation coming from the object, so the object is pulling or soliciting a specific action, and a subjective projection of practical possibilities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2018.37,
    "end": 2025.537,
    "text": "And this subjective projection is precisely a future-oriented projection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2025.717,
    "end": 2029.461,
    "text": "Husserl would say that affection has a unitary tendency toward the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2029.781,
    "end": 2033.505,
    "text": "Intentionality is predominantly oriented toward the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2034.093,
    "end": 2039.844,
    "text": " So we may say that objects appear as affording actions, as soliciting action, that's affection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2040.305,
    "end": 2043.19,
    "text": "But these actions can only be done in the near future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2043.511,
    "end": 2045.234,
    "text": "And I can in the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2045.314,
    "end": 2048.24,
    "text": "So the projection is not only bodily, but also temporal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2048.38,
    "end": 2050.805,
    "text": "It's a form of bodily anticipation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2051.226,
    "end": 2056.776,
    "text": "And this kind of starts intertwining affection and temporality in a very, very nice way, I think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2057.937,
    "end": 2068.038,
    "text": " From this perspective, I believe operative intentionality involves the interplay between affective solicitations and future-oriented or potential projection of practical possibilities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2068.519,
    "end": 2076.115,
    "text": "The horizon that serves as the background for attention would be experientially understood as a set of bodily and participatory tendencies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2077.613,
    "end": 2083.088,
    "text": " So, this shows in which sense, for me, affectivity and temporality are co-emergent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2083.429,
    "end": 2087.902,
    "text": "On the one hand, affection presupposes the potential projection of bodily possibilities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2088.303,
    "end": 2092.635,
    "text": "So, projection of temporality shapes affection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2093.307,
    "end": 2100.919,
    "text": " But on the other hand, temporality, or more specifically, protention, anticipation, presupposes the affective disclosure of the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2101.28,
    "end": 2106.689,
    "text": "If nothing were to affect me, there would be no impressional presence from which anticipations are formed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2106.949,
    "end": 2109.153,
    "text": "So objects are pulling me right now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2109.573,
    "end": 2114.501,
    "text": "And it's because right now there's this affective tendency that I actually have these projections.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2114.562,
    "end": 2119.77,
    "text": "And this kind of shows that affection and protention, the spearhead of temporality,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2120.206,
    "end": 2129.265,
    "text": " presuppose one another, which shows that they are co-emergent, which is precisely what both an activist and phenomenologist kind of miss, I think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2129.966,
    "end": 2134.616,
    "text": "And this, I believe that has very interesting consequences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2134.656,
    "end": 2140.729,
    "text": "And to give you an illustration of what I mean, let's talk about very, very briefly about depression.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2141.671,
    "end": 2151.547,
    "text": " So here I'm borrowing a figure from a paper by and colleagues in which they are trying to sketch different fields of relevant affordances.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2152.829,
    "end": 2158.117,
    "text": "You can ignore the OCD one and just want to focus on the quote unquote normal one and the depression one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2158.558,
    "end": 2165.088,
    "text": "So each of these bars represents how soliciting an affordance is in the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2165.128,
    "end": 2168.353,
    "text": "So for us, if we're not suffering from",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2168.992,
    "end": 2175.422,
    "text": " severe depression, some objects or some events in the world will solicit us more than others.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2175.442,
    "end": 2181.512,
    "text": "There's a stronger affective tendency, there's stronger need or pull coming from the object.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2181.833,
    "end": 2182.053,
    "text": "Why?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2182.093,
    "end": 2188.023,
    "text": "Again, it depends on our concerns, our interests, our bodily skills, etc.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2188.744,
    "end": 2195.455,
    "text": "What happens in depression is there's a flattening of the field of relevant affordances.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2196.312,
    "end": 2222.978,
    "text": " because people with depression struggle a lot with trying to wake up in the morning or doing everyday tasks because their world is not from their perspective is not kind of soliciting all these actions and this can be represented visually with this figure and i find it very very striking when you link this with actual descriptions of what it's like to be in a severely depressed state",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2223.397,
    "end": 2227.582,
    "text": " So for instance, Locke describes his own experience in depression as follows.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2228.183,
    "end": 2233.29,
    "text": "In depression, everyday tasks take on an aspect of impossibility.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2233.57,
    "end": 2239.478,
    "text": "I see a task as far more difficult than it actually is, or I see myself as not being up to the task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2239.498,
    "end": 2242.502,
    "text": "So again, it's an aspect of impossibility, whereas",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2242.482,
    "end": 2254.093,
    "text": " in quote-unquote normal perception, there's this kind of tacit or pre-effective bodily I can, what I can do is always related to these affordances.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2254.633,
    "end": 2257.135,
    "text": "In depression, it's a complete impossibility.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2257.376,
    "end": 2257.956,
    "text": "I cannot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2258.336,
    "end": 2267.885,
    "text": "And this, again, this completely illustrates from a experiential perspective how the field of relevant affordances for the depressed person is almost patent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2268.826,
    "end": 2269.907,
    "text": "But it's also",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2270.478,
    "end": 2272.741,
    "text": " links with the experience of time in depression.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2272.922,
    "end": 2275.045,
    "text": "So here I have another quote.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2275.345,
    "end": 2275.986,
    "text": "This is from Lot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2276.967,
    "end": 2284.298,
    "text": "He says that in his description of his experience in depression, he says, I have absolutely no faith, in fact, in anything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2284.679,
    "end": 2297.177,
    "text": "In a muddy way, I see that depression manifests itself as a crisis of faith, not religious faith, but the almost born instinct that things are fluid, that they unfold and change, that new kinds of movement",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2297.461,
    "end": 2301.836,
    "text": " The new kinds of moments are eventually possible, but the future will arrive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2302.398,
    "end": 2309.682,
    "text": "I am in a time-locked place, where the moment I am in will stretch on agonizingly forever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2310.404,
    "end": 2324.162,
    "text": " And what is kind of fascinating for me about these three points together is that they very, very clearly show how affection, so this solicitation, and temporality go hand in hand.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2324.803,
    "end": 2331.773,
    "text": "On the one hand, the world is not soliciting, it's not motivating actions for the subject, for the depressed subject.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2332.233,
    "end": 2334.917,
    "text": "And this is also experienced as a lack of future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2334.977,
    "end": 2336.559,
    "text": "Future is no longer there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2337.0,
    "end": 2339.483,
    "text": "It is as if there are time locked in place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2340.037,
    "end": 2353.339,
    "text": " And this precisely shows what I'm trying to show, that affection, this affordance, this solicitation go hand in hand with how we experience time, especially as future-oriented.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2354.041,
    "end": 2361.353,
    "text": "And this also shows another point which I further develop in my paper, but I'm not going to dwell too much here, that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2361.772,
    "end": 2368.581,
    "text": " This relationship between affectivity and temporality is also expressed as what I may call general feelings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2368.661,
    "end": 2377.492,
    "text": "So, for instance, here, Lot talks about a lack of faith, and that lack of faith is quite literally, I would say, a feeling in relation to the whole world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2377.552,
    "end": 2389.668,
    "text": "So, at the operative level of intentionality, the world is opened up as lacking not only motivation, but there's no faith towards it, which is more of a feeling domain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2389.688,
    "end": 2391.39,
    "text": "But again, we can discuss this later on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2392.062,
    "end": 2401.547,
    "text": " I just want to show here how in depression we can see that both affection and temporality are disturbed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2402.69,
    "end": 2408.164,
    "text": "So, to finish off, how can affection precede temporality if it is deployed in time?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2408.448,
    "end": 2412.733,
    "text": " Well, it doesn't if we keep ourselves at the experiential level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2412.753,
    "end": 2424.827,
    "text": "I would say that given this kind of phenomenological analysis, now we can go and try to understand empirically and neurobiologically the neural underpinnings of consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2424.847,
    "end": 2431.975,
    "text": "But we have to take into account this correlation, this co-emergence between temporality, subjective temporality and affectivity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2432.714,
    "end": 2462.164,
    "text": " and to answer the question of the title of the paper nothing comes before time but it comes hand in hand with affection and that's it thanks thank you thank you sharing okay first though i hesitate to use such a time-bound word dean um what are your what are your thoughts",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2463.258,
    "end": 2467.123,
    "text": " Well, first of all, thank you, and I apologize for showing up late.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2467.183,
    "end": 2473.23,
    "text": "Juan Diego, the last time I saw you, you were working on some things I knew was really impressive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2473.791,
    "end": 2478.056,
    "text": "And so I was really excited about hearing what you had to present today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2478.577,
    "end": 2479.738,
    "text": "I have a quick question for you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2479.858,
    "end": 2490.531,
    "text": "In the active infants community right now, we are working on trying to put together something that addresses the ontology of being",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2490.511,
    "end": 2492.073,
    "text": " inactive inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2492.113,
    "end": 2492.854,
    "text": "What does that mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2492.874,
    "end": 2494.496,
    "text": "What's the definitional piece of that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2495.077,
    "end": 2497.039,
    "text": "What does it mean to be inactive infer?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2497.54,
    "end": 2506.41,
    "text": "And the idea that you raise, which is trying to make sense of that with temporality front of mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2506.45,
    "end": 2518.425,
    "text": "Okay, so when you put your slides up, for example, you had all the images, you had the duck rabbit, there's a certain stability, even though the agent can pull interpretations from that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2518.895,
    "end": 2522.179,
    "text": " But there's a kind of consistency of constants to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2522.279,
    "end": 2530.329,
    "text": "Whereas if I'm being an active inferrer, the only constant is that I'm consistently updating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2530.489,
    "end": 2531.69,
    "text": "I'm always changing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2532.071,
    "end": 2533.352,
    "text": "I'm in that flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2533.813,
    "end": 2534.954,
    "text": "I'm in that condition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2535.375,
    "end": 2544.666,
    "text": "And it's the back and forth between the relative stabilities and the degree of change that a person goes through in order to keep up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2545.304,
    "end": 2572.392,
    "text": " keep up with their niche and understand that they're enveloped but as you pointed out there's also these isomorphisms and this eyes of this perspective and this ability to maybe break time out into more than one type so i was just wondering based on the work that you've done here if you were to try to come up with an ontology how would you be able to bring together the sense of consistency",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2572.743,
    "end": 2575.81,
    "text": " and the consistency of change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2577.554,
    "end": 2578.897,
    "text": "That is a fascinating question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2579.077,
    "end": 2591.224,
    "text": "And I think that active inference is a good lens through which we can approach this question, not only in relation to the modeling perspective, but also the phenomenological perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2591.727,
    "end": 2605.262,
    "text": " Because something that I didn't mention, at least in the presentation, but that's in the paper, is that these anticipations, these tacit anticipations, can be understood not only in an affective level, but also at an epistemic level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2605.582,
    "end": 2607.407,
    "text": "So, for instance, Husserl would say that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2607.387,
    "end": 2615.757,
    "text": " Sometimes you're walking down the street and see what might be the shape of a human being, a person, and you have a set of anticipations related to that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2616.097,
    "end": 2623.806,
    "text": "I would say you anticipate talking to the person or engaging in different activities that are related to human beings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2624.307,
    "end": 2627.691,
    "text": "But if you come closer, there's something odd about this shape.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2628.432,
    "end": 2630.775,
    "text": "It might be either a human being or a doll.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2631.976,
    "end": 2632.637,
    "text": "Kuslo suggests.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2633.237,
    "end": 2634.559,
    "text": "And the important thing here is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2635.028,
    "end": 2639.644,
    "text": " these pretensions, these anticipations kind of are modalized.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2639.985,
    "end": 2641.972,
    "text": "They become doubtful, Husserl would say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2642.694,
    "end": 2647.35,
    "text": "And that's very reminiscent to me to what happens in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2650.486,
    "end": 2660.465,
    "text": " updating its inferences, it's a matter of trying to not only take into account temporal unfolding of the world but trying to get a hold of it, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2660.886,
    "end": 2664.833,
    "text": "It's trying to recognize what is going on outside.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2664.853,
    "end": 2670.925,
    "text": "So there's the constant of change because the world is constantly changing and it's also clear in phenomenology",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2670.905,
    "end": 2695.09,
    "text": " and not only the world is constantly changing but the subject consciousness is always changing this constant flow that's what defines consciousness from a phenomenological perspective but what i like here is that what links these two domains together at the phenomenological level is affection very literally this embodied dynamics related to the world an active inference",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2695.728,
    "end": 2697.231,
    "text": " does something very similar.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2697.571,
    "end": 2704.323,
    "text": "You know, this inference related to the policies are what keep the generative model and generative process together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2704.343,
    "end": 2712.657,
    "text": "So there is this constant kind of correlation and loops between the agent and the world or the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2713.379,
    "end": 2715.822,
    "text": " that are also found in phenomenology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2715.842,
    "end": 2727.315,
    "text": "So I would say that if you ask me about ontology, and I think that my co-author of the other paper we discussed here last year, Zach, he would gladly say that this is a process ontology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2727.875,
    "end": 2728.837,
    "text": "And I agree with that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2729.137,
    "end": 2729.938,
    "text": "I agree with that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2730.218,
    "end": 2731.299,
    "text": "The constant is change.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2732.501,
    "end": 2734.303,
    "text": "So one last quick follow-up question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2734.963,
    "end": 2742.492,
    "text": "If it is about effect, then I know that I can be conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2744.024,
    "end": 2753.254,
    "text": " I also know that there are definitions of consciousness, but I'm not sure that the definitions of consciousness carry an effect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2753.595,
    "end": 2761.364,
    "text": "I think it's only while we're aware of being conscious that that effect condition seems to apply.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2761.424,
    "end": 2761.984,
    "text": "Would you agree?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2763.126,
    "end": 2768.732,
    "text": "What do you mean by an effect?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2769.202,
    "end": 2792.577,
    "text": " in the in the classic sense of it's it's here are my emotions these are the affects that i'm sensing on it on a moment by moment basis so this is again goes back to this so we seem to have this really interesting capacity to be able to externalize things and strip out effect because i know poetry can make me have all of these great sensations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2793.215,
    "end": 2797.484,
    "text": " But once I put the poem down and go away, they don't follow me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2798.185,
    "end": 2801.452,
    "text": "They stay within the symbols on the page.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2803.416,
    "end": 2805.841,
    "text": "I carry the sense of consciousness around with me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2806.382,
    "end": 2808.506,
    "text": "That's the being part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2809.107,
    "end": 2813.957,
    "text": "Again, I don't have an explanation for this, but I just have a lot of wonders around it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2814.865,
    "end": 2815.747,
    "text": " Yeah, okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2815.787,
    "end": 2822.422,
    "text": "So that kind of comes together with the other thing I didn't mention too much in the presentation, which was the whole thing about general feelings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2822.963,
    "end": 2831.302,
    "text": "So affectivity, as I understand it, through the work of Giovanna Colombetti, is this kind of general, it's this lack of indifference towards the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2831.523,
    "end": 2833.026,
    "text": "And this can be understood in very, very",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2833.006,
    "end": 2833.907,
    "text": " very different levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2834.067,
    "end": 2835.95,
    "text": "It's a hierarchy if you want to put it like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2836.29,
    "end": 2838.594,
    "text": "So emotions, I would say, are quite complex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2838.634,
    "end": 2841.377,
    "text": "You know, you have to have an intentional object most of the time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2841.658,
    "end": 2844.361,
    "text": "You have to have certain bodily dynamics going on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2844.381,
    "end": 2845.403,
    "text": "There's an appraisal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2845.803,
    "end": 2847.225,
    "text": "There's a lot of stuff going on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2847.486,
    "end": 2851.992,
    "text": "It's this fascinating combination between cognitive and bodily components, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2853.413,
    "end": 2855.636,
    "text": "Moods are also super, super complex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2855.697,
    "end": 2862.726,
    "text": "But I would say even at the most basic level, this interplay between affection in the Husserlian sense and temporality",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2865.541,
    "end": 2870.568,
    "text": " because you're always anticipating, bodily anticipating the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2871.209,
    "end": 2873.752,
    "text": "Sometimes your anticipation might be completely doubtful, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2874.453,
    "end": 2878.819,
    "text": "Maybe something happened and this kind of changes the whole anticipatory dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2879.24,
    "end": 2882.945,
    "text": "And it's not only an epistemic thing, it's not only that maybe I should doubt about everything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2883.265,
    "end": 2885.288,
    "text": "There's also a lack of trust.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2885.487,
    "end": 2901.758,
    "text": " and again like psychopathology shows this quite clearly i mentioned depression but there's also a phenomenological research on trauma and what happens in trauma people who suffer a severe severe trauma is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2902.345,
    "end": 2921.012,
    "text": " they cannot they can no longer trust other people and the world and it's not that they explicitly think about the fact it's simply that the world appears to be dangerous or you know as something that might attack me and this is an effective domain that it's always kind of i wouldn't say coloring but it's always kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2921.262,
    "end": 2944.148,
    "text": " constituting or it's always uh defining or shaping how we experience the world so this kind of very general basic basic domain might change in relation to emotions which are higher and roots but it's always that we're always effectively coupled to the world and this if you buy into my whole picture this affective domain is also active in a very literal sense",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2950.0,
    "end": 2968.195,
    "text": " okay i have a slightly different question how do we go into that micro temporal experience like how do we gird or prepare ourselves or do we go in holding our hand or are we holding a wall",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2969.322,
    "end": 2983.279,
    "text": " Or how do we enter into perhaps the direct investigation of some of these claims that are made about, in a way, how our experience arises from our bodies?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2985.302,
    "end": 2993.372,
    "text": "I think that the best way to do that is trying to keep a very tight relationship between",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2993.993,
    "end": 2997.818,
    "text": " lived experience with phenomenological analysis, and not only the classical ones.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2998.219,
    "end": 3012.459,
    "text": "We can also think about qualitative phenomenological research on lived experience made by people like Antoine Lutz and others, but we also have to hold together the empirical domain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3012.499,
    "end": 3016.585,
    "text": "And that's the whole point of neurophenomenology which I truly buy into.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3017.146,
    "end": 3018.027,
    "text": "So",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3018.952,
    "end": 3025.6,
    "text": " On the one hand, a phenomenological analysis like the one I just proposed may actually guide how we understand neurodynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3025.62,
    "end": 3034.089,
    "text": "Because, you know, if you look at, say, an fMRI, you see all these neurodynamics going on, but by themselves they don't tell you anything at all, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3034.109,
    "end": 3036.332,
    "text": "They're just causal processes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3037.073,
    "end": 3040.977,
    "text": "You need to correlate this to something going on at the...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3041.733,
    "end": 3042.834,
    "text": " the experiential level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3043.095,
    "end": 3050.144,
    "text": "It's not only the fact that we have data, but we have a very, very rigorous, very strict description of what's going on here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3050.965,
    "end": 3055.732,
    "text": "And this may tell us something about how to interpret and how we understand neural dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3056.072,
    "end": 3066.406,
    "text": "But these neural dynamics will also probably give us some light on the experiential dynamics, because maybe there's something that doesn't fit too well with our phenomenological distinctions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3066.967,
    "end": 3070.812,
    "text": "And then we probably have to come back and reanalyze the experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3070.994,
    "end": 3081.949,
    "text": " and that's i think it's more of a kind of social process right it's we're talking about a social community it's not there's this constant idea that well not constant but a lot of people",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3082.604,
    "end": 3104.275,
    "text": " reject these phenomenological approaches because they think it's just introspection as in you know early 20th century psychology and it's not really that we have a very strict methodology and not only that we have like quote-unquote peer review there's a lot of discussions and i'm entering in a specific discussion here saying you know you talk about temporality and affectivity as distinct no no they come together",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3104.626,
    "end": 3117.203,
    "text": " But this is ongoing, and I truly believe that there's no end to this, which is kind of a beautiful thing as well, but it's trying to maintain the circulation between empirical and phenomenological levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3117.504,
    "end": 3123.732,
    "text": "If we don't keep them together, we're missing part of the point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3125.332,
    "end": 3149.517,
    "text": " another very interesting thing in the husserl on time consciousness slide you had the kind of trace of the past sedimentation and then the cone of of protension and then beneath that it said direction of the flow and the flow was going to the left pointing back",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3151.201,
    "end": 3156.331,
    "text": " Whereas a common time visualization would be like, well, time is going forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3157.714,
    "end": 3159.998,
    "text": "So what is pointing backwards?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3162.062,
    "end": 3164.687,
    "text": "And why don't you need a forwards pointing arrow?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3165.241,
    "end": 3175.756,
    "text": " I wonder whether I should have just do like a two-way arrow because a friend of mine read a draft of this paper before I published it and she asked me, isn't the other way around?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3175.776,
    "end": 3177.919,
    "text": "And I understand what you all mean because that's true.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3177.999,
    "end": 3180.322,
    "text": "And I'm very like forward looking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3180.362,
    "end": 3181.964,
    "text": "That's part of the point of what I'm talking about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3182.225,
    "end": 3184.548,
    "text": "You know, intentionality is future oriented.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3184.568,
    "end": 3188.093,
    "text": "But I think that when you analyze it in the way Uso does it,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3188.073,
    "end": 3193.181,
    "text": " what you notice is that the stream of consciousness is sinking into the past.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3193.201,
    "end": 3203.457,
    "text": "It's like a spear that is directed towards the future, and that's intentionality, but it's always like a river that is sinking into the past, and that's the reason why the arrow goes to the left.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3203.577,
    "end": 3209.567,
    "text": "But you might as well put it to the right, and you have, you know, it's just a spear heading towards the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3211.289,
    "end": 3216.257,
    "text": "Daniel's not pointing out that he knows that wayfinders have to get back before they can go",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3218.397,
    "end": 3246.717,
    "text": " leaving that off he he recognizes why the arrow is going the direction it is it just in that representation reminded me of just like putting down the track as we head forward like building a cliff that's always being peeked at over but as we proceed it's like the ledge just keeps on extending and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3247.473,
    "end": 3253.167,
    "text": " as we move forward and that creates the solidity of our retention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3253.227,
    "end": 3258.681,
    "text": "There's also this metaphor of sedimentation, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3259.117,
    "end": 3285.765,
    "text": " that some phenomenologists use quite a lot they talk about how what we experience it's of course retained but over time is sedimented it kind of metaphorically uh builds the foundations the soil of what we experience and this changes our whole experience so we may understand habits in that way we experience some some events over and over and this setting it's sedimented onto our consciousness that's a metaphor of course",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3285.745,
    "end": 3290.655,
    "text": " And that kind of generates habitual ways of engaging with the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3291.096,
    "end": 3301.358,
    "text": "And I think that there's something valuable about emphasizing this sinking into the past bit without downplaying the fact that intentionality directed towards the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3302.722,
    "end": 3305.686,
    "text": " I'm sorry, I really apologize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3305.986,
    "end": 3311.634,
    "text": "I really wanted to participate in this one, Juan Diego, because I think your work is fabulous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3312.074,
    "end": 3315.859,
    "text": "But I now have to run and go and deal with some politics in the wilderness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3315.919,
    "end": 3318.042,
    "text": "So I'm going to check out right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3318.122,
    "end": 3321.767,
    "text": "But thank you, thank you again for your fantastic work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3322.428,
    "end": 3322.929,
    "text": "Thank you as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3322.969,
    "end": 3324.831,
    "text": "Thank you for being here, at least for a bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3325.469,
    "end": 3347.359,
    "text": " online okay another kind of question so you distinguished the active object intentionality from the operative pass it or implicit intentionality so how do we make sense of a passive intentionality is it like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3348.065,
    "end": 3358.951,
    "text": " a desire that we don't have a control over, whereas an active desire was one that we kind of selected upstream to want to want?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3360.475,
    "end": 3364.605,
    "text": "Or what is the difference between the active and the passive intentionality?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3365.058,
    "end": 3389.243,
    "text": " so that's the australian terminology i don't think it's very popular nowadays so phenomenologists often talk about the reflective and pre-reflective levels so the reflective is like thematizing explicitly something whereas pre-reflective is not like in a temporal way it's more like a condition or reflection but what i like about the distinction between passivity and activity is that it also shows that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3389.527,
    "end": 3397.819,
    "text": " like act intentionality or object intentionality requires a degree of activity from the subject or from the agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3399.161,
    "end": 3408.074,
    "text": "And, you know, for you to attempt something, you are moving your head, moving your eyes, you're, you know, moving your body.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3408.615,
    "end": 3415.365,
    "text": "Even if you do that somewhat by mere reflex, it's still a form of activity, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3415.835,
    "end": 3419.179,
    "text": " There's something that you as an agent, as an embodied agent, are doing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3419.519,
    "end": 3422.663,
    "text": "But regardless of that, there's always this openness to the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3422.743,
    "end": 3427.989,
    "text": "We cannot stop that unless we die and we don't want to die most of the time, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3428.409,
    "end": 3429.731,
    "text": "It's passive in that sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3429.851,
    "end": 3431.893,
    "text": "It's kind of almost instinctual.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3432.414,
    "end": 3435.817,
    "text": "And I wonder whether we may talk about instincts at that level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3435.938,
    "end": 3445.268,
    "text": "And actually, talking about habits again, at some point Husserl talks about two levels of passivity and I don't know whether he",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3445.619,
    "end": 3448.302,
    "text": " kind of goes on with this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3448.382,
    "end": 3454.628,
    "text": "But I like that because he says that, you know, there's like the primary passivity, which is these very basic affective dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3455.008,
    "end": 3458.091,
    "text": "But there's like a secondary passivity, which is probably the habits.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3458.672,
    "end": 3460.013,
    "text": "It's like a second nature to us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3460.393,
    "end": 3465.258,
    "text": "And it becomes passive because, you know, when you're very habituated to something, you don't think about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3465.278,
    "end": 3467.46,
    "text": "You don't have to do any kind of reflective process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3467.48,
    "end": 3468.762,
    "text": "It just kind of happens.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3469.823,
    "end": 3474.327,
    "text": "And that tells a lot about how we engage with the world at a phenomenological level, for sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3475.623,
    "end": 3486.834,
    "text": " And it kind of suggests like the sedimentation of what is potentially an active intention in a moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3487.815,
    "end": 3499.706,
    "text": "Like if we were practicing archery, what might be active in a moment or what somebody might cue us to think about can become sedimented.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3499.726,
    "end": 3501.748,
    "text": "And that's kind of the process of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3503.905,
    "end": 3519.164,
    "text": " our actions becoming habitual or our behavior in the moment over time, it's like you're flowing this color of sand over the river, eventually it sediments that color without needing further flow of that color.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3520.025,
    "end": 3520.946,
    "text": "Exactly, exactly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3520.966,
    "end": 3525.492,
    "text": "And that's a very instinctual, perhaps, and very",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3526.13,
    "end": 3554.483,
    "text": " implicit way of understanding learning right because that's what happens when we're learning about something at the beginning especially skills think about bodily skills if you want to learn to play the piano the beginning is very difficult you have to very explicitly move your fingers and it's awkward and it sounds horrible but over time this these movements become habituated and we may talk about bodily memory or something like that but it's the same idea you know it becomes second nature to you it's com it becomes almost passive",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3556.538,
    "end": 3583.204,
    "text": " Yeah, and thinking about learning a language or math or something, it's almost like an applied area of this research agenda would be to discover, potentially to validate some differences in learning exercises, and then maybe to suggest new kinds of learning exercises",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3584.703,
    "end": 3598.588,
    "text": " based upon what could be attended to in a moment that if it were sedimented could then be later used as an implicit jumping off point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3598.688,
    "end": 3601.493,
    "text": "Like an example coming to mind is let's just say like an integral.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3602.034,
    "end": 3605.901,
    "text": "Let's just say that the rule for the integral is like there's always a number above and below.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3606.623,
    "end": 3619.044,
    "text": " But before even going into what those are, you just sediment the understanding that there's always a number above and below it and kind of swallow that and sediment it and accept it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3619.985,
    "end": 3629.661,
    "text": "And then show what those numbers mean, having accepted that they must be there",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3630.62,
    "end": 3657.218,
    "text": " rather than try to show a new type of symbol and suggest that the symbol is a certain way because the math has to be a certain way and try to co-sediment a visual understanding with a sort of analytical understanding, but maybe some parts could be sedimented in a different order.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3659.155,
    "end": 3661.623,
    "text": " Yeah, I wonder about that last bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3661.984,
    "end": 3671.275,
    "text": "I mean, I don't know nearly enough about learning more general, but I think it sounds very roughly correct to me, because if you think about maths, for instance,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3671.525,
    "end": 3681.296,
    "text": " You know, when you have to solve an equation and you already are skilled at maths, you still have to think about, you know, arithmetical calculus processes, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3681.776,
    "end": 3689.785,
    "text": "There is an active explicit level, but this is always grounded in an understanding which is already kind of second nature to you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3689.805,
    "end": 3697.414,
    "text": "You already know, as you said, in an integral, there's the number up top, the one at the bottom is a given and you kind of already know what's the function of it",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3697.394,
    "end": 3701.541,
    "text": " Well, it doesn't give you immediately the solution to the equation necessarily.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3701.761,
    "end": 3712.72,
    "text": "There is an active process, but it's always built on top of a background of habitual processes, which is precisely what a periodic intentionality is trying to capture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3712.936,
    "end": 3732.582,
    "text": " And I mean, I haven't thought too much about the relationship between maths and this, but what I like about as an embodied person, as a person who likes embodied cognitive science, what I like about operative internalities is that it's clearly deeply embodied and there might be a way of connecting",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3732.95,
    "end": 3738.33,
    "text": " you know, these very abstract theoretical processes like doing math to bodily processes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3738.35,
    "end": 3743.871,
    "text": "And in active inference, that would be literally the active fit of active inference, isn't it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3746.416,
    "end": 3776.288,
    "text": " yeah potentially there's a that makes me think of a memory palace and leveraging spatial analogies and protentions i could walk out of this room into another room and i'm going to put a fact there or put a memory there or associating a smell or a sentiment with another area of information and then sedimenting that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3776.977,
    "end": 3781.873,
    "text": " not so that it is directly recallable but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3782.984,
    "end": 3792.295,
    "text": " I guess just when I, again, to the trace and the protension funnel, I think about Mike Levin and the time cone or the time diamond.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3792.375,
    "end": 3797.482,
    "text": "And we kind of, in that visualization, it's almost like the cone goes off in both directions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3797.502,
    "end": 3802.408,
    "text": "So we have the perimeter in the moment, which is like the extents in the now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3803.209,
    "end": 3811.759,
    "text": "And then the past is seen as, I think one way is probably like uncertainties over the past,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3811.739,
    "end": 3834.709,
    "text": " whereas in the uh whose role on time consciousness side it was like there's just a single trace so we could think of it though as uncertainties or more and more scope of causal precedence leading in like you know our grandparents and our great great grandparents and all this coming in through the um needle of the moment um and then like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3835.735,
    "end": 3847.893,
    "text": " decision-making is jumping off into the protention, only to be answered in the sensory consequences at the next update.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3849.916,
    "end": 3850.577,
    "text": "Exactly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3850.597,
    "end": 3863.616,
    "text": "That's what I think, that it's a very nice connection between the active inference conception of cognition and decision-making, and this more phenomenological description, because what you get is precisely this kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3863.849,
    "end": 3875.525,
    "text": " isomorphic mirroring almost between the structure of the updating of a generative model in active inference and the kind of dynamics, the temporal dynamics you have in phenomenology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3875.986,
    "end": 3887.722,
    "text": "And what's kind of nice is that as you make more and more complex your generative models, you can introduce things like, you know, affective inference, like Kasper Hesp's work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3888.323,
    "end": 3893.35,
    "text": "And I think that would be an interesting way of trying to capture some of the affective domain,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3893.836,
    "end": 3897.601,
    "text": " the affective dynamics that occur at the phenomenological level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3897.881,
    "end": 3903.808,
    "text": "And that's precisely what I mean, that you have to kind of make this constant circulation between different domains.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3903.948,
    "end": 3919.607,
    "text": "Like, on the one hand, the phenomenology might be able to inform us how to kind of organize and kind of think about our generative models, and these generative models may actually help us understand neural dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3920.414,
    "end": 3924.62,
    "text": " And that's kind of the whole point of what now we call computational neurophenomenology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3925.14,
    "end": 3931.228,
    "text": "But as a philosopher and self-described phenomenologist, I would say, you know, we have to start by the phenomenology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3931.248,
    "end": 3933.772,
    "text": "It doesn't necessarily mean that phenomenology trumps everything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3933.792,
    "end": 3938.058,
    "text": "It simply means that it's our starting point because that's literally what we have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3938.078,
    "end": 3941.722,
    "text": "That's all we have as experiential beings, lived experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3942.503,
    "end": 3945.207,
    "text": "But we have to be very careful with how we analyze it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3945.794,
    "end": 3955.939,
    "text": " And again, it's kind of fascinating for me, these similarities between the mathematical structure of active inference and these more formal dynamics in terminology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3957.05,
    "end": 3967.604,
    "text": " It also makes me think about first learning about xenobiology and theoretical biology that, well, biology is living real things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3968.345,
    "end": 3976.476,
    "text": "So if we open the door to life forms that we haven't observed or hypothetical life forms, what isn't on the table?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3976.917,
    "end": 3983.346,
    "text": "That's going to be too broad because we have enough to investigate with the forms that are here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3984.207,
    "end": 3986.55,
    "text": "So then we have the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3987.138,
    "end": 4003.02,
    "text": " starting with what we have and building out approach whereas some of this kind of like i don't know if it would be like xeno phenomenology like thinking about radically different minds and systems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4003.507,
    "end": 4016.466,
    "text": " which in some ways is an unconstrained quest because it's going to be hard to get unique explanations and predictions about like the experience of an extraterrestrial that we haven't seen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4016.526,
    "end": 4021.954,
    "text": "Yet in that social quest,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4022.508,
    "end": 4025.992,
    "text": " there are useful factors identified.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4026.052,
    "end": 4045.234,
    "text": "And in some ways it ends up being the people's different views on the plausibility or the relevance of a given speculation that reground even what initially could seem to be like a totally ungrounded question, like what is it like to be a bat?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4045.915,
    "end": 4047.537,
    "text": "Or what is it like to be a cloud or something?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4049.086,
    "end": 4070.354,
    "text": " You know, I find it kind of interesting because that's part of what I did during my PhD, especially thinking how these phenomenological approaches and inactive approaches plus the FEP might actually allow us to understand better biological cognition broadly understood.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4070.394,
    "end": 4077.203,
    "text": "So I don't know much about kind of life as it could be, but life as we know it, it's clearly, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4077.554,
    "end": 4100.119,
    "text": " bacteria or plants or animals moving around and trying to survive right that's the basis of it all but what we what i would say is that for us to understand that we have to kind of assume that there is a degree of i mean very very broadly understood subjectivity in there i don't want to say that the bacterium is conscious or aware or something like that i don't think so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4100.099,
    "end": 4103.363,
    "text": " but there is a sensitivity to the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4103.503,
    "end": 4115.277,
    "text": "You know, when the bacterium is swimming near chemotaxis, swimming towards the glucose, there is a sense in which the bacterium is sensitive to the environment, is affected by it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4116.078,
    "end": 4118.861,
    "text": "That's a very natural way of putting it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4119.402,
    "end": 4121.905,
    "text": "And what is fascinating again is this kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4122.442,
    "end": 4134.619,
    "text": " similarity between these very complex phenomenological analysis of human experiences and what we find, what we can see kind of from a third or second person perspective on other living beings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4134.639,
    "end": 4136.541,
    "text": "There's very close similarities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4137.242,
    "end": 4150.761,
    "text": "And if we take very, very seriously the Husserlian claim that the whole point of phenomenology is to disclose these invariant structures of consciousness, of subjectivity, or whatever you want to call it, then there's a case to be made that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4151.332,
    "end": 4169.273,
    "text": " uh these inverted structures may actually speak of the at least the conceptual basis of what we may call biological cognition and i mean that's a massive project but i think there's something about that and i think again that active inference is it's an interesting kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4169.793,
    "end": 4199.023,
    "text": " bridge between all these different perspectives because if you say that active inference is capable of say modeling you know biological dynamics on the one hand and also experiential dynamics as you know computational phenomenology claims then it's it's this kind of interesting formal bridge between say biology phenomenology and neurobiology etc it's kind of uh it's a bridge it's a very helpful bridge i would say",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4200.083,
    "end": 4214.525,
    "text": " Yeah, the second person perspective, it makes me think about the biography of Barbara McClintock, who's a biologist, studied transposons and mobile genetic elements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4215.086,
    "end": 4220.775,
    "text": "And the biography written by Evelyn Fox Keller is called A Feeling for the Organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4220.755,
    "end": 4236.908,
    "text": " kind of alluding to the career-long quest to have a feeling for corn genetics in this case and other genetic systems and so whereas the what is it like to be a bat",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4236.888,
    "end": 4260.432,
    "text": " is kind of like a third person first person dialectic i'm over here third party to the bat and i want to get into that driver's seat and be first person in the bat and then what would it be like and so that's kind of like the first third first third i'm my first and i want to be its first so i'm its third but then the second person",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4261.762,
    "end": 4281.42,
    "text": " which I see in the second person neuroscience area is like, what is the feeling for and the relational component that is actually a kind of alternative to swapping first person perspectives?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4282.281,
    "end": 4290.148,
    "text": "Because if it was just swapping first person perspectives, you don't, you just go from, I am,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4291.327,
    "end": 4292.948,
    "text": " Person, I am a bat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4294.27,
    "end": 4299.134,
    "text": "Versus you are a bat is engaging in the second person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4300.095,
    "end": 4313.346,
    "text": "And that brings in the social component of the phenomenological project and distinguishes it in a way from a kind of solipsistic first person I agenda.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4314.447,
    "end": 4315.829,
    "text": "Yes, yes, for sure, for sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4315.849,
    "end": 4320.793,
    "text": "And I think that kind of project is quite radical in the sense that it has...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4321.027,
    "end": 4326.973,
    "text": " very interesting consequences in relation to how we think about science, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4327.474,
    "end": 4336.584,
    "text": "Because in a very kind of traditional, I would say even dogmatic way, we think about science as this strike for objectivity, like the third person perspective as such.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4337.164,
    "end": 4341.389,
    "text": "And maybe that makes sense in certain natural sciences, maybe physics, perhaps?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4341.949,
    "end": 4342.45,
    "text": "I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4342.47,
    "end": 4347.135,
    "text": "But in something like biology, you're dealing with another living being, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4347.115,
    "end": 4361.257,
    "text": " And it's not, in certain cases, might be a third-person perspective if you put it, but you know when the biologist is looking at the bat or the bacterium or the amoeba or whatever, there's a quote-unquote social process going on, you know?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4361.798,
    "end": 4365.343,
    "text": "I, the scientist, I'm recognizing you",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4365.323,
    "end": 4370.408,
    "text": " the biological system as a biological system, and actually noticing something in there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4370.968,
    "end": 4376.053,
    "text": "I may not know what it's like to be a bat, but I know what it's like to be a living being.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4376.213,
    "end": 4377.755,
    "text": "We have a common ground.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4378.455,
    "end": 4382.539,
    "text": "And that, at least from the human perspective, is an experiential common ground.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4382.979,
    "end": 4386.623,
    "text": "And that's what phenomenology brings into the table, a way of trying to analyze this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4386.663,
    "end": 4394.25,
    "text": "But again, it's a very radical change, I would say, because at least biology becomes kind of this quote-unquote social science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4394.45,
    "end": 4418.888,
    "text": " not in the sense of sociology or anthropology but it's a matter of i'm actually engaging with this this biological system and if we build from there at least at the level of analysis for organisms maybe not genetics and you know or population at least at the level of organismic existence i think there might be some ways of reconceptualizing our understanding of life",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4420.437,
    "end": 4420.717,
    "text": " Wow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4421.419,
    "end": 4440.589,
    "text": "Like on the over-emphasizing first person, we have the Cartesian thought experiment, hyperbolically, over-emphasizing the third person, denying interiority, we have behaviorism, only standing outside of the room and never asking internally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4441.511,
    "end": 4445.938,
    "text": "And there's another bridging path that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4446.56,
    "end": 4469.428,
    "text": " is very provocative that biology would be a social sciences because yeah that will be interpreted in a disciplinary setting but social being like composite or collective and co-inactive which is exactly where it feels like biology should be yeah exactly yeah i say social science in the broadest of senses not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4469.695,
    "end": 4480.612,
    "text": " I wouldn't say that, again, there's a very strong connection between sociology or anthropology and biology, but social in the sense that, again, there is a social connection between the scientist and its object.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4481.092,
    "end": 4485.339,
    "text": "We're talking about two, quote unquote, subjects relating to one another.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4485.379,
    "end": 4488.143,
    "text": "They're co-enacting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4488.123,
    "end": 4489.605,
    "text": " a world, in a sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4489.905,
    "end": 4492.648,
    "text": "And that's a very inactive conception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4492.668,
    "end": 4500.076,
    "text": "Like, if you look at the works of Francisco Varela or Evan Thomson, Ezequiel de Paolo, their ideas are very consistent with this approach.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4500.737,
    "end": 4515.172,
    "text": "And I think that phenomenology may also bring interesting tools to understand this because, you know, there's a whole literature in phenomenology about sociality, intersubjectivity, and it's usually emphasizing how we understand one another as human beings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4515.293,
    "end": 4516.594,
    "text": "It's not solipsism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4516.574,
    "end": 4524.461,
    "text": " But the question is, what happens if we try to apply this analysis to our understanding of other living beings, not only human beings?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4524.481,
    "end": 4529.217,
    "text": "And that opens up a whole new domain for research, I think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4530.108,
    "end": 4555.71,
    "text": " yeah and perhaps even speaks to the unhealed gap with like ecology is everything that happens on earth except for human activities that's why it's human ecology or biology is all living systems except for the social because those are the human and so it's kind of this tension with kind of like are humans natural and are we part of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4557.007,
    "end": 4562.536,
    "text": " the fields and methods that should be approaching any other kind of mammal?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4563.778,
    "end": 4573.514,
    "text": "And or do we rely on more transcendental methods that wouldn't be empirically useful in studying like an insect at first pass?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4575.897,
    "end": 4583.149,
    "text": "Sure, I guess the question would be if we take this kind of transcendental path, if you want to call it that way, how can we",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4584.226,
    "end": 4603.618,
    "text": " let's say operationalize this into a more empirical project because as a philosopher i'm happy to say we should do transcendental phenomenology and make science about transcendental biology but i'm also quite aware because i work in interdisciplinary context that that's not enough that gives you a very interesting and i would say very strong theoretical basis",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4604.105,
    "end": 4606.171,
    "text": " But that's not empirical science, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4606.672,
    "end": 4613.212,
    "text": "How can you step from these theoretical claims to making testable predictions and hypotheses?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4613.693,
    "end": 4614.756,
    "text": "That's the question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4615.04,
    "end": 4616.663,
    "text": " And that's a fascinating question, I think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4616.703,
    "end": 4618.125,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4618.165,
    "end": 4629.825,
    "text": "Well, maybe you've outlined an alternative meeting point, which is rather than finding a common molecular basis between humans and fruit flies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4629.985,
    "end": 4632.149,
    "text": "I mean, we know that we have proteins, carbohydrates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4632.189,
    "end": 4636.356,
    "text": "We know what reductionism is going to find when we're turned into dust.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4637.804,
    "end": 4662.563,
    "text": " but you're in a way outlining a path of saying, well, certainly something affects a fruit fly and it does have a protension, might be a shorter or different shaped protension, but by rather than trying to materialize the human experience only and find a common grounding on the materialized,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4663.488,
    "end": 4680.468,
    "text": " by having a common grounding in the time consciousness, then even the bacterium can be juxtaposed with the human and not on a material comparison.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4681.129,
    "end": 4687.757,
    "text": "Not just because we have shared material or DNA, but because we have a shared living autopoetic embedding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4688.497,
    "end": 4689.418,
    "text": " Yeah, exactly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4689.458,
    "end": 4695.708,
    "text": "There's this continuity between what it's like, quote unquote, to be a bacterian and what it's like to be a human.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4696.069,
    "end": 4697.451,
    "text": "It's certainly not identical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4697.551,
    "end": 4704.782,
    "text": "We cannot produce our kind of experience to whatever kind of interiority it's there in a bacterian.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4706.184,
    "end": 4708.007,
    "text": "We cannot do the other way around either.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4708.763,
    "end": 4732.847,
    "text": " we can we we recognize experientially these dynamics right and i think there's some actual empirical evidence for this kind of processes we i've read about you know quote unquote cellular memory how bacteria when they're swimming in you know a milieu an environment there seems to be a very very minimal uh degree of memory or historicity and that explains a lot of behavior",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4733.57,
    "end": 4737.314,
    "text": " We may have even a mechanistic approach to this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4737.334,
    "end": 4743.201,
    "text": "We can explain this, quote-unquote, minimal memory from a mechanistic perspective, and I'm happy to do that because that's a very good bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4743.681,
    "end": 4756.596,
    "text": "But what is interesting is that we recognize that because we experience that in a perhaps more complex way, but it's the roots of what we call temporality and affection, affectivity, it's at the roots of life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4757.096,
    "end": 4760.64,
    "text": "And again, that's autopoiesis, that's varela maturana,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4760.62,
    "end": 4768.73,
    "text": " And I truly believe that if you buy into the phenomenological conception, you will naturally tend to this more inactive conception of it all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4771.093,
    "end": 4772.354,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4772.374,
    "end": 4775.858,
    "text": "Well, do you have any last kind of comments or thoughts?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4777.921,
    "end": 4779.182,
    "text": "No, no, no, not really.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4779.242,
    "end": 4782.306,
    "text": "This has been a very good discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4782.366,
    "end": 4783.067,
    "text": "I like this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4784.026,
    "end": 4784.467,
    "text": " Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4784.707,
    "end": 4797.347,
    "text": "Yes, well, we also learned a lot from your work in our recent Shared Protentions paper, and it's just exciting to see all these threads and complementing pieces of the puzzle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4798.369,
    "end": 4806.642,
    "text": "Yeah, there's an ongoing kind of new research field that is trying to link all these different concepts, and I think that's very important because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4807.212,
    "end": 4836.679,
    "text": " i'm kind of amazed at the fact that it might i think it has the power to change some of our ways in which we understand and do science uh hopefully we'll see to find out we'll find out i mean that's what else can we do wouldn't expect any other answer wouldn't prefer any other answer um thank you very much so good luck with your research and see you next time thank you thank you dad bye",
    "speaker": "SPEAKER_02"
  }
]