[
  {
    "start": 5.834,
    "end": 6.554,
    "text": " Hello, everyone.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6.634,
    "end": 9.975,
    "text": "Welcome to ACT-INF Lab live stream number 25.2.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 10.295,
    "end": 21.918,
    "text": "Today is July 13th, 2021, and we're going to be talking about this paper, The Computational Boundary of a Self, Developmental Bioelectricity Drives Multicellularity and Scale-Free Cognition.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 23.678,
    "end": 24.979,
    "text": "We are here with the author, Mike Levin.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 26.46,
    "end": 32.022,
    "text": " We are a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 32.502,
    "end": 34.402,
    "text": "You can find us at the links here on this page.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 34.863,
    "end": 40.324,
    "text": "This is a recorded and an archived live stream, so please provide us with feedback so that we can improve our work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 41.084,
    "end": 46.786,
    "text": "All backgrounds and perspectives are welcome here, and we will be following good video etiquette for live streams.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 47.306,
    "end": 55.749,
    "text": "Here at the short link, you'll find all the live streams that we've done so far, and we're going to have a new series of live streams coming up in the next semester.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 57.188,
    "end": 65.554,
    "text": " So we're going to be jumping off here with the author discussing this paper, and we will just do a brief round of introductions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 65.914,
    "end": 71.638,
    "text": "I am Blue Knight, and I am an independent research consultant based out of New Mexico.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 71.658,
    "end": 75.901,
    "text": "Yeah, my name is Sarah Davis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 75.981,
    "end": 84.427,
    "text": "I'm a master's philosophy student at this point, past engineer and science artist, just generally interested in how the world works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 85.428,
    "end": 85.648,
    "text": "Michael?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 86.721,
    "end": 87.942,
    "text": " Yeah, I'm Mike Levin.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 88.162,
    "end": 91.483,
    "text": "I'm a professor in the biology department at Tufts University.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 91.923,
    "end": 98.266,
    "text": "I run the Allen Discovery Center at Tufts, and I'm also an associate faculty at the Institute at Harvard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 100.247,
    "end": 100.547,
    "text": "Cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 100.927,
    "end": 108.791,
    "text": "So, Sarah, what is something that you're excited to talk about today or something that you liked or remembered about the paper?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 109.251,
    "end": 110.972,
    "text": "Maybe want to give a heads up?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 114.089,
    "end": 127.399,
    "text": " The most interesting kind of through line for me in all of Michael's work that I've looked at is this connection or this maybe tension, I don't know, the way the morphology plays with electricity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 127.639,
    "end": 134.044,
    "text": "Just, yeah, which one's in the driver's seat or some kind of like understanding of how those two work together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 136.693,
    "end": 137.033,
    "text": " Awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 137.293,
    "end": 142.636,
    "text": "Is there any like burning questions that you have that you want to start off with or otherwise I can just start?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 144.277,
    "end": 148.099,
    "text": "No, I feel like that is going to kind of happen down the road, that particular focus.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 148.139,
    "end": 149.22,
    "text": "So please.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 149.24,
    "end": 149.48,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 150.341,
    "end": 150.621,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 150.781,
    "end": 153.662,
    "text": "So here we are on the paper we're going to be discussing today.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 154.103,
    "end": 158.085,
    "text": "How do multiple nested scales of individuality work?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 160.461,
    "end": 169.004,
    "text": " Yeah, so I want to preface this by saying that, and maybe this is obvious, but I just want to say that all of this is very much a work in progress.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 169.364,
    "end": 180.407,
    "text": "So I'm going to tell you what I think about these things, but I certainly am not claiming that this is all worked out, or that I'm not going to change my mind at some point, or that this is not going to develop in some fashion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 180.427,
    "end": 182.027,
    "text": "This is under constant work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 184.406,
    "end": 191.127,
    "text": " So I think the fundamentals of all this are simply that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 192.565,
    "end": 204.453,
    "text": " there are multiple interpenetrating systems at different scales that are all present simultaneously, all of which can be profitably looked at as individuals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 204.773,
    "end": 212.959,
    "text": "And so this diagram here sort of, it looks like all it's saying is the mere sort of fact of physical structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 213.079,
    "end": 215.861,
    "text": "If you look, you see organisms and within that you've got organs and cells.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 216.241,
    "end": 219.825,
    "text": " So that's sort of not the whole point of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 219.845,
    "end": 227.772,
    "text": "The point isn't merely that they're arranged this way, but that you've got subunits, and those subunits have themselves subunits, all of which are selves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 227.973,
    "end": 231.996,
    "text": "And what I mean by them being selves, and this is the central claim of the paper, is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 232.817,
    "end": 242.181,
    "text": " They are to some extent, so not binary, but on a continuum of agency, they are to some extent goal directed agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 242.221,
    "end": 243.901,
    "text": "So they're trying to achieve certain things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 244.242,
    "end": 250.144,
    "text": "And so, when I say that they're nested, all of this simply means that you can have systems where the different parts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 250.644,
    "end": 255.629,
    "text": " Are all actively trying to achieve various things in their own spaces and we should talk about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 255.669,
    "end": 261.694,
    "text": "That's an important part that developed since this paper was written is this idea of different action spaces that these things are working in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 262.975,
    "end": 271.742,
    "text": "But, but they're nested in the sense that I think just because a higher level system acquires a goal, or is pursuing a goal that doesn't mean the lower systems aren't doing it and.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 273.164,
    "end": 278.291,
    "text": " All of these things are, in fact, simultaneously doing their best to pursue various kinds of goals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 278.552,
    "end": 282.117,
    "text": "So that's what I meant by multiple nested individuals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 283.559,
    "end": 283.819,
    "text": "Awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 285.623,
    "end": 290.824,
    "text": " So is there a total 100% of individuality that gets partitioned?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 291.324,
    "end": 297.946,
    "text": "And something that I've been really interested in is how is information passed forward and backward across levels?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 298.446,
    "end": 306.227,
    "text": "Like is there some kind of core screening or like salience like dominates the information to pass forward?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 306.527,
    "end": 309.448,
    "text": "So how does that kind of information flow work?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 310.441,
    "end": 335.685,
    "text": " yeah so so the scaling and the relationship between layers is of course one of the most interesting things here so one of the things we are currently trying to do both experimentally and with modeling is to really show some very tight examples because this paper is largely qualitative but we're now trying to show some very specific examples where you where we can we can actually track the scaling so so you have lower level subunits so let's say you have cells",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 336.065,
    "end": 338.626,
    "text": " that have only local metabolic goals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 338.686,
    "end": 345.727,
    "text": "So all they know how to do is pursue some energy level in a kind of homeostasis to stay alive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 346.168,
    "end": 364.112,
    "text": "And so the question is, how do you connect those in a way that is then going to give rise to a larger agent that has much larger scale goals that can be working towards a state of affairs and to be actually stressed by the failure to reach a state of affairs that is way bigger than any individual cell.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 364.532,
    "end": 374.655,
    "text": " And so I'm not sure that there's any kind of conservation here in the sense that there's only a total amount that you sort of have to partition it among the levels and that's all that there is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 375.055,
    "end": 377.716,
    "text": "I'm not sure that's, yeah, I would make that claim.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 377.756,
    "end": 384.659,
    "text": "I think that the total amount of individuality can change over time and it can rise and fall.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 384.739,
    "end": 389.52,
    "text": "And in fact, the boundaries between the different agents can grow and shrink.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 389.56,
    "end": 392.021,
    "text": "That was a significant part of the paper talk about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 393.007,
    "end": 419.555,
    "text": " um and what there's a couple of there's a couple of interesting things that get passed upwards so to speak um definitely kind of force graining in the sense that if you are a system whose parts are themselves competent in getting various things done despite changing conditions and and so on they're not just the hardwired mechanisms but actually competent to pursue specific outcomes despite perturbations what it means is that the larger system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 420.075,
    "end": 438.202,
    "text": " is now working in a much easier space in the sense that if it doesn't have to micromanage all the microstates that the individual pieces are doing, but it can rely on those components to get their job done, then what you're really working in is a much lower dimensional, simpler space",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 439.196,
    "end": 457.297,
    "text": " Problem solving gets easier and just as a simple biological example, we now know that, for example, in the tadpole, if you activate a signal that triggers, it happens to be bioelectric signal that triggers eye formation in another part of the embryo, let's say on the tail.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 458.123,
    "end": 484.268,
    "text": " then all kinds of interesting things will happen it will it will build an eye it will recruit cells that you never directly manipulated so it's a local self-organization process that i will form even though it's sitting in the middle of muscle instead of in the brain where where it belongs all of these things are going to happen anyway if you're if you're the larger and and by the way those tackles can then see out of that eye even though it's on the tail instead of in the head so if you are a system that um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 485.171,
    "end": 510.587,
    "text": " uh needs to solve some problems in terms of uh i've got some eyes and i need to do this behavior that i'm doing and so on if you don't have to micromanage all of those components and saying each cell of that eye where exactly it's going to go what exactly it's going to attach to and so on if if there is an effector that you have access to an affordance maybe that says um build an eye and you as a larger system don't need to know how that's going to happen you can just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 511.606,
    "end": 513.827,
    "text": " that is going to happen under a wide range of conditions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 514.167,
    "end": 517.329,
    "text": "You have a much simpler space to work in and the problem solving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 517.349,
    "end": 526.393,
    "text": "That's one of the things we're doing now is trying to map out some of the different spaces in which all these different agents are actually solving problems and trying to define what that means.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 527.993,
    "end": 534.976,
    "text": "So one of the things that gets passed up is this course grading because of the lower level competency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 535.237,
    "end": 540.819,
    "text": "So that's I think a key thing and maybe we'll get to talking about what that does for evolution because I think it's massively important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 543.368,
    "end": 547.151,
    "text": " Nice, so I don't have a unfortunately, they've moved to change the interface.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 547.171,
    "end": 552.896,
    "text": "So I don't know where the hand is anymore in this, but 1 question that keeps coming up for me and all the different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 554.057,
    "end": 560.143,
    "text": "Realms of discussion about this is like, well, in particular with the bio electricity part, you use the word.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 560.985,
    "end": 566.608,
    "text": " Um, subroutines when you were talking about, you know, we, we think we're starting to understand the, the, the.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 567.328,
    "end": 573.311,
    "text": "Whatever combinatorics of of how this works and and and also related to these nested levels and things like this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 574.671,
    "end": 580.054,
    "text": "I, I just keep wondering if it's your sense from all of this work that you've done that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 580.654,
    "end": 584.176,
    "text": "In nature in in in the communication between these levels.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 584.972,
    "end": 595.34,
    "text": " that there's any amount of abstraction or semantic layer that's needed for that to happen between levels.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 596.101,
    "end": 601.845,
    "text": "And also with the electricity, subroutine implies that there's some kind of semantics that something has to rest on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 602.065,
    "end": 603.987,
    "text": "And that just keeps coming back to me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 604.027,
    "end": 605.168,
    "text": "Do you have any sense about that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 605.788,
    "end": 607.43,
    "text": "Yeah, so a couple of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 607.65,
    "end": 609.291,
    "text": "So one thing about bioelectricity is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 611.344,
    "end": 627.296,
    "text": " bioelectricity, I think, is interesting not because it's in some sense magical or there's something uniquely better about bioelectricity than biomechanical or biochemical modes of interaction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 627.636,
    "end": 630.198,
    "text": "What I think is really interesting about bioelectricity is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 630.798,
    "end": 632.739,
    "text": " that is what is being used.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 632.799,
    "end": 635.341,
    "text": "And perhaps these other modes are too, we don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 635.921,
    "end": 648.629,
    "text": "But bioelectricity for sure is being used as the computational medium by which the lower levels bind together into the higher level cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 649.27,
    "end": 652.712,
    "text": "So the higher systems cognition, whatever level it may have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 653.132,
    "end": 657.175,
    "text": "So what the bioelectricity allows us to do is to directly peek into",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 657.755,
    "end": 658.836,
    "text": " that computation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 658.856,
    "end": 661.94,
    "text": "And so I think that's why it's interesting, which is no surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 661.96,
    "end": 664.923,
    "text": "I mean, that's exactly when people do neural decoding, that's exactly what they hope, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 664.963,
    "end": 670.468,
    "text": "Is that by tracking the bioelectricity, they learn something about the information content of the global system, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 670.488,
    "end": 672.951,
    "text": "What is the animal or the human thinking about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 673.738,
    "end": 674.859,
    "text": " So it's exactly the same here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 674.879,
    "end": 676.701,
    "text": "So that's what's unique about bioelectricity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 676.721,
    "end": 688.935,
    "text": "And I think that what evolution discovered very early on is that, and then it capitalized on that by pivoting it into neural kinds of systems, and we do it in our computational devices and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 689.66,
    "end": 702.983,
    "text": " is that what evolution found really, really early, around the time of bacterial biofilms actually, is that electricity is a great way to process information, to integrate information across distance, and to do computations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 703.043,
    "end": 704.703,
    "text": "That shouldn't be a surprise to anybody.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 705.303,
    "end": 713.765,
    "text": "So I don't know if I would claim that it has any kind of a formal syntax at these levels or anything like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 714.522,
    "end": 730.01,
    "text": " But what it definitely does do is a kind of, when I say subroutine, what I'm mostly leaning on is this idea of modularity, but not just modularity in form, because that's been discussed a lot in evolutionary developmental biology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 730.939,
    "end": 749.863,
    "text": " actually modularity of function so so the key that the thing the thing about a good subroutine is that you're going to when you activate the subroutine you can move along and assume that everything that's necessary to get that job done given whatever local conditions or current events or whatever else is happening",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 750.223,
    "end": 770.366,
    "text": " that subroutine is going to encapsulate everything that's needed to get it done meaning it's it's it's not just it's it's it's the difference so for people who code it's the difference between sort of macro substitution where all you're doing is just you know it's a shorthand for a bunch of hardwired steps which plopping that in i don't think that's the the magic here at all i think what it is is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 772.957,
    "end": 776.96,
    "text": " it's a degree of competency in that subroutine to get something accomplished.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 777.081,
    "end": 782.105,
    "text": "And that has really important implications for evolvability and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 782.726,
    "end": 785.969,
    "text": "And what the bioelectricity allows you to do is to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 787.918,
    "end": 798.706,
    "text": " Basically, to have to have a language in which the system can call up such circuits with specific behaviors at different points or at different times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 798.746,
    "end": 801.668,
    "text": "That makes it really, really powerful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 802.069,
    "end": 810.335,
    "text": "But the question of whether it has any kind of formal syntax or anything like that, I don't have good evidence for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 811.415,
    "end": 813.557,
    "text": "I don't even mean like a formal syntax.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 813.757,
    "end": 814.378,
    "text": "It's almost like a",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 815.935,
    "end": 820.976,
    "text": " And this also, you know, holds true between these layers of these nested layers of organism or whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 822.496,
    "end": 833.039,
    "text": "Is if there's if you have a sense that there's any abstraction, there's any abstraction layer needed and I guess you kind of answered it maybe by saying, you know, that electricity is this medium on which.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 835.119,
    "end": 839.38,
    "text": "Things communicate or but yeah, anyway, it's I don't think it's an easy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 839.44,
    "end": 839.76,
    "text": "It's like.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 840.28,
    "end": 843.681,
    "text": "You know, easy to answer question, but that's the theme that keeps coming back to me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 843.761,
    "end": 843.861,
    "text": "So.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 844.876,
    "end": 855.29,
    "text": " I think there's a lot of abstraction in the sense of, and I don't know if this captures what you're asking, but there's a lot of abstraction in the sense of generalization in terms of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 859.994,
    "end": 863.218,
    "text": " Another way to say it is coarse-grained.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 863.498,
    "end": 865.0,
    "text": "Voltage itself, let's just start with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 865.06,
    "end": 873.369,
    "text": "Voltage itself is an abstraction for cells because, and in fact, people will often ask if I say there's a bioelectrical signal, they say, well, is it the potassium level?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 873.49,
    "end": 875.372,
    "text": "Is it the sodium level?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 875.392,
    "end": 877.414,
    "text": "Is it the particular ion channel gene?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 877.835,
    "end": 879.516,
    "text": "Is it the voltage or is it the current?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 879.577,
    "end": 879.817,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 880.217,
    "end": 886.463,
    "text": " Yeah, and in particular, so the cool thing about bioelectrics is that that question has been answered, and we know the answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 886.623,
    "end": 888.205,
    "text": "It's neither of those things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 888.485,
    "end": 897.934,
    "text": "So it's a pattern of voltage that is specific for the downstream effects, and it doesn't matter how, with very rare exceptions, it doesn't matter how you got to that voltage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 898.175,
    "end": 901.518,
    "text": "So you can use sodium channels, you can use potassium channels, chloride.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 902.137,
    "end": 914.686,
    "text": " What I used all those micro details don't matter at all, because what the collective is heating off of is the spatial temporal distribution of voltage and you can get exactly the same results with sodium or potassium or chloride as long as you're.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 915.066,
    "end": 926.734,
    "text": "You know you're you're driving the right voltage patterns so voltage itself is a really cool abstraction because it means that all the downs, the underlying mechanisms are free to diverge and evolution want to swap out of potassium channel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 927.537,
    "end": 934.799,
    "text": " for a sodium channel, you can do that as long as you've got the right functional properties so that your overall pattern stays.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 935.019,
    "end": 941.581,
    "text": "And we use that quite often in our regenerative medicine applications with a really convenient property.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 941.761,
    "end": 951.684,
    "text": "So yeah, so the bioelectric code itself is definitely an abstraction over what the micro states in terms of specific ions or the specific channel genes that got you there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 951.704,
    "end": 954.945,
    "text": "Nice.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 957.259,
    "end": 958.6,
    "text": " Stephen, did you want to say hello?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 959.34,
    "end": 960.181,
    "text": "Yes, hello.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 960.781,
    "end": 961.322,
    "text": "Hi there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 961.422,
    "end": 961.962,
    "text": "Hi, Michael.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 962.903,
    "end": 963.503,
    "text": "Thanks for joining us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 963.883,
    "end": 964.844,
    "text": "Yeah, I was curious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 964.884,
    "end": 972.669,
    "text": "We had a really interesting... Chris Field gave us a really good insight into the quantum contextuality idea of how things could...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 973.317,
    "end": 1000.787,
    "text": " build up from different sort of space states at very small levels and active inference often uses non-equilibrium steady state attractors as kind of a way to look at some sort of statistics between the scales you know there's some sort of flux or flow that's inferred and I find it really useful thinking about it with this cone idea that you you bring to the table because it it there's more",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1001.573,
    "end": 1013.224,
    "text": " It's more of an idea of a distinct swarming going into a structure and some sort of system that might emerge from that, which is sometimes lost when it's very much in the math.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1014.765,
    "end": 1028.838,
    "text": "And I'm curious whether when you think about the bioelectric effects, and the same sort of question came up with quantum contextuality maybe, is there more of a distinct scale at which",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1029.56,
    "end": 1037.441,
    "text": " there's a coherence, you know, like you've got the cell membrane, then you've got a coherence around which the bioelectrics can operate, so to speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1037.481,
    "end": 1052.684,
    "text": "And then you might have another distinct level at which the bioelectrics can operate, which is maybe more than the more gradated idea of steady state statistical sort of manifolds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1052.784,
    "end": 1056.845,
    "text": "So I was wondering what your thoughts are about how and where there's sort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1057.597,
    "end": 1064.403,
    "text": " scales at which bioelectrics become particularly coherent, or if that even happens?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1065.264,
    "end": 1072.551,
    "text": "Yeah, I mean, so again, prefacing this by saying that the bioelectrics is not an essential part of the story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1073.395,
    "end": 1086.038,
    "text": " except insofar as I think morphogenesis is a nice example of an unconventional agent within which to play with these kind of ideas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1086.278,
    "end": 1100.642,
    "text": "So what I would like to do, and this is a framework that I've been developing recently, is to get away from the standard sorts of living creatures that we're used to, so the products of that one trace of evolution in the biosphere on Earth,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1101.183,
    "end": 1110.319,
    "text": " and to go beyond that and to look at the space of possible agents, the space of possible bodies and the space of possible minds that those bodies will support and think more broadly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1110.339,
    "end": 1112.323,
    "text": "So in doing that,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1113.689,
    "end": 1124.354,
    "text": " I think that morphogenesis is a nice example of an unconventional agent that lets us see how the framework is to be practically applied.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1125.094,
    "end": 1128.455,
    "text": "So people say, okay, this is all well and good, but what use is it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1128.735,
    "end": 1134.598,
    "text": "And I say, okay, let's apply it to a specific thing that really no one thinks of as a cognitive agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1134.618,
    "end": 1139.72,
    "text": "And I'm going to show you how all this stuff maps and why it's useful at the bench and it helps do new experiments and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1140.12,
    "end": 1168.912,
    "text": " so if we if we accept that morphogenesis is kind of a test case for and there are many others it's certainly not unique but it's a test case for an unconventional place to find um agency and all of that and to test out how well this theory helps us out then what's cool about bioelectricity is that it actually allows us to tell a very specific mechanistic testable empirically useful story about how the information flow happens and how the levels scale but it's just one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1169.672,
    "end": 1179.296,
    "text": " you know, it's just, that just happens to be how the morphogenetic self does things, and there are plenty of other interesting, you know, cells that wouldn't have anything to do with bioelectricity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1179.536,
    "end": 1187.558,
    "text": "But I just want to make that clear, right, that bioelectricity is not, you know, some sort of essential element that's always going to be present whenever we apply these things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1187.618,
    "end": 1193.321,
    "text": "It just sort of, it's central to the example case that I've trotted out, which is morphogenesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1193.741,
    "end": 1194.421,
    "text": "Now, having said that,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1195.303,
    "end": 1203.168,
    "text": " Bioelectricity is definitely multi-scale because you have bioelectric dynamics in organelles in a very small scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1203.588,
    "end": 1208.311,
    "text": "You have the resting potential across the cell membrane, which is mainly what we study.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1208.812,
    "end": 1220.459,
    "text": "But those scale into tissues, and you have global electrical fields, which are driven by trans-epithelial potentials on the scale of tissues and organs, which other people like Min Zhao and many other people study.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1221.019,
    "end": 1227.282,
    "text": " And then past that, you have whole animal scale, like whole body scale fields as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1227.743,
    "end": 1231.244,
    "text": "So all of these different levels exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1231.705,
    "end": 1234.986,
    "text": "Some of them more and some less rely on bioelectricity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1235.026,
    "end": 1237.588,
    "text": "But yeah, it's relevant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1237.908,
    "end": 1242.03,
    "text": "In this particular unconventional agent, it's relevant to all the scales that we know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1244.071,
    "end": 1245.532,
    "text": "Okay, that's really helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1245.572,
    "end": 1245.872,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1246.092,
    "end": 1249.114,
    "text": "And would you say that the cone concept",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1249.884,
    "end": 1257.469,
    "text": " could it extrapolated to other types of multi-scale piston blanket type ideas?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1258.83,
    "end": 1263.352,
    "text": "And I was just wondering what your thoughts on that, or whether that just confuses things to try that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1264.213,
    "end": 1265.494,
    "text": "No, I don't think it confuses now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1266.594,
    "end": 1268.275,
    "text": "I'll say I'm for sure not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1268.415,
    "end": 1271.838,
    "text": "I mean, I like Karl's ideas very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1271.938,
    "end": 1276.14,
    "text": "I'm by no means an expert on the map, and I'm not going to pretend that I understand all that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1278.441,
    "end": 1282.807,
    "text": " I think that the thing about these kind of diagrams is they're not meant to be unique or exhaustive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1287.102,
    "end": 1303.312,
    "text": " The goal of this originally, this came about a couple years ago at a Templeton meeting where we were asked to brainstorm ways to define almost a sort of eigen space where you're able to compare directly really diverse intelligences, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1303.372,
    "end": 1309.676,
    "text": "So things where you can't just measure all their brains and then see how they shake out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1309.796,
    "end": 1311.898,
    "text": "It's really, really diverse intelligence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1312.95,
    "end": 1329.041,
    "text": " So what I tried to come up with is a scale and it's all focused around the spatial temporal scale of the goals that any given agent can work towards and the scale of states of affairs that can stress out that agent when they're not being met and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1330.111,
    "end": 1338.597,
    "text": " as a way to pick on something that I think is central to all agents, no matter what they're made of, no matter how they got here, evolved, designed, combinations, chimeras, whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1339.317,
    "end": 1342.739,
    "text": "Wherever they came from and whatever they are, what is essential to them?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1343.319,
    "end": 1347.782,
    "text": "And I picked this goal of directiveness, but this is compatible with all kinds of other systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1348.082,
    "end": 1353.966,
    "text": "So you could overlay on top of this almost anything else that you thought was critical about being an agent,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1354.666,
    "end": 1362.674,
    "text": " just start adding dimensions, you know, and absolutely, right now, you can just, this is compatible with all sorts of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1362.694,
    "end": 1367.779,
    "text": "This is not meant to rule out any other, anybody else's, you know, favorite framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1368.019,
    "end": 1371.823,
    "text": "This thing, it captures one slice of what's essential about being a self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1374.465,
    "end": 1375.566,
    "text": "Thanks, that's really useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1375.626,
    "end": 1376.747,
    "text": "Actually, can I just, one more thing,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1378.095,
    "end": 1379.516,
    "text": " I'm actually really interested in this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1379.636,
    "end": 1382.058,
    "text": "I do a lot of work with community psychology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1382.078,
    "end": 1393.205,
    "text": "So there's this challenge of going from the self, there's like the self and then there's society, social, but the intersubjective kind of group dynamics, there's a big problem because it's like a big hole.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1393.225,
    "end": 1396.828,
    "text": "And I find this really useful because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1397.535,
    "end": 1424.265,
    "text": " a lot of stuff which talks about how groups they often try to project out into the future as if it's a light beam that you could measure whereas here it's much more you know like it's sitting in the swarming i like to think the bottom of the cone is almost the swarming dynamics that go down into the past you've got the kind of structure that the cell that's emerged and then the system that's able to go into temporal depth in the future and the code and i think that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1425.111,
    "end": 1440.349,
    "text": " that offers a nice way to think about group dynamics particularly maybe the more ironically the more challenging group dynamics where there isn't a coherent single narrative so there might be applications there",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1440.956,
    "end": 1442.717,
    "text": " Yeah, this is super interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1442.737,
    "end": 1452.922,
    "text": "And I should say, one of the things about the cone, and we had a discussion about this yesterday, and Pranab Das pointed out that my cone compared to Minkowski's cone is upside down, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1453.062,
    "end": 1458.025,
    "text": "And the reason I did it this way was because if you think about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1459.46,
    "end": 1469.247,
    "text": " Where any given agent, the only thing the given agent is really certain of at the moment is what's going on right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1469.707,
    "end": 1472.589,
    "text": "So your future obviously is uncertain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1472.609,
    "end": 1478.893,
    "text": "And when you're trying to predict, so let's say you're trying to manage goals and you're trying to predict, you've got some predictive capacity going forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1479.173,
    "end": 1481.474,
    "text": "That predictive capacity doesn't get better over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1481.534,
    "end": 1482.875,
    "text": "It gets worse over time, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1483.155,
    "end": 1487.679,
    "text": " you're sort of exponentially more uncertain about what's going to happen later on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1487.719,
    "end": 1491.001,
    "text": "So your ability to pursue those goals in the future gets smaller and smaller.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1491.522,
    "end": 1495.184,
    "text": "Same thing goes back in the past, although you could argue that that's linear and not exponential.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1495.485,
    "end": 1503.591,
    "text": "But again, what you're doing at any given moment in time is inferring what your past was from the engrams of memory that are available to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1503.711,
    "end": 1510.056,
    "text": "They might be a brain, they might be a stigmergic medium that you live in, you know, within if you're an ant colony, whatever it's going to be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1510.416,
    "end": 1516.623,
    "text": " You've got some kind of material in which events leave memories, they leave traces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1516.984,
    "end": 1523.711,
    "text": "At any given moment, you are reading those traces, recalling them, and reconstructing what you think the past was.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1523.731,
    "end": 1525.433,
    "text": "That's your only evidence for what the past was.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1525.453,
    "end": 1527.656,
    "text": "You have no idea what actually happened.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1528.056,
    "end": 1546.102,
    "text": " And so even going backwards, my cone comes down because your ability to go backwards in time and be certain of what went on and what are the facts on which you can now build your goal-directed strategy going forward become more and more uncertain going back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1546.463,
    "end": 1555.846,
    "text": "So that's why my cones are upside down in this, so to speak, also because there's no particular reason this has to map exactly onto Minkowski's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1556.63,
    "end": 1563.777,
    "text": " Informalism, but I think it's close that just because that your level of certainty is highest right now, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1563.797,
    "end": 1565.359,
    "text": "Both in space and time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1565.379,
    "end": 1570.924,
    "text": "And when you step away from that rapidly, at least for all of us rapidly get smaller.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1572.967,
    "end": 1588.143,
    "text": " Yeah, we were really actually talking about this last week in our discussion, and we were kind of thinking about this as like an information cone, because you have the most information about your environment at this point in space and less information as you go forward and backward in time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1588.743,
    "end": 1592.187,
    "text": "So do you think that that might be the correct way to think about it?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1593.157,
    "end": 1594.018,
    "text": " So that's true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1594.498,
    "end": 1595.399,
    "text": "That's absolutely true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1595.419,
    "end": 1597.14,
    "text": "It's definitely also an information cone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1597.16,
    "end": 1606.726,
    "text": "But I want to be clear about this because this diagram is not a diagram of what you can sense or how far your effectors range.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1607.787,
    "end": 1622.877,
    "text": "What you just said about the information certainty is the consequences of that are that you also have a limited cone in what the diagram really is supposed to show, which is the scale of the goals towards which you can work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1623.437,
    "end": 1635.248,
    "text": " So, because the information is smaller, your ability to pursue goals towards, you know, how far into the future am I actively, you know, doing, it just becomes limited, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1635.268,
    "end": 1636.049,
    "text": "Your ability to do so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1636.249,
    "end": 1637.891,
    "text": "So, it's sort of a secondary thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1638.871,
    "end": 1649.98,
    "text": " consequence of that, but I just want to be clear that this is not meant to be fundamentally a picture of the information certainty of sensory capacity of effector range or anything like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1650.2,
    "end": 1653.303,
    "text": "This is a diagram in gold space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1654.582,
    "end": 1654.862,
    "text": " Nice.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1655.442,
    "end": 1659.563,
    "text": "So one of the other ways I've been thinking about it is kind of like a possibility cone.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1660.043,
    "end": 1666.464,
    "text": "So like, as you progress forward into the future, we all are left with one possibility and that's like death, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1666.504,
    "end": 1668.804,
    "text": "So your goal at that moment is death.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1669.385,
    "end": 1675.086,
    "text": "And similarly in the past, like we all come from a single celled, like, you know, fertilization event.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1675.146,
    "end": 1681.467,
    "text": "And so like we all started an event and ended an event and like the maximum possibility is now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1682.047,
    "end": 1683.407,
    "text": "So what do you think about that?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1685.731,
    "end": 1688.033,
    "text": " Yeah, I mean, so that's a really interesting point, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1688.053,
    "end": 1693.717,
    "text": "And people talk about, you know, great transitions in cognition along the continuum and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1693.737,
    "end": 1697.96,
    "text": "And so I think one great cognition, a great transition is the following.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1699.101,
    "end": 1708.168,
    "text": "If you are a creature with a horizon, with a cognitive horizon of, you know, a half an hour, you're a goldfish or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1708.188,
    "end": 1713.532,
    "text": "I don't know if this is factually true, but, you know, you're some sort of form that has a cognitive horizon of a half an hour, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1714.17,
    "end": 1721.484,
    "text": " What that means is that all of your major goals, survival and these other things, they're totally achievable, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1721.504,
    "end": 1725.853,
    "text": "Because it is completely plausible that you are going to make it for that half hour that you can project forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1726.582,
    "end": 1748.299,
    "text": " If you are a human and your goals are, I don't know, world peace or your buildings, the larger things, you are for the first time, perhaps along the Earth's lineage anyway, you are able to comprehend goals that you have no chance whatsoever of achieving because you have a limited lifespan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1748.599,
    "end": 1759.548,
    "text": " So now that's a really sharp transition, kind of an emergent transition, because for the first time, you are able to undertake goals that you know you are not going to complete, guaranteed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1759.568,
    "end": 1765.552,
    "text": "Whereas the fish essence, maybe you'll get eaten and maybe you won't, but it's totally plausible that you live for the half hour that you can see forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1767.752,
    "end": 1784.152,
    "text": " And so I suspect that this is, and this is sort of way above my pay grade to know details about this, but I suspect this drives a lot of the weird facts about human psychology because you now have this fundamental stressor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1784.472,
    "end": 1790.274,
    "text": " that other creatures don't have because you're able to foresee all these goals that you are definitely not going to meet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1790.694,
    "end": 1800.698,
    "text": "And that's a novel sort of conflict between the different modules that doesn't exist for most other creatures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1802.698,
    "end": 1803.819,
    "text": "Yeah, that's really interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1804.399,
    "end": 1808.66,
    "text": "Something that might be uniquely human is this possibility to see",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1810.822,
    "end": 1837.535,
    "text": " past like the cone of our own existence like into the future with these like future possibilities or future goal states and also like backwards into the past in like a historical sense so we all like look at history um so i don't know i like thinking about like you know i've been reading your recent paper this integrating evolutionary developmental thinking into scale free biology this paper with chris fields",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1838.576,
    "end": 1844.503,
    "text": " And I know like when we spoke yesterday, you mentioned you were integrating these ideas maybe into your next paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1844.963,
    "end": 1851.211,
    "text": "But in that paper, you guys were kind of blurring the boundary really between the processes of evolution and development.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1852.052,
    "end": 1860.575,
    "text": " And phylogenetic memory that's contained in DNA and results from evolution transforms into this ontogenetic memory.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1860.615,
    "end": 1861.275,
    "text": "Yeah, definitely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1861.295,
    "end": 1866.177,
    "text": "So there's a couple of really interesting things related to evolution that we can talk about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1866.357,
    "end": 1867.858,
    "text": "And that's something I'm working on now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1867.918,
    "end": 1870.599,
    "text": "And this thing should be done in a couple of weeks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1871.239,
    "end": 1872.279,
    "text": "We'll see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1872.319,
    "end": 1872.68,
    "text": "Two things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1872.74,
    "end": 1873.1,
    "text": "Number one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1875.142,
    "end": 1888.969,
    "text": " One of the things, one of the amazing things about biological hardware that's given to us by evolution is that it is, there's a default way, by that I mean cells with their genomically determined proteins, whatever they have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1890.49,
    "end": 1895.412,
    "text": "There's a default and a pretty robust, consistent default outcome, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1895.572,
    "end": 1899.214,
    "text": "And so embryo, you know, fish embryos make fish and frog embryos make frogs and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1900.034,
    "end": 1915.523,
    "text": " but there's an incredible amount of plasticity there so that those exact same cells, genetically wild types, so the hardware is all the same, are in fact in other types of environments, are able to make completely novel creatures, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1915.583,
    "end": 1925.269,
    "text": "And then so some of this, so synthetic biology and synthetic morphology is already showing this, you know, as our xenobots and things like this, and there'll be tons more going forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1926.469,
    "end": 1929.331,
    "text": "One thing that's interesting about those novel creatures is that,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1929.992,
    "end": 1941.403,
    "text": " you don't have a long history of specific selection and frozen accidents and all this phylogenetics to lean on when you ask, why do they do certain things?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1941.803,
    "end": 1948.509,
    "text": "So for every normal animal in the biosphere, you say, why is this thing green and why does it fly and how come it has these antennae?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1948.529,
    "end": 1949.53,
    "text": "The answer is always the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1949.57,
    "end": 1952.633,
    "text": "Well, because for millions of years, the ancestors were selected for this and that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1953.133,
    "end": 1954.695,
    "text": "The fact that we can take those embryos",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1955.603,
    "end": 1971.594,
    "text": " those cells rather, cells from those kind of animals, and put them together into a new creature that has goals and behaviors, morphological goals, behavioral goals, physiological goals, that basically appear overnight, you know, within 24, 48 hours, they sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1973.376,
    "end": 1978.063,
    "text": " Show up, and then the, then the question is, where did these things come from?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1978.103,
    "end": 1983.351,
    "text": "Because what they didn't do was to be honed over millions of years by specific selection pressure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1983.371,
    "end": 1985.775,
    "text": "So so that that's a very interesting to me to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1986.687,
    "end": 1998.091,
    "text": " aspect of the plasticity here that it is not, you know, the history doesn't necessarily determine them other than the default, you know, sort of variant and where does that come from?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1998.371,
    "end": 2004.194,
    "text": "And then there's the whole thing, which, you know, I don't know, you can tell me if you want to dive deeper into this or not, but the whole",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2005.729,
    "end": 2033.424,
    "text": " the fact that you have multiple layers and that you have competency going down you know sort of all the way down has massive implications for why evolution works so fast right why why actually anything is able to evolve on the on the time scale that that we see so i think you know if you're interested we could get into that yeah that's great why don't we uh unpack that okay um yeah let's let's let's let's talk about that a little bit um imagine imagine two kinds of creatures and uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2034.75,
    "end": 2043.959,
    "text": " you've got one kind of creature where the genome has a pretty direct influence over what the anatomy is going to be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2043.999,
    "end": 2046.141,
    "text": "Everything is hardwired in some sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2046.481,
    "end": 2055.729,
    "text": "And so let's say, let's visualize, let's say it's a frog of some kind and there's the genome and it makes a frog and that's what it does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2055.789,
    "end": 2060.514,
    "text": "And so now imagine evolution is sort of searching the space and now there's a mutation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2060.994,
    "end": 2064.556,
    "text": " And the mutation does two things, because most mutations do multiple things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2064.616,
    "end": 2066.217,
    "text": "Let's say we got a mutation that does two things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2066.877,
    "end": 2069.939,
    "text": "It moves the eyes off kilter, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2070.539,
    "end": 2075.362,
    "text": "And it also has some really beneficial effects somewhere else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2075.402,
    "end": 2077.063,
    "text": "You know, it helps with some other things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2077.423,
    "end": 2082.026,
    "text": "Most mutations are pleiotropic, so it's a reasonable conjecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2082.406,
    "end": 2089.39,
    "text": "If your animal is the hardwired kind, the eyes are in the wrong place, nothing works,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2090.558,
    "end": 2096.245,
    "text": " evolution never gets to explore the positive benefits of this other mutation because the thing's going to be dead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2096.606,
    "end": 2099.39,
    "text": "It's just not a workable animal anymore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2099.41,
    "end": 2100.451,
    "text": "The fitness is very low.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2100.591,
    "end": 2100.972,
    "text": "It's gone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2101.493,
    "end": 2105.398,
    "text": "And so most, if you think about these kind of hardwired things,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2105.874,
    "end": 2116.52,
    "text": " It's the same when I first, you know, 100 years ago when I first heard about how evolutionary algorithms are supposed to work, this idea that I've got a system that does something, I'm going to start throwing random changes in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2116.58,
    "end": 2118.782,
    "text": "Anybody that's written any code, are you crazy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2118.842,
    "end": 2120.683,
    "text": "Of course everything's going to get worse, not better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2120.703,
    "end": 2121.363,
    "text": "That's never going to work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2123.283,
    "end": 2131.009,
    "text": " Imagine a different... Now, of course, it works, but it takes massive amounts of time, and there's all these difficulties about evolving complex things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2131.429,
    "end": 2133.11,
    "text": "Now imagine what we actually have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2133.15,
    "end": 2136.172,
    "text": "The actual... And I'll explain the biological example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2136.473,
    "end": 2142.597,
    "text": "You have a tadpole, and the tadpole has to move all of its organs, craniofacial organs around to become a frog.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2142.857,
    "end": 2147.661,
    "text": "So the jaws have to come out, the nostrils move, the eyes move forward, like everything, all this stuff moves around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2148.501,
    "end": 2151.924,
    "text": "And you could have a hardwired animal in which every...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2152.828,
    "end": 2157.391,
    "text": " Every organ moves in the right direction, a particular distance, and that's it, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2157.431,
    "end": 2159.192,
    "text": "And that's your hardwired thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2159.953,
    "end": 2162.834,
    "text": "That actually is not how animals work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2162.934,
    "end": 2166.917,
    "text": "So if we, and so what we did a few years ago is we made what we call these Picasso tadpoles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2166.957,
    "end": 2169.418,
    "text": "The idea is you make these tadpoles, everything's in the wrong place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2169.458,
    "end": 2175.282,
    "text": "The eyes are on the back of the head, the mouth is off to the side, the nostrils are up here, like it just scrams, like Mr. Potato, everything's scrambling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2176.098,
    "end": 2185.642,
    "text": " So if it was a hardwired system, then all of these things would move the traditional amount in the traditional direction and everything would be way off because you're starting in the wrong spot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2186.242,
    "end": 2197.387,
    "text": "Instead what happens is that all of these organs move in novel paths and they keep moving and sometimes they overshoot and have to come back, but they keep moving until they build a correct frog face and then they stop moving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2198.127,
    "end": 2204.55,
    "text": "So now that system, so what the genetics actually gives you, it doesn't somehow give you a hardwired set of movements, what it does do",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2205.459,
    "end": 2222.266,
    "text": " is give you an error minimization scheme that can progressively deform the system until the error from some sort of set point, and we've been studying what the set point is, we can talk about that, until the error from that set point gets to an acceptably low level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2222.99,
    "end": 2232.615,
    "text": " So what you have here is a competent set of craniofacial organs that are going to move around and get to where they need to go, even if they start off in the wrong position.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2232.875,
    "end": 2234.696,
    "text": "So now look at what happens with evolution, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2234.716,
    "end": 2235.616,
    "text": "You got your mutation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2236.517,
    "end": 2239.298,
    "text": "The eyes and the jaws now are off in the wrong place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2239.699,
    "end": 2241.419,
    "text": "But now you've got this benefit somewhere else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2242.22,
    "end": 2244.301,
    "text": "The thing is, the eyes and the jaws are going to get fixed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2244.581,
    "end": 2247.843,
    "text": "You don't need to worry about that because they're going to they know where they belong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2247.863,
    "end": 2250.324,
    "text": "They're going to get there even though they start out in the wrong position.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2250.945,
    "end": 2260.177,
    "text": " So that negative aspect of that mutation gets hidden from selection, for a while anyway, because eventually it'll catalyze into",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2261.989,
    "end": 2270.514,
    "text": " Into the genome itself, but for a while, it gets hidden from selection, allowing evolution to explore the benefits of the other benefits of that mutation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2270.914,
    "end": 2272.895,
    "text": "So, so here's all in summary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2272.935,
    "end": 2273.856,
    "text": "Here's, here's what this means.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2273.896,
    "end": 2278.659,
    "text": "The fact that you have competent some units and they're competent morphologically, they're competent physiologically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2278.699,
    "end": 2280.079,
    "text": "We can talk about what that means.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2280.54,
    "end": 2282.581,
    "text": "The fact that they're all competent means that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2284.275,
    "end": 2286.879,
    "text": " the fitness landscape is much less rugged.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2286.999,
    "end": 2288.361,
    "text": "It's much smoother.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2288.882,
    "end": 2298.816,
    "text": "It means that the effects of mutations are much more linear, meaning that you can examine each consequence independently",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2299.156,
    "end": 2306.159,
    "text": " because the other consequences can be masked by the local environment being off, it doesn't matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2306.919,
    "end": 2309.88,
    "text": "Things still get where they need to go and connect and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2310.08,
    "end": 2313.422,
    "text": "So it makes the search process way more easier by",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2314.98,
    "end": 2317.182,
    "text": " by allowing you to, and it gives you patience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2317.242,
    "end": 2320.405,
    "text": "It means that evolution doesn't have to solve every problem at once.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2320.685,
    "end": 2327.031,
    "text": "You don't have to wait until you find a mutation that gives you a positive impact and leaves the eyes where they need to be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2327.051,
    "end": 2328.572,
    "text": "You don't need to wait for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2328.692,
    "end": 2335.779,
    "text": "You can grab the first mutation you find that gives you the positive impact because the eye thing will get taken care of because those subunits are confident.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2336.099,
    "end": 2338.381,
    "text": "So it raises the IQ of the whole system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2338.421,
    "end": 2339.442,
    "text": "The search becomes a much",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2339.802,
    "end": 2353.976,
    "text": " A much smarter search, it has some patients, it's able to see linearly instead of sort of highly mixed up all of the consequences of these mutations, and it smooths the fitness landscape.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2354.237,
    "end": 2361.364,
    "text": "So I think when you can count on your components to do some of the heavy lifting, you don't have to micromanage all of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2361.964,
    "end": 2365.245,
    "text": " the evolutionary search gets massively more efficient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2365.526,
    "end": 2374.609,
    "text": "And now it starts to become a little more plausible that we actually see this, you know, this amazing biosphere actually evolved by a process of random mutation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2375.95,
    "end": 2376.23,
    "text": "Nice.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2376.85,
    "end": 2386.234,
    "text": "So in that same paper, you talk about random mutation, but then you also describe this kind of modularity of gene groups and the possibility of entire gene families",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2386.741,
    "end": 2391.945,
    "text": " like the Hox cluster duplicating and driving the major evolutionary transitions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2392.385,
    "end": 2400.01,
    "text": "Is this a sort of non-random process, sort of ergodicity breaking with perhaps like non-linear effects when these entire clusters?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2400.09,
    "end": 2406.094,
    "text": "Yeah, I hesitate to say too much because I don't think much is known there that I can say definitively.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2406.555,
    "end": 2412.358,
    "text": "I think that this whole issue of random and non-random mutations is very controversial, obviously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2412.378,
    "end": 2415.781,
    "text": "I suspect that there is a notion of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2417.202,
    "end": 2419.923,
    "text": " of evolutionary search that's not quite blind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2420.223,
    "end": 2426.246,
    "text": "So people often will argue, you know, either they, most people nowadays say evolution is completely blind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2426.286,
    "end": 2432.789,
    "text": "You know, it just, it makes these mutations, whatever happens is not because of any directionality in the search space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2433.13,
    "end": 2437.752,
    "text": "And then, you know, you've had people who think that it's directed towards a specific outcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2438.432,
    "end": 2445.816,
    "text": "I think there's a sort of in-between scenario where it's definitely not directed in the sense that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2445.976,
    "end": 2466.105,
    "text": " can see far forward in the search space but it doesn't have to be completely blind in that maybe what it has and this this comes out of some discussions i've had with both chris fields and richard watson that that maybe instead of a point in fitness space what you really have is a little bit of a vector you have almost like a comet trail right and then it gives you a little bit of um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2467.126,
    "end": 2480.136,
    "text": " a little bit of information about direction and about, you know, and you can imagine, I mean, I can sort of design in my head an epigenetic system of marking things on the DNA that give you a little bit of information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2480.156,
    "end": 2481.837,
    "text": "Well, what was this allele last time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2482.417,
    "end": 2488.359,
    "text": " So that you can sort of say, well, I've been turning this knob in this direction and things are going well, so maybe I want to turn it some more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2488.579,
    "end": 2489.099,
    "text": "That kind of thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2489.119,
    "end": 2489.919,
    "text": "And this is totally made up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2489.959,
    "end": 2492.86,
    "text": "I'm not saying that we know that biology actually does this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2493.5,
    "end": 2498.541,
    "text": "Maybe it doesn't, and maybe synthetic biology, maybe we implement this for the first time, we engineer it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2499.141,
    "end": 2501.402,
    "text": "But I think it's possible to make a system that does that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2501.802,
    "end": 2506.103,
    "text": "And maybe collections of genes and some of the complex chromatin interactions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2506.838,
    "end": 2512.241,
    "text": " Epigenetics that go on, maybe they're part of that process, but this is this is total conjecture at this point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2513.202,
    "end": 2521.727,
    "text": "So, Sarah, I may have a question, but I'm going to use my moderators privilege here and just ask, do you think that this vector driven mutation could be perhaps driven by active inference?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2522.127,
    "end": 2525.869,
    "text": "Some kind of vector between exploration and exploitation happening.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2529.625,
    "end": 2545.943,
    "text": " Yeah, and so one of the things that we have talked about and that I'm going to write after this next thing is really on this idea that maybe the whole evolutionary lineage of a particular species",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2549.086,
    "end": 2566.258,
    "text": " the animal or plant or whatever it is, maybe that's an agent as well, just stretched out massively over space such that each at any given point in time, all of the existing examples of that species are in fact hypotheses about the space, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2566.619,
    "end": 2571.122,
    "text": "And that what you're doing is you're constantly generating genomes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2571.642,
    "end": 2572.963,
    "text": " as hypotheses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2573.443,
    "end": 2578.185,
    "text": "And some of those genomes are proven to be some of those hypotheses are proven good and some are not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2578.645,
    "end": 2591.19,
    "text": "And then the next sort of the next set of genomes is not completely random, but it's in some way part of this part of the active inference of this giant sort of virtual age.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2591.25,
    "end": 2591.45,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2591.73,
    "end": 2597.612,
    "text": "So I think there's a story to be told like that, but it's way more hand waving than details at this point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2598.312,
    "end": 2598.633,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2598.673,
    "end": 2599.473,
    "text": "Thanks, sir.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2600.29,
    "end": 2609.533,
    "text": " Yeah, my comment is now maybe a little bit stale, but I think I'll put it out there anyway, just for the sake of saying something concrete, because a lot of this feels a bit abstract.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2610.894,
    "end": 2613.275,
    "text": "And I'm hoping I'm even remembering this anecdote right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2613.315,
    "end": 2629.301,
    "text": "But I remember learning that some gene, once upon a time, that gave us an extra rod or cone in our eye, allowed us better color reception, also was the same gene that shut off our ability to make our own vitamin C.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2630.584,
    "end": 2635.108,
    "text": " And if that's correct, if I'm remembering that correct, that's such an interesting example of.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2637.891,
    "end": 2644.337,
    "text": "Yeah, of course, it's an example of the of the fact that genes do multiple things, but but it was kind of like, isn't that coincidental?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2644.397,
    "end": 2645.718,
    "text": "You know that that this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2648.277,
    "end": 2656.564,
    "text": " that that gene is doing, you know, both something for the eye, but then also making it so that you can get your own vitamin C, you know, by looking at fruit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2656.604,
    "end": 2660.948,
    "text": "And I just thought that was, that kept coming to me as an example of what you guys are talking about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2661.708,
    "end": 2663.149,
    "text": "But it's stale, sort of.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2664.21,
    "end": 2664.731,
    "text": "Thanks, Sarah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2664.831,
    "end": 2667.313,
    "text": "And sorry for making your comments stale.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2668.334,
    "end": 2668.594,
    "text": "Stephen?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2681.05,
    "end": 2705.887,
    "text": " yeah sort of following on it's this you have this idea of like um a goal space or a teleological space in a way that's really interesting and then with that exploit or explore you i wonder if there's a time when there's there's there's um a thought about when things are very directed and of course our western thinking we we tend to think about a nice pointed cone",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2707.251,
    "end": 2735.994,
    "text": " um where we go into the future we because we sculpt the world around us we maybe have like a distinctive trajectory because we're kind of we're constructing our world more and more which is probably part of our problem to make it the way we want it to be um whereas particularly if you look at indigenous cultures they would have you know a cyclical the more cyclical approach which would go through seven generations or different levels of generations and would be a tune-in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2736.793,
    "end": 2761.703,
    "text": " the environment and i'm kind of curious whether and again this might be where we don't really know but is there a point at which there's a generally trying to come back uh or maintain in the allostasis the kind of the cyclical sort of pattern that is where we want to go to and is there a time when it's like okay we're we're branching out now like we've made a jump and we're going to try and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2763.489,
    "end": 2774.79,
    "text": " inscribe our environment at different scales from the body out to sort of now maintain some new kind of steady state attractor and how that might fit with this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2775.928,
    "end": 2804.261,
    "text": " yeah i mean i think i i think you're absolutely right and that some future version of this is going to have to uh be able to deal with goals that are not only not static meaning they're cyclical but also um goals that are themselves you know let's say second order goals like like my goal is is it's a derivative my goal is to get better at something it's not a particular level that i'm looking for but i want a particular slope of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2804.961,
    "end": 2824.596,
    "text": " some variable being you know a particular right so something like that so so you're absolutely right i i started out with the simplest you know this is sort of the hydrogen atom of this thing so i started out with something very simple that it's homeostatic as in your your goal is a is to achieve a particular region in whatever space you're solving problems in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2824.656,
    "end": 2851.749,
    "text": " be that morphous space or physiological space your goal is to find that region and sit there and and that of course is not all there is to life obviously that's just the first you know kind of step i just did that for simplicity because i want to tackle everything at once and and there needs to be a lot done here before we get to that point um but yeah you're absolutely right your your goal state in that space may not be a point it may be some interesting you know bigger bigger bigger shape you know and this thing and and i just want to i'm going to say something about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2852.492,
    "end": 2855.954,
    "text": " These goal spaces, because I think it's, it's, it's interesting to point this out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2856.374,
    "end": 2857.435,
    "text": "So, um.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2859.336,
    "end": 2865.679,
    "text": "1 of the in this in this, this all came out of a meeting on diverse intelligences and so it was the 1 thing I've been thinking about is what.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2866.119,
    "end": 2869.441,
    "text": "What is intelligence and what are these agents actually trying to do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2870.281,
    "end": 2870.441,
    "text": "And.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2871.222,
    "end": 2873.203,
    "text": "Okay, so so we have lots of examples of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2874.396,
    "end": 2876.898,
    "text": " problem-solving in three-dimensional space, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2876.918,
    "end": 2883.042,
    "text": "So you've got crows and monkeys and everything else, and they're running around and trying to solve problems by moving around in three-dimensional space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2883.482,
    "end": 2889.906,
    "text": "But all the different subunits of bodies are solving problems in other kinds of spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2889.926,
    "end": 2891.387,
    "text": "So we talked about morphospace.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2891.627,
    "end": 2900.093,
    "text": "So if you are an eye in the head of a frog, you are working in a space of possible configurations of where you are relative to everything else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2900.633,
    "end": 2912.096,
    "text": " and you are trying to move and act in a way that is going to acquire, to a particular region of morphous space that describes the correct frog head, that's where you're trying to land.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2912.576,
    "end": 2917.358,
    "text": "There's also a physiological space, so I'll just give you a simple example that we found recently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2918.178,
    "end": 2920.739,
    "text": "So these flatworms, these planaria,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2922.532,
    "end": 2950.522,
    "text": " you you take these planaria and you throw them in barium okay so a solution of barium now uh what happens is the barium is a non-selective potassium channel blocker it it blocks all the potassium channels all the cells freak out their head their heads literally explode right over overnight you know their heads just degenerate they're gone if you take those planaria and you leave them in fresh barium over the next you know 10 20 days what they will do is they will build new heads",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2951.24,
    "end": 2952.941,
    "text": " that are completely barium insensitive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2953.421,
    "end": 2953.941,
    "text": "Couldn't care less.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2954.121,
    "end": 2954.702,
    "text": "No problem at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2954.902,
    "end": 2955.942,
    "text": "They live in barium, which is fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2956.262,
    "end": 2962.966,
    "text": "So we asked the simple question, and not because the answer has to be this, but just because that's the tool that was available.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2963.186,
    "end": 2968.468,
    "text": "We asked the simple question, what is transcriptionally different about barium-adapted heads from normal heads?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2968.888,
    "end": 2972.99,
    "text": "So what genes are differently expressed in these heads?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2973.47,
    "end": 2978.733,
    "text": "And so what you find out is that out of tens of thousands of genes that these planaria have,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2979.64,
    "end": 2990.825,
    "text": " they managed to regulate a very small number on the order of a couple dozen that allow them now to do their business despite the fact that potassium is no longer usable for them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2991.265,
    "end": 2994.126,
    "text": "So now this is incredible because think about the problem that they're solving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2994.226,
    "end": 2998.928,
    "text": "In my head, I always visualize like one of those nuclear reactor control rooms with buttons everywhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2999.208,
    "end": 3001.549,
    "text": "So each button is a different gene.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3001.589,
    "end": 3002.309,
    "text": "What are you going to do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3002.329,
    "end": 3004.07,
    "text": "You have a physiological stressor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3004.29,
    "end": 3005.41,
    "text": "You can't pass potassium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3005.43,
    "end": 3006.831,
    "text": "Everything's going to happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3007.463,
    "end": 3011.304,
    "text": " you have some tens of thousands of genes that you could turn on and off.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3011.984,
    "end": 3014.164,
    "text": "The combinatorics are astronomical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3014.584,
    "end": 3017.625,
    "text": "You don't have time to try them all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3017.645,
    "end": 3019.425,
    "text": "You don't even have time for gradient descent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3019.685,
    "end": 3021.145,
    "text": "You don't reproduce fast enough.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3021.185,
    "end": 3025.906,
    "text": "It's not like bacteria where you could say, well, they're all random, and then somebody will survive and repopulate ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3026.166,
    "end": 3027.267,
    "text": "They don't divide that fast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3027.487,
    "end": 3029.687,
    "text": "So you don't have time for any kind of evolutionary explanation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3030.027,
    "end": 3035.428,
    "text": "Within some small number of days, you have to hone in on a small number of genes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3036.269,
    "end": 3041.172,
    "text": " knowing that if you just start randomly flipping them up and down, you're going to make things worse long before you make them better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3041.192,
    "end": 3042.133,
    "text": "You're going to kill everything off.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3042.173,
    "end": 3043.093,
    "text": "You just randomly start.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3043.454,
    "end": 3048.577,
    "text": "So now the other important fact about this is that planarian never see barium in the wild.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3048.917,
    "end": 3054.581,
    "text": "So planarian, there's no evolutionary history of being good at surviving in barium because they don't see barium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3054.981,
    "end": 3060.405,
    "text": "So now to me, this is an amazing example of problem solving in a high dimensional virtual space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3060.425,
    "end": 3062.126,
    "text": "You've got this, you've got this, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3063.055,
    "end": 3082.607,
    "text": " physiological space and your problem is, your problem is physiological, your effectors are transcriptional largely, although of course you have physiological effectors too, but you're trying to walk in this space and you have to somehow map, it's unbelievable how they do this, you somehow have to map your effectors in transcriptional space",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3083.047,
    "end": 3089.753,
    "text": " to what's happening to you in physiological space and then rapidly get to a workable region.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3090.013,
    "end": 3092.975,
    "text": "So that gives you an idea of what we're talking about, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3092.995,
    "end": 3097.439,
    "text": "These spaces can be transcriptional, physiological, all kinds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3099.571,
    "end": 3101.532,
    "text": " And these things, and they solve their problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3101.592,
    "end": 3110.035,
    "text": "And like you pointed out, the correct, the thing you're trying to achieve may not be a point, it's certainly not a point in that space, but it may not even be a static area.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3110.055,
    "end": 3114.656,
    "text": "It may be some sort of, I would like to sort of wander in this, you know, kind of weird loop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3114.716,
    "end": 3115.577,
    "text": "That's my goal, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3115.617,
    "end": 3119.398,
    "text": "Is to, you know, is to wander in some sort of weirdly shaped attractor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3119.418,
    "end": 3120.358,
    "text": "Yeah, we'll get to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3120.398,
    "end": 3121.859,
    "text": "This is the just, you know, first step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3123.298,
    "end": 3128.181,
    "text": " Just one question following up from that, just before Sarah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3129.222,
    "end": 3141.89,
    "text": "So if I'm right, what you're saying is gradient descent, because that would have to come from where you are and slowly keep incrementing, there's somehow some goal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3142.09,
    "end": 3151.776,
    "text": "I mean, maybe there's some evolutionary history, even if it's not barium, something like barium, but somehow it's not only going from...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3153.251,
    "end": 3157.574,
    "text": " adjacent possibilities, it's somehow jumping ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3157.954,
    "end": 3159.695,
    "text": "Is that what you're saying?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3159.775,
    "end": 3162.317,
    "text": "So the first thing I'm saying is that I don't have any idea how it works, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3162.377,
    "end": 3166.519,
    "text": "So I am not claiming I have a good model for what's going on here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3166.72,
    "end": 3174.204,
    "text": "But I think you're onto something, which is that I think, and I think we talked about this a few minutes ago, which was abstraction and generalization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3174.244,
    "end": 3175.445,
    "text": "I think you're exactly right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3175.465,
    "end": 3178.207,
    "text": "I think what the system is able to do is to say,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3178.827,
    "end": 3184.489,
    "text": " Okay, I don't know what this barium is, but I've been terribly depolarized before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3184.549,
    "end": 3186.89,
    "text": "It was an epileptic, you know, kind of a thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3187.191,
    "end": 3188.691,
    "text": "And this is an awful lot like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3188.751,
    "end": 3194.113,
    "text": "So I'm going to generalize what just happened to this other thing that I do know how to deal with, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3194.213,
    "end": 3195.534,
    "text": "And I'm going to move in that direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3195.814,
    "end": 3197.555,
    "text": " So that's my gut feeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3197.615,
    "end": 3199.375,
    "text": "I don't have a solid model for this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3199.415,
    "end": 3200.835,
    "text": "That's not been proven in any way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3202.156,
    "end": 3205.197,
    "text": "But I have a feeling that that's where the answer is going to be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3205.237,
    "end": 3216.6,
    "text": "It's going to be that it's able to do this because it is able to recognize this physiological problem as an instance of a larger class of things for which it does know how to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3217.447,
    "end": 3232.879,
    "text": " And I think that when we talk about intelligence for all of these agents, what we're really saying is it's your ability to navigate these various spaces efficiently and without getting trapped in local minima that kill you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3232.919,
    "end": 3233.079,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3233.119,
    "end": 3235.621,
    "text": "Being being able to step temporarily.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3235.641,
    "end": 3236.642,
    "text": "You know, it's that patience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3236.702,
    "end": 3241.465,
    "text": "It's that it's that being able to step away from the direct line to your goal to then come around and.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3242.993,
    "end": 3250.716,
    "text": " And again, I have, sometimes when I talk about this, I have a picture of this, there's a fence, and there's a couple of dogs on either side of the fence, and they're just like, you know, trying to get at each other, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3251.036,
    "end": 3252.777,
    "text": "There's a hole in the fence four feet away.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3253.117,
    "end": 3254.477,
    "text": "So they could do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3254.577,
    "end": 3258.739,
    "text": "The problem is it temporarily requires you to get away from, get further from your goal, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3258.999,
    "end": 3269.743,
    "text": "So that ability, you're trapped in this local maximum, and your intelligence is directly sort of proportional to your ability to temporarily",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3271.067,
    "end": 3275.929,
    "text": " get further from their goal in order to actually get into a better position later on as part of the IQ.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3276.169,
    "end": 3280.39,
    "text": "But I think the other part of the IQ is this kind of generalization, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3280.41,
    "end": 3281.45,
    "text": "And I think you're right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3281.47,
    "end": 3283.571,
    "text": "I think that's probably what this is going to end up explaining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3283.591,
    "end": 3286.332,
    "text": "Nice.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3286.532,
    "end": 3288.292,
    "text": "Sarah?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3288.532,
    "end": 3289.673,
    "text": "Man, this is great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3290.533,
    "end": 3295.194,
    "text": "This question is probably out of bounds, but if you have any thoughts on it, then great, if not, pass.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3296.275,
    "end": 3300.596,
    "text": "I mean, the cone-type diagram and the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3301.303,
    "end": 3325.636,
    "text": " the agential teleos that it assumes, I'm just wondering if you feel like there's any applicability to non-agential type phenomena, like complex systems or hurricanes or whatever, because when we're talking about abstraction, yeah, I'm just wondering if you have any thoughts about where that could go, if anywhere.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3326.036,
    "end": 3336.659,
    "text": " Yeah, so the thing I'll say about that, and this is the kind of thing that probably not a lot of people will agree with this, but this is my view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3338.9,
    "end": 3347.482,
    "text": "To say non-agential presupposes that you can draw a binary sharp line between things that are agents and things that are not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3347.942,
    "end": 3367.088,
    "text": " i don't really believe in that i think that's a view that gets us into a lot of trouble by looking at these looking for these sharp lines i think that all there is is a degree of agency and i'm not sure we are we talked about yesterday whether there's such a thing as zero i i don't actually i'm not even sure there's a zero but certainly there are there are things that are very",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3367.868,
    "end": 3375.353,
    "text": " very sort of non, you know, very, very low levels of agency and, and things that are very high and everything is a smooth continuum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3375.454,
    "end": 3380.217,
    "text": "So now then, so, so then, then, then the question is, okay, so what do you do with hurricanes and things like this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3380.537,
    "end": 3389.523,
    "text": "So I drew, and this will be this, you know, in the next, in the next paper, there's a thing, there's a thing that I call, it's an axis of persuadability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3390.284,
    "end": 3394.467,
    "text": "And it's, it's, it's sort of related to Dennett's intentional scenes in the following way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3395.04,
    "end": 3401.346,
    "text": " There's a continuum, and for any given system, so my claim is that it's an empirical problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3401.386,
    "end": 3403.828,
    "text": "You can't say whether something is or is not an agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3403.868,
    "end": 3404.488,
    "text": "Lots of people do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3404.528,
    "end": 3405.97,
    "text": "They'll say, well, that's not an agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3406.01,
    "end": 3412.235,
    "text": "I think you can't say that until you've done the empirical work, and the empirical work looks like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3412.275,
    "end": 3413.556,
    "text": "The question is this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3413.897,
    "end": 3419.822,
    "text": "As an engineer, this is very much an engineering perspective, as an engineer, how much work do you have to do",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3421.317,
    "end": 3428.84,
    "text": " What do you need to know about the system and what kind of work do you have to do to be able to control and predict its outcome?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3429.081,
    "end": 3430.581,
    "text": "So I'll just give you a couple of examples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3431.061,
    "end": 3434.303,
    "text": "All the way on the left, you have things that are like mechanical clocks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3434.683,
    "end": 3437.064,
    "text": "So if you're dealing with a system that's like a mechanical clock,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3437.694,
    "end": 3450.963,
    "text": " you know you can put it on the left of this diagram because you are not going to reason with it, you are not going to train it, you're not going to be able to punish it, you're not going to be able to rewrite its goal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3451.283,
    "end": 3461.27,
    "text": "You have to know how it works, and you have to micromanage the hardware, and you have to rewire the physics of it to get it to do something else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3462.216,
    "end": 3464.597,
    "text": " Then moving on from that, you have something like a thermostat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3464.937,
    "end": 3471.42,
    "text": "And with a thermostat, you're also not going to reason with it or punish it, but there is a separate set point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3471.56,
    "end": 3476.302,
    "text": "And if you want the room to be kept in a different temperature range, you don't have to rewire the thermostat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3476.322,
    "end": 3477.562,
    "text": "You can change the set point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3477.882,
    "end": 3481.704,
    "text": "So as in, this has massive implications for regenerative medicine that we can talk about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3482.444,
    "end": 3486.226,
    "text": "The way you relate to the system is quite a bit different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3486.626,
    "end": 3489.567,
    "text": "Now, after that, you might get to systems that have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3490.182,
    "end": 3495.266,
    "text": " preferences in the sense that you can actually train them, meaning you can provide rewards and punishments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3495.846,
    "end": 3503.511,
    "text": "They will change their behavior because what you're doing is you're relying on them to be a kind of learning system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3503.531,
    "end": 3505.112,
    "text": "They're able to do associative learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3505.132,
    "end": 3511.317,
    "text": "So they associate certain things you've done to them with things that they did and they will change their behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3511.637,
    "end": 3515.019,
    "text": "So now this means that we can now think of what this means.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3515.039,
    "end": 3516.18,
    "text": "You know, humanity has been",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3517.192,
    "end": 3522.436,
    "text": " training animals for, I don't know, 10,000 years, whatever, with knowing nothing about neuroscience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3522.776,
    "end": 3526.099,
    "text": "It means that you don't actually have to know what's going on inside your system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3526.119,
    "end": 3528.76,
    "text": "You don't need that micro-level hardware information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3529.841,
    "end": 3534.505,
    "text": "All you need is to know that that system has that level of agency that it's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3538.147,
    "end": 3541.214,
    "text": " susceptible to this kind of interaction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3541.475,
    "end": 3542.176,
    "text": "And how do you know?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3542.557,
    "end": 3543.8,
    "text": "You don't know until you've tried.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3543.82,
    "end": 3544.421,
    "text": "So we have no idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3544.622,
    "end": 3547.368,
    "text": "So one of the things we're doing now with Charles Abramson, who's a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3548.241,
    "end": 3567.112,
    "text": " behaviorist scientists, we're actually writing a how-to manual, a how-to paper on if you are given some sort of weird new synthetic system, how do you know where along the, and it actually has a bunch of experiments that you do to figure out where you are along this path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3567.352,
    "end": 3572.195,
    "text": "So you can go further, and there are other systems where you know nothing about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3573.32,
    "end": 3584.067,
    "text": " What's inside and in fact, the amount of energy that it takes to manipulate them as tiny, because you can, you can give them reasons as opposed to causes and you can, you can give them information and they will act on this information and do various things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3584.087,
    "end": 3586.949,
    "text": "Of course, sophisticated patients.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3587.47,
    "end": 3588.59,
    "text": "So, all that is to say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3589.911,
    "end": 3600.881,
    "text": " the question of where something like a hurricane lands on the spectrum, I think we need to really resist the urge to just make pronouncements, sort of armchair pronouncements about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3601.181,
    "end": 3607.627,
    "text": "And we need to ask a simple question, which type of manipulation is that system amenable to?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3607.927,
    "end": 3610.609,
    "text": "And when you find out, then you know how much agency it has.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3610.889,
    "end": 3614.332,
    "text": "Now, I'll give you a simple example of how this works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3615.473,
    "end": 3617.215,
    "text": "And other people have done something similar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3618.018,
    "end": 3625.305,
    "text": " If you think about gene regulatory networks, so gene regulatory networks are a quintessential example of a dynamical system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3625.365,
    "end": 3627.567,
    "text": "It's deterministic and all that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3628.267,
    "end": 3634.673,
    "text": "And one of the things we asked is we simply said, how do we know where on this spectrum it lands?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3634.934,
    "end": 3637.596,
    "text": "Let's just try to train it and see what happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3638.036,
    "end": 3643.642,
    "text": "And it turns out, and this is, so we did this computationally, and now we're sort of starting to do this at the bench.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3644.746,
    "end": 3648.587,
    "text": " We simply ask the question, could gene regulatory networks have associative learning capacity?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3649.067,
    "end": 3650.908,
    "text": "And that means that you could do interesting things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3650.928,
    "end": 3653.129,
    "text": "You can do Pavlov-Dogg's experiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3653.389,
    "end": 3655.069,
    "text": "So you have a gene regulatory network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3655.83,
    "end": 3658.57,
    "text": "You have some stimulus that causes it to do something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3658.59,
    "end": 3661.031,
    "text": "So you have your unconditioned stimulus that causes a response.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3661.691,
    "end": 3666.853,
    "text": "You have this other thing that's a neutral stimulus that normally doesn't do anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3668.089,
    "end": 3673.572,
    "text": " you pair presentations of the UCS and the neutral stimulus together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3673.592,
    "end": 3682.236,
    "text": "And after a while, what you might find is that now take away the original unconditioned stimulus and use the neutral stimulus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3682.276,
    "end": 3685.818,
    "text": "And that's now enough to trigger the response because there's an associative memory that formed",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3686.238,
    "end": 3706.024,
    "text": " in the network right so now we actually tried this in the sense that we we took a bunch of um known gene regulatory networks from literature we made an algorithm that basically checks for associative learning and lo and behold we found two things we found that there are six different kinds of memories that these things can do including associative memories for many of them",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3706.744,
    "end": 3714.511,
    "text": " And that the biological networks have way more memories than you find in random networks that you would just randomly concoct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3714.531,
    "end": 3717.374,
    "text": "So apparently, either directly or indirectly, selection likes that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3717.854,
    "end": 3726.042,
    "text": "So that's just an example of what you would do under this view with dynamical systems, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3726.262,
    "end": 3728.364,
    "text": "That you would think, oh, you know, these are trouble cases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3728.464,
    "end": 3729.565,
    "text": "Are they agency or aren't they?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3729.986,
    "end": 3732.448,
    "text": "I think that's where we get in trouble because we try to draw a sharp line.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3732.728,
    "end": 3734.709,
    "text": " I think the answer is they're somewhere on the line.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3734.749,
    "end": 3737.289,
    "text": "They could be way over on the left or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3737.889,
    "end": 3746.792,
    "text": "And you find out when you figure out what kind of intervention and strategy avails you of the most predictive power with the least amount of effort.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3750.133,
    "end": 3751.053,
    "text": "Nice.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3751.073,
    "end": 3757.115,
    "text": "So we talked yesterday kind of about, you know, cells that are contiguous and",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3757.779,
    "end": 3759.623,
    "text": " There's like connections.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3759.743,
    "end": 3768.421,
    "text": "And so this concept of like a shared information making up an individual or like what constitutes the boundary.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3769.4,
    "end": 3783.565,
    "text": " You know, if cells are connected via gap junctions, and like you talked about how if there's a calcium molecule inside my cell, I don't know if it's from me or from my neighbor because we share this kind of hole between us.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3784.405,
    "end": 3795.189,
    "text": "And so I just wonder if there's some degree of information sharing or some kind of like proximal level, does it have to be immediately contiguous to have that same",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3795.729,
    "end": 3811.916,
    "text": " like cognitive capacity or or like over a longer distance can this also function like for example if i get some kind of like necrotizing flesh in my leg is my toe necessarily going to know like what's going on with my leg it's going to take a while",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3812.316,
    "end": 3814.697,
    "text": " for that signal to diffuse over such a long distance.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3815.218,
    "end": 3829.045,
    "text": "So where is the boundary or container space for this kind of information sharing that has to occur to make this cognitive individual a whole thing by itself?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3829.725,
    "end": 3832.427,
    "text": "So I don't know if you can say a little bit more about that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3838.47,
    "end": 3839.491,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3841.801,
    "end": 3850.926,
    "text": " So I think one thing that I really need to improve in this whole thing for next time is a better visualization, and I frankly don't yet know how to do it because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3851.678,
    "end": 3854.699,
    "text": " This way of visualizing it looks very physical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3854.739,
    "end": 3860.36,
    "text": "It looks like what the cone is, that the cone is at the edge of the cells that are connected, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3860.4,
    "end": 3864.721,
    "text": "It sort of gives this idea that what you're measuring is the actual physical boundary of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3865.221,
    "end": 3875.924,
    "text": "And that's not quite what I'm trying to get across because what, and this is actually, let's just think about the cells in the cancer versus multicellularity, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3875.944,
    "end": 3877.644,
    "text": "Which is a nice example of how this works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3879.381,
    "end": 3897.135,
    "text": " When you have a bunch of cells and they get together and they're going to build a kidney, the size of the, at least the spatial size of that particular agent is going to be roughly the size of the thing they're working towards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3897.155,
    "end": 3898.757,
    "text": "It's going to be the size of that kidney, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3898.777,
    "end": 3900.258,
    "text": "That's the project they're all working on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3901.299,
    "end": 3906.323,
    "text": "Each individual cell has no idea what a kidney is, but the collective intelligence of that group of cells, it has a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3907.493,
    "end": 3909.195,
    "text": " a goal that's trying to build that kidney.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3909.215,
    "end": 3913.08,
    "text": "If you try to deviate it from that goal, it will do its best to get back and do it anyway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3914.001,
    "end": 3923.191,
    "text": "So what you would be measuring there is the size of the state that it's trying to achieve, not necessarily where the edges",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3925.033,
    "end": 3936.386,
    "text": " Now, there's certainly some relationship there, because in this particular example, as you said, what enables the cells to work together is the fact that they're electrically coupled into one and chemically coupled into one giant network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3936.607,
    "end": 3939.93,
    "text": "So there's some relationship, but it's not quite always the edge, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3939.95,
    "end": 3941.132,
    "text": "You know what I mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3941.232,
    "end": 3942.914,
    "text": "And the same thing with the individual cells.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3945.315,
    "end": 3947.176,
    "text": " It's related, but it's not exactly the same thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3947.216,
    "end": 3958.299,
    "text": "When one cell defects, so let's say an oncogene turns on, the cell closes all the gap junctions, disconnects from its neighbors, and now that computational boundary is literally just that one cell.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3958.779,
    "end": 3970.403,
    "text": "Again, it's not quite at the edge of the cell because if you look at the scale of things the cell is trying to manage, it's a little bit bigger than that because it also really cares about some of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3971.798,
    "end": 3977.5,
    "text": " you know, the nutrients, the wastes, the conspecifics, the prey, whatever else is going on right at that edge, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3977.72,
    "end": 3979.541,
    "text": "So it's not quite at the cell boundary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3979.821,
    "end": 3989.384,
    "text": "So I just want to make that clear that this diagram isn't meant to be an anatomical, the cone isn't meant to be a map exactly on the anatomy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3989.424,
    "end": 3992.745,
    "text": "It's a cone of the states that the thing is trying to actively manage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3995.606,
    "end": 3997.747,
    "text": "Yeah, I think that the cones were inflicted by us, though.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4000.408,
    "end": 4000.608,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4001.344,
    "end": 4002.264,
    "text": " But you're absolutely right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4002.284,
    "end": 4008.526,
    "text": "And as soon as you did that, I realized that what, because that has to be right, that those two diagrams eventually have to meet, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4008.806,
    "end": 4016.249,
    "text": "And so there has to be, there has to be a way to, so I think, I don't know, my visual imagination isn't great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4016.269,
    "end": 4019.49,
    "text": "I have to think a little more about a better way to kind of represent it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4019.51,
    "end": 4021.631,
    "text": "But of course, you're right, those two things have to come together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4023.931,
    "end": 4024.652,
    "text": "Yes, Stephen?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4026.172,
    "end": 4028.813,
    "text": "Yeah, I was just sort of following on from what you were saying is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4030.157,
    "end": 4052.672,
    "text": " often as well as useful when we think of entities and processes, I'm maybe scaling up to more psychological scales, but you know, we often think about this is this person, this is what this entity is diagnosed as, and this entity, and it's all kind of, and there's a lot more now moved towards what's the process, but then what kind of processes do we have on that continuum?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4052.892,
    "end": 4057.875,
    "text": "Just like we're talking about with the hurricane, you know, you maybe got a static entity, like a rock or,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4058.658,
    "end": 4062.399,
    "text": " And then you've got your kind of systems, some of which could be mechanical, like a clock.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4063.4,
    "end": 4072.622,
    "text": "But then you sort of hit structures, there's some sort of structure, like a, I don't know, like a skeleton or a network of processes coming together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4073.403,
    "end": 4083.986,
    "text": "Then you get into them, which is what I find really interesting with the work you do is you the sort of nonlinear swarming dynamics, you know, and it's sort of, and I was wondering how,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4085.043,
    "end": 4090.267,
    "text": " When you think of, you know, you've got a body and I'm a body and I'm trying to work in my space around me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4091.148,
    "end": 4101.476,
    "text": "So I see things in my environment out there and I can interact to some extent, depending on what my available processes afford me in my structures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4102.097,
    "end": 4111.785,
    "text": "And then there's other stuff inside, which to some extent, I kind of have to let take care of themselves unless I want to tattoo myself or do some sort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4112.526,
    "end": 4115.428,
    "text": " internal mutilation or something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4115.448,
    "end": 4124.734,
    "text": "So I'm curious about how this entity process dynamic going in and out can be thought of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4125.414,
    "end": 4126.255,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4126.515,
    "end": 4128.116,
    "text": "Well, I want to say a couple of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4128.576,
    "end": 4135.821,
    "text": "And again, this is sort of going kind of far stream, but I think it might be relevant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4136.422,
    "end": 4138.503,
    "text": "When you say you are this body,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4139.918,
    "end": 4148.266,
    "text": " sort of in the sense that we are talking to the verbal entity there, but there are all sorts of other entities there that we're not hearing from that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4148.626,
    "end": 4151.108,
    "text": "And so, so we know that from split brain patients, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4151.129,
    "end": 4162.819,
    "text": "We know that after a commissurotomy, the right side of the brain, you can communicate with, and it'll give you opinions that the verbal patient, part of the patient doesn't agree with, doesn't know anything about, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4162.839,
    "end": 4164.561,
    "text": "So really interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4165.702,
    "end": 4181.979,
    "text": " I also think about multiple personality, you know, they call it multiple personality disorder, but the reality is, you know, a single brain body system apparently can host any number of distinct behaviors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4182.441,
    "end": 4202.365,
    "text": " and how in how i am i'm not i'm not an expert in this area so i don't know how psychologically deep so some of these other personalities go but enough that you can have a conversation certainly enough that you can have a conversation with them which means they're doing better than all of the ai that we've ever produced right and and they uh and in fact i i read once i forget where it was but there was an interesting comment from a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4204.558,
    "end": 4225.125,
    "text": " a therapist who was asked to he was he was he was asked to deal with a multiple personality patient and he was talking about integration and he was you know that the the goal of the therapy was going to integrate because the person's very disruptive for the for the individual and we're going to we're going to integrate all of these into one and one of the personalities said to that patient",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4225.709,
    "end": 4228.05,
    "text": " integration, you're going to kill me, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4228.07,
    "end": 4228.931,
    "text": "That's what you're talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4228.971,
    "end": 4229.791,
    "text": "I thought you were a doctor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4229.831,
    "end": 4230.671,
    "text": "What are we talking about here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4231.032,
    "end": 4247.76,
    "text": "And so, you know, it was outraged that there was going to be this integration of, you know, of what, at least ostensibly, you've got this entity that certainly passes the Turing test and is not happy about the fact that you're about to integrate it in a way, basically, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4248.2,
    "end": 4248.38,
    "text": "So,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4249.946,
    "end": 4257.894,
    "text": " I think that goes back to this idea that we're an interpenetrating set of selves, and we tend to only hear from the verbal one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4258.255,
    "end": 4264.121,
    "text": "So there's all kinds of other ones in there that are competing and cooperating and everything else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4264.301,
    "end": 4270.548,
    "text": "And the other thing I can say about this, so that's more questions than answers, I guess, but the other thing I think that's interesting is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4271.801,
    "end": 4284.784,
    "text": " You're right in the sense that the one kind of entity that we have direct experience with, which is the verbal sort of one that presumably we share, is completely ignorant of most of the things that are going on there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4284.864,
    "end": 4292.046,
    "text": "And so the space that you're working with nicely coarse grains over all kinds of stuff, your liver function and everything else, you don't need to micromanage all this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4292.406,
    "end": 4294.907,
    "text": "However, there are techniques that will add",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4295.476,
    "end": 4321.191,
    "text": " axes to your option space so if you would like to learn to uh also consciously control your heart rate or your you know skin temperature or whatever you can do biofeedback there are tools that will enable you to cross that that that boundary and you will now have a new axis in your option space that you never did had before do you want it i don't know there's a good reason why most of these you don't you don't use it's a good to sort of simplify your space",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4322.194,
    "end": 4332.899,
    "text": " But there was a cool experiment where they measured the temperature between a rat's ears, and they gave it a reward proportional to the difference in temperature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4333.099,
    "end": 4339.722,
    "text": "And so rats readily learned to get their ears to, I think, like five degrees Celsius or something different between their ears to get the reward, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4341.251,
    "end": 4342.672,
    "text": " That's amazing for a number of reasons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4342.812,
    "end": 4353.455,
    "text": "One is that now you've added an effector in your space that is kind of this physiological blood flow, I don't know how they do it, that you didn't have before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4353.495,
    "end": 4355.715,
    "text": "The other thing, of course, is the credit assignment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4355.895,
    "end": 4358.196,
    "text": "Here you are, you're a rat, and you just got some reward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4358.416,
    "end": 4360.437,
    "text": "And so, well, let me see, why did I get this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4360.477,
    "end": 4366.779,
    "text": "So while my tail is pointing up and my left fingers are clenched and my whiskers are going, which of those things actually were...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4368.719,
    "end": 4376.524,
    "text": " this is, we still haven't cracked this in machine learning, is how living things are so good at figuring out what exactly they're being rewarded for, for a small number of trials, actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4376.904,
    "end": 4384.729,
    "text": "So, but you can, I think, I think you can break through, at least to some extent, and, you know, break through, and actually even further, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4384.749,
    "end": 4392.314,
    "text": "So there are claims that certain types of, you know, mental practices will have effects on your immune system, for example, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4392.494,
    "end": 4397.257,
    "text": "So you can, I think you can go pretty far down, right, from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4398.515,
    "end": 4401.657,
    "text": " if you wanted to add these kinds of things to your options space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4403.218,
    "end": 4403.878,
    "text": "Ah, interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4403.998,
    "end": 4407.68,
    "text": "Actually, just bouncing on that, going, that's really helpful, actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4407.7,
    "end": 4408.841,
    "text": "I've not even thought about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4408.861,
    "end": 4416.285,
    "text": "But that different parts of us ties in with, there's this big push all the time, if you say, about integrate, integrate, integrate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4416.305,
    "end": 4425.71,
    "text": "And actually, when you scale out, because I do a lot of work with multi-service service providers, say, in Africa or other countries where they're, and you tend to find that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4426.523,
    "end": 4435.547,
    "text": " any type of transdisciplinary project has the problem about whichever regime of attention or field of practice the voice is in at that time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4435.567,
    "end": 4441.089,
    "text": "And then when we talk about integrating, it normally means they dominate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4441.909,
    "end": 4443.21,
    "text": "What about configuring?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4443.45,
    "end": 4446.891,
    "text": "So think about this idea of configuring different fields of practice, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4446.971,
    "end": 4448.932,
    "text": "different ways or different",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4449.642,
    "end": 4474.257,
    "text": " ways of knowing and also ways the other voices is strategic conversations with communities who don't normally get a voice who know something in the state space beyond what the the actors who've got the job in the agency know and it's this sort of ties in a little bit with what you're talking about here so i think it's quite interesting in the sense of can we con because in a way the biology isn't trying to integrate",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4475.465,
    "end": 4494.882,
    "text": " is actually configuring and allowing things to be but it has a way to still know their different teleological spaces and either just let it get on with it or yeah knows where and when to get involved i suppose is is the thing yeah i mean so so so i think i think the the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4496.56,
    "end": 4504.331,
    "text": " One way of looking at that is to ask, what are the optimal policies for this binding?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4504.371,
    "end": 4506.113,
    "text": "So I'll give you an example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4506.154,
    "end": 4509.578,
    "text": "So in the case of the multicellularity, we say, OK,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4511.082,
    "end": 4529.794,
    "text": " Individual cells are pretty cool, but when they connect via gap junctions into a multicellular collective, they can do these marvelous things and they resist cancer and turning off the connection and becoming a cancer cell and going metastatic is bad.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4529.834,
    "end": 4533.236,
    "text": "And so what you would really like to do is to reconnect these cells back in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4533.637,
    "end": 4535.218,
    "text": "So the thing is that, right,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4536.318,
    "end": 4543.362,
    "text": " tightly coupling individual units into a global entity avails you of all kinds of interesting things, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4543.382,
    "end": 4546.784,
    "text": "So it raises the IQ of the whole and gives you all kinds of capabilities, fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4547.604,
    "end": 4556.229,
    "text": "But one of the things that gets lost when you do that is that the larger system now can dominate the goals of the lower system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4556.769,
    "end": 4558.931,
    "text": "And in fact, the larger system may have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4559.761,
    "end": 4589.288,
    "text": " very little uh care for the goals of the welfare of the subunit you know when was the last time you worried about all the skin cells you're shedding right you just you know you're going to do what you're going to do and if you lose some skin cells you know no no no problem um so what that suggests is that block you know maximum maximizing out this connectivity into some giant board like uh you know thing is is and and obviously it's been you know it's kind of been attempted on you know on the on the social scale we know how that turns out so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4589.828,
    "end": 4595.451,
    "text": " you want to, somewhere in between there, there's an optimal policy, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4595.731,
    "end": 4614.101,
    "text": "Where I hope that there may not, you know, there may be maybe there's some no-go theorem somewhere that says there is no good policy, but I hope that somewhere in there, there's a good policy that allows us to reap the rewards of appropriate kinds of large-scale organization without a sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4615.058,
    "end": 4622.381,
    "text": " blanket collectivism that completely sort of, you know, wipes out the needs of the lower level subunits.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4622.721,
    "end": 4634.106,
    "text": "So that, I hope, is an empirical question that we should be looking for what kind of policies give us, that optimize the various things we want to optimize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4634.846,
    "end": 4643.789,
    "text": " Josh Vanguard and I planned a grant at one point for this human flood, this human flourishing program somewhere, and I think it's actually an empirical question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4643.829,
    "end": 4652.393,
    "text": "Can we identify the optimal policies that preserve the needs of the subunits and reap the rewards of becoming a greater whole?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4655.734,
    "end": 4655.974,
    "text": "Nice.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4657.481,
    "end": 4660.182,
    "text": " So I learned this word yesterday, egregore.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4660.542,
    "end": 4666.945,
    "text": "It's the occult concept representing a distinct non-physical entity that arises from a collective group of people.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4667.505,
    "end": 4668.546,
    "text": "And I thought it was really cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4668.706,
    "end": 4671.467,
    "text": "And I think of this concept of emergence.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4672.027,
    "end": 4676.229,
    "text": "So like at what level does this collective kind of body form?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4677.15,
    "end": 4693.537,
    "text": " And I don't know if you've read the information theory of individuality paper, uh, by David Krakauer, but we really think about, you know, emergence, you know, like the emergence causing the formation of the collective entity, but then there also has to be like some kind of downward causation at some, some point in there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4694.037,
    "end": 4701.74,
    "text": "Like, so is there, is this some kind of like critical point, like a phase transition that starts to occur or when does that kind of start to happen?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4701.82,
    "end": 4703.981,
    "text": "That, that bi-directional information flow.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4705.502,
    "end": 4705.682,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4708.18,
    "end": 4708.661,
    "text": " For sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4708.681,
    "end": 4724.296,
    "text": "I mean, this in particular is interesting because I thought about this a little while ago that, you know, especially people who are interested in this kind of stuff, you know, and you can think about the really old concept of group karma, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4724.316,
    "end": 4732.764,
    "text": "This idea that not only you have your own individual cause and effect that you're causing, but in a strong sense, the group of which you are a part has its own",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4733.274,
    "end": 4760.881,
    "text": " right, cause and effect that is as real as, so that idea, and I don't know how many thousands of years old that idea is, I think it is an amazingly prescient because in Western science, the science of collective intelligence and this idea that, right, the group can be a swarm of whatever can be an agent on its own is relatively recent, right, that people have started taking that seriously in science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4761.741,
    "end": 4788.842,
    "text": " but i think i think that kind of thinking must have been extremely old because there are these traditions that take it very seriously that the group is not just a heap of stuff but it actually has its own agency in the sense that it can even be the subject of blame and reward in the sense of you know the sense of like rewarded punishment or karma or whatever that that's a very strong view of group agency that i think we've only said you know scientifically we've only um really appreciated recently",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4790.17,
    "end": 4793.353,
    "text": " I think that's pretty cool actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4793.653,
    "end": 4806.523,
    "text": "Random linguistic thing here that egregore, I was thinking about egregious and egregious in my mind is like out of bounds, but yet egregore is not that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4806.583,
    "end": 4807.303,
    "text": "It's the opposite.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4807.323,
    "end": 4808.745,
    "text": "It's almost like a group thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4809.085,
    "end": 4813.989,
    "text": "Maybe somebody else can think about that differently, but I thought that was an interesting conflict.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4814.489,
    "end": 4815.79,
    "text": "Yeah, very interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4818.527,
    "end": 4833.884,
    "text": " So I think about this concept of collective karma a lot and really kind of whether or not like I have free will in the in the present, like in terms of am I just some kind of computation like my like, you know, just because I've been doing active inference and so",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4834.844,
    "end": 4840.948,
    "text": " Am I just my generative model that effectively I can't make any decision because of my model?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4841.208,
    "end": 4847.472,
    "text": "Whatever input I'm getting at that moment, I have to decide based on the condition of my model at that time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4847.993,
    "end": 4857.879,
    "text": "I think about collective karma much in the same way and whether or not there exists some agency in the present or not.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4858.299,
    "end": 4862.142,
    "text": "If all the things that just made me who I am right now,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4862.822,
    "end": 4866.004,
    "text": " have just led ultimately to be where I am.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4866.064,
    "end": 4868.705,
    "text": "And in collective karma too, it's like a hurricane.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4869.065,
    "end": 4871.586,
    "text": "That group of people caused that hurricane to happen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4871.626,
    "end": 4875.928,
    "text": "Like they created the causes for the collective karma for the hurricane to come.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4876.969,
    "end": 4877.729,
    "text": "So I don't know.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4878.169,
    "end": 4880.871,
    "text": "It's something that is really intriguing to me.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4880.971,
    "end": 4887.474,
    "text": "And, you know, I don't know if you want to maybe elaborate a little bit more on that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4888.243,
    "end": 4915.288,
    "text": " yeah yeah and and and so and so two two thoughts about that uh one one is that this goes back to this idea of of spaces and the different spaces that each of your um each of the subunits is working in one way that and and after after i drew this cone and i realized that it kind of looked like the the special relativity cone and all that uh some other some other pieces of relativity sort of started started popping into my head and this idea of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4915.988,
    "end": 4918.03,
    "text": " deforming the space around you, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4918.05,
    "end": 4925.636,
    "text": "So if you're a mass, you deform the space around you, which in turn alters your next possible movements and the possible movements of the other masses around you, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4926.016,
    "end": 4934.763,
    "text": "So by deforming that by your actions, you are deforming the possibility space for yourself, for things next to you, for your components, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4935.163,
    "end": 4938.986,
    "text": "And so one thing that I think happens is that these larger systems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4939.622,
    "end": 4948.813,
    "text": " deform the action space for their lower systems so that all they have to do is roll downhill in effect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4948.833,
    "end": 4955.841,
    "text": "And so if you zoom in, so this gets back, and I'm going to connect this back to your point about karma and action and choices and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4956.321,
    "end": 4962.445,
    "text": " When you zoom in, all you see is physics, and you say, oh, well, of course that's what it's doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4962.465,
    "end": 4963.206,
    "text": "That's all it could do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4963.246,
    "end": 4964.487,
    "text": "All the gradients are pointing this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4964.507,
    "end": 4965.267,
    "text": "That's what it had to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4965.848,
    "end": 4973.113,
    "text": "But the reason it can do that and still get to some global goal is because the higher-level system has already deformed that space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4973.473,
    "end": 4975.635,
    "text": "So I see this, and I don't know how I'm going to ever draw this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4975.795,
    "end": 4976.695,
    "text": "That's a different story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4976.876,
    "end": 4983.02,
    "text": "But I see all these different levels as deforming their simpler space that they're working in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4983.5,
    "end": 4990.086,
    "text": " which then changes the option space for their subunits so that they don't have to be as smart.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4990.126,
    "end": 4993.79,
    "text": "This is sort of Dennett's idea of progressively dumber robots all the way down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4994.11,
    "end": 4995.752,
    "text": "That works if each system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4996.548,
    "end": 5015.889,
    "text": " makes it so that so that the the lower level systems don't have to do quite as much of the work and there's a stupid example i always go to from from you know from like common everyday life if if if you ever had a friend who tried to stop smoking and they like to smoke at night one of the things they might do is put their car keys somewhere that's really hard to get to why because they know that when they you know at midnight when they want to smoke",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5016.509,
    "end": 5020.412,
    "text": " they're not going to feel like going hunting for the keys and then they could find, and then that's that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5020.872,
    "end": 5023.073,
    "text": "What they're doing is, who are you doing this to?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5023.093,
    "end": 5024.714,
    "text": "You're doing this to your future self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5024.734,
    "end": 5028.637,
    "text": "You're deforming the space for your future self, in that case, consciously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5028.657,
    "end": 5030.318,
    "text": "Of course, we all do things unconsciously too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5030.658,
    "end": 5033.36,
    "text": "But in that case, you're consciously deforming the action space",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5033.82,
    "end": 5059.365,
    "text": " for your future self in order to uh so that you can be on autopilot at that point right you don't have to have the willpower at midnight that i'm gonna you know not do this it's you've already somebody's already sort of twisted the space for you so that you're just going to get your keys it's just too high of a barrier and forget it so uh right so so i think i think that that that that deformation of these action spaces is a really important way in which um lower and higher level systems relate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5060.054,
    "end": 5065.077,
    "text": " The lower level systems simplify the action space for the higher level system because they're competent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5065.197,
    "end": 5067.179,
    "text": "So the higher level system doesn't need all the dimensions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5067.759,
    "end": 5072.923,
    "text": "And the higher system bends the space of the lower system to make things easier to get to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5073.423,
    "end": 5077.285,
    "text": "And that goes back to your other point that you just made about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5079.326,
    "end": 5102.54,
    "text": " in the moment of taking actions in the moment that are the consequence of all the pressures that you have set up and other things have set up for you, where, yeah, I see this as, so if we think about will in the sense of, you know, free will or decision making or whatever, I see this, again, this like, four dimensional block where each one of us at any point in time is a slice of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5103.321,
    "end": 5103.421,
    "text": "And",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5103.832,
    "end": 5121.744,
    "text": " If you zoom in on that one, that selflet that exists at that one time slice, your free will, so to speak, is limited to none because at that moment on the local scale, you are going to do whatever the local forces have arranged that you're going to do, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5122.044,
    "end": 5126.467,
    "text": "And this is one, like a simple example is, can you control what your next thought is going to be?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5126.727,
    "end": 5127.288,
    "text": "You really can't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5127.308,
    "end": 5128.789,
    "text": "Your next thought is going to be whatever it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5129.109,
    "end": 5131.631,
    "text": "So at the local level, when you zoom in,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5133.712,
    "end": 5136.633,
    "text": " there's no useful sense of freedom there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5136.693,
    "end": 5155.579,
    "text": "However, if you zoom out on the long scale, what is true, I think, is that you can take repeated actions, whether they be practice or whatever they're going to be, you can take repeated actions that alter your cognitive causal structure so that over time,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5156.283,
    "end": 5157.204,
    "text": " you have made changes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5157.584,
    "end": 5164.888,
    "text": "And so no, you can't control the next thought you're going to have now, but you can control what percentage of your thoughts are negative or whatever it is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5165.919,
    "end": 5167.26,
    "text": " down the line, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5167.78,
    "end": 5173.862,
    "text": "So to me, that question of choice and freedom is very much relative to what scale you're asking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5173.883,
    "end": 5181.106,
    "text": "If you zoom in to the low, you know, to the physics and the sort of short time scale, no, I don't think there's any useful sense of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5181.366,
    "end": 5188.529,
    "text": "But over the long term, absolutely, because you can make changes both in your environment, your own structure, that will get you to a different place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5191.823,
    "end": 5192.183,
    "text": " Thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5193.443,
    "end": 5193.844,
    "text": "Stephen?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5194.024,
    "end": 5197.385,
    "text": "Yeah, this is really helpful, actually, to hear it thought about this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5197.485,
    "end": 5214.85,
    "text": "And just as we were saying there about this sort of almost transcendental or the way we often think of things being excluded, egregious, as Sarah was saying, we need to move beyond",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5216.31,
    "end": 5221.257,
    "text": " The inner outer, you know, there's an inner thought process and there's an outer world, but the two are linked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5221.457,
    "end": 5228.787,
    "text": "Like we say, so with active inference, the idea is that I don't necessarily purely have a model of those cones in my head.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5228.807,
    "end": 5233.133,
    "text": "I buy, I've got an action model for how to draw them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5234.258,
    "end": 5241.186,
    "text": " I haven't got the whole thing that can be dumped down like a data source, but I have a way to do that, which sort of ties in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5241.467,
    "end": 5245.732,
    "text": "And when you mentioned there about looking at the future,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5246.605,
    "end": 5265.002,
    "text": " One thing that adds that Active Influence hasn't really done is it talks about, say, the car keys example is the sequence at which something might have to happen to get to the future being disrupted, which is kind of that quantum contextuality idea, whereas normally in Active Influence, they talk about the niche",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5265.856,
    "end": 5284.934,
    "text": " construction or the niche modification, but not just about modifying itself is modifying the trajectories you might take through that niche, which that, that gives you more near time possibilities for like sculpting what can happen when it can happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5285.034,
    "end": 5287.176,
    "text": "So that, I think that's quite useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5287.256,
    "end": 5288.337,
    "text": "I was wondering how,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5289.417,
    "end": 5299.439,
    "text": " how you see that relationship to niche construction and models being sort of embedded in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5300.299,
    "end": 5318.483,
    "text": "So if systems are really models in the world that we then read or interact with using our structures, how do we link up that kind of cone with the kind of niche construction that's maybe being used in other areas of active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5320.379,
    "end": 5324.081,
    "text": " Yeah, I mean, so that's that's a very difficult question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5324.201,
    "end": 5326.202,
    "text": "I can sort of address a small part of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5326.242,
    "end": 5330.385,
    "text": "I think at this point and I can, you know, I think I think one of the key.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5332.406,
    "end": 5361.506,
    "text": " questions of all of this is to what extent what when we look at systems and we see the dimensions with let's just do the third person case first and then we'll talk about that I think the first person case that you're talking about so when we look at a system and we make a map of its its problem solving in some space and its goal directed activity in some space the question is uh is that in any sense objective in the meaning meaning could we um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5362.338,
    "end": 5367.064,
    "text": " Could we make a case that that model of that space is better or the best?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5368.065,
    "end": 5371.209,
    "text": "Or is there an infinity of ways to look at it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5371.61,
    "end": 5377.517,
    "text": "And in particular, how does that relate to now the first person perspective of that system itself?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5378.439,
    "end": 5379.779,
    "text": " what does the space look like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5380.26,
    "end": 5385.881,
    "text": "It's a little bit like, you know, the whole Umbel thing, right, where you're sort of in some space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5385.901,
    "end": 5387.001,
    "text": "What does it look like to you?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5387.562,
    "end": 5395.884,
    "text": "And Chris Fields made a really nice example in our computational meeting a couple weeks ago where he said, imagine a bacterium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5396.69,
    "end": 5401.813,
    "text": " and there's some sugar gradient that the bacterium is in and it wants to have more energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5402.233,
    "end": 5411.498,
    "text": "So now one thing we are tempted to do is to draw a space whereby rotating its flagella or whatever else, this thing is going to move up the gradient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5411.978,
    "end": 5426.285,
    "text": " But there's something else it can do, which is that it can turn on a gene for an enzyme that lets it use a completely different sugar or let it use that sugar better or something else that solves that same problem with an effector that to us is an entirely different space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5426.605,
    "end": 5433.509,
    "text": "So we look at this and we say, ah, that solution has a problem in physical space and it has a solution in transcriptional space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5434.176,
    "end": 5438.902,
    "text": " If you're a bacterium, is there any sense in which those are not part of the same space?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5438.922,
    "end": 5442.346,
    "text": "I mean, I have no idea what it's like to be that bacterium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5442.687,
    "end": 5453.06,
    "text": "One could make an argument that our dissection of these things as two different spaces is totally biased because we're scientists and we like to look at things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5453.32,
    "end": 5457.322,
    "text": " That to the bacterium, both of those are effectors that live together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5457.362,
    "end": 5458.223,
    "text": "That's kind of a mix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5458.543,
    "end": 5463.385,
    "text": "It's almost like, you know, it's almost like you can ask about some sort of PCA, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5463.425,
    "end": 5470.349,
    "text": "If you have principle component analysis where you're learning about your world and you're going to end up with a picture of what the axes are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5470.609,
    "end": 5474.612,
    "text": " that don't necessarily make any sense to us looking at the system, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5474.652,
    "end": 5479.996,
    "text": "You find, you get these components that, you know, these control knobs, and we look at it and say, what the hell is, you know, what is it doing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5481.017,
    "end": 5485.139,
    "text": "But to the system, those are efficient ways to build an axis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5485.18,
    "end": 5497.909,
    "text": "And people like, you know, Robert Printner and Don Hoffman have these models of these cognitive systems from scratch sort of building these worlds, these virtual spaces for themselves, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5497.929,
    "end": 5499.71,
    "text": "That you don't actually know what spaces you're in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5500.603,
    "end": 5520.74,
    "text": " So I think there's a research agenda there, which is, can we build some sort of appliance, meaning some sort of, I don't know, machine learning thing or something that will try to extract these in a, I'm not going to say unbiased, but at least unsupervised manner that can we build an agency detector?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5520.941,
    "end": 5523.543,
    "text": "Can we build something that looks at a system and says,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5523.983,
    "end": 5536.091,
    "text": " I tell you what, if you assume this axis, this axis, and this axis, then I can paint you a really efficient search strategy that will allow you to predict what the system is going to do next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5536.412,
    "end": 5539.594,
    "text": "Because we could view this as problem solving in this space, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5539.814,
    "end": 5542.296,
    "text": "And maybe it generates a palette of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5543.376,
    "end": 5544.397,
    "text": " solutions like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5544.657,
    "end": 5546.397,
    "text": "And there's one that's head and shoulders above the others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5546.438,
    "end": 5548.859,
    "text": "And you say, fine, that's my scientific theory of what's going on here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5549.439,
    "end": 5551.56,
    "text": "And maybe that works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5551.66,
    "end": 5552.801,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5552.821,
    "end": 5555.382,
    "text": "So that's a research kind of agenda for the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5555.982,
    "end": 5565.787,
    "text": "And the other cool thing about that is if you do that, of course, one thing you might want to do is then build a more sophisticated",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5566.968,
    "end": 5574.18,
    "text": " synthetic intelligence by basically closing the loop and sticking that module inside the agent itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5574.2,
    "end": 5575.162,
    "text": "And here's why I'm saying that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5575.903,
    "end": 5580.571,
    "text": "All animals, I think, at least past a certain point,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5581.771,
    "end": 5583.392,
    "text": " certainly have agency detectors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5583.412,
    "end": 5597.122,
    "text": "This is why we love our visual systems, love symmetry and so on, because you really want to know, looking out into the world, you really want to know what are the passive elements and what are the other agents that might eat you, that you might communicate with, that you might convince them to do something else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5597.702,
    "end": 5600.084,
    "text": "So we are constantly estimating",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5600.724,
    "end": 5605.989,
    "text": " you know, theory of mind, right, and agency for all the things we're looking at, because that helps you get around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5606.029,
    "end": 5618.64,
    "text": "You need to know if it's a rock or if it's something that's just going to come eat you no matter what, or if it's a conspecific that you might actually lie to or, you know, have a relationship, or whatever you're going to do, some sort of complicated interaction, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5618.66,
    "end": 5619.64,
    "text": "So we're all trying to gauge that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5620.381,
    "end": 5626.006,
    "text": "And probably what one of the things that kind of module also does",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5626.897,
    "end": 5654.317,
    "text": " is turn inwards to tell you stories about yourself and the reason we know that exists is because of confabulation so just as a simple example as this is a modern they're older examples from the brain split brain studies but the modern example there's um there's somebody who's got an electrode and this was this is an actual experiment that was done he had epilepsy or something and they put an electrode in their brain in his brain and it happened to land in an area that when you stimulate it it stimulates laughter the person just starts laughing right",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5654.801,
    "end": 5664.964,
    "text": " So you're sitting there, so this person is sitting there talking to, you know, having a serious conversation with the doctor, somebody off-scene pushes the button, person starts laughing, the doctor says to him, why are you laughing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5665.565,
    "end": 5671.426,
    "text": "Zero percent of the time, the answer is, geez, I don't know, that was super weird, I was all serious, and suddenly my mouth starts laughing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5671.446,
    "end": 5672.447,
    "text": "That never happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5672.767,
    "end": 5678.649,
    "text": "What happens is the person says, oh, I came up with a funny story, and I was just thinking of a funny thing that happened, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5679.62,
    "end": 5688.425,
    "text": " What happens is, and this has been, you know, I'm not the first person to point this out, that we are massively unaware of lots of stuff that goes on in there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5689.006,
    "end": 5694.889,
    "text": "And we have a module, apparently, whose job it is to tell coherent stories about what that all adds up to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5695.504,
    "end": 5707.554,
    "text": " So not just turning outwards to see what kind of agents we see out there, but actually to look inwards and come up with plausible explanations that no, you're not an automaton because somebody pushed a button.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5707.954,
    "end": 5709.255,
    "text": "That's not a preferred explanation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5709.275,
    "end": 5713.459,
    "text": "The preferred explanation is you're an agent, you come up with funny stories, and sometimes they made you laugh.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5713.499,
    "end": 5714.399,
    "text": "That's a better explanation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5715.969,
    "end": 5737.912,
    "text": " So if we had such a thing, we could imagine already piece by piece starting to put this together into what might be a fairly sophisticated cognitive system that has a bit of metacognition and a bit of, much like all of us, sort of faulty access to what it is that we're doing and all these kinds of interesting things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5741.161,
    "end": 5741.421,
    "text": " Nice.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5742.181,
    "end": 5755.765,
    "text": "So I'm going to kind of take it back to this time-space cube because I just really can't wrap my mind around the fact that if you slice up the cube, I think about it like a confocal Z-stack.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5756.205,
    "end": 5757.826,
    "text": "So if you have a slice, that's the present.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5759.42,
    "end": 5764.627,
    "text": " If I can't change this slice, you can take a projection of the confocal image and look at the whole picture.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5764.647,
    "end": 5769.774,
    "text": "If I can't change this one slice, how is it that I'm going to change the future?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5770.175,
    "end": 5774.42,
    "text": "All the slices up until this point lead me to make this current existing slice.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5774.961,
    "end": 5778.143,
    "text": " And then do I can I change any point in the future?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5778.163,
    "end": 5781.925,
    "text": "I don't see how that's possible if I can't change the point in the present.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5781.985,
    "end": 5791.35,
    "text": "So are we just like I think about we had Shanna Dobson and Chris Fields on and we were talking about expressing, you know, compressing and expanding time and space and just",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5791.77,
    "end": 5793.411,
    "text": " time in all kinds of contexts.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5793.491,
    "end": 5796.293,
    "text": "Like, is it even a construct or how does it work?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5796.813,
    "end": 5799.175,
    "text": "And like non-Archimedean time and all that stuff.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5799.775,
    "end": 5812.303,
    "text": "So I don't know what, if you want to maybe unpack that a little bit for me, because I'm just not kind of seeing the possibility of this changing the future without being able to change the present.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5816.772,
    "end": 5818.433,
    "text": " Yeah, totally possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5818.533,
    "end": 5827.539,
    "text": "And so, for sure, I'm not going to try to make the argument that we have a mature theory of free will of that kind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5827.579,
    "end": 5828.14,
    "text": "I don't think we do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5828.42,
    "end": 5833.804,
    "text": "And I think you're absolutely right in that that is, in fact, a really critical point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5834.564,
    "end": 5837.146,
    "text": "If your freedom in each slice is zero,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5837.586,
    "end": 5863.553,
    "text": " then many times zero it's still zero right so totally totally true i i think we can make two moves and again this is this is super early i you know i'm not claiming this is in any way gonna survive uh you know careful careful thought into the future um i think we can make two shifts one shift is that i think it's uh again uh and then that you know i'm like a broken record with this stuff but but i think i think that binary um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5864.492,
    "end": 5868.335,
    "text": " This binary distinction between you have freedom or you do not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5868.635,
    "end": 5869.556,
    "text": "I think that's wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5869.636,
    "end": 5872.659,
    "text": "So I think what you have, it goes by amounts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5872.879,
    "end": 5878.904,
    "text": "So you may have very little, you know, if you're a mechanical clock, you have very little.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5879.484,
    "end": 5884.388,
    "text": "And if you're some other type of living thing, you may have more and then you may have more than that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5885.037,
    "end": 5902.464,
    "text": " So then what you have is, and this is super, super amateurish, but just to kind of visualize, what I see is the kind of addition that you get in calculus, where you start with extremely tiny things that are kind of zero, but not really, and eventually they add up to something, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5902.504,
    "end": 5903.424,
    "text": "That's how I see it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5903.744,
    "end": 5911.207,
    "text": "I think that what you have at each point is a teeny tiny amount, and if you look close, basically it's an epsilon that's not worth talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5911.247,
    "end": 5912.368,
    "text": "It's basically you don't have any.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5913.174,
    "end": 5914.515,
    "text": " But it isn't quite zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5914.695,
    "end": 5929.766,
    "text": "And over time, that mental effort, whatever that is that you put into, you know, working on your free will or on your kindness or whatever you're working on, over time, it integrates into an area, even though you're integrating infinitely thin strips.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5929.806,
    "end": 5935.75,
    "text": "Like, that's the vision that I have in my head, that if we just do away with the fact that it's actually zero, that I don't think it's actually zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5936.62,
    "end": 5956.236,
    "text": " then you can build up something over time and you can and you can magnify and if you know i'll say one more thing which if we're gonna if we're gonna abuse physics like this right which is i mean i realize this is all like completely informal and whatever if we're gonna abuse it um i'll make i'll make one more one more analogy if you think about what is the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5959.137,
    "end": 5961.119,
    "text": " What is a minimal level of agency?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5961.139,
    "end": 5967.485,
    "text": "So, so, so sometimes people ask me, like, well, is there a 0 on your on your continue?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5967.565,
    "end": 5967.705,
    "text": "Right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5967.725,
    "end": 5968.426,
    "text": "Is there an actual 0?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5968.546,
    "end": 5969.627,
    "text": "And like, what's the minimum?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5969.647,
    "end": 5970.508,
    "text": "What is the smallest?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5970.949,
    "end": 5971.389,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5971.89,
    "end": 5975.573,
    "text": "If you're going to pick, if you're going to design the absolute minimal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5976.054,
    "end": 5978.496,
    "text": "Piece that still has some non 0 agency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5978.536,
    "end": 5979.177,
    "text": "What does it need?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5979.217,
    "end": 5980.298,
    "text": "I feel like it needs 2 things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5981.186,
    "end": 5990.334,
    "text": " It needs some minimal amount of decision making that isn't obviously caused by local causes, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5990.534,
    "end": 6002.023,
    "text": "It needs at least something that reaches outward in terms of space or time or complexity or something that isn't obviously a locally determined necessity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6002.084,
    "end": 6002.604,
    "text": "That's one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6002.984,
    "end": 6008.389,
    "text": "And the second thing it needs is some amount of goal-directed activity, something that looks like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6009.189,
    "end": 6010.51,
    "text": " A goal directed activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6010.89,
    "end": 6017.074,
    "text": "So so once you've said that, it seems to me that that individual particles already have this right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6017.314,
    "end": 6021.797,
    "text": "Because because quantum indeterminacy gives you the 1st, 1 and least action principles give you the 2nd.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6021.997,
    "end": 6022.798,
    "text": "So you've already got that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6022.858,
    "end": 6030.082,
    "text": "And so now, when you so, so I think and again, this is amateurish as far as the physics goes, but my gut feeling is that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6030.794,
    "end": 6036.915,
    "text": " there isn't a zero, that you already start with some minimal amount, and now you can do one of two things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6036.935,
    "end": 6038.795,
    "text": "So you've got these particles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6039.576,
    "end": 6040.356,
    "text": "You can do one of two things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6040.376,
    "end": 6054.578,
    "text": "You can make a rock out of them, so you aggregate them in one way, which basically gets rid of all those nice properties, and it ends up having very low agency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6054.678,
    "end": 6058.779,
    "text": "It just aggregates all of it in a way that doesn't do anything useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6059.479,
    "end": 6067.306,
    "text": " Or if you're alive, you can amplify those properties and end up further down on the continuum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6067.626,
    "end": 6081.698,
    "text": "So that's kind of my fuzzy story at the moment is that I think we start off at non-zero, and then you can either stay there if you don't have the right organization, or you can amplify the hell out of it and get to be more agential.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6086.803,
    "end": 6087.063,
    "text": " Thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6087.243,
    "end": 6087.524,
    "text": "Thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6087.644,
    "end": 6090.966,
    "text": "I definitely think that non-zero is the right answer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6091.607,
    "end": 6101.595,
    "text": "So we've got maybe like 15 minutes left and, you know, I just, there's some closing thoughts, some room for some last minute questions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6102.475,
    "end": 6106.118,
    "text": "Sarah or Steven, do you have any last minute things you want to ask?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6109.001,
    "end": 6110.682,
    "text": "No, my head is sufficiently exploded.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6112.737,
    "end": 6118.543,
    "text": " Yeah, no, I think that was a nice... I mean, I think there's a lot to think about because we've covered an awful lot of territory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6118.663,
    "end": 6127.231,
    "text": "But I think it's... I was interested to see that you're bringing the thingness and I know Carl Friston talks about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6128.152,
    "end": 6132.736,
    "text": "So I suppose one last bit would be, would you call yourself...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6134.335,
    "end": 6147.721,
    "text": " a non-dual monist in the way that Carl sort of talks about that idea or is that something a bit different or maybe not even relevant in this context?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6148.101,
    "end": 6151.082,
    "text": "Yeah, that's a good question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6151.122,
    "end": 6155.104,
    "text": "So I hesitate to put a name on it for two reasons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6155.724,
    "end": 6156.404,
    "text": "Number one,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6158.217,
    "end": 6182.644,
    "text": " everything that we've talked about so far has been very much from a functional third person perspective so so we haven't really touched the the so-called hard problem of consciousness or what so in order and the thing is nothing that i've said touches this question of why is it like to be something that's one of these systems right so from that perspective",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6183.79,
    "end": 6192.836,
    "text": " assuming that we believe, I mean, some people, you know, we'll say that that's a non-problem and that there is no such thing and then whatever, but I, I'm not a hundred percent convinced of that actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6193.096,
    "end": 6199.721,
    "text": "And from, so, so, so there are that, that I do think there's a hard problem and I don't have anything that addresses it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6199.821,
    "end": 6204.584,
    "text": "And so, uh, I don't know, you know, what camp that puts me in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6204.624,
    "end": 6209.127,
    "text": "The other, the other thing is that, um, I have a lot of, um, sort of, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6211.351,
    "end": 6213.752,
    "text": " panpsychist sympathies in the following way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6214.413,
    "end": 6227.119,
    "text": "So I think that if you scale down... So one reason people don't like panpsychism is it means that you think that rocks have hopes and dreams like the rest of us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6227.379,
    "end": 6229.64,
    "text": "So that's obviously not what I'm saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6230.541,
    "end": 6239.385,
    "text": "The reason people go to that extreme is because they've scaled down the structures that are needed for agency, but they haven't scaled down the expectations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6240.124,
    "end": 6246.366,
    "text": " So yes, it's silly to think that rocks have the same hopes and dreams that we do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6246.726,
    "end": 6251.628,
    "text": "However, if you scale both sides of the equation, I'm not at all sure why.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6251.648,
    "end": 6256.529,
    "text": "Again, if you're not into binary classifications, it is conscious or it's not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6256.589,
    "end": 6257.85,
    "text": "That I think is definitely wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6258.19,
    "end": 6261.431,
    "text": "So if phenomenal consciousness is a kind of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6262.486,
    "end": 6292.146,
    "text": " continuum two i don't see any reason why there couldn't be a tiny bit of something that's super hard for us to imagine because we're used to a much a much bigger level of perception and consciousness that that isn't associated with a lot of other systems they'll be normally that you know that the people who normally work in cognitive science would never buy as as as as having consciousness so so so i have a lot of you know kind of sympathies on that front mainly because i don't buy this binary distinction um and we could talk about this actually interesting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6293.01,
    "end": 6321.37,
    "text": " i don't even i and i'll tell you why a lot basically um bioengineering and the kinds of things that are possible now are they they are really dissolving a lot of things that seem to be uh sharp categories before and i'm not even sure at this point that um the distinction between first person and third person knowledge is even sharp and and i'll just i'll just draw you a simple picture and i preface this by saying i'm i i made a picture of this and i sent it to a um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6322.04,
    "end": 6330.426,
    "text": " a well-known philosopher, and he said it was horrible and not useful, but we'll see what you think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6331.207,
    "end": 6343.136,
    "text": "Imagine that you're looking at, there's a brain and there's some electrophysiology being done, some electrodes stuck in there, and it's being processed, and you're on the outside, you're the scientist, you're on the outside, you're looking at that data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6344.337,
    "end": 6346.058,
    "text": "Uncontroversially third person, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6346.078,
    "end": 6348.1,
    "text": "You have no idea what it's like to be that subject.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6348.16,
    "end": 6350.522,
    "text": "You are studying some signals that come off of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6351.86,
    "end": 6371.711,
    "text": " Now, what we do is we change the scenario a little bit, and what we do is we take some of those interfaces that, you know, they have these interfaces for the blind that either go on your tongue or they go sometimes in your retina, but basically they turn camera signals into something that's directly plugged into your brain with electrodes, okay?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6372.272,
    "end": 6377.595,
    "text": "So now we take that setup, and instead of the camera, we plug it directly into the electrophysiology apparatus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6378.317,
    "end": 6386.918,
    "text": " So now what you're receiving is you're receiving a heavily processed signal, but it's coming directly from that brain into your brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6387.179,
    "end": 6393.42,
    "text": "And what's interesting is that people who use these kind of sensory augmentation devices, they will eventually report that it's just like seeing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6393.76,
    "end": 6395.62,
    "text": "They learn to get around like the electric lollipop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6395.64,
    "end": 6401.921,
    "text": "It's this thing you stick on your tongue, and it shocks your tongue in a way that maps onto the pixels of a camera, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6401.941,
    "end": 6403.081,
    "text": "And they say, oh, it's just like seeing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6404.862,
    "end": 6406.402,
    "text": "So, okay, so now you've moved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6406.462,
    "end": 6407.302,
    "text": "So, you know, it's like...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6409.584,
    "end": 6415.008,
    "text": " It's sort of, you know, third person, but, you know, it's maybe like 2.5 person or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6415.348,
    "end": 6416.789,
    "text": "And then you can do another experiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6416.849,
    "end": 6431.04,
    "text": "You can say, well, what we're going to do is instead of using all this, like, heavily, you know, all this electronics and processing in between, we're just going to connect the brains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6431.44,
    "end": 6432.821,
    "text": "And we can do this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6432.861,
    "end": 6438.205,
    "text": "And the reason we know we can do this is that there are conjoint twins whose brains are in fact connected.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6438.573,
    "end": 6444.462,
    "text": " so that there's no sort of clumsy electronic interface in the middle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6444.503,
    "end": 6445.724,
    "text": "The brains are directly connected.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6446.886,
    "end": 6452.315,
    "text": "And so now, he said, OK, so if my brain is now connected to this other person having the experience,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6452.887,
    "end": 6455.048,
    "text": " It's sort of, is that still third person?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6455.348,
    "end": 6460.909,
    "text": "And then you ask the question, yeah, but in your own brain, so some people say, ah, that's an aberrant, you know, that's an aberrant case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6461.289,
    "end": 6464.35,
    "text": "But in your own brain, you've got pieces of the brain that have to talk to each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6464.37,
    "end": 6466.85,
    "text": "You're not an indivisible monad of some type, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6466.87,
    "end": 6469.331,
    "text": "You are a bunch of pieces that also have to talk to each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6469.551,
    "end": 6471.171,
    "text": "So the left side has to talk to the right side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6471.231,
    "end": 6472.811,
    "text": "In fact, the front talks to the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6473.452,
    "end": 6476.832,
    "text": "You are anyway pieces of the brain having to talk to each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6477.413,
    "end": 6479.533,
    "text": "And somehow that ends up being first person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6480.188,
    "end": 6486.089,
    "text": " So now what we've just done is built a continuum where you can smoothly, and we can fill in anywhere between these two systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6486.149,
    "end": 6489.13,
    "text": "I can fill in as, you know, sort of finally as you want.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6489.51,
    "end": 6496.611,
    "text": "And you can smoothly move from first-person experience to third-person science because the bioengineering tells you that you can do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6497.131,
    "end": 6500.572,
    "text": "So I'm not even sure that's a, you know, I'm not even sure that's a distinction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6501.032,
    "end": 6504.072,
    "text": "So I, you know, it's hard to say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6504.472,
    "end": 6507.133,
    "text": "Anyway, that's a long-winded answer to your question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6509.318,
    "end": 6509.598,
    "text": " Wow.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6510.399,
    "end": 6512.72,
    "text": "I was going to ask one question, now I'm going to ask another one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6514.201,
    "end": 6534.434,
    "text": "This makes me think, you know, like related to core screening, related to layers and levels of different organisms, like it just, what you, the kind of example you just laid out, you know, makes me question whether you can even stratify in that way or whether it makes sense to stratify in that way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6536.118,
    "end": 6562.171,
    "text": " but let me go back to um something we didn't cover and and i i heard it on your podcast and um you ended with a question related to moral philosophy um or ethics i guess not even i don't know the distinction there but yeah um i mean when you know if you're coming from the perspective of not believing in a binary uh between",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6563.599,
    "end": 6567.182,
    "text": " You said it better than I did living, non-living, whatever, like agent versus not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6568.624,
    "end": 6570.566,
    "text": "And then you're making things like xenobots.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6570.706,
    "end": 6580.274,
    "text": "It's like that kind of if that's if you held those two views of not believing in the binary, then there it seems like there really wouldn't be an ethical question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6580.314,
    "end": 6582.917,
    "text": "And so I'm wondering where you're where you're thinking is along that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6583.621,
    "end": 6595.212,
    "text": " yeah no no i think i think there's definitely an ethical question uh and and i think it's not quite what we think it is but and i'll tell you what it is but let's just let's just take a step back so so long before anybody made xenobots",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6596.272,
    "end": 6598.315,
    "text": " We made humans, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6598.335,
    "end": 6599.196,
    "text": "The old fashioned way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6599.476,
    "end": 6603.26,
    "text": "And so this is like, you know, then it's a competence without comprehension, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6603.28,
    "end": 6604.602,
    "text": "So we have no idea how it worked.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6604.642,
    "end": 6607.565,
    "text": "But for, you know, hundreds of thousands of years, we made other humans.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6608.126,
    "end": 6615.795,
    "text": "And so we take care of them as best we can, most of the time, sometimes not really very well, you know, so we already did that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6616.235,
    "end": 6622.863,
    "text": " Then we make all sorts of animals in terms of food production and other things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6623.183,
    "end": 6627.188,
    "text": "We make hybrids, so we make mules that are animals that never existed before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6627.868,
    "end": 6630.191,
    "text": "We've made new plants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6630.471,
    "end": 6637.059,
    "text": "So the first thing that's really critical and often the reason I'm sort of sensitized to all this is that people always say,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6637.379,
    "end": 6643.342,
    "text": " oh my god, you're making Xenobots, it's a new, like, let's not forget what we've already been doing, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6643.442,
    "end": 6649.245,
    "text": "And let's be super clear that this is a massive problem with the food industry, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6649.285,
    "end": 6652.947,
    "text": "Long before we get to worrying about Xenobots, there's all kinds of things that we need to fix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6653.007,
    "end": 6662.112,
    "text": "So I just want to be, you know, I kind of want to be clear that we've already been making animals and, in fact, other humans for which we sometimes take good responsibility and sometimes we don't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6663.425,
    "end": 6669.367,
    "text": " I think this absolutely raises an ethical problem, and the ethical problem is the following.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6670.227,
    "end": 6683.211,
    "text": "When we go to synthetic biology and bioengineering kinds of seminars, there's usually now a session that's about ethics, and the session goes like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6683.631,
    "end": 6687.112,
    "text": "Somebody will show a brain organoid made of human cells,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6687.712,
    "end": 6691.233,
    "text": " And someone will say, oh, my God, that you shouldn't be doing that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6691.674,
    "end": 6695.815,
    "text": "And somebody else will say, well, let's just see how much like a human brain it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6696.095,
    "end": 6702.098,
    "text": "And then people spend a couple hours arguing about whether it is or is not enough like a human brain that they need to worry about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6702.318,
    "end": 6705.399,
    "text": "And maybe they end up saying it's fine or maybe they end up saying it's not fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6706.219,
    "end": 6716.263,
    "text": "I think the much bigger issue is that whether or not something looks anything like a human brain is a very poor guide to how much you need to worry about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6716.855,
    "end": 6727.37,
    "text": " And in the past, the way that we would figure out whether or not how much moral responsibility we have for a particular system went roughly like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6728.111,
    "end": 6733.839,
    "text": "You would sort of look at it and if it was squishy and warm",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6735.623,
    "end": 6736.564,
    "text": " you would say, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6736.884,
    "end": 6741.728,
    "text": "And if it was metallic and, you know, and it came from an assembly line, you'd say, do what you want.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6741.768,
    "end": 6742.208,
    "text": "No problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6742.248,
    "end": 6742.428,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6742.769,
    "end": 6745.891,
    "text": "So, so two, two things used to be a guide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6745.931,
    "end": 6752.656,
    "text": "And even that we didn't do so well, we can obviously with those principles, but, but, but two things that used to be a guide were, where did it come from?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6752.816,
    "end": 6754.518,
    "text": "Did it evolve or was it designed?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6755.218,
    "end": 6756.719,
    "text": "And what is it, what is it made of?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6757.34,
    "end": 6759.842,
    "text": "And, and it was a, and that was pretty good, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6759.882,
    "end": 6760.122,
    "text": "You could,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6761.745,
    "end": 6768.827,
    "text": " Because if it was evolved, you could look on the tree of life and you could say, it's a worm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6769.227,
    "end": 6771.468,
    "text": "We don't need to fill out any forms when we do these experiments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6771.628,
    "end": 6773.168,
    "text": "Or you could say, it's a frog.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6773.188,
    "end": 6775.829,
    "text": "I need to fill out a lot of forms before we can do experiments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6776.029,
    "end": 6778.33,
    "text": "Then that's, in fact, how it works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6778.79,
    "end": 6784.551,
    "text": "Because you know something about that lineage and you make some sort of guesses about where things are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6784.591,
    "end": 6787.372,
    "text": "And then if it's an octopus, people really don't know what to do and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6788.524,
    "end": 6791.568,
    "text": " all of that is going completely out the window, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6791.728,
    "end": 6799.959,
    "text": "So in the next, I don't know, couple of decades, we are going to be surrounded by, and this is another thing that I'm writing on,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6800.763,
    "end": 6802.624,
    "text": " the option space of possible creatures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6802.684,
    "end": 6806.285,
    "text": "We're talking about hybrids, cyborgs, hybrids.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6806.305,
    "end": 6816.028,
    "text": "There's a million different ways to recombine evolved, designed, living, non-living, and software agents into new forms that have never existed before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6816.428,
    "end": 6821.19,
    "text": "So what something looks like is no guide to what the cognition is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6821.47,
    "end": 6828.332,
    "text": "Where it came from, meaning evolved or designed, is going to be a bad question because half of the stuff we're building with is now evolved and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6829.769,
    "end": 6834.311,
    "text": " All of the things, you know, it's just a machine versus, oh, but you know, it's a nice mammal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6834.611,
    "end": 6835.972,
    "text": "All of that stuff is gonna go out the window.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6836.252,
    "end": 6842.176,
    "text": "So to me, the ethical problem is much bigger than just asking about whether something's like a human brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6843.036,
    "end": 6844.317,
    "text": "What we really are going to need",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6844.837,
    "end": 6856.923,
    "text": " is a new ethical system for learning how to deal with agents that look nothing like us and that don't look like anything we've ever seen before and yet are going to have all sorts of cognitive capacities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6857.523,
    "end": 6864.587,
    "text": "And we have to let go of categories like machine, like robot, like all these other things that really don't mean anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6865.367,
    "end": 6867.628,
    "text": "They never did before, but it was fine in the past.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6867.668,
    "end": 6869.229,
    "text": "It's no longer going to be useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6870.75,
    "end": 6872.411,
    "text": "And that's the ethical problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6876.047,
    "end": 6894.82,
    "text": " wow uh so great so i'm gonna go stare at a wall and try to integrate this information uh it was a lot um thank you so much for coming on thank you so much yeah this was really fun yeah great great great discussion thank you so much thanks bye",
    "speaker": "SPEAKER_04"
  }
]