[
  {
    "start": 8.257,
    "end": 13.301,
    "text": " Hello everyone, welcome to ActInflab live stream number 25.1.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 13.822,
    "end": 26.732,
    "text": "Today is July 6th, 2021, and we're going to be talking about the paper, The Computational Boundary of a Self, Developmental Bioelectricity Drives Multicellularity and Scale-Free Cognition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 28.396,
    "end": 34.881,
    "text": " We are a participatory and online lab that is communicating learning and practicing applied active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 35.381,
    "end": 37.542,
    "text": "You can find us at the links here on this page.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 37.963,
    "end": 43.867,
    "text": "This is a recorded and archived live stream, so please provide us with feedback so that we can improve our work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 44.487,
    "end": 47.309,
    "text": "All backgrounds and perspectives are welcome here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 48.09,
    "end": 50.932,
    "text": "We will be following good video etiquette for live streams.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 52.162,
    "end": 60.086,
    "text": " Here at the short link, you will see all of the live streams and different series that we've done leading up to this in the communications unit of the Active Inference Lab.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 60.746,
    "end": 66.969,
    "text": "And today we're going to be jumping into the first half of a discussion of the paper in July.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 67.169,
    "end": 74.152,
    "text": "And on the 13th, we will have 25.2, which is also on this paper and hopefully with the author joining.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 75.768,
    "end": 83.554,
    "text": " Today in ACT-INF Lab live stream number 25.1, we're going to be learning and discussing this paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 84.655,
    "end": 87.377,
    "text": "So I will pass it off.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 87.577,
    "end": 96.304,
    "text": "I'm Blue, and I am an independent research consultant based out of New Mexico, and I will pass it to Stephen for a quick round of introductions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 98.527,
    "end": 99.007,
    "text": " Thanks, Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 99.027,
    "end": 100.789,
    "text": "Hi, so this is Stephen here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 100.809,
    "end": 102.19,
    "text": "I'm based in Toronto.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 102.21,
    "end": 113.059,
    "text": "I'm doing a practice-based PhD, and I'm interested in how active inference can help unify lots of threads that have been very confusing to me over the last few years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 113.499,
    "end": 117.662,
    "text": "And if it's okay, I'm going to throw this over to Dave Douglas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 119.264,
    "end": 119.824,
    "text": "Yes, hi.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 119.924,
    "end": 121.886,
    "text": "I'm in the Philippines, up in the mountains.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 122.346,
    "end": 127.05,
    "text": "The rainy season has begun, and we just survived the 4th of July, so all is good.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 129.436,
    "end": 130.457,
    "text": " Back to Dan, I guess.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 131.398,
    "end": 131.678,
    "text": "Thanks.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 132.479,
    "end": 132.999,
    "text": "I'm Daniel.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 133.219,
    "end": 134.36,
    "text": "I'm in Davis.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 134.72,
    "end": 137.903,
    "text": "And yep, looking forward to this point one discussion.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 138.803,
    "end": 142.186,
    "text": "And also, nice job with the broadcasting and facilitating, Blue.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 142.806,
    "end": 143.067,
    "text": "Thanks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 144.588,
    "end": 154.075,
    "text": "So we can just start off with just some questions about what you liked about the paper or what was something you remembered or something that you're curious about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 162.898,
    "end": 167.22,
    "text": " Well, I am embarrassed to say I didn't read it at all.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 167.48,
    "end": 172.762,
    "text": "And I was, you know, I started looking over and I said, oh my goodness, we're going to talk about Wilhelm Reich.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 173.002,
    "end": 178.744,
    "text": "We're going to talk about organs and orgasms and cloudbusters and living flying saucers.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 178.804,
    "end": 180.645,
    "text": "And I guess we're not going to get any of that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 180.745,
    "end": 182.266,
    "text": "So I don't know.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 187.968,
    "end": 188.228,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 188.408,
    "end": 190.549,
    "text": "Well, the aims and claims of the paper, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 191.821,
    "end": 207.11,
    "text": " So here, the paper, the author says the aims were to define individuals and selves in a way that facilitates taxonomy, comparison and communication with evolved, created biological, artificial and exobiological agents.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 207.99,
    "end": 212.593,
    "text": "And he proposes a fundamental definition of an individual based on the ability to pursue goals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 213.228,
    "end": 222.601,
    "text": " at an appropriate level of scale and organization and suggests a formalism for defining and comparing the cognitive capacities of highly diverse types of agents.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 225.325,
    "end": 226.507,
    "text": "What does anybody think about that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 233.344,
    "end": 245.922,
    "text": " I think that the multi-scale part of this is very, very interesting, very exciting, because this is one of the big offerings that Active Influence has, and it's been offered in a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 247.225,
    "end": 268.101,
    "text": " a lot of simulations in silico context, but to have it actually described from a real biological kind of cellular perspective and is, uh, for me really, really useful because I'm kind of looking partly at how the heuristics of all this are as much as the, you know, the mathematics of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 268.241,
    "end": 270.522,
    "text": "So, yeah, I think that's really, really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 272.063,
    "end": 272.384,
    "text": "Cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 272.464,
    "end": 272.744,
    "text": "Daniel.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 274.861,
    "end": 280.325,
    "text": " I liked the part about taxonomy because that kind of speaks to this evolutionary worldview.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 280.786,
    "end": 294.977,
    "text": "And it always seemed interesting to me studying collective behavior, like in the ants, that there were really precise ways of talking about comparing some physical properties in biosystems, like how hard is the material or its density.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 295.498,
    "end": 300.562,
    "text": "And then there was less of a way to talk about similarities in cognitive processes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 302.315,
    "end": 306.096,
    "text": " whether on an organism or how they interacted with their niche, especially.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 306.536,
    "end": 318.999,
    "text": "So just the idea that there could be a new sort of tool in the toolbox to help us compare different cognitive systems that might have hybrid aspects like computer and human or agent and niche.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 319.039,
    "end": 320.739,
    "text": "Those are kind of cool areas to explore.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 320.779,
    "end": 323.06,
    "text": "So I think that's a big topic.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 329.505,
    "end": 341.23,
    "text": " Definitely like the other maybe like comparison of like cognitive capacities isn't really related to cognition, but it's integrated information theory, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 341.35,
    "end": 358.577,
    "text": "So, you know, when you can compare like the consciousness of a slime mold versus the consciousness of a human, this kind of stands alongside of that in terms of, you know, being able to, to maybe not quantitatively yet, but hopefully, you know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 359.264,
    "end": 364.307,
    "text": " people will run with this and to be able to apply some quantitative methods to that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 366.448,
    "end": 366.928,
    "text": "Uh, cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 367.468,
    "end": 383.236,
    "text": "So he, the author also proposes a plausible naturalistic framework for the evolutionary scale up of cognition from the earliest origins of life and hypothesizes about the forces that drove it and the major transitions along the continuum.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 384.244,
    "end": 390.746,
    "text": " Uh, and the goal is to show how complex agency and goal-directedness evolves naturally from ancient mechanisms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 394.787,
    "end": 400.728,
    "text": "Uh, so some questions, how do multiple nested scales of individuality work?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 402.369,
    "end": 403.689,
    "text": "Uh, that's super interesting to me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 403.909,
    "end": 404.329,
    "text": "Let's see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 406.07,
    "end": 407.11,
    "text": "Um, Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 408.274,
    "end": 414.829,
    "text": " Yeah, well, I wrote the question, so maybe I'll ask or bring up why I thought it was interesting.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 416.385,
    "end": 427.131,
    "text": " Is there a total value of cognition in the full stack here, the full cone, and then there's going to be certain levels that are more relevant than others?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 427.912,
    "end": 438.478,
    "text": "Is there a total amount of individuality, or are there just certain ways that the cones, for example, don't overlap?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 439.358,
    "end": 443.801,
    "text": " Like there's certain spaces almost that are implied that are more than the sum of the parts.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 444.421,
    "end": 450.305,
    "text": "And so how are we going to even just first draw it out?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 451.105,
    "end": 451.605,
    "text": "Think about it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 456.689,
    "end": 465.034,
    "text": "Actually, one thing that comes to mind when you talk about the sum of the parts, I think what I'm interested by when he talks about a cell,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 465.95,
    "end": 474.652,
    "text": " And then he talks about these groups of cells and how they are sort of joined and there's this kind of bioelectric dynamic that sort of helps them communicate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 474.752,
    "end": 493.657,
    "text": "I think that's a really, making a bit of a jump here, but I think it's interesting to the difference between people communicating in a community context where there's this kind of resonance going on between people and what it's like when there's just separate entities",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 494.719,
    "end": 497.021,
    "text": " sending messages to each other, so to speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 498.202,
    "end": 513.254,
    "text": "There's something about this ability to form some sort of bioelectric dynamic, which I think is in itself quite interesting as a heuristic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 519.258,
    "end": 519.819,
    "text": "Yeah, for sure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 519.839,
    "end": 520.119,
    "text": "Daniel?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 521.42,
    "end": 521.72,
    "text": " Agreed.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 521.74,
    "end": 534.505,
    "text": "We're going to go to bioelectricity soon because I think with the author visiting next week, it'll be good to get some of these notions that we're having about where bioelectricity plays a role.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 535.325,
    "end": 536.186,
    "text": "Those are some of the...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 536.986,
    "end": 558.363,
    "text": " big theoretical questions like what is individuality across levels is it informational is it evolutionary is it functional all these questions about like holism and reductionism more than the sum of our parts what is collective behavior what is emergence there's that whole body of thinking and then the piece that's tying it all together is the bioelectric",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 559.304,
    "end": 573.81,
    "text": " And there's a few reasons why, in the paper, that is being proposed as important, like the primacy or the primitiveness, and also just the signaling dynamics and what it appears to allow cells to be able to do.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 574.13,
    "end": 575.291,
    "text": "But we can explore that later.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 575.691,
    "end": 577.512,
    "text": "So agreed.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 577.592,
    "end": 586.776,
    "text": "How is bioelectricity supporting this broader story about multi-scale systems, which just by drawing it out this way doesn't imply bioelectricity?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 587.938,
    "end": 590.542,
    "text": " So where's bioelectricity coming into the picture?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 590.563,
    "end": 593.407,
    "text": "We'll keep thinking about that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 594.509,
    "end": 595.33,
    "text": "Yeah, absolutely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 595.451,
    "end": 597.174,
    "text": "We'll talk about that later, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 597.414,
    "end": 599.197,
    "text": "And it's something that I don't think...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 600.151,
    "end": 606.175,
    "text": " And correct me if I'm wrong, other papers on active inference have not tended to come at that aspect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 607.096,
    "end": 613.28,
    "text": "They've tended to come at it from a in silico kind of statistical state-based process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 613.8,
    "end": 620.985,
    "text": "So this does give something that's a bit more organic, I suppose, potentially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 621.225,
    "end": 626.508,
    "text": "So I think that maybe there's much more that can be drawn from that going forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 626.548,
    "end": 627.229,
    "text": "So thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 630.051,
    "end": 639.714,
    "text": " Yeah, I think the, you know, people have done more organic stuff, but it's always like even related to bioelectricity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 639.874,
    "end": 650.698,
    "text": "But I think it's always related to neural bioelectricity as opposed to non-neural bioelectricity, which is what kind of drives this paper forward.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 651.258,
    "end": 656.74,
    "text": "And, you know, of course, there's a relationship between bioelectricity and the homeostatic drive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 657.423,
    "end": 671.748,
    "text": " which, um, the author talks about as driving the major evolutionary transitions and, you know, probably much of what we do, much of how organisms think and behave is driven by, you know, that, that drive for, uh, homeostasis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 677.91,
    "end": 680.07,
    "text": "So, uh, more questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 680.17,
    "end": 685.392,
    "text": "What do we learn or enable when we understand multi-scale individuality?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 689.463,
    "end": 689.784,
    "text": " Daniel?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 691.748,
    "end": 698.483,
    "text": "Maybe one way to frame what we could learn or enable here would be like in a read and write with respect to",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 700.029,
    "end": 703.011,
    "text": " designing new kinds of multi-scale systems.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 703.031,
    "end": 711.278,
    "text": "That's like the right, and then to look around and discover the kinds of multi-scale systems that we're already interested in with like reading.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 711.798,
    "end": 724.788,
    "text": "So it's kind of, there's an interpretive ability when we can look across multi-scale systems, but then also within a virtual machine or within some sort of physical system, there's ways to just",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 725.689,
    "end": 738.018,
    "text": " design systems that have certain kinds of relationships between the parts and the holes, like a governance system where such and such a distribution of, of, uh, influence exists or something like that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 739.8,
    "end": 742.642,
    "text": "Steven Steven.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 746.491,
    "end": 752.037,
    "text": " One area that's been of interest, and I think this can relate to, is an area called mental space psychology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 752.057,
    "end": 759.124,
    "text": "They've been looking at peripersonal neurons, the mirror neurons, as people talk about them as well, and how they resonate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 759.524,
    "end": 760.225,
    "text": "And I think that...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 761.912,
    "end": 776.425,
    "text": " this that ability to get that dynamic relationship between people or with objects in our shared model and the ability for these to see that there's some sort of resonance in terms of how things relate to others in space",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 777.31,
    "end": 793.966,
    "text": " that that seems to tie into what you were saying about the bioelectrics of um neurons tying into being sort of related to this and ties into that ability for maybe us to re or reconnect some of these um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 796.188,
    "end": 817.61,
    "text": " influence processes um across distance you know because obviously the cells they're touching each other there's a plausible route but how do we maybe get some of these resonances between cells which are not touching each other or even organisms which are not touching each other or maybe they need to touch and that gets us into intimacy and stuff but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 819.341,
    "end": 820.062,
    "text": " Yeah, good point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 820.642,
    "end": 841.079,
    "text": "So I just pulled up this slide talking about gap junctions, which these are little holes that enable the proximal cells to share information, essentially, about their environment or their intracellular state of existence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 842.0,
    "end": 844.342,
    "text": "And that's a cool way for",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 846.411,
    "end": 848.853,
    "text": " It facilitates the informational spread.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 848.873,
    "end": 851.935,
    "text": "And we see that in the figure also.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 852.135,
    "end": 852.555,
    "text": "Let's see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 852.575,
    "end": 853.756,
    "text": "Let's come to that figure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 853.776,
    "end": 858.959,
    "text": "Is it this one?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 859.85,
    "end": 860.37,
    "text": " Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 861.171,
    "end": 876.038,
    "text": "So that gives you like, you know, if there was a boundary, like a solid boundary, or maybe even a lipid bilayer that didn't have a little hole in it connecting cells, then there would just be the individual spatial perception that's shown here in figure three.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 876.843,
    "end": 883.187,
    "text": " But because of the gap junctions, a cell communicates to all the proximal cells.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 884.007,
    "end": 889.21,
    "text": "And this expands the spatial perception and the memory and the anticipation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 889.35,
    "end": 892.112,
    "text": "And so it's like this group integration here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 893.052,
    "end": 893.333,
    "text": "Dave?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 896.174,
    "end": 904.299,
    "text": "Yeah, going even farther into field effects, I heard a presentation by some students in China",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 904.962,
    "end": 908.115,
    "text": " recently who were tracking down non",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 913.593,
    "end": 924.716,
    "text": " tracking down electrical effects in mammalian nervous systems that didn't, that were not confined to local chemical and electrical effects.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 924.796,
    "end": 927.077,
    "text": "So they didn't even need to use the pores.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 927.097,
    "end": 929.738,
    "text": "They said, this is not dominant, but it's there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 930.018,
    "end": 938.061,
    "text": "And under certain circumstances, it does become pretty important, like in long-term potentiation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 938.401,
    "end": 942.662,
    "text": "They're saying that's part of what's going on, that you get these standing waves of,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 943.211,
    "end": 959.628,
    "text": " And they're conjecturing that part of the classic brain waves literally are waves in the brain rather than a summation of these local synaptic jumps.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 961.09,
    "end": 961.31,
    "text": "Dunno.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 961.33,
    "end": 961.45,
    "text": "Daniel?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 961.47,
    "end": 963.132,
    "text": "Oh, Daniel?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 964.634,
    "end": 964.914,
    "text": "Daniel?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 966.343,
    "end": 992.593,
    "text": " Yeah, just one comment on what Dave just said there about these kind of traveling fields that is really related to Kristen and collaborators work with SPM, which was basically a toolkit for looking at dynamical systems and then integrating imaging based modalities for like neuroimaging and with the field based measurements like EEG.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 993.234,
    "end": 993.674,
    "text": "So kind of.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 994.494,
    "end": 1008.888,
    "text": " taking a certain anatomical shape into account when you are integrating these different projections or different modeling ways of kind of two different perspectives on the same underlying system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1010.009,
    "end": 1014.833,
    "text": "So that's kind of an interesting link that you just made there.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1016.075,
    "end": 1017.616,
    "text": "Yeah, it's hard to underestimate",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1019.881,
    "end": 1042.015,
    "text": " the importance of Professor Friston's enormous amount of hands-on work with interpreting brain, direct physical brain data, and how important that is in just implicitly shaping how he approaches these system activities and system effects.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1042.816,
    "end": 1043.296,
    "text": "Yeah, I keep",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1043.769,
    "end": 1047.451,
    "text": " I keep slapping myself, wait a minute, what does this guy spend the last 40 years doing?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1047.911,
    "end": 1052.954,
    "text": "Don't get stuck in the peculiarities of the mathematical descriptions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1052.994,
    "end": 1055.776,
    "text": "He has a real reason for doing this stuff that way.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1057.937,
    "end": 1058.257,
    "text": "Daniel?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1062.82,
    "end": 1063.54,
    "text": "You go first, Stephen.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1063.861,
    "end": 1064.241,
    "text": "Oh, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1064.261,
    "end": 1064.741,
    "text": "Yeah, sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1065.001,
    "end": 1065.742,
    "text": "Well, I suppose...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1066.84,
    "end": 1077.827,
    "text": " being a bit speculative here, but with the brainwaves in the way that we've got this bioelectrics on the cell, I mean, different scales of, I think this is an open question, but it certainly seems to have plausible",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1078.795,
    "end": 1094.128,
    "text": " routes to being thought about is how much of these brain waves or this electrical activity across regions of the brain analogous or in some way similar to the descriptions at the cellular and multicellular level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1094.889,
    "end": 1097.811,
    "text": "So I think that's a good point that Dave brings up there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1100.493,
    "end": 1100.774,
    "text": "Thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1100.934,
    "end": 1101.174,
    "text": "Daniel?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1102.526,
    "end": 1104.347,
    "text": " Yep, great point, Stephen.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1104.407,
    "end": 1115.135,
    "text": "And that's one of the main, I think, arguments or the ways that the field or understanding of biology would sort of shift if bioelectric were given a larger role.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1115.635,
    "end": 1117.396,
    "text": "There'd be more of a continuum of",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1118.376,
    "end": 1138.346,
    "text": " chemical and electrical function between internal nervous systems and the epithelial cells which like we talked about in the dot zero are closely related through development and other cell types and seeing that as more of a unifying framework within an organism's cognition as well as",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1139.366,
    "end": 1158.249,
    "text": " in an evolutionary sense like all these different affordances that the bioelectric reconfiguration allows for which is some of the work that's cited in the paper and has continued since then is just empirical demonstrations that the bioelectric field can like lead to different morphologies and so",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1159.23,
    "end": 1174.901,
    "text": " then there's kind of a way to move on that phenotype landscape that doesn't involve like only the sequence based remodeling of gene regulatory networks, like transcription factor binding site evolution could still be important.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1175.662,
    "end": 1184.308,
    "text": "And also, there could be certain points where the bioelectricity enables new things to new phenotypes to change as well.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1187.005,
    "end": 1187.665,
    "text": " Yeah, definitely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1187.785,
    "end": 1199.691,
    "text": "And maybe a little bit in this paper, but a lot of Mike's work is really great talking about or demonstrating the role of bioelectricity in shape.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1200.252,
    "end": 1206.735,
    "text": "And when you think about the form and the function are just coupled together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1207.135,
    "end": 1213.679,
    "text": "So the function of a cell and the shape of a cell and all of that is really...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1215.293,
    "end": 1221.104,
    "text": " interesting and how bioelectricity is connected to the form and the function.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1222.005,
    "end": 1222.246,
    "text": "Steven?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1224.232,
    "end": 1237.502,
    "text": " Yeah, and I think this also gives reason to look at some other people who presented, such as the work on quantum contextuality that we had and some of the information geometry work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1238.142,
    "end": 1245.567,
    "text": "And there's the new paper on Bayesian mechanics and active inference, this whole idea of the shape of information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1246.408,
    "end": 1252.551,
    "text": " which I mean, that is very cutting edge, but I think they, they don't seem incompatible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1252.791,
    "end": 1253.591,
    "text": "Let's put it like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1253.891,
    "end": 1262.595,
    "text": "I don't want to put my name to how they're compatible exactly, but there's certainly seems to be an awful lot of things here that would suggest a plausible connection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1265.717,
    "end": 1266.197,
    "text": "Definitely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1266.217,
    "end": 1268.878,
    "text": "Uh, Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1269.138,
    "end": 1270.179,
    "text": "Oh, Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1271.846,
    "end": 1294.744,
    "text": " So one other aspect, there's the extended spatial, that's this horizontal representation where whether it's the bacteria that are aggregating in the biofilm or the development of the embryo or whatever extended spatial system, maybe even like networks of computers or something like that, that's extended spatial extent in the snapshot.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1295.245,
    "end": 1298.007,
    "text": "And then there's also this blue going down",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1298.687,
    "end": 1310.054,
    "text": " visualization here like with memory fading off into the past and then also the green like the anticipation so that's the current state anticipating out forward so just kind of",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1311.118,
    "end": 1324.207,
    "text": " Using a visualization of space going out and time as this axis that goes through the current moment, that turns out to be something that visualizes the past, present, and future really nicely.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1324.727,
    "end": 1338.257,
    "text": "But then also, like we saw with the light cones and probably other approaches, it sets up the integration of memory, action in the moment, and anticipation in a way that's almost set up to be addressed",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1338.857,
    "end": 1345.28,
    "text": " with a commonality rather than a future-oriented framework that has to bolt on this memory module.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1345.3,
    "end": 1349.881,
    "text": "It doesn't really make sense, but this is a more integrated way to think about the past, present, and future.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1351.742,
    "end": 1352.002,
    "text": "Nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1352.762,
    "end": 1353.063,
    "text": "Stephen?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1354.203,
    "end": 1356.584,
    "text": "Yeah, thanks, Daniel, for bringing that up, actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1356.604,
    "end": 1357.684,
    "text": "That's really helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1357.824,
    "end": 1361.166,
    "text": "And one thing I find curious as well is even though we're talking about cells,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1362.076,
    "end": 1367.858,
    "text": " we think about how that diagram puts the future up and the past down, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1367.898,
    "end": 1380.183,
    "text": "As we think about, could have done it the other way, but that's naturally how we look up and the air, you know, to see things and things go down and a bit more in the earth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1380.363,
    "end": 1382.203,
    "text": "And that's where our history is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1382.283,
    "end": 1387.986,
    "text": "So even though it probably was not conscious, that would have just felt like the right way to design the diagram.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1388.026,
    "end": 1388.546,
    "text": "You see how,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1390.127,
    "end": 1393.351,
    "text": " you know, the way we make our meaning is embodied as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1393.411,
    "end": 1396.655,
    "text": "The way we make our diagrams is in ways embodied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1396.675,
    "end": 1400.04,
    "text": "Yeah, nice.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1400.1,
    "end": 1400.58,
    "text": "Definitely.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1400.64,
    "end": 1400.941,
    "text": "Daniel?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1402.113,
    "end": 1411.682,
    "text": " So that Steven, that kind of whether something's pointing up or down, it reminds me of in evolutionary biology where some subfields would have a tree that branched up.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1411.862,
    "end": 1415.005,
    "text": "So it looked like a tree, other fields would show it branching down.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1415.085,
    "end": 1423.253,
    "text": "And then there was like apparently disciplinary like debates over which rotation of the same information it quote really was.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1423.333,
    "end": 1425.535,
    "text": "Is it a tree or is it something else?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1425.935,
    "end": 1426.716,
    "text": "But then that,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1427.897,
    "end": 1451.566,
    "text": " was related to a question that i just had about the visualization so it's cool that these panels were kind of maybe something we can ask about next week they seem to be made like in collaboration with an artist so that sounded like something kind of interesting to have in a scientific paper it helps it be more discussable sometimes but maybe there's a learning experience for",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1452.446,
    "end": 1478.113,
    "text": " the people involved and then also just like it's pretty easy to visualize the chemical part like we have these beautiful you know walking protein visualizations kind of like okay proteins kind of look like that and they bump into each other but then how will we visualize the role of the bioelectric reading scott nice to have you how will we visualize that um",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1479.665,
    "end": 1486.71,
    "text": " in new ways, maybe by integrating the future and the past into it, or I don't know, maybe there's some other way like the diamonds that we saw.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1486.73,
    "end": 1487.41,
    "text": "So, yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1487.97,
    "end": 1491.372,
    "text": "Yeah, I think that's a really good question to ask actually, because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1492.435,
    "end": 1497.8,
    "text": " Yeah, I work quite a lot in graphic studios where they do different types of diagrams for different things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1497.86,
    "end": 1501.583,
    "text": "And I think there's a lot of stuff that conventions that are out there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1501.683,
    "end": 1507.008,
    "text": "So they must have had to also bring in and sort of make it make sense in the scientific paradigm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1507.048,
    "end": 1512.492,
    "text": "But I do like the way that they've used the term perception there and brought that in for a cell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1512.512,
    "end": 1518.637,
    "text": "And I think that's, again, unusual, but makes sense if we think of perception in a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1519.659,
    "end": 1528.843,
    "text": " a much more deflationary sense than how people traditionally think about perception and active inference as well as just some sort of way of knowing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1528.864,
    "end": 1535.387,
    "text": "So I really, and again, that also starts to bring in like cells when we think about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1536.573,
    "end": 1537.553,
    "text": " What is the meaning?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1538.094,
    "end": 1539.234,
    "text": "That's not how a cell is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1540.034,
    "end": 1541.895,
    "text": "Cells could have a sense of knowing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1542.135,
    "end": 1548.658,
    "text": "And there could be 100 billion cells knowing, which is pretty much what indigenous knowledge says about knowing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1549.238,
    "end": 1554.4,
    "text": "So it ties in with that regime of knowing, which is often minimalized and excluded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1554.62,
    "end": 1556.381,
    "text": "So I think this is quite useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1557.731,
    "end": 1557.951,
    "text": " Nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1558.071,
    "end": 1562.896,
    "text": "And just kind of to talk about like different renditions of like the light cone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1562.956,
    "end": 1566.039,
    "text": "I mean, this is a question that I definitely have for the author.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1566.059,
    "end": 1571.484,
    "text": "Here, this is like not the traditional way that I'm used to seeing a light cone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1571.604,
    "end": 1574.046,
    "text": "So this in this slide, you can kind of see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1574.446,
    "end": 1603.23,
    "text": " how it's more of like a conical shape as opposed to like a diamond and like in space and time and even like so this is up and down but you know there's also this rendition that I've seen as well that's left and right so like from the from the state of right now to the future and so it's interesting to think about why is the space and time bigger in the present and going to a more narrow",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1604.042,
    "end": 1604.882,
    "text": " point in the future.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1605.102,
    "end": 1610.805,
    "text": "Like, for me, that's kind of not how I'm used to conceptualizing these diagrams.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1610.945,
    "end": 1615.967,
    "text": "So I think about the space of right now, like, I can't do anything other than what I'm doing right at this moment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1616.427,
    "end": 1623.049,
    "text": "But, you know, potentially, as time goes on, my state space gets bigger, if that makes sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1623.81,
    "end": 1624.63,
    "text": "Potential state space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1624.91,
    "end": 1628.653,
    "text": " Yeah, I mean, I really like that as well because the thing is it's interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1628.673,
    "end": 1636.818,
    "text": "That cone is very popular in the strategic foresight field of looking at futures and strategic futures work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1637.238,
    "end": 1642.342,
    "text": "But there is a slight, like when it's done as a cone going into the future, it's very visual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1642.442,
    "end": 1648.145,
    "text": "It's like using the analogy of a beam of light effectively, again, using one modality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1648.666,
    "end": 1653.129,
    "text": "And it assumes it kind of travels in a straight line and it projects and it's,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1653.809,
    "end": 1662.498,
    "text": " Whereas when you start to get into this nonlinear swarming type thing, I mean, in some ways, you just see what rises up in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1662.658,
    "end": 1663.058,
    "text": "You know what I mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1663.078,
    "end": 1666.021,
    "text": "It's like what structures emerge into the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1667.323,
    "end": 1671.006,
    "text": "They don't project into the future in the way that a lot of strategic foresight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1671.026,
    "end": 1671.927,
    "text": "So I think this does...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1673.018,
    "end": 1691.102,
    "text": " That question about how those two different models manifest and get used and how this other type of model actually, while it's not as easy to intuit, may actually be more, I don't know if we say accurate, but maybe more accurate is a better way of saying it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1691.382,
    "end": 1698.443,
    "text": "Yeah, I actually definitely agree because, you know, not to be morbid, but we all are progressing to the same end.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1700.116,
    "end": 1702.698,
    "text": " And as we age, our affordances are less and less.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1703.439,
    "end": 1710.165,
    "text": "We might not be able to cognate as well or we might be less mobile as we get older.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1711.025,
    "end": 1712.647,
    "text": "Daniel, sorry, did I take the words out of your mouth?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1714.388,
    "end": 1716.67,
    "text": "How about Dave first and then Olga?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1716.89,
    "end": 1717.391,
    "text": "Okay, Dave?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1719.568,
    "end": 1723.112,
    "text": " Yeah, so is that becoming more focused into the future?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1723.132,
    "end": 1731.101,
    "text": "Does that have anything to do with most of us becoming more and more subject matter experts rather than the other kind of expert?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1733.703,
    "end": 1734.004,
    "text": "Daniel?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1736.314,
    "end": 1737.614,
    "text": " Nice question, Dave.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1737.674,
    "end": 1752.138,
    "text": "So the sort of duality of the time cone and the time diamond, it just suggests that there's certain things that we want to think about as being maximized in the present, maybe, and certain things that are being as if they're minimized in the present.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1752.558,
    "end": 1761.54,
    "text": "So it's just two different, and we'll figure out maybe in some ways, there's some things that win off into the future, and there's other things that are maximally constrained in the present.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1762.2,
    "end": 1772.747,
    "text": " But then to connect that to the Steven's question about strategy and, you know, ask Scott what he was interested in with, you know, joining us.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1773.468,
    "end": 1779.272,
    "text": "It made me think about the width of this cone going out into the future or the length of the one that's more like a diamond.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1779.792,
    "end": 1784.455,
    "text": "It's kind of like the horizon, which you need to consider for de-risking or for strategy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1784.836,
    "end": 1790.76,
    "text": "And so that space, just like the butterflies wings, that space expands super rapidly.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1791.44,
    "end": 1801.59,
    "text": " Now, you might have a hypothesis about the space that only one region is likely to be explored or that all of your strategy would work across this whole space.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1802.03,
    "end": 1807.256,
    "text": "But it just sets up the discussion instead of time points and bifurcating points.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1807.716,
    "end": 1810.178,
    "text": "It's like, actually, it's going out really vastly.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1810.879,
    "end": 1819.947,
    "text": " So there has to be some more adaptive way of realigning because the time cone is going to be too large to search through in the future, even at a short time step.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1820.007,
    "end": 1829.395,
    "text": "So how could we enact a strategy in the current moment, given something what we are maximizing, so that we could actually have an adaptive strategy moving forward?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1832.077,
    "end": 1832.337,
    "text": "Nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1832.577,
    "end": 1833.738,
    "text": "Dave, and then Steven?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1837.762,
    "end": 1839.163,
    "text": "No, I just hit the...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1839.87,
    "end": 1840.43,
    "text": " button wrong.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1840.65,
    "end": 1840.99,
    "text": "Got it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1841.05,
    "end": 1841.41,
    "text": "Steven?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1843.271,
    "end": 1847.652,
    "text": "Yeah, I saw Scott's got his ice cream cones there, so I'm going to be curious to hear his point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1847.672,
    "end": 1863.817,
    "text": "But tying with what we're saying is also we have this, because swarming dynamics and nonlinear dynamics basically aren't part of the most systems approaches, really, there's an assumption that it's a volume of information problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1864.457,
    "end": 1886.81,
    "text": " going from the present to the future and it's just finding ourselves in all of that but um and at times when we've got the like in modern world we've kind of thought the world is much more predictable than it is and maybe it was when it was in a very constrained system but now you know we can see that even in our own social systems that things can once they bifurcate that whole",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1887.811,
    "end": 1905.462,
    "text": " cone thing breaks down because it suddenly it just so I think that there's there's there's something quite useful here actually in rethinking and using this alternative or maybe something which is a other version of this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1907.003,
    "end": 1916.67,
    "text": " This version of this cone, which doesn't rely on ocular light visual, because there's no eyes in a cell, for instance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1916.69,
    "end": 1919.092,
    "text": "They're not seen into the future, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1919.532,
    "end": 1923.015,
    "text": "That's only something that happens at quite an aggregated organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1923.175,
    "end": 1927.959,
    "text": "So this is actually probably has some other spinoffs that's quite useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1929.54,
    "end": 1929.86,
    "text": "Scott?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1931.71,
    "end": 1934.491,
    "text": " This is a fascinating conversation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1934.531,
    "end": 1939.112,
    "text": "So by the way, this is a cone that I saw in New York that it was an ice cream cone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1939.132,
    "end": 1940.052,
    "text": "It was very impressive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1940.132,
    "end": 1941.692,
    "text": "It had nine scoops on it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1942.132,
    "end": 1945.353,
    "text": "So that was, that's the kind of light cone I like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1945.913,
    "end": 1953.415,
    "text": "The, you know, I was thinking back to that now, the knowing that you were saying before, Blue, and it's so interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1954.235,
    "end": 1958.416,
    "text": "So what if we perceived a group as a bunch of cones and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1959.656,
    "end": 1981.723,
    "text": " bunch of simultaneous cones and because if they have embodiments or shared meaning physically or mentally then their cones have a overlap or a similarity or shared space and but you can't really experience in other parties cones or can you indirectly and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1983.434,
    "end": 1993.638,
    "text": " So that notion of knowing that really hooked me when I just came into the call that you have these cones going on at the same time, these experiences that are through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1993.658,
    "end": 2006.842,
    "text": "And maybe when we read literature, what we're doing is we're experiencing someone else's cone in the past in order to try to project it onto our experience in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2006.902,
    "end": 2009.543,
    "text": "And then maybe you live by that rhetoric.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2009.603,
    "end": 2011.824,
    "text": "Maybe the rhetoric actually becomes your future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2012.575,
    "end": 2012.755,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2012.775,
    "end": 2021.724,
    "text": "So if your mind can have a certain state that gets acquired by contact with other states, it makes a conformational change, kind of like prionic governance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2021.784,
    "end": 2025.227,
    "text": "We have a conformational change in a protein when it misfolds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2025.588,
    "end": 2033.155,
    "text": "Maybe you have a conformational change in your cone state when it comes in contact with another cone that has a different folding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2034.456,
    "end": 2037.099,
    "text": "So that the narrative, maybe there's a narrative there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2037.961,
    "end": 2041.123,
    "text": " element to the contiguousness of the cones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2041.163,
    "end": 2052.431,
    "text": "And because they have a temporal and a physical element to them, but you can only experience them in the present, then the rest of it is just projection either in the past or the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2053.312,
    "end": 2056.654,
    "text": "And so maybe the cone is entirely rhetorical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2058.636,
    "end": 2065.541,
    "text": "And maybe it's convincing yourself and others of the state that you have for existential continuity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2066.752,
    "end": 2074.992,
    "text": " And the ways of knowing maybe goes to that in terms of multiple cone generators trying to get together and figure out if their little cones equal a big cone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2075.954,
    "end": 2080.038,
    "text": " It's really just a fascinating way to visualize the space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2080.518,
    "end": 2087.003,
    "text": "There's one other reference I want to make, which is from the Museum of Jurassic Technology in California, Culver City.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2087.544,
    "end": 2093.849,
    "text": "They have a display by a guy named Theory by Sonnabend, S-O-N-N-A-B-E-N-D.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2094.45,
    "end": 2099.794,
    "text": "And it's called Theories of Memory or Theories of Forgetting, something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2100.334,
    "end": 2101.716,
    "text": "And his whole thing was cones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2102.981,
    "end": 2107.303,
    "text": " preceding and approaching light cones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2107.963,
    "end": 2115.407,
    "text": "And the way he divides up space and knowledge is by taking different arcs and sections of these cones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2115.447,
    "end": 2117.087,
    "text": "It's really kind of fascinating stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2118.928,
    "end": 2119.809,
    "text": "Really nice, Scott.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2119.829,
    "end": 2126.712,
    "text": "I'm reminded a lot of Shanna Dobson and like the way that she perceives time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2126.972,
    "end": 2131.834,
    "text": "And like also in microscopy, like you can take a projection of an image and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2132.199,
    "end": 2141.524,
    "text": " which is where like all of the stacks from the angles that you're using in the light cone come together and you can see it all at the same like point or it's like flattened out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2142.024,
    "end": 2144.786,
    "text": "And it makes me think about visualizing time like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2145.406,
    "end": 2146.407,
    "text": "Daniel and then Steven.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2147.972,
    "end": 2149.754,
    "text": " So thanks, Scott.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2149.834,
    "end": 2151.235,
    "text": "I totally agree.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2151.255,
    "end": 2157.101,
    "text": "One of the big questions is about the intersections of time cones and what kind of happens at that intersection.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2157.181,
    "end": 2161.445,
    "text": "Do we think about them getting like folded up or having some new shape that arises?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2162.146,
    "end": 2168.952,
    "text": "And I think a way that we could have a simple hands-on intuition there is like with the two-dimensional game of life.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2169.713,
    "end": 2173.877,
    "text": " where there are certain shapes like gliders that kind of propagate on the landscape.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2174.398,
    "end": 2178.883,
    "text": "And then there are certain moving shapes that perfectly annihilate each other.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2178.963,
    "end": 2180.805,
    "text": "There are certain ones that leave only rubble.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2181.225,
    "end": 2182.847,
    "text": "There are certain ones that replicate.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2183.487,
    "end": 2187.091,
    "text": "But then there's other ones that pass through each other depending on...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2188.146,
    "end": 2210.229,
    "text": " some feature interaction of the shape in the game and then there's ones that uh do computation like there's of course great videos of the game of life being set up to do an emulation of a of a computer like the ones that were on but slower um so that really maybe connects a few pieces this sort of um",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2211.457,
    "end": 2213.018,
    "text": " agent-based interaction through time.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2213.298,
    "end": 2216.579,
    "text": "We get our intuition in this grid zone, like the game of life.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2217.16,
    "end": 2230.025,
    "text": "And then maybe some of those interactions are happening in the natural systems, just like some game theory mechanisms that were in the matrix of mathematics sort of also play out in biological systems.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2231.666,
    "end": 2232.507,
    "text": "Really nice, Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2233.127,
    "end": 2233.407,
    "text": "Stephen?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2235.7,
    "end": 2250.389,
    "text": " Yeah, this question of time also relates to when we say the now, you know, we know from even, say, the participatory sense-making that we're anticipating when something's going to happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2250.969,
    "end": 2254.151,
    "text": "Often what we sense is that there's a lag.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2254.371,
    "end": 2255.672,
    "text": "So in a way, we're always...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2257.116,
    "end": 2282.316,
    "text": " a little bit behind what's just happened yet at the same time at certain times we're anticipating things before they happen and maybe before we realize we're doing the anticipating and then we've made the decision before we knew we made the decision and then we've done it so which is where maybe reason partly why sports is so satisfying because we're we're making it have to be the baseball bat has to hit the ball",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2283.373,
    "end": 2289.314,
    "text": " And you're somehow bringing in that, you know, there's no, you either hit it and it goes out of the baseball diamond or it doesn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2289.474,
    "end": 2301.637,
    "text": "But at the same time, when you made the cognitive process happened earlier, the realization of what you actually hit it might be later than the now that you think you're in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2301.797,
    "end": 2305.238,
    "text": "So there's this interesting window there of what is now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2305.258,
    "end": 2311.9,
    "text": "Or can you even find the now, as I think Shanna argued in her math stream.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2312.12,
    "end": 2312.4,
    "text": "Daniel?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2314.116,
    "end": 2322.503,
    "text": " So Steven, it's with a sports example, and that kind of relates us back to the skilled performance discussions that we had previously.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2322.523,
    "end": 2328.847,
    "text": "So that reminds me of a BF Skinner book, Beyond Freedom and Dignity, where he's like,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2329.708,
    "end": 2337.534,
    "text": " If you imagine a situation where somebody is unconscious or they're forced to do something, you don't give them that much agency or autonomy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2338.095,
    "end": 2347.442,
    "text": "But then in the situations that look unprompted, like somebody walking up on stage, then playing a violin performance, which is still a mechanical performance,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2348.277,
    "end": 2356.799,
    "text": " We regard that highly and we shower that with the sort of aura of agency.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2357.519,
    "end": 2361.02,
    "text": "So he was kind of questioning that from his own behaviorist perspective.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2361.56,
    "end": 2367.742,
    "text": "And it's just kind of cool to think about how octave inference and multi-scale systems, those same questions come up.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2368.242,
    "end": 2372.383,
    "text": "Like there are cases where things seem really constrained as far as actions are concerned.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2373.206,
    "end": 2378.93,
    "text": " And then there's other times where behavior just seems to like come out of nowhere from like a bird song or something like that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2379.711,
    "end": 2388.057,
    "text": "So having a framework for behavior that can connect the dots across those isolated occurrences is really promising.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2389.958,
    "end": 2390.198,
    "text": " Nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2390.398,
    "end": 2402.106,
    "text": "And yeah, we've talked about planning as inference and really the author brings up here planning in relation to the homeostatic space, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2402.406,
    "end": 2412.492,
    "text": "So really this might be the first, like how planning came to be is like planning for some potential state that is not my ideal homeostatic space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2413.493,
    "end": 2413.873,
    "text": "Stephen?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2415.686,
    "end": 2416.787,
    "text": " Yeah, both a good point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2416.807,
    "end": 2424.511,
    "text": "Yeah, because if it's already my ideal homeostatic space, why use all that energy, valuable energy, to try and predict it when it's already being done quite well?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2424.671,
    "end": 2431.575,
    "text": "And like Daniel was saying there about skillful performance, I mean, once you get into this groove and someone's in the zone,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2432.375,
    "end": 2454.972,
    "text": " you know more and more the processes have probably been taken care of by morphological computing which is basically the cellular processes and then when it's at these other temporal depths i i'm predicting and just getting right the emphasis on the third note before the crescendo or whatever it is you know it may be that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2456.078,
    "end": 2467.103,
    "text": " In some ways, when you're in the flow, which is that term when people are kind of immersed in an experience, are you in some ways less conscious of more rapid dynamics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2467.383,
    "end": 2473.046,
    "text": "And without getting into a debate about consciousness, I think we've got enough on the table.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2473.086,
    "end": 2482.971,
    "text": "But just that question about, yes, it is encompassing many more areas of what we've talked about than at first had been apparent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2486.32,
    "end": 2489.821,
    "text": " Nice, and this touches on memory also, so I flipped over to that slide.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2490.282,
    "end": 2490.602,
    "text": "Scott?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2492.102,
    "end": 2498.304,
    "text": "You know, it's interesting that notion just a minute ago about being an optimal or zone space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2499.625,
    "end": 2510.009,
    "text": "I heard somebody, a quote, somebody a few years ago was talking about different personalities where some people like the social equivalent of classical music and some people like the social equivalent of jazz.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2510.973,
    "end": 2515.636,
    "text": " And so the people who like the social equivalent of classical music want to hang out with the same people all the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2516.396,
    "end": 2519.378,
    "text": "And then, oh, Bill, how's Bill's drinking problem going?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2519.478,
    "end": 2522.14,
    "text": "Oh, how's Mary's, you know, kids doing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2522.16,
    "end": 2524.942,
    "text": "You know, it's the same story, just incremental changes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2525.422,
    "end": 2531.626,
    "text": "Kind of like if you hear Beethoven's Fifth and it's like... You're like, whoa, that's slightly off because your expectation is different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2532.146,
    "end": 2536.028,
    "text": "Whereas jazz, you don't know what... It's going to be boop, beep, bop, boop, boop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2536.129,
    "end": 2537.109,
    "text": "It's all different things, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2537.669,
    "end": 2537.79,
    "text": "So...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2538.73,
    "end": 2542.632,
    "text": " It's kind of interesting what your expectations are and what that optimization is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2542.752,
    "end": 2545.033,
    "text": "Jazz is a different kind of optimization, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2545.573,
    "end": 2550.315,
    "text": "And so it made me think about the anterior cingulate nucleus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2551.135,
    "end": 2566.702,
    "text": "My understanding is that's the part of the brain that if you're eating at a ripe berry bush and enjoying ripe berries, the anterior cingulate nucleus, if it fires off, will make you think, huh, I wonder if there's a riper berry on the next bush.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2568.348,
    "end": 2573.591,
    "text": " And so it's the, and I call it the commitment area where men can't commit to a relationship.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2573.651,
    "end": 2575.732,
    "text": "I believe it's probably the anterior cingulate nucleus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2575.752,
    "end": 2577.613,
    "text": "They're looking for a riper berry, so to speak.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2578.253,
    "end": 2588.419,
    "text": "So that, I wonder if there's an interesting, I'll use a notion of random number generation here, but that's probably not that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2589.3,
    "end": 2594.983,
    "text": "But if there's a randomness factor that is in your optimum, so is your state when it's optimized,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2595.945,
    "end": 2623.728,
    "text": " what is there something in the model itself that can throw randomness in there besides the externality so that and then you become like a novelty seeking person who has a highly active anterior cingulate nucleus is that an optimization which is superior for instance if you have a changing highly rapidly changing environment things like that just a couple of thoughts on optimization and what the zone might look like in different settings for different embodiments",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2625.031,
    "end": 2630.795,
    "text": " Yeah, that reminds me, like, I mean, it's like a life plan or like an organismal life plan.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2630.815,
    "end": 2633.877,
    "text": "Like some organisms like have to be in their niche environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2633.897,
    "end": 2635.338,
    "text": "Like you can never take them out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2635.699,
    "end": 2639.221,
    "text": "But then like some organisms like prepare for maximum randomness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2639.241,
    "end": 2642.043,
    "text": "Like I think about a tardigrade, you know, like you can do anything to them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2642.063,
    "end": 2646.627,
    "text": "Like you can dehydrate them and send them to the moon and have them come back and all these things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2646.687,
    "end": 2651.39,
    "text": "But they're, you know, built, they're well suited for maximum randomness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2652.131,
    "end": 2652.451,
    "text": "Daniel?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2652.471,
    "end": 2652.611,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2654.54,
    "end": 2658.421,
    "text": " I liked Scott's point there about the genre of optimization.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2660.342,
    "end": 2664.004,
    "text": "I'm personally always surprised listening to both jazz and classical.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2664.424,
    "end": 2666.124,
    "text": "It's just that it's a different genre.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2666.384,
    "end": 2683.371,
    "text": "And so a musician in either or both of those areas, though, would have a deep enough generative model to know when one thing was off by even a tiny bit, even in a song that might sound discordant to somebody because the improvisation tradition of one genre might be",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2684.235,
    "end": 2687.217,
    "text": " more, I don't know, nonlinear in some way.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2687.877,
    "end": 2697.763,
    "text": "But definitely this idea of having interpretable or experienceable ways of interacting with different optimization processes, different distributed processes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2698.483,
    "end": 2702.726,
    "text": "Are there more jazz-like or more classical-like collective behaviors?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2703.206,
    "end": 2710.611,
    "text": "And then also this broader question that is returned to centrally, which is that cognition is related to individuality.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2711.491,
    "end": 2734.524,
    "text": " That's really relevant for talking about where is cognition offloaded or how does cognition offload into the environment through development, like through modification of the niche, and then also through evolution, where also the niche can be modified in the long term, but evolution can select for like canalization, so stabilization of things that were accessed plastically in one generation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2737.005,
    "end": 2737.245,
    "text": "Nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2737.565,
    "end": 2738.546,
    "text": "Steven, and then Scott.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2740.501,
    "end": 2753.616,
    "text": " yeah i mean following on what you're saying about the environment and and the jazz and classical um i used to live in prague for for a year or so and and what was interesting there so you've got a lot of classical music venues and operas and you've got",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2754.813,
    "end": 2758.174,
    "text": " lots of jazz as well, but they're very different spaces as well, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2758.194,
    "end": 2770.697,
    "text": "You've got the basement jazz bar in some cellar and you've got, so there's a question as well about, yeah, once, when you start going to one or the other, you probably will keep going to one or the other for a while, if that makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2770.717,
    "end": 2783.14,
    "text": "You sort of, even though, so beyond the music, once you, yeah, there is a kind of a dynamic because those, those two are fairly clear, relatively extremes, I suppose, even though they're both what you would call high arts, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2783.86,
    "end": 2802.074,
    "text": " in some ways as well so you've got that interesting thing about how you bring in the environment and that's one thing active influence does which many forms of psychology in that don't is how much is it about changing your generative model and how or how much is it about another model about choosing your environment and letting the environment do a lot of the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2803.5,
    "end": 2818.256,
    "text": " motivating for you so that's interesting I was just also on a call about metaphors and Andrew Austin who does that work he talks about if you want to motivate yourself it's actually easier to change your environment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2819.531,
    "end": 2837.331,
    "text": " an externality that can be helpful if you want to change your choice making that can be internal so like don't try and choose get others to make better choices make better choices yourself you might not be able to motivate yourself maybe find things out there that help motivate you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2837.952,
    "end": 2840.573,
    "text": " So in the same way that, you know, maybe that's good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2840.613,
    "end": 2846.716,
    "text": "If I want to get a more ordered kind of structured view of the world for a while, maybe I'll start going to some classical concerts for a while.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2847.176,
    "end": 2851.998,
    "text": "If I want to release and start sort of being more free flowing, maybe I'll go and watch some jazz.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2852.679,
    "end": 2854.78,
    "text": "So anyway, kind of interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2856.941,
    "end": 2857.861,
    "text": "Thanks, Scott.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2859.289,
    "end": 2860.41,
    "text": " I love all of you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2860.55,
    "end": 2866.815,
    "text": "I got to say, this is, I mean, it's been a few weeks since I've been able to be on the calls just for different reasons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2867.395,
    "end": 2868.876,
    "text": "And this is beautiful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2869.196,
    "end": 2870.177,
    "text": "It's such a beautiful thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2871.058,
    "end": 2871.198,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2871.638,
    "end": 2876.242,
    "text": "So I was just showing you my tardigrade banjo ukulele, which is what I was holding up to the screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2876.262,
    "end": 2877.423,
    "text": "So that's a tardigrade painted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2878.043,
    "end": 2878.603,
    "text": "A couple of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2879.004,
    "end": 2880.325,
    "text": "So, you know, it's interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2880.445,
    "end": 2885.589,
    "text": "Love the last couple of comments and that notion of access to other things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2886.638,
    "end": 2886.858,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2886.978,
    "end": 2892.964,
    "text": "And that kind of recreational and de-risking access to the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2893.605,
    "end": 2893.785,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2893.805,
    "end": 2903.255,
    "text": "You want to know the externality because you want to render it innocuous for survival purposes and then render it delicious for aesthetic purposes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2903.515,
    "end": 2903.715,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2904.195,
    "end": 2905.317,
    "text": "And so a couple of books.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2905.357,
    "end": 2907.579,
    "text": "This is the past is a foreign country.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2909.569,
    "end": 2915.812,
    "text": " by Lowenthal, which is kind of like, OK, temporally, the assertion in the book is the past actually isn't a foreign country.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2915.852,
    "end": 2916.352,
    "text": "They're the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2916.652,
    "end": 2917.032,
    "text": "It's us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2917.433,
    "end": 2917.613,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2918.093,
    "end": 2919.493,
    "text": "And so the same thing temporally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2919.514,
    "end": 2920.954,
    "text": "Oh, they're so different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2921.134,
    "end": 2921.875,
    "text": "Oh, that's other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2922.335,
    "end": 2922.495,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2922.595,
    "end": 2923.695,
    "text": "Oh, we've come beyond this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2923.955,
    "end": 2925.276,
    "text": "But that's our own aspiration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2925.636,
    "end": 2929.558,
    "text": "Then another book, Introduction to Comparative Study of Private Law.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2930.038,
    "end": 2955.319,
    "text": " comparative law you got in law and language i my assertion that the mind exists in language and the brain is just an antenna tuned to it well law is a formalization of language and understanding so you have again comparative study there's another book i have i couldn't put my hands on it's the cambridge handbook of adaptation studies in theater and the articles on how do you adapt german theater for a greek",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2956.305,
    "end": 2957.265,
    "text": " audience or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2957.446,
    "end": 2957.646,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2958.186,
    "end": 2963.067,
    "text": "So all of these things, there's a exotic element to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2963.908,
    "end": 2964.168,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2964.328,
    "end": 2972.67,
    "text": "And which is both threatening and reaffirming and delicious and scary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2973.351,
    "end": 2973.571,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2973.891,
    "end": 2977.012,
    "text": "And so these isn't it interesting that those states are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2979.48,
    "end": 2986.444,
    "text": " Are we other than novelty perceiving, either by resistance or seeking?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2987.365,
    "end": 2990.066,
    "text": "Is that the essence of consciousness?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2990.587,
    "end": 3006.997,
    "text": "And so if you had the equivalent of isothermy, where in isothermy you have temperature equivalence in two systems and you can't perform work because there's no temperature differential, heat differentials, well, what if we had no meaning differential between two systems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3008.11,
    "end": 3017.24,
    "text": " is that describable vis-a-vis that variable as one system and is that something that starts to get to you sociality",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3018.061,
    "end": 3047.381,
    "text": " or shared narrative and is that why that becomes so existential because the reinforcements of that become the amplifying wave essentially the amplifying embodiment becomes so powerful that it overtakes the system the system has no other internal state that's as reinforced and as amplified so therefore that one becomes overwhelming and maybe that's a source of why it's hard to crack misinformation by feeding",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3048.261,
    "end": 3049.882,
    "text": " fact or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3049.982,
    "end": 3051.643,
    "text": "Anyway, just a couple of random thoughts there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3052.323,
    "end": 3053.104,
    "text": "Really nice, Scott.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3053.424,
    "end": 3057.847,
    "text": "I took the Tony Robbins test one time, like what's your driving force in life?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3057.927,
    "end": 3063.77,
    "text": "And I'm totally driven by instability, which makes me like a desperate novelty seeking person.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3064.812,
    "end": 3071.397,
    "text": " And I'm also reminded in your points about language, I've been thinking a lot about language because of some projects I'm involved in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3071.557,
    "end": 3080.524,
    "text": "And I was listening to Josh Tenenbaum speak yesterday about his program that he developed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3080.604,
    "end": 3088.149,
    "text": "It's like a neural network, like a sleep-wake Helmholtz machine that actually composes language.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3088.189,
    "end": 3093.353,
    "text": "I mean, it does some phone numbers, but it writes code, like computer programs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3093.937,
    "end": 3108.381,
    "text": " Um, and you know, draws symbols and it does these cool like things based on a framework that's, um, you know, kind of analogous to active inference where the exploration phase happens in the sleep phase of, of the machine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3108.421,
    "end": 3114.342,
    "text": "So exploration is like this recombination of all of the potential like factors, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3114.362,
    "end": 3118.483,
    "text": "So like in the training phase, it's, it's trained on, you know, constructs the generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3118.979,
    "end": 3122.7,
    "text": " or it constructs the recognition model based on all of the training input.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3122.72,
    "end": 3125.901,
    "text": "Like if it's drawings, it's going to be all of like, you know, potential shapes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3126.321,
    "end": 3132.423,
    "text": "And then it recombines these, well, it thinks about recombining them to kind of become a field expert.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3132.463,
    "end": 3134.104,
    "text": "It was really an interesting paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3134.864,
    "end": 3135.624,
    "text": "Sorry to detour there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3135.684,
    "end": 3136.005,
    "text": "Daniel?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3138.085,
    "end": 3140.106,
    "text": "You go for it, Scott, and then I'll give a thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3141.568,
    "end": 3168.039,
    "text": " uh thanks yeah just that's fantastic and it makes me think one of the things i've been fussing with for a while you've probably heard me say it is that the mind does not exist in the brain it exists in language and culture and the brain is tuned to the mind and the example i give is my niece who was adopted from china at five months old now has graduated from cornell she's looks like a chinese person she doesn't speak chinese she doesn't like chinese food she doesn't like chinese music",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3168.559,
    "end": 3172.164,
    "text": " She speaks Spanish and English, and she's a central Pennsylvania gal, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3172.584,
    "end": 3178.952,
    "text": "So her mind was not... There was no feral consciousness, and her mind was developed in central Pennsylvania.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3179.493,
    "end": 3180.554,
    "text": "So what it makes me think...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3181.88,
    "end": 3183.8,
    "text": " what you were just saying is so interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3184.3,
    "end": 3189.241,
    "text": "So maybe the mind we're, maybe our models are just so, so much hubris there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3189.461,
    "end": 3193.622,
    "text": "And we think the mind proceeds communication and maybe it just doesn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3193.782,
    "end": 3198.743,
    "text": "Maybe it is no mind affordance other than communication and language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3198.763,
    "end": 3204.964,
    "text": "So like Plato, when he said, the reason that authors were the challenge is you couldn't query the consciousness of the author.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3205.505,
    "end": 3207.525,
    "text": "Maybe it was an, even a deeper question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3207.725,
    "end": 3214.351,
    "text": " comment about mind that the querying of consciousness is mind itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3215.212,
    "end": 3218.555,
    "text": "And so maybe active inference is the function of mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3218.635,
    "end": 3229.264,
    "text": "It's not a mind seeking to refine its state more, but it is the fact of mind is the act of active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3229.685,
    "end": 3232.848,
    "text": "It just feels that was a shift that I hadn't thought about before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3233.228,
    "end": 3234.109,
    "text": "And it gets away from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3234.569,
    "end": 3247.16,
    "text": " centralizing mind in individual brains that then come in contact to try to fix up their models and rather putting situating mind in the edge itself, not the node from a graph theory perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3247.54,
    "end": 3248.541,
    "text": "That's fascinating stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3250.883,
    "end": 3252.003,
    "text": "Daniel and then Dave.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3253.965,
    "end": 3254.205,
    "text": "Yep.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3254.225,
    "end": 3262.212,
    "text": "To kind of bring it to active inference, but really just any kind of dynamical modeling, we shouldn't let this like snapshot happen.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3263.745,
    "end": 3267.59,
    "text": " govern the way that the system works because systems change through time.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3267.99,
    "end": 3270.393,
    "text": "So they're not just the snapshot picture.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3270.914,
    "end": 3276.04,
    "text": "Maybe the prevalence of photography makes it easier sometimes to imagine this sort of snapshotting.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3276.741,
    "end": 3280.505,
    "text": "And yes, active inference is hopefully providing a way to just",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3281.246,
    "end": 3308.955,
    "text": " think about it again whether instrumentally or more in this sort of like philosophical or metaphysical way which everyone is welcome to do but the actual uh core is just going to be leading to many questions for a long time dave one of the yeah one of the uh environments that uh is extraordinarily powerful at",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3309.588,
    "end": 3323.056,
    "text": " putting people in altered states of consciousness, and especially distorting their time sense is a device, an entertainment device, which was also a psychological research device called Musicolor.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3324.437,
    "end": 3327.098,
    "text": "Stephen may have seen references to that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3327.579,
    "end": 3334.343,
    "text": "This was developed in the 1950s and was in some shows and clubs in London in the late 50s and early 60s.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3336.442,
    "end": 3338.743,
    "text": " It's been mentioned a few times.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3340.104,
    "end": 3343.305,
    "text": "Andrew Pickering mentions that, a few other people, in passing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3343.986,
    "end": 3354.11,
    "text": "And there was an exhibit that was developed by the same engineer that tried to play in Paris but got COVID out.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3354.37,
    "end": 3364.394,
    "text": "If none of you have seen that, I have most of the material that's ever been captured, as far as I can tell, because it was a series of talks, a series of literally chats.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3366.832,
    "end": 3376.655,
    "text": " In the 1980s, so I better gather that up and it's all it's all in a single series on YouTube that I have on a playlist.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3376.675,
    "end": 3377.995,
    "text": "So let's do that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3378.995,
    "end": 3387.337,
    "text": "Yeah, the guy would literally his musicians would believe that five minutes had passed when it was actually eight hours they had been playing solos.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3388.069,
    "end": 3395.879,
    "text": " for 10 hours at night, risking arrest for trespass when they thought, oh no, no, the guard, you know, everybody's still here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3395.92,
    "end": 3397.742,
    "text": "I've only been here 10 minutes playing my flute.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3399.004,
    "end": 3401.307,
    "text": "And people would get so spaced out, they would,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3402.06,
    "end": 3423.813,
    "text": " drive their cars into the middle of roundabouts up on and and bang into the post because it just didn't occur to them not to do that or they'd they'd look into the the u tracks and watch the train come to them and if people hadn't grabbed them and pulled them off what were you doing what do you mean i was i was looking at the lights and no drugs",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3425.515,
    "end": 3426.356,
    "text": " And they had fun.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3426.696,
    "end": 3429.179,
    "text": "And the bystanders had no idea this was happening.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3429.399,
    "end": 3431.321,
    "text": "Oh, these guys are just playing jazz.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3431.361,
    "end": 3434.865,
    "text": "But no, they were on cloud nine.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3436.988,
    "end": 3437.308,
    "text": "That's cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3437.328,
    "end": 3439.41,
    "text": "It reminds me of virtual reality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3439.671,
    "end": 3439.971,
    "text": "Daniel?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3441.713,
    "end": 3456.136,
    "text": " So it's interesting that with frameworks for communication, like active inference, we can think about syntactic repetition, like repeating the same word, semantic repetition and novelty, like somebody saying the same thing differently,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3456.877,
    "end": 3462.381,
    "text": " but also narrative novelty and similarity, or at least consistency, coherency.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3463.062,
    "end": 3473.009,
    "text": "And so the other piece from what Scott had said earlier was going back to some of our earliest streams on narrative and communication as active inference.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3473.77,
    "end": 3477.072,
    "text": "There's a ton of ways to think about that, like is",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3478.041,
    "end": 3497.226,
    "text": " narrative like a summary statistic of the agent-based generative models like you got 25 at this parameter and 75 at this parameter and then narrative is just like a descriptive state but what happens when narratives or various representations of them can actually through mechanisms feed back",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3498.266,
    "end": 3501.587,
    "text": " onto sensory and therefore internal states.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3502.327,
    "end": 3527.596,
    "text": "So how do we think about narrative and active inference and narrative and communication as like higher order semantic structures that help reduce uncertainty, allow for efficient information transfer, all the imperatives of cell to cell communication, bioelectric, but it's happening at a spatial and a temporal scale that demands auditory transmission, but of course can also be done electrically.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3530.1,
    "end": 3530.665,
    "text": " Really nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3531.11,
    "end": 3531.372,
    "text": "Scott?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3533.531,
    "end": 3536.592,
    "text": " This is, again, my face hurts from smiling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3537.052,
    "end": 3553.797,
    "text": "So I have this book, Rhetorical Style, it's called, and it has dozens of rhetorical flourishes, like the use of French suggests style, and the use of German words suggests engineering excellence, and then there's different placements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3553.877,
    "end": 3557.538,
    "text": "I mean, it's just all these different ways to construct the sentence, all these differences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3558.218,
    "end": 3561.979,
    "text": "And it's so fascinating, that notion that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3564.512,
    "end": 3568.534,
    "text": " Is that what's the cellular equivalent of rhetoric?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3570.395,
    "end": 3570.635,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3571.055,
    "end": 3581.061,
    "text": "Is that when a cell wants to persuade, let's say there's a growing tip of a mesenchyme tissue or some whatever in a plant or a human, whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3581.501,
    "end": 3585.343,
    "text": "And it's and there's a decision to be made based on a Turing wave.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3585.99,
    "end": 3588.712,
    "text": " that's coming in, and what finger orientation you have, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3588.792,
    "end": 3591.473,
    "text": "The Turing wave is responsible for finger growth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3591.934,
    "end": 3596.656,
    "text": "There's a periodicity to the starting and stopping of the chemicals, and that's why you have multiple fingers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3597.277,
    "end": 3606.863,
    "text": "So what's the notion of persuasion in non-human speech?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3606.963,
    "end": 3608.504,
    "text": "So a peacock's feathers...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3609.56,
    "end": 3626.004,
    "text": " are persuading the female of its fitness because the coloration, one assertion is, with coloration, if it's a healthy-looking color or the dance is healthily performed, it suggests a healthy individual, and that's persuasion for mating, let's say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3626.024,
    "end": 3629.065,
    "text": "I'm just asserting a possible rhetoric.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3630.685,
    "end": 3638.227,
    "text": "And is all communication rhetorical in that it's made to persuade...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3639.969,
    "end": 3649.495,
    "text": " And the persuasion is not necessarily in the, it may be in the self-interest of both the speaker and the externality, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3649.535,
    "end": 3662.324,
    "text": "Because I'm talking about situations where you're running an internal model and you're trying to recruit other internal models, which are your externality, but for other people or other things are their internal models, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3662.844,
    "end": 3669.409,
    "text": "And so if you want to get some externality, that's an organism to do something consistent with your model,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3670.049,
    "end": 3675.974,
    "text": " You need to entrain them, harmonically couple with them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3676.755,
    "end": 3683.6,
    "text": "So is rhetoric, what's the equivalent of rhetoric in other non, I guess, non-language systems?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3683.62,
    "end": 3686.543,
    "text": "I use the word language in non-human language systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3689.662,
    "end": 3690.183,
    "text": " Really nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3690.825,
    "end": 3700.124,
    "text": "And I'm reminded of, well, it made me think of how does the narrative play across scales, really, like from the cellular to the organ level to the organismal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3700.344,
    "end": 3700.625,
    "text": "Stephen?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3702.702,
    "end": 3708.429,
    "text": " Yeah, I think that also bringing that into what Daniel was saying with structure and narrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3708.709,
    "end": 3716.498,
    "text": "So there's, and actually that I just look in that up, that colour, you know, the colour and how that wheel relates to sound and music.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3717.539,
    "end": 3722.945,
    "text": "So you've got these questions of when does structure start to be present that gives something...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3724.026,
    "end": 3750.722,
    "text": " else another type of geometry and where is that present so it could literally be um there could be a type of geometric space in the way the neurons have arranged themselves and that could be a certain level at which they're getting fed in embodied information about light sources so it would only really happen when you've got an eye that's measuring light data that then starts to structure itself",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3751.727,
    "end": 3752.468,
    "text": " in that form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3752.488,
    "end": 3765.659,
    "text": "And that could then underneath, and that could also apply to, there may be a sort of a quality to the way sound is based on it being a whole level of, you know, hertz or half levels of hertz and half tones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3766.2,
    "end": 3770.403,
    "text": "So there's something around, I think there's an interesting point around when we have structure,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3771.204,
    "end": 3776.567,
    "text": " And this rhetorical piece may happen once we can... Oh, crikey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3777.488,
    "end": 3780.47,
    "text": "Yeah, so you've got that as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3780.49,
    "end": 3783.051,
    "text": "So then you've got systems that we can see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3783.111,
    "end": 3791.236,
    "text": "Now, the question with rhetorical stuff is, is rhetorical stuff the stuff that we can see as a system that you can then argue your point in some sort of way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3791.797,
    "end": 3796.76,
    "text": "And I suppose at another level, the cells could come to a point where they could argue a case with each other",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3797.62,
    "end": 3800.722,
    "text": " And so there's some system in place that sits on that structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3801.263,
    "end": 3811.81,
    "text": "But the thing that always is in the background, which is, again, what I was saying earlier, most people doing systems don't think about when they talk about emergence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3812.71,
    "end": 3814.992,
    "text": "Is there some sort of swarming dynamics happening?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3815.712,
    "end": 3819.495,
    "text": "Now, whether this bioelectric stuff",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3820.851,
    "end": 3842.049,
    "text": " sits and adds a new layer i mean i noticed on one of the slides there it talked about kind of like a new layer of um uh like does this add a new layer to um to to this dynamic and i'm i'm curious about whether that your thoughts on that in in the sense of um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3843.574,
    "end": 3855.524,
    "text": " Do you see this as being a new layer that's being added, or is this somehow something which builds a bridge to the way the structures could emerge out of the swarming?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3857.025,
    "end": 3859.547,
    "text": "Is it because it talks about memory?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3859.587,
    "end": 3865.331,
    "text": "I know you have the slide that talks about memory, and I can't quite find which one it is now, but one of the slides talks about memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3866.212,
    "end": 3869.934,
    "text": " Is that significant in allowing the structuring to happen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3870.254,
    "end": 3872.996,
    "text": "You know, is it something about forming that memory in that structure?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3873.576,
    "end": 3875.637,
    "text": "Or does the structure need to be there first?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3875.717,
    "end": 3876.978,
    "text": "I'm sort of putting that out to us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3877.018,
    "end": 3881.52,
    "text": "And I don't know whether that's something we could ask Michael, but maybe just refine that thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3881.56,
    "end": 3887.404,
    "text": "But it seems to be something which is a question that relates to how this all fits together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3887.424,
    "end": 3890.886,
    "text": "Nice.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3891.246,
    "end": 3891.546,
    "text": "Dave?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3894.161,
    "end": 3920.093,
    "text": " Yeah, for Scott, if you want to see how rhetoric is founded in the basic emotions and also get an evolutionary, biological evolutionary perspective on that, read the chapter on play in Jaak Panksepp's Affective Neuroscience.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3922.822,
    "end": 3950.631,
    "text": " And once you've gotten through that, look at Piaget's later work on the role of play, when he really got very subtle about the socialization and how kids use play to become very expert in the ideal case in role-taking and the creation of social relations and being able to play without.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3951.047,
    "end": 3952.648,
    "text": " anybody's feelings getting hurt and so on.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3955.81,
    "end": 3966.598,
    "text": "Yeah, the concept of play, I think, is really important in the space of active inference because it really kind of represents that exploratory component.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3967.399,
    "end": 3967.679,
    "text": "Scott?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3973.922,
    "end": 3976.243,
    "text": " I'll give a thought while he stepped away.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3976.483,
    "end": 3978.885,
    "text": "It was related to his point about persuasion.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3979.785,
    "end": 3983.027,
    "text": "So if anything, it's not going to be a binary.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3983.247,
    "end": 3985.268,
    "text": "It's going to be, first off, instrumental.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3985.448,
    "end": 3986.749,
    "text": "It's about how it's being modeled.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3986.789,
    "end": 3990.971,
    "text": "We're not looking for something that we're going to see under a microscope or wouldn't even matter if we could.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3991.411,
    "end": 3995.814,
    "text": "We're talking about categorization so that we can reduce our uncertainty about action.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3996.314,
    "end": 3997.975,
    "text": "So the models that we set up",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3999.093,
    "end": 4000.734,
    "text": " could be a binary state model or not.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4001.015,
    "end": 4009.841,
    "text": "And that wouldn't be a metaphysical claim, but just thinking about it as far as biological systems are concerned and taking it to that sort of like cellular level.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4010.142,
    "end": 4016.206,
    "text": "Like what if one molecule is secreted that sensitizes the cell to a second molecule?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4016.587,
    "end": 4017.988,
    "text": "You know, is that type of sequencing?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4018.688,
    "end": 4024.032,
    "text": "Would that be considered a minimal viable rhetoric or intracellular narrative?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4024.953,
    "end": 4043.232,
    "text": " and just made me think about how there's sort of different types of interactions and that they convey different information, something that my advisor, Professor Gordon, really explored a lot in the ant colony case, how different types of interactions just update how likely an individual is to do different kinds of actions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4043.812,
    "end": 4045.453,
    "text": " And that's seen across systems.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4045.493,
    "end": 4047.934,
    "text": "So sometimes that's just a simple enough statement.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4048.054,
    "end": 4053.216,
    "text": "Like there's symbols that we see, you know, one or 50 or a thousand times a day.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4053.236,
    "end": 4057.697,
    "text": "And then there's things that are more explicitly narrated more rarely.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4058.157,
    "end": 4066.04,
    "text": "So then in the case of the human culture, human narratives, it just opens up the design space because there's multiple kinds of interactions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4068.521,
    "end": 4068.761,
    "text": "Nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4068.942,
    "end": 4070.082,
    "text": "Scott, did you want to give a thought?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4070.902,
    "end": 4071.823,
    "text": " Yeah, a couple of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4071.963,
    "end": 4073.263,
    "text": "That is really nice, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4073.283,
    "end": 4074.564,
    "text": "That's kind of the notion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4074.744,
    "end": 4078.126,
    "text": "It introduces something like discretion, in a sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4079.387,
    "end": 4094.755,
    "text": "So if a system is running a, let's call it active inference, running that model, are they bringing their model to bear on the environment environment?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4095.461,
    "end": 4102.147,
    "text": " because it embodies the information of their past genetically and epigenetically and behaviorally?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4102.167,
    "end": 4107.931,
    "text": "So a three-legged dog, is it running with three legs just because now it has three legs and that's it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4107.951,
    "end": 4108.792,
    "text": "That's the affordance?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4110.494,
    "end": 4117.78,
    "text": "Or is there discretion in the active part of active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4118.8,
    "end": 4124.725,
    "text": " That may be an interesting dividing point in terms of rhetoric.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4125.205,
    "end": 4129.929,
    "text": "Can rhetoric be a persuasion brought by a thing that's intrinsic?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4130.009,
    "end": 4133.992,
    "text": "So a tiger jumps in front of me on a path and I'm walking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4134.873,
    "end": 4140.357,
    "text": "The tiger is ferocious because it's an apex predator and has big teeth and I'm not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4141.598,
    "end": 4147.183,
    "text": "Is the tiger exercising discretion on being ferocious or is it just intrinsically ferocious to me?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4148.757,
    "end": 4148.937,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4148.957,
    "end": 4153.3,
    "text": "So is so that's that to me, that feels like there may be something there on rhetoric.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4153.901,
    "end": 4162.447,
    "text": "If there's a choice, maybe the organism has or choices, not maybe maybe the organism is not a single individual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4162.507,
    "end": 4163.608,
    "text": "Maybe it's a hive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4164.869,
    "end": 4165.87,
    "text": "So that's one thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4165.91,
    "end": 4170.073,
    "text": "Then that gets to the quorum sensing, which is really rhetorical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4171.094,
    "end": 4173.956,
    "text": "Argument seems like it's because there there's a choice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4174.256,
    "end": 4176.438,
    "text": "Shall we swarm or not?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4177.932,
    "end": 4186.516,
    "text": " Now, when it's locusts and it's a pheromone for gregariousness, right, that's what switches, the pheromone switches on and off when they're in close contact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4187.156,
    "end": 4191.998,
    "text": "So question is, is that a discretionary thing when there's a pheromone impact?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4192.018,
    "end": 4195.1,
    "text": "You know, again, it doesn't have to be an either or.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4195.16,
    "end": 4199.702,
    "text": "It's just that maybe there's gradations of discretion that are exercised in different ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4200.502,
    "end": 4203.884,
    "text": "And so the other, then it gets to me, it gets to synesthesia.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4205.481,
    "end": 4217.35,
    "text": " So if I could sense something, I could make a decision, but instead I'm fed a pheromone that makes me make a decision without my conscious awareness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4217.53,
    "end": 4218.671,
    "text": "Is that still rhetoric?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4219.684,
    "end": 4222.806,
    "text": " And is that a quorum if it's a non-conscious quorum?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4223.606,
    "end": 4225.747,
    "text": "Maybe it's a different state when it's non-conscious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4226.267,
    "end": 4244.296,
    "text": "And also when you have internal synesthesia, one of the things that's fascinating to me, I once heard that the assertion that people with perfect pitch might be synesthetes because they're perceiving sound as color, for instance, and they can discern colors more readily in their mental capacity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4244.757,
    "end": 4249.219,
    "text": "So therefore they can discern the notes better than people who can't discern notes as color.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4250.461,
    "end": 4267.971,
    "text": " So again, all those things feel like they work together in terms of is the consciousness that's held, is the mind held in the individual brain of an individual organism and or in the communications among the organisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4268.592,
    "end": 4278.858,
    "text": "And so maybe that takes the rhetoric question and renders it a nullity because maybe it's degrees of quorum that resemble discretion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4279.662,
    "end": 4285.94,
    "text": " And maybe the internal acts of discretion are merely priors that were learned from an externality anyway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4286.241,
    "end": 4287.043,
    "text": "Anyway, a few thoughts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4288.53,
    "end": 4292.252,
    "text": " Yeah, I'm really reminded, Scott, and this is going to turn you up a lot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4292.812,
    "end": 4295.633,
    "text": "This is going to turn up your volume a lot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4296.974,
    "end": 4300.616,
    "text": "So I just learned about the work of Asifa Majid.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4301.196,
    "end": 4308.779,
    "text": "I'm not sure if I'm saying her name right, but she does this amazing work on language, how language shapes thought and how thought shapes language.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4309.86,
    "end": 4315.463,
    "text": "And she looks at, like, in cultures, they have, you know, there was one, I think it's the Jahai culture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4315.503,
    "end": 4318.164,
    "text": "They have, like, 17 different kinds of smells.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4318.584,
    "end": 4319.865,
    "text": " that they like smell.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4319.925,
    "end": 4323.507,
    "text": "And it's like, you know, one of them is like, I mean, we don't have words for smell.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4323.547,
    "end": 4327.83,
    "text": "We just have, it smells like a rose or it smells like meat or whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4327.85,
    "end": 4333.254,
    "text": "So she, you know, but they have actual in their vernacular, they have different words for different smells.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4333.714,
    "end": 4340.719,
    "text": "And, and like in English, we have, you know, a gazillion words for color, but like in some cultures, the color blue and green are the same.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4341.286,
    "end": 4346.709,
    "text": " So, so, uh, and you know, it's the words for like one that was super amazing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4346.769,
    "end": 4353.312,
    "text": "Like we have all this word for like fingertip fingernail, uh, finger hand, forearm, bicep, like a shoulder.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4353.392,
    "end": 4358.314,
    "text": "I mean, all of this in some cultures is one word, your entire arm, every part of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4358.414,
    "end": 4362.356,
    "text": "Like, so you don't discern that there's no difference between your thumb and your shoulder.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4362.436,
    "end": 4363.657,
    "text": "Like that's wild to me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4363.697,
    "end": 4363.897,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4364.217,
    "end": 4366.498,
    "text": "And so how does that, that shape the way that we think about it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4366.958,
    "end": 4368.239,
    "text": "Uh, sorry if I'm rambling, Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4369.83,
    "end": 4371.151,
    "text": " No fun points.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4372.011,
    "end": 4383.677,
    "text": "So as far as how connectivity of communications related to rhetorical outcomes, rhetorical ecosystems, I think they're an analogy to look for would be in the connectivity of brain regions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4384.057,
    "end": 4393.482,
    "text": "And of course, in the SPM toolkit and the dynamic causal modeling that we referenced a bit earlier, because there's brain regions that are anatomically connected.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4393.942,
    "end": 4397.664,
    "text": "So whether they're next door cells or whether there's a long range connection,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4398.484,
    "end": 4412.514,
    "text": " And then there's also like functional and effective connectivity, which are different ways of looking at the signal of dynamical data and then drawing edges in a network where the nodes are the regions and then the edges reflect like a dynamical correlation or.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4413.47,
    "end": 4425.555,
    "text": " Granger causation, which does of course bring it into this whole dynamic causal modeling, the whole question about multi-level cause, cause across different parts of a system that aren't directly touching.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4426.295,
    "end": 4433.037,
    "text": "Is it just our physicalism and our assumptions of materialism that like requires something to be touching to have a direct influence?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4433.538,
    "end": 4440.1,
    "text": "Is it just some sort of anti, you know, non-locality type stance that's very deep prior?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4440.66,
    "end": 4442.321,
    "text": "Is that something that when relaxed",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4442.901,
    "end": 4449.364,
    "text": " provides useful solutions, or just ones that are a bit less susceptible to one argument, but totally susceptible to other arguments?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4450.084,
    "end": 4450.724,
    "text": "Nice questions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4452.665,
    "end": 4453.165,
    "text": "Very nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4454.346,
    "end": 4455.426,
    "text": "Steven, and then Dave.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4457.927,
    "end": 4464.23,
    "text": "Yeah, this idea, the question about structure and the relationship between how things",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4465.384,
    "end": 4487.481,
    "text": " can relate or touch i think it makes uh the way that we bring in date our sensorial information and these cones in a way with a cell you kind of each cell presumably can have this perception that can extend we have these multiple threads of perception that come in you know we've got the visual perception we've got the auditory perception we've got",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4488.261,
    "end": 4491.143,
    "text": " And then how do we structure our narratives?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4491.683,
    "end": 4509.031,
    "text": "Well, if you have a culture which structures the ability to smell, think about smell in that sort of refined way compared to us who maybe gets very involved in the musculature and the nail and the amount of time people spend now on their nails in our culture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4509.611,
    "end": 4513.453,
    "text": " So that will change the structure of the narratives that you're going to tell each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4513.753,
    "end": 4515.635,
    "text": "And that would be interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4515.655,
    "end": 4520.697,
    "text": "And I actually just did a Laban, Laban dance sort of workshop recently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4520.717,
    "end": 4522.979,
    "text": "And they have, they did the verticalities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4523.039,
    "end": 4527.141,
    "text": "One of them, like you've got the base, which is the feet and the floor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4527.822,
    "end": 4530.603,
    "text": "You've got the bowl of the pelvis that you can sort of rock on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4530.643,
    "end": 4538.368,
    "text": "You've got the diaphragm, you've got the base of the mouth and you've got the top of the head as if they're, and they're almost different ways of grounding your, your,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4539.44,
    "end": 4540.841,
    "text": " ways of being, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4540.921,
    "end": 4545.365,
    "text": "And as you go up and down, I think that again speaks to that structuring.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4545.405,
    "end": 4548.427,
    "text": "How much would that change the structure of the narrative?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4548.467,
    "end": 4550.249,
    "text": "And that would change the structure of the memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4550.889,
    "end": 4555.733,
    "text": "And how does that structure of memory play into the structure of memory in this paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4556.014,
    "end": 4558.055,
    "text": "You know, could be interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4558.075,
    "end": 4562.019,
    "text": "Nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4562.199,
    "end": 4562.459,
    "text": "Dave?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4566.897,
    "end": 4571.238,
    "text": " Yeah, the different ways of structuring language are quite striking to me.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4572.339,
    "end": 4578.701,
    "text": "Tagalog is just dramatically different in the way it expresses ideas from the European languages.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4579.101,
    "end": 4580.741,
    "text": "There's no gender, for instance.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4582.382,
    "end": 4591.625,
    "text": "There are three cases, nominative, genitive, and ablative, and almost everything is expressed in all circumstances expressed in the ablative.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4592.145,
    "end": 4592.325,
    "text": "So",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4594.469,
    "end": 4607.159,
    "text": " Where, when, for what purpose, by means of what, for whose benefit, that's all just expressed by putting however many of those clauses there are into the ablative.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4607.179,
    "end": 4612.583,
    "text": "And if you need to be specific, you throw particles in, but they're always optional.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4613.103,
    "end": 4621.37,
    "text": "So if you challenge somebody, well, how do you know what something means in a sentence?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4621.73,
    "end": 4624.052,
    "text": "Well, isn't it obvious if I talk about Monday?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4624.744,
    "end": 4653.702,
    "text": " that when you translate it to English, you'd say on, and when I'm saying at New York, of course you would translate that to in, and for, well, of course you translate it for, but before our son had been in the US for a long time, he was constantly using this at for everything, at three o'clock, at Manhattan, at Pittsburgh,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4654.927,
    "end": 4666.979,
    "text": " at my girlfriend anything other than who's doing the action but who's doing the action isn't expressed in a straightforward way either so it's it's it's pretty wacky",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4672.253,
    "end": 4672.393,
    "text": " Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4672.413,
    "end": 4675.415,
    "text": "Nice thoughts on that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4675.435,
    "end": 4688.221,
    "text": "And pretty wacky is what anybody with a highly precise language like Russian or Chinese would say, you know, when they hear somebody speaking even careful English, this is, wait a minute, you had a not in your sentence.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4688.281,
    "end": 4690.082,
    "text": "What is it exactly that you're negating?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4690.622,
    "end": 4694.324,
    "text": "There's no way to tell what an English speaker means once he's put not into a sentence.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4694.364,
    "end": 4698.506,
    "text": "Or in Russian, it's so strict and so specific, same thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4699.656,
    "end": 4700.596,
    "text": " How do you know in English?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4700.797,
    "end": 4702.177,
    "text": "Well, you just figure it out.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4703.157,
    "end": 4704.698,
    "text": "Don't you just say what you mean?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4704.998,
    "end": 4705.538,
    "text": "No, we don't.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4706.358,
    "end": 4707.459,
    "text": "Let you figure that out.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4708.759,
    "end": 4710.139,
    "text": "Definitely some ambiguity there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4710.239,
    "end": 4720.303,
    "text": "I wonder in cell-to-cell communication, if there's ambiguity in the bioelectric signal, which way should a cell grow or go?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4720.843,
    "end": 4724.044,
    "text": "Touching back onto the language of this multi-scale cognition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4724.064,
    "end": 4724.304,
    "text": "Daniel?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4724.324,
    "end": 4724.604,
    "text": "Daniel?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4725.919,
    "end": 4741.332,
    "text": " So I think to connect this language discussion to the goal and the whole sensing point of the paper, these different ways in which human languages are communicating state updates about the world.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4742.173,
    "end": 4743.534,
    "text": " People are able to live.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4743.654,
    "end": 4745.315,
    "text": "Living people use all these languages.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4745.536,
    "end": 4746.276,
    "text": "So that says a lot.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4746.416,
    "end": 4750.94,
    "text": "It means they're able to be uptaken and transmitted by our cognitive apparatus.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4751.58,
    "end": 4754.722,
    "text": "And then also they're able to persist in a niche.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4755.183,
    "end": 4761.267,
    "text": "It doesn't mean that every language is going to be as successful in any niche, but there is a place where it's successful.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4761.327,
    "end": 4765.35,
    "text": "So just like ants, it's like that algorithm is working there.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4765.37,
    "end": 4768.333,
    "text": "It might be working somewhere else, but it might not be.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4769.013,
    "end": 4782.92,
    "text": " So then we can look at this amazing diversity of language and communication structures, including ones that don't even only use audio or ones that use audio dimensions that we're not using certain sounds or something, but then also the syntactic.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4783.58,
    "end": 4785.281,
    "text": "And then what is the invariance?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4785.862,
    "end": 4787.542,
    "text": "What is actually being communicated?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4788.203,
    "end": 4795.847,
    "text": "That's the structure of what is being shared between agents that are like one another in certain dimensions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4796.687,
    "end": 4801.97,
    "text": " And they're sharing state updates so that they can make it happen in their niche.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4802.65,
    "end": 4809.753,
    "text": "So it's like, there's the total, the diversity is because there's enough in variance for us to recognize it as part of the same category.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4810.493,
    "end": 4813.975,
    "text": "And then there's important things to look at in what it is that's in common.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4816.997,
    "end": 4817.677,
    "text": "Yeah, definitely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4819.558,
    "end": 4823.7,
    "text": "It's definitely like interesting to think about how the, the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4825.546,
    "end": 4832.055,
    "text": " communication shapes, the structure shapes, the, all of that, the structure of society and the structure of a human body.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4832.716,
    "end": 4833.097,
    "text": "Uh, Scott.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4836.365,
    "end": 4840.387,
    "text": " You know, it's so... You guys, this is so fantastic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4840.407,
    "end": 4845.49,
    "text": "This is like... Everything comes together in these conversations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4846.07,
    "end": 4849.412,
    "text": "So I was thinking, what is this reminding me of?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4849.472,
    "end": 4857.497,
    "text": "I just read an article and I was like, is it... Does it remind me of this article, which is about universal chemical synthesis computing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4857.617,
    "end": 4858.037,
    "text": "No.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4858.838,
    "end": 4862.46,
    "text": "Was it about this highly multiplex spatial mapping of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4863.34,
    "end": 4864.54,
    "text": " Microbial communities?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4865.201,
    "end": 4866.181,
    "text": "Sort of, but no.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4866.661,
    "end": 4868.162,
    "text": "What this reminds me of is this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4869.602,
    "end": 4870.882,
    "text": "Space-time from bits.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4871.743,
    "end": 4883.426,
    "text": "This guy, I just read this article, it's about quantum gravity, and what he asserts is gravity is what we perceive as, it's actually entanglement of bits of information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4884.687,
    "end": 4888.848,
    "text": "And so if you take out the entanglement, you have no space-time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4889.671,
    "end": 4895.578,
    "text": " And what I'm thinking is the entanglements we just described, that's everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4896.119,
    "end": 4897.3,
    "text": "We call it mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4897.48,
    "end": 4898.702,
    "text": "We call it society.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4898.802,
    "end": 4900.263,
    "text": "We call it you sociality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4900.303,
    "end": 4901.485,
    "text": "We call it space time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4902.606,
    "end": 4903.147,
    "text": "It's edges.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4904.308,
    "end": 4909.814,
    "text": "And we're characterizing these edges and our affordances are so constrained.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4910.711,
    "end": 4916.495,
    "text": " that we try to describe it, but we're describing it, it's the shadows in the cave, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4916.535,
    "end": 4920.438,
    "text": "We're seeing just indirectly what's actually out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4920.538,
    "end": 4932.608,
    "text": "And one of the things that's enriching about this active inference notion is it provides us with a framing that's sufficiently generic, but also sufficiently robust",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4933.325,
    "end": 4938.289,
    "text": " that it explains things in the stack, in the time stack, in the space stack.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4938.81,
    "end": 4941.572,
    "text": "It's kind of like, wow, this may be how things interact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4942.313,
    "end": 4944.414,
    "text": "Maybe things are entangled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4945.215,
    "end": 4949.098,
    "text": "And we use the word internal model and external reality and yeah, yeah, yeah, yeah, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4949.839,
    "end": 4956.665,
    "text": "But maybe the nature of rhetoric and maybe the nature of entanglement is the seeking of connection",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4958.519,
    "end": 4961.12,
    "text": " by negentropy systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4961.18,
    "end": 4969.302,
    "text": "So I, you know, my life definition is that living systems are autocatalytic and entropy secreting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4971.643,
    "end": 4975.324,
    "text": "My son said I just wanted to use the word secreting because it sounded gushy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4976.304,
    "end": 4986.107,
    "text": "But if they're autocatalytic and entropy secreting, then if you're a system that's living, you're going to want to seek out other living systems because you need reproductive and nutritional opportunities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4987.068,
    "end": 4989.75,
    "text": " in order to be auto-catalytic and entropy secreting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4991.05,
    "end": 4994.492,
    "text": "And it goes to the frog nervous system rules, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4994.612,
    "end": 4997.834,
    "text": "If frog encounters something that's smaller than it and it moves, it eats it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4997.894,
    "end": 5000.156,
    "text": "If it's larger than it and it moves, it runs away.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5000.216,
    "end": 5003.077,
    "text": "And if it's the same size as it and it moves, it mates with it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5003.818,
    "end": 5007.62,
    "text": "Very simple rules that let a frog be a frog, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5008.341,
    "end": 5015.585,
    "text": "So it feels like maybe what we're banging up against is too many words that we're throwing at simple concept",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5016.795,
    "end": 5025.039,
    "text": " And maybe what we're talking about is harmonic coupling of living systems that are seeking other negentropy states either to consume or mate with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5026.82,
    "end": 5038.686,
    "text": "The last point, I have a poster that I got from a guy in San Francisco and it's in my shop and it says, Futurism, imagining a fake future in the hope that the real future will come along and mate with it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5041.104,
    "end": 5044.406,
    "text": " And that's kind of like what we do in active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5044.426,
    "end": 5052.911,
    "text": "We're imagining our way into a, we're perceiving an externality just because our perceptions say, okay, there's something you don't control out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5053.491,
    "end": 5055.913,
    "text": "And then we try to mate with it or eat it or run away from it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5059.235,
    "end": 5068.02,
    "text": "I was reminded of the light cone slide here when we're talking about space and time and edges and how Daniel included the slide.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5068.482,
    "end": 5072.993,
    "text": " How, like, light is the boundary between space and time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5073.233,
    "end": 5075.158,
    "text": "Like, that's kind of, that trips me out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5076.381,
    "end": 5077.363,
    "text": "Stephen and then Danielle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5079.505,
    "end": 5103.452,
    "text": " Yeah, I think when we be interesting to also, I think this opens up maybe a revisiting or with this, with Chris Fields and some of this work about quantum contextuality as well, because as you start to, because one thing that he did mention in his presentation, you know, there's this question about when it goes from being contextual, which is, or quantum like, which is a highly constrained set of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5105.353,
    "end": 5111.299,
    "text": " options basically once you've got more options for movement things start to move into more classical",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5112.324,
    "end": 5138.511,
    "text": " even if there's loads of quantum stuff going on at the small scale, they all average out and effectively the gas in my room is behaving similar to the gases in all the rooms that we're in, in a generic sense, only if we went into the sort of, and there's a question that comes up then around this sequencing and because where is that sequencing possibly constrained enough that you might hit some things like that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5138.531,
    "end": 5141.472,
    "text": "And is that part of what happens at these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5143.024,
    "end": 5144.705,
    "text": " you could call them meso levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5144.765,
    "end": 5151.426,
    "text": "I mean, the surface of a cell is small, but it's not small from an atomic point of view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5151.486,
    "end": 5153.227,
    "text": "It's still relatively aggregated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5153.887,
    "end": 5157.668,
    "text": "Yet we're getting these distinct flips in charge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5158.268,
    "end": 5162.93,
    "text": "And is it plausible that anything as big as the brain can also do something like that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5163.67,
    "end": 5167.811,
    "text": "And it may be that the term quantum is not necessary in that sense, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5168.632,
    "end": 5189.133,
    "text": " um it'd be interesting to think about what what importance is there to be a constrained set of sequences a bit like daniel mentioned if a certain molecule is released and then another one's released and then another one's released that could be some sort of type of rhetorical dynamic but that there needs to be a constraint so that it's not just part of the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5190.194,
    "end": 5218.771,
    "text": " classical noise you know it's not just swamped by a big flux of randomness right that it actually is a sequence even if it's not as clear as you know so that might be an interesting question I don't know whether it's a fair question to put to Mike if that's is or maybe it's more of a Chris Fields type question but I know they work together so they might have talked about some of this definitely Daniel and then Scott",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5220.612,
    "end": 5230.535,
    "text": " Yep, it was a key theme in this paper and in cybernetics in general that goal seeking and planning as inference is a big area.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5230.575,
    "end": 5232.595,
    "text": "That's why we're always talking about control theory.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5233.336,
    "end": 5240.898,
    "text": "And it is interesting to wonder how does the bioelectricity play a role in goal setting and then in basically",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5241.638,
    "end": 5269.12,
    "text": " policy selection because you know active inference we don't just specify which trajectory is going to be like the preferred one and then uh condense it down to a single summary statistic it's like there's the preferred states with the c and then the affordances with the e and then there's a equation that is selecting policies based upon you know a combination of different ways of phrasing some of the variables so then it's like how does that framing which is not just one way of going about doing",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5270.236,
    "end": 5275.261,
    "text": " What is it going to allow us to say about like how systems actually plan?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5275.281,
    "end": 5283.669,
    "text": "And I think that's kind of related to the hint in figure two on 32, like possible alien comma AI.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5284.77,
    "end": 5293.699,
    "text": "It's saying that this framework wouldn't just help us describe systems, but recognize systems that we didn't have ways of recognizing otherwise, perhaps.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5295.945,
    "end": 5296.445,
    "text": " Nice point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5296.665,
    "end": 5301.987,
    "text": "And if, you know, if another system was communicating with us, how would we know, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5302.027,
    "end": 5304.428,
    "text": "Like what would that even look like?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5304.888,
    "end": 5305.208,
    "text": "Scott?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5308.409,
    "end": 5310.13,
    "text": "Have you guys seen this article?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5313.666,
    "end": 5315.787,
    "text": " Decoding and perturbing decision states in real time.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5315.987,
    "end": 5316.147,
    "text": "No.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5316.867,
    "end": 5322.95,
    "text": "It's P-E-I-X-O-T-O, Diogo Pizzotto.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5323.13,
    "end": 5324.19,
    "text": "It's about decision states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5324.27,
    "end": 5326.631,
    "text": "It seems like it's very similar to what we're talking about here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5328.232,
    "end": 5330.893,
    "text": "25th of March, 2021, from Nature magazine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5332.693,
    "end": 5335.715,
    "text": "And then Verhein, V-E-R-H-E-I-N, is another author.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5336.954,
    "end": 5346.89,
    "text": " One of the things... The reason I was holding that up... One of the things I was just writing down... You know, light cones... Lights... Bosons...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5347.768,
    "end": 5347.968,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5348.088,
    "end": 5350.169,
    "text": "Photons are both are bosons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5350.709,
    "end": 5359.152,
    "text": "And one of the things I always fuss with a little bit is, OK, is there a difference between fermionic and bosonic physics here that we need to attend to?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5359.212,
    "end": 5361.993,
    "text": "So the idea of fermions, I was thinking of them as firm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5363.194,
    "end": 5371.397,
    "text": "So they make up matter and bosons make up energy stuff and information is carried by bosons, but also carried by embodiments in in fermions and stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5372.495,
    "end": 5386.62,
    "text": " And so it's so interesting to me that how does the persuasion, the rhetoric, the history get embodied both sonically and fermionically?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5386.66,
    "end": 5395.423,
    "text": "Again, you have the peacock and you have the birds and the animals that develop certain physicalities over time as communication, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5395.763,
    "end": 5400.585,
    "text": "And it's a deep time communication and there's less discretion in it, let's say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5401.192,
    "end": 5405.533,
    "text": " They can exercise it or not, but it's embodied in the physicality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5406.393,
    "end": 5413.894,
    "text": "And then there's the action that they take, which is, again, they have the physicality with which they act.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5414.414,
    "end": 5416.375,
    "text": "So what are the instruments given them physically?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5417.035,
    "end": 5422.276,
    "text": "But then they convey information by the behaviors they engage in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5423.096,
    "end": 5426.576,
    "text": "And I keep coming back and thinking, well, it's kind of interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5427.477,
    "end": 5429.237,
    "text": "If we look at the carrier signal,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5430.416,
    "end": 5445.853,
    "text": " again of information um is it in fact bosonic always it's things are carried by light i guess things carried by sound are being carried fermionically by the pressure in the sound wave i'm not sure but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5446.574,
    "end": 5459.161,
    "text": " So maybe the medium, I was just wondering whether the medium relates to the notion of rhetoric and if there's a purer form of information transfer when it's bosonic rather than fermionic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5459.221,
    "end": 5462.283,
    "text": "And maybe that's getting way too reductionist on the thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5462.323,
    "end": 5468.366,
    "text": "But I wondered whether light cones in their purest form, which presumably involve light, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5468.386,
    "end": 5472.148,
    "text": "The original light traveling out and it can only go this way and you can't be beyond it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5473.028,
    "end": 5479.474,
    "text": " And, Blue, when you said before it was a statement that what is it outside the light cone?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5479.494,
    "end": 5483.997,
    "text": "There is no it's like the defines the edge of space time for the observer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5485.098,
    "end": 5487.68,
    "text": "And so what's what's out there is an externality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5487.7,
    "end": 5498.228,
    "text": "It feels like that boundary when that's known to other parties, maybe in communication, we're trying to do is think outside the light cone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5498.248,
    "end": 5501.331,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5503.177,
    "end": 5527.015,
    "text": " really nice uh daniel and then steven so the part of the light cone going forward in time is anticipation and if we take anticipation again not to be like a metaphysical claim about what systems are really doing but what the system is anticipating outwards that entails a generative model through time of the states that matter",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5527.475,
    "end": 5538.557,
    "text": " for this kind of an agent, which is the internal state of the model itself, the blanket states, which are sense and action, expected outcomes and expected actions, and then the state of the niche, the external states.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5539.017,
    "end": 5551.24,
    "text": "So kind of operationalizing the light cone as a specific prediction on specific variables might be helpful and kind of give a little bit more insight into how it could be used in a computer.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5552.04,
    "end": 5556.703,
    "text": " And then also, just to Scott, your point about the media is the message, essentially.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5557.283,
    "end": 5560.065,
    "text": "It's like a multi-scale media is the message.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5560.125,
    "end": 5564.087,
    "text": "It's not just bold print type versus cursive.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5564.688,
    "end": 5569.05,
    "text": "It's actually like you're bringing up types of subatomic particles.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5569.11,
    "end": 5571.812,
    "text": "That media is ether, the ultimate media.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5572.272,
    "end": 5574.013,
    "text": "The nature of the media does matter.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5574.573,
    "end": 5576.434,
    "text": "And yeah, it's a trade-off space with...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5577.335,
    "end": 5583.298,
    "text": " peptides, you have a larger signaling space than the small molecules, like the combinatorics are just different.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5583.878,
    "end": 5592.682,
    "text": "But that entails totally new challenges like with specificity or cross activation of neuropeptides or how do you keep them linked through evolutionary time?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5593.243,
    "end": 5602.287,
    "text": "And then we see sort of insights into those design tradeoffs when we see like, wow, there are like a lot of neuropeptides that come from one precursor longer protein.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5602.867,
    "end": 5607.831,
    "text": " So that suggests that their co-regulation is held together through specific design principles.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5608.511,
    "end": 5618.379,
    "text": "So those are really interesting questions about how like the speed and the frequency and the bandwidth of different information channels structure how they end up performing.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5621.461,
    "end": 5622.342,
    "text": "Nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5622.382,
    "end": 5623.383,
    "text": "Stephen and then Scott.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5625.586,
    "end": 5627.267,
    "text": " Yeah, I think, Daniel, you're making a good point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5627.327,
    "end": 5638.856,
    "text": "And it feeds on with this question about time scales and is if we assume that slides up the one that's there with the tick and the dog and human and possible alien.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5639.716,
    "end": 5641.477,
    "text": "And so the cones there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5641.978,
    "end": 5648.362,
    "text": "Yes, it's very useful to think of it in terms of I've got my maximum information now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5648.462,
    "end": 5651.445,
    "text": "Maybe my maximum information was even a little bit in the past.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5652.622,
    "end": 5655.763,
    "text": " But it depended on what regime of attention I was applying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5655.783,
    "end": 5657.604,
    "text": "I made choices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5657.864,
    "end": 5666.548,
    "text": "So as I make choices into the present, I reduce the possible coned extent I've got available.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5666.568,
    "end": 5674.631,
    "text": "And as I bring things only into my conscious awareness, certain things are going to be left out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5676.092,
    "end": 5694.448,
    "text": " bringing that into, okay, this is a particular type of future I might predict based on my regime of attention is actually probably more useful in some ways to this, because the cone going out, it's a nice idea, but it can lead to thinking that we know more and more in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5694.508,
    "end": 5696.79,
    "text": "There's more and more futures out there, which is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5698.1,
    "end": 5701.383,
    "text": " there is more and more futures, but not necessarily coming out from us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5701.403,
    "end": 5707.127,
    "text": "So it could be, this is a bit more like, okay, my cone could move around a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5707.928,
    "end": 5715.954,
    "text": "And there is actually a lot of analogy with that because now a lot of futures work, they're actually saying you're better off picking a scenario in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5717.076,
    "end": 5734.141,
    "text": " building out the scenario in the future as a separate thing, not inheriting your present, because that will always bias you, and then bring it back, bring your present, which is what you know and your assumptions here, and sort of bridging the two in terms of the narrative, rather than this idea of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5734.961,
    "end": 5744.465,
    "text": " I can go, because I could just be going with all my assumptions and all my pre-assumptions from the present and making all these stories about the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5744.486,
    "end": 5752.449,
    "text": "And it almost starts from a singularity in those other diagrams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5752.489,
    "end": 5755.551,
    "text": "It goes from a singularity and opens up, whereas actually, really,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5756.448,
    "end": 5759.19,
    "text": " the widest is now potentially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5759.31,
    "end": 5765.833,
    "text": "This is the most information I have potentially available, or at least within the 10 or 20 seconds of this moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5767.094,
    "end": 5775.578,
    "text": "So I think that actually there's other ways that this could change the way people think about sense-making in time and space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5779.2,
    "end": 5780.901,
    "text": "Really super nice point, Stephen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5781.702,
    "end": 5781.962,
    "text": "Scott?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5783.3,
    "end": 5811.163,
    "text": " wow steven wow i mean that's so awesome when it makes me think okay first of all encoding and decoding okay so something i i just wrote down mutations encode new speculative space-time so mutation gives you access it's a random mutation that gives you access to space-time you weren't intending to access",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5811.912,
    "end": 5813.574,
    "text": " And the same thing with externalities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5813.654,
    "end": 5815.776,
    "text": "If another thing comes in, and this is jazz.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5816.437,
    "end": 5817.698,
    "text": "This is jazz genetics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5818.649,
    "end": 5818.849,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5819.409,
    "end": 5826.012,
    "text": "Is you get mutations and it's like, whoa, I didn't want to access that that new light cone area, but I guess I'm there now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5826.572,
    "end": 5828.332,
    "text": "OK, let's see what we got here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5828.893,
    "end": 5833.994,
    "text": "And that's pretty awesome, because otherwise you'd be settled in your ways and you'd never see that space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5834.054,
    "end": 5837.455,
    "text": "That light cone area would never open up and you don't know what it's going to be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5837.475,
    "end": 5837.816,
    "text": "You don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5838.056,
    "end": 5842.117,
    "text": "It's like I always said to my kids, life is a one act play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5842.517,
    "end": 5843.217,
    "text": "No rehearsals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5843.598,
    "end": 5844.298,
    "text": "That's a light cone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5845.137,
    "end": 5845.317,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5845.397,
    "end": 5847.339,
    "text": "You just go through and it's like, OK, here we go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5847.78,
    "end": 5852.585,
    "text": "So that idea of encoding and decoding is kind of interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5852.605,
    "end": 5857.63,
    "text": "So you have this the we go out there in the world and we're like, OK, I want to interpret the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5858.031,
    "end": 5861.094,
    "text": "Now, some things were encoded with intention to communicate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5862.102,
    "end": 5867.646,
    "text": " music, speech, some things who are encoded with intention to obfuscate, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5867.726,
    "end": 5868.927,
    "text": "Cryptography stuff, whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5869.408,
    "end": 5875.312,
    "text": "Some things were encoded with no intention to communicate, but they do communicate like, oh, leaves are green.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5875.412,
    "end": 5880.396,
    "text": "So therefore over time, we figure out that they have magnesium in the photosynthetic cycle or whatever, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5880.436,
    "end": 5886.201,
    "text": "So they're not, the color is encoded in the thing, but the tree is not intending to say I'm doing photosynthesis, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5886.221,
    "end": 5888.703,
    "text": "It's just, we now take that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5889.423,
    "end": 5917.703,
    "text": " perception and can decode something that was never encoded with discretion i guess or intention by the organism or whatever you know where i'm going with that so this notion of this light cones and if from the perceiver's perspective we can decode what's in a light cone we can decide an artist decodes a light cone and somebody else seeing the same perceptions would not have the same light cone",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5918.567,
    "end": 5918.747,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5919.168,
    "end": 5921.51,
    "text": "Somebody with different priors can see things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5921.57,
    "end": 5927.956,
    "text": "A person who knows history will not repeat it because they see the same history now and they go, whoa, whoa, whoa, whoa, whoa.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5927.996,
    "end": 5929.238,
    "text": "That looks like an insurrection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5929.938,
    "end": 5933.262,
    "text": "Like their light cone is more trained to the possibility that it's an insurrection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5933.722,
    "end": 5933.902,
    "text": "So.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5935.304,
    "end": 5938.267,
    "text": "This last couple of comments are fascinating to me that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5939.929,
    "end": 5940.95,
    "text": " We're moving through space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5940.97,
    "end": 5942.492,
    "text": "We have this active inference model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5942.832,
    "end": 5943.833,
    "text": "We're running a model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5943.933,
    "end": 5948.578,
    "text": "There's myriad other models and non-models out there that we're seeking to decode.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5949.199,
    "end": 5953.082,
    "text": "Some subset of them were intended to be coding information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5953.823,
    "end": 5954.924,
    "text": "Some subset are not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5955.585,
    "end": 5957.687,
    "text": "And we're just moving through space, decoding everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5958.528,
    "end": 5960.03,
    "text": "Some of it will be false signals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5960.05,
    "end": 5961.311,
    "text": "Some of it will be actual signal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5961.691,
    "end": 5962.732,
    "text": "And so the light cones...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5963.737,
    "end": 5977.148,
    "text": " The experience we have obviously can never be replicated by another person with different priors, but also in real time, I don't know what the equivalent is of a cacophony of light cones, a babble of light cones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5977.628,
    "end": 5978.769,
    "text": "It's like that ice cream cone again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5978.789,
    "end": 5980.991,
    "text": "There's too much ice cream maybe in the cone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5982.112,
    "end": 5986.816,
    "text": "Anyway, it's fascinating notion of that over decoding in a way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5988.126,
    "end": 5996.878,
    "text": " And maybe the scientific method has something to do with a rigor on the over-decoding that can happen with alchemy or something like that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6001.264,
    "end": 6001.764,
    "text": "Nice point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6001.945,
    "end": 6002.946,
    "text": "Daniel and then Stephen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6004.389,
    "end": 6020.733,
    "text": " So to Scott's point about the mutation as accessing spatial temporal zones, like expanding into space time, I thought, OK, maybe there's some quantum 4D, 3 plus 1 interpretation of that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6020.853,
    "end": 6024.954,
    "text": "But how can we think about that with the information that we already empirically know?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6025.454,
    "end": 6029.975,
    "text": "And it's actually that mutations in developmental biology, developmental genetics,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6030.615,
    "end": 6041.787,
    "text": " facilitate the exploration of new developmental space and time, like by slowing down or speeding up the way that a certain cell type is susceptible to a hormone or something like that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6042.348,
    "end": 6045.611,
    "text": "So what's being played with is actually the level faster.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6046.232,
    "end": 6049.296,
    "text": " because that's why there's the intergenerational transmission of those mutations.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6049.657,
    "end": 6061.173,
    "text": "But then what they're actually modifying, like the source code, but not exactly in that way, of course, is how the system bootstraps and modifies itself through development and learning.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6061.934,
    "end": 6064.736,
    "text": " And then how can we think about active inference in that way?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6065.116,
    "end": 6082.528,
    "text": "Well, we can think about the mutations as modifying the initial parameters or some of the state variables for the parameters that are important for an active inference agent, like the structure of its internal generative model, its blanket states, like its sensory and action affordances, and then the niche.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6083.248,
    "end": 6095.217,
    "text": " So that's a way where we can have the generality to talk about potentially a system across different scales, but then when we're ready to actually formalize it and then ask how to design communication in that niche.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6098.039,
    "end": 6098.599,
    "text": "Nice point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6098.82,
    "end": 6099.18,
    "text": "Stephen?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6101.662,
    "end": 6105.024,
    "text": "Yeah, that's a good point, thinking about those different timescales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6105.224,
    "end": 6111.109,
    "text": "And sort of following on from that, you've got this question of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6113.362,
    "end": 6121.849,
    "text": " So maybe the things are happening at this light speed and there's a lot of electrical activity happening in these cells and groups of cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6123.31,
    "end": 6126.212,
    "text": "And we've got these structures that we can come together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6126.312,
    "end": 6133.418,
    "text": "And of course, we then have this intermodal integration between different cells, nerves coming in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6134.019,
    "end": 6135.26,
    "text": "And the question then also is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6137.105,
    "end": 6147.27,
    "text": " As it's coming in, say, from my body to my brain, my feet are seeing the world in the past compared to my nose, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6147.31,
    "end": 6151.132,
    "text": "Because it takes longer for the sort of information to travel up from my foot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6152.113,
    "end": 6159.497,
    "text": "The speed of light traveling, but by the time it does that through all the chemical interactions, you know, it's milliseconds, not seconds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6160.317,
    "end": 6185.196,
    "text": " billionths of a second so it's coming together in this structure of the body which has grown to you know to integrate it but at some point the system has to calibrate it has to calibrate so that it doesn't think that my foot is in a different time to my nose or my ears or my fingers right so that sort of brings that question of of um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6186.865,
    "end": 6191.358,
    "text": " some of this multi-scale stuff will come out of these kind of electrical...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6192.694,
    "end": 6198.339,
    "text": " light speed dynamics, but then it's going to also come into the, uh, the structures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6198.379,
    "end": 6199.881,
    "text": "I think that Daniel was talking about structures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6199.901,
    "end": 6214.474,
    "text": "We all sort of mentioned structures and then there's going to be a system that sort of at times has to sort of tweak it, you know, and maybe that system's not needed when you've got a small set of cells that are all firing electrically and doing other chemical signals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6214.494,
    "end": 6217.376,
    "text": "They just, the structure's enough in a way, but, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6218.457,
    "end": 6224.501,
    "text": " So, yeah, I thought that might be an interesting question to ask Michael as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6224.941,
    "end": 6227.302,
    "text": "How does that kind of play out with this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6230.764,
    "end": 6231.004,
    "text": "Nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6231.324,
    "end": 6232.465,
    "text": "Daniel and then Scott.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6233.53,
    "end": 6235.331,
    "text": " Yeah, just a quick comment on that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6235.771,
    "end": 6242.074,
    "text": "So the signal processing or the sort of outside in perspective would suggest that there would have to be like a recalibration.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6242.634,
    "end": 6250.398,
    "text": "Then the generative model out way of thinking is that the generative model is that like your hands clap and the sound and the visual are the same event.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6251.238,
    "end": 6266.466,
    "text": " So there isn't as much of a calibration of inputs as there is a reconciliation of deep temporal models, which are timed based upon the inferred causal structure of the world, which is usually not two separate events, but rather one.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6267.086,
    "end": 6275.11,
    "text": "And then that is actually just embodied in the sensory relay, which does take different amounts of time to transfer from different parts of the body.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6277.768,
    "end": 6300.377,
    "text": " nice scott yeah okay i just just one thing on that i'm just before scott that's a good point i think that's interesting yeah thinking about predictive processing and not getting caught up in the in that's where it's tricky because it's it's not directly an input it's a kind of error message so yeah that's cool that's not the part that's experienced yeah and the parsing of that opens up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6301.697,
    "end": 6302.998,
    "text": " right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6303.038,
    "end": 6307.061,
    "text": "If you can parse the different pieces and start to break it down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6307.481,
    "end": 6309.022,
    "text": "It is last couple of pieces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6309.122,
    "end": 6311.984,
    "text": "I thought, you know, the occupy movement, occupy wall street.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6312.624,
    "end": 6314.045,
    "text": "It feels like active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6314.326,
    "end": 6316.607,
    "text": "We should have t-shirts made up, occupy light cone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6318.868,
    "end": 6322.471,
    "text": "Cause everyone's, every organism is trying to occupy everyone else's light cone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6323.211,
    "end": 6330.176,
    "text": "I think, I mean, and when I, so we worked for Microsoft for, at the law school, we had a program, Microsoft paid,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6331.327,
    "end": 6341.094,
    "text": " professors, intellectual property professors, to go to China to teach intellectual property professors in China and in India US IP law concepts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6341.994,
    "end": 6344.076,
    "text": "Now, why was Microsoft doing that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6344.136,
    "end": 6347.938,
    "text": "They were doing that because they were trying to render the externality innocuous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6348.078,
    "end": 6351.341,
    "text": "There was a piracy externality that they were dealing with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6351.801,
    "end": 6359.026,
    "text": "And so they thought if they teach the teachers in those jurisdictions about the value of intellectual property,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6359.645,
    "end": 6369.953,
    "text": " and then teach the lawyers at the law schools, the teachers teach the lawyers those notions, then the Microsoft notions of intellectual property, they'll be left software privacy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6369.973,
    "end": 6372.395,
    "text": "So that was, they weren't doing it for beneficence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6372.415,
    "end": 6374.617,
    "text": "They were doing it to render the externality innocuous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6374.997,
    "end": 6381.402,
    "text": "They were trying to occupy the light cone of a culture, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6381.482,
    "end": 6385.706,
    "text": "With this affordance shifting by mutating the,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6387.071,
    "end": 6390.973,
    "text": " teachers' views and the way they taught intellectual property law.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6391.813,
    "end": 6404.52,
    "text": "So that to me, there's a, I once heard a quote that trees were bullies because trees suck up the water and the light in an area, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6404.54,
    "end": 6406.32,
    "text": "You know, they bully other plants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6406.38,
    "end": 6407.901,
    "text": "And I always thought, you know, trees are so nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6407.981,
    "end": 6409.602,
    "text": "And I always think of trees as bullies now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6410.282,
    "end": 6415.645,
    "text": "And it's kind of interesting when an organism is applying rhetoric or other",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6416.448,
    "end": 6418.112,
    "text": " vehicles to sweep in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6419.844,
    "end": 6426.449,
    "text": " And, you know, like pigeons, when they do pigeon racing, when you try to pigeons try to flock and you try to grab everyone else's pigeons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6426.53,
    "end": 6426.73,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6427.43,
    "end": 6435.577,
    "text": "Or I don't know in hive behaviors if hives pick up other bees and that makes them fitter as hives or if there's mixing of bees when they do swarming.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6435.617,
    "end": 6436.798,
    "text": "I don't know the answer to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6436.838,
    "end": 6438.459,
    "text": "I just don't know enough about bee biology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6438.92,
    "end": 6449.088,
    "text": "But it is kind of interesting that light cones maybe are pretty darn aggressive for living things, trying to render externalities innocuous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6450.62,
    "end": 6456.583,
    "text": " And maybe that goes to Gaia theory, that ultimately, what's the light cone for Gaia?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6461.145,
    "end": 6463.467,
    "text": "Yeah, the biggest light cone of them all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6464.347,
    "end": 6473.592,
    "text": "Just what you were saying made me think of maybe, you know, we think about it as a light cone, but maybe what we're looking at is like an information cone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6474.364,
    "end": 6495.925,
    "text": " know and so like like a concentration of information within an individual because in the end we dissipate you know there's no more information concentrated there uh stephen yeah it might be a question when we're thinking about this term light cone and i was walking home last night and i could see the clouds and i could see the lightning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6497.073,
    "end": 6501.217,
    "text": " but I could only hear the thunder, you know, five seconds later or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6501.318,
    "end": 6505.422,
    "text": "So the information cone on the audio was different to the information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6505.942,
    "end": 6511.649,
    "text": "If it is an information cone and then, I don't know the smell of the, the rain or the change of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6512.149,
    "end": 6513.09,
    "text": "So, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6514.275,
    "end": 6536.489,
    "text": " might be interesting how much the the maybe some elements in certain scales where really it's light it's about the speed of light i mean near enough so that's what it is or maybe it's a broader category which could roll out into these other spatial temporal modalities yeah the uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6537.259,
    "end": 6542.363,
    "text": " So, I mean, you know, when you're in a space, if you wake up in a dark room, what's the first thing you do?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6542.683,
    "end": 6544.284,
    "text": "Like, where am I, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6544.564,
    "end": 6545.145,
    "text": "Turn on the light.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6546.085,
    "end": 6550.088,
    "text": "That's a very human way to maximize your information gain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6550.749,
    "end": 6552.83,
    "text": "I mean, not every organism obviously can see light.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6553.631,
    "end": 6553.891,
    "text": "Daniel?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6555.933,
    "end": 6574.805,
    "text": " I think my closing thought on this would just be that it really speaks Steven's story about how there actually was a temporal structuring, even though you cognitively knew it was a single event, you actually classified it into a separate kind of event, which is like the exception that proves the rule that suggested long, long ago that the speed of sound and light were different.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6575.846,
    "end": 6580.789,
    "text": "How are we gonna make sense of this total continuum of signaling in the niche?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6581.889,
    "end": 6584.572,
    "text": " We can think about ostensive cues and helping you plan.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6584.972,
    "end": 6591.779,
    "text": "There's something when you smell something and you have eight hours to plan for the storm versus you hear the lightning strike, you have a half second to plan, et cetera.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6592.259,
    "end": 6600.687,
    "text": "So we can think about the structuring of different kinds of cues in the niche as giving information that is in light of a generative model",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6601.863,
    "end": 6603.945,
    "text": " able to be used for anticipation and action.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6604.745,
    "end": 6611.31,
    "text": "So that's just speaking to how core Active Inference is to thinking about these different processes coming together.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6611.33,
    "end": 6617.595,
    "text": "And it's why it'll be awesome to get the author's perspective on all of this and what Active Inference is going to do.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6619.576,
    "end": 6619.836,
    "text": "Nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6620.076,
    "end": 6622.118,
    "text": "Scott, you have a final thought for us?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6622.813,
    "end": 6635.721,
    "text": " Yeah, just again that I'm still intrigued by the notion of the entanglement creating space-time and this whole discussion of time cones and the time cones in the relation of space-time relatively theory, etc.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6636.362,
    "end": 6645.047,
    "text": "And I feel like this one thing that active inference has done whatever it's and it's powerful in many ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6645.267,
    "end": 6651.932,
    "text": "One thing it's done is allowed me to open up my mind to processes that feel like they're",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6653.317,
    "end": 6656.86,
    "text": " replicated across time and scales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6657.7,
    "end": 6672.651,
    "text": "And that's interesting because whether or not they're strictly fall within active inference math and rigor, the model has opened up so many different ways of thinking about things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6673.252,
    "end": 6679.517,
    "text": "And the entanglement notion where we think of two, is it two particles or one, spooky action at a distance?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6680.689,
    "end": 6685.152,
    "text": " It feels like everything else we're talking about, active inference is spooky action at a distance for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6685.332,
    "end": 6687.674,
    "text": "It's just that it's a different spooky action at a distance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6688.315,
    "end": 6692.598,
    "text": "And so it's fascinating, the notion of entanglements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6692.658,
    "end": 6699.603,
    "text": "And it feels like light cones may be describing the things that are amenable to be entangled or coupled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6700.791,
    "end": 6713.385,
    "text": " And so maybe if it's an information cone, that's an interesting notion that we can start to say communities expand out that which is amenable to coupling because they widen the light cones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6714.967,
    "end": 6721.374,
    "text": "So that using that rhetoric may start to be a way that we can illustrate the benefits of coupling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6721.929,
    "end": 6724.891,
    "text": " community-based behaviors and things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6724.931,
    "end": 6732.736,
    "text": "So we can start to bring this back and say, look, you can't see around the corner, but that person who's up there, they're standing there and they can see around the corner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6732.756,
    "end": 6735.078,
    "text": "And if they can talk to you, they can tell you what's around the corner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6735.738,
    "end": 6737.619,
    "text": "So maybe that's good, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6738.099,
    "end": 6741.001,
    "text": "And so maybe that's contact tracing for pandemics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6741.101,
    "end": 6747.766,
    "text": "Maybe that's giving the neighborhood watch for other toxic things in the environment, whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6748.186,
    "end": 6750.888,
    "text": "So it feels like this gets simple enough",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6751.872,
    "end": 6759.957,
    "text": " You know, people may not want to know about light cones or whatever, but they it starts to get the entanglement and that notion of cause and effect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6761.158,
    "end": 6766.241,
    "text": "Feels like there's a story that we can tell here and illustrate pretty simply.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6767.622,
    "end": 6768.802,
    "text": "Anyway, it's exciting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6769.042,
    "end": 6773.225,
    "text": "It's an exciting conversation, some wonderful stuff, and it's delightful to be back in the conversation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6774.358,
    "end": 6783.767,
    "text": " So just to come to the author's final point in this, the dissolution of the self, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6783.807,
    "end": 6786.57,
    "text": "This is like the practice of Zen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6787.491,
    "end": 6795.078,
    "text": "He says, it is striking that the process which Zen practice is meant to reverse attachment to past memories and high valence for future expectations or fears.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6795.658,
    "end": 6799.981,
    "text": " is precisely the process suggested to be responsible for the creation of complex selves.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6800.561,
    "end": 6807.526,
    "text": "So I want to know what happens to the informational light cone in this like dissolution of the self.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6807.606,
    "end": 6816.872,
    "text": "Does it like, you know, turn into lots of little light cones as is kind of implied in like the one figure, or does it just like poof and like dissipate?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6816.932,
    "end": 6817.252,
    "text": "I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6817.312,
    "end": 6818.593,
    "text": "It's interesting to think about",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6819.413,
    "end": 6827.616,
    "text": " That for me, he says it's unclear whether it's beneficial or even possible to truly live in the moment and let go of past memories and future expectations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6827.996,
    "end": 6833.878,
    "text": "But anyone who succeeded in doing this would achieve precisely what Zen promises, the dissolution of the self.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6834.958,
    "end": 6835.798,
    "text": "So thanks, everyone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6835.838,
    "end": 6842.74,
    "text": "This has been a super interesting discussion, and I am looking forward to our conversation, hopefully with the author next week.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6843.941,
    "end": 6844.181,
    "text": "Thanks.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6844.381,
    "end": 6844.981,
    "text": "Nice work, Blue.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6845.281,
    "end": 6845.561,
    "text": "Thanks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6845.581,
    "end": 6846.221,
    "text": "Thanks very much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6846.281,
    "end": 6846.762,
    "text": "Take care.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6846.802,
    "end": 6847.442,
    "text": "Have a great day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6847.602,
    "end": 6848.162,
    "text": "Bye, everyone.",
    "speaker": "SPEAKER_03"
  }
]