[
  {
    "start": 35.438,
    "end": 35.878,
    "text": " Go for it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 37.078,
    "end": 37.758,
    "text": "Hello, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 38.039,
    "end": 42.479,
    "text": "Welcome to Acton Flab live stream number 25.0.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 42.659,
    "end": 55.462,
    "text": "Today is July 1st, 2021, and we're going to be talking about this paper, The Computational Boundary of a Self, Developmental Bioelectricity Drives Multicellularity and Scale-Free Cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 56.062,
    "end": 58.543,
    "text": "I'm Blue, and I'm here with Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 59.383,
    "end": 59.743,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 61.028,
    "end": 65.049,
    "text": " So welcome to the Active Inference Lab, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 65.249,
    "end": 71.691,
    "text": "We are a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 72.271,
    "end": 74.292,
    "text": "You can find us at the links here on this page.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 74.852,
    "end": 81.554,
    "text": "This is a recorded and archived livestream, so please provide us with feedback so that we can improve our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 82.274,
    "end": 84.475,
    "text": "All backgrounds and perspectives are welcome here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 85.055,
    "end": 87.856,
    "text": "We will be following good video etiquette for livestreams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 88.749,
    "end": 96.015,
    "text": " Here at the short link, you will find all of the live streams and different series that we do in the communications unit of the Active Inference Lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 97.297,
    "end": 109.848,
    "text": "And today we're doing the contextualizing paper, the dot zero video for two upcoming discussions in the first half of July 2021 on the 6th and the 13th, when we have discussions 25.1 and 25.2 on this paper and hopefully the author joining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 117.694,
    "end": 132.319,
    "text": " Today in ACT-INF Lab Livestream number 25.0, we're going to be trying to set some context and give an introduction to the following paper, The Computational Boundary of a Self, Developmental Bioelectricity Drives Multicellularity and Scale-Free Cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 132.899,
    "end": 133.72,
    "text": " by Mike Levin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 134.38,
    "end": 137.022,
    "text": "And this video is just an introduction to some of the ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 137.122,
    "end": 139.004,
    "text": "It's not a review or a final word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 139.024,
    "end": 149.492,
    "text": "It's kind of like a three way intersection where we have people who might be within the active inference community looking to be exposed to some different areas like developmental biology or cognitive science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 150.092,
    "end": 157.358,
    "text": " And then another group of people who are coming from the developmental biology or cognitive science background and curious about active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 157.598,
    "end": 166.004,
    "text": "And then also we hope that this is exciting and interesting even for people who are not familiar with active inference or developmental biology or cognitive science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 167.485,
    "end": 173.03,
    "text": "We will hopefully try to connect it with some broader questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 173.985,
    "end": 188.355,
    "text": " So we're going to walk through some of the aims and claims of the paper, the abstract and the roadmap, and bring a few big questions and some key points of the paper so that whether you read the paper or not, you'll hopefully be in a good spot to ask questions and learn more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 189.796,
    "end": 193.72,
    "text": " And of course, in the dot one and two videos in the coming weeks, we'll be discussing the same paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 193.86,
    "end": 200.946,
    "text": "So save and submit your questions and let us know if you'd like to participate or contribute in any way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 201.406,
    "end": 203.128,
    "text": "So here we are on the paper itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 203.788,
    "end": 206.731,
    "text": "That's a screenshot of the cover and the aims and claims.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 206.991,
    "end": 213.056,
    "text": "And I'll read them so that then, Daniel, you can give a first thought on what you thought was cool or what you thought was important about the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 214.057,
    "end": 215.358,
    "text": " So the aims and claims of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 216.118,
    "end": 226.922,
    "text": "First, they define individuals and selves in a way that facilitates taxonomy, comparison, and communication with evolved, created, biological, artificial, and exobiological agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 227.982,
    "end": 242.227,
    "text": "He says, I propose a fundamental definition of an individual based on the ability to pursue goals at an appropriate level of scale and organization and suggest a formalism for defining and comparing the cognitive capacities of highly diverse types of agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 242.947,
    "end": 254.534,
    "text": " Second, he proposes a plausible naturalistic framework for the evolutionary scale-up of cognition from the earliest origins of life, hypothesizing about the forces that drove it and the major transitions along the continuum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 255.135,
    "end": 262.599,
    "text": "And the goal of this research program is to show how complex agency and goal-directedness evolves naturally from ancient mechanisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 262.799,
    "end": 264.741,
    "text": "So, Daniel, what do you think about that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 264.761,
    "end": 267.842,
    "text": "Nice work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 269.099,
    "end": 280.069,
    "text": " I thought the paper was pretty exciting because it touches on just so many big topics like goal setting and agency, cognition and natural and artificial systems, multi-scale systems.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 280.549,
    "end": 291.899,
    "text": "And then it links it in a way that people might not expect, which is through developmental biology and bioelectricity, which are kind of like processes that these life forms or other forms create.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 292.219,
    "end": 309.001,
    "text": " engage in so to be able to connect things that are awesome about systems that matter like again their goal seeking nature their ability to do cognition and then connect that to a process theory it's kind of what we're all about in active inference connecting the cool features of the world to process theories that are tractable",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 310.674,
    "end": 315.339,
    "text": " Cool, so moving on to the abstract, I'll read the first part, and then you can read the next slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 316.32,
    "end": 322.367,
    "text": "So all epistemic agents physically consist of parts that must somehow comprise an integrated cognitive self.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 322.907,
    "end": 331.296,
    "text": "Biological individuals consist of subunits, organs, cells, and molecular networks that are themselves complex and competent in their own native contexts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 331.897,
    "end": 337.483,
    "text": " How do coherent biological individuals result from the activity of smaller subagents?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 338.084,
    "end": 352.419,
    "text": "To understand the evolution and function of metazoan creatures, bodies, and minds, it is essential to conceptually explore the origin of multicellularity and the scaling of basal cognition of individual cells into a coherent, larger organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 353.2,
    "end": 365.769,
    "text": " So I find this line of research truly fascinating and really a burning question for me is how information is consolidated or prioritized across skills, whether it's core screening or salience or something else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 366.429,
    "end": 367.51,
    "text": "So do you want to read the next part?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 368.755,
    "end": 372.157,
    "text": " Yep, just one thought on that, and it's going to be a theme that's returned to.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 372.357,
    "end": 378.44,
    "text": "It's that cognition or agency doesn't just blink into existence at a larger level of analysis.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 378.84,
    "end": 383.983,
    "text": "It's actually composed of smaller cognitive units, and so it's kind of like cognition all the way down.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 384.383,
    "end": 390.587,
    "text": "That helps us integrate across scales, but also recognize what's special about larger levels of organization, like culture.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 391.307,
    "end": 392.948,
    "text": "So part two of the abstract.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 394.062,
    "end": 406.109,
    "text": " In this article, I synthesize ideas in cognitive science, evolutionary biology, and developmental physiology towards a hypothesis about the origin of individuality, scale-free cognition.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 407.07,
    "end": 421.799,
    "text": "I propose a fundamental definition of an individual based upon the ability to pursue goals at an appropriate level of scale and organization and suggest a formalism for defining and comparing the cognitive capacities of highly diverse types of agents.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 423.484,
    "end": 431.871,
    "text": " Any self is demarcated by a computational surface, the spatial-temporal boundary of events that it can measure, model, and try to affect.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 432.612,
    "end": 439.378,
    "text": "The surface sets a functional boundary, a cognitive light cone, which defines the scale and limits of its cognition.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 440.225,
    "end": 455.391,
    "text": " I hypothesize that higher-level, goal-directed activity and agency, resulting in larger cognitive boundaries, evolves from the primal homeostatic drive of living things to reduce stress, the difference between current conditions and life-optimal conditions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 457.324,
    "end": 465.127,
    "text": " So I like this goal-directed aspect of this, and it really kind of implies to me that it's biological.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 465.207,
    "end": 466.967,
    "text": "Cognition has to be biological.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 467.007,
    "end": 472.469,
    "text": "But I wonder about what is the goal of molecules in their organization, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 472.509,
    "end": 480.212,
    "text": "Is that a goal-directed activity, like the protons and neutrons and electrons want to reduce their uncertainty about where they are in space?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 480.352,
    "end": 483.193,
    "text": "Or how does it work at a non-biological level?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 483.313,
    "end": 483.933,
    "text": "Makes me wonder that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 485.14,
    "end": 485.681,
    "text": " Or strain.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 485.961,
    "end": 486.782,
    "text": "Strain and stress.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 487.002,
    "end": 492.469,
    "text": "Those are things we psychologically experience, but then you can have, you know, like a ring with four carbons.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 492.529,
    "end": 493.31,
    "text": "It's under strain.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 493.33,
    "end": 495.873,
    "text": "And the carbons, they seek to do what?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 495.973,
    "end": 500.358,
    "text": "Well, get into a less stressed position, like an unstrained arrangement.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 501.274,
    "end": 501.654,
    "text": " For sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 502.435,
    "end": 502.935,
    "text": "The next part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 503.516,
    "end": 525.492,
    "text": "The mechanisms of developmental bioelectricity, the ability of all cells to form electrical networks to process information, suggest a plausible set of gradual evolutionary steps that naturally lead from physiological homeostasis in single cells to memory, prediction, and ultimately complex cognitive agents via scale up of the basic drive of infotaxis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 526.152,
    "end": 540.348,
    "text": " Recent data on the molecular mechanisms of preneural bioelectricity suggest a model of how increasingly sophisticated cognitive functions emerge smoothly from cell-to-cell communication used to guide embryogenesis and regeneration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 541.089,
    "end": 559.499,
    "text": " This set of hypotheses provides a novel perspective on numerous phenomena such as cancer and makes several unique testable predictions for interdisciplinary research that have implications not only for evolutionary developmental biology, but also for biomedicine and perhaps artificial intelligence and exobiology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 559.519,
    "end": 561.22,
    "text": "Do you have any thoughts on that, Daniel?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 564.099,
    "end": 576.844,
    "text": " I guess it's just cool to see development and cognition come onto equal grounding because there was ecology, evolution, and development, eco, evo, devo, and then it's sort of, that's natural things happening.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 577.044,
    "end": 583.506,
    "text": "And then often cognition and especially computational perspectives on cognition are seen as unnatural or designed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 583.986,
    "end": 593.39,
    "text": "And so again, all of these pieces are going to be woven together with a few pieces like bioelectricity and light cones that maybe people aren't expecting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 595.011,
    "end": 596.152,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 596.172,
    "end": 602.476,
    "text": "So the roadmap of the paper, we're going to go through the introduction, then the paper is broken up into lots of different parts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 602.636,
    "end": 603.396,
    "text": "What is a self?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 603.557,
    "end": 604.937,
    "text": "How do you define an individual?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 605.398,
    "end": 621.028,
    "text": "Body patterning, cognition, multicellularity versus cancer, defining individuation from a cognitive perspective, the agent's evolutionary backstory, conclusion, future outlook, discussion, and then some predictions and research program.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 621.608,
    "end": 625.151,
    "text": " And then in the end, what does it feel like to be a pancreas?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 625.211,
    "end": 627.893,
    "text": "Which I renamed that part, but maybe you changed it back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 628.133,
    "end": 628.794,
    "text": "So we'll see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 629.234,
    "end": 631.015,
    "text": "Do you want to read over the keywords?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 632.817,
    "end": 643.705,
    "text": "So here's the provided keywords were development, bioelectricity, and the related gap junctions, primitive cognition, and our favorite active inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 646.164,
    "end": 653.067,
    "text": " So development, I like this quote from Seth Smith, Seth Mary and Maynard Smith, which I can never say Oris's last name.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 653.307,
    "end": 653.747,
    "text": "I feel bad.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 653.767,
    "end": 654.847,
    "text": "Sorry, Oris.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 654.908,
    "end": 666.772,
    "text": "Developmental biology can be seen as the study of how information in the genome is translated into the adult structure and evolutionary biology of how the information came to be there in the first place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 667.252,
    "end": 669.713,
    "text": "So that's a kind of cool definition of development.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 670.054,
    "end": 671.154,
    "text": "Do you have any thoughts on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 673.135,
    "end": 680.739,
    "text": " It reminds me of earlier discussions we had about Tinbergen's four whys, which are kind of related to Aristotle's four whys.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 680.839,
    "end": 682.16,
    "text": "It's like, why is there a foot?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 682.52,
    "end": 686.703,
    "text": "Well, the easy sort of material answer is because there's matter in the shape of a foot.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 687.203,
    "end": 689.504,
    "text": "But maybe you want to know something that's historical.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 689.865,
    "end": 695.428,
    "text": "And over really long periods of time, it's a story about evolution, how the foot came to be selected on through time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 695.808,
    "end": 702.512,
    "text": "But development is just right there in the middle where it's the story for that individual, how that foot came to be.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 703.953,
    "end": 704.474,
    "text": " Thanks, Sed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 705.194,
    "end": 706.416,
    "text": "Blue, could you turn down my mic?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 706.676,
    "end": 709.138,
    "text": "It apparently is a little loud and distorted.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 709.359,
    "end": 710.5,
    "text": "Thank you for the feedback.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 710.52,
    "end": 717.167,
    "text": "Yeah, if anybody has comments on, like, the audio, Blue's doing an awesome job of first broadcaster role.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 717.487,
    "end": 718.007,
    "text": "So thanks, Sed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 719.008,
    "end": 719.089,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 719.109,
    "end": 720.29,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 720.37,
    "end": 721.511,
    "text": "Hopefully that's a little bit better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 721.531,
    "end": 723.393,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 726.487,
    "end": 727.368,
    "text": " Bioelectricity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 727.609,
    "end": 729.43,
    "text": "So this is a quote from the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 730.291,
    "end": 738.038,
    "text": "Developmental bioelectricity is the ubiquitous exchange of slowly changing ion-based voltage signals within and among cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 738.659,
    "end": 747.367,
    "text": "All cells are electrically active and modern neurons evolved from preneural precursors that were already reaping the benefits of ionic signaling for computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 749.386,
    "end": 750.867,
    "text": " Ionic signaling for computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 751.488,
    "end": 753.229,
    "text": "So there's some ion channels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 753.289,
    "end": 757.412,
    "text": "I like that cool digital image of ion channels in cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 757.492,
    "end": 764.377,
    "text": "And of course, this painting by Alex Gray isn't officially bioelectricity, but whenever I think of the word bioelectricity, I always think of this picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 764.397,
    "end": 766.619,
    "text": "Do you have any thoughts there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 768.08,
    "end": 774.365,
    "text": "To connect the developmental aspect to what is mentioned here about the cells being electrically active,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 774.958,
    "end": 779.082,
    "text": " the neural tissue arises during development from neuroectoderm.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 779.322,
    "end": 788.49,
    "text": "So before there was sort of an inner layer of these electrically specialized cells, the ones that we call neurons, there was an outer layer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 788.67,
    "end": 793.494,
    "text": "And we see that recapitulated in embryogenesis when the neural tube is closed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 793.974,
    "end": 795.556,
    "text": "So that's combining sort of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 796.517,
    "end": 806.88,
    "text": " Ontogeny recapitulates phylogeny, which is just to say that the development of the organism carries some resonance with the way that the organism evolved through time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 807.36,
    "end": 812.401,
    "text": "And then just to remind that every cell has those pumps that maintain charge.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 812.741,
    "end": 823.784,
    "text": "Maybe not all of them are involved in rapid fire signaling, but to maintain ionic gradients and therefore bioelectric gradients is essentially what cells do with their membranes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 825.111,
    "end": 825.371,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 825.491,
    "end": 829.193,
    "text": "And awesome segue into talking about gap junctions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 829.213,
    "end": 832.715,
    "text": "So this is something that's near and dear to my heart with my neuroscience background.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 833.215,
    "end": 837.357,
    "text": "So gap junctions were originally attributed to neurons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 838.178,
    "end": 838.618,
    "text": "That's it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 838.658,
    "end": 843.861,
    "text": "Gap junctions are there at the synapse, and they facilitate the electrical signaling between neural cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 843.921,
    "end": 849.364,
    "text": "But really, they're channels that permit cell-to-cell transfer of ions directly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 850.325,
    "end": 857.173,
    "text": " And they were originally described in nerve and muscle, but they're really found in virtually all cells that are present in solid tissues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 857.914,
    "end": 862.58,
    "text": "And then I just did a quick, like, brief lookup of a recent review of gap junctions, and it's cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 862.6,
    "end": 864.362,
    "text": "Like, they're involved in all kinds of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 865.143,
    "end": 887.693,
    "text": " um things right like so cell proliferation immune response migration optosis carcinogenesis hyper hyper proliferative skin disorders lymphatic vessel diseases inflammatory lung diseases that's like asthma liver injury and neoplastic disorders that's also cancer so i thought that that was kind of a neat um thing any thoughts on this one daniel",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 889.508,
    "end": 894.653,
    "text": " Just that active inference helps us think about how agents communicate and interact.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 895.033,
    "end": 902.28,
    "text": "So if there's two cells and they have totally disjoint membranes, then they can both modify a niche in common.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 902.36,
    "end": 907.845,
    "text": "So they could pump ions in and out of the fluid, like the extracellular matrix that's surrounding the cells.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 907.865,
    "end": 910.267,
    "text": "So there's a common niche that they're sharing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 910.407,
    "end": 911.969,
    "text": "That's like the least connected they could be.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 912.609,
    "end": 918.39,
    "text": " And then there are also ways in which they can have a long-term connection with a higher throughput.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 918.83,
    "end": 933.013,
    "text": "So we're seeing a lot of these ideas of communication where you can talk about these two agents now directly exchanging information with each other as their electrochemical niche, rather than just jointly modifying the shared fluid that they're in.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 935.013,
    "end": 935.293,
    "text": "Cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 936.294,
    "end": 937.774,
    "text": "Okay, next.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 943.663,
    "end": 945.144,
    "text": " All right, primitive cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 945.164,
    "end": 947.066,
    "text": "Let's see if I can play this video.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 947.086,
    "end": 947.827,
    "text": "Did you want me to play it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 949.668,
    "end": 951.03,
    "text": "Sure, if it works on your side.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 951.13,
    "end": 951.55,
    "text": "Let's see it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 954.453,
    "end": 954.953,
    "text": "Perfect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 958.636,
    "end": 960.238,
    "text": "Role of actin in cell motility.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 960.418,
    "end": 962.36,
    "text": "Stunning 3D animation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 962.38,
    "end": 966.123,
    "text": "Maybe we don't need the sound, but nice.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 969.927,
    "end": 984.234,
    "text": " Well, what is written in the paper is the emerging field known as basal cognition tracks the evolutionary history of learning and decision-making processes beginning from the dynamic problem-solving capacities of cellular and subcellular forms.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 984.994,
    "end": 995.96,
    "text": "Many examples of memory, anticipation, context-dependent decision-making and learning are exhibited by organisms from yeast and bacteria to plants and somatic cells.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 998.601,
    "end": 998.901,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 999.982,
    "end": 1004.785,
    "text": "So down at the bottom, what does cognition or intelligent behavior look like across scales?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1005.446,
    "end": 1007.287,
    "text": "Where and how does cognition arise?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1007.427,
    "end": 1010.609,
    "text": "And how does it develop or evolve convergent and divergent features?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1011.529,
    "end": 1013.531,
    "text": "And where does active inference come into play?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1015.852,
    "end": 1021.236,
    "text": "I think that first question is fun, because it's a little easy to off the cuff, just say, well,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1022.383,
    "end": 1033.431,
    "text": " I don't recognize the intelligence of a cell because it's not doing an undergrad course or it's not doing skillful performance like we talked about in a previous discussion.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1033.892,
    "end": 1040.797,
    "text": "So will we have a human centric conception of intelligence tied up with all of our cultural understandings?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1041.537,
    "end": 1046.744,
    "text": " Or is there something about intelligent behavior that might help us recognize it across scales?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1047.224,
    "end": 1053.092,
    "text": "And that's what turns us to these fundamentals like memory, anticipation, context-dependent decision-making.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1053.813,
    "end": 1058.599,
    "text": "And then once we open up to that functional level of intelligent behavior and cognition,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1059.201,
    "end": 1060.422,
    "text": " We start seeing it everywhere.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1060.722,
    "end": 1071.512,
    "text": "And so instead of just seeing these cells and their behavior as taking part of an intelligent system that, again, only blinks into existence at the top level, they're in and of themselves intelligent actors.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1073.934,
    "end": 1074.255,
    "text": "Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1076.176,
    "end": 1076.737,
    "text": "Let's see.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1084.123,
    "end": 1085.645,
    "text": "The video got me locked in here, sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1088.882,
    "end": 1089.263,
    "text": " How about that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1089.683,
    "end": 1090.965,
    "text": "You want to take us through that slide, Daniel?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1092.247,
    "end": 1092.447,
    "text": "Yep.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1092.728,
    "end": 1095.191,
    "text": "So it's written in the paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1095.772,
    "end": 1099.738,
    "text": "I propose... We'll come back to homeostasis in a second.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1100.039,
    "end": 1101.2,
    "text": "At the top, it's written...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1102.262,
    "end": 1109.611,
    "text": " Developmental bioelectricity is the ubiquitous exchange of slowly changing ion-based voltage signals within and among cells.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1110.452,
    "end": 1114.897,
    "text": "All cells are electrically active and we talked about that just a few slides ago.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1115.658,
    "end": 1116.959,
    "text": "How ancient are these mechanisms?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1117.199,
    "end": 1120.884,
    "text": "How early was bioelectric coordination exploited by evolution?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1121.491,
    "end": 1144.75,
    "text": " so this is raising the notion that early cognition was biomechanical it was biophysical it involved morphological computation like we saw on the previous slide with the movie of cells but also electrical affordances existed from the beginning and so if biophysical affordances existed from the beginning and allowed for cognition to arise",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1145.72,
    "end": 1157.323,
    "text": " Then it makes just as much sense to say that electrical affordances for cells to communicate and do these types of cognitive processes also were exploited very early in evolution.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1157.683,
    "end": 1169.786,
    "text": "So primitive meaning at a smaller level, but also earlier on and suggesting that it's bioelectric was one of the earlier mechanisms of cognition is pretty cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1171.929,
    "end": 1185.557,
    "text": " And I like this quote from the paper that says, the ability to operate toward a region and state space may be the primitive origin of complex cognitive systems that can entertain counterfactuals, which is to remember or anticipate events that are not occurring right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1186.158,
    "end": 1187.699,
    "text": "So we'll touch back on homeostasis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1187.779,
    "end": 1189.96,
    "text": "But how are the goals related to homeostasis?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1190.86,
    "end": 1193.542,
    "text": "How does bioelectricity play a role in homeostasis?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1193.582,
    "end": 1195.003,
    "text": "And I think we come back around to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1200.33,
    "end": 1208.374,
    "text": " On 17, I wanted to give an example about where bioelectricity and development came together with cognition.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1209.355,
    "end": 1215.858,
    "text": "And for some people, genetic reductionism makes it so that, you know, the story is not complete until we know what gene is involved.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1216.519,
    "end": 1234.465,
    "text": " And I think that they'd find this recent 2021 paper from Drosophila fruit flies to be really interesting because what they do with a series of experiments is actually demonstrate the importance of membrane depolarization, which is to say bioelectric capacity in",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1236.367,
    "end": 1237.708,
    "text": " Gene regulatory networks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1237.988,
    "end": 1245.151,
    "text": "So like HH and PTC are proteins that are produced by loci in the DNA.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1245.871,
    "end": 1250.433,
    "text": "And they're part of feedback loops involving the depolarization of membranes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1250.893,
    "end": 1256.415,
    "text": "So they show that regulation of that membrane potential has an important role in signaling hedgehog.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1257.095,
    "end": 1261.719,
    "text": " And that there's a mutually reinforcing relationship between these two processes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1262.199,
    "end": 1263.42,
    "text": "And then what does that allow?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1263.58,
    "end": 1271.767,
    "text": "Well, it allows morphological computation of this developing disc of the fly that later turns into the wing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1272.447,
    "end": 1274.189,
    "text": "And so there's advantages and disadvantages.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1274.249,
    "end": 1280.514,
    "text": "Like with diffusible molecules, there's a tremendous amount of expressivity with what that molecule is.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1280.574,
    "end": 1283.276,
    "text": "Like you have an infinite number of hormone possibilities, but",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1284.198,
    "end": 1289.208,
    "text": " But on the other hand, it's very slowly diffusing and maybe you can only signal a short range.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1289.89,
    "end": 1292.691,
    "text": " On the other hand, there's only like one electricity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1292.971,
    "end": 1298.452,
    "text": "There's not like the blue membrane potential and the pink membrane potential as parallel membrane potential.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1298.472,
    "end": 1300.013,
    "text": "There's only one membrane potential.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1300.353,
    "end": 1302.154,
    "text": "So it's kind of a big knob to turn.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1302.694,
    "end": 1309.135,
    "text": "However, as shown here, it really does play a functional role in stabilizing gene regulatory networks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1309.196,
    "end": 1314.817,
    "text": "If you were missing that part of the puzzle, it would be as incomplete as if you were missing a critical signaling molecule.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1315.257,
    "end": 1317.538,
    "text": "So I suspect that as it advances,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1318.158,
    "end": 1335.24,
    "text": " the kind that are going to be referenced in this paper, advances in being able to visualize and track and manipulate bioelectric fields become more accessible, that more and more systems that were thought to be purely chemical or purely mechanical, I think that there'll be a more important role for bioelectricity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1336.912,
    "end": 1337.132,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1337.212,
    "end": 1340.315,
    "text": "It is like one big surface, one membrane potential.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1340.595,
    "end": 1343.817,
    "text": "So you have one membrane and that's like the differentiator, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1343.857,
    "end": 1345.419,
    "text": "Between that's the boundary, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1345.539,
    "end": 1348.401,
    "text": "Is what is enclosed or encapsulated in the membrane versus what is not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1351.508,
    "end": 1353.729,
    "text": " Okay, so here we are, active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1353.749,
    "end": 1355.009,
    "text": "This is the final keyword.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1355.049,
    "end": 1366.151,
    "text": "And I pulled this image out from the Active Inference Lab, a previous live stream that we did with Ines and Thomas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1366.371,
    "end": 1370.751,
    "text": "So this is the free energy principle of computationalism and realism, a tragedy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1370.871,
    "end": 1374.492,
    "text": "And so this is just the basic action perception loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1374.972,
    "end": 1379.393,
    "text": "So you have active states, external states, sensory states, and internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1379.933,
    "end": 1385.497,
    "text": " And so both of the active states and the sensory states are the blanket states, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1385.577,
    "end": 1391.162,
    "text": "So you have the internal can act on the external via these two blanket states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1391.222,
    "end": 1399.148,
    "text": "So this is all of the sensory perception of the organism and the degree on which they're able to act on the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1399.968,
    "end": 1402.03,
    "text": "Do you want to add any thoughts here, Daniel?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1403.971,
    "end": 1410.495,
    "text": " Just that active inference is a unifying framework for thinking about perception, cognition, and action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1411.015,
    "end": 1416.619,
    "text": "And it does that in a scale-free way that's grounded in Bayesian statistics and physics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1417.199,
    "end": 1423.043,
    "text": "So it's going to be deployed as a way to help us look for different kinds of behavior across scales.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1423.403,
    "end": 1428.486,
    "text": "Because the internal state could be internal to a cell, it could be internal to a tissue, internal to the organism.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1428.987,
    "end": 1429.428,
    "text": " etc.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1430.091,
    "end": 1435.329,
    "text": "It's that expressivity of the active inference framework that is going to come into play in the paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1436.696,
    "end": 1436.956,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1437.096,
    "end": 1439.617,
    "text": "And it's a process, a scale-free process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1442.437,
    "end": 1442.657,
    "text": "OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1443.017,
    "end": 1461.141,
    "text": "Active inference, as brought up in this paper, the author says, agents scaled up by evolving from basic homeostatic loops driven by active inference, surprise minimization, via addition of delays, which are memory, anticipation, which is inference, and networks,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1461.881,
    "end": 1467.784,
    "text": " spatially distributed processing that enables learning and progressive abstraction or generalization from the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1468.304,
    "end": 1484.591,
    "text": "Gathering into larger collectives with optimal information structure also improves the computational, i.e., predictive capabilities and gives rise to functional relationships such as memories, encoded goal states, test-operate, test-exit loops that exist over and above any individual member.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1484.711,
    "end": 1488.673,
    "text": "These levels coexist, enabling numerous coherent selves of different scales",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1489.113,
    "end": 1491.755,
    "text": " to be implemented by any collection of living matter?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1495.437,
    "end": 1497.619,
    "text": "That's intense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1498.379,
    "end": 1508.766,
    "text": "One of the other pieces about active inference that differentiates it from a framework like reinforcement learning is right there, that there's the minimization of surprise.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1509.506,
    "end": 1521.87,
    "text": " And in order to minimize surprise through time, you kind of have to be doing two things that at first pass don't seem like they're going to facilitate each other, which is the pursuit of what you already know is going to be useful.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1522.03,
    "end": 1528.392,
    "text": "That's called pragmatic value, as well as the pursuit of sampling things that will be informative.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1528.632,
    "end": 1529.813,
    "text": "That's epistemic value.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1530.293,
    "end": 1536.415,
    "text": "And so in active inference, the way that agents through deep time minimize their surprise about perception",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1536.935,
    "end": 1540.737,
    "text": " That's what's referenced in the top paragraph about perceptual control theory.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1541.377,
    "end": 1564.288,
    "text": "The way that the agents minimize their surprise about their future expectations of perception is going to be by jointly working on pragmatic and epistemic aspects of their behavior and thinking about what behavior is going to be minimizing free energy in terms of kind of existing on the optimal trade-off where you're",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1565.382,
    "end": 1566.983,
    "text": " performing, but also learning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1567.504,
    "end": 1570.345,
    "text": "So these are a few features of active inference that differentiate it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1570.786,
    "end": 1574.989,
    "text": "And then if we think about like a growth cone of a neuron, is it doing reinforcement learning?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1575.049,
    "end": 1576.75,
    "text": "Is it doing reward maximization?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1576.77,
    "end": 1578.531,
    "text": "It just barely makes sense.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1579.071,
    "end": 1589.859,
    "text": "But once we start to think about surprise minimization, like it's a dad with an evolutionary prior, it expects to connect to a neuromuscular junction, then maybe some of its searching behavior makes more sense.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1591.269,
    "end": 1598.535,
    "text": " And in the top section, also the author, you know, states that the sensory input layer is what enables active inference to operate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1598.595,
    "end": 1603.639,
    "text": "So because there's receptors and channels that that's the perception, the perception for a cell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1604.62,
    "end": 1604.8,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1605.04,
    "end": 1606.221,
    "text": "Anyway, just thought I'd add that in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1606.942,
    "end": 1607.102,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1608.603,
    "end": 1609.143,
    "text": "Greetings, Sarah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1609.924,
    "end": 1610.665,
    "text": "Hi, Sarah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1613.167,
    "end": 1616.549,
    "text": "Daniel, do you want to read these core assumptions and I'll fix the thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1616.67,
    "end": 1616.95,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1617.901,
    "end": 1618.322,
    "text": " Classic.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1618.562,
    "end": 1627.071,
    "text": "So I'm only going to read the two highlighted parts here because these are paragraphs that people want more detail on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1627.091,
    "end": 1629.294,
    "text": "They can definitely read the paper to learn more about.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1630.373,
    "end": 1634.115,
    "text": " There's three core assumptions that are laid out really clearly.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1634.215,
    "end": 1642.099,
    "text": "So I appreciated that about this paper, that it makes clear assumptions and shows how those assumptions come into play.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1642.639,
    "end": 1646.561,
    "text": "And then basically there's two avenues for disagreeing, I guess.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1647.101,
    "end": 1652.564,
    "text": "One would be, I think those are invalid assumptions, but they're properly applied.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1653.357,
    "end": 1657.284,
    "text": " Or one can think that there are valid assumptions, but improperly applied.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1657.705,
    "end": 1662.252,
    "text": "And so that helps structure discussion with the contents of the paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1662.914,
    "end": 1665.318,
    "text": "So the first core assumption is a commitment to evolution.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1666.224,
    "end": 1670.026,
    "text": " Every capacity has a natural history and emerged from simpler variants.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1671.147,
    "end": 1674.749,
    "text": "I guess also evolution can proceed through a reduction of complexity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1674.809,
    "end": 1681.153,
    "text": "So eventually it had to have emerged from simpler variants, but in the short time, I guess it could have emerged from more complex variants.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1681.634,
    "end": 1692.36,
    "text": "But the commitment to evolution means the commitment to the dispelling of magical thinking and not looking for some sort of a metaphysical answer to our physical questions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1693.361,
    "end": 1694.942,
    "text": "And the second assumption is",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1695.874,
    "end": 1710.158,
    "text": " of the three is it is assumed that all metaphors are to be judged by their utility in driving scientific progress, and there is not a binary categorization of scientific pictures which should be taken literally or not, which can be decided a priori.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1710.638,
    "end": 1715.219,
    "text": "So we're not going around with post-it notes saying what's real or what's not.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1715.659,
    "end": 1718.5,
    "text": "We're using utility as a guiding metric.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1720.788,
    "end": 1727.409,
    "text": " We can actually just take a quick visualization and then Sarah, you can say hello and give any thoughts if you'd like.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1727.829,
    "end": 1735.971,
    "text": "But we previously in live stream 15 and 20 talked a lot about this continuum from realism to instrumentalism.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1736.191,
    "end": 1738.931,
    "text": "Like is active inference the territory itself?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1739.311,
    "end": 1740.071,
    "text": "That's realism.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1740.511,
    "end": 1743.992,
    "text": "We're really describing what's really there when we make an active inference model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1744.592,
    "end": 1749.413,
    "text": "Or instrumentalism on the right side here is like active inference as a map.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1749.993,
    "end": 1758.236,
    "text": " We're just using it as something that could be used to capture some features of a system and then used instrumentally like a model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1758.976,
    "end": 1768.1,
    "text": "Then here we've introduced this third vector of utility, which is like, okay, whether it's the map or the territory, orthogonal to that is, is it useful?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1768.82,
    "end": 1777.047,
    "text": " And so this is a space that's describing not just where we can think about active inference existing, but also ways to evaluate different models.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1777.147,
    "end": 1781.33,
    "text": "Not that one is better than the other, but these are just different dimensions that models exist on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1781.35,
    "end": 1784.393,
    "text": "Yeah, I thought that was cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1784.413,
    "end": 1785.113,
    "text": "So Sarah, how goes it?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1795.991,
    "end": 1798.013,
    "text": " Okay, maybe go to the third core assumption.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1798.333,
    "end": 1799.094,
    "text": "On to the third one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1799.194,
    "end": 1804.819,
    "text": "So much of the discussion centers around goals related to teleology, a hotly debated topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1805.379,
    "end": 1820.552,
    "text": "Here, goal-directedness is taken in the non-magical cybernetic engineering and control theory sense of a feedback system that operates to maximize some specific state of affairs which can be modeled as a dynamical system with attractors in its state space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1820.572,
    "end": 1820.852,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1822.904,
    "end": 1828.128,
    "text": " So to reiterate these three assumptions, the first one is evolution.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1828.549,
    "end": 1830.07,
    "text": "The second one is utility.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1830.591,
    "end": 1835.274,
    "text": "And the third one is a non-magical sense of goal-directedness.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1835.715,
    "end": 1838.657,
    "text": "So these three assumptions play nice with each other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1839.358,
    "end": 1845.183,
    "text": "And then they also lead directly to this final statement that except for a few briefer marks at the end,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1846.118,
    "end": 1853.824,
    "text": " No claims about consciousness defined rapidly as first-person experience or sense of self as qualia are made.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1854.604,
    "end": 1860.388,
    "text": "All the examples concern functional, third-person, objective capacities, computation, and behaviors.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1860.949,
    "end": 1865.252,
    "text": "So we're kind of like outside of systems, looking at them as an investigator,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1865.752,
    "end": 1884.124,
    "text": " This isn't about the first-person perspective, and there's always so much fascination and interest in what consciousness is, but in a way, these three assumptions go a really long distance towards just saying, hey, let's look at the system's behavior as we observe it rather than as we imagine it to be like.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1884.825,
    "end": 1887.847,
    "text": "So that's at least a starting point for a great discussion.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1891.049,
    "end": 1893.411,
    "text": "Before we jump into the figures, Sarah, do you want to...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1894.073,
    "end": 1898.336,
    "text": " Do you have any thoughts or say hello?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1898.416,
    "end": 1899.216,
    "text": "Sure, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1899.377,
    "end": 1911.785,
    "text": "I'm kind of coming in pretty disoriented, but I've tried to follow Michael's work quite a bit, and I'm enjoying discussing it from whatever angle comes up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1912.765,
    "end": 1915.807,
    "text": "And, oh, I don't know, background, who cares?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1916.008,
    "end": 1918.169,
    "text": "I'm in philosophy right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1918.989,
    "end": 1919.67,
    "text": "Yeah, that's all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1922.242,
    "end": 1931.806,
    "text": " nice well any slide you want to chime in on is great so i have to find the slides okay they're yeah anyway um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1939.989,
    "end": 1941.41,
    "text": " Go for figure one, Blue, if you want.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1941.73,
    "end": 1941.95,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1942.25,
    "end": 1945.672,
    "text": "So this is a continuum of cognitive powers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1946.392,
    "end": 1948.753,
    "text": "And this is just the first part of the figure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1948.774,
    "end": 1950.274,
    "text": "We'll show the next part in the next slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1950.334,
    "end": 1959.139,
    "text": "So this is a TOTE, which is Test Operate Test Exit Loop, which is a schema of a basic homeostatic cycle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1959.799,
    "end": 1978.199,
    "text": " So the author says that by continuously taking action to minimize the distance, the difference and error between the current state of affairs and a set point describing a different possible future state of affairs, it enables a system to pursue goals despite perturbations from the outside world and intrinsic noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1978.88,
    "end": 1993.732,
    "text": " So this is I thought, cool, like, you know, the first like possible counterfactual, like, yes, it's 75 degrees, and I have plenty of sodium and potassium and, you know, calcium, but but what if I don't always what if it's not always this way, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1993.772,
    "end": 1995.593,
    "text": "What if what if it my state changes?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1996.174,
    "end": 2001.158,
    "text": "So like that the first counterfactual maybe enabled this kind of homeostatic feedback loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2001.178,
    "end": 2003.74,
    "text": "I thought that that was a neat idea put forward in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2004.36,
    "end": 2007.943,
    "text": "So how is this related to active inference or systems engineering, Daniel?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2009.571,
    "end": 2016.554,
    "text": " Well, the terminology reminded me a lot more of engineering than we often see, like sensors and actuators.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2017.055,
    "end": 2019.276,
    "text": "It makes it sound like it's going to be a robot.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2020.156,
    "end": 2024.938,
    "text": "And also this like test exit sounds like we're going to be doing sort of software evaluation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2025.419,
    "end": 2036.144,
    "text": "But we can pretty clearly see the skeleton of action perception loops, whether it's framed as it was a couple of slides ago with internal external states and then blanket states.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2036.764,
    "end": 2046.312,
    "text": " Or here, where you basically have the difference between the desired and expected value leading to policy selection, not shown here, leading to action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2046.992,
    "end": 2063.326,
    "text": "Actions cause events in the environments on the yonder side of the blanket, and then the state of the external environment influences the measurements on the inbound side, which are again contrasted with the idealized state, and that leads to another round of action selection.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2063.786,
    "end": 2070.872,
    "text": " So this is an engineering way of laying out the TOTE test operate test exit loop.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2071.532,
    "end": 2072.533,
    "text": "But who knows?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2073.033,
    "end": 2077.717,
    "text": "We're able to jump from Active Inference pretty nicely into a more engineering frame.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2078.297,
    "end": 2082.621,
    "text": "And so perhaps engineering could be integrated closely into Active Inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2085.629,
    "end": 2093.497,
    "text": " Yeah, it seems like the blanket states, like the sensors and actuators, like our, you know, the action perception part are here in the middle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2093.637,
    "end": 2098.482,
    "text": "And so it kind of reminds me of the active inference loop, like diagram that we showed earlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2098.702,
    "end": 2100.043,
    "text": "So it's interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2103.086,
    "end": 2105.008,
    "text": "Next part, do you want to go through this one, Daniel?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2106.471,
    "end": 2117.537,
    "text": " Yeah, so in figure 1b, the caption reads that the scale is showing how different types of activity and systems can be ranked according to their degree of purposeness.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2118.058,
    "end": 2122.1,
    "text": "So again, think about purpose in the third person, not the first person.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2122.34,
    "end": 2129.524,
    "text": "It's not the sense of purpose, but more what I believe Hofstetter called the anti-spexus-nish.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2129.824,
    "end": 2134.067,
    "text": "I'm not sure how to pronounce it, but it was like, think about the most mindless behavior, and then",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2135.287,
    "end": 2136.067,
    "text": " push away from that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2136.427,
    "end": 2142.688,
    "text": "And that's what you can call purposeful rather than imagining that there's like this pure crystallized purposeful behavior.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2143.509,
    "end": 2149.13,
    "text": "And it sort of goes from bottom to top in terms of the degree of purpose ability.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2149.81,
    "end": 2161.652,
    "text": "And on the bottom we see basically just action that doesn't appear to have any kind of sense or purpose to it, like maybe gas molecules bumping around.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2162.572,
    "end": 2184.195,
    "text": " then we progress through higher and higher levels of feedback loops and then each one of these brackets it's kind of like a distinction so like starting the left behavior you can take the right branch or the bottom branch passive behavior like a ball that's being thrown or active behavior okay active behavior is it going to be non-random um or random like",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2185.546,
    "end": 2192.052,
    "text": " Many things are random, but is it a wind-up toy that's just doing something that is not appearing to be too purposeful?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2192.612,
    "end": 2205.884,
    "text": "And you continue up and up the branch, choosing the higher branch each time until you get to these first and second order predictions and higher order recursive logics, which are seen as higher and higher levels of purpose.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2208.806,
    "end": 2208.966,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2208.986,
    "end": 2210.167,
    "text": "Do you have any thoughts, Sarah?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2213.09,
    "end": 2213.13,
    "text": "OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2216.272,
    "end": 2217.273,
    "text": " Daniel, do you want to take this one?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2220.316,
    "end": 2221.297,
    "text": "What is an individual?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2221.858,
    "end": 2228.424,
    "text": "Well, there's so many ways to go about this, and as an ant researcher, that's always the debate.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2228.685,
    "end": 2232.088,
    "text": "Like, okay, is the individual the six-legged next mate?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2232.508,
    "end": 2236.613,
    "text": "And then that makes the colony like a society or a super individual, or...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2237.333,
    "end": 2240.837,
    "text": " is the colony of the individual and then the nascent is like the tissue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2241.357,
    "end": 2251.148,
    "text": "So there's a lot of discussion around what constitutes an individual and how would you determine where the boundaries of individual individuality are and that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2253.203,
    "end": 2257.867,
    "text": " A piece I just referenced about establishing the bounds can be done in a few different ways.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2258.248,
    "end": 2264.954,
    "text": "One of them would be looking at where information theory is strongest or where information flows are occurring.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2264.994,
    "end": 2267.456,
    "text": "That's the information theory of individuality.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2268.437,
    "end": 2272.3,
    "text": "And here we're going to take a cognitive perspective on individuation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2274.022,
    "end": 2277.185,
    "text": "And McCulloch is quoted so early in the neural network days.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2278.655,
    "end": 2294.065,
    "text": " The definition in the paper is, I propose a definition of an individual based upon its information processing structure, the scales and types of goals that a system can pursue defines slash determines the boundaries and contents of the putative agent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2294.898,
    "end": 2299.682,
    "text": " So it's an informational lens on what constitutes an individual.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2300.142,
    "end": 2313.934,
    "text": "Like we can say that individual people become maybe an individual mob, just one mob, not multiple mobs when they start integrating information differently, or when they start pursuing different kinds of goals in a different way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2314.734,
    "end": 2323.782,
    "text": "And it touches on these big questions, like why does it matter how we define individual as well as what other ways of thinking about individuality exists.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2326.616,
    "end": 2328.378,
    "text": " Yeah, it's intense, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2328.418,
    "end": 2337.907,
    "text": "So not only like in the information theory of individuality, is it like the most concentrated information, but it's also like that bi-directional information flow, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2338.047,
    "end": 2342.211,
    "text": "Is how Krakauer and that group, the defined individuality in that paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2342.311,
    "end": 2343.933,
    "text": "And so that's super interesting to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2343.973,
    "end": 2348.097,
    "text": "Like at what point is there downward causation in an aggregate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2348.197,
    "end": 2348.357,
    "text": "Like...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2349.418,
    "end": 2357.544,
    "text": " So at that point, that is like the crux for how they talked about individuality, which is, I mean, it makes sense to me, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2357.564,
    "end": 2364.169,
    "text": "Like, you know, my brain tells my foot to kick the ball, or I decide I want to kick the ball, and so my body then acts accordingly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2364.209,
    "end": 2372.375,
    "text": "But it's really interesting to think about when that emerges, that downward causation in a system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2372.695,
    "end": 2374.816,
    "text": "Anyway, something I think a lot about, probably too much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2374.836,
    "end": 2378.159,
    "text": "What about you, Tara?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2381.28,
    "end": 2384.163,
    "text": " Yeah, that is actually one of the few papers I actually have read.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2384.263,
    "end": 2386.645,
    "text": "And I like went with a highlighter and everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2387.506,
    "end": 2395.933,
    "text": "And I always wonder on on I was looking through the math on that and actually learned a lot about like math I didn't even think was possible yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2396.533,
    "end": 2398.915,
    "text": "But it was it was binary in a sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2398.976,
    "end": 2399.676,
    "text": "It was digital.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2399.896,
    "end": 2405.361,
    "text": "And I'm never clear about when that matters and when it doesn't in these kinds of models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2405.862,
    "end": 2407.363,
    "text": "So that's one thing that came up for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2411.724,
    "end": 2412.244,
    "text": " Sounds good.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2414.546,
    "end": 2415.446,
    "text": "Next slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2415.466,
    "end": 2415.987,
    "text": "Figure 2.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2416.747,
    "end": 2417.848,
    "text": "No, it's not The Sims.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2418.668,
    "end": 2421.23,
    "text": "It's a cone of individuation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2422.351,
    "end": 2433.318,
    "text": "And in 2A is this sort of cone-based representation of individuality that's going to be returning in a few different guises in the paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2434.415,
    "end": 2457.185,
    "text": " and on the plane going out in different directions from a central point is like the zone of influence or the extent of the system's ability to perceive act plan and then piercing that coming up and down in the z dimension is going from the past to the future and so",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2458.584,
    "end": 2468.339,
    "text": " This is a cool way to look at how multi-scale systems or what are called compound intelligences down there on the bottom right exist.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2469.068,
    "end": 2495.18,
    "text": " So we can use this kind of a cone representation to look at single cognitive agents and potentially contrast them, like in part B, where we have a tick with what's hypothesized to be like a smaller scope spatially in the now, as well as a shorter temporal scope in the past and future, compare a tick with a human, and then also ask maybe about what kinds of other",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2497.045,
    "end": 2502.088,
    "text": " cognitive forms exist, and then these cones can be composed really nicely.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2502.108,
    "end": 2511.474,
    "text": "So like on the example on the bottom right with an ant colony, again, controversial to say that the ant is the organism when potentially the colony is the organism.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2511.614,
    "end": 2513.175,
    "text": "That's why I usually call them a nestmate.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2513.835,
    "end": 2520.339,
    "text": "But we can see how the nestmates are inside of the colony within this cone.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2521.2,
    "end": 2524.162,
    "text": "And so the colony pushes out the boundaries",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2525.268,
    "end": 2526.869,
    "text": " of what these ants can do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2527.069,
    "end": 2530.612,
    "text": "So they're kind of like on different parts of the spatial plane in the current moments.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2531.332,
    "end": 2541.62,
    "text": "And then the colony is something that is cognitively able to move beyond the time horizon of an individual nestmate by virtue of its collective organization and information processing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2544.704,
    "end": 2556.216,
    "text": " This is cool, and something that we talked about a lot offline in preparation for this and preparing the slides is the inversion of the typical light cone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2556.276,
    "end": 2562.562,
    "text": "So maybe, Daniel, you want to walk us through this light cone, and then we can maybe go back to the other one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2563.772,
    "end": 2576.808,
    "text": " Yeah, so this is a similar light cone notion, and it's just that instead of having the two cups meeting mouth-to-mouth and then coming pinched off in small time,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2577.637,
    "end": 2586.52,
    "text": " Another way that light cones have been represented is actually with the current moments, like the eye of the needle, like an hourglass, the pinch point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2587.12,
    "end": 2597.883,
    "text": "And then in the past and in the future are the set of states that influence a given point and then the set of states it influences.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2598.383,
    "end": 2602.324,
    "text": "So let's think about that butterfly flapping its wings in the here and now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2602.984,
    "end": 2605.005,
    "text": "So if you go back one time step,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2605.585,
    "end": 2609.869,
    "text": " the air molecules that might influence it are like one layer of air molecule away.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2610.169,
    "end": 2617.255,
    "text": "And as you go back and back and back, more and more spatial extents matters for the state of the butterfly in the moment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2617.615,
    "end": 2619.777,
    "text": "And then similarly, one time step in the future",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2620.592,
    "end": 2635.175,
    "text": " the butterfly's flapping is only able to influence a small zone proximal to the insect, whereas further and further out into the future, more and more spatial extents might be modified because of the actions that happen in the here and now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2636.061,
    "end": 2654.784,
    "text": " And then this is a Lee Kors cabinet, a joke on a liquor cabinet, but it's a paper that actually uses this kind of an approach to do modeling of empirical data and to fit machine learning models, which we can talk about going forward.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2656.504,
    "end": 2665.366,
    "text": "Why and how do you get a speed up of certain kinds of simulations or data fitting by approaching it like a light cone?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2667.279,
    "end": 2673.921,
    "text": " So it's just interesting, the axes here, and this is kind of how I'm used to seeing these represented, are time and space, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2673.961,
    "end": 2679.343,
    "text": "So in physical space, I am physically in this space that I am at right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2680.223,
    "end": 2689.266,
    "text": "And it's interesting, as you go forward in time, given enough hours, I could theoretically fly from New Mexico to Singapore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2689.606,
    "end": 2696.148,
    "text": "But for right now, I'm kind of limited to my house or my block, or I don't have point-to-point transport.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2696.548,
    "end": 2711.336,
    "text": " So I always like the way that Mike represents this light cone, like in this way, like in the inverse, it's like time and space and, you know, it starts in a very broad space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2711.976,
    "end": 2714.699,
    "text": " And it proceeds to a very narrow space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2715.18,
    "end": 2722.467,
    "text": "And it's like, of course, in the past, like if I go to my distant past, like I came out of an egg that was in my mother's uterus, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2722.487,
    "end": 2725.63,
    "text": "Like, so in my mother's womb, like I came, that's where I came from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2725.67,
    "end": 2726.591,
    "text": "I was in that one point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2726.912,
    "end": 2732.437,
    "text": "And I've gone all kinds of places, I guess, until now, but I'm not, I don't feel like I'm many places now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2733.178,
    "end": 2736.14,
    "text": " And I also don't feel like I'm going to be many places in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2736.18,
    "end": 2744.324,
    "text": "So I'm interested to talk to Mike when he comes on to the live stream about the way that this is represented, because it's very different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2744.944,
    "end": 2746.205,
    "text": "Do you guys have any more thoughts on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2748.406,
    "end": 2750.107,
    "text": "Yeah, I have one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2750.547,
    "end": 2761.913,
    "text": "I mean, it seems to me he's almost trying to do, he's almost trying to take the case of the light cone and look at a particular ambition that you might have at this point in time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2762.443,
    "end": 2765.984,
    "text": " And then, and then can you carry out that ambition through time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2766.044,
    "end": 2771.066,
    "text": "And as you get further and further, you realize there's all these impediments, you know, that, that come in your way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2771.206,
    "end": 2778.168,
    "text": "And so it's this like one access is the ability to envision, um, what it is you want to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2778.188,
    "end": 2790.292,
    "text": "And the other act access is the ability to enact it is the ability to, well, even control or whatever your environment, any number of things that are required to enact, uh, this, this vision that you have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2790.732,
    "end": 2791.632,
    "text": "And that's interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2792.834,
    "end": 2794.635,
    "text": " Interesting access transformation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2797.417,
    "end": 2797.857,
    "text": "Agreed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2798.558,
    "end": 2808.084,
    "text": "The light cone that looks more like an hourglass is kind of related to our limited degrees of freedom in the current moment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2809.133,
    "end": 2831.176,
    "text": " but it you know expanding out into the future of what we can influence and then the the diamond shape that we see in figure two is more like our zone of what can be cognized which goes beyond what we can influence in the current moment because there's some future time when you won't be able to imagine you know you know as as the the curtains close on life",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2831.957,
    "end": 2851.896,
    "text": " and it narrows in and it's like smaller and smaller and then there's some point where your capacity to influence is actually kind of toned out and so there are two complementary ways to look at the same thing although it's interesting i want to say because i uh you know like",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2852.429,
    "end": 2860.692,
    "text": " You look at that, like, there could be some inner supervening or intervening thing where it actually helps you that you never considered in this in this cone of possibility.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2860.772,
    "end": 2865.154,
    "text": "So you become wider, like really, it's just the winding road, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2867.775,
    "end": 2868.395,
    "text": "For sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2870.896,
    "end": 2872.317,
    "text": "All right, moving on, let's go to 28.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2873.866,
    "end": 2875.407,
    "text": " This is sort of taking the light cone.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2875.427,
    "end": 2881.853,
    "text": "There's just one and a half more slides that take the light cone in a little bit of a different, more physical direction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2882.333,
    "end": 2885.636,
    "text": "But again, it's all part of a continued conversation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2886.516,
    "end": 2887.737,
    "text": "So we can look at the now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2888.178,
    "end": 2901.169,
    "text": "That's the middle of those three layers where there's two different individuals, Sally and friend N. So it's like two of those are at different points now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2902.0,
    "end": 2904.181,
    "text": " And so then we look over on the time cone on the right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2904.301,
    "end": 2907.762,
    "text": "And so Agent N is, you know, Nick, that's the one that we're focusing on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2908.422,
    "end": 2914.003,
    "text": "And now, at the same time, they're at the same moment, but they're in different points in space.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2914.763,
    "end": 2920.685,
    "text": "So from the point of view of N, S is a space-like point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2921.505,
    "end": 2924.306,
    "text": "But then in the same spot,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2925.211,
    "end": 2946.222,
    "text": " in the future or the past f or p in the same location you know the same address 20 minutes ago is time like and the same address 20 minutes in the future is also time like but then on the edges of this cone is like light which i i don't know the physics behind but i think it's kind of a cool idea that space and time have this",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2947.29,
    "end": 2960.317,
    "text": " boundary nature and that there's things that are more space, like, like things that are instantaneously at the same moment, but in different spaces and more time, like the pure case being the same location at a different time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2960.957,
    "end": 2964.579,
    "text": "But then it's like, Oh, I'll meet you in 20 minutes, two blocks away.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2965.139,
    "end": 2967.62,
    "text": "That's like moving through both space and time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2968.221,
    "end": 2970.982,
    "text": "And maybe light does that in a kind of unique way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2971.662,
    "end": 2974.424,
    "text": "So that was just one way that in relativity,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2975.333,
    "end": 2981.162,
    "text": " that they talk about light cones, and indeed the light cone concept is a physicist's concept.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2982.924,
    "end": 2988.633,
    "text": "That's really cool to think about, like, that light is the boundary between space and time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2988.653,
    "end": 2991.257,
    "text": "That's kind of a neat thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2992.682,
    "end": 2994.083,
    "text": " Yes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2994.103,
    "end": 3011.673,
    "text": "And then on 29, I just wanted to pull one again, the details going beyond me and this discussion, but here in a recent paper that explored how you could do simulations using light cones.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3011.753,
    "end": 3016.096,
    "text": "And so this is not just like sort of a metaphor, a cognitive heuristic.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3016.156,
    "end": 3019.498,
    "text": "This is something that you can use for large-scale data analysis.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3020.367,
    "end": 3041.654,
    "text": " And so the way which I alluded to earlier in which you can speed up a simulation potentially by using the light cone is by having a point that you're focusing on, and then you only need to consider one time point in the past at a radius of one spatially, two time points in the past, a radius of two spatially, three to three out.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3042.114,
    "end": 3046.836,
    "text": "And so it helps you reduce the space of what you need to calculate from all versus all",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3047.516,
    "end": 3054.7,
    "text": " to the idea of calculating more and more out in more and more past steps and more and more out as you go into the future.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3056.601,
    "end": 3063.005,
    "text": "So that's because in the physical interpretation, there's a speed of propagation through a media.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3063.465,
    "end": 3065.126,
    "text": "So things don't happen instantaneously.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3065.206,
    "end": 3068.668,
    "text": "So that's like light moving through a media at the speed of light.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3069.381,
    "end": 3072.422,
    "text": " And then in the case of information propagation, it's similar.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3072.882,
    "end": 3083.626,
    "text": "Like if you wanted to focus on a given person and their role on an informational network, you would maybe make like an informational cone instead of needing to calculate all by all at every single time steps.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3084.486,
    "end": 3089.688,
    "text": "So it just made us curious about how active inference related to light cones.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3090.088,
    "end": 3093.769,
    "text": "So how can we apply this to some of the simulation models that we've already seen?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3094.804,
    "end": 3099.249,
    "text": " And then just what does the past of the light cone represent?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3099.309,
    "end": 3100.29,
    "text": "What is the current moment?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3100.65,
    "end": 3101.351,
    "text": "What's the future?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3101.772,
    "end": 3103.814,
    "text": "Just fun, eternal questions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3106.617,
    "end": 3106.817,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3108.607,
    "end": 3110.508,
    "text": " Ah, so I made this slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3110.528,
    "end": 3111.048,
    "text": "This is funny.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3111.108,
    "end": 3117.271,
    "text": "This light cone I actually showed when I gave a seminar at Mike Levin's lab a couple years ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3117.391,
    "end": 3125.174,
    "text": "It's from Andrew Gallimore's paper, Restructuring Consciousness, the Psychedelic State in the Light of Integrated Information Theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3125.694,
    "end": 3132.697,
    "text": "But I was thinking about this in terms of shrinking and expanding the boundary of the self, which the author discusses a lot in the paper here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3134.117,
    "end": 3138.218,
    "text": " And just like how that would change your effective light cone, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3138.258,
    "end": 3145.9,
    "text": "Like, so if you have your self boundary, it's like a limited light cone, like the darker one that's shown in this figure on the right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3146.3,
    "end": 3149.401,
    "text": "And if you expand the boundary of yourself, it expands your light cone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3149.421,
    "end": 3152.882,
    "text": "So it made me think of that as we were talking, as he was talking, as Mike was talking about the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3153.903,
    "end": 3156.365,
    "text": " shrinking and expanding the boundary of the self in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3156.746,
    "end": 3162.672,
    "text": "And so I'm really curious, here's a couple of quotes from the paper about boundary establishment and maintenance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3162.912,
    "end": 3169.84,
    "text": "So he says, the surrounding body becomes an informational shield or Markov blanket for the stem cell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3170.0,
    "end": 3172.283,
    "text": "And this is, he references Carl Friston's 2013 paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3175.045,
    "end": 3178.507,
    "text": " And so I wonder about like the Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3178.687,
    "end": 3192.717,
    "text": "And I think that, you know, Daniel, this is something you and I have talked about as well about the Markov blanket, like being the defining boundary for the individual and like how, I mean, things must pop in and out of a Markov blanket, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3192.757,
    "end": 3197.12,
    "text": "Like if I think about the cells that are in my skin layer, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3197.16,
    "end": 3197.3,
    "text": "Like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3197.66,
    "end": 3200.742,
    "text": " I mean, I'm losing them all the time and new ones are constantly being added.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3200.842,
    "end": 3204.945,
    "text": "So there's no distinct hard line to be drawn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3204.965,
    "end": 3209.088,
    "text": "So like under, like how do things pop in and out of a Markov blanket?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3209.148,
    "end": 3214.812,
    "text": "Like, and what do you, can you like just have like peripheral boundary nodes on the edges there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3215.152,
    "end": 3219.035,
    "text": "Like I've talked before also about like the difference between like your fingernail and your cuticle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3219.395,
    "end": 3224.158,
    "text": "Like there's like a small tiny layer that doesn't know whether it's a fingernail or a cuticle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3224.178,
    "end": 3225.059,
    "text": "So it's like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3225.419,
    "end": 3227.961,
    "text": " How do you, like, have these, like, boundaries, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3228.721,
    "end": 3230.203,
    "text": "Anyway, another quote from the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3230.223,
    "end": 3238.829,
    "text": "Crucially, by organizing into a partial electrochemical and informational pool or synctitium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3240.89,
    "end": 3241.851,
    "text": "Somebody say that for me, please.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3244.488,
    "end": 3245.549,
    "text": " Sincidium.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3245.849,
    "end": 3246.77,
    "text": "Sincidium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3246.931,
    "end": 3247.411,
    "text": "There we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3248.172,
    "end": 3256.621,
    "text": "All of the cells are able to measure and detect events occurring within the same boundary, creating a larger individual that emerges from the collective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3256.781,
    "end": 3259.364,
    "text": "And I think this quote was like in reference to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3260.244,
    "end": 3268.629,
    "text": " the gap junctions and how they expand that electrochemical pool by like, they open up like some, like they pull the plug on the electrochemical gradient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3268.669,
    "end": 3271.59,
    "text": "And so it kind of enables this like cell linkage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3272.211,
    "end": 3280.375,
    "text": "So that's one one way that, you know, boundaries are maybe established, but any thoughts on this, guys?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3284.264,
    "end": 3285.044,
    "text": " We'll come back to it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3285.064,
    "end": 3288.885,
    "text": "I think I have a few thoughts on where the Markov blankets come into play through time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3289.165,
    "end": 3289.305,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3289.325,
    "end": 3290.185,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3291.086,
    "end": 3294.286,
    "text": "So homeostasis, which we promised to come back to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3294.366,
    "end": 3299.527,
    "text": "So what evolutionary pressures led cognitive boundaries to expand?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3299.608,
    "end": 3300.468,
    "text": "This is from the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3300.948,
    "end": 3305.729,
    "text": "And the author proposes that the atom of this cognitive hierarchy is homeostasis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3306.93,
    "end": 3316.138,
    "text": " So reactive homeostasis evolves into predictive allostasis under the pressure to predict signals from the environment and other elements of the biosphere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3316.218,
    "end": 3326.027,
    "text": "And that's like what I was talking about earlier about the first like counterfactual about, you know, what if it's not always 76 degrees and full of nutrients in my environment?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3327.269,
    "end": 3332.013,
    "text": "How can I regulate that, reduce my uncertainty about future availability of the supplies that I need?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3334.628,
    "end": 3339.049,
    "text": " And also there's this nice progression from homeostasis.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3339.069,
    "end": 3343.61,
    "text": "So that's sort of like similar, you know, same homeostasis.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3343.67,
    "end": 3346.291,
    "text": "It's the thermometer is trying to get within the bound.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3346.891,
    "end": 3356.693,
    "text": "But the best way to stay within the bounds when the environment is changing is actually to not just be reactive, but to be proactive or predictive.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3357.443,
    "end": 3360.606,
    "text": " And then what's the best way to be proactive?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3360.706,
    "end": 3364.87,
    "text": "Well, it's to have increasingly rich generative models of the niche.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3365.49,
    "end": 3372.616,
    "text": "If you know that nighttime is coming, you're going to be able to take really good predictive behavior right now for tonight.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3373.057,
    "end": 3379.863,
    "text": "If you know that winter is coming at a larger timescale, it's another level of you being able to make adaptive decisions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3380.403,
    "end": 3383.286,
    "text": "So what looks like homeostasis sometimes is,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3383.926,
    "end": 3389.011,
    "text": " can actually just be very skillful predictive allostasis.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3390.813,
    "end": 3395.538,
    "text": "Do you have any thoughts, Sarah, on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3399.723,
    "end": 3399.943,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3402.848,
    "end": 3407.931,
    "text": " Okay, so this one is memory and scale-free cognition and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3409.532,
    "end": 3420.138,
    "text": "So, I don't know, I just had some thoughts here, like memory as a gene regulatory network, and this is kind of something that not really was stated in this paper, but really, like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3421.078,
    "end": 3433.806,
    "text": " You know, it's our evolutionary memory of, like, where we've been before and how we've come to regulate and, you know, work within our environmental condition and, like, also memory as a process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3433.866,
    "end": 3435.167,
    "text": "Like, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3435.187,
    "end": 3437.448,
    "text": "I think about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3437.548,
    "end": 3438.769,
    "text": "Like, where is it stored?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3438.889,
    "end": 3440.37,
    "text": "Is it externalized into the niche?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3440.55,
    "end": 3442.331,
    "text": "Like, we do a lot of niche modification.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3442.411,
    "end": 3442.751,
    "text": "And so...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3443.752,
    "end": 3466.771,
    "text": " i don't know um it's interesting to think about our our ram and our rom in um in like a biological sense so it's the author says a second step in the simplest homeostatic loop is the inclusion of a richer set of hidden layers in the neural network sense so these are additional biochemical nodes between sensors and effectors of a given system that enable a degree of memory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3467.992,
    "end": 3475.719,
    "text": " And importantly, memory can serve as the beginning of modularity because learning essentially groups diverse stimuli into compressed representations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3476.339,
    "end": 3480.623,
    "text": "Complex states of affairs become remembered as compact biophysical engrams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3481.023,
    "end": 3490.551,
    "text": "This is the essence of the kind of modularity when a simple biophysical event kicks off the formation of a complex morphogenetic cascade, such as building a hand in embryogenesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3493.348,
    "end": 3520.102,
    "text": " one nice point there is the difference between modularity and memory about how they enable each other it's sort of like if everything is being mixed in one cup there can't be a memory of different colors okay well if you have two separated cups you can remember two different colors and so on so memory can serve as the beginning of modularity is saying that it's this um relationship between things becoming distinct",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3520.982,
    "end": 3522.645,
    "text": " and being remembered through time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3523.046,
    "end": 3525.73,
    "text": "Distinctness carried through time is memory.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3526.231,
    "end": 3533.043,
    "text": "You can remember a longer number when you have more modularity that's being propagated through time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3534.693,
    "end": 3550.224,
    "text": " And then the paper on the right is an older Friston paper talking about memory, attention, and salience, and active inference, where they described memory, working memory, as a process of evidence accumulation in a temporarily structured hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3550.685,
    "end": 3558.27,
    "text": "So I guess like going back through deep time, like that's where the gene regulatory network kind of comes in as a process, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3558.29,
    "end": 3559.571,
    "text": "Like the process of evolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3560.652,
    "end": 3562.313,
    "text": "And that's like the working memory there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3562.714,
    "end": 3562.914,
    "text": "Anyway.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3563.903,
    "end": 3576.634,
    "text": " And just to give one note there on the multi-scale active inference models, sometimes the way that memory is being modeled in active inference is as a state variable that changes at a slower rate.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3577.535,
    "end": 3582.659,
    "text": "And so within the longer time scale model, we have a shorter time scale model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3583.22,
    "end": 3588.004,
    "text": "And then that can be modeled from setting to setting as memory carrying over.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3588.755,
    "end": 3598.585,
    "text": " And so it relates to this idea that the larger cognitive system is able to also act over longer timescales as well as reach back with a deeper memory.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3599.352,
    "end": 3607.215,
    "text": " Because if you have the kind of short-term model that's just standalone, it's like a memoryless process.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3607.795,
    "end": 3615.798,
    "text": "But if that has inherited from a hierarchical model, the state from a previous click of the model, it's memory.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3616.258,
    "end": 3620.36,
    "text": "And then if it's able to imagine one more click out into the future, it's goal planning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3620.44,
    "end": 3621.28,
    "text": "It's anticipation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3621.781,
    "end": 3627.823,
    "text": "And so in active inference, one of the ways that we integrate memory and planning",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3628.444,
    "end": 3632.064,
    "text": " together is by thinking about hierarchically nested models.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3632.99,
    "end": 3636.893,
    "text": " So also I wonder what role memory plays in policy selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3637.353,
    "end": 3644.519,
    "text": "Like I remember every summer when I go to Scotland, it is cold, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3644.559,
    "end": 3645.579,
    "text": "Like, I mean, I live in New Mexico.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3645.599,
    "end": 3647.321,
    "text": "It's like 120 degrees Fahrenheit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3647.781,
    "end": 3651.584,
    "text": "So every summer I remember that when I go to Scotland, it's cold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3651.604,
    "end": 3655.066,
    "text": "So now it's my policy to bring a jacket when I go, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3655.146,
    "end": 3658.008,
    "text": "So even though it's the summertime and I wouldn't normally do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3658.088,
    "end": 3662.712,
    "text": "So is that memory also ever modeled in the policy selection, Daniel?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3666.069,
    "end": 3667.931,
    "text": " It's a good question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3668.231,
    "end": 3672.915,
    "text": "I wonder if you can plan to forget, or I'll make a note, I'll plan to remember.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3674.616,
    "end": 3689.368,
    "text": "I'd say active inference just gives us a way to think about all those different affordances that real cognitive systems have, like offloading memory to the niche through external computation, or in terms of what you just described.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3689.648,
    "end": 3691.79,
    "text": "But that's a good question we can ask.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3692.318,
    "end": 3692.478,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3692.518,
    "end": 3696.662,
    "text": "I don't actually even need to remember that it's cold in Scotland because, you know, I can just ask Google.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3697.542,
    "end": 3699.764,
    "text": "They will tell me the weather and it will be cold in Scotland.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3699.804,
    "end": 3707.17,
    "text": "So if I just remember to, you know, check my cognitive offloading device, then I don't even need to remember to drink a chocolate when I go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3707.47,
    "end": 3707.671,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3710.693,
    "end": 3711.374,
    "text": "Okay, next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3712.373,
    "end": 3715.615,
    "text": " I have one random thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3715.635,
    "end": 3732.065,
    "text": "Maybe it comes up in another slide, but this question that Michael Levin has about how does it know when to stop in terms of cell growth and morphogenesis, if it's the case that it's connected to memory in the way that he's suggesting, then maybe it's related to information flow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3732.386,
    "end": 3734.647,
    "text": "I guess that's maybe obvious given the focus of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3735.387,
    "end": 3749.031,
    "text": " But it is interesting, you know, it's like the cells are just like, oh, we've got to now become multi-bodied or, you know, or become social rather than individual in order to store memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3749.051,
    "end": 3750.971,
    "text": "Like there's this funny, like, break point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3753.332,
    "end": 3759.134,
    "text": "Yeah, I didn't see the stop mechanism really brought up in this paper, but I have seen it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3759.274,
    "end": 3762.935,
    "text": "So I'm not really sure where it ties in here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3762.955,
    "end": 3763.535,
    "text": "Mm-hmm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3769.058,
    "end": 3770.199,
    "text": " Figure three?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3770.86,
    "end": 3779.289,
    "text": "I mean, if you call it a morphogenic cascade, you know, it's like, well, we're born, we grow, we grow to a certain point, and then we shrivel and die.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3779.349,
    "end": 3782.492,
    "text": "So it's like, how does that connect to memory and information?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3783.373,
    "end": 3784.254,
    "text": "It's kind of suggested.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3784.274,
    "end": 3786.717,
    "text": "Yep.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3788.263,
    "end": 3796.154,
    "text": " So figure three is looking at a sort of cell's eye view of that time cone.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3796.695,
    "end": 3800.4,
    "text": "And now we're going to step away from, you know, is it a time diamond or is it a time cone?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3800.721,
    "end": 3804.146,
    "text": "And we're going to think about the trajectory of a given cell.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3804.75,
    "end": 3806.631,
    "text": " Go back to the assumptions of the paper, though.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3806.971,
    "end": 3809.693,
    "text": "This isn't about whether the cell is experiencing things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3809.733,
    "end": 3811.654,
    "text": "It's not what it's like to be a cell.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3812.355,
    "end": 3820.539,
    "text": "It's about how the cell has a given spatial extent in A. It has a given spatial extent that can be thought of as having a memory.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3820.94,
    "end": 3822.561,
    "text": "It inherits a history through time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3823.121,
    "end": 3826.903,
    "text": "And then also has an anticipation zone in the future.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3829.344,
    "end": 3848.32,
    "text": " it can do anticipation and memory as a sole agent or it can interact socially so what happens when it interacts socially with other agents like itself well it expands the spatial dimension in the now that's what's being called integrated spatial perception",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3849.176,
    "end": 3852.661,
    "text": " And that allows it to have expanded memory in the past.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3852.901,
    "end": 3859.349,
    "text": "Like if each of your five friends have a book, then there's more memory as a group because there's more books.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3859.89,
    "end": 3863.955,
    "text": "And then also the ability to extend the anticipation into the future.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3864.816,
    "end": 3866.878,
    "text": "And then this part I just highlighted in blue is",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3868.715,
    "end": 3876.077,
    "text": " Joining into communication networks allows the cell to have temporarily delayed access to the information obtained by neighboring cells.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3876.678,
    "end": 3878.538,
    "text": "This is where the time cone comes into play.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3879.338,
    "end": 3887.501,
    "text": "It's not that when something is perceived by one of these cells off on the fringe, the focal cell doesn't instantly hear about it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3887.921,
    "end": 3890.422,
    "text": "They hear about it one time step later.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3891.322,
    "end": 3894.083,
    "text": "So that's where the time cone comes into play.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3894.969,
    "end": 3907.104,
    "text": " Because from the point of view of this focal cell, just assuming that information moves one cell per unit of time, then at zero time points, its radius is one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3908.118,
    "end": 3913.679,
    "text": " one time point away, its ability to integrate sense is one more radius away.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3914.3,
    "end": 3925.883,
    "text": "And so you can keep on clicking back and that's reflecting a broader and broader zone of memory, or you can carry it forward with a broader and broader zone of influences or of states that it can affect.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3926.883,
    "end": 3935.025,
    "text": "And so the resulting larger individual, and again, individual is being used cognitively here, not like evolutionarily,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3936.101,
    "end": 3941.646,
    "text": " is formed with a cognitive world that's unified by the cell's sharing of information across time and space.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3942.407,
    "end": 3945.73,
    "text": "So, no teleportation and no time travel.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3946.531,
    "end": 3957.721,
    "text": "The limitations of propagation of information in our physical universe means that from the point of any given cell or agent, it's existing in this time-cone-like structure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3959.929,
    "end": 3967.316,
    "text": " Yeah, that was like the expanding the boundary of the self and like kind of like what happens, like the time cone is expanded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3967.416,
    "end": 3978.346,
    "text": "And you know what, this just makes me think of, well, first, I just want to remind everyone that this like cell-cell communication is like what gap junctions facilitate because they're really connecting all cells and solid tissues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3979.026,
    "end": 3983.349,
    "text": " Um, but, but really I thought about, you know, the old adage that you are your company.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3984.01,
    "end": 3996.538,
    "text": "And like, if you think about, you know, your five, like closest friends and that like communication, like network that you have, like you hear about, you know, world events or events that are relevant to their lives, it might be relevant to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3996.578,
    "end": 4004.844,
    "text": "Like you hear about it one time step later and just how like, you know, your cognitive like boundary is expanded by like your inner circle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4005.204,
    "end": 4005.484,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4005.625,
    "end": 4006.225,
    "text": "Made me think of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4008.12,
    "end": 4008.3,
    "text": " Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4008.481,
    "end": 4015.172,
    "text": "Hey, Blue, can you just re-highlight or talk about the cell tension that you were just mentioning?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4015.735,
    "end": 4038.317,
    "text": " yeah so that was earlier in the talk it was one of the keywords so let me just go back to that slide um so here uh these gap junctions so they they are they were originally you know categorized in like neural tissue and uh and muscle you know to facilitate like rapid communication but they're really present in every cell and solid tissue and they they just perform",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4039.397,
    "end": 4046.321,
    "text": " Not ion exchange, but it's like passive diffusion of ions so that it's like almost a shared intercellular space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4049.162,
    "end": 4056.146,
    "text": "So would it be safe to call that a kind of a information bottleneck?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4056.386,
    "end": 4057.046,
    "text": "I just wonder.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4057.346,
    "end": 4064.51,
    "text": "So maybe not as much of a bottleneck as it is like it pokes a hole in the informational boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4067.329,
    "end": 4076.872,
    "text": " The more rapidly, let's just say that the gap junction, so the no gap junction, it takes three time steps for the signal.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4077.292,
    "end": 4081.093,
    "text": "One time step to release the molecule, one for it to diffuse, one for it to be perceived.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4081.493,
    "end": 4085.834,
    "text": "So every three units of time, you're getting a radius expanding out by one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4086.535,
    "end": 4090.796,
    "text": "Now let's just say that a gap junction allows one time step, the direct diffusion.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4091.396,
    "end": 4094.537,
    "text": "So then the time cone is expanding wider.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4095.362,
    "end": 4101.267,
    "text": " because the diffusion from the target cell is able to sweep out a larger time cone.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4101.567,
    "end": 4107.451,
    "text": "Whereas if, again, if it took three units of time for every one of diffusion, it'd be like a narrower time cone.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4108.012,
    "end": 4119.501,
    "text": "So rapid communication, which is never instant, allows that time cone to access more memory into the presence and then influence more broadly",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4120.464,
    "end": 4125.794,
    "text": " And so bottleneck is sort of like thinking like a bottleneck is a constraint relative to the width of the bottle.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4126.355,
    "end": 4131.925,
    "text": "But in the context of a gap junction, it's actually like a channel or an opening for information transmission.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4133.132,
    "end": 4147.247,
    "text": " So if you think about it in terms of like your inner circle of friends, imagine like you can wait for your friend to call you up and tell you this exciting new event or like you can have a wiretap into their house.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4148.088,
    "end": 4150.991,
    "text": "So like the gap junction is like having a wiretap into their house.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4151.031,
    "end": 4153.334,
    "text": "So like you always know like what is going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4155.911,
    "end": 4161.313,
    "text": " Okay, what I'm also searching for another analogy that's just saying to the stuff I've been looking at lately.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4161.353,
    "end": 4177.059,
    "text": "Do you think it's fair to analysis to You know, a compression function like, you know, if you take a picture of the classic neural net, you know, a bunch of notes here, just a few in the center of the hidden layer and then expand it out with with it better be a fair analogy for a jet gas junction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4180.154,
    "end": 4181.596,
    "text": " Yeah, I'm not seeing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4181.916,
    "end": 4182.257,
    "text": "Sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4182.517,
    "end": 4183.198,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4183.759,
    "end": 4194.913,
    "text": "Okay, I would just, to recover it, I would just say the transmission is like a compressed form of, it's like a little sampling of the chemical milieu from one cell being passed to the other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4195.574,
    "end": 4196.996,
    "text": "If there was no bottleneck,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4197.831,
    "end": 4201.392,
    "text": " no compression of information, they would be just in one unit.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4201.412,
    "end": 4203.133,
    "text": "They'd be in one Markov blanket.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4203.813,
    "end": 4209.715,
    "text": "And so there's this trade-off where if you totally isolate, the rate of information propagation is low.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4210.115,
    "end": 4211.855,
    "text": "The modularity is very high though.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4212.395,
    "end": 4218.017,
    "text": "On the other hand, with total integration, you can't have memory because you don't have modularity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4218.624,
    "end": 4222.427,
    "text": " However, you do have instantaneous or close to that transmission.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4223.048,
    "end": 4234.697,
    "text": "And then the gap junction exists at this kind of sweet spot that allows for modularity with narrow channels of communication, which is what Shannon was studying in the first place.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4239.22,
    "end": 4239.461,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4239.481,
    "end": 4240.521,
    "text": "So the figure... Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4241.302,
    "end": 4243.564,
    "text": "So figure three, I think we just popped on the cone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4243.604,
    "end": 4244.064,
    "text": "Is that true?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4244.825,
    "end": 4245.706,
    "text": "Yeah, that's just a...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4247.1,
    "end": 4255.306,
    "text": " draw the connection between the figure of two with the time diamonds, time cone, and then just this figure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4256.566,
    "end": 4258.888,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4258.908,
    "end": 4260.329,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4260.489,
    "end": 4261.31,
    "text": "Figure four.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4261.33,
    "end": 4262.19,
    "text": "Go ahead.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4262.31,
    "end": 4266.533,
    "text": "Figure three, the slide that we just had was as things build out.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4267.054,
    "end": 4270.536,
    "text": "That was the point of view of the agent building out, and now it's like things fall apart.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4271.547,
    "end": 4286.352,
    "text": " So figure four, we see a sort of rehearsal in B of what we saw previously, which is that that target cell, it's combining sensory information that's enabling it to detect patterns more rapidly, getting a big picture.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4286.812,
    "end": 4293.575,
    "text": "That's what it says in B. And therefore missing information can be anticipated by this pattern seeking drive.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4294.315,
    "end": 4296.276,
    "text": "But what happens when things go wrong?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4297.133,
    "end": 4302.416,
    "text": " That's in C, where this bottom right cell, the green one, has gone rogue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4302.956,
    "end": 4313.921,
    "text": "It has stopped communicating in a way that was participating in this broader sense-making, and it has shrunk its sensory radius down.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4314.501,
    "end": 4319.024,
    "text": "And so in doing so, it reduced the cognitive capacity of the other four cells.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4319.864,
    "end": 4329.074,
    "text": " it has reduced its own sphere of influence, and it's also introduced this adversarial dynamic potentially over evolutionary or developmental timescales.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4333.038,
    "end": 4333.238,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4333.298,
    "end": 4334.259,
    "text": "Any more thoughts on that one?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4336.261,
    "end": 4338.103,
    "text": "Yeah, it reminds me of a friend I know, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4338.576,
    "end": 4356.072,
    "text": " no otherwise it also reminds me about how cancer research is starting to think more about the niche and the signaling between cancer and non-cancer cells like cancer cells need to call down healthy blood vessels they need to prevent healthy immune response from taking them out",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4356.713,
    "end": 4371.256,
    "text": " And so it's like cancer as a dialectic or as a relationship between agents with different goals, again, not the experience of the goal, but acting as if it has a goal, that third person cybernetic teleology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4372.037,
    "end": 4382.519,
    "text": "And so that helps us make sense of all these disparate features of cancer by thinking about internal and external states, information propagation, et cetera.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4384.27,
    "end": 4392.939,
    "text": " Do you think it would be right or off to think about the one possible place where that could go wrong happening at the gap junction?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4392.979,
    "end": 4395.682,
    "text": "Like the gap junction would no longer function as a good",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4397.662,
    "end": 4403.047,
    "text": " sampler compression thing, which I know you don't agree with the analogy, but something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4404.228,
    "end": 4408.691,
    "text": "I don't know what's happening in that research area, but does that make any sense?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4409.532,
    "end": 4416.418,
    "text": "Yeah, we talked about gap junctions earlier and their involvement in neoplasticity and all kinds of other disorders.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4416.598,
    "end": 4417.479,
    "text": "So definitely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4417.499,
    "end": 4424.424,
    "text": "I just found this really nice paper called Gap Junctions in Cancer Communicating for 50 Years.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4425.865,
    "end": 4439.133,
    "text": " And the abstract starts with 50 years ago, tumor cells were found to lack electrical coupling, leading to the hypothesis that loss of direct intracellular communication is commonly associated with cancer progression and onset.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4439.874,
    "end": 4441.855,
    "text": "So that's pretty interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4441.875,
    "end": 4446.238,
    "text": "It's like when you shut down the lines of communication, like between two countries,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4447.017,
    "end": 4453.664,
    "text": " Are those two countries having an improving relationship or is that like the last time that they spoke before war?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4454.224,
    "end": 4463.433,
    "text": "So closing down the embassy, shutting down the gap junction, it doesn't bode well for sort of amicable resolution to conflict or communication.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4464.154,
    "end": 4468.258,
    "text": "That's why it's so important to maintain the avenues of communication.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4469.111,
    "end": 4488.682,
    "text": " even when there is an adversarial relationship because things can always get worse you can always shut down the communication which will make the generative models and the incentives and the goals diverge even more cool i don't know just all of a sudden you go into politics and i'm like oh yeah but wait a minute anyway",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4490.889,
    "end": 4492.23,
    "text": " but we should shut down.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4492.37,
    "end": 4492.91,
    "text": "They're bad.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4493.17,
    "end": 4493.89,
    "text": "We should shut down.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4494.311,
    "end": 4500.813,
    "text": "No, I wasn't thinking that, but if you keep the channel open, you also stand more chance of injury by way of keeping the channel open.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4500.893,
    "end": 4501.694,
    "text": "So, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4502.534,
    "end": 4503.914,
    "text": "Keep the channel open until you shouldn't.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4505.615,
    "end": 4519.481,
    "text": "This is just a fun discussion for a little bit on the evolutionary anachronism, which means just something that's happening at a different time than it's expected, like a feature from the past that gets brought back, like",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4520.043,
    "end": 4521.364,
    "text": " an evolutionary reversion.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4522.625,
    "end": 4537.858,
    "text": "And so in the paper, it's described that this is a breakdown of multicellularity and highlights the fact that the scale of the structure which cells work to maintain can change rapidly from cooperation towards an entire organ system or body to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4538.433,
    "end": 4541.177,
    "text": " that's a healthy organism, to the level of a single cell.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4541.839,
    "end": 4549.931,
    "text": "So instead of seeing cancer just mechanistically as a derangement of signaling or a derangement of replication and DNA reproduction of a cell,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4551.454,
    "end": 4555.978,
    "text": " We can think about it informationally and cognitively and cybernetically.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4556.479,
    "end": 4564.086,
    "text": "Like the cell has changed its cybernetic horizon from the goals of the organism to its own local goals.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4565.007,
    "end": 4572.575,
    "text": "And so this concept of an evolutionary anachronism and how even in the current day, we can study anachronism.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4573.776,
    "end": 4576.459,
    "text": " An example is with avocados, a tasty fruit.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4577.38,
    "end": 4588.351,
    "text": "And as per the Wikipedia, it says avocados are exceptionally fatty fruits with seeds far too large to be successfully dispersed by any wild animal presently alive in the Americas.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4589.111,
    "end": 4592.154,
    "text": "And so that is a paper of Janssen and Martin in the 80s.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4593.246,
    "end": 4602.189,
    "text": " which was actually talking about the ecology of large animal plant interactions of animals that we've never directly seen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4602.749,
    "end": 4615.674,
    "text": "But it's like if you know that there is a really large seed and you know that there's seed dispersing mammals, then it can lead you to hypothesize that there was a seed disperser that was large enough to eat avocados whole.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4617.675,
    "end": 4621.296,
    "text": "And so we can look at anachronism in the current moments",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4622.327,
    "end": 4625.349,
    "text": " and help us retrace the past.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4625.509,
    "end": 4646.422,
    "text": "So just like the avocado is an anachronistic trait with such a large seed given to the current ecology, not the past ecology, we can see cancer as this anachronistic reversion to a previous mode of information integration and goal setting that it's like it's inappropriate in the context of the goals of the body, but",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4648.394,
    "end": 4654.516,
    "text": " not necessarily within the goals of a single cell that just wakes up one day, it's like, wow, I'm bathed in glucose, I should replicate.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4654.976,
    "end": 4656.257,
    "text": "So can't blame that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4657.537,
    "end": 4664.499,
    "text": "Also, like the cancer, a lot of the markers in cancer cells are really like, it's like a developmental reversion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4664.659,
    "end": 4666.38,
    "text": "So not sure if you guys are aware of that or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4666.4,
    "end": 4670.481,
    "text": "But it's like they they revert to like a more immature cellular phenotype.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4670.961,
    "end": 4674.582,
    "text": "And so that that I mean, it's literally like going back to the past.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4674.843,
    "end": 4676.083,
    "text": "So interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4678.413,
    "end": 4679.254,
    "text": " Yep, stemminess.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4680.035,
    "end": 4681.417,
    "text": "Yes, stemminess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4683.579,
    "end": 4685.201,
    "text": "Are there, like, degrees of reversion?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4685.322,
    "end": 4688.806,
    "text": "Like, is there something to be learned from the degree of reversion?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4688.826,
    "end": 4692.11,
    "text": "The degree of stem celliness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4694.38,
    "end": 4696.262,
    "text": " I'm not sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4696.302,
    "end": 4704.994,
    "text": "One thing that comes to mind there is there's some cancers where the it goes back to like a stem cell of that tissue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4705.775,
    "end": 4710.882,
    "text": "So like it's like a white blood cell cancer that like replicates a lot of white blood cells.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4711.806,
    "end": 4738.343,
    "text": " But when there is a cancer in a reproductive organ, sometimes it's like called a teratoma because it can have like hair and nails and stuff like that, because it's actually pulled back so far that it can then differentiate on all the pathways totipotent cell, rather than a reversion up from being like a healthy reproducing white blood cell precursor to just a higher",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4739.263,
    "end": 4758.051,
    "text": " like a white blood cell stem lineage but it doesn't pull back all the way to including ectoderm whereas if it was in um you know a reproductive cell then it could do that cool biofilms do you want to take this one daniel",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4759.008,
    "end": 4759.168,
    "text": " Yep.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4759.549,
    "end": 4764.993,
    "text": "So I think the key point here is that bacteria have ion channels just like metazoans do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4765.053,
    "end": 4772.46,
    "text": "Dopamine, GPCRs, the proteins that signal between neurons, those are not innovations of mammals.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4772.54,
    "end": 4774.882,
    "text": "They're not innovations of vertebrates.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4775.002,
    "end": 4779.326,
    "text": "Those kinds of channels and diffusible molecules are cellular.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4779.486,
    "end": 4780.387,
    "text": "They're panacellular.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4781.303,
    "end": 4788.747,
    "text": " And so what's being shown here is just like in previous figures, we saw one kind of eukaryotic cell, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4788.967,
    "end": 4790.168,
    "text": "You knew because it had a nucleus.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4790.928,
    "end": 4794.77,
    "text": "We had one eukaryote connecting with a few other eukaryotes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4795.35,
    "end": 4804.655,
    "text": "Well, here we have one prokaryote connecting with other prokaryotes to do the exact same thing, which is increase its sensory capacity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4805.115,
    "end": 4808.557,
    "text": "Again, not instantaneously, but think time cone, light cone.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4809.727,
    "end": 4825.787,
    "text": " And so in the same way that the eukaryotic cells form a cognitive individual through their associations and affordances, such as the gap junctions bacteria, when they form a biofilm can also form a larger cognitive integrated individual.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4826.593,
    "end": 4832.019,
    "text": " And you can still say, well, but from an evolutionary point of view, the unit of selection is the single bacteria.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4832.039,
    "end": 4832.119,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4832.319,
    "end": 4836.163,
    "text": "But that's the evolutionary individuality definition.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4836.724,
    "end": 4847.416,
    "text": "And when we use the cognitive individuality definition, we see a lot of the similarities between a multicellular organism's tissue and then a multicellular biofilm tissue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4848.507,
    "end": 4855.429,
    "text": " Even not in a biofilm, I mean, bacteria have an incredible ability to like, I mean, it's like antibiotic resistance, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4855.469,
    "end": 4860.611,
    "text": "Like they do plasmid exchange, which isn't like their chromosomal DNA, but it's like small little snips of DNA.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4860.971,
    "end": 4862.451,
    "text": "Like they just like have a handshake.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4862.491,
    "end": 4863.911,
    "text": "Like it's like a bacterial handshake.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4863.951,
    "end": 4866.892,
    "text": "Like now I'm going to give you some antibiotic resistance too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4866.912,
    "end": 4869.753,
    "text": "Like we spread germs like COVID and bacteria to one another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4870.073,
    "end": 4872.454,
    "text": "They spread like plasmids to one another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4872.794,
    "end": 4897.274,
    "text": " which which confer different properties you know and then we select for this like antibiotic resistance through the use of all of our like antibacterials and so only bacteria that have these little plasmids are survive it's really interesting so even outside of a biofilm they do some some kind of um you know communication and like cognitive expansion of their self in like the way that we do with our inner circle of friends nice",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4899.056,
    "end": 4899.336,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4899.576,
    "end": 4899.856,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4900.037,
    "end": 4901.017,
    "text": "Key ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4901.858,
    "end": 4905.76,
    "text": "I just highlighted a few of these like points, but there's a huge box in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4905.78,
    "end": 4908.722,
    "text": "So we'll just read through the highlighted parts here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4908.802,
    "end": 4909.562,
    "text": "I'll take this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4909.702,
    "end": 4922.43,
    "text": "So first, a unified integrated cognitive self or individual can be defined with respect to the integrated ability to pursue specific goals via a homeostatic process that resists perturbations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4923.701,
    "end": 4944.553,
    "text": " Second, an agent's cognitive world can be quantified and characterized, enabling comparison with others regardless of their material implementation, by estimating the spatio-temporal boundaries of its area of concern, the volume in space and time over which the agent is able to take measurements, exert influence, and functionally link disparate events, learning, and association.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4945.546,
    "end": 4956.498,
    "text": " Three, the borders of the temporal and spatial events of which a given system is capable of measuring and acting map out a cognitive light cone, a boundary in the informational space of a mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4957.139,
    "end": 4962.184,
    "text": "So estimating the spatio-temporal boundaries of an agent is something I find particularly interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4962.244,
    "end": 4964.807,
    "text": "So I just put that in as a question at the bottom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4964.827,
    "end": 4966.629,
    "text": "Do you want to read some of the next ones, Daniel?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4968.191,
    "end": 4971.392,
    "text": " Yep, so these are some key ideas four, five, six.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4971.752,
    "end": 4977.415,
    "text": "So four, cancer is a reversible shrinking of the computational boundary of a biosystem.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4978.215,
    "end": 4980.236,
    "text": "Pretty tantalizing there with the reversible.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4980.576,
    "end": 4983.697,
    "text": "I'm sure that's something that a lot of people would like to see.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4984.178,
    "end": 4989.8,
    "text": "Maybe the idea is you remind the rogue agents about bigger goal.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4990.34,
    "end": 4997.043,
    "text": "Like, hey, you know, I know you're hungry, but we wait in line at this restaurant so that everybody gets what",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4998.027,
    "end": 4998.647,
    "text": " takes care of them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4999.168,
    "end": 5003.07,
    "text": "And maybe that helps remove the cancerous restaurateur.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5003.77,
    "end": 5027.342,
    "text": "Five, agents scaled up by evolving from basic homeostatic loops driven by active inference, which is surprise minimization, by the addition of delays, which are memory, anticipation, which is inference, inference has planning as inference, and networks, which is spatially distributed processing, enabling learning and progressive abstraction generalization from data.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5028.075,
    "end": 5038.758,
    "text": " That's pretty cool to see active inference and elaborations of active inference at the heart of this future electrical evo, eco-devo.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5039.899,
    "end": 5046.881,
    "text": "It's like saying you start with action and perception, and then you can carry that forward in time, planning, anticipation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5047.95,
    "end": 5050.173,
    "text": " have an extended trail of memory.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5050.614,
    "end": 5051.776,
    "text": "That's the past.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5052.297,
    "end": 5054.099,
    "text": "And then you can also expand spatially.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5054.179,
    "end": 5056.122,
    "text": "But again, the spatial isn't instantaneous.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5056.944,
    "end": 5058.847,
    "text": "There's a propagation speed in the media.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5059.347,
    "end": 5063.554,
    "text": "And so even laterally, similar agents interact through this light cone way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5064.815,
    "end": 5067.716,
    "text": " So nice to see where active inference plays into light cones there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5068.456,
    "end": 5081.06,
    "text": "And then six, infotaxis, the drive for better actionable intelligence about the regularities and patterns in the world and in the agent's own mechanisms, encourages cells to connect in groups via signaling.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5081.8,
    "end": 5091.123,
    "text": "This is another area where active inference has a lot to say and is a value add relative to a reward-only framework like reinforcement learning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5091.781,
    "end": 5096.868,
    "text": " Because, again, what drives the bacteria to coalesce and to work together?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5098.539,
    "end": 5104.062,
    "text": " Maybe it's reward, but then you have to appeal to this idea that they're maximizing reward with their behavior.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5104.082,
    "end": 5106.023,
    "text": "It's a stay or leave and all this kind of stuff.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5106.744,
    "end": 5122.012,
    "text": "Infotaxis helps us understand that the way to get good actionable intelligence, which is kind of like active inference, AI right there, is to make your actions exist on the tradeoff frontier, like the Pareto optimal tradeoff.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5122.572,
    "end": 5127.573,
    "text": " between getting it done right now and expanding your epistemic boundaries.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5128.093,
    "end": 5134.654,
    "text": "Sometimes the right move is to contact somebody who knows better or to go to a website that might inform you better.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5135.134,
    "end": 5141.496,
    "text": "And so it's actually a useful action in the moment to arrange to get better information later.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5142.096,
    "end": 5147.017,
    "text": "And so active inference helps us think about how these different needs are traded off by organisms.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5149.157,
    "end": 5149.337,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5151.866,
    "end": 5152.266,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5152.447,
    "end": 5155.269,
    "text": "So seven, collecting into, oh, I can't do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5156.089,
    "end": 5157.19,
    "text": "Syncytium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5157.491,
    "end": 5158.451,
    "text": "Syncytium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5158.551,
    "end": 5159.072,
    "text": "Syncytium?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5159.092,
    "end": 5160.153,
    "text": "Did I do it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5161.093,
    "end": 5161.374,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5162.535,
    "end": 5170.581,
    "text": "Collecting into a syncytium enables all of the cells to share the same data and access the same memories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5171.862,
    "end": 5172.723,
    "text": "That's pretty awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5173.143,
    "end": 5174.244,
    "text": "You must assimilate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5174.484,
    "end": 5175.065,
    "text": "It's like the Borg.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5177.846,
    "end": 5178.866,
    "text": " Sorry, Star Wars nerd.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5179.407,
    "end": 5181.867,
    "text": "Okay, also greed, eight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5182.127,
    "end": 5199.351,
    "text": "Greed at the single cell level for information, infotaxis, drives cooperativity as each unit expands its measurement boundary, communication with neighbors, and thus inevitably becomes part of a bigger self with bigger set points serving as homeostatic attractors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5199.951,
    "end": 5203.072,
    "text": "So I think active inference also has a role to play here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5203.792,
    "end": 5221.554,
    "text": " in this um cooperativity so like i can reduce my uncertainty about my environment by cooperating with people who have the same goal that i have right like or cooperating becoming part of a group you know and and therefore our efforts make a bigger effort or bigger",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5223.084,
    "end": 5228.108,
    "text": " Anyway, less surprise when I'm in a bigger group because it expands that light cone, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5228.708,
    "end": 5235.973,
    "text": "And then nine, there is a fundamental symmetry between anatomical control mechanisms and cognitive mechanisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5236.633,
    "end": 5241.397,
    "text": "And I think that this was discussed in terms of bioelectricity in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5241.437,
    "end": 5243.538,
    "text": "Do you guys have anything to add?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5244.359,
    "end": 5247.641,
    "text": "One thought on that is cooperation arising at a higher level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5248.436,
    "end": 5256.002,
    "text": " So that just reminds me of like, if you're looking through a microscope and you saw a cell a eat cell B you go, I mean, adversarial relationship, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5256.022,
    "end": 5258.084,
    "text": "Could there be anything more directly adversarial?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5258.424,
    "end": 5264.349,
    "text": "And then you pull back and it's a white blood cell, you know, that's attacking a cancer cell.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5264.789,
    "end": 5270.074,
    "text": "So it's cooperative at a higher level, but it can look adversarial at a low level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5270.094,
    "end": 5275.058,
    "text": "And so what does that map onto in different systems?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5275.851,
    "end": 5284.116,
    "text": " Can we reimagine conflict and tension as actually playing a stabilizing or cooperative role at a larger scale?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5284.596,
    "end": 5291.9,
    "text": "Can interpersonal differences in perspective or disagreements lead to a cooperative or regenerative collective?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5293.061,
    "end": 5294.942,
    "text": "This is what we hopefully move towards.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5296.525,
    "end": 5303.13,
    "text": " I saw some pigeons procreating yesterday while I was out walking around in my neighborhood and it definitely looked adversarial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5304.39,
    "end": 5308.874,
    "text": "It looked very, very adversarial, but they're cooperating at a higher level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5310.715,
    "end": 5311.635,
    "text": "Looks can be deceiving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5311.655,
    "end": 5313.337,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5313.437,
    "end": 5313.897,
    "text": "Definitely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5313.957,
    "end": 5321.882,
    "text": "I was thinking of a case where like if a tiger attacked me, I should just assume that it's like an information transfer that needs to happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5322.303,
    "end": 5322.703,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5322.983,
    "end": 5324.004,
    "text": "Come get peace with it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5326.25,
    "end": 5330.472,
    "text": " Oh, it's like in The Selfish Gene by Dawkins.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5331.212,
    "end": 5334.314,
    "text": "He says, yeah, why would you go beyond the gene?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5334.334,
    "end": 5335.294,
    "text": "It doesn't make any sense.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5335.514,
    "end": 5339.976,
    "text": "Would you have mammals doing kind acts for each other?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5340.036,
    "end": 5341.577,
    "text": "Just look at the lion eating the gazelle.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5342.397,
    "end": 5344.798,
    "text": "How could that possibly be a collaborative relationship?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5344.818,
    "end": 5349.08,
    "text": "And then I thought, what if those two populations stabilize each other through deep time?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5349.82,
    "end": 5351.181,
    "text": " And they can't coexist.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5351.721,
    "end": 5357.225,
    "text": "And then they actually persist better both because of that one act.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5357.785,
    "end": 5358.806,
    "text": "So who's to say.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5362.008,
    "end": 5372.434,
    "text": "But just one thing, like if, if that is all the case, you know, if this is all like, whatever, man, the universe becoming like, why would it be that we had such a hard time with it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5372.534,
    "end": 5377.117,
    "text": "Like, shouldn't it, shouldn't there be some mechanism that allows me to just be like, Oh, okay, cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5377.397,
    "end": 5378.998,
    "text": "You know, like, I don't get that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5381.141,
    "end": 5384.463,
    "text": " I think the mechanism is narrative, cognitively.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5385.243,
    "end": 5387.905,
    "text": "It might play out differently in different systems.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5388.505,
    "end": 5391.947,
    "text": "But agree to disagree, it's a narrative that we can both agree on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5392.267,
    "end": 5394.129,
    "text": "We're cooperating at that narrative level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5394.389,
    "end": 5396.01,
    "text": "Doesn't mean that we don't disagree.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5396.61,
    "end": 5398.711,
    "text": "In fact, we entrench that we disagree.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5399.191,
    "end": 5400.592,
    "text": "But we're agreeing at a higher level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5404.675,
    "end": 5404.995,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5405.655,
    "end": 5406.716,
    "text": "Do you want to read the next ones?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5409.011,
    "end": 5410.612,
    "text": " So yeah, just a few of the key points from 10, 11, 12.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5412.994,
    "end": 5423.363,
    "text": "10, bioelectric integration helped evolve control strategies and cognitive content across the continuum from chemical networks to human minds.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5423.383,
    "end": 5429.768,
    "text": "11, the key points here were that there's a scale invariance with how different systems make decisions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5430.754,
    "end": 5446.868,
    "text": " and that we can, across different systems, study how the cybernetic processes of learning and parameter optimization are implemented by a large number of units pursuing infotaxis and homeostatic goals, aka pragmatic value and epistemic value.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5446.888,
    "end": 5455.155,
    "text": "And twelve, a conceptual unification is proposed in this paper as scale-free cognition, and",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5456.289,
    "end": 5476.54,
    "text": " then it's talked about how these boundaries between different subunits are a major control mob between itself and the world like the cell is doing the same stuff whether it's part of an organism or part of a cancer but it's actually this control knob like what are the limits of the cognitive individual that sets the cell up to act a certain way or another",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5477.751,
    "end": 5500.062,
    "text": " and uh then a reminder at the very end from a utilitarian perspective that the most appropriate level of analysis is to be determined empirically aha but was empiricism determined empirically and that is said to be the level that facilitates prediction control with the least effort by the experimenter or by the system itself what if they disagree",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5500.945,
    "end": 5507.207,
    "text": " and gives rise to a unified understanding that drives the most novel, robust research programs at the bench.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5507.567,
    "end": 5508.447,
    "text": "Nice.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5509.047,
    "end": 5513.308,
    "text": "If it doesn't advance your career as a scientist, then it's not the case.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5518.21,
    "end": 5519.07,
    "text": "This was you, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5519.17,
    "end": 5521.391,
    "text": "Active inference and multiscale communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5522.451,
    "end": 5525.772,
    "text": "Just wanted to capture a little bit about multiscale systems and Actim.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5526.42,
    "end": 5528.301,
    "text": " So here we have nested systems.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5528.341,
    "end": 5530.101,
    "text": "So top left, that's an ant brain.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5530.341,
    "end": 5534.282,
    "text": "That's a picture that Sasha took of an ant brain that came from a Pogo ant.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5534.923,
    "end": 5538.844,
    "text": "And then there's the colony with a bunch of nest mates driving food around.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5538.984,
    "end": 5541.505,
    "text": "And then the colony is embedded within an ecosystem.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5542.085,
    "end": 5551.368,
    "text": "So within one nested system, within these time diamonds that are sort of nested inside of each other, we can think about how the internal state of one",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5552.518,
    "end": 5555.02,
    "text": " is linked to the external state being the next level up.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5555.421,
    "end": 5559.585,
    "text": "Like the internal state is the brain and the external niche to the brain is the body.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5560.145,
    "end": 5563.108,
    "text": "Okay, now the body and the brain are the internal state for what?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5563.128,
    "end": 5564.049,
    "text": "The colony.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5564.489,
    "end": 5568.553,
    "text": "And then the colony is like the internal state for the ecological niche.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5569.133,
    "end": 5575.098,
    "text": "So that's something that we've seen before with how active inference helps us understand and model and simulate",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5575.879,
    "end": 5604.893,
    "text": " hierarchically nested systems but also we can think about interactions at the same scale like collective behavior collective intelligence as occurring when at the same type of agents they're interacting like laterally and so that's this teal arrow that's where you have two agents there are they're each other's external state so active inference helps us zoom up and out and down and in and then it also helps us go laterally and then",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5605.609,
    "end": 5609.393,
    "text": " Not to repeat it too many times, but the lateral transmission isn't instantaneous.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5610.174,
    "end": 5617.781,
    "text": "It's dynamic, it happens through time, which means that we don't need to look at all lateral interactions, just the time cone.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5621.124,
    "end": 5621.364,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5623.246,
    "end": 5625.169,
    "text": "Predictions and research program.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5625.729,
    "end": 5629.153,
    "text": "There was a big list here, so I just pulled a few of them out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5629.313,
    "end": 5633.438,
    "text": "I'll read some of these off, which are a lot of them questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5633.878,
    "end": 5638.543,
    "text": "So is there a quantifiable sense in which biological systems model themselves?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5639.707,
    "end": 5654.931,
    "text": " Can an in silico evolutionary system be built containing both genetic and physiological components which simulates the scheme described above, homeostasis and infotaxis, and illustrates the emergence of different scales of cognitive horizons over time?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5655.551,
    "end": 5662.473,
    "text": "Can we directly observe the evolution of multicellular goals from networking of agents with single-cell homeostatic goals?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5663.713,
    "end": 5677.149,
    "text": " Might there be higher level effects on the physiological boundaries of the cognitive subagents within the body from exposure to psychedelics, which have long been claimed to expand transpersonal boundaries or induce ego death?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5678.444,
    "end": 5687.631,
    "text": " The analogies between geometric spaces and cognitive ones need to be explored further, as is beginning to be done via geometric information theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5687.651,
    "end": 5689.652,
    "text": "Time diamond, anyone?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5690.673,
    "end": 5691.113,
    "text": "Definitely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5691.133,
    "end": 5693.395,
    "text": "I think that there's a lot of room to go here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5694.736,
    "end": 5698.2,
    "text": " Will complex engineered systems set novel goals?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5698.5,
    "end": 5699.341,
    "text": "And if so, how?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5699.902,
    "end": 5708.37,
    "text": "It is a prediction of this view that adaptive useful robotics will require components that are themselves competent and goal seeking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5709.111,
    "end": 5733.406,
    "text": " that is super interesting also um because really as an intelligent you know being capable of cognition so are all of my parts so if we're going to really import you know give rise to intelligent life intelligent artificial life we have to start with intelligent artificial components i think that's super cool and also goals we can't we can't just say well let's just build you know",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5734.651,
    "end": 5736.632,
    "text": " a bigger car or a bigger computer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5736.652,
    "end": 5744.577,
    "text": "I mean, what do we want this intelligence design system to be intelligence in the service of or in the way of?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5745.318,
    "end": 5749.9,
    "text": "And it's a disaster waiting to build capacity without goal.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5751.781,
    "end": 5752.122,
    "text": "For sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5752.142,
    "end": 5753.903,
    "text": "Do you want to read some more of these?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5755.083,
    "end": 5757.105,
    "text": " Yep, so the second set of predictions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5757.965,
    "end": 5761.708,
    "text": "So this is where Mike is setting out a little bit of his agenda.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5762.368,
    "end": 5768.093,
    "text": "The next work in this subfield, just, you know, the subfield, each of the fields, they're modular.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5768.313,
    "end": 5772.156,
    "text": "They have their own disciplinary histories, their own disciplinary anticipation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5772.936,
    "end": 5778.961,
    "text": "But this subfield should focus on the discovery of bioelectric communication-inducing technology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5779.682,
    "end": 5785.871,
    "text": " So just like once we had chemical biology, people were really excited about finding drugs that bound to proteins.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5786.432,
    "end": 5792.561,
    "text": "Well, now that we're aware of bioelectricity, let's think about manipulations and measurements of bioelectricity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5793.806,
    "end": 5805.878,
    "text": " Two, it's a prediction that it's possible to induce the formation of metazoan-like bodies in an otherwise unicellular organism by forcing the expression of appropriate electrogenic proteins in gap junctions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5806.458,
    "end": 5809.902,
    "text": "So he's trying to get towards some unique predictions and experiments.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5811.797,
    "end": 5831.712,
    "text": " prediction that transcriptomic, which means gene expression, analyses of regeneration events from bacterial biofilms, plants, and metazoan models of limb regeneration should show consistent use of electrogenic proteins in the events that enable cooperation towards self-limiting morphogenetic cascades.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5832.413,
    "end": 5837.477,
    "text": "So it's kind of like the structure, informational or cognitive structure of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5838.235,
    "end": 5846.626,
    "text": " of recovery and repair might have some similarities across systems that wouldn't immediately be seen as similar otherwise.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5848.146,
    "end": 5855.992,
    "text": " Scale-free cognition hypothesis suggests that multi-human systems, cough, cough, remote teams, could have their own degree of cognition.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5856.573,
    "end": 5869.863,
    "text": "So as we always say, things that the brain knows that the neuron doesn't, things that the colony knows that the ant's nest mate doesn't, there's got to be things that remote teams or any other kind of team know that individual participants don't know.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5870.884,
    "end": 5876.389,
    "text": "And then the exobiology question is, given a novel life form or just a novel form,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5877.17,
    "end": 5880.535,
    "text": " How does one know when successful communication has taken place?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5881.317,
    "end": 5886.525,
    "text": "And that's an interesting question for a lot of you, xeno slash exobiologists.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5886.865,
    "end": 5887.767,
    "text": "SETI, anyone?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5893.001,
    "end": 5894.583,
    "text": " Cool, next slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5894.763,
    "end": 5907.018,
    "text": "So this is in the section, what it feels like to be a pancreas, but I really pulled the point that kind of hit home for me the most out of the section and the final point that Mike makes in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5907.539,
    "end": 5908.62,
    "text": "So I'll just read this off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5909.321,
    "end": 5923.791,
    "text": " It is striking that the process which Zen practice is meant to reverse, attachment to past memories and high valence for future expectations or fears, is precisely the process suggested to be responsible for the creation of complex selves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5924.192,
    "end": 5933.496,
    "text": " with a capital S. It is unclear whether it is beneficial or even possible to truly live in the moment and let go of past memories and future expectations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5933.876,
    "end": 5940.019,
    "text": "But anyone who succeeded in doing this would achieve precisely what Zen promises, the dissolution of the self.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5941.039,
    "end": 5956.609,
    "text": " And the final sentence of the paper, which I just loved, recreating the unification into and liberation from larger scale unifying unifying selves with a capital S would be a true pinnacle of synthetic biology and artificial intelligence engineering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5957.51,
    "end": 5957.71,
    "text": "Wow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5957.73,
    "end": 5959.231,
    "text": "It was a good paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5962.167,
    "end": 5963.609,
    "text": " So just key questions at the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5963.769,
    "end": 5965.87,
    "text": "What might a good understanding of this work enable?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5966.171,
    "end": 5968.813,
    "text": "What are the unique predictions and implications of this work?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5969.333,
    "end": 5973.576,
    "text": "What are the next steps for FEP and active inference in relation to this work?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5973.776,
    "end": 5977.579,
    "text": "What are the goals of this research, and what are you still curious about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5978.08,
    "end": 5983.124,
    "text": "So we will be thinking of all of these things as we get ready to do 25.1 and 25.2 over the next couple weeks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5986.306,
    "end": 5987.907,
    "text": " So thank you for participating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5987.927,
    "end": 5995.349,
    "text": "There is a feedback form for feedback, and you can get in touch with Active Inference Lab at all of these links on this slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5996.95,
    "end": 5997.73,
    "text": "Nice work, Blue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5998.131,
    "end": 6002.632,
    "text": "Great job with your first broadcasting and facilitating on this one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6002.652,
    "end": 6003.733,
    "text": "It was really fun.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6004.153,
    "end": 6009.395,
    "text": "So yeah, anyone's welcome to participate or contribute to our lab activities.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6011.007,
    "end": 6014.155,
    "text": " asynchronously, synchronously, we'll figure out the right performance for you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6014.176,
    "end": 6016.522,
    "text": "So thanks, Sarah, also for joining.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6017.003,
    "end": 6017.705,
    "text": "Thanks again, Blue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6018.106,
    "end": 6018.226,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  }
]