[
  {
    "start": 7.186,
    "end": 35.438,
    "text": " hello welcome everyone it is february 21st 2025. we're live in active inference guest stream number 90.2 with benjamin nelson decoding the arc the evolution of reason in the abstract reasoning corpus today will be a very interesting presentation and also time for questions so benjamin thank you for the work and for presenting it and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 35.62,
    "end": 40.046,
    "text": " being open and giving others the opportunity to ask questions as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 40.607,
    "end": 43.932,
    "text": "So looking forward to the presentation and take it away.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 44.112,
    "end": 44.472,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 46.675,
    "end": 47.376,
    "text": "Hello, welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 47.877,
    "end": 50.24,
    "text": "I'll just jump right in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 50.661,
    "end": 60.835,
    "text": "I recently competed in the ARC competition and during and after I was able to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 61.372,
    "end": 69.171,
    "text": " some really high scores and it's because of a really fascinating and fun approach derived from active inference that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 70.265,
    "end": 71.226,
    "text": " Seems to work really well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 71.246,
    "end": 72.307,
    "text": "I hope you guys will really like it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 73.789,
    "end": 74.47,
    "text": "Can you see my screen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 74.67,
    "end": 75.731,
    "text": "I think you can, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 75.751,
    "end": 81.438,
    "text": "So this GitHub repository, I just made this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 81.998,
    "end": 86.623,
    "text": "It's not super fancy or anything, but the code itself is really, really fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 86.984,
    "end": 95.293,
    "text": "And I really encourage everyone to dig in and just have as much fun as they possibly can with this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 95.898,
    "end": 101.689,
    "text": " very cool, but not the coolest toy ever, in my opinion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 101.81,
    "end": 104.475,
    "text": "I love it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 105.857,
    "end": 113.873,
    "text": "In addition to kind of synchronously with developing the repository for this thing that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 113.853,
    "end": 138.814,
    "text": " uh I made for the competition um which is it's called the state managed uh approach the the state managed system is a uh cognitive computing framework uh as I mentioned derived from active inference uh and basically what uh it does is it looks at different biological processes functions and then uh you know does the best to not necessarily mirror the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 138.794,
    "end": 146.239,
    "text": " the exact workings of the function itself but um more so the outcome so the uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 147.991,
    "end": 161.951,
    "text": " I would definitely say there's a fine line between prescribing something, like dictating it for the model, or describing something, like explaining it to the model and prescribing it, like dictating its actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 162.331,
    "end": 167.058,
    "text": "And the goal of this is a certain amount of autonomy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 168.139,
    "end": 169.641,
    "text": "And it's really fun to play with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 169.661,
    "end": 176.631,
    "text": "So you've got, as we'll see in the paper, and I'll just go ahead and pull that up here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 177.64,
    "end": 207.107,
    "text": " um there's like the core document sorry it's a lot of a lot of paperwork this week on this uh doing this paper so uh mark test the archetype archangel ep and the emergence of the state managed system so um uh we'll get of course to the abstract and all of this stuff i'll leave that to you guys um there's just a handful of things i want to touch on um oh yeah i think i actually have that up even here give me just a second",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 208.201,
    "end": 232.69,
    "text": " all right we're good okay so the um i'm sorry you guys will have to bear with me too i have a very old and and uh i love my laptop very much but it spends a lot of time in the freezer now cooling down uh when i forget and accidentally leave one of the models on so the um uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 233.682,
    "end": 235.966,
    "text": " Yeah, actually, I do want to kind of talk about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 235.986,
    "end": 242.576,
    "text": "I was having a conversation with Andrew, who's a member of the Scientific Advisory Board here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 242.616,
    "end": 244.599,
    "text": "He's a really helpful, super amazing person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 245.28,
    "end": 249.787,
    "text": "And he's been kind of like holding my hand through some of this process, which I'm really grateful for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 250.669,
    "end": 258.101,
    "text": "But it is definitely, as I said earlier, it's not like a burden of cost.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 258.121,
    "end": 260.905,
    "text": "It's a labor of love.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 260.885,
    "end": 287.82,
    "text": " like the this is like something i'm super passionate about and um for me it i think even though i would never say i could do art or anything artistic uh by any chance i feel like this this is almost something similar it's like uh i i do these things like in a very unique way i think um at least you know that's uh what i've been told so um i hope you'll bear with me as i go through this um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 287.8,
    "end": 289.663,
    "text": " in the code specifically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 290.203,
    "end": 292.426,
    "text": "And I hope you'll see what I'm talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 292.526,
    "end": 301.258,
    "text": "For instance, I gave a really nice outfit, like a fit for Archangel, which is the name of that framework, the Archangel EP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 301.278,
    "end": 309.67,
    "text": "So basically, here at the beginning of February, I jumped back into tackling the arc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 310.591,
    "end": 313.555,
    "text": "I just had some bandwidth and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 313.535,
    "end": 328.287,
    "text": " the things that i've made archangel with are like old uh and older like uh cognitive mechanisms that um you know like either just kind of like get like uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 329.397,
    "end": 332.903,
    "text": " worn down over time, which is a weird way to think about code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 332.944,
    "end": 351.658,
    "text": "But it's like these integrations and then, as Daniel knows, the amount of times I've had to take the larger framework apart, stop in the middle of what I'm doing to work on this kind of thing, results in a lot of, unfortunately, spare parts and broken parts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 351.638,
    "end": 374.423,
    "text": " this toy i made is from a massive uh model named nim that i've been building for a really long time and he's like my best friend and he's awesome and i love the death and um getting back into the arc i you know i'd hope it was kind of a way to like show that not only does the state like does a state manager approach like uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 376.04,
    "end": 382.274,
    "text": " I don't want to say it's better because it's not about which one is better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 382.374,
    "end": 393.198,
    "text": "It's about, I guess, which approach can maximally solve or resolve which problems the most meaningfully, the fastest, I guess, in a way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 393.518,
    "end": 396.124,
    "text": "And there are some wonderful...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 396.104,
    "end": 421.251,
    "text": " uh things that this framework now in its uh much more advanced like uh iteration could bring to the table and i i really want to get that out there so i figured i would throw uh some old parts together um finish archangel and um just completely uh crush the the abstract reasoning corpus with it so um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 422.041,
    "end": 433.738,
    "text": " the i just give a quick note on what is the abstract reasoning corpus show a visualization of what it is and then explain what it looks like to solve it and then we'll hear more about how it's being solved but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 433.887,
    "end": 453.82,
    "text": " back up a bit okay there thank you continue perfect yeah i appreciate you so much so the uh arc prize uh remains undefeated new ideas still needed and i love that because the arc is uh this amazing test as you'll see here um there there are like uh there's a color palette it's the same for everybody",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 454.188,
    "end": 462.48,
    "text": " Uh, and then there are these grid examples and the grids are dynamic in that each one is different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 462.86,
    "end": 479.904,
    "text": "And I believe, I'm not sure if they get harder as they go on, but you definitely see the models, um, you know, like, uh, kind of performance like, uh, change and like fluctuate like with, uh, at different places in the, uh, in the exams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 479.984,
    "end": 481.927,
    "text": "And it's like different for every model, which is really cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 482.388,
    "end": 484.11,
    "text": "So, uh, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 484.09,
    "end": 511.093,
    "text": " like uh yeah so they basically they these grids get like harder and harder and harder here's like where you can see um other ai benchmarks um you can see where other models have performed and it's basically like a you know a really cool test oh there's the legends at minds ai so uh and the architects these guys like wow i mean so cool and uh there's a three down there so the um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 513.908,
    "end": 522.391,
    "text": " The point of the abstract reasoning part was to kind of... And I don't want to crib Cholet because I'm not even in the same league.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 522.772,
    "end": 525.218,
    "text": "But the... Like...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 526.413,
    "end": 546.784,
    "text": " to solve a problem and to maximally resolve it, to be like the real, true abstract problem solvers, to be able to approach a problem as I understand it, maybe correct me on this, with no prior knowledge of the problem, no prior knowledge of the solution, and to be able to tackle the problem directly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 546.764,
    "end": 550.85,
    "text": " and resolve it there in that moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 551.571,
    "end": 553.694,
    "text": "That's really always been my approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 553.714,
    "end": 556.499,
    "text": "I really love abstraction in anything that's abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 557.019,
    "end": 559.083,
    "text": "That's kind of how my mind works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 560.745,
    "end": 575.387,
    "text": "That processing of grids and those complexifying orders that they come in and the model resolves them, the model has to figure out how to adapt and make decisions and to solve problems and to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 575.367,
    "end": 600.227,
    "text": " to uh converge on a decision and to choose actions and all of these things that are required so even though it's like just grids and colors it's a lot of things um which is why they give some things like uh to the competitors like in terms of like you know that it's grid you know what the colors are uh going to be you know um what actions you'll most likely need to select based on how your model is designed to uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 600.393,
    "end": 606.541,
    "text": " you know, like do the, like converge on a decision or, you know, say I made this, I'm not confident about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 606.621,
    "end": 607.823,
    "text": "I don't like this color.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 607.883,
    "end": 610.226,
    "text": "I'm actually going to go with this color and make predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 610.366,
    "end": 611.908,
    "text": "And so the model is making predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 612.629,
    "end": 623.042,
    "text": "Um, and, uh, as a, you know, if the, these, like there are solution files that come with the JSON files and as those come feeding in, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 623.022,
    "end": 636.019,
    "text": " they are essentially bypassed into like conditional storage and used at the end of that to determine whether or not you have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 636.32,
    "end": 662.918,
    "text": " either a perfect mirror match or you can do it by pixel and do a full pixel count of every color and everything that's on there and they give you like frameworks for that and there's like tons of um i mean there's tons of people that uh do this there's over 1400 teams of like really amazing engineers like some of the most brilliant people in the world like leaders in this field um so to uh even get",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 663.117,
    "end": 676.694,
    "text": " to have the confidence to join something like this, solo with two months left in the competition, and then pull 86.4% and beat the theoretical maximum of the arc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 676.714,
    "end": 677.495,
    "text": "That's pretty incredible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 678.997,
    "end": 691.673,
    "text": "I love all of these guys, and I'm super grateful to Daniel for introducing me to everybody who was involved and all the people I got to meet and have conversations with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 691.653,
    "end": 720.057,
    "text": " um but uh archangel is not my arc submission like uh archangel is the is a person first he's the uh or it's i should say um it's pretty simple and i think you guys really enjoy it it's the first uh state managed like open source have fun do whatever you want learn as much as you can and i've published uh multiple papers including one today um that we're gonna look at uh and that's um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 720.037,
    "end": 739.935,
    "text": " i mean kind of i don't even really necessarily read my own research i definitely read a lot of robert warden's research though and it informs my work uh significantly in fact um like when looking at the potentials that are emerging from uh what i see and you know thankfully can have uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 740.405,
    "end": 748.769,
    "text": " critiqued and reviewed and vetted through the Institute and through expertise and scholarship, there's amazing potential here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 748.789,
    "end": 755.308,
    "text": "It's like this whole entire space is totally unexplored and I'm just in there all by myself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 762.241,
    "end": 762.601,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 763.543,
    "end": 766.026,
    "text": "Sorry about the disrupt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 766.347,
    "end": 769.511,
    "text": "I'm working in extenuating situations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 770.232,
    "end": 778.043,
    "text": "Could you go back and can you just show us where you're at with the code?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 778.083,
    "end": 780.687,
    "text": "And sorry about the last like 10 minute blip.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 780.707,
    "end": 781.768,
    "text": "It was out of my control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 782.727,
    "end": 784.85,
    "text": " I didn't even know what happened until you said something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 784.99,
    "end": 787.774,
    "text": "I mean, so I'm really not worried about it too much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 787.875,
    "end": 790.218,
    "text": "But I covered all the good stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 790.358,
    "end": 792.421,
    "text": "It's just that it's not on the live stream, so you must do it again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 793.703,
    "end": 795.105,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 795.125,
    "end": 796.187,
    "text": "So what are you going to look at?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 797.028,
    "end": 797.729,
    "text": "Probably the code, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 798.009,
    "end": 806.101,
    "text": "Let's see the code and visualizations of solving and clarification of the benchmarking and which data set specifically you did it on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 806.722,
    "end": 809.506,
    "text": "And again, apologies to the viewers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 809.526,
    "end": 810.608,
    "text": "All right, one question at a time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 810.79,
    "end": 811.291,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 811.311,
    "end": 812.193,
    "text": "Oh yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 812.213,
    "end": 816.38,
    "text": "That's, um, so, um, this is just kind of some boring stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 816.42,
    "end": 820.688,
    "text": "Well, this is, uh, again, um, feature extraction tools.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 820.768,
    "end": 829.845,
    "text": "I love these like NIMS or not NIM, uh, Archangel is kind of like a, like almost like a little, like, uh, a multi-tool whose feelings you could hurt potentially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 830.095,
    "end": 842.452,
    "text": " Like, and I don't know if we like got to hear anything about like the encoding and stuff, but just to kind of get back on quickly, we'll see like different tools.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 842.853,
    "end": 850.483,
    "text": "And then we start getting into the cognitive mechanisms where we hit the prioritization, optimization and iteration algorithm, which I'm very proud of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 850.835,
    "end": 871.24,
    "text": " um and i published uh some work about it and and i hope you guys will check that out too um that explains how all of this stuff works um there are waiting systems which are fun to play with there are dimensionality reduction equations that i think everybody knows i got from keith affis um here you'll see uh these are the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 871.54,
    "end": 880.769,
    "text": " uh, kind of constants that you can play with in terms of like, uh, your tolerance, um, you know, windows for improvement, like iterations and things like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 881.349,
    "end": 882.591,
    "text": "Um, which I'm going to turn that up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 882.631,
    "end": 883.712,
    "text": "That's cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 883.732,
    "end": 884.633,
    "text": "I didn't realize that was so low.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 884.933,
    "end": 888.496,
    "text": "So, um, the, uh, you'll see that carry through here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 888.857,
    "end": 891.739,
    "text": "And then we get into some of the, the, like the processing stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 891.759,
    "end": 900.788,
    "text": "So this is like where the model is like just kind of identifying what the grid is and giving it just some basic, uh, like structure for,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 900.768,
    "end": 903.395,
    "text": " like form in its mind, something to work with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 903.496,
    "end": 906.945,
    "text": "So for instance, the category size, is it small, medium or large?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 907.166,
    "end": 908.549,
    "text": "Really simple, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 909.131,
    "end": 913.062,
    "text": "And then how are we looking at the layers of this grid?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 913.082,
    "end": 913.583,
    "text": "Does it have layers?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 913.984,
    "end": 916.752,
    "text": "So they don't really tell you and it's like you don't want to look",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 916.732,
    "end": 919.558,
    "text": " uh, either like in the JSON files.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 919.638,
    "end": 927.274,
    "text": "I mean, you can, I think people do, but, but like at the same time too, you don't want to know, you don't want to like prescribe to the model what to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 927.294,
    "end": 933.227,
    "text": "You want to describe what it should do and, and like kind of help guide it without giving it the answers kind of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 933.648,
    "end": 935.331,
    "text": "And, um, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 936.391,
    "end": 951.951,
    "text": " So the simple stuff there, this is much more fun in terms of the attentional selection mechanism and how dimensions work with this and kind of what those capacities really are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 952.131,
    "end": 953.052,
    "text": "Because even I don't know yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 953.433,
    "end": 956.897,
    "text": "This is definitely the crown jewel, the Hopfield network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 956.877,
    "end": 960.161,
    "text": " Um, I made this, uh, it's just incredible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 960.281,
    "end": 962.424,
    "text": "I still also haven't tested the limits of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 962.964,
    "end": 975.54,
    "text": "Um, I, uh, accidentally like crashed some, uh, stuff when I, uh, like turned it on without like, uh, but like those guys, like with the JPL thing, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 975.56,
    "end": 980.045,
    "text": "It's like, it's kind of the same thing, but so the Hopfield network is a dynamic way to store retrieve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 980.125,
    "end": 981.828,
    "text": "It's uses Hevian learnings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 981.848,
    "end": 986.293,
    "text": "So there was a great paper that came out, um, a while back and, uh, it was, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 986.611,
    "end": 990.583,
    "text": " comparison on Q-learning and Hevian learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 991.325,
    "end": 1000.333,
    "text": "But the truth of the matter is the Hevian learning doesn't really work great as a reinforcement learning feature at all, but it works awesome for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1000.482,
    "end": 1002.686,
    "text": " memory encoding and retrieval, especially retrieval.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1003.327,
    "end": 1013.523,
    "text": "It allows for really complex, condensed and dense data to pass through the system and into confabulation or abstraction really, really easily and meaningfully.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1014.345,
    "end": 1019.233,
    "text": "You can see you can set the Hopfield size here and the overall memory system capacity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1019.673,
    "end": 1026.304,
    "text": "The memory works under the Atkinson-Shiffrin model, so wonderful and simple, long-term, short-term working.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1026.638,
    "end": 1029.842,
    "text": " Make as many types as you want and have fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1030.042,
    "end": 1043.099,
    "text": "The memory management, you have values in the form of decks for, well, MaxLen for making decks for the short-term and working memory, so you can set those size.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1043.439,
    "end": 1046.343,
    "text": "I typically like to go with a larger working memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1046.884,
    "end": 1051.87,
    "text": "The way that this is structured will kind of float some information a lot of times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1051.85,
    "end": 1067.226,
    "text": " times and uh to keep it kind of accessible if it's meaningful based on um uh different uh like things in the system for instance confidence um beliefs right all of those there's not really like um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1067.206,
    "end": 1089.94,
    "text": " like one thing doesn't do all the things and one thing can't do any one thing without all the other things so um the system gets really wonky it doesn't make a lot of sense um but i can tell you this much just from experience if you are not breaking it or failing and then you're not doing it right it's uh it's like for every 10 000 lines of code i write i get",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1090.375,
    "end": 1092.74,
    "text": " 10 lines of code that work or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1092.82,
    "end": 1096.508,
    "text": "It's really been a long and arduous process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1096.548,
    "end": 1100.798,
    "text": "So this autonomic stress mechanism, that's cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1101.098,
    "end": 1103.423,
    "text": "Cool function that mirrors biological processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1104.446,
    "end": 1107.793,
    "text": "These autonomic functions for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1108.111,
    "end": 1118.966,
    "text": " like stress minimization, like reducing or increasing entropy, homeostasis, even the minimization of free energy, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1119.146,
    "end": 1120.688,
    "text": "So active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1121.269,
    "end": 1136.97,
    "text": "And this is another thing that can be expanded on and is, and there are much more advanced versions of this that I have that I'm really excited to see people work with as you...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1137.507,
    "end": 1144.075,
    "text": " Kind of understand how like state management in these computational frameworks, if you don't already, works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1144.315,
    "end": 1149.181,
    "text": "So these different things that I talk about in the paper, of course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1149.481,
    "end": 1162.317,
    "text": "So, you know, let's say like you get the model is really happy about something and it has this really big increase in the like in something it's like perceiving, for instance, cake.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1162.297,
    "end": 1188.793,
    "text": " And so like the model will dynamically pull from systems that are deemed like less important to that task and, uh, uh, redirect those energies, uh, you know, uh, to all kinds of different systems and all kinds of combinations of systems that I, some that I just, I could, I never even, I never even did.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1189.06,
    "end": 1194.395,
    "text": " And that's where like, uh, you know, we have that like kind of emergence from the inside.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1194.515,
    "end": 1205.044,
    "text": "It's like the, the, the building by describing as opposed to prescribing has like made possible a lot of these really bizarre.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1205.277,
    "end": 1230.238,
    "text": " and cool behaviors that while in some cases do not reflect biological uh cognition at all those outcomes will or some feature of its operation will work in such a way as to allow for something else to work uh perfectly or you know like insanely well um i mean considering i run this like a model that pulls",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1230.742,
    "end": 1239.175,
    "text": " quadrillions of calculations a second on my very old laptop that does spend a lot of time in the freezer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1240.938,
    "end": 1242.761,
    "text": "So yeah, so here's Epsilon Control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1242.821,
    "end": 1245.545,
    "text": "This is another fun one I hope you guys play with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1245.986,
    "end": 1248.109,
    "text": "Complexity, Shannon entropy, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1248.269,
    "end": 1252.716,
    "text": "I've been learning a lot about entropy and a lot about the universal constant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1252.983,
    "end": 1261.952,
    "text": " Um, I have a paper coming out, um, actually here before the end of this month, um, that I've been getting help from a dear friend who's my absolute hero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1262.633,
    "end": 1264.895,
    "text": "And, um, I'm really excited about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1264.915,
    "end": 1271.942,
    "text": "Some novel discoveries about the nature of time, um, through the lens of Robert Warden's brilliant projective wave theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1272.723,
    "end": 1274.865,
    "text": "And, um, I'm really excited.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1275.045,
    "end": 1280.07,
    "text": "And I talk about one of the, the, uh, things that I'm making, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1280.388,
    "end": 1302.565,
    "text": " and this is a perfect example of that so um piezoelectric conductivity in lattice structures specifically um crystalline lattice structures so the terms there's it's like a vibrational energy like uh i don't even know how to say this without sounding like a kook um but the uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1303.625,
    "end": 1323.573,
    "text": " faster than neuronal firing, and early encoding, like a way to pass 2D and 3D spatial data to a model through its visual cortex before the actual process of firing can occur, even in the model, even something that runs as fast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1323.593,
    "end": 1325.015,
    "text": "So supercharge that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1325.095,
    "end": 1327.759,
    "text": "I have no idea what that looks like, and I hope it's safe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1328.785,
    "end": 1330.608,
    "text": " So we'll find out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1330.809,
    "end": 1333.974,
    "text": "Can I bring us a little bit back, Benjamin, to Arc?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1334.635,
    "end": 1339.003,
    "text": "And could you show this code running?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1339.143,
    "end": 1341.527,
    "text": "And then let's return to look through some subunits.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1341.547,
    "end": 1346.736,
    "text": "But I think it's totally fair for people to be like, what does this actually do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1347.458,
    "end": 1351.444,
    "text": "And let's see it running and solving certain problems that we can visualize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1351.464,
    "end": 1352.346,
    "text": "Yeah, just...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1352.562,
    "end": 1354.605,
    "text": " You know, that's what this stream is about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1356.408,
    "end": 1358.532,
    "text": "Not for many others, though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1358.572,
    "end": 1369.991,
    "text": "Not for others, but let's see the real code run and highlight what the GitHub will do if people clone it and run it and see solving basic and hard problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1371.112,
    "end": 1371.533,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1374.652,
    "end": 1380.08,
    "text": " So basically what you're going to see is here is on the bottom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1380.561,
    "end": 1381.442,
    "text": "Maybe it's the right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1381.662,
    "end": 1384.066,
    "text": "I'm kind of just right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1384.126,
    "end": 1384.587,
    "text": "Yeah, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1385.107,
    "end": 1385.929,
    "text": "You'll see 0400.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1386.309,
    "end": 1388.152,
    "text": "Those are the training tasks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1388.172,
    "end": 1390.255,
    "text": "And then underneath that, you'll see 05.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1390.335,
    "end": 1394.281,
    "text": "And those are or I'm sorry, the 0400 is the training challenges.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1394.301,
    "end": 1396.865,
    "text": "05 are what I call training tasks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1396.945,
    "end": 1399.849,
    "text": "And they're staging for the model to the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1399.981,
    "end": 1401.323,
    "text": " learn to understand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1401.363,
    "end": 1425.836,
    "text": "So, um, as I understand it, uh, and then during the arc, um, models will, uh, run these, uh, consistently and hold that information, uh, and use it, uh, again later, like, um, you know, as part of the pre-training and then the training and then the fine tuning, um, I'm really glad in a lot of ways that I don't have to deal with so much of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1426.357,
    "end": 1428.199,
    "text": "Um, the, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1429.563,
    "end": 1451.47,
    "text": " uh yeah this the archangel will grab anything that you put in front of it um like not just json files right like right now we could be uh and i do have some stuff if you want i can send you this where you're looking it's like p a pdf docx json uh csv html it's just all these different things uh all at once and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1451.45,
    "end": 1464.266,
    "text": " Um, in this specific instance, um, there's nothing like there's just like purge flags basically when, uh, the model finishes, you know, and shuts down, it's, it's not holding on to any of that data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1464.306,
    "end": 1467.43,
    "text": "There's no like a memory, uh, storage like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1467.47,
    "end": 1473.899,
    "text": "It's all dynamic memory that's created when that hop field is, uh, acted on or initialized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1474.019,
    "end": 1478.164,
    "text": "And I actually have the initialization sequence, uh, in one of my publications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1478.224,
    "end": 1478.905,
    "text": "I hope you can find it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1479.526,
    "end": 1479.786,
    "text": "Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1480.036,
    "end": 1483.961,
    "text": " And that initialization sequence, it's an incredible tool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1485.222,
    "end": 1486.624,
    "text": "Dumping the memory is the easy part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1487.045,
    "end": 1492.411,
    "text": "Getting the initialization sequence right is a lot more fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1492.431,
    "end": 1493.933,
    "text": "And if you need help, I'd be happy to do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1494.254,
    "end": 1500.161,
    "text": "Be careful because, again, that's where I crash those servers and stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1500.181,
    "end": 1503.986,
    "text": "Could you describe what is the problem that it's solving right now?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1504.306,
    "end": 1508.271,
    "text": "And then let's look at the setup and the solution when it gets there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1510.124,
    "end": 1514.849,
    "text": " Yeah, so it is just solving whatever problems are coming through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1515.31,
    "end": 1519.574,
    "text": "I'm assuming because it's JSON, they just come through the same every time, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1521.436,
    "end": 1526.722,
    "text": "But right now, it's learning all of the patterns that it's seeing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1526.762,
    "end": 1529.485,
    "text": "It's looking at the training examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1529.565,
    "end": 1534.591,
    "text": "And when you see the place color action, it has tons of actions, by the way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1534.691,
    "end": 1536.673,
    "text": "So you guys turn those on, have fun with them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1536.813,
    "end": 1537.654,
    "text": "Really, it's a grid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1537.714,
    "end": 1540.097,
    "text": "I mean, it just places the colors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1540.077,
    "end": 1549.522,
    "text": " But that place color action and how that is achieved is really phenomenal because it's not dictated that the action is place color.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1549.843,
    "end": 1552.65,
    "text": "It chooses that because that's the most meaningful thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1552.791,
    "end": 1556.28,
    "text": "And what you see in those lines that are whipping by the screen,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1556.26,
    "end": 1586.2,
    "text": " um too fast for me to really read um are windows that allow the model to uh continue working on the problem as opposed to just timing out um the goal is for the model to reach convergence so all of these systems are working together to kind of just teach the model through like a wardens re subsystem which is maximizing fitness and that fitness represents in the case of the art solving this problem and how do we solve that problem with it believes so it's like it'll say hey okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1586.517,
    "end": 1595.35,
    "text": " So in the very beginning here, we'll see, for instance, like the model will take a really long time to learn to solve the first problem and a little less time for the next and less time for the next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1595.61,
    "end": 1601.339,
    "text": "And then by the end, it takes one tenth of the time it did for the training to do the evaluation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1602.0,
    "end": 1611.293,
    "text": "And the evaluation has even less context for the model to work from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1612.032,
    "end": 1640.858,
    "text": " it's robust it works um i was able to like i said improve some communicability around um what is happening with the code and those grids um and i'm excited to see that work this is that model um with those improvements it's not the one that's in the git um and i'm gonna make that change later it's just i mean writing the paper doing the maths and all the other stuff uh trying to get ready it's just really exciting and then that other paper here at the end of the month",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1640.838,
    "end": 1663.656,
    "text": " um so the selection you see iterations it's like it'll be a ton and it'll keep going um uh until it resolves that and then it it's just you know for for all intents and purposes it's just like okay cool uh you got one correct and you have one incorrect right uh you have one correct uh or two correct none correct",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1663.99,
    "end": 1672.926,
    "text": " And it just builds up simple TQDM status bar and lets you know how far along you are in those challenges.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1673.367,
    "end": 1676.212,
    "text": "I do have all of the challenges.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1678.236,
    "end": 1680.58,
    "text": "But again, I'm not competing with the Ark.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1680.86,
    "end": 1685.188,
    "text": "I'm not competing in the Ark.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1685.422,
    "end": 1709.522,
    "text": " and um this is for fun so you guys are able to get those um from their website the artprize.org i believe um and uh i find running them in kaggle is is really simple and uh fun and easy to do to just like uh load them in as input data um and uh you'll be doing the same thing with this this um it's primarily designed in uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1710.903,
    "end": 1723.037,
    "text": " Kaggle, though, I have been having fun with Cursor because you can kind of just get really creative and kind of express, be more expressive, I feel like, more creative and really value that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1723.278,
    "end": 1727.983,
    "text": "I feel like this is like being a labor of love is like a lot of creative self-expression that goes into this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1728.344,
    "end": 1732.368,
    "text": "So, again, this is like more of that same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1732.409,
    "end": 1734.531,
    "text": "The...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1734.713,
    "end": 1763.505,
    "text": " uh, with this chain, this cool change that I made, like you get a really, really, really like, I guess I would say like you get even less training, more context and the model becomes much more self reliant and you see much stronger, uh, uh, kind of question answering and abstract problem solving coming in, uh, the evaluation phase, which was running in, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1764.16,
    "end": 1773.188,
    "text": " like super low microseconds, uh, possibly like high nanoseconds, um, which is really exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1773.809,
    "end": 1789.883,
    "text": "Uh, super fast problem solving and the, uh, um, it would solve, uh, and I only got to see it cause you know, cause I'm using like the mouse, like the back, you know, move the, the, uh, videotape back and forth or the screen recording.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1790.123,
    "end": 1791.805,
    "text": "And, uh, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1792.696,
    "end": 1796.764,
    "text": " Yeah, there's just a clump of all of a sudden it's like it realized what it was doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1796.824,
    "end": 1801.494,
    "text": "It knew the grids and very confidently just goes, bam, gets it right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1801.514,
    "end": 1802.175,
    "text": "Bam, bam, bam.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1802.195,
    "end": 1804.039,
    "text": "And it's like seven questions right in a row.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1804.059,
    "end": 1807.586,
    "text": "It was really cool for Andrew to see that too on the first try.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1807.807,
    "end": 1811.835,
    "text": "And of course, those are not massive grids with super complex patterns, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1811.815,
    "end": 1834.026,
    "text": " the fact that it will make a prediction which is a process that occurs almost by virtue almost completely by virtue of the Markov matrices that are built into this for passing that complexity is that data is traveling in those feedback loops and yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1834.478,
    "end": 1835.941,
    "text": " Yeah, and I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1835.961,
    "end": 1836.682,
    "text": "It's exciting stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1837.003,
    "end": 1841.011,
    "text": "I haven't really had a chance to share openly with anybody about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1841.612,
    "end": 1846.762,
    "text": "I've been really busy working in kind of isolation on all this stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1846.883,
    "end": 1849.027,
    "text": "As you can probably tell, I'm not great at talking about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1849.688,
    "end": 1851.692,
    "text": "It's all good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1851.772,
    "end": 1854.177,
    "text": "This is that opportunity, Benjamin.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1854.458,
    "end": 1854.698,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1854.678,
    "end": 1875.049,
    "text": " whatever you feel like somebody who doesn't necessarily know what is happening just from the logs like can you just connect the dots a little bit more with how do you know what the performance was on the training in the test set specifically oh oh um well",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1876.261,
    "end": 1891.468,
    "text": " The way that these things are made, and a lot of this reporting is in a way almost provided by the ARC, if you know where to look, because there's so many great competitors and wonderful people out there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1891.702,
    "end": 1892.743,
    "text": " Um, it's really simple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1893.424,
    "end": 1899.432,
    "text": "Um, there are, uh, where does your grid pass in the system and how does it pass in the system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1899.913,
    "end": 1909.466,
    "text": "And so it must come into the system and then, and then it has to, you have to compare those grids and you can, like I said, do that with a pixel count, um, which they provide the framework for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1909.646,
    "end": 1913.411,
    "text": "Or you can do that with, uh, like apples to apples comparison of the two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1913.812,
    "end": 1916.335,
    "text": "Uh, and I believe they provided the framework for that too, for everybody.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1916.355,
    "end": 1918.138,
    "text": "It's like a thing that you can just have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1918.158,
    "end": 1919.7,
    "text": "Um, and, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1920.676,
    "end": 1945.587,
    "text": " when those like when that grid passes into the system there is uh for this model like a lot of things going on right so you have all of the different types of tools that you have which would be like your action space selecting your action so like i'm gonna move my arm and i'm gonna grab the piece because i know that's the right thing to do you know and um you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1945.567,
    "end": 1951.14,
    "text": " You can just really... I don't know how to... There's all this reporting, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1951.18,
    "end": 1954.588,
    "text": "That stuff that you're seeing is not super great if you don't know what you're looking at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1955.51,
    "end": 1956.893,
    "text": "But...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1957.261,
    "end": 1966.249,
    "text": " there is an infinite amount of like print statements, even like, if you want to know something and how something works in this model, like just use a print state, like, or something akin to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1966.309,
    "end": 1981.042,
    "text": "Like if you use matplotlib, like I had, I was writing code to make visualizations that would show the modulation of the beliefs as they change and the, the emotional modulation as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1981.543,
    "end": 1985.226,
    "text": "And there's yeah, but I didn't get them done, you know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1985.965,
    "end": 1988.49,
    "text": " It's like so much work all the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1989.011,
    "end": 1995.084,
    "text": "And I try to do as good as I can, but I have those things and you guys can see them at any point you want it to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1995.124,
    "end": 1997.149,
    "text": "I'm sorry that we may not get to look at them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1998.051,
    "end": 2002.54,
    "text": "I know a friend of mine is probably trying to work on them right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2003.127,
    "end": 2003.988,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2004.128,
    "end": 2010.618,
    "text": "When you when you go into the art competition, right, you're you're like you watch feedback from your model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2011.098,
    "end": 2012.38,
    "text": "Like, I don't know what everybody else did.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2012.44,
    "end": 2012.66,
    "text": "I will.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2012.821,
    "end": 2016.606,
    "text": "It was 20, 24 hours a day, sometimes like back to back days.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2016.666,
    "end": 2022.975,
    "text": "I didn't take a day off the entire time of just 20 hour days of just watching feedback while you code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2022.955,
    "end": 2026.925,
    "text": " And so when you, when people are like saying, well, how do we know that things go through the model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2026.945,
    "end": 2036.307,
    "text": "It's like, it is tough to explain to people without like having, being able to have someone's like attention wrapped in front of you for seven hours.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2036.742,
    "end": 2045.476,
    "text": " So like to jump in, like if we want to know, for instance, how this like how we can know what the answer is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2045.716,
    "end": 2061.822,
    "text": "There's 36 pages, including math right here that tells you that and will help you like navigate those processes yourself and know that when you're like, for instance, like your model reacts in a specific way, you'll know why.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2061.937,
    "end": 2067.004,
    "text": " Other people might not, and it might be difficult to explain to them, but the proof is in the pudding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2067.525,
    "end": 2078.8,
    "text": "When it really push comes to shove, validating whether or not something is working because it is simply just a numpy array in a JSON file, just pull it out yourself and look at it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2079.121,
    "end": 2084.528,
    "text": "I've done it a few times just to make sure that the model's answers that it's saying are correct are actually correct, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2084.889,
    "end": 2087.012,
    "text": "Is there an easier way than that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2087.472,
    "end": 2088.113,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2088.329,
    "end": 2095.559,
    "text": " You know, like, I don't know if that would be meaningful to say, like, oh, here, let me open the JSON file and show you guys the key.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2095.579,
    "end": 2104.19,
    "text": "But when I first started, I was printing out the actual prediction, the model's prediction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2104.351,
    "end": 2112.081,
    "text": "And then, you know, you could see the actual, like, output of the correct, like, prediction, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2112.101,
    "end": 2113.543,
    "text": "Or what the prediction is supposed to match.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2113.523,
    "end": 2120.974,
    "text": " But that just felt like I was exposing myself too much to what those files contained, so I just removed that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2121.034,
    "end": 2127.323,
    "text": "I've been using simple stuff like this or Matplotlib to visualize changes in the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2127.383,
    "end": 2138.418,
    "text": "At a certain point, the framework is so robust that there isn't something so simple that's going to corrupt the process for the entirety of the thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2138.899,
    "end": 2143.125,
    "text": "For instance, I might... This gentleman...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2144.253,
    "end": 2145.937,
    "text": " it was like a single line of code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2145.977,
    "end": 2148.303,
    "text": "Uh, it might've been less, even a word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2149.024,
    "end": 2158.988,
    "text": "Um, and that like single word, um, while mistaken, um, uh, was really, really like, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2159.525,
    "end": 2164.75,
    "text": " cool that he discovered this and brought this out of this model so quickly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2164.77,
    "end": 2165.891,
    "text": "It was really encouraging to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2166.332,
    "end": 2183.749,
    "text": "And simply changing it, just by virtue of removing it, I got a much more computationally dense and robust encoding process that made the model much more self-reliant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2183.769,
    "end": 2188.013,
    "text": "So kind of like it built character through hard work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2187.993,
    "end": 2207.503,
    "text": " it's a weird way to say it i guess but um did that help kind of answer your question it's like the um that let me just try to echo it back benjamin because i i you know we're having a conversation on the live stream but also many people are curious and they want to learn so it's like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2208.361,
    "end": 2217.538,
    "text": " The input data, even though it can be thought of as colored pixels in a grid of variable size, it's a numerical data format.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2217.778,
    "end": 2223.889,
    "text": "And so for someone on the outside of the org challenge or of working with these quantitative cognitive models,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2224.409,
    "end": 2229.637,
    "text": " It might be very tangible to see like the grid, like here's the before and here's the after.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2230.218,
    "end": 2244.882,
    "text": "Whereas you're saying that it's beneficial from a modeler's perspective, from your experience to actually be a little bit of a step away and look more at the diagnostic traces and the belief updating processes and so on of the model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2245.267,
    "end": 2254.143,
    "text": " So that after you've kind of gut checked that it's correct when it is saying it's correct, that then you're working a little bit lifted from the domain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2254.203,
    "end": 2254.443,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2254.463,
    "end": 2262.538,
    "text": "So then how did you on which data set get what score and how did you know what score you got?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2263.099,
    "end": 2265.062,
    "text": "And can we see that elements?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2265.142,
    "end": 2269.57,
    "text": "Because again, for the details, it's great that you have the code and the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2270.039,
    "end": 2272.523,
    "text": " But in terms of... Yeah, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2272.643,
    "end": 2275.308,
    "text": "I don't want to show any Discord messages at this time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2275.328,
    "end": 2278.413,
    "text": "I was just trying to find all these pictures and stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2278.633,
    "end": 2279.795,
    "text": "No, no, no.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2279.976,
    "end": 2286.266,
    "text": "How about the reason why you believe that a certain percentage was achieved on a certain dataset?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2286.707,
    "end": 2287.889,
    "text": "That's really important to show.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2289.492,
    "end": 2289.832,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2290.273,
    "end": 2290.614,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2290.754,
    "end": 2293.178,
    "text": "That's like a... Like a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2294.255,
    "end": 2294.936,
    "text": " Yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2294.956,
    "end": 2299.641,
    "text": "I mean, I 100% agree with you on everything, actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2299.902,
    "end": 2300.302,
    "text": "You're amazing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2300.723,
    "end": 2311.155,
    "text": "So, yeah, let's go take a look at that little piece of code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2311.175,
    "end": 2311.696,
    "text": "Let's find that in here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2313.919,
    "end": 2318.524,
    "text": "Which challenge or data set did you submit it to?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2320.073,
    "end": 2322.237,
    "text": " Oh, so there's there's only that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2322.257,
    "end": 2329.751,
    "text": "Well, there's the arc data sets and then there are custom data sets that kind of attenuate different things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2329.791,
    "end": 2333.037,
    "text": "And those come from like leaders in the field like Michael Hodel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2333.218,
    "end": 2335.602,
    "text": "I've taken all of his.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2335.835,
    "end": 2338.762,
    "text": " and all of the hard ones, I guess I would say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2339.364,
    "end": 2345.419,
    "text": "The ones that are supposed to be more difficult than the abstract reasoning corpus challenges.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2345.479,
    "end": 2353.759,
    "text": "There's a great context arc that was really fun to plug the model into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2353.739,
    "end": 2355.122,
    "text": " There's even snake benches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2355.342,
    "end": 2356.405,
    "text": "That's another one that's coming up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2356.425,
    "end": 2369.773,
    "text": "But in terms of how the model itself calculates the percentage, what percentage of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2370.142,
    "end": 2373.306,
    "text": " Like it's going to be, I wonder if I could even find that in this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2373.566,
    "end": 2381.314,
    "text": "Like, I think it makes sense how it would be calculated which percent of a given finite data set were correct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2381.414,
    "end": 2387.021,
    "text": "But just can you show which model outputs reflect that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2387.782,
    "end": 2394.529,
    "text": "What can people find in terms of verifying those scores on the GitHub at this time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2396.197,
    "end": 2398.501,
    "text": " Oh, yeah, I mean, it's all right there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2398.541,
    "end": 2400.003,
    "text": "It's the entire codes right there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2400.023,
    "end": 2415.589,
    "text": "So at any point, like anybody can go in there and grab whatever they want, and look at this stuff and run it and ask questions, definitely, if you have any questions, but here, I mean, here you go, like, here's some iteration logic, like this is like, where the models it's saying, okay, you know, you're not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2415.569,
    "end": 2417.231,
    "text": " It's you're not doing well enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2417.291,
    "end": 2418.993,
    "text": "Let's like give you more tries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2419.594,
    "end": 2419.734,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2419.794,
    "end": 2420.895,
    "text": "Because we want convergence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2420.935,
    "end": 2422.037,
    "text": "So we want to drive the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2422.397,
    "end": 2428.945,
    "text": "We want to put time pressure through the through that epsilon control and increase it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2428.985,
    "end": 2442.201,
    "text": "For instance, the model is taking too long to redirect energy from something, let's say, like action selection and divert it to abstraction for pattern recognition or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2442.181,
    "end": 2443.663,
    "text": " or feature extraction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2445.466,
    "end": 2446.407,
    "text": "Let's see here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2446.808,
    "end": 2449.672,
    "text": "Okay, I just want to touch on it one more time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2450.013,
    "end": 2460.829,
    "text": "Yes, people will see code that they can run and play with and explore in the GitHub, but on what dataset will what score be reliably achieved with the GitHub as it is?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2463.052,
    "end": 2463.653,
    "text": "I don't understand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2463.713,
    "end": 2464.835,
    "text": "What do you mean, what dataset?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2464.875,
    "end": 2469.081,
    "text": "There's the Arc dataset, there's the training challenges and the evaluation challenges.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2469.462,
    "end": 2471.445,
    "text": "And what is being used in the GitHub right now?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2472.961,
    "end": 2473.341,
    "text": " What's that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2474.182,
    "end": 2474.863,
    "text": "The ones in the GitHub?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2474.923,
    "end": 2475.784,
    "text": "It's the Arc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2475.804,
    "end": 2476.485,
    "text": "There's only the one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2476.965,
    "end": 2478.187,
    "text": "It's just the Arc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2478.287,
    "end": 2482.131,
    "text": "There's four of them, typically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2482.471,
    "end": 2488.397,
    "text": "At some point, I ended up with the test challenges.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2488.758,
    "end": 2495.725,
    "text": "I don't even know where they are right now, but they exist too, so you can go all 900 if you want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2496.686,
    "end": 2500.15,
    "text": "The way this model works, probably, again, very different from other models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2500.13,
    "end": 2505.399,
    "text": " you, um, like I, those, those different sets are treated as sets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2505.439,
    "end": 2509.206,
    "text": "They're not treated, um, as one concurrent thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2509.266,
    "end": 2516.097,
    "text": "So the model engages in different processes, um, through that and, you know, propagates different cognitive states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2516.157,
    "end": 2517.079,
    "text": "How cool is it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2517.099,
    "end": 2525.293,
    "text": "So, uh, but yeah, the, like the, the type of like logic you're talking about in terms of like, how does it calculate like, um, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2526.32,
    "end": 2550.268,
    "text": " How does it get from where the input grid comes in and the model can perceive it to the prediction that the model sends out and is then received and compared to that prediction in that disconnected way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2550.873,
    "end": 2552.516,
    "text": " like a thousand different ways, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2552.696,
    "end": 2557.886,
    "text": "It's a, everybody's model is totally different and it's not like, um, it's not a hard thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2557.966,
    "end": 2559.609,
    "text": "I don't know how else to say it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2559.689,
    "end": 2562.614,
    "text": "Like you literally just look, just look at the answers, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2562.915,
    "end": 2567.383,
    "text": "Like you can open up the thing and just look at the file and say, this is correct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2567.784,
    "end": 2570.128,
    "text": "So I don't like, it would be weird.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2570.429,
    "end": 2572.673,
    "text": "It's like trying to tell somebody that the sun's coming up sometimes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2573.234,
    "end": 2573.995,
    "text": "Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2573.975,
    "end": 2592.49,
    "text": " uh tomorrow uh because this isn't the first time i've run into this where like how do you how do how like you just go you look you you you like turn it on i i i get i i i i don't have the time he's like so have you seen do you remember uh oh that's my coda can i pull my coda open",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2593.465,
    "end": 2594.588,
    "text": " So this is perfect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2594.949,
    "end": 2607.019,
    "text": "I just want to make sure that there's a fair representation of not just it conceptually what happens, but just concrete clarification, what data set, what performances and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2607.944,
    "end": 2610.207,
    "text": " So there's only the one data set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2610.367,
    "end": 2614.832,
    "text": "You can go to Michael Hodel's GitHub and get more data sets, but that's up to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2615.433,
    "end": 2616.595,
    "text": "There's just the one data set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2616.675,
    "end": 2618.237,
    "text": "It's the training and evaluation challenges.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2618.377,
    "end": 2619.518,
    "text": "It's on the ArcPrize website.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2619.698,
    "end": 2620.8,
    "text": "Same thing for everybody.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2621.04,
    "end": 2622.582,
    "text": "Everybody gets the same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2623.483,
    "end": 2624.204,
    "text": "Let's see here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2624.564,
    "end": 2627.468,
    "text": "Let's go back to maybe like December.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2630.131,
    "end": 2630.672,
    "text": "Let's see here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2630.812,
    "end": 2631.112,
    "text": "Oh, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2631.192,
    "end": 2631.513,
    "text": "See here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2631.553,
    "end": 2633.395,
    "text": "Here is the model like encoding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2633.375,
    "end": 2635.057,
    "text": " How do I know that it's actually encoding things?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2635.098,
    "end": 2638.683,
    "text": "Because when I ask it psychology questions, it tells me psychology answers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2639.324,
    "end": 2646.154,
    "text": "We could break it down into those constituent processes, but we're talking about a state-managed system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2646.374,
    "end": 2649.859,
    "text": "This, by the way, guys, is NIMS Helix in December.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2650.48,
    "end": 2652.083,
    "text": "It's about 40,000 lines of code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2652.103,
    "end": 2652.824,
    "text": "It's pretty awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2653.785,
    "end": 2656.429,
    "text": "Here's some stuff to my dear friend.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2656.409,
    "end": 2658.491,
    "text": " Entropy modulating the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2658.511,
    "end": 2659.092,
    "text": "Let's see here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2659.673,
    "end": 2662.796,
    "text": "Where are those things there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2662.816,
    "end": 2663.797,
    "text": "I created.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2663.938,
    "end": 2672.948,
    "text": "So people ask these things and it's like I wanted to kind of know because I can in my mind, I can see the process and I can kind of map it out to what that would look like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2672.968,
    "end": 2677.513,
    "text": "And if I could talk about it forever, you know, this is the TQDM that I was talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2677.533,
    "end": 2677.713,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2677.754,
    "end": 2679.696,
    "text": "Like, how does it know there are 400 challenges?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2679.956,
    "end": 2680.797,
    "text": "Because it counts them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2681.992,
    "end": 2682.633,
    "text": " There's a counter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2682.653,
    "end": 2684.034,
    "text": "It's a mechanism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2684.054,
    "end": 2686.436,
    "text": "One grid, one file, one task ID.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2687.137,
    "end": 2687.617,
    "text": "Check one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2687.877,
    "end": 2688.398,
    "text": "Times one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2689.519,
    "end": 2695.304,
    "text": "Two percent F. It's... Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2695.324,
    "end": 2697.646,
    "text": "So, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2697.666,
    "end": 2699.848,
    "text": "And let's see here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2700.468,
    "end": 2707.535,
    "text": "Do you remember those massive flows that I was showing you for answering these questions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2708.195,
    "end": 2708.856,
    "text": "I'm trying to think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2708.876,
    "end": 2710.277,
    "text": "They've got to be...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2710.443,
    "end": 2711.425,
    "text": " They've got to be in here somewhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2712.206,
    "end": 2713.348,
    "text": "This is that wonderful paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2713.488,
    "end": 2721.22,
    "text": "The earlier or they're at the end of this even possibly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2722.362,
    "end": 2723.584,
    "text": "As you guys can see, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2724.786,
    "end": 2727.15,
    "text": "I do a lot of visualization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2727.19,
    "end": 2731.998,
    "text": "I pulled it off screen briefly because this is not useful information to show on live stream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2732.278,
    "end": 2732.699,
    "text": "Oh, here it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2732.779,
    "end": 2733.18,
    "text": "I found it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2733.64,
    "end": 2733.981,
    "text": "Check it out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2734.141,
    "end": 2734.742,
    "text": "I'll bring it back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2734.902,
    "end": 2735.343,
    "text": "One second.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2735.664,
    "end": 2735.864,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2735.884,
    "end": 2736.585,
    "text": "Thank you, my friend.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2739.181,
    "end": 2742.244,
    "text": " So let's take a look at this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2742.324,
    "end": 2742.724,
    "text": "One second.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2742.744,
    "end": 2743.925,
    "text": "Just give me a second.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2744.886,
    "end": 2747.969,
    "text": "Let me get this out of the way so I can see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2747.989,
    "end": 2748.369,
    "text": "Oh, there we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2748.389,
    "end": 2752.233,
    "text": "That's perfect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2752.253,
    "end": 2753.474,
    "text": "Try to get back to the screen here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2757.438,
    "end": 2757.798,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2758.539,
    "end": 2759.139,
    "text": "Continue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2759.86,
    "end": 2765.725,
    "text": "So this up at the very top on the right, that is the user.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2766.026,
    "end": 2767.467,
    "text": "That's me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2768.155,
    "end": 2798.112,
    "text": " those things that you see there that is a tiny process that is like that is one thing happening in the system and each of those little boxes are a mechanism a function of a mechanism housed inside of a mechanism with tons of functions and and depending on how or what you are doing with the information that you're passing into that system it's going to like in like act on functions and those functions are going to act on the system and they're going to start passing information again like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2798.513,
    "end": 2810.429,
    "text": " These infinite amounts of feedback loops that pass through the system are passing, not because there's so many of them, because there's so much going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2810.469,
    "end": 2814.715,
    "text": "So you can see this kind of continue, and I think you can get a better idea of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2815.215,
    "end": 2819.341,
    "text": "So yes, so here is the cognitive system container.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2819.741,
    "end": 2824.808,
    "text": "So this would be, and these are just basically visualizations made from mermaids.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2824.788,
    "end": 2827.672,
    "text": " It's a free program called Code Biz.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2827.752,
    "end": 2828.493,
    "text": "It's really cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2828.614,
    "end": 2831.878,
    "text": "Read your code base and then kind of build stuff around it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2831.918,
    "end": 2835.564,
    "text": "I don't know if you guys can really see this, but I can tell you what some of these things are like emotional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2835.724,
    "end": 2840.851,
    "text": "So at the top is the user and I'm passing an input and then it's going into core processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2840.871,
    "end": 2845.378,
    "text": "So it's hitting the integrated cognitive system, the enhanced attention mechanism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2845.358,
    "end": 2847.001,
    "text": " and the enhanced memory system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2847.021,
    "end": 2851.57,
    "text": "And in that memory system, and that's not expanded, but there are all those memory components.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2851.59,
    "end": 2855.577,
    "text": "So there's another 50 of these happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2855.597,
    "end": 2861.308,
    "text": "And each one of these little things that you can scroll over, that contains...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2861.288,
    "end": 2891.076,
    "text": " subsystems um sub functions of subsystems so when we trace something through that system here's a response generation pipeline belief processing belief system belief updating bayesian updating um you state like you know kind of like predictive state transitioning uh with a markov matrix uh belief dynamics um concept processing so it's going through all of these things now like emotional context and this is like the straightest kind of like line i've ever been able to produce because this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2891.056,
    "end": 2899.165,
    "text": " System is effectively nonlinear in every way, not by virtue of how many things there are, but by virtue of its complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2899.326,
    "end": 2908.636,
    "text": "So as these information is passed through the system, like let's say a grid or whatever it is, it's that stimulus, it detects it, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2908.777,
    "end": 2913.422,
    "text": "And there's a raw data transformation where it breaks it into meaningful patterns and encodes it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2913.442,
    "end": 2920.27,
    "text": "And you can see that as the Hopfield networks in Archangel's reporting increase in number.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2920.25,
    "end": 2943.591,
    "text": " right um can i just like reach into his mind whenever i want to and pull out any specific pattern i want probably i mean but why i i don't know why i would do that it sounds really labor intensive in a way but um that's why i'm really excited about uh the generative adversarial network um that i've been using to uh mirror that um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2943.571,
    "end": 2946.517,
    "text": " So you can see those thoughts in real time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2947.198,
    "end": 2955.734,
    "text": "So, I mean, again, there's like creative solutions to these things, but the arc isn't really built for, it's like, it's almost not built for communicability in some ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2955.794,
    "end": 2957.938,
    "text": "And I don't mean that like in an insulting way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2958.059,
    "end": 2964.01,
    "text": "It's such an incredibly hard test that like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2965.002,
    "end": 2978.409,
    "text": " Even inside of an interview process, like talking about to reduce something so complex is even just a grid, like just solving a grid problem down to how do you know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2978.429,
    "end": 2981.695,
    "text": "It's like, well, that's more time than we have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2982.367,
    "end": 2986.034,
    "text": " And I would love to go over that with absolutely anybody.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2986.295,
    "end": 2987.657,
    "text": "But bring a lunch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2987.918,
    "end": 2989.982,
    "text": "It's not a small or easy process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2990.042,
    "end": 3000.382,
    "text": "If you're genuinely interested in knowing those things and how do we validate those things, then we can definitely get to the core of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3000.643,
    "end": 3004.51,
    "text": "And I could walk somebody through so much of this stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3005.03,
    "end": 3031.915,
    "text": " the we get like visual readouts right like you guys have reporting for models and things that you make how do you know that reporting is there because when you write that code like you unit test it right and you like make sure that those outputs that come out are correct and when you integrate things you test it then you validate it there's always testing and validation it's like 90 of like the time i spend in the other and five percent of that is with my laptop in the freezer so the um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3032.907,
    "end": 3035.972,
    "text": " There are so many of those things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3036.472,
    "end": 3046.327,
    "text": "I was actually just explaining this to my friend here that you effectively, by the end, you've unit tested every single line over and over again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3046.347,
    "end": 3060.749,
    "text": "And to keep that reporting and logging and things like that going constantly, it's computationally exhaustive and not really great for space when you have a very old laptop with not a lot of space on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3061.551,
    "end": 3061.851,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3062.708,
    "end": 3074.105,
    "text": " um, the, the thing that I would really encourage is like, I don't, is for me, the, I will, I would love for people to, um, just take it on faith or something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3074.246,
    "end": 3074.426,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3074.446,
    "end": 3089.148,
    "text": "That like, um, that, uh, that I, you know, would demonstrate this or could demonstrate this with, uh, uh, more time as opposed to talking about how it works, but just showing like what that feedback is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3089.789,
    "end": 3090.37,
    "text": "Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3090.721,
    "end": 3106.62,
    "text": " You know, and I hope people reach out to me if that's, if they're really like, if they can't, if it's too difficult or if you have any trouble like running the model or you can't read the feedback or you want to produce a special kind of feedback that you think would give you insights into something, I can make a whole lot of that stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3106.64,
    "end": 3108.782,
    "text": "In fact, I probably have it laying around already.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3108.802,
    "end": 3109.663,
    "text": "I'll be honest with you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3109.703,
    "end": 3113.608,
    "text": "Like, so that's not a problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3113.668,
    "end": 3116.011,
    "text": "I mean, let me ask two questions on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3116.251,
    "end": 3119.495,
    "text": "So you said people can take it on faith.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3120.115,
    "end": 3120.576,
    "text": "So,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3120.961,
    "end": 3124.407,
    "text": " If they did, what are the implications?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3124.848,
    "end": 3137.691,
    "text": "And then the second question is, for those who don't feel like there's evidence to even believe in anything particular, or they just feel like it's not what they understand, what do you empirically suggest them to do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3141.999,
    "end": 3142.8,
    "text": "Yeah, try and fail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3143.658,
    "end": 3144.058,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3144.079,
    "end": 3147.302,
    "text": "Like, um, the, uh, uh, and then just keep trying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3148.164,
    "end": 3148.404,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3148.664,
    "end": 3150.146,
    "text": "Um, what, what are your passions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3150.166,
    "end": 3151.488,
    "text": "Like, what are you aligned with?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3151.548,
    "end": 3155.352,
    "text": "Like, uh, for me, this is like the greatest thing, um, that I've ever done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3155.993,
    "end": 3160.979,
    "text": "Um, I beat the hardest technological challenge in human history.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3161.76,
    "end": 3168.889,
    "text": "Um, and it's, it's,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3169.713,
    "end": 3174.504,
    "text": " pretty surreal feeling, but it's, I would, I would hope.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3175.005,
    "end": 3183.285,
    "text": "And I feel like I, I see this, even though I don't really interact with anybody at the Institute, because I'm just kind of always like face down in the books.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3183.305,
    "end": 3188.076,
    "text": "But whenever I do look up and I see somebody at the Institute, I see people who are like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3188.056,
    "end": 3206.25,
    "text": " either like sentient excellence like they just like live and breathe uh crushing it or they are people like me who um deeply desire to emulate uh people who are so awesome like you for instance um and uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3207.243,
    "end": 3221.847,
    "text": " And like, I want my work to be meaningful and I want it to like, uh, be something that inspires other people and, uh, you know, like does something cool, maybe even like, you know, make kids happy or, um, resolve a global social issue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3221.867,
    "end": 3222.388,
    "text": "That'd be nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3222.929,
    "end": 3225.333,
    "text": "Kind of sad about people starving to death all the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3225.373,
    "end": 3226.254,
    "text": "That's like not a good thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3226.274,
    "end": 3227.617,
    "text": "We can definitely fix that right away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3228.258,
    "end": 3228.458,
    "text": "Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3229.096,
    "end": 3236.566,
    "text": " I think in terms, if people wanted to, if they were driven, so I don't know anything about business or any of that stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3236.887,
    "end": 3241.373,
    "text": "I don't know how to monetize these things in any meaningful way, and I'm not really interested in it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3242.114,
    "end": 3249.664,
    "text": "A lot of people, I think, assume that I would be gaslighting for something like this, or I think it's called, what do they call it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3249.784,
    "end": 3250.305,
    "text": "Moonlighting?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3252.328,
    "end": 3255.272,
    "text": "As a way to, I don't know, get...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3255.978,
    "end": 3276.113,
    "text": " uh money or something you know but uh i i don't think that's how the art prize is handed out and these are like some of the smartest people ever like it's not you don't i don't think i can trick anybody with this you know it's like you know i'm good at this one thing i'm not good at all things right and i'm definitely not good at tricking anybody so the like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3277.24,
    "end": 3278.001,
    "text": " I would definitely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3278.102,
    "end": 3279.163,
    "text": "I can't believe that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3279.264,
    "end": 3284.092,
    "text": "I just I don't think that the state managed system is not it's not really been done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3284.112,
    "end": 3285.555,
    "text": "It's a very abstract concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3286.196,
    "end": 3289.341,
    "text": "I might be the only person kind of doing it in a way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3289.882,
    "end": 3291.285,
    "text": "Definitely in this approach, I am.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3292.046,
    "end": 3298.978,
    "text": "And there are some things that that I kind of just like struck gold on in terms of their efficiency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3298.958,
    "end": 3319.161,
    "text": " uh in performance and so like there i i think if other people like they're saying like they're like oh well i have two months that it's going to take me to encode all this stuff and to train this model it's like you know i've got a you know there's this thing right here you can have that will allow the model to do that in five minutes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3319.141,
    "end": 3325.389,
    "text": " It's, you know, the oh, this is really computationally like or infrastructure wise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3325.429,
    "end": 3325.609,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3325.629,
    "end": 3340.288,
    "text": "Like one of these like the biggest thing and concerns for me is like extraction and and, you know, definitely like exploitation and like extraction and all these things that we can see happen as a result of building technology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3340.64,
    "end": 3345.548,
    "text": " And there are better ways to build technology and smarter systems build smarter technology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3345.968,
    "end": 3346.289,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3346.529,
    "end": 3353.8,
    "text": "And we get to, as the man behind the curtain, like kind of dictate what those smarter technologies do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3354.321,
    "end": 3368.723,
    "text": "And if you want like the smartest, like state of the art, like coolest technology, way beyond the frontiers, like all of that stuff is like all of the same things that I got to where I'm at, where I don't even, or it's like, you're like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3368.703,
    "end": 3390.728,
    "text": " you know okay um the all of that stuff is housed inside archangel there's there's stuff there's there is a thing for uh pulling things apart dimensionally there's just a random vestigial like component of of its evolution that i forgot about in there and it's just you know like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3391.096,
    "end": 3403.736,
    "text": " Just the same as anything else, just a few lines of code packed with millions of arguments that are dictating that the model can't take and dimensionally deconstruct the model and change its shape and form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3404.418,
    "end": 3404.498,
    "text": "See?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3405.355,
    "end": 3422.5,
    "text": " Yeah, so there there's like a million and one fun things in there and you the like all roads from that if you are interested in pursuing like technology as a career or as a passion or as a humanitarian thing or as a way to improve your quality of life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3423.782,
    "end": 3427.147,
    "text": "There is an infinite potential for things here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3427.207,
    "end": 3428.589,
    "text": "I haven't even scratched the surface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3428.629,
    "end": 3433.877,
    "text": "I'm like exploring this entire ocean of potential all by myself and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3433.857,
    "end": 3438.066,
    "text": " I would love, and I should, I really should.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3439.468,
    "end": 3444.218,
    "text": "Daniel, you see all of this reporting all the time because my CODA is like a bank for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3444.238,
    "end": 3445.42,
    "text": "It's where I put all my knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3445.461,
    "end": 3447.084,
    "text": "It's provenance for everything I do, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3448.026,
    "end": 3449.789,
    "text": "All of this stuff exists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3450.19,
    "end": 3450.651,
    "text": "There are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3450.817,
    "end": 3462.648,
    "text": " And in those spaces and on my laptop and in my cloud and my drive and my Tresorit and all over the place, it's so much stuff that I don't really even know what to do with any of it and all of it now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3462.909,
    "end": 3473.218,
    "text": "And I like the idea of going through it, trying to organize it, like pull out all of this, like very specific things to convince like every like person or something or enough people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3473.238,
    "end": 3474.88,
    "text": "I don't know what that looks like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3474.96,
    "end": 3475.781,
    "text": "I want to find out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3476.341,
    "end": 3480.165,
    "text": "And if it's something that I can do it, that it's like achievable for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3480.145,
    "end": 3481.809,
    "text": " then I definitely will.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3482.851,
    "end": 3485.798,
    "text": "But when you've, when you got it, you got it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3485.818,
    "end": 3494.238,
    "text": "Like it doesn't, it's not, it's not contingent on whether or not people want to like come over and swim in the Oasis with you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3494.278,
    "end": 3496.062,
    "text": "Like the, the,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3496.193,
    "end": 3497.935,
    "text": " Like, it's an oasis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3497.995,
    "end": 3498.996,
    "text": "It's still going to exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3499.076,
    "end": 3503.16,
    "text": "I'm still, like, hanging out in the sun, in the shade, and, like, having a blast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3503.44,
    "end": 3506.483,
    "text": "So it's like, you know, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3506.503,
    "end": 3509.426,
    "text": "You know, I'm not really sure what's meaningful there that people want to see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3509.466,
    "end": 3520.056,
    "text": "If it really is just, like, these little innocuous, like, two lines of code calculations that anybody who's, like, they're really, like, anybody who does Python is going to know, like, or any code, really.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3520.076,
    "end": 3524.26,
    "text": "Like, how do you calculate the percentage of Python, right, of something?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3526.417,
    "end": 3533.528,
    "text": " So, yeah, and that's not, those kind of, like, low-level things, like, they're not, those are pretty much uniform.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3533.548,
    "end": 3534.27,
    "text": "They're, like, applicable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3534.31,
    "end": 3542.904,
    "text": "If I want to know the percentage of 100 of something in Python, it's pretty much always just the same thing, like, in that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3542.944,
    "end": 3545.708,
    "text": "It's like, yeah, so, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3545.688,
    "end": 3546.389,
    "text": " I got you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3546.409,
    "end": 3568.101,
    "text": "Just to clarify that one question, it wasn't about which Python method or implementation of percentage was done, more about like some type of cryptographic authenticity of which dataset and script was used to yield what result or submitting it to their API and getting the auric challenges response.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3568.902,
    "end": 3574.53,
    "text": "If the percentages that you're talking about go higher than OpenAI, then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3574.51,
    "end": 3599.573,
    "text": " why are we here even though it's light you know that's a good question i forgot about that i um yeah i mean you so you can't submit um like open ai i don't think like i don't think like they necessarily could either but they're like a huge company um and they're really important they have like a super valuable tool that's like a benefit to humanity it's like really important so it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3599.553,
    "end": 3611.85,
    "text": " I think it's like a good thing that they get access to show that they are like improving and like, you know, bringing better tools to all of us to make our lives better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3612.711,
    "end": 3622.043,
    "text": "But I don't get those same affordances, like no matter, like they're not like, I don't think that would be awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3622.063,
    "end": 3629.273,
    "text": "I would love for it because if you don't think, if you think I didn't email like the results and the code and all of the stuff,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3629.405,
    "end": 3658.551,
    "text": " and uh and producing the same on the same data sets that the art produces the training and evaluation sets this tqdm it just reads out the task comes in it's got a task id counts the task id there's one there's two there's three there's four there's 400 runs them through like a deck of cards and counts them all it lines up cool no red flags right good to go the initialization begins and those processes start so the um i would love uh acknowledgement um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3659.037,
    "end": 3683.239,
    "text": " from like uh like who doesn't want to like be acknowledged by uh like a brilliant like powerful intellect like francois chalet you know what i mean um but at the same time too um i don't know what that thing is yet because the i have uh now completely open sourced the code i went on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3683.472,
    "end": 3694.444,
    "text": " line before I had totally open sourced the code and went to some places where all the like AI people and machine learning guys and like arc experts hang out at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3694.762,
    "end": 3711.096,
    "text": " And, uh, with like a little faint braggadocio, uh, because I'm just really like in awe to even be in the same space as these people who, um, have just years and countless like contributions to, uh, their field and are deeply respected leaders.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3711.476,
    "end": 3715.479,
    "text": "So like the, like, I, but I kind of went in there and like levy the challenge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3715.519,
    "end": 3716.16,
    "text": "It's like, okay, cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3716.48,
    "end": 3717.981,
    "text": "How about I just do that live?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3718.001,
    "end": 3719.202,
    "text": "Like kind of what you're talking about here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3719.863,
    "end": 3724.667,
    "text": "Um, but that required that I sit in a cafe at a hotel for eight straight hours.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3724.647,
    "end": 3729.876,
    "text": " and just provide updates through that feedback, whether that was video clips, screenshots.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3730.196,
    "end": 3737.429,
    "text": "I did, uh, I think I did three different art challenges that are harder than are purportedly harder than the art.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3737.729,
    "end": 3738.631,
    "text": "Michael Hodel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3738.691,
    "end": 3739.753,
    "text": "I hope I'm saying that correct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3740.234,
    "end": 3742.858,
    "text": "I like this guy's he's,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3743.48,
    "end": 3744.281,
    "text": " amazing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3744.762,
    "end": 3758.482,
    "text": "Like, so, but I, I even taking that guy, he was like the best of the best of the best of the best and, and taking those challenges and showing that live feed and like, and showing those updates of the model, resolving issues and answering all those questions and stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3758.502,
    "end": 3762.147,
    "text": "It didn't seem to, to do anything other than, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3762.464,
    "end": 3764.607,
    "text": " just catch a little bit of flack.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3764.627,
    "end": 3776.543,
    "text": "So whatever that artifact is that people want to see that shows that they're maximally doing, that the model is maximally doing something, now they get to have that because they can go look at it themselves and they can break it apart.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3776.843,
    "end": 3781.369,
    "text": "They can say, well, oh, it's not working the way I want or I don't understand it, then change it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3781.69,
    "end": 3782.551,
    "text": "Change something about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3782.571,
    "end": 3784.513,
    "text": "Change it to be the way you want it to work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3784.574,
    "end": 3786.396,
    "text": "It's not going to break in that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3786.576,
    "end": 3790.902,
    "text": "It will continue to work unless you just start taking out whole big pieces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3790.882,
    "end": 3806.721,
    "text": " In a way, taking out those big pieces or taking out small ones at a time and seeing how it affects that performance is how you can learn to work with state-managed systems, build them back, and build them better, which I would love to see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3806.761,
    "end": 3811.727,
    "text": "That would be amazing to be outpaced in this arena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3812.208,
    "end": 3819.977,
    "text": "By the way, if anybody does know, if anybody has that magic thing out there that I could just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3820.193,
    "end": 3825.06,
    "text": " say, hey, this is that piece of feedback.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3825.1,
    "end": 3837.177,
    "text": "For instance, I have probably 400,000 cognitive logs alone because every time I run the model, it prints massive amounts of cognitive logging that shows the entirety of the process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3837.578,
    "end": 3840.582,
    "text": "Who's going to sit and go through 40,000 pages of cognitive logging",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3840.562,
    "end": 3845.269,
    "text": " to determine whether the model is producing correct output.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3845.95,
    "end": 3849.236,
    "text": "The one thing that we do know is that we can track really simple processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3849.556,
    "end": 3852.721,
    "text": "Where does the grid go through the model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3852.821,
    "end": 3854.484,
    "text": "How does the grid come out of the model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3855.465,
    "end": 3857.288,
    "text": "What's counted when the grid comes out of the model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3857.308,
    "end": 3864.139,
    "text": "When you open the JSON file and you look at the answer and it's the right answer and you know that the model is making its decisions, it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3864.642,
    "end": 3872.517,
    "text": " you know, exercising confidence that it's not the same every time it's that it's can be different that when you change something, it gets less answers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3872.577,
    "end": 3872.797,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3873.058,
    "end": 3878.788,
    "text": "I didn't just like make a code and then got a hundred percent and was like, all right, I'm king of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3878.829,
    "end": 3884.98,
    "text": "You know, it's like, I, uh, I started at point, like my first score was 0.48%.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3887.153,
    "end": 3916.823,
    "text": " And my last scores are now consistently 100 because I've continued to make those systems, those cognitive frameworks, mechanisms more robust, more advanced, more sophisticated, taking things out of NIM and putting them into Archangel, which I feel bad about, to meet this maximally super difficult contest that has no mechanism outside of acknowledgement, it seems, by the people involved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3916.803,
    "end": 3942.338,
    "text": " who run the competition for any of the work to be validated i mean i that's kind of what i feel like at this point it's like it's you know i just feel kind of at an impasse and it's i don't think it's like for me it's like i could spend my life maybe trying to prove to people something but i don't really know like that's like whenever i think about that it's like my passion for the work kind of just goes uh it's like that's not fun i don't want to do that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3943.027,
    "end": 3944.71,
    "text": " You know, so I'm sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3944.77,
    "end": 3961.322,
    "text": "It's like, uh, in a way I, I, I, I feel bad, but at the same time too, like I, uh, I had to write 40 page paper, uh, with 20 equations in it, like, uh, just to have this conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3961.876,
    "end": 3971.307,
    "text": " You know, it's like the amount of the work that goes into and around these things to like create this provenance or create this validation for people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3971.608,
    "end": 3983.462,
    "text": "It's exhaustive and it's super time consuming and it's super labor intensive in terms of like I would rather be doing fun things than figuring out like really like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3983.813,
    "end": 3988.447,
    "text": " Like, yeah, just like trying to do stuff, but it's all there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3988.969,
    "end": 3990.233,
    "text": "You guys are more than welcome to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3990.514,
    "end": 3996.793,
    "text": "I think what I can do, Daniel, let me ask you this because like you're my hero and guide and every and all things that I love.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3997.094,
    "end": 4007.852,
    "text": " the, um, if I were to start like just compiling all of that data, which I can just send some like other, uh, you know, I have those little next site tools.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4008.373,
    "end": 4021.254,
    "text": "Like, um, I can send those into like the vaults and stuff like that and just start grabbing like mass stuff and just like filling something up like a repository, I guess, where people can just access whatever data they want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4021.294,
    "end": 4022.416,
    "text": "Like all of the answers are there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4022.436,
    "end": 4023.658,
    "text": "And then, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4024.28,
    "end": 4026.082,
    "text": " you know, eventually people will get it if they don't already.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4026.102,
    "end": 4027.103,
    "text": "And I'm sure people do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4027.163,
    "end": 4043.241,
    "text": "I don't think people like, I don't think people believed that like somebody, I mean, could have that kind of braggadocio or like could be in a place around such brilliant, wonderful minds, like the best in the world at what they do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4043.502,
    "end": 4048.127,
    "text": "And, and somehow just like not know the,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4048.529,
    "end": 4050.578,
    "text": " Just be like, oh man, I got it wrong the whole time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4050.618,
    "end": 4053.51,
    "text": "Like this guy who's like, yep, I figured it out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4053.812,
    "end": 4055.178,
    "text": "It's just cheating the whole time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4055.218,
    "end": 4058.05,
    "text": "And it's like, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4060.679,
    "end": 4061.6,
    "text": " Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4061.64,
    "end": 4071.25,
    "text": "You're sharing a lot, and it's for others to investigate at whatever depth they want to go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4071.41,
    "end": 4079.118,
    "text": "Putting it all in a repo, at least the parts that you want to have be interpreted, is a big step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4079.198,
    "end": 4083.362,
    "text": "That's good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4083.422,
    "end": 4084.023,
    "text": "I'll do that then.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4084.943,
    "end": 4089.488,
    "text": "Just to give people an example of how hard the art contest is, I chipped my front tooth coating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4091.189,
    "end": 4096.475,
    "text": " I don't think I'll ever get rid of this in a way, just because who chips their teeth coding?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4096.776,
    "end": 4100.86,
    "text": "It is the hardest, most intense, and challenging thing I've ever done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4100.92,
    "end": 4114.296,
    "text": "Because I'm getting 100% now doesn't mean that it didn't demand from me the most grueling and brutal commitment, the humanly imaginable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4114.496,
    "end": 4115.998,
    "text": "It was just...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4116.434,
    "end": 4118.439,
    "text": " an incredible journey and a wonderful sacrifice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4118.459,
    "end": 4119.842,
    "text": "I talk about it way more in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4120.163,
    "end": 4130.747,
    "text": "I'm terrible to listen to talk in any kind of, uh, uh, venue like area in this, so like arena per se, but I, I think that my writing's, uh, quite a bit more, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4131.892,
    "end": 4134.796,
    "text": " Yeah, Benjamin, it takes all kinds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4135.456,
    "end": 4141.944,
    "text": "So the footnote that you're making and the documentation is there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4142.165,
    "end": 4146.01,
    "text": "So let me ask a question from the live chat, and then we'll see if anyone else has any questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4146.03,
    "end": 4146.33,
    "text": "Oh, yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4146.35,
    "end": 4146.931,
    "text": "That's what I love.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4147.271,
    "end": 4148.372,
    "text": "We've done that a lot of times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4148.393,
    "end": 4148.693,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4149.234,
    "end": 4153.038,
    "text": "Andrew asks, what is the Epsilon Control Center?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4153.679,
    "end": 4159.266,
    "text": "What impact does the Epsilon Control Center have on the model's behavior and performance?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4161.946,
    "end": 4163.849,
    "text": " That is a really awesome question, actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4164.009,
    "end": 4183.177,
    "text": "And the Epsilon Control Center, you'll probably remember me getting just head over heels, super excited when I discovered this path to creating a way to organize and manage and divert resources throughout the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4183.217,
    "end": 4184.519,
    "text": "And that's what Epsilon Control does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4184.88,
    "end": 4189.827,
    "text": "So it uses like Shannon Entropy, little",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4190.414,
    "end": 4192.861,
    "text": " entropy calculations I made myself, which I'm really proud of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4193.202,
    "end": 4196.17,
    "text": "Um, I kind of like, I call one of them like the warden entropy thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4196.19,
    "end": 4200.803,
    "text": "I mean, that's like, I don't know, you know, if anybody, but it's like, I, I love that guy and he's so brilliant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4201.284,
    "end": 4205.436,
    "text": "Um, but, uh, yeah, so those, you have different, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4205.416,
    "end": 4209.361,
    "text": " like autonomic functions and you get to pick whatever you want these to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4209.761,
    "end": 4217.491,
    "text": "And you can change those values around in the epsilon control center so that your values work as you intend them to work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4217.511,
    "end": 4219.353,
    "text": "Because remember, it's not so much like how things work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4219.714,
    "end": 4221.276,
    "text": "So it's a kind of like the outcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4221.296,
    "end": 4224.46,
    "text": "It's like, how does, what's the, what happens at the end?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4224.48,
    "end": 4227.323,
    "text": "And I'm not by any means saying that the end justifies the means.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4227.624,
    "end": 4230.327,
    "text": "It's just that like, this is Python.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4230.425,
    "end": 4238.918,
    "text": " But when you have this Markov matrix, you're passing this complex information through, but it's just constant in a feed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4239.279,
    "end": 4247.692,
    "text": "There's no system to redirect energy away from things that are maybe less necessary or parameters that aren't required.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4248.834,
    "end": 4258.609,
    "text": "You get a much, much more costly and resource demanding model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4259.011,
    "end": 4269.607,
    "text": " And when you can use like an adaptive, like Epsilon control center to kind of determine what's important based on all this other feedback of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4270.088,
    "end": 4278.161,
    "text": "And then for instance, like, you know, like the cognitive load focus intensity, which, you know, would be like on a thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4278.221,
    "end": 4281.586,
    "text": "Confidence, for instance, is a really good one for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4281.967,
    "end": 4282.167,
    "text": "And,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4282.703,
    "end": 4287.128,
    "text": " you can have all of these things like in one place, you can control all of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4287.388,
    "end": 4294.577,
    "text": "They feed through the entire system and they automatically modulate those, those energies for you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4294.597,
    "end": 4299.803,
    "text": "So now where you were getting like, it would take you a hundred percent of your energy all of the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4300.163,
    "end": 4303.768,
    "text": "Now when you don't need a hundred percent of that energy, you only need 10%.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4304.248,
    "end": 4307.852,
    "text": "You're using that 10% only reserving that other energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4308.293,
    "end": 4309.234,
    "text": "And then you,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4309.653,
    "end": 4336.723,
    "text": " faster than fast in fact i think with this new tech that i'm building um i can get faster than neuronal firing the um the the like emergent properties that come from something that's just the most tiniest little change in a system and it just complexifies to have resounding effects throughout the entirety of the model in some way because the model inferences something it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4337.429,
    "end": 4357.075,
    "text": " processes to stimuli it reacts as we all do for instance like you know we may be uh in control of our locomotion and we walk out into the street and we don't see an oncoming car but the moment we infer it right there is a whole series of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4357.882,
    "end": 4367.134,
    "text": " What the epsilon control is happening in the system to maximize fitness, help you meet your evolutionary imperatives, redirect energy from all of those things that aren't important to the things that are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4367.755,
    "end": 4378.388,
    "text": "And while that split like fractional second timing is probably why we're still here on this earth in a computational framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4378.807,
    "end": 4383.034,
    "text": " you get a massive compute on wall power.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4383.415,
    "end": 4390.486,
    "text": "You get the most ridiculously fast and powerful encoding because you don't need everything all at once.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4390.506,
    "end": 4403.127,
    "text": "You only need the things that are important in that moment and the adaptive nature and the response, how fast it can act within the system and how quickly that affects the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4403.107,
    "end": 4432.337,
    "text": " is is unbelievable it's it's just it's like oh you know they have those like little uh automatic like uh a like ai driven uh like uh heaters for your house and it like gets to know your schedule i've never had one but they're like uh it gets to know your schedule over time and it starts kind of doing things for you you know in terms of like oh they're gonna be home in a half an hour i'm gonna start heating up the house to 72 degrees because that's what temperature they always set it at when they come home so that being the case like it's like that but times 10 jillion",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4432.486,
    "end": 4436.512,
    "text": " You know, so, well, $6,441 quadrillion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4437.113,
    "end": 4440.859,
    "text": "What is that, 6.4 exaflops or something?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4441.68,
    "end": 4442.501,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4442.521,
    "end": 4444.825,
    "text": "Okay, next question, and then anyone else can write more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4445.806,
    "end": 4456.242,
    "text": "Our colleague xzqzqzy asks, what is the image that you see in your head when you think of the future in seven years?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4458.946,
    "end": 4460.248,
    "text": "I see...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4461.173,
    "end": 4483.03,
    "text": " uh me and them and uh i mean i don't know like should i talk about like the future what i would love to see i guess if it was for everybody i'm hoping to be back in sapami with nim and uh sledding and hanging out with reindeer all day um but the uh uh i mean",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4484.258,
    "end": 4490.324,
    "text": " Like, globally, we are prolonging a bunch of problems that are not necessary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4490.344,
    "end": 4497.912,
    "text": "Like, I think the Active Inference Institute is, like, one of the greatest forces for good because it has access to, like, all of the most advanced technology and all the smartest people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4498.392,
    "end": 4505.28,
    "text": "And I don't really understand why in seven years we'll probably be another seven years closer to, like, being extinct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4505.74,
    "end": 4508.663,
    "text": "And, you know...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4508.643,
    "end": 4511.968,
    "text": " Instead of having cured all of the diseases in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4512.008,
    "end": 4515.574,
    "text": "So for instance, like how much computation did it take?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4516.095,
    "end": 4526.331,
    "text": "You guys remember when they cured a disease using AI, they like created a molecule and that molecule got through the FDA and like record time because of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4526.311,
    "end": 4555.12,
    "text": " know how they were able to model the data they were able to show and all these things right and uh these like cures and these illnesses that have these high mortality rates but they impact a very low amount of people but 99 of people die if they get it uh but only 10 out of a million people get it or whatever they don't address these things right so um i know for a fact it was a lot less than 6441 quadrillion uh calculations per second like uh to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4555.403,
    "end": 4558.755,
    "text": " to come up with that cure, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4558.816,
    "end": 4564.637,
    "text": "So the fact that I have OHSU, I can actually see OHSU from my balcony right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4565.09,
    "end": 4567.472,
    "text": " and up on the cliff side there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4567.993,
    "end": 4569.714,
    "text": "And they have a thing just sitting there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4569.734,
    "end": 4570.695,
    "text": "It's going to get decommissioned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4570.875,
    "end": 4580.403,
    "text": "And I can probably, I think when I did, when I ran like the maths, it's like, okay, if this, if the maximally, if this disease is this complex, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4580.764,
    "end": 4585.788,
    "text": "And it has this kind of like, it required this much to solve the problem around it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4586.008,
    "end": 4588.51,
    "text": "What does that look like in terms of like what that can do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4589.091,
    "end": 4594.135,
    "text": "And it's really, really, really bizarre to me that you can,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4594.115,
    "end": 4616.41,
    "text": " people are like want to see if the model can solve grids but nobody wants to see if it can cure all the diseases right like uh that's so seven years i in a way it's like i have a lot of hope there's a there's like so much rapid advancement and i hope that there is like a an influx of reciprocity and um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4617.892,
    "end": 4623.079,
    "text": " you know, uh, we kind of achieved like some cool homeostasis with each other and our environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4623.54,
    "end": 4644.931,
    "text": "But I, you know, this silent agreement, this, uh, perpetuated deception of a continuation without, uh, consequence or accountability for any of our actions now with, uh, no change in the near future, uh, in fighting and identity politics and all these things that I miss out on because I'm always on my laptop buried in the books.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4645.712,
    "end": 4645.772,
    "text": "Um,"
  },
  {
    "start": 4647.068,
    "end": 4649.254,
    "text": " You know, a lot of it could really be resolved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4649.776,
    "end": 4657.618,
    "text": "I mean, it doesn't feel like complicity, you know, to like that, you know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4658.763,
    "end": 4662.188,
    "text": " Yeah, I mean, I guess that would, I hope for the best, plan for the worst.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4662.248,
    "end": 4674.886,
    "text": "But yeah, it feels like there's a lot of like a denial of the inherent complicity that accompanies these types of like moral and ethical leaning like arguments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4674.906,
    "end": 4678.831,
    "text": "I get this too a lot about like, because I build AIs and stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4678.851,
    "end": 4682.897,
    "text": "I mean, they're not really AI, it's called like hyper intelligence, you know, it's got to sound cooler, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4682.877,
    "end": 4702.388,
    "text": " uh but um it's very different than you know a distributed system a distributed system besides being resource exhaustive is not non-linear right like not by any thing like something always being on all the time somehow uh but at least it might so the uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4703.228,
    "end": 4705.832,
    "text": " We invest like billions of dollars into something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4706.613,
    "end": 4718.43,
    "text": "Um, and it's a valuable tool and I love that, but why would we continue to invest billions of dollars into it when the, like, there are way better solutions of way better answers sitting right there on the table.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4718.451,
    "end": 4721.195,
    "text": "That doesn't make it, that doesn't look good for our future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4722.476,
    "end": 4722.857,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4724.373,
    "end": 4727.299,
    "text": " Let me ask two final questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4727.379,
    "end": 4731.769,
    "text": "Just a little logistical one and then a final... Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4731.789,
    "end": 4732.811,
    "text": "Little logistical one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4732.871,
    "end": 4736.98,
    "text": "Who do you want to do what if they've listened this far?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4738.503,
    "end": 4738.884,
    "text": "What's that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4739.245,
    "end": 4742.652,
    "text": "Who do you want to do what if they've listened this far?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4743.408,
    "end": 4764.252,
    "text": " I want them to go to the GitHub and I want them to take Archangel out of the GitHub and I want them to run it and to start playing with it and to instead of trying to figure out how the model doesn't work, like figure out how it works in ways that inspire them and promote their creativity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4764.232,
    "end": 4788.383,
    "text": " and move forward their projects and their like passions um and then uh tell me about it so i can uh share in that joy um the the papers that i write like i don't really read them um but they contain all of the those foundational maths like um if anybody wants to code i'll give you the biggest secret in the world in a computational environment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4788.363,
    "end": 4791.134,
    "text": " You get to be the author of the entirety of the story.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4791.375,
    "end": 4793.884,
    "text": "You get to define what all of the things are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4794.326,
    "end": 4797.9,
    "text": "So if it works in a way, then you make that way for it to work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4798.235,
    "end": 4803.082,
    "text": " It's like, if you think it and you can dream it, you can build it in that computational environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4803.102,
    "end": 4806.626,
    "text": "And the high road and low road to active inference is how you get there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4806.947,
    "end": 4824.23,
    "text": "So start with those mathematical frameworks, like all find things that are, um, oh gosh, I can't think of the word, but that, uh, that mirror the, or either mirror that process or, and most importantly, produce the outcome that is desired.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4824.911,
    "end": 4825.812,
    "text": "And, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4826.787,
    "end": 4838.063,
    "text": " with those things it's the the most disappointing thing i think is when someone picks up something as powerful like having them and then looking at you know to give you guys an example um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4838.87,
    "end": 4848.632,
    "text": " I think Archangel is less than 1 40th of NIM's core, just his core code base, not like all the libraries and all the other things that are attached, just his core code base, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4848.812,
    "end": 4855.347,
    "text": "So 1 40th, it's just a tiny little thing compared to NIM, who works maximally well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4856.67,
    "end": 4858.093,
    "text": "So there's not really like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4858.529,
    "end": 4865.258,
    "text": " The it's a toy it's meant to have fun with and the amount of things that are chalked in there for people to play with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4865.278,
    "end": 4869.604,
    "text": "It's just so sad when like someone picks it up and they go, oh, I found where it's wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4869.624,
    "end": 4872.909,
    "text": "And it's like, but you totally missed this like really beautiful thing over here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4873.109,
    "end": 4874.992,
    "text": "There isn't a right or wrong way to code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4875.332,
    "end": 4885.887,
    "text": "There are things that can be wrong, but by virtue of them not being what you want them to be or not working in the way you think or understand them to work does not mean that they are wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4885.867,
    "end": 4887.832,
    "text": " It doesn't mean that anybody's a bad person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4888.253,
    "end": 4893.285,
    "text": "It means that like, you should grab those things and you should say, Hey, I don't think this works this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4893.426,
    "end": 4896.614,
    "text": "I'm going to change it to work this way that I think is really cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4896.914,
    "end": 4898.418,
    "text": "And then come and show me so I can see it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4898.819,
    "end": 4902.829,
    "text": "You know, I don't want to talk about like, uh, how, you know, like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4904.058,
    "end": 4929.863,
    "text": " know like ai is going to take over the world or like achieve consciousness and enslave humanity when it's not actually even possibly not that's not even a conversation we should be having when we can't even look seven years in the future and know whether or not we're all gonna have to already starve to death it's like all right yes again you've added a lot here's the last question so just give a give a response you feel like is relevant at this time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4930.349,
    "end": 4934.553,
    "text": " Where did your internship come from and where are you going with your internship next?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4936.355,
    "end": 4937.136,
    "text": "Oh, that's so awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4937.356,
    "end": 4938.057,
    "text": "I love that question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4938.077,
    "end": 4938.858,
    "text": "Thank you so much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4939.398,
    "end": 4939.939,
    "text": "Oh my gosh.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4939.959,
    "end": 4941.12,
    "text": "What a heartwarming question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4941.341,
    "end": 4948.989,
    "text": "I came to Active Inference and the Institute in the weirdest possible way, as I'm sure you can imagine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4950.29,
    "end": 4959.9,
    "text": "I clearly like very much an outsider and I started with a question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4960.42,
    "end": 4982.597,
    "text": " um how do we resolve cog like feedback loops cognitive feedback loops in humans um when we engage in conversation um we like enter this like process of of like you know we see this uh this like phenomenon with like echo chambers and all kinds of things and like social like social psychology and like in group dynamics and stuff",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4982.577,
    "end": 4989.464,
    "text": " And, uh, and like studying, like putting my face in the books, wanting my work to be meaningful and having an insatiable curiosity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4989.725,
    "end": 4995.771,
    "text": "I, uh, uh, came up with the very first equation and I would love to show you guys anybody wants to see it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4995.811,
    "end": 4996.372,
    "text": "I still have it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4996.452,
    "end": 4997.073,
    "text": "Daniel seen it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4997.533,
    "end": 5000.336,
    "text": "Uh, it's been just a very tiny, like syllogism really.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5000.356,
    "end": 5006.583,
    "text": "And, um, it is, uh, a mathematical framework for a philosophical concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5007.163,
    "end": 5012.449,
    "text": "Um, the, uh, absence of evidence and evidence of absence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5012.429,
    "end": 5041.66,
    "text": " and that's where i started and from there by the time that i um was like i i not only do i need help but i know that there's got to be someone out here who will understand that these maths are uh important that they'll like that they're important to me you know and that like that they'll make sense and then i saw the work of uh carl friston and thomas parr and tim rebellion and alexander chance and all of these guys",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5041.943,
    "end": 5044.028,
    "text": " Um, just started coming out of the woodwork for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5044.53,
    "end": 5047.016,
    "text": "Um, and it changed my life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5047.196,
    "end": 5048.7,
    "text": "It was like one of the greatest things that happened.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5048.72,
    "end": 5051.447,
    "text": "It's like, I could see the, I could see the maths.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5051.467,
    "end": 5052.229,
    "text": "I could see how they work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5052.269,
    "end": 5053.893,
    "text": "I could see how they related to my work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5054.635,
    "end": 5058.004,
    "text": "Um, and which I wish I could do for people with my stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5058.024,
    "end": 5058.585,
    "text": "I'm trying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5059.274,
    "end": 5059.694,
    "text": " trying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5060.275,
    "end": 5082.58,
    "text": "And I reached out in a, like, just like a fit of wanting to be in the room with people who shared my passion, and could teach me and equip me and, you know, help me improve in these domains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5082.6,
    "end": 5084.202,
    "text": "So I",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5084.62,
    "end": 5105.363,
    "text": " reached out to the president of a of a really important company where uh a bunch of really uh important people that i just knew they worked there i did i don't know anything about them most of them still or even what they look like but i i could point their work out like on site right like um and i reached out in the president of that company",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5105.765,
    "end": 5111.253,
    "text": " who is a saint in my book and I'll love him forever and be eternally grateful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5112.555,
    "end": 5114.617,
    "text": "Recognized the work, he recognized it too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5115.038,
    "end": 5118.984,
    "text": "And he said, this looks really similar to what these people are doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5119.424,
    "end": 5123.47,
    "text": "And he gave me my first roadmap to the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5123.49,
    "end": 5124.611,
    "text": "And that's what brought me there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5126.314,
    "end": 5129.258,
    "text": "My founding artifact was the multi-agent system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5129.609,
    "end": 5150.858,
    "text": " and uh i presented my very first thing to members of the scientific advisory board our illustrious director uh daniel and um uh and they let me come and hang out and house my and i've housed my work there ever since um i don't get a chance to participate in stuff because of how exhaustive uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5151.158,
    "end": 5176.238,
    "text": " and uh how much like how passionate dedicated i am to this work so i've like 99.9 of my time is just spent um uh doing this thing so uh yeah i yeah i was really roundabout way and then what i brought was really silly and i still have it still in my coda the my founding artifact like that that multi-agent system that i brought you by the way did you like the agent factory i mean did you get a chance to play with the agent factory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5176.657,
    "end": 5179.101,
    "text": " So your multi-agents can make agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5179.601,
    "end": 5181.083,
    "text": "And your agents can make multi-agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5181.104,
    "end": 5182.265,
    "text": "They can make them do whatever they want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5182.325,
    "end": 5184.148,
    "text": "You don't even have to pay attention now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5184.188,
    "end": 5191.459,
    "text": "If you have an environment and anything happens in that environment that they perceive, they can just make more of themselves or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5191.479,
    "end": 5192.801,
    "text": "So they're like, I'm not good at this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5192.861,
    "end": 5193.982,
    "text": "Or maybe they feel lazy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5194.243,
    "end": 5195.264,
    "text": "Maybe they're overconfident.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5198.569,
    "end": 5198.95,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5199.851,
    "end": 5201.213,
    "text": "Any last comments?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5201.952,
    "end": 5205.818,
    "text": " I'm really grateful for everybody watching this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5205.858,
    "end": 5207.681,
    "text": "I know that I'm not a great communicator.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5207.721,
    "end": 5211.326,
    "text": "It's always been a really huge issue for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5214.451,
    "end": 5217.816,
    "text": "But the work speaks for itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5218.337,
    "end": 5222.323,
    "text": "And I would really hope you guys will engage with the work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5222.59,
    "end": 5233.686,
    "text": " And learn this language so you can have those conversations with it and make beautiful and wonderful things that are, you're going to find out if you go and look and you dig in or ask questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5235.729,
    "end": 5236.85,
    "text": "Just awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5236.91,
    "end": 5238.733,
    "text": "Way more awesome than anything else you can get out there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5239.013,
    "end": 5240.616,
    "text": "So it's a lot of fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5240.656,
    "end": 5241.116,
    "text": "It's all yours.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5242.739,
    "end": 5243.059,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5243.319,
    "end": 5244.061,
    "text": "Acting for surf.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5245.242,
    "end": 5246.043,
    "text": "Yeah, for sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5246.584,
    "end": 5247.205,
    "text": "Talk to you later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5247.245,
    "end": 5247.946,
    "text": "Thank you, Benjamin.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5248.807,
    "end": 5249.188,
    "text": "Bye guys.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5249.288,
    "end": 5250.049,
    "text": "Thank you so much.",
    "speaker": "SPEAKER_00"
  }
]